{
  "session_info": {
    "id": "WEZE",
    "name": "WEZE - Accelerator Applications",
    "url": "https://proceedings.jacow.org/napac2022/html/weze.htm"
  },
  "papers": [
    {
      "paper_id": "WEZE1",
      "title": "Current Status of Developing an Ultrafast Electron Microscope",
      "authors": [
        "X. Yang",
        "T.V. Shaftan",
        "V.V. Smaluk",
        "Y. Zhu",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "ShanghaiTech University",
        "Shanghai",
        "People’s Republic of China",
        "Recent studies of ultrafast electron microscopy (UEM) techniques show the use of short bunches of relativistic electrons are promising for the development of a new instrument for imaging samples of various materials. Compared to conventional electron microscopes",
        "the main advantage of UEMs with the electron energy of a few MeV is the possibility to study thick samples. We will discuss the progress of UEM design to date",
        "the principal challenges on the way to a high resolution",
        "and possible methods for their mitigation including the design of low-aberration magnetic optics",
        "RF and mechanical subsystems with high stability",
        "and precise collimation of electrons scattered in the samples."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weze1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weze1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weze1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEZE1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEZE2",
      "title": "Ultrafast Electron Diffraction at Cornell Using Low Emittance Photocathodes",
      "authors": [
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "A new system for ultrafast electron diffraction has been commissioned at Cornell which uses alkali antimonides photocathode in a 200 keV DC gun. Utilizing a tunable wavelength ultrafast laser source",
        "it is the first photogun to use near-photoemission-threshold drive laser wavelengths in operation",
        "which provides for very low emittance initial conditions. Emittance is preserved in the space charge regime via emittance compensation in conjunction with multipole correction out to sextupole order. The end result is beam quality that provides the ability to study much smaller material samples (down to a few microns across) or to resolve fine features in diffraction space; these are demonstrated via proof of principle experiments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weze2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weze2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weze2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEZE2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEZE3",
      "title": "Compact, High-Power Superconducting Electron Linear Accelerators for MW Industrial Applications",
      "authors": [
        "J.C.T. Thangaraj",
        "R. Dhuley",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Fermilab has developed a novel concept for an industrial electron linac using Nb3Sn coating technology and conduction cooling. We will show the range of multi-cavity linac designs targeted toward various applications. We will also discuss technology development status with results on conduction cooling of SRF cavities based on cryocoolers",
        "which removes the need for liquid Helium",
        "thus making SRF technology accessible to industrial applications. These conduction-cooled linacs can generate electron beam energies up to 10 MeV in continuous-wave operation and can reach higher power (>=1 MW) by combing several modules. Compact and light enough to mount on mobile platforms",
        "our machine is anticipated to enable new in-situ environmental remediation applications such as waste-water treatment for urban areas",
        "X-ray medical device sterilization",
        "and innovative pavement applications. We also show cost-economics and key R&D areas that much be addressed for a practical machine."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weze3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weze3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weze3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEZE3",
      "page_number": "604",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZE4",
      "title": "First High-Gradient Results of UED/UEM SRF Gun at Cryogenic Temperatures",
      "authors": [
        "R.A. Kostin",
        "C. Jing",
        "Euclid Beamlabs",
        "Bolingbrook",
        "USA",
        "D.J. Bice",
        "T.N. Khabiboulline",
        "S. Posen",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Benefiting from the rapid progress on RF photogun technologies in the past two decades",
        "the development of MeV range ultrafast electron diffraction/microscopy (UED and UEM) has been identified as an enabling instrumentation. UEM or UED use low power electron beams with modest energies of a few MeV to study ultrafast phenomena in a variety of novel and exotic materials. SRF photoguns become a promising candidate to produce highly stable electrons for UEM/UED applications because of the ultrahigh shot-to-shot stability compared to room temperature RF photoguns. SRF technology was prohibitively expensive for industrial use until two recent advancements: Nb3Sn and conduction cooling. The use of Nb3Sn allows to operate SRF cavities at higher temperatures (4K) with low power dissipation which is within the reach of commercially available closed-cycle cryocoolers. Euclid is developing a continuous wave (CW)",
        "1.5-cell",
        "MeV-scale SRF conduction cooled photogun operating at 1.3 GHz. In this paper",
        "we present first high gradient results of the gun conducted in liquid helium."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weze4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weze4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weze4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEZE4",
      "page_number": "607",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZE5",
      "title": "Magnetic Flux Expulsion in Superconducting Radio-Frequency Niobium Cavities Made from Cold Worked Niobium",
      "authors": [
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "S. Balachandran",
        "P.J. Lee",
        "NHMFL",
        "Tallahassee",
        "Florida",
        "USA",
        "ASC",
        "Tallahassee",
        "Florida",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Trapped residual magnetic field during the cool down of superconducting radio frequency (SRF) cavities is one of the primary sources of RF residual losses leading to lower quality factor. Historically",
        "SRF cavities have been fabricated from high purity fine grain niobium with grain size ~50 to 100 µm as well as large grain with grain size of the order of few centimeters. Non-uniform recrystallization of fine-grain Nb cavities after the post fabrication heat treatment leads to higher flux trapping during the cool down",
        "and hence the lower quality factor. We fabricated two 1.3 GHz single cell cavities from cold-worked niobium from different vendors and processed along with cavities made from SRF grade Nb. The flux expulsion and flux trapping sensitivity were measured after successive heat treatments in the range 800 to 1000°C. The flux expulsion from cold-worked fine-grain Nb cavities improves after 800°C/3h heat treatments and it becomes similar to that of standard fine-grain Nb cavities when the heat treatment temperature is higher than 900°C."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weze5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weze5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weze5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEZE5",
      "page_number": "611",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZE6",
      "title": "Characterization of the Fields Inside the CO₂-Laser-Driven Wakefield Accelerators Using Relativistic Electron Beams",
      "authors": [
        "SUNY SB",
        "Stony Brook",
        "New York",
        "USA",
        "M. Babzien",
        "M.G. Fedurin",
        "K. Kusche",
        "M.A. Palmer",
        "I. Pogorelsky",
        "M.N. Polyanskiy",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "M. Downer",
        "R. Zgadzaj",
        "The University of Texas at Austin",
        "Austin",
        "Texas",
        "USA",
        "A.S. Gaikwad",
        "V. Litvinenko",
        "N. Vafaei-Najafabadi",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "C. Joshi",
        "W.B. Mori",
        "C. Zhang",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "LLNL",
        "Livermore",
        "USA",
        "SBU",
        "Stony Brook",
        "USA",
        "The CO2 laser at the Accelerator Test Facility of Brookhaven National Laboratory is a unique source generating 2-ps-long",
        "multi-TW pulses in the mid-IR regime. This rapidly evolving system opens an opportunity for the generation of large bubbles in low-density plasmas (~1016 cm-3) that are ideal for acceleration of externally injected electron beams. A new generation of diagnostic tools is needed to characterize the fields inside such structures and to improve the means of external injection. In recent years",
        "the electron beam probing technique has shown to be successful in direct visualization of the plasma wakefields. Here we present a new method utilizing the electron beam probing and Transmission Electron Microscopy (TEM) grids that will allow us to selectively illuminate different portions of the wake and to characterize the electric field strength within the wake based on the location of the focal point of the probe beamlets. The analytical evaluation of the approach and supporting simulation results will be presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weze6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weze6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weze6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEZE6",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:23:45"
}