{
  "session_info": {
    "id": "MOCZB",
    "name": "MOCZB - Timing and Time-resolved Diagnostics",
    "url": "https://proceedings.jacow.org/IBIC2014/html/moczb.htm"
  },
  "papers": [
    {
      "paper_id": "MOCZB1",
      "title": "A Picosecond Sampling Electronic “KAPTURE” for Terahertz Synchrotron Radiation",
      "authors": [
        "C.M. Caselle",
        "M. Brosi",
        "S.A. Chilingaryan",
        "T. Dritschler",
        "N. Hiller",
        "V. Judin",
        "A. Kopmann",
        "A.-S. Müller",
        "L. Petzold",
        "J. Raasch",
        "L. Rota",
        "M. Siegel",
        "N.J. Smale",
        "J.L. Steinmann",
        "M. Vogelgesang",
        "M. Weber",
        "S. Wuensch",
        "KIT",
        "Eggenstein-Leopoldshafen",
        "Germany",
        "For a few years",
        "coherent synchrotron radiation (CSR) generated by short electron bunches has been provided at the ANKA light source. Electron bunches can be filled in up to 184 buckets with a distance between two adjacent bunches of 2 ns corresponding to the RF system frequency of 500 MHz. Arbitrary filling patterns are generated to investigate the interaction of adjacent bunches in CSR. To study the THz emission characteristics over multiple revolutions superconducting YBa2Cu3O7−δ (YBCO) film detectors are used. The intrinsic response time of YBCO thin films is in the order of a few picoseconds only. For fast",
        "continuous sampling of these individual ultra-short terahertz pulses",
        "a novel digitizer system has been developed. The KAPTURE (KArlsruhe Pulse Taking Ultra-fast Readout Electronics) consists of a wideband low-noise amplifier",
        "a picosecond pulse sampling card and a GByte transfer data link back-end readout card. High-end graphic processing units (GPUs) perform real-time data analysis. The KAPTURE system was successfully demonstrated for readout of the intensity fluctuations in the CSR at the ANKA Storage Ring detected in THz range. Four samples are recorded in parallel for each fast pulse with programmable sampling times in the range of 3 to 100 psec. A clean jitter phase locked loop (PLL) provides a clock signal with high temporal accuracy. The back-end card receives the 4 digital samples every 2 ns with 12 bits resolution and transmits the data to the data analysis unit. The readout board is based on programmable logic FPGA and DDR3 memories for on-line data preprocessing and temporary storage. The data is transmitted to the GPU computing node by a fast data transfer links based on a bus master DMA engine connected to PCI express endpoint logic to ensure a continuous high data throughput of up to 4 GByte/s. This heterogeneous real-time system architecture based on FPGA and GPU is used for on-line pulse reconstruction and evaluations and calculates the peak amplitude of each pulse and the time between consecutive bunches with a picosecond time resolution. A Fast Fourier Transform (FFT) is performed on-line for the frequency analysis of the CSR undulations. With the presented acquisition system it was possible to resolve the bursting behavior of single bunches even in a multi-bunch environment to study the bunch-bunch-interactions at ANKA. First results obtained have already been published in the synchrotron machine physic community. The monitoring of bursting for different ANKA parameters using KAPTURE system opens up new analysis and diagnostics possibilities for electron storage rings operating at short bunch lengths."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/moczb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/moczb1.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/moczb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOCZB1",
      "page_number": "24",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCZB2",
      "title": "Reference Distribution and Synchronization System for SwissFEL: Concept and First Results",
      "authors": [
        "S. Hunziker",
        "V.R. Arsov",
        "F. Buechi",
        "M.G. Kaiser",
        "A. Romann",
        "V. Schlott",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "P. Orel",
        "S. Zorzut",
        "I-Tech",
        "Solkan",
        "Slovenia",
        "The development of the reference distribution and synchronization system for SwissFEL is driven by ultra-high reference signal stability of SwissFEL LLRF-",
        "beam arrival time monitors (BAM) and laser systems on one hand and cost issues",
        "high reliability/availability and flexibility on the other. Key requirements are down to sub-10fs rms short term as well as sub-10fs peak-peak long term temporal stability for the most critical clients. The system essentially consists of an optical master oscillator with a fiber power amplifier and splitter",
        "from which mutually phase locked optical reference pulses as well as RF reference signals are derived. The former are directly transmitted to the pulsed laser and BAM clients over group delay stabilized fiber-optic links whereas the latter are transmitted via newly developed group delay stabilized radio-over-fiber (RoF) links. Both s- and c-band reference signals use s-band RoF links",
        "whereupon the c-band receiver incorporates an additional ultra-low drift frequency doubler. Furthermore",
        "ultra-low jitter analog laser phase lock loops have been built and digital ones are under development. We will present concepts and first results of sub-10fs rms jitter and 20fs peak-peak long term drift subsystems",
        "as e.g. RoF links",
        "tested in the SwissFEL injector test facility."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/moczb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/moczb2.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/moczb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOCZB2",
      "page_number": "29",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCZB3",
      "title": "Comparison of Feedback Controller for Link Stabilizing Units of the Laser Based Synchronisation System used at the European XFEL",
      "authors": [
        "M. Heuer",
        "S. Pfeiffer",
        "H. Schlarb",
        "DESY",
        "Hamburg",
        "Germany",
        "HAW",
        "Hamburg",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The European X-ray Free Electron Laser will allow scientists to perform experiments with an atomic scale resolution. To perform time resolved experiments at the end of the facility it is essential to provide a highly stable clock signal to all subsystems. The accuracy of this signal is extremely important since it defines limitations of precise measurement devices. A laser based synchronization system is used for the synchronization with an error in sub-femtosecond range. These light pulses are carried by an optical fiber and exposed to external disturbances which changes the optical length of the fiber. For that reason the up to 4 kilometer long fibers are actively stabilized using a controller implemented on the new MicroTCA Platform. Due to the high computation resources of this platform it is possible to attack the time delay of the link system with well known model based feedback control strategies. This contribution shows the design of a model based controller for such a system and compares the control performance of the previously used PID controller with advanced control algorithms at the currently installed laboratory setup.",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/moczb3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/moczb3.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/moczb3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOCZB3",
      "page_number": "34",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:55:47"
}