{
  "session_info": {
    "id": "MOPJE",
    "name": "MOPJE - Monday Posters (Jefferson)",
    "url": "https://proceedings.jacow.org/IPAC2015/html/mopje.htm"
  },
  "papers": [
    {
      "paper_id": "MOPJE001",
      "title": "Effect on Beam Dynamics From Wakefields in Travelling Wave Structure Excited by Bunch Train",
      "authors": [
        "D. Wang",
        "C.-X. Tang",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "W. Gai",
        "C.-J. Jing",
        "J.G. Power",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "Electron bunch train technology is used to excited coherent high power RF radiation in travelling wave (TW) structures. This article concentrates on the analytical expression of wakefields excited by bunch train in TW structures and the effects of wakefields on beam dynamics. We focus on the first monopole mode and the first dipole mode wakefields. The long range wake function has a linear decrease which agrees well with the ABCi simulations. Taking example of the 11.7 GHz wakefields structure at the Argonne Wakefield Accelerator (AWA) facility",
        "with 1.3 GHz interval drive electron bunch train",
        "we have done the beam dynamics simulation with a point to point (P2P) code. Results shows the effects of wakefields on the energy distribution and the transverse instability for each sub-bunch."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje001.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE001",
      "page_number": "289",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE003",
      "title": "Measuring Duke Storage Ring Lattice Using Tune Based Technique",
      "authors": [
        "W. Li",
        "J.Y. Li",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "H. Hao",
        "W. Li",
        "S.F. Mikhailov",
        "V. Popov",
        "Y.K. Wu",
        "FEL/Duke University",
        "Durham",
        "North Carolina",
        "USA",
        "The Duke electron storage ring is a dedicated driver for oscillator Free-Electron Lasers (FELs). A 34 m long straight section of the storage ring is used to host up to four FEL wigglers in several different configurations. A total of six wigglers",
        "two planar OK-4 wigglers and four helical OK-5 wigglers",
        "are available for FEL research. The storage ring magnetic lattice has to be designed with great flexibility to enable the storage ring operation with different FEL wigglers",
        "at various wiggler settings",
        "and for different electron beam energies. Since 2012",
        "the storage ring has demonstrated all designed characteristics in terms of lattice flexibility and tuning. This work is aimed at gaining better understanding of the real storage ring lattice by performing a series of measurements of the beta-functions along the storage ring. Unlike the LOCO technique",
        "the beta-functions in the quadrupoles are directly measured with good accuracy using a tune meassurement system. We will describe our experimental design and techniques",
        "and measurement procedures. We will also report our preliminary results for the lattice characterization."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje003.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE003",
      "page_number": "293",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE006",
      "title": "Electron Gun Longitudinal Jitter: Simulation and Analysis",
      "authors": [
        "M.S. Liu",
        "Y.L. Chi",
        "S. Pei",
        "Y.F. Suipresenter",
        "IHEP",
        "Bejing",
        "People's Republic of China",
        "The beam longitudinal jitter is fatal not only for the electron beam performance but also for the positron yield in routine operation of the Beijing Electron Positron Collider II (BEPCII) linear accelerator (Linac). Practically",
        "longitudinal jitter has been observed many times which decreased the beam performance. We simulated the electron gun longitudinal jitter effect by PARMELA software in bunch capture process and analyzed its results about beam performance including average energy",
        "energy spread",
        "emittance and longitudinal phase of reference particle. We adjusted the electron gun trigger time during one cycle without changing other parameters. The percentage difference between maximum and minimum of average energy",
        "energy spread",
        "emittance and longitudinal phase of reference particle was 11.3%",
        "42%",
        "98% and 6.4%",
        "respectively. It is observed and analyzed that gun trigger time longitudinal jitter is fatal for maintaining good beam performance. This analysis also gives a salutary lesson to any other longitudinal jitter which can affect the beam bunching in pre-injector ."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje006.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE006",
      "page_number": "297",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE008",
      "title": "Suppression of Microbunching Instability via a Transverse Gradient Undulator",
      "authors": [
        "D. Huang",
        "H.X. Deng",
        "C. Feng",
        "D. Gu",
        "Q. Gu",
        "Z.T. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "The microbunching instability in the linear accelerator (linac) of a free-electron laser facility has always been a problem that degrades the electron beam quality. In this paper",
        "a quite simple and inexpensive technique is proposed to smooth the electron beam current profile to suppress the instability. By directly adding a short undulator with transverse gradient field right after the injector to couple the transverse spread into the longitudinal direction",
        "additional density mixing in the electron beam is introduced to smooth the current profile",
        "which results in the reduction of the gain of the microbunching instability. The magnitude of the density mixing can be easily controlled by turning the strength of the undulator magnet field. Theoretical analysis and numerical simulations demonstrate the capability of the proposed technique in the accelerator of an X-Ray free-electron laser."
      ],
      "institutions": [
        "Funding: the Major State Basic Research Development Program of China (2011CB808300) and the National Natural Science Foundation of China (11275253, 11475250 and 11322550)."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje008.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE008",
      "page_number": "300",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE009",
      "title": "Lattice Design of the SSRF-U Storage Ring",
      "authors": [
        "S.Q. Tian",
        "B.C. Jiang",
        "M.Z. Zhang",
        "Q.L. Zhang",
        "Z.T. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "Multi-Bend Achromatic (MBA) cell has been well known to significantly reduce the beam emittance of the synchrotron radiation light sources in the past two decades. With the great development of the high gradient magnets",
        "the small-aperture vacuum chamber and the precise alignment",
        "the ultimate-emittance ring based on MBA lattice became practical in recent years. We present a preliminary lattice design for the upgraded SSRF storage ring based on a 7BA lattice in this paper. The circumference and the number of the straight sections are preserved for the existing tunnel. The beam energy is reduced to 3 GeV",
        "and the beam emittance is reduced to about 200 pm.rad. The optimized dynamic aperture is about 10 mm in the horizontal plane",
        "and a sufficient beam injection based on the closed orbit bump can be implemented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje009.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE009",
      "page_number": "304",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE015",
      "title": "Compensations of the DEPU Effects at the SSRF Storage Ring",
      "authors": [
        "M.Z. Zhang",
        "B.C. Jiang",
        "J.H. Tan",
        "S.Q. Tian",
        "M. Zhang",
        "Q.L. Zhang",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "A paired APPLE-II type Ellipsoid Polarized Undulator（DEPU）has been installed in the SSRF storage ring which can be mechanically switched between two undulators with difference period length. One of them get notable effects on the optics including CODs",
        "tune",
        "coupling and dynamic aperture. We report in this paper",
        "feed forward tables of correctors",
        "quadrupoles and skew quarupoles are used for the optics correction and sextupole optimization is used for the dynamic aperture recovery."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje015.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE015",
      "page_number": "307",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE016",
      "title": "Start-to-End Simulation for RAON Superconducting Linac",
      "authors": [
        "H. Jang",
        "J.-H. Jang",
        "H. Jinpresenter",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "An ion accelerator",
        "RAON is going to be built in Daejeon",
        "Korea by Rare Isotope Science Project(RISP) team in Institute of Basic Science(IBS). The linac part of RAON consists of two low energy linacs",
        "one high energy linac and two bending section for transporting accelerated low energy ions to high energy linac. It is planned to accelerate many diverse ions like proton",
        "carbon",
        "calcium",
        "uranium",
        "etc. which have different A/q values. Consequently the lattice design for each ion and to investigate beam dynamics issues for each case are one of the important topics for this project. For enhancement of beam acceleration a study to suppress emittance growth and to maximize the longitudinal acceptance is conducted while designing the RAON lattice. In this presentation the designed linac lattices for various ions and start-to-end simulation results will be described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje016.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE016",
      "page_number": "311",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE017",
      "title": "Error Analysis and Correction at the Main LEBT of RAON Heavy Ion Accelerator",
      "authors": [
        "H. Jin",
        "I.S. Hong",
        "H. Jang",
        "J.-H. Jang",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "The main Low Energy Beam Transport (LEBT) section of Rare isotope Accelerator Of Newness (RAON) heavy ion accelerator is designed to transport the ion beams which are generated by Electron Cyclotron Resonance Ion Source (ECR-IS) to the Radio Frequency Quadrupole (RFQ). In the main LEBT",
        "one or two beams are selected among a variety of ion beams to meet the beamline experiment requirements such as beam charge and current. In a uranium beam case",
        "two charge-state",
        "33+ and 34+",
        "beams are chosen and transported to the RFQ. For transportation of two charge-state beams",
        "beams can be seriously affected by dipole kick or unexpected dispersion caused by magnet errors. These effects of magnet or cavity errors lead to beam loss at the main LEBT or RFQ. Therefore",
        "the effect to the beam orbit and size should be identified and the research for reducing such effect should be required in the main LEBT. In this paper",
        "we will examine the orbit distortion and beam size growth caused by magnet errors and discuss the correction of errors by using correctors and BPMs."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje017.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE017",
      "page_number": "314",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE019",
      "title": "Categorization and Estimation of Possible Deformation in Emittance Exchange based Current Profile Shaping",
      "authors": [
        "G. Ha",
        "M.-H. Cho",
        "W. Namkung",
        "POSTECH",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "W. Gai",
        "G. Ha",
        "K.-J. Kim",
        "J.G. Power",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Shaping the current profile is one of the important issues in collinear wakefield acceleration. In the emittance exchange based shaping technique",
        "the shaped current profile seriously depends on the incoming beam and beam line parameters. To design the beam and beam line properly",
        "it is important to estimate the deformation in the shaped current profile. There are several different deformation types whose level depend on deformation parameter. We categorize the possible deformation types and observe the deformation patterns of the current profile depending on its type and the deformation parameter."
      ],
      "institutions": [
        "Funding: This work is partly supported by POSTECH BK21+ program and Argonne National Laboratory"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje019.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE019",
      "page_number": "317",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE020",
      "title": "High Resolution Longitudinal Property Measurement using Emittance Exchange Beam Line",
      "authors": [
        "G. Ha",
        "M.-H. Cho",
        "W. Namkung",
        "POSTECH",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "W. Gai",
        "G. Ha",
        "K.-J. Kim",
        "J.G. Power",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Most of longitudinal measurement techniques introduce the transverse-longitudinal correlation because it is very hard to measure the longitudinal properties directly. This correlation is necessary to observe the longitudinal property through the transverse screen",
        "but initial transverse components of the beam restrict the measurement. It is possible to overcome this intrinsic limit using emittance exchange beam line which makes transverse properties at the downstream only depend on longitudinal properties at the upstream. We present the new idea to measure the longitudinal properties using the emittance exchange beam line and preliminary simulation results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje020.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE020",
      "page_number": "320",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE022",
      "title": "Physical Model of Partial RF Discharge in Isochronous Cyclotrons",
      "authors": [
        "MEPhI",
        "Moscow",
        "Russia",
        "Siemens Medical Solutions Molecular Imaging",
        "Knoxville",
        "TN",
        "USA"
      ],
      "institutions": [],
      "abstract": "The physical model for the partial RF discharge - based on the ionization of molecules of residual gas by electron detachment as a result of the electro-dissociation of negative hydrogen ions in isochronous cyclotrons - is proposed in this paper. The result of the simulation of the ionization of gas molecules by these electrons using RF voltage inside the Eclipse cyclotron (kinetic energy of 11 MeV) is presented. The analysis of the conductivity of the RF plasma (partial RF discharge) is given. The influence of the magnetic field on the properties of the partial RF discharge is discussed. The application of this model is for isochronous cyclotrons with low kinetic energy (10-15 MeV). reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje022.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE022",
      "page_number": "323",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE023",
      "title": "D Computer Simulations of the Ultrarelativistic Beam Dynamics in Super Colliders",
      "authors": [
        "M.A. Boronina",
        "V.A. Vshivkov",
        "ICM&MG SB RAS",
        "Novosibirsk",
        "Russia",
        "ICT SB RAS",
        "Novosibirsk",
        "Russia",
        "The problem of numerical modeling of beam-beam interaction with high relativistic factor (~104) is considered. We present 3D a self-consistent simulation model based on particle-in-cell method. The mixed Euler-Lagrangian decomposition is used in parallel algorithm for achieving good load balancing and reducing communication cost. Stable regimes of beam dynamics",
        "depending on the beams configuration (beta-function",
        "emittance",
        "energy",
        "currents and relative offset) can be found on the base of the model. In the calculations we used 108 particles on the grid 100x100x100",
        "the number of processors depends highly on the beam shape. The Lomonosov Super Computer and Siberian Supercomputer Centre cluster were used to perform the presented simulations."
      ],
      "institutions": [],
      "abstract": "G. Dudnikovapresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE023",
      "page_number": "326",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE026",
      "title": "Revision of the Impedance Model  for the Interpretation of the Single Bunch Measurements at ALBA",
      "authors": [
        "T.F.G. Günzel",
        "U. Iriso",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "Recent measurements showed that the ALBA transverse impedance model was able to explain 65% of the measured single bunch vertical detuning. * This report shows the revision of the impedance model developed to match latest single bunch measurements performed to evaluate the total effective machine impedance and impedance of specific elements",
        "like in-vacuum undulators or a recently installed pinger magnet. The model improvement includes a better bunch length parameterisation",
        "re-calculation of several vacuum chamber elements with Gdfidl",
        "and inclusion of elements neglected so far in the impedance budget. We also show and discuss the computation of the resistive wall impedance using ImpedanceWake2D.",
        "* T.Günzel",
        "U.Iriso",
        "F.Perez",
        "E.Koukovini-Platia",
        "G.Rumolo",
        "\"Analysis of the single bunch measurements at the ALBA Storage Ring\""
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje026.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE026",
      "page_number": "330",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE027",
      "title": "Beam-based Impedance Characterization of the ALBA Pinger Magnet",
      "authors": [
        "U. Iriso",
        "T.F.G. Günzelpresenter",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "H. Bartosik",
        "E. Koukovini-Platia",
        "G. Rumolo",
        "CERN",
        "Geneva",
        "Switzerland",
        "The ALBA pinger magnet consists on two short kickers (for horizontal and vertical planes) installed in a single Titanium coated ceramic vacuum chamber. Single bunch measurements in the vertical plane were performed in the ALBA Synchrotron Light Source before and after the pinger installation",
        "and by comparing the Transverse Mode Coupling Instability (TMCI) thresholds for zero chromaticity",
        "we infer the pinger impedance and compare it with the model predictions. We also perform measurements for negative chromaticities and results are reported in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje027.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE027",
      "page_number": "334",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE028",
      "title": "Detailed Characterization of ALBA Quadrupoles for Beta Function Determination",
      "authors": [
        "Z. Martí",
        "J. Campmany",
        "J. Marcos",
        "V. Massanapresenter",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "Beta function value at quadrupoles for a circular accelerator can be determined using the relationship between the machine tune and the quadrupole strength. ALBA Storage Ring quadrupoles were measured during manufacturing",
        "to be sure that their performance fitted the specifications. However",
        "measurements were done at a number of currents that are not enough for an accurate determination of the beta function value. In fact",
        "at least 1% error in the calibration of the hysteresis curve slope of the quadrupole is required",
        "and therefore new detailed measurements of the hysteresis cycle are needed. In order to make these measurements",
        "spare quadrupoles existing at ALBA have been used. In this paper we present the results of beta function values determination using this method for ALBA storage ring."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje028.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE028",
      "page_number": "338",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE029",
      "title": "A Linear Accelerator Simulation Framework",
      "authors": [
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "IFIC",
        "Valencia",
        "Spain",
        "CERN",
        "Geneva",
        "Switzerland",
        "University of Oslo",
        "Oslo",
        "Norway",
        "Many good tracking tools are available for simulations for linear accelerators. However",
        "several simple tasks need to be performed repeatedly",
        "like lattice definitions",
        "beam setup",
        "output storage",
        "etc. In addition",
        "complex simulations can become unmanageable quite easily. A high level layer would therefore be beneficial. We propose LinSim",
        "a linear accelerator framework with the codes PLACET and Guinea-Pig. It provides a documented well-debugged high level layer of functionality. Users only need to provide the input settings and essential code and/or use some of the many implemented imperfections and algorithms. It can be especially useful for first-time users. Currently the following accelerators are implemented: ATF2",
        "ILC",
        "CLIC and FACET. This paper discusses the framework design and shows its strength in some condensed examples."
      ],
      "institutions": [],
      "abstract": "N. Fuster-Martinezpresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje029.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE029",
      "page_number": "341",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE030",
      "title": "Non-linear Dynamics model for the ESS Linac Simulator",
      "authors": [
        "ESS",
        "Lund",
        "Sweden",
        "The ESS Proton Linac will run a beam with 62.5 mA of current. In the first meters of the accelerator",
        "the non- linear space-charge force dominates the dynamics of the beam. The Drift Tube Linac",
        "the Spoke resonators and the elliptical cavities",
        "which are responsible for the 99.8% of the total energy gained by the beam along the accelerator",
        "produce a significant longitudinal non-linear force on the proton beam. In this paper",
        "we introduce a new theory to transport the probability density function of the beam under the effect of non-linear forces. A model based on this theory can be implemented in the ESS Linac Simulator for the fast simulations to be performed during the operations of the proton Linac."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje030.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE030",
      "page_number": "345",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE031",
      "title": "Field Map Model for the ESS Linac Simulator",
      "authors": [
        "ESS",
        "Lund",
        "Sweden",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "The proton beam driving the spallation process at the European Spallation Source",
        "in Lund",
        "will be accelerated and delivered onto a tungsten target by a linac. This linac is composed of four different families of accelerating structures: adrift tube linac",
        "a section of spoke resonators and two sections of elliptical cavities for the particles’ medium and high relativistic β. These structures provide 99.8% of the total energy gained by the beam along the accelerator. It is necessary",
        "then",
        "to have an accurate model describing the physics of the cavities in the ESS Linac Simulator (ELS)",
        "which isthe online model that will simulate the accelerator during operation. Here",
        "we present an RF-cavity model based on the field maps that we implemented in ELS",
        "showing a maximum 10% deviation from TraceWin in the horizontal",
        "vertical and longitudinal planes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje031.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE031",
      "page_number": "348",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE032",
      "title": "A Steering Study for the ESS Normal Conducting Linac",
      "authors": [
        "ESS",
        "Lund",
        "Sweden",
        "Construction of the European Spallation Source is rapidly progressing in Lund",
        "Sweden",
        "and preparations for commissioning of its proton linac has been underway for some time now. Accurate adjustment of accelerator components to achieve ideal beam parameters is the key to maximizing performance and safe operation for any machine. This paper presents a study of beam steering for the normal conducting part of the proton linac of ESS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje032.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE032",
      "page_number": "351",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE033",
      "title": "Coupled Orbit Response Coefficients with Constant Revolution Time",
      "authors": [
        "Uppsala University",
        "Uppsala",
        "Sweden"
      ],
      "institutions": [],
      "abstract": "We calculate orbit response coefficients for arbitrarily coupled lattice which keep the orbit length constant as is needed to maintain synchronicity with a radio-frequency system. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje033.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE033",
      "page_number": "354",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE034",
      "title": "Low Emittance Tuning for the CLIC Damping Rings",
      "authors": [
        "J. Alabau-Gonzalvo",
        "F. Antonioupresenter",
        "Y. Papaphilippou",
        "CERN",
        "Geneva",
        "Switzerland",
        "A study on the sensitivity of the CLIC Damping Ring lattice to different sources of misalignment is presented. Dipole and quadrupole rolls",
        "quadrupole and sextupole vertical offsets are considered",
        "as well as the impact of a finite BPM resolution. The result of this study defines a low emittance tuning procedure and establishes alignment tolerances to preserve the vertical emittance below the design value (1 pm·rad). Non-linear dynamics studies including dynamic aperture and frequency maps are shown and synchrotron radiation effects are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje034.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE034",
      "page_number": "356",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE035",
      "title": "An Extended SPS Longitudinal Impedance Model",
      "authors": [
        "J.V. Campelo",
        "T. Argyropoulos",
        "T. Bohl",
        "F. Caspers",
        "J.F. Esteban Müller",
        "J.B. Ghini",
        "A. Lasheen",
        "D. Quartullo",
        "B. Salvant",
        "E.N. Shaposhnikova",
        "C. Zannini",
        "CERN",
        "Geneva",
        "Switzerland",
        "Longitudinal multi-bunch instability in the CERN SPS with a very low intensity threshold is a serious limitation for the future doubling of bunch intensity required by Hi-Lumi LHC project. A complete and accurate impedance model is essential to understand the nature of this instability and to plan possible cures. This contribution describes in detail the current longitudinal impedance model of the SPS. Recently",
        "the model was updated with new findings and includes now the impedance of accelerating cavities",
        "kicker and septum magnets",
        "beam position monitors",
        "vacuum Flanges",
        "shielded and unshielded pumping ports",
        "electrostatic septa and resistive wall. Electromagnetic simulations and bench measurements were used to build the model. The contribution from each element is described and compared to the total machine impedance. Together with relevant beam measurements and simulations",
        "the analysis of the different sources of impedance is used to identify the source of the longitudinal instability limiting the SPS performance so that the responsible elements can be acted upon."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje035.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE035",
      "page_number": "360",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE036",
      "title": "Longitudinal Impedance Characterization of the CERN SPS Vacuum Flanges",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "This contribution describes the thorough studies carried out to characterize the longitudinal impedance of the CERN SPS vacuum flanges",
        "which are believed to be the main source of LHC beam instability. Around 500 high-impedance flanges of 8 different types have been identified. Three factors play an important role in the characterization of these flanges: the type of vacuum chambers that the flange interconnects",
        "whether or not both sides are electrically isolated (by means of an enamel coating) and",
        "finally",
        "the presence of damping resistors which damp high-Q resonances. Not only",
        "full-wave electromagnetic field simulations",
        "but also RF measurements have been used to evaluate the impedance of these elements. The R/Q of the relevant resonances was measured using the well-known bead-pull technique. In particular",
        "a subset of around 150 flanges has been found to be the source of a high-impedance resonance at 1.4 GHz",
        "also observed in beam measurements. Guidelines on how to reduce the impedance of these elements are also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje036.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE036",
      "page_number": "363",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE037",
      "title": "Study and Comparison of Mode Damping Strategies for the UA9 Cherenkov Detector Tank",
      "authors": [
        "A. Danisi",
        "F. Caspers",
        "R. Losito",
        "A. Masi",
        "B. Salvant",
        "C. Vollinger",
        "CERN",
        "Geneva",
        "Switzerland",
        "T. Demma",
        "P. Lepercq",
        "LAL",
        "Orsay",
        "France",
        "In the framework of the UA9 experiment",
        "the Cherenkov detector is useful to measure the amount of particles deflected by a bent crystal",
        "proving the crystal collimation principle. The tank used to host this device is taken as a case study for an in-depth analysis of different damping strategies for electromagnetic modes which otherwise would give rise to important beam-coupling impedance contributions. Such strategies involve the use of ferrite",
        "damping resistors and a mode-coupler",
        "a solution which intercepts the modes inside the cavity but damps the related power outside the vacuum tank (potentially avoiding heating). Such solutions are discussed through experimental measurements and the relative quality factor is taken as a figure of merit."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje037.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE037",
      "page_number": "366",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE038",
      "title": "Impedance Studies of the LHC Injection Kicker Magnets for HL-LHC",
      "authors": [
        "H.A. Day",
        "M.J. Barnes",
        "L.M.C. Felicianopresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "The LHC injection kicker magnets (MKIs) experienced strong heating during the first operational run",
        "identified as being caused by power loss due to wakefields induced by stored beam. Studies of the beam coupling impedance of the beam screen",
        "a series of conductors embedded in a ceramic tube placed in the ferrite yoke to screen the ferrite from the beam",
        "resulted in new design offering improved screening: this is predicted to reduce the heating to acceptable levels for operation with 25ns beam during Run 2 of the LHC. However higher beam intensities proposed for HL-LHC operation are predicted to again cause strong heating to occur. Further studies have been carried out to reduce the beam induced power loss by optimising the beam screen design",
        "some key results and findings of which are presented here."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje038.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE038",
      "page_number": "370",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE039",
      "title": "Generalised Truncated Power Series Algebra for Fast Particle Accelerator Transport Maps",
      "authors": [
        "L. Deniau",
        "C.I. Tomoiagă",
        "CERN",
        "Geneva",
        "Switzerland",
        "New Generalised Truncated Power Series Algebra (TPSA) has been developed for extending",
        "simplifying and optimising the transport maps used by particle accelerator simulation codes. TPSA are intensively used in optics code to describe transport maps of the elements constituting the particle accelerator to any order. Generalised TPSA extend the degrees to inhomogeneous ones",
        "where separate degrees can be specified for each variables and constrained by two total orders",
        "one for canonical variables and one for ordinary variables. This allows to track inhomogeneous planes of the 6D phase space with many extra variables. A complete set of new formulas and data structures have been derived to address the problem of memory consumption required for efficient computation of high order TPSA",
        "including generalised indexing",
        "multiplication and composition of inhomogeneous multivariate polynomials. The implementation has been benchmarked against well established libraries for the common subset with TPSA",
        "and outperforms all of them for supported differential algebra operators on low and high orders",
        "and high number of variables."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje039.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE039",
      "page_number": "374",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE042",
      "title": "Longitudinal Injection Schemes For the CERN PS Booster at 160 MeV Including Space Charge Effects",
      "authors": [
        "V. Forte",
        "E. Benedetto",
        "A.M. Lombardi",
        "D. Quartullo",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the frame of the LHC Injectors Upgrade project",
        "the CERN PS Booster will be equipped with a H− injection system at 160 MeV to tailor the initial transverse and longitudinal profiles. We are here reviewing the different multi-turn longitudinal injection schemes",
        "from the beam dynamics point of view",
        "taking into account the needs of the large variety of the PSB users",
        "spanning in intensity from 5·109 to about 1.6·1013 protons per bunch. The baseline of the longitudinal injection has always been the longitudinal stacking with central energy modulation: this scheme has the advantage of filling uniformly the RF bucket and mitigate transverse space charge",
        "but it requires at least 40 turns of injection. A simpler injection protocol without energy modulation is here analyzed in detail to find the optimum initial conditions in terms of bucket filling and reduction of transverse and longitudinal space charge effects",
        "with the advantage of minimizing the number of turns for the LHC beams. Simulations with space charge of the longitudinal injection process from different Linac4 trains are presented to fix possible longitudinal injection scenarios during the future commissioning and operation with Linac4."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje042.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE042",
      "page_number": "378",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE043",
      "title": "Design and Optimization of Electrostatic Deflectors for ELENA",
      "authors": [
        "University of Tokyo",
        "Tokyo",
        "Japan",
        "W. Bartmann",
        "M.A. Fraserpresenter",
        "R. Ostojić",
        "CERN",
        "Geneva",
        "Switzerland",
        "The ELENA ring will decelerate the antiprotons ejected from the Antiproton Decelerator (AD) at 5.3 MeV down to 100 keV kinetic energy. The slow antiprotons will be delivered to experiments using electrostatic beamlines",
        "consisting of quadrupoles",
        "correctors and deflectors. An extensive simulation study was carried out to find solutions to minimize the aberrations of the deflectors. These solutions will be presented together with the actual design of these devices."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje043.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE043",
      "page_number": "382",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE044",
      "title": "Beam Dynamics Studies of the ELENA Electrostatic Transfer Lines",
      "authors": [
        "M.A. Fraser",
        "W. Bartmann",
        "R. Ostojić",
        "CERN",
        "Geneva",
        "Switzerland",
        "University of Tokyo",
        "Tokyo",
        "Japan",
        "The low-energy ELENA ring at the Antiproton Decelerator (AD) facility at CERN will lower the kinetic energy of antiproton beams from 5.3 MeV to 100 keV",
        "significantly increasing the antiproton trapping efficiency at the experiments. The antiprotons from ELENA will be distributed to two experimental areas housing several different experiments through a system of electrostatic transfer lines totalling 90 m in length. A significant optimisation of the electrostatic optical elements (deflectors",
        "quadrupoles",
        "and correctors) has been carried out to improve the beam quality delivered to the experiments and facilitate installation of the beam lines into the AD hall. A general overview of the beam optics is presented",
        "including end-to-end particle tracking and error studies from the extraction point in the ELENA ring to the experiments."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje044.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE044",
      "page_number": "385",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE045",
      "title": "Fixed Points in Presence of Space Charge in Circular Particle Accelerators",
      "authors": [
        "M. Giovannozzi",
        "S.S. Gilardonipresenter",
        "A. Huschauer",
        "CERN",
        "Geneva",
        "Switzerland",
        "S. Machida",
        "C.R. Prior",
        "S.L. Sheehy",
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "Recent measurements performed in the framework of the multi-turn extraction (MTE) studies showed a dependence of the position of beamlets obtained by crossing a stable transverse resonance on the total beam intensity. This novel observation has triggered a number of studies aiming at understanding the source of the observed effect. In this paper the results of numerical simulations performed in different conditions are discussed in detail. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE045",
      "page_number": "389",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE046",
      "title": "Influence of the Alignment of the Main Magnets on Resonances in the CERN Proton Synchrotron",
      "authors": [
        "A. Huschauer",
        "S.S. Gilardoni",
        "R. Wasef",
        "CERN",
        "Geneva",
        "Switzerland",
        "During the Long Shutdown 1 seven out of the one hundred combined function PS main magnets were removed from the tunnel to conduct maintenance. After reinstallation",
        "the main magnets were aligned to the reference positions and within the first week of operation of the accelerator",
        "a beam-based re-alignment campaign was performed to reduce the excursions of the closed orbit. In order to further investigate and understand the source of betatronic resonances",
        "which",
        "already in 2011",
        "were found to be excited by the bare machine",
        "tune diagram measurements before and after this beam-based magnet alignment were conducted. In both cases the same resonances as in 2011 were found to be present; however",
        "after the alignment",
        "an overall increase of their strengths was observed. In this paper we present the corresponding measurement results and discuss the direct impact on the daily operation of the accelerator."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE046",
      "page_number": "392",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE047",
      "title": "Chromaticity Dependence of the Transverse Effective Impedance in the CERN Proton Synchrotron",
      "authors": [
        "S. Persichelli",
        "N. Biancacci",
        "S.S. Gilardoni",
        "A. Huschauerpresenter",
        "E. Métral",
        "B. Salvant",
        "R. Wasef",
        "CERN",
        "Geneva",
        "Switzerland",
        "University of Rome La Sapienza",
        "Rome",
        "Italy",
        "The current knowledge of the transverse impedance of the Proton Synchrotron (PS) has been established with beam-based measurements at different energies. The transverse coherent tune shift as a function of the beam intensity has been measured in order to evaluate the total effective imaginary part of the transverse impedance and its localization in the accelerator at the energies of 2",
        "7",
        "13 and 25 GeV. Measurements have been performed changing the chromaticity for every tune shift scan with intensity. The data analysis revealed an increase of impedance with chromaticity for all the energies considered. That transverse impedance can be compared with the previously evaluated theoretical impedance budget taking into account the individual contribution of several machine devices. The missing impedance is finally highlighted."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje047.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE047",
      "page_number": "395",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE048",
      "title": "Electron-Cloud Studies for Transversely Split Beams",
      "authors": [
        "N. Pradhan",
        "S.S. Gilardoni",
        "M. Giovannozzi",
        "G. Iadarolapresenter",
        "G. Rumolo",
        "CERN",
        "Geneva",
        "Switzerland",
        "UMiss",
        "University",
        "Mississippi",
        "USA",
        "Recently",
        "resonance crossing has been proposed as a means of manipulating the transverse beam distribution. This technique has application",
        "among other topics",
        "to injection and extraction schemes. Moreover",
        "the transversely split beams might also be used as a mitigation measure of electron-cloud effects. The results of detailed numerical simulations are discussed in this paper",
        "possibly opening new options for scrubbing of beam pipes in circular accelerators."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje048.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE048",
      "page_number": "399",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE049",
      "title": "Benchmarking the CERN-SPS Transverse Impedance Model with Measured Headtail Growth Rates",
      "authors": [
        "C. Zannini",
        "H. Bartosik",
        "G. Iadarolapresenter",
        "G. Rumolo",
        "B. Salvant",
        "CERN",
        "Geneva",
        "Switzerland",
        "The latest SPS transverse impedance model includes kicker magnets",
        "wall impedance",
        "transition pieces (e.g. flanges and vacuum chamber discontinuities)",
        "beam position monitors and RF cavities. The model has already been successfully benchmarked against coherent tune shift and transverse mode coupling instability measurements. In this paper we present measurements of the headtail growth rates for a wide range of negative chromaticities and for two different configurations of machine optics (nominal and low gamma transition). The measurement results are compared with HEADTAIL simulations using the wake fields obtained from the SPS transverse impedance model."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje049.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE049",
      "page_number": "402",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE050",
      "title": "Transverse Impedance Model of the CERN-PSB",
      "authors": [
        "C. Zannini",
        "G. Iadarolapresenter",
        "K.S.B. Li",
        "T.L. Rijoff",
        "G. Rumolo",
        "CERN",
        "Geneva",
        "Switzerland",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "In the framework of the PS-Booster upgrade project an accurate impedance model is needed in order to determine the effect on the beam stability and assess the impact of the new devices before installation in the machine. This paper describes the PSB impedance model which includes resistive wall",
        "indirect space charge",
        "flanges",
        "step transitions",
        "ejection kicker including cables",
        "injection kickers and cavities. Each impedance contribution has been computed for different energies in the PSB cycle. Measurements of the coherent tune shifts have been performed and compared to calculations based on the impedance model."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje050.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE050",
      "page_number": "406",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE051",
      "title": "Effect of Electron Cloud in Quadrupoles on Beam Instability",
      "authors": [
        "G. Iadarola",
        "A.P. Axford",
        "H. Bartosik",
        "K.S.B. Li",
        "G. Rumolo",
        "CERN",
        "Geneva",
        "Switzerland",
        "Both simulations and machine experience at the CERN-SPS and LHC have shown that the electron cloud has a lower build up threshold in quadrupoles than in dipoles and field free regions. As a consequence",
        "while beam induced scrubbing can efficiently suppress the electron cloud in both dipoles and field free regions",
        "a residual electron cloud can still survive in the quadrupoles and potentially degrade the beam quality. To study this effect",
        "a PyECLOUD module for electron tracking in quadrupole fields including effects of secondary emission at the vacuum chamber has been implemented in PyHEADTAIL. With this module",
        "the effect of the electron cloud in quadrupoles on beam stability and beam quality preservation can be assessed",
        "as well as its impact on future LHC and HL-LHC operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje051.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE051",
      "page_number": "409",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE052",
      "title": "Observations of an Anomalous Octupolar Resonance in the LHC",
      "authors": [
        "F.S. Carlier",
        "J.M. Coello de Portugal",
        "A. Langner",
        "E.H. Maclean",
        "T. Perssonpresenter",
        "R. Tomás",
        "R. Westenberger",
        "CERN",
        "Geneva",
        "Switzerland",
        "While linear LHC dynamics is mostly understood and under control",
        "non-linear beam dynamics will play an increasingly important role in the challenging regimes of future LHC operation. In 2012",
        "turn-by-turn measurements of large betatron excitations of LHC Beam 2 at injection energy were carried out. These measurements revealed an unexpectedly large spectral line in the horizontal motion with frequency Qx+2Qy. Detailed analyses and simulations are presented to unveil the nature of this spectral line."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje052.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE052",
      "page_number": "412",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE053",
      "title": "NSLS-II Beam Lifetime Measurements and Modeling",
      "authors": [
        "B. Podobedov",
        "W.X. Cheng",
        "Y. Hidaka",
        "H.-C. Hseuh",
        "G.M. Wangpresenter",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "NSLS-II is a recently constructed 3 GeV synchrotron light source with design horizontal emittance values in sub-nm range. Achieving good beam lifetime is critically important for NSLS-II as it is closely tied in to such important operational aspects as top-off injection frequency",
        "injector components wear",
        "radiation protection and control",
        "and others. In this paper we present lifetime-related commissioning results",
        "describe our present understanding of beam lifetime at NSLS-II and extrapolate our models to the fully built-up machine operating at 500 mA design beam current."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje053.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE053",
      "page_number": "416",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE054",
      "title": "Developments of the Segment-by-Segment Technique for Optics Corrections in the LHC",
      "authors": [
        "A. Langner",
        "J.M. Coello de Portugal",
        "P.K. Skowroński",
        "R. Tomás",
        "CERN",
        "Geneva",
        "Switzerland",
        "Optics correction algorithms will become even more critical for the operation of the LHC at 6.5 TeV. For the computation of local corrections the segment-by-segment technique is used. We present improvements to this technique and an advanced error analysis",
        "which increase the sensitivity for finding local corrections. Furthermore",
        "we will investigate limitations of this method for lower beta-star optics as they will be used in the high-luminosity LHC (HL-LHC) upgrade."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje054.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE054",
      "page_number": "419",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE055",
      "title": "Design of an Intense Muon Source with a Carbon and Mercury Target",
      "authors": [
        "D. Stratakis",
        "J.S. Berg",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "In high-intensity sources",
        "muons are produced by firing high energy protons onto a target to produce pions. The pions decay to muons which are captured and accelerated. In the present study",
        "we examine the performance of the channel for two different target scenarios: one based on liquid mercury and another one based on a solid carbon target. We produce distributions with the two different target materials and discuss differences in particle spectrum near the sources. We then propagate the distributions through our capture system and compare the full system performance for the two target types."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje055.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE055",
      "page_number": "423",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE056",
      "title": "OMC Software Improvements in 2014",
      "authors": [
        "J.M. Coello de Portugal",
        "F.S. Carlier",
        "A. Langnerpresenter",
        "T. Persson",
        "P.K. Skowroński",
        "R. Tomás",
        "CERN",
        "Geneva",
        "Switzerland",
        "We present the LHC Optics Measurement and Corrections (OMC) software developments done during 2014 on stability",
        "performance and usability. This software is used to analyze turn-by-turn data and compute optics corrections to get the best performance of the LHC. The main developments have been an automatic local correction script to get faster and more accurate corrections in the interaction regions",
        "a self contained test for the whole software package to avoid mistakes during the software development and the improvements in the software quality and efficiency of the Segment by Segment technique script. We also present a study of the code quality in its current status."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje056.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE056",
      "page_number": "426",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE057",
      "title": "Optics Measurement using the N-BPM Method for the ALBA Synchrotron",
      "authors": [
        "A. Langner",
        "J.M. Coello de Portugal",
        "R. Tomás",
        "CERN",
        "Geneva",
        "Switzerland",
        "G. Benedetti",
        "M. Carlà",
        "U. Iriso",
        "Z. Martí",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "The N-BPM method recently developed for the LHC has significantly improved the precision of optics measurements which are based on beam position monitor (BPM) turn-by-turn data. The main improvement is owed to the consideration of correlations for statistical and systematic error sources",
        "as well as increasing the amount of BPM combinations for one measurement. We present how this technique can be applied at light sources like ALBA",
        "and compare the results with other methods."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje057.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE057",
      "page_number": "430",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE058",
      "title": "FLUKA Modeling of the ESS Accelerator",
      "authors": [
        "L. Lari",
        "M. Eshraqi",
        "L.S. Esposito",
        "L. Tchelidze",
        "ESS",
        "Lund",
        "Sweden",
        "F. Cerutti",
        "L.S. Esposito",
        "L. Lari",
        "A. Mereghetti",
        "CERN",
        "Geneva",
        "Switzerland",
        "In order to evaluate the energy deposition and radiation issues concerning the ESS accelerator",
        "a FLUKA model of the machine has been created. The geometry of the superconducting beam line is built according to the machine optics",
        "described in the TraceWin file and the CATIA drawings of the beam elements",
        "using the LineBuilder tool developed at CERN. The objective is to create a flexible FLUKA model that is able to be adapted to the optimization of the optics",
        "design modifications and machine integration constraints. Preliminary results are also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje058.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE058",
      "page_number": "434",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE059",
      "title": "Tests of Wakefield-Free Steering at ATF2",
      "authors": [
        "A. Latina",
        "J. Pfingstner",
        "D. Schulte",
        "CERN",
        "Geneva",
        "Switzerland",
        "University of Oslo",
        "Oslo",
        "Norway",
        "IFIC",
        "Valencia",
        "Spain",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "Charge-dependent effects on the orbit and on the beam size affect the performance of the Accelerator Test Facility (ATF2) in a non-negligible way. Until now small beam sizes have only been achieved running with a beam charge significantly smaller than the nominal value. These detrimental effects on the beam have been attributed to wakefields",
        "in the cavity BPMs",
        "in the multi-Optical Transition Radiation (OTR) systems as well as in other components of the beamline. The successful tests of a Wakefield-free Steering (WFS) algorithm at FACET have encouraged performing tests of the same correction scheme at ATF2. The performance of the algorithm has been simulated in detail",
        "including several realistic imperfection scenarios",
        "including charge-dependent BPMs resolution",
        "and incoming injection error and position jitters",
        "which are described in this paper. Tests of WFS have been performed at ATF2 during December 2014. The results are discussed here."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje059.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE059",
      "page_number": "438",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE060",
      "title": "BBA and Coupling Correction at CLIC RTML",
      "authors": [
        "Y. Han",
        "L. Ma",
        "SDU",
        "Shandong",
        "People's Republic of China",
        "A. Latinapresenter",
        "D. Schulte",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CLIC Ring To Main Linac (RTML) must transport the electron and the positron bunches through more than 20 km of beamlines with minimal emittance growth. The turnaround loops (TAL) are one of the most critical sections",
        "featuring a lattice designed to minimize emittance growth due to synchrotron radiation emission and chromaticity",
        "while being isochronous to avoid bunch lengthening. With such a design",
        "the impact of static imperfections like element misalignment is particularly critical. In this paper a study of the Beam-Based Alignment (BBA) techniques in the TAL of the CLIC RTML is presented. In order to reduce the emittance growth",
        "the one-to-one and dispersion-free corrections have been tested. The results showed that the emittance growth budgets can be met both in the horizontal and vertical planes. The impact of coupling errors due to magnets rolls on the emittance has also been studied and a coupling correction section has been designed and inserted in the lattice."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje060.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE060",
      "page_number": "442",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE062",
      "title": "Testing Aspects of Advanced Coherent Electron Cooling Technique",
      "authors": [
        "V. Litvinenko",
        "Y.C. Jing",
        "I. Pinayev",
        "G. Wang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "SBU",
        "Stony Brook",
        "USA",
        "An advanced version of the coherent-electron cooling based on the microbunching instability was proposed in *. This approach promised to significantly increase the bandwidth of the system and",
        "therefore",
        "significantly shorter cooling time in high energy hadron colliders. In this paper we present our plans of simulating and testing the key aspects of this proposed technique using the set-up of the coherent-electron-cooling proof-of-principle experiment at BNL.",
        "* D.F. Ratner",
        "Phys. Rev. Lett. 111",
        "084802 (2013)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje062.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE062",
      "page_number": "445",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE063",
      "title": "Orbit Correction in the CERN PS Booster",
      "authors": [
        "M. McAteer",
        "E. Benedetto",
        "C. Carli",
        "G.P. Di Giovanni",
        "B. Mikulec",
        "R. Tomás",
        "CERN",
        "Geneva",
        "Switzerland",
        "Prior to the Long Shutdown of 2013-2014 (LS1)",
        "control of the closed orbit in the four rings of the CERN PS Booster (PSB) was achieved by adjusting the alignment of several focusing quadrupoles. After a set of orbit corrector dipoles was installed",
        "a major realignment campaign was undertaken to remove these intentional quadrupole offsets and any other magnet misalignments. This paper summarizes the effects of the magnet realignment on the closed orbit in the PSB and the results of closed orbit correction with corrector dipoles."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje063.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE063",
      "page_number": "449",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE064",
      "title": "Beam Impedance Optimization of the TOTEM Roman Pots",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "The TOTEM experiment has been designed to measure the total proton-proton cross section and to study elastic and diffractive scattering at the LHC energy. The measurement requires detecting protons at distances as small as 1 mm from the beam center: TOTEM uses Roman Pots (RP)",
        "special beam pipe insertions",
        "to move silicon detectors close to the beams to detect particles very near the beam axis. In the first period of running of the LHC no problems were detected with retracted Roman Pots and during insertions in special runs; however",
        "during close insertions to highest intensity beam",
        "impedance heating has been observed. After the LS1 the LHC beam current will increase and the equipment that can interact with the beam needed to be optimized. A new RP",
        "optimized to minimize the beam coupling",
        "has been designed with the help of CST Particle Studio; a prototype has been used to test the simulation results in the laboratory with wire and probe measurements. Furthermore",
        "in both the old and the new RPs",
        "new ferrites have been installed. The new ferrite material has a higher Curie temperature than the one used before LS1 and a thermal treatment at 1000°C has been applied to reduce the out-gassing."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje064.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE064",
      "page_number": "452",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE065",
      "title": "Contribution of Optical Aberrations to Spot-size Increase with Bunch Intensity at ATF2",
      "authors": [
        "M. Patecki",
        "R. Tomás",
        "F. Zimmermann",
        "CERN",
        "Geneva",
        "Switzerland",
        "K. Kubo",
        "S. Kuroda",
        "T. Naito",
        "T. Okugi",
        "T. Tauchi",
        "N. Terunuma",
        "KEK",
        "Ibaraki",
        "Japan",
        "Warsaw University of Technology",
        "Warsaw",
        "Poland",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "A primary goal of ATF2 (Accelerator Test Facility) is to demonstrate a low vertical beam size at the interaction point (IP) of about 37 nm. Measurements over the past years indicate that the ATF2 vertical beam size strongly rises with bunch intensity. Several different origins of this increase are considered",
        "e.g. wakefields occurring between the ATF damping ring and the IP",
        "and/or intrabeam scattering (IBS) causing the increase of transverse emittances and energy spread in the damping ring with the increase of the bunch intensity. In this paper we address the second possibility. Past measurements and simulations of the IBS effects in the ATF are used to model the intensity-dependent initial emittances and energy spread at the entrance of the final focus. Particle tracking simulations predict the IP vertical beam size growth expected from the known optical aberrations for initial beam parameters corresponding to varying bunch intensities. Comparing simulation results with emittance measurements at different locations allows us to draw some conclusions about the impact of IBS in the damping ring on the IP spot size",
        "and about possible single-bunch wakefields in the ATF2."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje065.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE065",
      "page_number": "455",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE066",
      "title": "Single and Multi-bunch End-to-end Tracking in the LHeC",
      "authors": [
        "D. Pellegrini",
        "A. Latina",
        "D. Schulte",
        "CERN",
        "Geneva",
        "Switzerland",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The LHeC study aims at delivering an electron beam for collision with the LHC proton beam. The current baseline design consists of a multi-pass superconductive energy-recovery linac operating in a continuous wave mode. The high current beam (~100 mA) in the linacs excites long-range wake-fields between bunches of different turns",
        "which induce instabilities and might cause beam losses."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje066.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE066",
      "page_number": "459",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE067",
      "title": "Applications of",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje067.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE068",
      "title": "",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje068.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE069",
      "title": "General Functionality for Turn-Dependent Element Properties in SixTrack",
      "authors": [
        "K.N. Sjobak",
        "H. Burkhardt",
        "R. De Maria",
        "A. Mereghetti",
        "A. Santamaría García",
        "CERN",
        "Geneva",
        "Switzerland",
        "In order to facilitate studies of how dynamically changing element attributes affect the dynamics of the beam and beam losses",
        "the functionality for dynamic kicks (DYNK) of SixTrack has been significantly extended. This functionality can be used for the simulation of dynamic scenarios",
        "such as when crab cavities are switched on",
        "orbit bumps are applied",
        "optics are changed",
        "or failures occur. The functionality has been extended with a more general and flexible implementation",
        "such that arbitrary time-dependent functions can be defined and applied to different attributes of families or individual elements",
        "directly from the user input files. This removes the need for source code manipulation",
        "and it is compatible with LHC@Home which offers substantial computing resources from volunteers. In this paper",
        "the functionality and implementation of DYNK is discussed",
        "along with examples of application to the HL-LHC crab cavities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje069.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE069",
      "page_number": "468",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE070",
      "title": "Reduction of Electron Cloud in Particle Accelerator Beampipes Studied by RF Multipacting",
      "authors": [
        "R. Leber",
        "F. Caspers",
        "P. Costa Pinto",
        "M. Taborellipresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "For a given beam structure",
        "chamber geometry and magnetic field configuration",
        "the electron cloud (EC) intensity depends on the Secondary Electron Yield (SEY) of the beam pipe. The reduction of the EC density as a function of machine operation time (scrubbing) is attributed to the growth of a low SEY carbon film induced by electron bombardment. In this paper",
        "we study the time evolution of the conditioning of stainless steel beam pipes in a laboratory setup. The EC or multipacting is induced by Radio-Frequency (RF) fields in a coaxial resonator under vacuum. Strip detectors are used to monitor the current of the EC. Induced pressure rise is simultaneously detected. The multipacting intensity shows a linear dependence on the positive DC bias voltage up to 1000 V",
        "applied to the central electrode. An accelerated conditioning is observed for the applied bias voltage. The SEY of samples exposed to the EC is measured and the surface composition is monitored by X-ray Photoelectron Spectroscopy. The measured SEY",
        "surface composition and multipacting behaviour are well correlated. The injection of acetylene and dodecane during multipacting proved to be ineffective in the conditioning."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje070.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE070",
      "page_number": "472",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE071",
      "title": "New Electron Cloud Detectors for the CERN Proton Synchrotron",
      "authors": [
        "C. Yin Vallgren",
        "P. Chiggiato",
        "S.S. Gilardoni",
        "H. Neupert",
        "M. Taborellipresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Electron cloud (EC) has already been observed during normal operation of the PS using classical shielded button pick-up detectors in drift sections. In the context of the LHC Injector Upgrade (LIU project)",
        "similar measurements are also needed for the combined function magnets of the machine",
        "where the access to the vacuum chamber is strongly limited by the presence of the yoke. Two new electron cloud detectors have been studied",
        "developed",
        "and installed during the Long Shutdown (LS1) in one of such magnets. The first is based on current measurement by using a shielded button-type pick-up with a special geometry to reach the bottom surface of the vacuum pipe embedded in the magnet. The second one relies on a newly developed measurement method based on detection of the photons",
        "which are emitted by cathodoluminescence from the electron cloud impinging on the vacuum chamber walls. Part of the emitted photons is collected through a quartz window by a Micro-Channel Plate Photomultiplier Tube (MCP-PMT). First results obtained during machine development runs show the feasibility of the photon detection scheme. The results are discussed and compared with pick-up measurements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje071_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje071.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje071_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE071",
      "page_number": "476",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE072",
      "title": "Simulations and Measurements of Longitudinal Coupled-bunch Instabilities in the CERN PS",
      "authors": [
        "L. Ventura",
        "H. Damerau",
        "M. Migliorati",
        "G. Sterbini",
        "CERN",
        "Geneva",
        "Switzerland",
        "M. Migliorati",
        "L. Ventura",
        "INFN-Roma1",
        "Rome",
        "Italy",
        "University of Rome La Sapienza",
        "Rome",
        "Italy",
        "University of Rome \"La Sapienza\"",
        "Rome",
        "Italy",
        "Among various and challenging objectives of the LHC Injectors Upgrade project (LIU)",
        "one aim is to double the beam intensity of the CERN Proton Synchrotron (PS) in order to achieve the integrated luminosity target of the High-Luminosity LHC project (HL-LHC). A known limitation to reach the required high intensity is caused by the longitudinal coupled-bunch oscillations developing above the transition energy. The unwanted oscillations induce large bunch-to-bunch intensity variations not compatible with the specifications of the future LHC-type beams. A wide-band longitudinal damper has been installed in the PS to suppress these instabilities and is going to be commissioned. A measurement campaign of coupled-bunch oscillations has been launched to substantiate the extrapolations and predictions for the future High Luminosity LHC beam with the final aim to determine the maximum intensity that could be provided to the LHC. In parallel a Simulink© model of the PS is going to be implemented to predict the machine behavior in the parameter space of LIU and to be used during the beam commissioning and optimization of the feedback system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje072_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje072.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje072_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE072",
      "page_number": "479",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE073",
      "title": "The Extreme Beams Initiative in EuCARD-2",
      "authors": [
        "G. Franchetti",
        "J. Struckmeier",
        "GSI",
        "Darmstadt",
        "Germany",
        "IKP",
        "Mainz",
        "Germany",
        "CERN",
        "Geneva",
        "Switzerland",
        "EuCARD-2 is an Integration Activity on accelerator R&D co-funded within the European Union’s 7th Framework Programme. The Extreme Beams (XBEAM) network of EuCARD-2 extends",
        "and goes beyond the scope of",
        "the previous Networking Activities of CARE-HHH and EuCARD(-1) EuroLumi. XBEAM addresses",
        "and pushes",
        "all accelerator frontiers: luminosity",
        "energy",
        "beam power",
        "beam intensity",
        "and polarization. This is realized through five tasks: Coordination and Communication",
        "Extreme Colliders (XCOL)m Extreme Performance Rings (XRING)",
        "Extreme SC Linacs (XLINAC)",
        "and Extreme Polarization (XPOL)",
        "respectively. In the first two years of EuCARD-2",
        "XBEAM (co-)organised more than 15 topical workshops: the upgrade of  KEKB in Japan",
        "crystal channelling",
        "the advancement of the CERN facilities",
        "e.g. LHC upgrades and the Future Circular Collider",
        "magnet optimization",
        "space-charge effects",
        "the commissioning of proton linacs",
        "with emphasis on the ESS",
        "key questions for lepton spin polarization",
        "storage rings for measuring the electric dipole moment of electrons or protons. This presentation reports the major achievements of the XBEAM activity from 2013 to 2015",
        "and outlines the further plans through 2017."
      ],
      "institutions": [],
      "abstract": "F. Zimmermannpresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje073.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE073",
      "page_number": "483",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE074",
      "title": "Optimizing SLS-2 Nonlinearities Using a Multi-Objective Genetic Optimizer",
      "authors": [
        "M.P. Ehrlichman",
        "M. Aibapresenter",
        "A. Streun",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "An upgrade to the SLS is currently under development. This upgrade will likely utilize the same hall and same machine circumference",
        "288 m",
        "of the SLS. Achieving a sufficiently low emittance with such a small circumference requires tight focusing and low dispersion. These conditions make chromaticity correction difficult and minimization of 1st and 2nd order non-linear driving terms does not yield sufficient dynamic aperture and Touschek lifetime. In this proceeding",
        "we discuss the multi-objective genetic optimization method being implemented at SLS to aid the design of a chromaticity correction scheme for SLS2."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje074.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE074",
      "page_number": "486",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE075",
      "title": "Tracking Through Analytic Quadrupole Fringe Fields With GPT",
      "authors": [
        "S.B. van der Geer",
        "M.J. de Loos",
        "Pulsar Physics",
        "Eindhoven",
        "The Netherlands",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "In the early design stages it is customary to work with a highly simplified analytic model to describe the beam line. Dipoles and quadrupoles are often based on hard-edged approximations. This is not only unrealistic",
        "it also significantly slows down time-domain spacecharge tracking codes such as the General Particle Tracer (GPT) code. The underlying reason for the poor performance is that despite the fact that the simple hard-edged field equations are fast to evaluate",
        "they force the integration process to use excessively small step sizes near the fields discontinuities in order to achieve the desired accuracy. In other worlds",
        "the apparently simple equations turn out to be the most difficult ones to evaluate numerically. An obvious solution is to switch to field-maps",
        "but this is not practical in the early design stages. In this contribution we show a new solution implemented in the GPT code based on analytical expressions for the fringes where the transverse size of the magnet is properly taken into account. In addition to producing more realistic results",
        "the smooth fields increase tracking speed by over an order of magnitude for typical test cases."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje075.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE075",
      "page_number": "489",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE076",
      "title": "Multi-objective Genetic Optimization with the General Particle Tracer (GPT) Code",
      "authors": [
        "S.B. van der Geer",
        "M.J. de Loos",
        "Pulsar Physics",
        "Eindhoven",
        "The Netherlands",
        "In a typical design process there are a large number of variables",
        "external constraints",
        "and multiple conflicting objectives. Examples of the latter are short pulse",
        "high charge",
        "low emittance and low price. The classical solution to handle such problems is to combine all objectives into one merit function. This however implicitly assumes that the tradeoffs between all objectives are a-priori known. Especially in the early design stages this is hardly ever the case. A popular solution to this problem is to switch to multi-objective genetic optimization algorithms. This class of algorithms solves the problem by genetically optimising an entire population of sample solutions. Selection and recombination operators are defined such that the output",
        "the so-called Pareto front",
        "only includes solutions that are fully optimized where no objective can be improved without degrading any other. Here we present numerical studies and practical test runs of the genetic optimizer built into the General Particle Tracer (GPT) code."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje076.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE076",
      "page_number": "492",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE077",
      "title": "Progress on Simulation of Fixed Field Alternating Gradient Accelerators",
      "authors": [
        "JAI",
        "Oxford",
        "United Kingdom",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "M. Haj Tahar",
        "F. Méot",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Y. Ishi",
        "Y. Kuriyama",
        "Y. Mori",
        "M. Sakamoto",
        "T. Uesugi",
        "Kyoto University",
        "Research Reactor Institute",
        "Osaka",
        "Japan",
        "D.J. Kelliher",
        "S. Machida",
        "C.R. Prior",
        "C.T. Rogers",
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Fixed Field Alternating Gradient accelerators have been realised in recent decades thanks partly to computational power",
        "enabling detailed design and simulation prior to construction. We review the specific challenges of these machines and the range of different codes used to model them including ZGOUBI",
        "OPAL and a number of in-house codes from different institutes. The current status of benchmarking between codes is presented and compared to the results of recent characterisation experiments with a 150 MeV FFAG at KURRI in Japan. Finally",
        "we outline plans toward ever more realistic simulations including space charge",
        "material interactions and more detailed models of various components."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje077.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE077",
      "page_number": "495",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE078",
      "title": "Beam Delivery Simulation - Recent Developments and Optimization",
      "authors": [
        "J. Snuverink",
        "S.T. Boogertpresenter",
        "H. Garcia Morales",
        "S.M. Gibson",
        "R. Kwee-Hinzmann",
        "L.J. Nevay",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "UCL",
        "London",
        "United Kingdom",
        "Beam Delivery Simulation (BDSIM) is a particle tracking code that simulates the passage of particles through both the magnetic accelerator lattice as well as their interaction with the material of the accelerator itself. The Geant4 toolkit is used to give a full range of physics processes needed to simulate both the interaction of primary particles and the production and subsequent propagation of secondaries. BDSIM has already been used to simulate linear accelerators such as the International Linear Collider (ILC) and the Compact Linear Collider (CLIC)",
        "but it has recently been adapted to simulate circular accelerators as well",
        "producing loss maps for the Large Hadron Collider (LHC). In this paper the most recent developments",
        "which extend BDSIM's functionality as well as improve its efficiency are presented. Improvement and refactorisation of the tracking algorithms are presented alongside improved automatic geometry construction for increased particle tracking speed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje078.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE078",
      "page_number": "499",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE079",
      "title": "Tracking Studies in the LHeC Lattice",
      "authors": [
        "E. Cruz Alaniz",
        "D. Newton",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "E. Cruz Alaniz",
        "D. Newton",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Large Hadron Electron Collider (LHeC) is a proposed upgrade of the LHC to provide electron-proton collisions and explore a new regime of energy and luminosity for nucleon-lepton scattering. A nominal design has previously been presented",
        "featuring a lattice and optical configuration to focus one of the proton beams of the LHC (reaching a value of β*=10 cm) and to collide it head-on with an electron beam to produce collisions with the desired luminosity of L=1033 cm-2 s-1. The proton beam optics is achieved with the aid of a new inner triplet of quadrupoles at L*=10 m from the interaction point and the extension of the Achromatic Telescopic Squeezing (ATS) Scheme used for the High Luminosity-LHC project. The flexibility of this design has been studied in terms of minimising β* and increasing L*. In this work",
        "particle tracking is performed in a thin lens approximation of the LHeC proton lattice to compute the dynamic aperture and perform frequency map analysis for different types of chromatic correction schemes",
        "in order to find the one who will provide the most beam stability and to study the effects of non linearities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje079_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje079.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje079_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE079",
      "page_number": "502",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE081",
      "title": "Longitudinal Stability in Multi-Harmonic Accelerating Cavities",
      "authors": [
        "R.M. Jones",
        "L.R. Carver",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Yale University",
        "Physics Department",
        "New Haven",
        "CT",
        "USA",
        "Yale University",
        "Beam Physics Laboratory",
        "New Haven",
        "Connecticut",
        "USA"
      ],
      "institutions": [],
      "abstract": "Accelerating cavities that excite multiple modes at integer harmonics of the fundamental frequency can potentially be used to limit the effects of rf breakdown and pulsed surface heating at high accelerating gradients. Understanding the longitudinal stability and the acceptance of such a cavity is important to their development and use. The general Hamiltonian for longitudinal stability in multi harmonic cavities is derived and the particle dynamics are explored. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje081_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje081.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje081_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE081",
      "page_number": "506",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE082",
      "title": "Analytical Approach to the Beam-Beam Interaction with the Hourglass Effect",
      "authors": [
        "M.P. Crouch",
        "R.B. Appleby",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The HL-LHC upgrade will allow higher luminosities to be reached in the LHC. To achieve higher luminosities the β-function at the IP is decreased",
        "which in turn will result in the hourglass effect becoming more prominent as the transverse bunch sizes become comparable to the length of the bunch. This effect reduces the luminosity since not all particles in the bunch will collide at the minimum IP. The standard derivation of the electric and magnetic fields of the beam-beam interaction is that undertaken by Bassetti and Erskine. The derivation by Bassetti Erskine does not include a coupling between bunch planes. When the transverse bunch sizes are comparable to the length of the bunch the magnitude of the transverse kick will be dependent on the longitudinal position. Currently only numerical methods are available to evaluate this effect. Here a theoretical framework is outlined that provides an analytical approach to derive the electric field for the beam-beam interaction with a coupling between the transverse and longitudinal planes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje082_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje082.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje082_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE082",
      "page_number": "510",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE083",
      "title": "Implications of Manufacturing Errors on Higher Order Modes and on Beam Dynamics in the ESS Linac",
      "authors": [
        "A. Farricker",
        "R.M. Jonespresenter",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "ESS",
        "Lund",
        "Sweden",
        "The European Spallation Source (ESS) in Lund",
        "Sweden",
        "will be a facility for fundamental physics studies of atomic structure using a spallation source of unparalleled brightness. To achieve this end",
        "protons will be accelerated up to 2 GeV using a suite of cavities. Here we focus on the Medium Beta (β =0.67) elliptical superconducting cavities and we assess the influence of potential errors in fabrication to shift eigenmode frequencies onto an harmonic of the bunch frequency. If this occurs",
        "and countermeasures are not adopted",
        "the beam quality will be appreciably diluted *. We provide details on the geometrical parameters which are particularly sensitive to frequency errors from intensive finite element simulations of the electromagnetic fields. A circuit model is also employed to rapidly assess the shift in the eigenmodes from their anticipated design values due a variety of potential errors.",
        "* Aaron Farricker et al",
        "Physics Procedia",
        "Proceedings of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje083_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje083.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje083_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE083",
      "page_number": "514",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPJE084",
      "title": "Particle-in-cell Simulations of a Plasma Lens at Daresbury Laboratory",
      "authors": [
        "K. Hanahoe",
        "O. Metepresenter",
        "G.X. Xia",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "D. Angal-Kalinin",
        "J.K. Jones",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "TXUK",
        "Warrington",
        "United Kingdom",
        "Feasibility of a focusing element using the transverse fields provided by a plasma cell was studied numerically. In this paper",
        "an experimental set up is proposed for various beam parameters available from the VELA and CLARA beam lines at Daresbury Laboratory. 2D simulation results from VSim",
        "and expected results from planned measurement stations are presented. Field properties and the advantages and disadvantages of such an instrument compared to conventional focusing elements are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopje084_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopje084.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopje084_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPJE084",
      "page_number": "518",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 67,
  "scrape_time": "2025-10-10 20:21:01"
}