{
  "session_info": {
    "id": "FRAR",
    "name": "FRAR - User Interfaces and User eXperience (UX) II",
    "url": "https://proceedings.jacow.org/icalepcs2021/html/frar.htm"
  },
  "papers": [
    {
      "paper_id": "FRAR01",
      "title": "Taranta, the No-Code Web Dashboard in Production",
      "authors": [
        "M. Eguiraun",
        "A. Amjad",
        "J. Forsberg",
        "V. Hardion",
        "Y.L. Li",
        "L.M. Nguyen",
        "J.T.K. Rosenqvist",
        "M. Saad",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "INAF-OAT",
        "Trieste",
        "Italy",
        "INAF - OAAB",
        "Teramo",
        "Italy",
        "Universidade do Porto",
        "Faculdade de Ciências",
        "Porto",
        "Portugal",
        "The remote control and monitoring of accelerators and experimental setup has become an essential enabler when remote work has become the norm for the last 2 years. Unlike the desktop user interfaces which have been developed for the use of physical workstations",
        "Web application are naturally accessible remotely via the ubiquitous web browsers. On the other hand",
        "Web technology development need a specific knowledge which has yet to be disseminate in the control system engineering. And desktop frameworks still have the benefit of rapid and easy development even for the non-specialist. Taranta Suite is a collection of web applications jointly developed by MAX IV Laboratory and the SKA Organization",
        "for the Tango Control System. Totally in line with the ’no-code’ trend",
        "truly little knowledge of web technologies is needed. An operator can create a graphical user interface on-the-fly and then",
        "can share instantly this application. Authentication and authorization ensure to give the right level access to the users. This paper will describe the system",
        "the React and GQL implementation and the first usage at the different facilities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/frar01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/frar01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/frar01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRAR01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRAR02",
      "title": "canone3: A New Service and Development Framework for the Web and Platform Independent Applications*",
      "authors": [
        "G. Strangolino",
        "L. Zambon",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "On the wake of former web interfaces developed at ELETTRA as well as in other institutes",
        "the service and development framework for the web and platform independent applications named PUMA has been substantially enhanced and rewritten",
        "with the additional objectives of high availability",
        "scalability",
        "load balancing",
        "responsiveness and customization. Thorough analysis of Websocket limits led to an SSE based server technology relying on channels (Nchan over NGINX) to deliver the events to the clients. The development of the latter is supported by JQuery",
        "Bootstrap",
        "D3js",
        "SVG and QT and helps build interfaces ranging from mobile to dashboard. Ultimate developments led to successful load balancing and failover actions",
        "owing to the joint cooperation of a dedicated service supervisor and the NGINX upstream module."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/frar02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/frar02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/frar02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRAR02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRAR03",
      "title": "A Major Update of Web Based Development Toolkit for Control System of Large-Scale Physics Experiment Device",
      "authors": [
        "X.H. Xie",
        "Y.X. Jiang",
        "W. Wang",
        "F.Y. Wu",
        "HUST",
        "Wuhan",
        "People’s Republic of China",
        "S. Li",
        "B. Rao",
        "Y. Yang",
        "M. Zhang",
        "P.L. Zhang",
        "W. Zheng",
        "Huazhong University of Science and Technology",
        "State Key Laboratory of Advanced Electromagnetic Engineering and Technology",
        "Hubei",
        "People’s Republic of China",
        "The deployment of the control system called CODAC (Control",
        "Data Access and Communications) is necessary for the operation of large-scale experimental facilities. CFET (Control system framework for experimental devic-es toolkit) is a flexible SCADA (supervisory control and data acquisition) software tool",
        "which is used for the construction of a CODAC. CFET is fully based on open web technologies",
        "it is easy to integrate all kinds of systems and devices into CFET. This paper has undergone a major iteration of CFET. HMI has been redesigned and implemented. The control engineer can use a web based WYSIWYG HMI editor to compose the HMI. In CFET",
        "InfluxDB has been integrated. It is used to store the engineering data",
        "and also visualize the data on the website. Docker based microservices architecture has been designed",
        "putting CFET and dependent packages into a lightweight container. At present",
        "CFET has been used in the CO-DAC system of J-TEXT tokamak and HUST Field-Reversed Configuration facility."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/frar03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/frar03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/frar03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRAR03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRAR04",
      "title": "Phoebus Olog",
      "authors": [
        "BNL",
        "Upton",
        "New York",
        "USA",
        "ESS",
        "Lund",
        "Sweden",
        "Phoebus Olog is an online logbook used for recording operational and experimental events by users or other applications. The Phoebus Olog service is an evolution of the Olog web service. It uses modern nosql data stores like mondoDB and elastic which provide horizontal scalability",
        "improved performance",
        "and complex querying functionality like fuzzy searches. The improvements of the server side are accompanied with several new UI clients; smartphone apps for convenient viewing of logs",
        "logbook client in Phoebus CS-Studio which provides integration with various other applications like alarms",
        "OPI",
        "etc and a web application."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/frar04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/frar04.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/frar04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRAR04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 18:07:41"
}