{
  "session_info": {
    "id": "THXD",
    "name": "THXD - Beam Instrumentation and Controls",
    "url": "https://proceedings.jacow.org/napac2022/html/thxd.htm"
  },
  "papers": [
    {
      "paper_id": "THXD1",
      "title": "Machine Learning for Improved Accelerator Health and Reliability",
      "authors": [
        "ORNL RAD",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "This talk will summarize the effort by the community in using machine learning for improved accelerator operations. This talk will also discuss efforts to implement a machine learning framework to improve accelerator reliability at the Spallation Neutron Source. It will describe new prognostics algorithms for detecting beam faults",
        "classification of the fault sources",
        "and efforts to integrate the algorithms into operations. it will also describe additional efforts to utilize ML for health and predictive prognostics on critical accelerator hardware and targets."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/thxd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/thxd1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/thxd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-THXD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THXD2",
      "title": "D Phase Space Diagnostics Based on Adaptive Tuning of the Latent Space of Encoder-Decoder Convolutional Neural Networks",
      "authors": [
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA"
      ],
      "institutions": [],
      "abstract": "We present a general approach to 6D phase space diagnostics for charged particle beams based on adaptively tuning the low-dimensional latent space of generative encoder-decoder convolutional neural networks (CNN). Our approach first trains the CNN based on supervised learning to learn the correlations and physics constrains within a given accelerator system. The input of the CNN is a high dimensional collection of 2D phase space projections of the beam at the accelerator entrance together with a vector of accelerator parameters such as magnet and RF settings. The inputs are squeezed down to a low-dimensional latent space from which we generate the output in the form of projections of the beam’s 6D phase space at various accelerator locations. After training the CNN is applied in an unsupervised adaptive manner by comparing a subset of the output predictions to available measurements with the error guiding feedback directly in the low-dimensional latent space. We show that our approach is robust to unseen time-variation of the input beam and accelerator parameters and a study of the robustness of the method to go beyond the span of the training data.",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/thxd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/thxd2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/thxd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-THXD2",
      "page_number": "837",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXD3",
      "title": "Improved Multi-Dimensional Bunch Shape Monitor",
      "authors": [
        "S.V. Kutsaev",
        "R.B. Agustsson",
        "A.C. Araujo Martinezpresenter",
        "A. Moro",
        "K.V. Taletski",
        "RadiaBeam",
        "Santa Monica",
        "California",
        "USA",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "RadiaBeam is developing the Bunch Shape Monitor (BSM) with improved performance that incorporates three major innovations. First",
        "the collection efficiency is improved by adding a focusing field between the wire and the entrance slit. Second",
        "an improvement of the measurement speed is achieved by sampling longitudinal profiles of multiple energy slices simultaneously. Finally",
        "the design is augmented with both a movable wire and a microwave deflecting cavity to add functionality and enable measuring the transverse profile as a wire scanner. In this paper we present the design of the BSM and its sub-systems as well as the initial test results of the new focusing system at SNS beamline."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/thxd3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/thxd3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/thxd3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-THXD3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THXD4",
      "title": "Online Accelerator Tuning with Adaptive Bayesian Optimization",
      "authors": [
        "N. Kuklev",
        "M. Borland",
        "G.I. Fystro",
        "H. Shang",
        "Y. Sun",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Particle accelerators require continuous adjustment to maintain beam quality. At the Advanced Photon Source (APS) this is accomplished using a mix of operator-controlled and automated tools. To improve the latter",
        "we explored the use of machine learning (ML) at the APS injector complex. The core approach we chose was Bayesian optimization (BO)",
        "which is well suited for sparse data tasks. To enable long-term online use",
        "we modified BO into adaptive Bayesian optimization (ABO) though auxiliary models of device drift",
        "physics-informed quality and constraint weights",
        "time-biased data subsampling",
        "digital twin retraining",
        "and other approaches. ABO allowed for compensation of changes in inputs and objectives without discarding previous data. Benchmarks showed better ABO performance in several simulated and experimental cases. To integrate ABO into the operational workflow",
        "we developed a Python command line utility",
        "pysddsoptimize",
        "that is compatible with existing Tcl/Tk tools and the SDDS data format. This allowed for fast implementation",
        "debugging",
        "and benchmarking. Our results are an encouraging step for the wider adoption of ML at APS."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/thxd4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/thxd4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/thxd4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-THXD4",
      "page_number": "842",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXD5",
      "title": "Machine Learning-Based Tuning of Control Parameters for LLRF System of Superconducting Cavities",
      "authors": [
        "J.A. Diaz Cruz",
        "S. Biedron",
        "UNM-ECE",
        "Albuquerque",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The multiple systems involved in the operation of particle accelerators use diverse control systems to reach the desired operating point for the machine. Each system needs to tune several control parameters to achieve the required performance. Low-Level RF (LLRF) systems can be implemented using proportional-integral (PI) feedback loops",
        "whose gains need to be optimized. In this paper",
        "we explore Machine Learning (ML) as a tool to improve a traditional LLRF controller by tuning its gains using a Neural Network(NN)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/thxd5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/thxd5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/thxd5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-THXD5",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THXD6",
      "title": "A Quasi-Optical Beam Position Monitor",
      "authors": [
        "Euclid TechLabs",
        "Solon",
        "Ohio",
        "USA",
        "There is a strong demand for non-destructive electron Beam Position Monitors (BPMs) for non-perturbative diagnostics of the electron beam position. Challenges are related to the shortness of the electron beam and the noisy chamber environment that are typical for modern RF-driven and plasma-driven accelerators. We propose using a pair of identical high-quality quasi-optical resonators attached to opposite sides of the beam pipe. The resonators can introduce Photonic Band Gap (BPM) structures. These open resonators sustain very low numbers of high-quality modes. We intend to operate at the lowest mode among the others that are capable of being excited by the bunches. The mentioned mode has a coupling coefficient with the beam that depends on the distance between the bunch and the coupling hole. The lower this distance",
        "the higher the coupling. Therefore",
        "comparing the pick-up signals of both resonators with an oscilloscope",
        "we can determine the beam position."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/thxd6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/thxd6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/thxd6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-THXD6",
      "page_number": "846",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:27:28"
}