{
  "session_info": {
    "id": "MOPB",
    "name": "MOPB - Poster Session",
    "url": "https://proceedings.jacow.org/SRF2015/html/mopb.htm"
  },
  "papers": [
    {
      "paper_id": "MOPB001",
      "title": "RF Performance of Ingot Niobium Cavities of Medium-Low Purity",
      "authors": [
        "G. Ciovati",
        "P. Dhakal",
        "P. Kneisel",
        "G.R. Myneni",
        "J.K. Spradlin",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Superconducting radio-frequency cavities made of ingot niobium with residual resistivity ratio (RRR) greater than 250 have proven to have similar or better performance than fine-grain Nb cavities of the same purity",
        "after standard processing. The high purity requirement contributes to the high cost of the material. As superconducting accelerators operating in continuous-wave typically require cavities to operate at moderate accelerating gradients",
        "using lower purity material could be advantageous not only to reduce cost but also to achieve higher Q0-values",
        "because of the well-known dependence of the BCS-surface resistance on mean free path. In this contribution we present the results from cryogenic RF tests of 1.3-1.5 GHz single-cell cavities made of ingot Nb of medium (RRR=100-150) and low (RRR=60) purity from different suppliers. Cavities made of medium-purity ingots routinely achieved peak surface magnetic field values greater than 70 mT with Q0-values above 1.5·1010 at 2 K. The performance of cavities made of low-purity ingots were affected by significant pitting of the surface after chemical etching.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb001.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB001",
      "page_number": "61",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB002",
      "title": "Observation of High Field Q-Slope in 3 GHz Nb Cavities",
      "authors": [
        "G.V. Eremeev",
        "F.E. Hannon",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "A degradation of the unloaded quality factor is commonly observed above about 100 mT in elliptical niobium cavities. The cause of this degradation has not been fully understood yet",
        "but the empirically found solution of heating to about 100-120 C for 24-48 hrs. eliminates the degradation in electropolished fine grain or large grain niobium cavities. While numerous experiments related to this phenomenon have been done at 1.3 GHz and 1.5 GHz",
        "little data exists at other frequencies",
        "and the frequency dependence of this degradation is not clear. We have measured the unloaded quality factor of 3 GHz fine grain niobium cavities",
        "which were chemically polished as the final treatment before RF tests in a vertical Dewar and observed the characteristic degradation in two cavities. The measurement of the quality factor degradation at different bath temperatures points to a field-dependent rather than a temperature-related effect.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb002.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB002",
      "page_number": "66",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB003",
      "title": "Superconducting Cavity for the Measurements of Frequency, Temperature, RF Field Dependence of the Surface Resistance",
      "authors": [
        "H. Park",
        "S.U. De Silva",
        "J.R. Delayen",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [
        "In order to better understand the contributions of the various physical processes to the surface resistance of superconductors the ODU Center for Accelerator Science is developing a half-wave resonator capable of operating between 325 MHz and 1.3 GHz. This will allow the measurement of the temperature and rf field dependence of the surface resistance on the same surface over the range of frequency of interest for particle accelerators and identify the various sources of power dissipation."
      ],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb003.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB003",
      "page_number": "70",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB004",
      "title": "Understanding the Field Dependence of the Surface Resistance in Nitrogen-Doped Cavities",
      "authors": [
        "P.N. Koufalis",
        "D. Gonnella",
        "M. Liepe",
        "J.T. Maniscalco",
        "I. Packtor",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "An important limiting factor in the performance of superconducting radio frequency (SRF) cavities in medium and high field gradients is the intrinsic quality factor and",
        "thus",
        "the surface resistance of the cavity. The exact dependence of the surface resistance on the magnitude of the RF field is not well understood. We present an analysis of experimental data of LT1-3 and LT1-4",
        "1.3 GHz single-cell nitrogen-doped cavities prepared and tested at Cornell. Most interestingly",
        "the cavities display anti-Q slopes in the medium-field region (i.e. Rs decreases with increasing accelerating field). We extract the temperature dependent surface resistances of the cavities",
        "analyze field dependencies",
        "and compare with theoretical predictions. These comparisons and analyses provide new insights into the field dependence of the surface resistance and improve our understanding of the mechanisms behind the effect.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb004.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB004",
      "page_number": "74",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB005",
      "title": "Developing a Setup to Measure Field Dependence of BCS Surface Resistance",
      "authors": [
        "J.T. Maniscalco",
        "M. Liepe",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "The temperature-dependent part of the microwave surface resistance of superconducting radio-frequency (SRF) cavities has been shown experimentally to depend on the strength of the applied magnetic surface field. Several theories have recently been proposed to describe this phenomenon. In this paper we present work on the development of a microwave cavity setup for measuring the field-dependence with an applied DC magnetic field. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb005.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB005",
      "page_number": "77",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB006",
      "title": "Hc2 Measurements of Superconductors",
      "authors": [
        "J.T. Maniscalco",
        "D. Gonnella",
        "D.L. Hall",
        "M. Liepe",
        "E.N. Smith",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Recently",
        "Cornell has improved a method for extracting the upper critical field Hc2 of a thin-film superconductor using four-point resistivity measurements. In the field of superconducting radio-frequency accelerators (SRF)",
        "novel materials and processes such as nitrogen-doped niobium and Nb3Sn may allow for improved SRF performance and cost efficiency over traditional niobium. In this paper we present updated results on Hc2 measurements for Nb3Sn",
        "as well as results for niobium prepared with an 800 C bake. We also extract important material properties from these measurements",
        "such as the Ginzburg Landau parameter",
        "the mean free path",
        "and coherence length",
        "which are critical for determining SRF performance.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb006.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB006",
      "page_number": "79",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB007",
      "title": "Temperature Excursions in Nb Sheets With Imbedded Delamination Cracks",
      "authors": [
        "P. Xu",
        "N.T. Wright",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "Michigan State University",
        "East Lansing",
        "Michigan",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Delamination cracks can form in rolled Nb sheets",
        "and between layers with different micro-structures. Such cracks cause resistance to heat conduction from the RF surface to the liquid He bath. A delamination crack can negate the advances in manufacturing processes that have enhanced the thermal conductivity of Nb. Here",
        "temperature excesses are calculated as functions of crack size and location",
        "and the power dissipated at an imperfection in the RF surface. A disk shape of Nb sheet is modeled as having adiabatic sides. A hemispherical defect is located on the RF surface at the center of this section. A crack is modeled as a void within the Nb disk. The Kapitza resistance between the Nb surface and liquid He is varied. The results indicate that an incipient crack leads to a decrease in the magnetic flux required to cause thermal breakdown. The decrease in the field is gradual with increasing crack radius",
        "until the crack radius nearly equals the section radius",
        "after which the field required for breakdown decreases sharply. To a lesser extent",
        "the field strength for thermal breakdown also decreases with increased crack depth.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [
        "Funding: Work supported by US DOE Cooperative Agreement DE-SC0000661 and Michigan State University."
      ],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb007.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB007",
      "page_number": "82",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB008",
      "title": "Theoretical Field Limit and Cavity Surface Conditions: Nano-Scale Topography and Sub-millimeter Pit",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "The recent two theoretical papers*",
        "** are briefly introduced. The former addresses the superheating field (Bs) suppression due to nano-defects distributing almost continuously on the cavity surface*. We introduce a model of the nano-defect. An analytical formula for Bs suppression factor is derived. By using the formula",
        "suppression factors of bulk or multilayer superconductors and those after various surface processing technologies can be evaluated. An application to the dirty Nb processed by EP is also presented as an example. The latter address the magnetic field enhancement (MFE) at the sub-millimeter pit on the surface of cavity",
        "which is thought to cause quench**. There exists the famous well-type pit model",
        "but many of pits are not well-type but have gentle slopes. Impacts of the slope angle on MFE have not been well understood. We introduce a model that can describe a pit with an arbitrary slope angle. A formula to evaluate the MFE factor is derived. A pit with a gentle slope angle yields a much smaller MFE factor than the well-type pit. The formula can be applied to the calculation of MFE factors of real pits with arbitrary slope angles.",
        "* T. Kubo",
        "Prog. Theor. Exp. Phys. 2015",
        "063G01(2015). ** T. Kubo",
        "Prog. Theor. Exp. Phys. 2015",
        "073G01(2015).",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb008.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB008",
      "page_number": "86",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB009",
      "title": "Model of Flux Trapping in Cooling Down Process",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "Recent findings that cooling conditions affect an amount of trapped magnetic flux attract much attention as a way to achieve a high-Q0 by SRF cavity*",
        "**",
        "***. Q0~2*1011 has already been achieved by the full flux expulsion****. While much experimental studies have been conducted",
        "not much theoretical progress followed on it. In this paper",
        "I introduce a simple model that can explain how trapped fluxoids are expelled in cooling process.",
        "*J.M.Vogt et al.",
        "PRSTAB 16",
        "102002 (2013)  **A.Romanenko et al.",
        "JAP 115",
        "184903 (2014)  ***J.M.Vogt et al.",
        "PRSTAB 18",
        "042001 (2015) ****A.Romanenko et al.",
        "APL 105",
        "234103 (2014)",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb009.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB009",
      "page_number": "90",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB010",
      "title": "Field-Dependent Surface Resistance for Superconducting Niobium Accelerating Cavities: The Case of N-Doping",
      "authors": [
        "Private Address",
        "SERGY",
        "France",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The dependence of the Q-value on the RF field (Q-slope) for superconducting RF cavities is actively studied in various accelerator laboratories. Although remedies against this dependence have been found",
        "the physical cause still remains obscure. A rather straightforward two-fluid model description of the Q-slope in the low and high field domains is extended to the case of the recently experimentally identified increase of the Q-value with the RF field obtained by so-called \"N-doping”.",
        "This paper was initiated when one of the authors (W.W.",
        "retiree from CERN) visited Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "NY.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb010.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB010",
      "page_number": "95",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB011",
      "title": "How Uniform Are Cool-Downs?",
      "authors": [
        "J.A. Robbins",
        "R.G. Eichhorn",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Since the last SRF conference it has become clear that achieving extremely high quality factors of SRF cavities depend on the cool-down scenario. While some findings favor a fast cool-down",
        "others suggest a slow cycle to be advantageous",
        "and many variations to that have been investigated: the role of thermocurrents",
        "amount of ambient magnetic field and flux trapping. This paper will investigate",
        "how uniformly different cool-down procedures are and if they can explain the more efficient magnetic flux expulsion.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb011.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB011",
      "page_number": "100",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB013",
      "title": "Simulation of Geometry Dependent Flux Trapping",
      "authors": [
        "J. May-Mann",
        "R.G. Eichhorn",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Trapping or expulsion of ambient magnetic field has become an important factor in the performance of superconducting cavities with very high Q. As experimental data is limited",
        "we set up a numerical field calculation model to study this effect in more details. We will report",
        "how the cavity orientation",
        "the movement of the transition to superconductivity front",
        "and the orientation of the magnetic field contributes to the amount of magnetic field being vulnerable for trapping.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb013.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB013",
      "page_number": "105",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB014",
      "title": "Magnetic Flux Expulsion in Horizontally Cooled Cavities",
      "authors": [
        "M. Martinello",
        "M. Checchin",
        "A. Grassellino",
        "O.S. Melnychuk",
        "A. Romanenko",
        "D.A. Sergatskov",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "The cool down details of superconducting accelerating cavities are crucial parameters that have to be optimize in order to obtain very high quality factors. The temperature all around the cavity is monitored during its cool down across the critical temperature",
        "in order to visualize the different dynamics of fast and slow cool-down",
        "which determine considerable difference in terms of magnetic field expulsion and cavity performance. The study is performed placing a single cell 1.3 GHz elliptical cavity perpendicularly to the helium cooling flow",
        "which is representative of how SRF cavities are cooled in an accelerator. Hence",
        "the study involves geometrical considerations regarding the cavity horizontal configuration",
        "underling the different impact of the various magnetic field components on the surface resistance. Experimental data also proves that under established conditions",
        "flux lines are concentrated at the cavity top",
        "in the equatorial region",
        "leading to temperature rise.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb014.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB014",
      "page_number": "110",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB015",
      "title": "Trapped Flux Surface Resistance Analysis for Different Surface Treatments",
      "authors": [
        "M. Martinello",
        "M. Checchin",
        "A. Grassellino",
        "O.S. Melnychuk",
        "S. Posen",
        "A. Romanenko",
        "D.A. Sergatskov",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "The trapped flux surface resistance is one of the main contributions on cavity losses which appears when cavities are cooled in presence of external magnetic field. The study is focused on the understanding of the different parameters which determine the trapped flux surface resistance",
        "and how this change as a function of different surface treatments. The study is performed on 1.3 GHz niobium cavities processed with different surface treatments after the 800 C bake: electro-polishing (EP)",
        "120 C baking",
        "and N-doping varying the time of the Nitrogen exposure. The trapped flux surface resistance normalized for the trapped magnetic flux is then analyzed as a function of the mean free path in order to find the surface treatment which minimized the trapped flux sensitivity.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb015.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB015",
      "page_number": "115",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB018",
      "title": "Introduction of Precisely Controlled Microstructural Defects into SRF Cavity Niobium Sheets and Their Impact on Local Superconducting Properties",
      "authors": [
        "M. Wang",
        "T.R. Bieler",
        "D. Kang",
        "Michigan State University",
        "East Lansing",
        "Michigan",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "D.C. Larbalestier",
        "A. Polyanskii",
        "Z-H. Sung",
        "ASC",
        "Tallahassee",
        "Florida",
        "USA",
        "NHMFL",
        "Tallahassee",
        "Florida",
        "USA",
        "When SRF cavity shapes are formed from Nb sheets",
        "the metallurgical processing introduces microstructural defects such as dislocations and low-angle grain boundaries that can serve as pinning centers for magnetic flux that may degrade cavity performance. Therefore",
        "the relationship between magnetic flux behavior and microstructural defects in carefully strained SRF Nb sheet was investigated. Laue X-ray and EBSD-OIM crystallographic analyses of large grain ingot slices were used to characterize microstructural defects and then predict which grains and sample orientations will produce desired model defects due to tensile deformation. Grain orientations were chosen to favor specific slip systems",
        "which generate dislocations with special angles with respect to the sample surface. Nb bicrystals were also prepared to investigate the effects of grain boundaries on flux pinning. The generated defect structures were confirmed by OIM and TEM. Cryogenic magneto-optical imaging was used to directly observe the penetration of magnetic flux into the deformed Nb. These model samples have deformation that is similar to that expected in typical cavity forming processes.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb018.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB018",
      "page_number": "120",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB019",
      "title": "Horizontal Testing and Thermal Cycling of an N-Doped Tesla Type Cavity",
      "authors": [
        "O. Kugeler",
        "J. Knobloch",
        "J.M. Köszegi",
        "HZB",
        "Berlin",
        "Germany",
        "A. Grassellino",
        "O.S. Melnychuk",
        "A. Romanenko",
        "D.A. Sergatskov",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "An N-doped TESLA type cavity treated at FERMILAB has been tested in the HoBiCaT horizontal test stand. Temperatures and magnetic fields occuring during the superconducting transition were recorded at various positions and directions on the outer cavity surface. Several thermal cycling runs were performed yielding different Q0 factors just like in undoped cavities. The resulting residual and BCS resistance values were correlated to the thermal and magnetic conditions during cooldown. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb019.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB019",
      "page_number": "125",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB020",
      "title": "Mean Free Path Dependence of the Trapped Flux Surface Resistance",
      "authors": [
        "M. Checchin",
        "A. Grassellino",
        "M. Martinello",
        "A. Romanenko",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "In this article a calculation of the trapped flux surface resistance is presented. The two main mechanisms considered in such approach are the oscillation of the magnetic flux trapped in the superconductor due to the Lorentz force",
        "and the static resistance associated to the normal conducting vortex core. The model derived shows a good description of the available experimental data",
        "highlighting that the radio frequency vortex dissipation is mostly due to the static part of the surface resistance. We show that the surface resistance for 100% trapped flux normalized to the trapped field (expressed in nOhm/mG) can be approximated to R/B=18.3*(l f)1/2/(50.1+l) with l the mean free path in nm and f the frequency in GHz.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb020.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB020",
      "page_number": "129",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB023",
      "title": "Detectors Sensing Second Events Induced by Thermal Quenches of SRF Cavities in He II",
      "authors": [
        "M. Fouaidy",
        "F. Dubois",
        "D. Longuevergne",
        "O. Pochon",
        "J.-F. Yaniche",
        "IPN",
        "Orsay",
        "France",
        "SRF bulk Nb cavities are often limited by quench due to anomalous losses (heating due normal defects or Field Emission). We continued R&D on Quench Detectors (QD) activity for locating quench in SRF cavities via 2nd sound in superfluid helium. We investigated 2 kinds of QD: Capacitive OST (COST) and Low Response time resistive Thermometers (LRT). A test stand operating in LHe (Temperature: T0) was used for the characterization of the QD by means of precise experimental simulation of SRF cavity quench (pulsed heat flux qP). For improving spatial resolution of QD",
        "smaller COSTs were developed and tested. We investigated the dynamic response of QD as function of different parameters (heater size/geometry",
        "T0",
        "qP) and data are reported. Further",
        "a 2nd Sound Resonator (SSR)",
        "with a pair of COSTs at its 2 extremities as 2nd Sound Generator (SSG) and Detector (SSD) respectively and housing also a low heat capacity heater (SSG) and a LRT (SSD) assembly was developed. The first experimental data obtained",
        "with SSR operated in resonating mode or in a shock wave mode are presented. The results concerning locating of quenches in QWR and spoke cavities are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb023.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB023",
      "page_number": "135",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB024",
      "title": "SRF Cavity Breakdown Calculation Procedure Using FEA-Software",
      "authors": [
        "R.A. Kostin",
        "A. Kanareykin",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "FZJ",
        "Jülich",
        "Germany",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "SRF cavity thermal breakdown can be analyzed analytically using thermodynamics equation. This technique is suitable for simple geometries when surface magnetic field variation can be omitted. Thermal radiation effect which is crucial for SRF gun calculations is also hard to implement properly because of complicated geometry. All of these can be overcome by using multiphysics FEA-software. This paper shows the procedure of cavity thermal breakdown calculation in coupled multiphysics analysis with dependable parameters. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb024.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB024",
      "page_number": "140",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB025",
      "title": "Quality Factor Field Dependence Down to Very Low Fields",
      "authors": [
        "A. Romanenko",
        "M. Checchin",
        "T.N. Khabiboulline",
        "M. Martinello",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "M. Checchin",
        "M. Martinello",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "Potential application of SRF cavities for quantum computing requires their operation in the limit of very low fields (down to single photon) and temperatures (<100 mK). If niobium cavities are advantageous for this field depends on the Q value",
        "which can be achieved",
        "and therefore requires detailed studies in the low field Q slope regime. Here we report the first attempt toward such a characterization by extending the low field Q slope measurements in 1.3 GHz single cell cavities down to the lowest possible fields.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb025.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPB027",
      "title": "Modifications of Superconducting Properties of Niobium Caused by Nitrogen Doping of Ultra-High Quality Factor Cavities",
      "authors": [
        "A. Vostrikov",
        "A. Grassellino",
        "A. Romanenko",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "L. Horyn",
        "Y.K. Kim",
        "A. Vostrikov",
        "University of Chicago",
        "Chicago",
        "Illinois",
        "USA",
        "University of Wisconsin-Madison",
        "Madison",
        "USA",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "We have performed detailed studies using DC and AC magnetometry and electrical resistivity measurements of niobium samples prepared using different nitrogen doping recipes. We compare the results to the samples prepared by standard preparation techniques such as EP with and without additional 120C baking to get insight into driving factors of the lowered quench field in N-doped SRF cavities. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb027.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB027",
      "page_number": "144",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB028",
      "title": "Preservation of Very High Quality Factors of 1.3 GHz Nine Cell Cavities From Bare Vertical Test to Dressed Horizontal Test",
      "authors": [
        "A. Grassellino",
        "S. Aderhold",
        "M. Checchin",
        "A.C. Crawford",
        "C.J. Grimm",
        "A. Hocker",
        "M. Martinello",
        "O.S. Melnychuk",
        "J.P. Ozelis",
        "S. Posen",
        "A.M. Rowe",
        "D.A. Sergatskov",
        "N. Solyak",
        "R.P. Stanek",
        "G. Wu",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "HZB",
        "Berlin",
        "Germany",
        "Cornell University",
        "Ithaca",
        "New York",
        "USA",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "In this contribution we will report quality factor evolution of several different nine cell N doped cavities with very high Q. The evolution of the quality factor will be reported from bare to dressed in vertical test to dressed in horizontal test with unity coupling to dressed in horizontal test and CM-like environment/configuration (with RF ancillaries). Cooling studies and optimal cooling regimes will be discussed for both vertical and horizontal tests and comparisons will be drawn also for different styles titanium vessels. Studies of sensitivities to magnetic field in final horizontal configuration have been performed by applying a field around the dressed cavity and varying the cooling; parameters required for a very good flux expulsion will be presented. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb028.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB028",
      "page_number": "149",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB030",
      "title": "Measurements of Thermal Impedance on Superconducting Radiofrequency Cavities",
      "authors": [
        "P. Dhakal",
        "G. Ciovati",
        "G.R. Myneni",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The thermal impedance of niobium plays an important role in the stability of the superconducting radio frequency cavities used in particle accelerators. During the operation of SRF cavities",
        "the RF power dissipated on the inner surface of the cavities and the heat transport to the helium bath depend on the thermal conductivity of niobium and the Kapitza conductance of the interface between the niobium and superfluid helium. Here",
        "we present the results of measurements done on samples as well as on SRF cavities made of both ingot and fine-grain Nb to explore the effect of the surface preparation and crystal structure on the thermal impedance.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb030.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB030",
      "page_number": "154",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB033",
      "title": "LCLS-II SRF Cavity Processing Protocol Development and Baseline Cavity Performance Demonstration",
      "authors": [
        "M. Liepe",
        "P. Bishop",
        "H. Conklin",
        "R.G. Eichhorn",
        "F. Furuta",
        "G.M. Ge",
        "D. Gonnella",
        "T. Gruber",
        "D.L. Hall",
        "G.H. Hoffstaetter",
        "J.J. Kaufman",
        "G. Kulina",
        "J.T. Maniscalco",
        "T.I. O'Connell",
        "P. Quigley",
        "D.M. Sabol",
        "J. Sears",
        "V. Veshcherevich",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "M. Checchin",
        "A.C. Crawford",
        "A. Grassellino",
        "C.J. Grimm",
        "A. Hocker",
        "M. Martinello",
        "O.S. Melnychuk",
        "J.P. Ozelis",
        "A. Romanenko",
        "A.M. Rowe",
        "D.A. Sergatskov",
        "W.M. Soyars",
        "R.P. Stanek",
        "G. Wu",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "E. Daly",
        "G.K. Davis",
        "M.A. Drury",
        "J.F. Fischer",
        "A.D. Palczewski",
        "C.E. Reece",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The ”Linac Coherent Light Source-II” Project will construct a 4 GeV CW superconducting RF linac in the first kilometer of the existing SLAC linac tunnel. The baseline design calls for 280 1.3 GHz nine-cell cavities with an average intrinsic quality factor Q0 of 2.7·1010 at 2K and 16 MV/m accelerating gradient. The LCLS-II high Q0 cavity treatment protocol utilizes the reduction in BCS surface resistance by nitrogen doping of the RF surface layer",
        "which was discovered originally at FNAL. Cornell University",
        "FNAL",
        "and TJNAF conducted a joint high Q0 R&D program with the goal of (a) exploring the robustness of the N-doping technique and establishing the LCLS-II cavity high Q0 processing protocol suitable for production use",
        "and (b) demonstrating that this process can reliably achieve LCLS-II cavity specification in a production acceptance testing setting. In this paper we describe the LCLS-II cavity protocol and analyze combined cavity performance data from both vertical and horizontal testing at the three partner labs",
        "which clearly shows that LCLS-II specifications were met",
        "and thus demonstrates readiness for LCLS-II cavity production.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb033.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB033",
      "page_number": "159",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB035",
      "title": "Nature and Implication of Found Actual Particulates on the Inner Surface of Cavities in a Full-Scale Cryomodule Previously Operated With Beams",
      "authors": [
        "R.L. Geng",
        "J.F. Fischer",
        "E.A. McEwen",
        "O. Trofimova",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Field emission in an SRF cavity is often the result of small foreign particulates lodging on the cavity inner surface. To avoid these particulate field emitters",
        "careful cleaning and handling of individual cavities and clean room assembly of cavity strings are common practice. Despite these elaborate processes",
        "some particulates persist to stay on the final surface of a beam-ready cavity. Moreover",
        "as will be shown in this contribution",
        "new particulates accumulate after a cryomodule is placed in the accelerator tunnel. The nature of these accumulated particulates on the inner surface of a beam-accelerating cavity is largely unknown for two reasons: (1) lack of access to such surfaces; (2) lack of a workable procedure for investigation without destroying the cavity. In this contribution",
        "we report the first study on found actual particulates on the inner surface of 5-cell CEBAF cavities in a full-scale cryomodule previously operated with beam. The nature of the studied particulates is presented. The implication of the findings will be discussed in view of reliable and efficient operation of CEBAF and future large-scale SRF accelerators.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb035.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB035",
      "page_number": "164",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB036",
      "title": "TOF-SIMS Study of Nitrogen Doping Niobium Samples",
      "authors": [
        "Z.Q. Yang",
        "L. Lin",
        "X.Y. Lu",
        "W.W. Tan",
        "D.Y. Yang",
        "J. Zhao",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Nitrogen doping treatment with the subsequent electropolishing (EP) of the niobium superconducting cavity can significantly increase the cavity’s quality factor up to a factor of 3. The nitrogen doping experiment has been successfully repeated and demonstrated. But the mechanism of the nitrogen doping effect remains unclear. Nitrogen doping study on niobium samples was carried out in Peking University. The niobium samples were manual processed to avoid heat generation. The experiment condition is close to that of the Fermilab. After the nitrogen doping treatment",
        "the samples were mildly electropolished with the thickness of 1.3μm",
        "1.9μm",
        "3.3μm",
        "4.2μm",
        "5.1μm",
        "5.9μm and 7.0μm. The time of flight secondary ion mass spectrometry (TOF-SIMS) measurements show that the samples directly after nitrogen doping have a much higher nitrogen concentration in the depth of about 90nm. When the EP removal is larger than 1.3μm",
        "the samples’ impurity elements is remarkably reduced and their distribution is similar to each other. Also the measured results to some extent prove that EP removal can introduce H to the niobium surface.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb036.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB036",
      "page_number": "169",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB039",
      "title": "Analysis of BCS RF Loss Dependence on N-Doping Protocols",
      "authors": [
        "A.D. Palczewski",
        "P. Dhakal",
        "C.E. Reece",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "We present a study on two parallel-path SRF cavities (one large grain and one fine grain",
        "1.3 GHz) which seeks to explain the correlation between the amount of nitrogen on the inner surface of a “nitrogen doped” SRF cavity and the change in the temperature dependant (packaged into term BCS) RF losses. For each doping/EP",
        "the cavities were tested at multiple temperatures (2.0 K to 1.5 K in 0.1 K steps) to create a Q0 vs. Eacc vs. T matrix which then could be used to extract temperature dependant and independent components. After each test",
        "the cavities were thermally cycled to 120 K and then re-cooled and retested to assess if evidence of hydrogen migration might appear even at a small level. In addition",
        "TD-5 was also tested at fixed low field (Q0 vs. T) to fit standard BCS theory. In parallel",
        "SIMS data was taken on like-treated samples to correlate the amount of nitrogen within the RF surface to the change in the temperature dependant fitting parameter “A”.**",
        "[**] H.Tian et al.",
        "contributed to SRF2015.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb039.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB039",
      "page_number": "174",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB040",
      "title": "Performance of Dressed Cavities for the Jefferson Laboratory LCLS-II Prototype Cryomodule - With Comparison to the Pre-Dressed Performance",
      "authors": [
        "A.D. Palczewski",
        "G.K. Davis",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "F. Furuta",
        "G.M. Ge",
        "D. Gonnella",
        "M. Liepe",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "Initial vertical RF test results and quench studies for six of the eight undressed 9 cell cavities slated for use in the Jefferson laboratory LCLS-II prototype cryomodule were presented at",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb040.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB040",
      "page_number": "178",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB041",
      "title": "Cryomodule Testing of Nitrogen-Doped Cavities",
      "authors": [
        "D. Gonnella",
        "B. Clasby",
        "R.G. Eichhorn",
        "B. Elmore",
        "F. Furuta",
        "G.M. Ge",
        "D.L. Hall",
        "Y. He",
        "G.H. Hoffstaetter",
        "J.J. Kaufman",
        "P.N. Koufalis",
        "M. Liepe",
        "J.T. Maniscalco",
        "T.I. O'Connell",
        "P. Quigley",
        "D.M. Sabol",
        "E.N. Smith",
        "V. Veshcherevich",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "A. Grassellino",
        "C.J. Grimm",
        "J.P. Holzbauer",
        "O.S. Melnychuk",
        "Y.M. Pischalnikov",
        "A. Romanenko",
        "W. Schappert",
        "D.A. Sergatskov",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "A.D. Palczewski",
        "C.E. Reece",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The Linac Coherent Light Source-II (LCLS-II) is a new FEL x-ray source that is planned to be constructed in the existing SLAC tunnel. In order to meet the required high Q0 specification of 2.7x1010 at 2 K and 16 MV/m",
        "nitrogen-doping has been proposed as a preparation method for the SRF cavities in the linac. In order to test the feasibility of these goals",
        "four nitrogen-doped cavities have been tested at Cornell in the Horizontal Test Cryomodule (HTC) in five separate tests. The first three tests consisted of cavities assembled in the HTC with high Q input coupler. The fourth test used the same cavity as the third but with the prototype high power LCLS-II coupler installed. Finally",
        "the fifth test used a high power LCLS-II coupler",
        "cavity tuner",
        "and HOM antennas. Here we report on the results from these tests along with a systematic analysis of change in performance due to the various steps in preparing and assembling LCLS-II cavities for cryomodule operation. These results represent one of the final steps to demonstrate readiness for full prototype cryomodule assembly for LCLS-II.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb041.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB041",
      "page_number": "182",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB042",
      "title": "Fundamental Studies on Doped SRF Cavities",
      "authors": [
        "D. Gonnella",
        "T. Gruber",
        "J.J. Kaufman",
        "P.N. Koufalis",
        "M. Liepe",
        "J.T. Maniscalco",
        "B. Yu",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Recently",
        "doping with nitrogen has been demonstrated to help SRF cavities reach significantly higher intrinsic quality factors than with standard procedures. However",
        "the quench fields of these cavities have also been shown to be frequently reduced. Here we report on fundamental studies of doped cavities",
        "investigating the source of reduced quench field and exploring alternative dopants. We have focused on studying the quench of nitrogen-doped cavities with temperature mapping and measurements of the flux penetration field using pulsed power to investigate maximum fields in nitrogen doped cavities. We also report on studies of cavities doped with other gases such as helium. These studies have enabled us to shed light on the mechanisms behind the higher Q and lower quench fields that have been observed in cavities doped with impurities.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb042.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB042",
      "page_number": "187",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB045",
      "title": "Study of Slip and Deformation in High Purity Single Crystal Nb for Accelerator Cavities",
      "authors": [
        "D. Kang",
        "D.C. Baars",
        "T.R. Bieler",
        "Michigan State University",
        "East Lansing",
        "Michigan",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "A. Mapar",
        "F. Pourboghrat",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "High purity Nb has been used to build accelerator cavities over the past couple decades",
        "and there is a growing interest in using ingot Nb as an alternative to the fine grain sheets. Plastic deformation governed by slip is complicated in body-centered cubic metals like Nb. Besides the crystal orientation with respect to the applied stress (Schmid effect)",
        "slip is also affected by other factors including temperature",
        "strain rate",
        "strain history",
        "and non-Schmid effects such as twinning/anti-twinning asymmetry and non-glide shear stresses. A clear understanding of slip is an essential step towards modeling the deep drawing of large grain ingot slices",
        "hence predicting the final microstructure/performance of cavities. Two groups of single crystals",
        "with and without a prior heat treatment",
        "were deformed to 40% engineering strain in uniaxial tension. Differences in flow stresses and active slip systems between the two groups were observed",
        "likely due to the removal of preexisting dislocations. Crystal plasticity modeling of the stress-strain behavior suggests that the non-Schmid effect is small in Nb",
        "and that the deep drawing process might be approximated with a Schmid model.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb045.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB045",
      "page_number": "191",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB047",
      "title": "Secondary Electron Yield of Electron Beam Welded Areas of SRF Cavities",
      "authors": [
        "M. Basovic",
        "S. Popović",
        "M. Tomovic",
        "L. Vušković",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "F. Čučkov",
        "A. Samolov",
        "University of Massachusetts Boston",
        "Boston",
        "Massachusetts",
        "USA",
        "Secondary Electron Emission (SEE) is a phenomenon that contributes to the total electron activity inside the Superconducting Radiofrequency (SRF) cavities during the accelerator operation. SEE is highly dependent on the state of the surface. During electron beam welding process",
        "significant amount of heat is introduced into the material causing the microstructure change of Niobium (Nb). Currently",
        "all simulation codes for field emission and multipacting are treating the inside of the cavity as a uniform",
        "homogeneous surface. Due to its complex shape and fabricating procedure",
        "and the sensitivity of the SEE on the surface state",
        "it would be interesting to see if the Secondary Electron Yield (SEY) parameters vary in the surface area on and near the equator weld. For that purpose",
        "we have developed experimental setup that can measure accurately the energy distribution of the SEY of coupon-like like samples. To test the influence of the weld area on the SEY of Nb",
        "dedicated samples are made from a welded plate using electron beam welding parameters common for cavity fabrication. SEY data matrix of those samples will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb047.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB047",
      "page_number": "196",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB049",
      "title": "High Flux Three Dimensional Heat Transport in Superfluid Helium and Its Application to a Trilateration Algorithm for Quench Localization With OSTs",
      "authors": [
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "TU Dresden",
        "Dresden",
        "Germany",
        "T. Koettig",
        "K.C. Liao",
        "A. Macpherson",
        "CERN",
        "Geneva",
        "Switzerland",
        "KIT",
        "Karlsruhe",
        "Germany",
        "Oscillating superleak transducers of second sound can be used to localize quench spots on superconducting cavities by trilateration. However propagation speeds faster than the velocity of second sound are usually observed imped- ing the localization. Dedicated experiments show that the fast propagation cannot be correlated to the dependence of the velocity on the heat flux density",
        "but rather to boiling effects in the vicinity of the hot spot. 17 OSTs were used to detect quenches on a 704MHz one-cell elliptical cavity. Two different algorithms for quench localization have been tested and implemented in a computer program enabling direct crosschecks. The new algorithm gives more consis- tent results for different OST signals analyzed for the same quench spot."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb049.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB049",
      "page_number": "201",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB050",
      "title": "Characterization of SRF Materials at the TRIUMF muSR Facility",
      "authors": [
        "R.E. Laxdal",
        "T.J. Buck",
        "T. Junginger",
        "P. Kolb",
        "Y.Y. Ma",
        "L. Yang",
        "Z.Y. Yao",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "University of Toronto",
        "Toronto",
        "Ontario",
        "Canada",
        "UBC & TRIUMF",
        "Vancouver",
        "British Columbia",
        "Canada",
        "MuSR is a powerful tool to probe local magnetism and hence can be used to diagnose flux penetration in Type-II superconductors. Samples produced at TRIUMF and with collaborators in both coin shaped and ellipsoidal geometries have been characterized by applying either transverse or parallel fields between 0 and 300mT and measuring flux entry as a function of applied field. Samples include Nb treated in standard ways including forming",
        "chemistry",
        "and heat treatments. Further",
        "Nb samples have been doped with Nitrogen and coated with a 2 micron layer of Nb3Sn by collaborators from FNAL and Cornell respectively and measured in three field/geometry configurations. Analysis of the method in particular the effects of geometry and the role of pinning will be presented. Results of the measurements will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb050.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB050",
      "page_number": "205",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB051",
      "title": "Muon Spin Rotation on Treated Nb Samples in Parallel Field Geometry",
      "authors": [
        "UBC",
        "Vancouver",
        "B.C.",
        "Canada",
        "T.J. Buck",
        "T. Junginger",
        "R.E. Laxdal",
        "G. Morris",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "TUM/Physik",
        "Garching bei München",
        "Germany",
        "UBC & TRIUMF",
        "Vancouver",
        "British Columbia",
        "Canada",
        "MuSR is a powerful tool to probe local magnetism and hence can be used to diagnose the entry of magnetic flux in superconductors. First measurements on SRF samples were done with an external DC field applied perpendicular to the sample1 (transverse geometry) with the muons applied to the sample face. Here the results are strongly impacted by demagnetization",
        "pinning strength and edge effects. A new spectrometer has been developed to allow sample testing with a field varying from 0 to 300mT applied along the sample face (parallel geometry) analogous to rf fields in SRF resonators. The geometry is characterized by a small demagnetization factor reducing the impact of pinning and edge effects on field of first flux entry. The beamline installation and first results comparing transverse and parallel results will be presented.",
        "1 Grassellino et al. Muon spin rotation studies of niobium for superconducting rf applications. Phys. Rev. ST Accel. Beams",
        "16:062002",
        "Jun 2013."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb051.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB051",
      "page_number": "210",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB052",
      "title": "Determination of Bulk and Surface Superconducting Properties of N2-Doped Cold Worked, Heat Treated and Electro-polished SRF Grade Niobium",
      "authors": [
        "S. Chetri",
        "D.C. Larbalestier",
        "Z-H. Sung",
        "ASC",
        "Tallahassee",
        "Florida",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "NHMFL",
        "Tallahassee",
        "Florida",
        "USA",
        "Nitrogen-doped cavities show significant performance improvement in the medium accelerating field regime due to a lowered RF surface resistivity. However",
        "the mechanism of enhancement has not been clearly explained. Our experiments explore how N2-doping influences Nb bulk and surface superconducting properties",
        "and compare the N2-doped properties with those obtained previously with conventionally treated samples. High purity Nb-rod was mechanically deformed and post treated based on a typical SRF cavity treatment recipe. The onset of flux penetration at Hc1",
        "and the upper and the surface critical fields",
        "Hc2 and Hc3",
        "were characterized by magnetic hysteresis and AC susceptibility techniques. The surface depth profile responsible for superconductivity was examined by changing AC amplitude in AC susceptibility",
        "and the microstructure was directly observed with EBSD-OIM. We are also investigating surface chemistry for detailed composition using XPS. We have found that N2-doping at 800 °C significantly reduces the Hc3/Hc2 ratio towards the ideal value of ~1.7",
        "and conclude that AC susceptibility is capable of following changes to the surface properties induced by N2-doping.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [
        "Funding: Support for this work at FSU was from US DOE Award# DE-SC0009960 and the State of Florida Additional support for the National High Magnetic Field Laboratory facilities is from the NSF: NSF-DMR-1157490"
      ],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb052.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB052",
      "page_number": "214",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB054",
      "title": "An Investigation of Correlations Between Mechanical and Microstructural Properties of High Purity Polycrystalline Niobium",
      "authors": [
        "Z. Zhao",
        "T.R. Bieler",
        "D. Kang",
        "Michigan State University",
        "East Lansing",
        "Michigan",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "An understanding of the relationship between mechanical and functional properties",
        "and processing history is essential in order to manufacture polycrystalline niobium cavities with consistent performance. The crystallographic texture (preferred crystal orientation) and microstructure in polycrystalline sheet varies considerably",
        "so identifying its influence on properties is needed to achieve a better understanding of how to control properties of high purity niobium. Samples extracted from many lots produced by Tokyo Denkai and Ningxia sheet were examined. Through-thickness texture of the undeformed niobium samples was measured using electron backscattered pattern mapping. Texture is identified with pole figures",
        "orientation distribution function",
        "and grain misorientation relationships. Stress-strain tests were done to identify ultimate tensile stress",
        "elongation",
        "0.2% yield strength",
        "and hardening rate. From tests on many lots",
        "there is no clear trend between the mechanical and material properties in high purity niobium and correlations between various microstructural and mechanical properties show significant scatter and few apparent correlations.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb054.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB054",
      "page_number": "219",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB055",
      "title": "Characterization of Nitrogen Doping Recipes for the Nb SRF Cavities",
      "authors": [
        "Y. Trenikhina",
        "A. Grassellino",
        "O.S. Melnychuk",
        "A. Romanenko",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "For the future development of the nitrogen doping technology",
        "it’s vital to understand the mechanisms behind the performance benefits of N-doped cavities as well as the performance limitations",
        "such as quench field. Following various doping recipes",
        "cavity cutouts and flat niobium samples have been evaluated with XRD",
        "SEM",
        "SIMS and TEM in order to relate structural and compositional changes in the niobium near-surface to SRF performance. Annealing of Nb cavities with nitrogen for various durations and at various temperatures lead to a layer containing inclusions of non-superconducting Nb nitride phases",
        "followed by unreacted Nb with an elevated N-interstitials concentration. We found that EP of the N-treated cavities removes the unwanted niobium nitride phases",
        "confirming that performance benefits are originating from the elevated concentration of N interstitials. The role of low temperature Nb hydride precipitants in the performance limitation of N-doped cavities was evaluated by TEM temperature dependent studies. Finally",
        "extended characterization of the original cavity cutouts from the N-doped RF tested cavity sheds some light on quenching mechanisms.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb055.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB055",
      "page_number": "223",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB057",
      "title": "Crystal Plasticity Modeling of Single Crystal Nb",
      "authors": [
        "A. Mapar",
        "F. Pourboghrat",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "T.R. Bieler",
        "D. Kang",
        "Michigan State University",
        "East Lansing",
        "Michigan",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Deformation behavior of niobium (Nb) is not thoroughly studied",
        "although it is widely used in manufacturing superconducting cavities. This deficiency of knowledge limits the predictibality in raw material properties for fine grain sheets",
        "which are less anisotropic and easier to deform uniformly than large grain sheets. Studies on modeling and simulation of deformation of Nb are also limited. Therefore design of a new manufacturing procedure becomes a costly process",
        "because models predicting the deformation of Nb are not accurate. A polycrystal is an aggregate of single crystals. Tensile tests were performed on single crystal with different orientations",
        "to study the deformation behavior of Nb. A number of crystal plasticity models were developed",
        "calibrated and finally used to predict the deformation of single crystal tensile samples. This study compares the predictions of these models. This provides a foundation for physically realistic polycrystal deformation models.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb057.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB057",
      "page_number": "228",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB058",
      "title": "Field Emission From a Thermally Oxidized Nb Sample",
      "authors": [
        "S. Lagotzky",
        "G. Müller",
        "Bergische Universität Wuppertal",
        "Wuppertal",
        "Germany",
        "Enhanced field emission (EFE) from particulates and surface defects is one of the main field limitations of superconducting Nb cavities required for XFEL and ILC. The activation field Eact of such emitters and the emitter number density N at a given Eact is strongly influenced by the thickness of the Nb oxide layer*. Combination of this effect with surface cleaning techniques",
        "e.g. dry ice cleaning (DIC)",
        "potentially shifts the onset of EFE to even higher Eact. Therefore",
        "we have started to investigate a single crystal Nb sample after thermal oxidation (TO) by a heat treatment (HT) in air (T = 360°C",
        "t = 40 min). Field emission maps showed a first emitter at 100 MV/m",
        "and N = 30/cm² at 225 MV/m. SEM analysis of the 10 strongest emitters revealed mainly surface defects and one particulate. Subsequent removal of the oxide by a HT (T = 400°C",
        "t = 1 h) under UHV resulted in an EFE onset at 75 MV/m and increased N to 60/cm² at 225 MV/m. In a second step the TO as well as the measurement was repeated after DIC of the surface. The resulting field maps and the SEM analysis of selected emitters will be reported.",
        "*A.T. Wu et al."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb058.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB058",
      "page_number": "233",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB059",
      "title": "Field Emission Investigation of Centrifugal-Barrel-Polished Nb Samples",
      "authors": [
        "S. Lagotzky",
        "G. Müller",
        "Bergische Universität Wuppertal",
        "Wuppertal",
        "Germany",
        "DESY",
        "Hamburg",
        "Germany",
        "A.L. Prudnikava",
        "Y. Tamashevich",
        "University of Hamburg",
        "Institut für Experimentalphysik",
        "Hamburg",
        "Germany",
        "Actual and future SRF-accelerators require high accelerating gradient Eacc and quality factor Q0",
        "which are often limited by enhanced field emission (EFE)* caused by surface roughness or particulates**. Various expensive surface preparation techniques (e.g. BCP",
        "EP",
        "HPR etc.) have been developed to obtain the required surface quality and remove the emitters. Recently",
        "centrifugal barrel polishing (CBP) has been reconsidered to obtain a comparable surface roughness as EP with less effort***. We have started to investigate Nb samples",
        "which were prepared as coupons in a single cell 1.3 GHz cavity by an optimized five step CBP process with a final dry ice cleaning. EFE maps showed the first emitter (1 nA) at 60 MV/m",
        "and 32 emitters at 110 MV/m. SEM/EDX analysis of the emitting sites revealed many Al2O3 inclusions with sharp edges. Therefore",
        "subsequent BCP (~20 μm removal) was applied to the sample. Surface analysis as well as EFE characterization of CBP treated Nb coupons with/without BCP step will be presented.",
        "*D. Reschke et al."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb059.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB059",
      "page_number": "237",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB060",
      "title": "A GPU Based 3D Particle Tracking Code for Multipacting Simulation",
      "authors": [
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "S.A. Belomestnykh",
        "I. Ben-Zvi",
        "J.C. Brutus",
        "V. Litvinenko",
        "I. Pinayev",
        "J. Skaritka",
        "Q. Wu",
        "B. P. Xiao",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [
        "Funding: This work was carried out at Brookhaven Science Associates, LLC under Contracts No. DE-AC02-98CH10886 and at Stony Brook University under grant DE-SC0005713 with the U.S. DOE."
      ],
      "abstract": "A new GPU based 3D electron tracking code is developed at BNL and benchmarked with both popular existing parallel tracking code and experimental results. The code takes advantage of massive concurrency of GPU cards to track electrons under RF field in 3D Tetrahedron meshed structures. Approximately ten times of FLOPS can be achieved by utilizing GPUs compare to CPUs with same level of power consumption. Different boundary materials can be specified and the 3D EM field can be imported from the result of Omega3P calculation. CUDAOpenGL interop was implemented so that the emerging of multipactors can be monitored in real time while the simulation is undergoing. Code also has GPU farm version that can run on multiple GPUs to further increase the turnover of multipacting simulation. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb060.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB060",
      "page_number": "242",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB061",
      "title": "Suppression of Upstream Field Emission in RF Accelerators",
      "authors": [
        "F. Marhauser",
        "S.V. Benson",
        "D. Douglas",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "ASML US Inc.",
        "Wilton",
        "CT",
        "USA",
        "So-called electron loading is the primary cause for cavity performance limitations in modern RF accelerating cavities. In superconducting RF cavities in particular",
        "the onset of parasitic electron effects may start at field levels as low as a few MV/m. Electron loading can be attributed to mainly three phenomena: field emission",
        "multiple impact electron amplification",
        "and RF electrical breakdown. Field emission has been a persistent issue despite advances in SRF technology",
        "whereas RF electrical breakdown and multipacting can be controlled by appropriate cavity design choices. Field emission becomes a major concern when the electrons emitted are captured by the accelerating RF field and directed along the beam axis through a series of cavities or even entire cryomodules. Consequently",
        "electrons can accumulate energy comparable to that of the main beam over similar distances. This can represent a considerable dark current",
        "which can travel downstream or upstream depending on the field-emitting site of origin. In this paper",
        "a method is presented that can significantly suppress the upstream field emission by design.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb061.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB061",
      "page_number": "246",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB063",
      "title": "Design of the Superconducting LINAC for SARAF",
      "authors": [
        "CEA",
        "Gif-sur-Yvette",
        "France",
        "N. Bazin",
        "L. Boudjaoui",
        "R. Cubizolles",
        "G. Ferrand",
        "P. Hardy",
        "C. Pes",
        "N. Sellami",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "GANIL",
        "Caen",
        "France",
        "P. Brédy",
        "B. Gastineau",
        "N. Pichoff",
        "CEA/DSM/IRFU",
        "France",
        "CEA is committed to delivering a Medium Energy Beam Transfer line and a superconducting linac (SCL) for SARAF accelerator in order to accelerate 5mA beam of either protons from 1.3 MeV to 35 MeV or deuterons from 2.6 MeV to 40.1 MeV. The SCL consists 4 cryomodules equipped with warm diagnostics. The first two identical cryomodules host 6 half-wave resonator (HWR) low beta cavities (β = 0.091)",
        "176 MHz. As the last two identical welcome 7 HWR high-beta cavities (β = 0.181)",
        "176 MHz. The beam is focused through the superconducting solenoids located between cavities housing steering coils. A Beam Position Monitor is placed upstream each solenoid. A diagnostic box containing a beam profiler",
        "a bunch length monitor and a vacuum pump will be inserted between 2 consecutive cryomodules. The HWR cavities",
        "the solenoid package and the cryomodules are being designed. These studies will be presented in this poster.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb063.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB063",
      "page_number": "250",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB065",
      "title": "Recent Measurements on the SC 325 MHz CH-Cavity",
      "authors": [
        "M. Busch",
        "M. Amberg",
        "M. Basten",
        "F.D. Dziuba",
        "H. Podlech",
        "U. Ratzinger",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "HIM",
        "Mainz",
        "Germany",
        "At the Institute for Applied Physics (IAP)",
        "Frankfurt University",
        "a sc 325 MHz CH-Cavity has been designed and fabricated. Successful tests at 4 K and 2 K with gradients up to 14.1 MV/m have been performed. The cavity is destined for a 11.4 AMeV 10 mA ion beam at the GSI UNILAC",
        "Darmstadt. Consisting of 7 gaps and a geometrical beta of 0.16 this resonator is designed to provide a gradient of 5 MV/m. Novel features of this structure comprise a compact design",
        "low electric peak fields",
        "improved surface processing possibilities and power coupling. In addition a tuner system based on mechanically deformable bellow tuners attached inside the cavity and driven either by a stepping motor or a piezo actuator will keep the cavity on resonance. This contribution reports about the latest measurements on the cavity with the recently attached helium vessel and a renewed surface processing."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb065.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB065",
      "page_number": "255",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB066",
      "title": "R&D Status of the New Superconducting CW Heavy Ion LINAC@GSI",
      "authors": [
        "M. Basten",
        "M. Busch",
        "F.D. Dziuba",
        "D. Mäder",
        "H. Podlech",
        "M. Schwarz",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "M. Amberg",
        "K. Aulenbacher",
        "M. Miski-Oglu",
        "HIM",
        "Mainz",
        "Germany",
        "W.A. Barth",
        "V. Gettmann",
        "M. Heilmann",
        "S. Mickat",
        "GSI",
        "Darmstadt",
        "Germany",
        "To keep the ambitious Super Heavy Element (SHE) physics program at GSI competitive a superconducting (sc) continuous wave (cw) high intensity heavy ion LINAC is currently under progress as a multi-stage R&D program of GSI",
        "HIM and IAP*. The baseline linac design consists of a high performance ion source",
        "a new low energy beam transport line",
        "an (cw) upgraded High Charge State Injector (HLI)",
        "and a matching line (1.4 MeV/u) which is followed by the new sc-DTL LINAC for post acceleration up to 7.3 MeV/u. In the present design the new cw-heavy ion LINAC comprises constant-beta sc Crossbar-H-mode (CH) cavities operated at 217 MHz. The advantages of the proposed beam dynamics concept applying a constant beta profile are easy manufacturing with minimized costs as well as a straightforward energy variation**. An important milestone will be the full performance test of the first CH cavity (Demonstrator)",
        "in a horizontal cryo module with beam. An advanced demonstrator setup comprising a string of cavities and focussing elements is proposed to build from 10 short CH-cavities with 8 gaps. The corresponding simulations and technical layout of the new cw heavy ion LINAC will be presented.",
        "* W. Barth et al.",
        "Further R&D for a new Superconducting cw Heavy Ion LINAC@GSI"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb066.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB066",
      "page_number": "258",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB067",
      "title": "Steps Towards Superconducting CW-LINAC for Heavy Ions at GSI",
      "authors": [
        "M. Miski-Oglu",
        "M. Amberg",
        "K. Aulenbacher",
        "V. Gettmann",
        "HIM",
        "Mainz",
        "Germany",
        "W.A. Barth",
        "M. Heilmann",
        "S. Mickat",
        "S. Yaramyshev",
        "GSI",
        "Darmstadt",
        "Germany",
        "M. Basten",
        "D. Bänsch",
        "F.D. Dziuba",
        "H. Podlech",
        "U. Ratzinger",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "Providing heavy ion beams for the ambitious experiment program at GSI",
        "the Universal Linear Accelerator (UNILAC) serves as a powerful high duty factor (25%) accelerator. Beam time availability for SHE-research will be decreased due to the limitation of the UNILAC providing a proper beam for FAIR simultaneously. To keep the GSI-SHE program competitive on a high level",
        "a standalone sc cw-LINAC in combination with the upgraded GSI High Charge State injector is planned to build. In preparation for this the first linac section (financed by HIM and partly by HGF-ARD-initiative) will be tested in 2015 as a demonstrator. After successful testing the construction of an extended cryomodule comprising two further",
        "but shorter CH cavities is foreseen to test until end of 2017. In this contribution the measurement of the beam parameters at the entrance of CW-Demonstartor",
        "the preliminary simulation of beam dynamics for the first stage of advanced demonstrator will be presented. As a final R&D step towards an entire linac an advanced cryo module comprising up to five CH cavities is envisaged for 2019 serving for first user experiments at the coulomb barrier."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb067.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB067",
      "page_number": "262",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB068",
      "title": "Pulsed SC Ion Linac as an Injector to Booster of Electron Ion Collider",
      "authors": [
        "P.N. Ostroumov",
        "Z.A. Conway",
        "B. Mustapha",
        "ANL",
        "Argonne",
        "USA",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "The electron-ion collider (EIC) being developed at JLAB requires a new ion accelerator complex (IAC). The IAC includes a new linac and a booster accelerator facility. The new facility is required for the acceleration of ions from protons to lead for colliding beam experiments with electrons in the EIC storage ring. Originally",
        "we proposed a pulsed linac which is based upon a NC front end",
        "< 5 MeV/u",
        "with a SC section for energies > 5 MeV/u and capable of providing 285 MeV protons and ~100 MeV/u lead ions for injection into the IAC booster. A recent cost optimization study of the IAC suggested that lower injection energy into the booster may reduce the overall project cost with ~120 MeV protons and ~40 MeV/u lead ions. Stronger space charge effects in the booster caused by lower injection energy will be mitigated by the booster design. In this paper we discuss both linac options.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb068.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB068",
      "page_number": "265",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB069",
      "title": "Superconducting Linac Upgrade Plan for the Second Target Station Project at SNS",
      "authors": [
        "S.-H. Kim",
        "M. Doleans",
        "J. Galambos",
        "M.P. Howell",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "ORNL RAD",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "The beam power of the Linac for the Second Target Station (STS) at the Spallation Neutron Source (SNS) will be doubled to 2.8 MW. For the energy upgrade seven additional cryomodules will be installed in the reserved space at the end of the linac tunnel to produce the linac output energy of 1.3 GeV. The cryomodules for STS will have some changes that do not require changes of overall layout based on the lessons learned from operational experience over the last 10 years and the high beta spare cryomodule developed in house. The average macro-pulse beam current for the STS will be 38 mA that is about 40 % increase from that for the present 1.4 MW operation. Plans for the existing cryomodules to support higher beam current for the STS is also presented in this paper. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb069.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB069",
      "page_number": "268",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB070",
      "title": "Preliminary Conceptual Design of the CEPC SRF System",
      "authors": [
        "J.Y. Zhai",
        "J. Gao",
        "T.M. Huang",
        "Z.C. Liu",
        "Z.H. Mi",
        "P. Sha",
        "Y. Sun",
        "H.J. Zheng",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "Università degli Studi di Milano & INFN",
        "Segrate",
        "Italy",
        "CEPC is a circular electron positron collider operating at 240 GeV center-of-mass energy as a Higgs factory",
        "recently proposed by the Chinese high energy physics community. The CEPC study group",
        "together with the FCC and ILC community",
        "will contribute to the development of future high energy colliders and experiments which will ensure that the elementary particle physics remain a vibrant and exciting field of fundamental investigation for decades to come. Superconducting RF (SRF) system is one of the most important technical systems of CEPC and is a key to achieving its design energy and luminosity. It will dominate",
        "with the associated RF power source and cryogenic system",
        "the overall machine cost",
        "efficiency and performance. The CEPC SRF system will be one of the largest and most powerful SRF accelerator installations in the world. The preliminary conceptual design of the CEPC SRF system is summarized in this paper",
        "including the machine layout",
        "key parameter choices and some critical issues such as HOM damping",
        "emphasizing the new technology requirement and R&D focuses.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb070.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB070",
      "page_number": "272",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB071",
      "title": "Technology Readiness Levels Applied to Current SRF Accelerator Technology for ADS",
      "authors": [
        "PAVAC",
        "Richmond",
        "B.C.",
        "Canada",
        "R.E. Laxdal",
        "L. Yang",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "Accelerator Driven Systems (ADS) are comprised of high power accelerators supplying a proton beam to a reactor vessel. The reactor vessel could contain fuels such as used uranium nuclear fuels or Thorium. The proton beam will be used to produce Neutrons by spallation in the reactor vessel. Technology readiness levels (TRL’s) can be used to chart technology status with respect to end goal and as such can be used to outline a road map to complete an ADS system. TRL1 defines basic principles observed and reported",
        "whereas TRL9 is defined as system ready for full scale deployment. SRF technology when applied to ADS reflects a mix of TRL levels since worldwide many SRF Accelerators are in operation. The paper will identify the building blocks of an ADS accelerator and analyze each for technical readiness for industrial scale deployment. The integrated ADS structure is far more complex than the individual systems",
        "but the use of proven sub-systems allows to build SRF accelerators that could deliver the beam required. An analysis of the technical readiness of SRF technology for ADS will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb071_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb071.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb071_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB071",
      "page_number": "276",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB072",
      "title": "Characterization of Surface Defects on EXFEL Series and ILC-Higrade Cavities",
      "authors": [
        "A. Navitski",
        "E. Elsen",
        "V. Myronenko",
        "J. Schaffran",
        "O. Turkot",
        "DESY",
        "Hamburg",
        "Germany",
        "University of Hamburg",
        "Institut für Experimentalphysik",
        "Hamburg",
        "Germany",
        "Inspection of the inner cavity surface by an optical system is an inexpensive and useful means for surface control and identification of critical or suspicious features. Optical inspection of around 100 EXFEL series and ILC-HiGrade cavities has been performed recently using the high-resolution OBACHT system. It is a semi-automated tool based on the Kyoto camera. To gain information about the 3D topography of surface features or defects",
        "a replica technique has been applied additionally. This is a non-destructive surface-study method reaching resolution down to 1 μm by imprinting the details of the surface onto a hardened rubber. The footprint is subsequently investigated with a microscope or profilometer. Based on these studies",
        "several defects on the surface have been found and classified. Most of the cavity failures leading e.g. to field limitations below 20 MV/m have been identified and corresponding feedback given to the production cycle. Typical surface features and defects as well as their influence on the cavity performance will be presented and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb072_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb072.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb072_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB072",
      "page_number": "281",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB073",
      "title": "Surface Analyses and Optimization of Centrifugal Barrel Polishing of Nb Cavities",
      "authors": [
        "A. Navitski",
        "E. Elsen",
        "B. Foster",
        "DESY",
        "Hamburg",
        "Germany",
        "B. Foster",
        "A.L. Prudnikava",
        "Y. Tamashevich",
        "University of Hamburg",
        "Institut für Experimentalphysik",
        "Hamburg",
        "Germany",
        "Centrifugal barrel polishing (CBP) is an acid-free surface-polishing technique based on abrasive media. It considerably reduces the usage of chemicals in the preparation of Nb cavities",
        "typically leaving only a final light electropolishing (EP) and achieves considerably smaller roughness than in chemical treatments alone. CBP addresses in particular the removal of pits",
        "welding spatters",
        "deep scratches",
        "and foreign material inclusions that occasionally occur in the production process. A mirror-smooth surface without chemical contamination is also an important enabling step for thin films. Recent results indicate",
        "however",
        "the need of further optimizations",
        "mainly to reduce the surface damaged layer as well as the pollution by the polishing media. A dedicated study of the CBP process using a “coupon” cavity facilitates better polishing characterisation and optimisation by direct measurements of the roughness",
        "removal rate",
        "and removal profile as well as the amount of contamination left behind and determination of a best combination of the CBP and chemical polishing. Results of the coupon-studies and perspectives of the optimizations will be presented and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb073.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB073",
      "page_number": "286",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB074",
      "title": "CERN’s Bulk Niobium High Gradient SRF Programme: Developments and Recent Cold Test Results",
      "authors": [
        "A. Macpherson",
        "K.G. Hernández-Chahín",
        "C. Jarrige",
        "P. Maesen",
        "F. Pillon",
        "K.M. Schirm",
        "R. Torres-Sanchez",
        "N. Valverde Alonso",
        "CERN",
        "Geneva",
        "Switzerland",
        "DCI-UG",
        "León",
        "Mexico",
        "Recent results from the bulk niobium high-gradient cavity development program at CERN are presented",
        "with particular focus on test results for the 704 MHz bulk niobium 5-cell elliptical cavity prototypes produced for the Superconducting Proton Linac (SPL) project. Successive cold tests of bare cavities have been used to refine the cavity preparation and testing process",
        "with all steps done in-house at CERN. Current performance results are discussed with reference to observables such as ambient magnetic field",
        "field emission levels",
        "and quenches.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "K.G. Hernández-Chahín reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb074.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB074",
      "page_number": "291",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB075",
      "title": "Experiences on Retreatment of EU-XFEL Series Cavities at DESY",
      "authors": [
        "A. Matheisen",
        "N. Krupka",
        "S. Saegebarth",
        "P. Schilling",
        "N. Steinhau-Kühl",
        "B. van der Horst",
        "DESY",
        "Hamburg",
        "Germany",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [
        "For the European XFEL (EU-XFEL), two industrial companies are responsible for the manufacture and surface preparation of the eight hundred superconducting cavities. The companies had to strictly follow the XFEL specification and document all production and preparation steps. No performance guaranties were required. Each cavity delivered by industry to DESY is tested in a vertical test at 2K. Resonators not reaching the performances defined for application at the EU-XFEL linear accelerator modules or showing leakage during cold RF tests have undergone a subsequent retreatment at DESY. Nearly 20% of the cavity production required retreatment, most of them by an additional high pressure rinsing. Some cavities received additional chemical treatment by BCP flash after the initial HPR did not cure the problem. The analysis of retreatments and quality control data available from the retreatment sequences and the workflow of retreatment will be presented."
      ],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb075.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB075",
      "page_number": "296",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB076",
      "title": "Horizontal RF Test of a Fully Equipped 3.9 GHz Cavity for the European XFEL in the DESY AMTF",
      "authors": [
        "C.G. Maiano",
        "C. Albrecht",
        "R. Bospflug",
        "J. Branlard",
        "Ł. Butkowski",
        "T. Delfs",
        "J. Eschke",
        "A. Gössel",
        "F. Hoffmann",
        "M. Hüning",
        "K. Jensch",
        "R. Jonas",
        "R. Klos",
        "D. Kostin",
        "W. Maschmann",
        "A. Matheisen",
        "U. Mavrič",
        "W.-D. Möller",
        "C. Müller",
        "K. Mueller",
        "B. Petersen",
        "P. Pierini",
        "J. Rothenburg",
        "O. Sawlanski",
        "M. Schmökel",
        "A.A. Sulimov",
        "E. Vogel",
        "DESY",
        "Hamburg",
        "Germany",
        "A. Bosotti",
        "M. Moretti",
        "R. Paparella",
        "P. Pierini",
        "D. Sertore",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "In order to validate the cavity package concept before the module preparation for the European XFEL Injector",
        "one 3.9 GHz cavity",
        "complete with magnetic shielding",
        "power coupler and frequency tuner was tested in a specially designed single cavity cryomodule in one of the caves of the DESY Accelerator Module Test Facility (AMTF). The cavity was tested in high power pulsed operation up to the quench limit of 24 MV/m",
        "above the vertical test qualifications and all subsystems under test (coupler",
        "tuner",
        "waveguide tuners",
        "LLRF system) were qualified to design performances.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb076.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB076",
      "page_number": "301",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB077",
      "title": "Vertical Tests of XFEL 3rd Harmonic Cavities",
      "authors": [
        "D. Sertore",
        "M. Bertucci",
        "A. Bosotti",
        "J.F. Chen",
        "C.G. Maiano",
        "P. Michelato",
        "L. Monaco",
        "M. Moretti",
        "R. Paparella",
        "P. Pierini",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "A. Matheisen",
        "M. Schmökel",
        "DESY",
        "Hamburg",
        "Germany",
        "Università degli Studi di Milano & INFN",
        "Segrate",
        "Italy",
        "The 10 cavities of the EXFEL 3rd Harmonic Cryomodule have been tested and qualified",
        "before integration in the He-tank",
        "in our upgraded Vertical Test stand. In this paper",
        "we report the measured RF performance of these cavities together with the main features of the test facility.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb077.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB077",
      "page_number": "306",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB078",
      "title": "Mode Sensitivity Analysis of 704.4 MHz Superconducting RF Cavities",
      "authors": [
        "K. Papke",
        "F. Gerigk",
        "S. Horvath-Mikulas",
        "S. Papadopoulos",
        "E. Pilicer",
        "F. Pillon",
        "CERN",
        "Geneva",
        "Switzerland",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "Due to the large variety of beam patterns considered for the superconducting proton linac (SPL) at CERN it is likely that the frequencies of some HOMs are close to machine lines during operation. Hence",
        "in the interest of developing a method to shift HOM frequencies away from machine lines",
        "we study the influence of cavity detuning and re-tuning (e.g. by Lorentz forces",
        "field flatness tuning",
        "frequency tuning during operation) on HOMs. The sensitivity of HOMs with respect to the fundamental mode was studied for a mono-cell and for 5-cell high-beta SPL cavities operating at 704.4 MHz. First",
        "the variation of the HOMs during the flat-field tuning was measured. In this process",
        "several detuning and re-tuning cycles were made to estimate the range of possible HOM frequency shifts. Secondly the effect of the frequency tuner on the HOMs is presented and finally the frequency shifts of all modes due to the cool down.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb078.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB078",
      "page_number": "311",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB079",
      "title": "Analysis of the Test Rate for European XFEL Series Cavities",
      "authors": [
        "J. Schaffran",
        "S. Aderhold",
        "D. Reschke",
        "L. Steder",
        "N. Walker",
        "DESY",
        "Hamburg",
        "Germany",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "The main part of the superconducting European XFEL linear accelerator consists of 100 accelerator modules each containing eight RF-cavities. Before the installation to a module",
        "all of these cavities will be tested at cryogenic temperatures in a vertical cryostat in the accelerator module test facility (AMTF) at DESY. This paper discusses the average vertical test rate at the present status. It should be 1 in the ideal case",
        "but actually it’s observed to be approximately 1.5. Classification and analysis concerning the reasons for this deviation are given as well as suggestions for a reduction of the test rate for future production cycles."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb079_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb079.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb079_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB079",
      "page_number": "316",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB080",
      "title": "Update and Status of Test Results of the XFEL Series Accelerator Modules",
      "authors": [
        "M. Wiencek",
        "K. Kasprzak",
        "A. Zwozniak",
        "IFJ-PAN",
        "Kraków",
        "Poland",
        "D. Kostin",
        "D. Reschke",
        "N. Walker",
        "DESY",
        "Hamburg",
        "Germany",
        "The European X-ray Free Electron Laser is under construction at DESY",
        "Hamburg. During preparation for tunnel installation 100 Cryomodules are tested in a dedicated facility on the DESY campus. Up to now around 50 cryomodules have been measured at 2K. This paper describes the current status of the measurements",
        "especially single cavity limitations. In addition we present a comparison between the vertical test results of the individual cavities and the corresponding performance measurements of the cavities once assembled into the accelerator string inside the cryomodule.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb080.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB080",
      "page_number": "319",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB083",
      "title": "Cooling Front Measurement of a 9-Cell Cavity via the Multi-Cell Temperature-Mapping System at Cornell University",
      "authors": [
        "G.M. Ge",
        "R.G. Eichhorn",
        "F. Furuta",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Cooling speed significantly affects flux trapping of a SRF cavity",
        "which will determine the residual resistance and the quality factor of the cavity. We measured the temperature distribution of a 9-cell cavity at different cooling speeds by the multi-cell T-map system of Cornell University. This paper proposed a method to evaluate the formation of a normal conducting island at different cooling speed. The fast cool-down and slow cool-down has been compared. We conclude that the slow cool-down freezes less normal conducting islands.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb083_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb083.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb083_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB083",
      "page_number": "324",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB084",
      "title": "Performance of Nitrogen-Doped 9-Cell SRF Cavities in Vertical Tests at Cornell University",
      "authors": [
        "G.M. Ge",
        "R.G. Eichhorn",
        "B. Elmore",
        "F. Furuta",
        "D. Gonnella",
        "T. Gruber",
        "G.H. Hoffstaetter",
        "J.J. Kaufman",
        "M. Liepe",
        "T.I. O'Connell",
        "J. Sears",
        "E.N. Smith",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Cornell University treated five LCLS-II 9-cell cavities by nitrogen-doping recipe. In this paper",
        "we reported the performance of these 9-cell cavities. In the treatments",
        "the nitrogen recipes are slightly different. The cavities have been firstly doped under high nitrogen pressure; after the vertical tests some of the cavities has been reset the surface and re-doped under light nitrogen pressure. The detail of the cavity preparation and test results will be shown. The comparison of the different recipes will be discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb084_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb084.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb084_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB084",
      "page_number": "328",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB085",
      "title": "Efforts of the Improvement of Cavity Q-Value by Plasma Cleaning Technology: Plan and Results From Cornell University",
      "authors": [
        "G.M. Ge",
        "F. Furuta",
        "G.H. Hoffstaetter",
        "M. Liepe",
        "J. Sears",
        "V. Veshcherevich",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "We reported the plasma works at Cornell University. The plasma has been generated for 1) surface cleaning to reduce field emission; 2) the cavity quality factor improvement. The experiment design",
        "including RF design",
        "the gas type and pressure selection",
        "the external DC magnetic field calculation",
        "had been discussed. The plasma experiment set-up by using a 1.3GHz single-cell cavity is shown. Argon and helium plasma was successfully ignited in the cavity; the results of the plasma processing will be displayed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb085_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb085.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb085_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB085",
      "page_number": "333",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB086",
      "title": "Update and Status of Vertical Test Results of the European XFEL Series Cavities",
      "authors": [
        "N. Walker",
        "D. Reschke",
        "J. Schaffran",
        "L. Steder",
        "DESY",
        "Hamburg",
        "Germany",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "IFJ-PAN",
        "Kraków",
        "Poland",
        "The series production by two industrial vendors of the 800 1.3-GHz superconducting cavities for the European XFEL has been on-going since the beginning of 2013 and will conclude towards the end of this year. As of publication some 740 cavities (~93%) have been produced at an average rate of 6 cavities per week. As part of the acceptance testing",
        "all cavities have undergone at least one vertical RF test at 2K at the AMTF facility at DESY. The acceptance criterion for module assembly is based on the concept of a “usable gradient”",
        "which is defined as the maximum field taking into account Q0 performance and allowed thresholds for field emission",
        "as well as breakdown limits. Approximate 20% of the cavities have undergone further surface treatment in the DESY infrastructure to improve their usable gradient performance. In this paper we present the performance statistics of the vertical test results",
        "as well as an analysis of the limiting criteria for the usable gradient",
        "and finally the impact of the surface retreatment on both usable gradient and Q0.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb086_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb086.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb086_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB086",
      "page_number": "337",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB087",
      "title": "Integrated High-Power Tests of Dressed N-doped 1.3 GHz SRF Cavities for LCLS-II",
      "authors": [
        "N. Solyak",
        "T.T. Arkan",
        "B.E. Chase",
        "A.C. Crawford",
        "E. Cullerton",
        "I.V. Gonin",
        "A. Grassellino",
        "C.J. Grimm",
        "A. Hocker",
        "J.P. Holzbauer",
        "T.N. Khabiboulline",
        "O.S. Melnychuk",
        "J.P. Ozelis",
        "T.J. Peterson",
        "Y.M. Pischalnikov",
        "K.S. Premo",
        "A. Romanenko",
        "A.M. Rowe",
        "W. Schappert",
        "D.A. Sergatskov",
        "R.P. Stanek",
        "G. Wu",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "New auxiliary components have been designed and fabricated for the 1.3 GHz SRF cavities comprising the LCLS-II linac. In particular",
        "the LCLS-II cavity’s helium vessel",
        "high-power input coupler",
        "higher-order mode (HOM) feedthroughs",
        "magnetic shielding",
        "and cavity tuning system were all designed to meet LCLS-II specifications. Integrated tests of the cavity and these components were done at Fermilab’s Horizontal Test Stand (HTS) using several kilowatts of continuous-wave (CW) RF power. The results of the tests are summarized here.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb087_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb087.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb087_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB087",
      "page_number": "342",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB088",
      "title": "HOM Measurements on the ARIEL eLINAC Cryomodules",
      "authors": [
        "P. Kolb",
        "R.E. Laxdal",
        "Y. Ma",
        "Z.Y. Yao",
        "V. Zvyagintsev",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "The ARIEL eLINAC is a 50 MeV",
        "10 mA electron LINAC designed for the creation of rare isotopes via photo-fission. Future upgrade plans include the addition of a recirculating beam line to allow for either further energy increase of the beam beyond 50 MeV or to operate a free electron laser in an energy recovery mode. For both recirculating LINAC and ERL the higher order modes (HOM) have to be sufficiently suppressed to prevent beam-break-up. The design of the 1.3 GHz nine-cell cavity incorporated this requirement by including beam line absorbers on both ends of each cavity and an asymmetric beam pipe configuration on the cavity to allow trapped modes to propagate to the beam line absorbers. Measurements of the higher order modes on the completed injector cryomodule and the first cavity in the accelerating cryomodules will be shown and compared to simulations.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb088_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb088.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb088_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB088",
      "page_number": "347",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB089",
      "title": ".3 GHz Cavity Test Program for ARIEL",
      "authors": [
        "P. Kolb",
        "P.R. Harmer",
        "J.J. Keir",
        "D. Kishi",
        "D. Lang",
        "R.E. Laxdal",
        "H. Liu",
        "Y. Ma",
        "T. Shishido",
        "B.S. Waraich",
        "Z.Y. Yao",
        "V. Zvyagintsev",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "E. Bourassa",
        "R.S. Orr",
        "D. Trischuk",
        "University of Toronto",
        "Toronto",
        "Ontario",
        "Canada",
        "KEK",
        "Ibaraki",
        "Japan",
        "The ARIEL eLINAC is a 50 MeV 10 mA electron LINAC. Once finished",
        "five cavities will each provide 10MV of effective accelerating voltage. At the present time two cavities have been installed and successfully accelerated been above specifications of 10 MV/m at a Q0 of 1010. The next cavities are already in the pipeline and being processed. In addition",
        "one additional cavity has been produced for our collaboration with VECC",
        "India. This cavity has been tested and installed in a cryomodule identical to the eLINAC injector cryomodule. New developments for single cell testing at TRIUMF are a T-mapping system developed in collaboration with UoT and vertical EP for single cells. The progress of the performance after each treatment step has been measured and will be shown. measured and will be shown.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb089_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb089.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb089_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB089",
      "page_number": "350",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB090",
      "title": "Analysis of Degraded Cavities in Prototype Modules for the European XFEL",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "S. Aderhold",
        "D. Kostin",
        "A. Matheisen",
        "A. Navitski",
        "D. Reschke",
        "DESY",
        "Hamburg",
        "Germany",
        "In-between the fabrication and the operation in an accelerator the performance of superconducting RF cavities is typically tested several times. Although the assembly is done under very controlled conditions in a clean room",
        "it is observed from time to time that a cavity with good performance in the vertical acceptance test shows deteriorated performance in the accelerator module afterwards. This work presents the analysis of several such cavities that have been disassembled from modules of the prototype phase for the European XFEL for detailed investigation like additional rf tests",
        "optical inspection and replica.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb090_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb090.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb090_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB090",
      "page_number": "355",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB092",
      "title": "Economics of Electropolishing Niobium SRF Cavities in Eco-Friendly Aqueous Electrolytes Without Hydrofluoric Acid",
      "authors": [
        "E.J. Taylor",
        "T.D. Hall",
        "M.E. Inman",
        "S.T. Snyder",
        "Faraday Technology",
        "Inc.",
        "Clayton",
        "Ohio",
        "USA",
        "AES",
        "Medford",
        "New York",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "A major challenge for industrialization of SRF cavity fabrication and processing is developing a supply chain to meet the high production demands of the ILC prior to establishment of a long term market need. Conventional SRF cavity electropolishing is based on hydrofluoric-sulfuric acid mixtures. In comparison, FARADAYIC® Bipolar EP applies pulse reverse electrolysis in dilute sulfuric acid-water solutions without hydrofluoric acid and offers substantial savings in operating and capital costs. Based on a preliminary economic analysis of the cavity processing requirements associated with the ILC, we project the cost of FARADAYIC® Bipolar EP to be about 27% that of the Baseline EP. In terms of tangible cost savings, the cost per cavity for the FARADAYIC® Bipolar EP and Baseline EP are \\1,293 and \\4,828, respectively. The “eco-friendly” intangible cost savings are generally accepted although the cost savings in terms of material degradation and maintenance are difficult to quantify at this time. Continued development and validation of FARADAYIC® Bipolar EP on nine cell cavities will contribute greatly to the industrialization of SRF accelerator technology. Work supported by DOE Grant Nos. DE-SC0011235 and DE-SC0011342 and DOE Purchase Order No. 594128. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb092_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb092.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb092_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB092",
      "page_number": "359",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB093",
      "title": "Vertical Electropolishing Studies at Cornell",
      "authors": [
        "F. Furuta",
        "B. Elmore",
        "G.M. Ge",
        "T. Gruber",
        "G.H. Hoffstaetter",
        "D.K. Krebs",
        "J. Sears",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "T.D. Hall",
        "M.E. Inman",
        "S.T. Snyder",
        "E.J. Taylor",
        "Faraday Technology",
        "Inc.",
        "Clayton",
        "Ohio",
        "USA",
        "H. Hayano",
        "T. Saeki",
        "KEK",
        "Ibaraki",
        "Japan",
        "Y.I. Ida",
        "K.N. Nii",
        "MGH",
        "Hyogo-ken",
        "Japan",
        "Vertical Electro-Polishing (VEP) has been developed and applied on various SRF R&Ds at Cornell as primary surface process of Nb. Recent achievements had been demonstrated with nitrogen doped high-Q cavities for LCLS-II. Five 9-cell cavities processed with VEP and nitrogen doping at Cornell showed the high average Qo value of 3.0·1010 at 16MV/m",
        "2K",
        "during vertical test. this achievement satisfied the required cavity specification values of LCLS-II(2.7·1010 at 16MV/m",
        "2K). We will report the details of these achievements and new VEP collaboration projects between Cornell and companies."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb093_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb093.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb093_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB093",
      "page_number": "364",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB094",
      "title": "Inspection and Repair Techniques for the EXFEL Superconducting 1.3 GHz Cavities at Ettore Zanon S.p.A: Methods and Results",
      "authors": [
        "G. Massaro",
        "G. Corniani",
        "N. Maragno",
        "Ettore Zanon S.p.A.",
        "Schio",
        "Italy",
        "A. Matheisen",
        "A. Navitski",
        "DESY",
        "Hamburg",
        "Germany",
        "P. Michelato",
        "L. Monaco",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "The quality control of the inner surface of superconducting RF cavities is essential in order to assure high accelerating gradient and quality factor. Ettore Zanon S.p.A. (EZ) has implemented in the serial production an optical system that use an high-resolution camera",
        "in order to detect various types of defects. This system is added to a grinding machine",
        "that was specifically designed and built to repair imperfections of the cavities inner surface. This inspection and repair system is applied to recover performance limited cavities of the 1.3 GHz European XFEL project",
        "where surface irregularities are detected",
        "either by the Obacht inspection system at Desy or the optical system at EZ. The optical system and the grinding procedure are qualified using two series cavities limited in gradient and showing different types of surface defects. The performances of these cavities have been recovered to reach the specifications of the project. Until now",
        "all the series XFEL cavities built by EZ",
        "repaired with this technique",
        "have shown an accelerating gradient well above the EXFEL goal."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb094_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb094.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb094_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB094",
      "page_number": "368",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB095",
      "title": "SRF Cavity Processing and Chemical Etching Development for the FRIB Linac",
      "authors": [
        "I.M. Malloch",
        "E.S. Metzgar",
        "L. Popielarski",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "In preparation of a rigorous superconducting RF (SRF) cavity processing and test plan for the production of the Facility for Rare Isotope Beams (FRIB) driver linac",
        "a state-of-the-art chemical etching tool has been installed in the FRIB coldmass production facility. This paper seeks to summarize the etching equipment design",
        "installation",
        "and validation program and subsequent etching results for a variety of SRF cavity types and etching configurations. Bulk etching",
        "light etching",
        "and custom (frequency tuning) etching results for different FRIB cavities are discussed. Special emphasis is placed on the etching removal uniformity and frequency tuning reliability of these processes.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [
        "Funding: This material is based upon work supported by the U.S. Department of Energy Office of Science under Cooperative Agreement DE SC0000661, the State of Michigan and Michigan State University."
      ],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb095_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb095.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb095_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB095",
      "page_number": "373",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB096",
      "title": "Vertical Electro-Polishing at TRIUMF",
      "authors": [
        "J.J. Keir",
        "P.R. Harmer",
        "D. Lang",
        "R.E. Laxdal",
        "T. Shishido",
        "R. Smith",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "KEK",
        "Ibaraki",
        "Japan",
        "A setup for electropolishing of a superconducting niobium single-cell cavity has been installed at TRIUMF. A vertical method was selected to make the setup compact. To increase removal speed at the equator and remove hydrogen bubbles at the iris surface",
        "4 cathode paddles were rotated in the cavity cell during electropolishing. We will report on our first electropolishing result.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb096_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb096.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb096_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB096",
      "page_number": "378",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB098",
      "title": "Improvement of Temperature Control During Nb 9-Cell SRF Cavity Vertical Electro-Polishing (VEP) and Progress of VEP Quality",
      "authors": [
        "K.N. Nii",
        "V. Chouhan",
        "Y.I. Ida",
        "T.Y. Yamaguchi",
        "MGH",
        "Hyogo-ken",
        "Japan",
        "H. Hayano",
        "S. Kato",
        "H. Monjushiro",
        "T. Saeki",
        "M. Sawabe",
        "KEK",
        "Ibaraki",
        "Japan",
        "MGI",
        "Chiba",
        "Japan",
        "Marui Galvanizing Co.",
        "Ltd. has been developing Nb 9-cell SRF cavity vertical electro-polishing (VEP) facility and technique for mass production in collaboration with KEK. Our first 9-cell cavity VEP facility was not enough to control temperature during VEP",
        "so the polishing quality was not so high. In this article",
        "we will report the progress of temperature distribution and polishing quality due to the improvement of temperature control system of electrolyte and cavity during VEP."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb098_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb098.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb098_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB098",
      "page_number": "381",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB100",
      "title": "Cathode Geometry and Flow Dynamics Impact on Vertical Electropolishing of Superconducting Niobium Cavities",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "CERN has now a fully operating vertical electropolishing installation",
        "which has been used for the processing of 704 MHz high-beta five-cell Superconducting Proton Linac (SPL) niobium cavities. This installation relies only on the electrolyte circulation (HF/H2SO4) for power dissipation",
        "evacuation of gases and homogeneous finishing; thus",
        "parameters like cathode geometry",
        "electrolyte flow and temperature become even more crucial when compared with horizontal electropolishing installations. Based on computational simulations performed with Comsol Multiphysics® and on a methodology developed at CERN",
        "it is possible to assess the impact of the different cathode geometries as well as of the flow on the etching rate distribution. The data obtained with two different cathode geometries are presented: electrolyte velocity distribution",
        "etching rate distribution",
        "average current density and minimum working potential. One geometry was defined through a purely electrochemical approach while the second was defined to minimise the difference between the maximum and the minimum electrolyte speed inside the cavity; in both cases",
        "the influence of the electrolyte flow was taken into account."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb100_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb100.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb100_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB100",
      "page_number": "385",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB101",
      "title": "Electropolishing of Niobium SRF Cavities in Eco-Friendly Aqueous Electrolytes Without Hydrofluoric Acid",
      "authors": [
        "M.E. Inman",
        "T.D. Hall",
        "S. Lucatero",
        "S.T. Snyder",
        "E.J. Taylor",
        "Faraday Technology",
        "Inc.",
        "Clayton",
        "Ohio",
        "USA",
        "F. Furuta",
        "G.H. Hoffstaetter",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Electropolishing of niobium cavities is conventionally conducted in high viscosity electrolytes consisting of concentrated sulfuric and hydrofluoric acids. This use of dangerous and ecologically damaging chemicals requires careful attention to safety protocols to avoid harmful worker exposure and environmental damage. We present an approach for electropolishing of niobium materials based on pulse reverse waveforms",
        "enabling the use of low viscosity aqueous dilute sulfuric acid electrolytes without hydrofluoric acid",
        "or aqueous near-neutral pH salt solutions without any acid. Results will be summarized for both cavity and coupon electropolishing for bulk and final polishing steps. With minimal optimization of pulse reverse waveform parameters we have demonstrated the ability to electropolish single-cell niobium SRF cavities and achieve at least equivalent performance compared to conventionally processed cavities. Cavities are electropolished in a vertical orientation filled with electrolyte and without rotation",
        "offering numerous advantages from an industrial processing perspective. Shielding",
        "external cooling and high surface area cathodes are adaptable to the bipolar EP process.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "Work supported by DOE Grant Nos. DE-SC0011235 and DE-SC0011342 and DOE Purchase Order No. 594128. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb101.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB101",
      "page_number": "390",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB102",
      "title": "Comments on Electropolishing at Ettore Zanon SpA at the End of EXFEL Production",
      "authors": [
        "M. Rizzi",
        "G. Corniani",
        "Ettore Zanon S.p.A.",
        "Schio",
        "Italy",
        "DESY",
        "Hamburg",
        "Germany",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "In 2013 a new horizontal Electropolishing facility was developed and implemented by Ettore Zanon SpA (EZ) for the treatment of cavities for the European XFEL series production. More than 300 cavities have been treated. Electropolishing has been used for two applications: bulk removal and recovering of cavities with surface defects. Treatment settings have been analysed and compared with cavities performances to verify possible influences of the various parameters. Main parameters considered are treatment time",
        "voltage and current",
        "that together define average thickness removal. We present here the results of these investigation. The facility and process in use are also presented",
        "together with possible next upgrade of the system",
        "facing the new production of cavities for the LCLSII project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb102.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB102",
      "page_number": "394",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB103",
      "title": "Vertical Electro-Polishing at DESY of a 1.3 GHz Gun Cavity for CW Application",
      "authors": [
        "N. Steinhau-Kühl",
        "R. Bandelmann",
        "D. Kostin",
        "A. Matheisen",
        "M. Schmökel",
        "J.K. Sekutowicz",
        "DESY",
        "Hamburg",
        "Germany",
        "Superconducting gun cavities for cw operation in accelerators are under study. In 2003 a three-and-a-half cell gun cavity was chemically treated with buffered chemical polishing and tested successfully in a collaboration between Helmholtz-Zentrum Dresden-Rossendorf and DESY. For several years a 1.3-GHz 1.6-cell resonator has been under study",
        "which has been built and tested at DESY and elsewhere. For further studies and optimization the gun cavity needed to be electro-polished",
        "which was conducted at DESY for the first time using vertical electro-polishing. The technical set-up for the vertical electro-polishing and high pressure rinsing as well as the processing parameters applied and the adaptation of the existing infrastructure to the 1.6-cell geometry at DESY are presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb103.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB103",
      "page_number": "399",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB104",
      "title": "Flux Expulsion Variation in SRF Cavities",
      "authors": [
        "S. Posen",
        "M. Checchin",
        "A.C. Crawford",
        "A. Grassellino",
        "M. Martinello",
        "O.S. Melnychuk",
        "A. Romanenko",
        "D.A. Sergatskov",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Treating a cavity with nitrogen doping significantly increases Q0 at medium fields",
        "reducing cryogenic costs for high duty factor linear accelerators such as LCLS II. N-doping also makes cavities more sensitive to increased residual resistance due to trapped magnetic flux",
        "making it critical to either have extremely effective magnetic shielding",
        "or to prevent flux from being trapped in the cavity during cooldown. In this paper",
        "we report on results of a study of flux expulsion. We discuss possible ways in which flux can be pinned in the inner surface",
        "outer surface",
        "or bulk of a cavity",
        "and we present experimental results studying these mechanisms. We show that grain structure appears to play a key role and that a cavity that expelled flux poorly changed to expelling flux well after a high temperature furnace treatment. We further show that after furnace treatment",
        "this cavity exhibited a significant improvement in quality factor when cooled in an external magnetic field. We conclude with implications for SRF accelerators with high Q0 requirements.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb104_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb104.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb104_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB104",
      "page_number": "404",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB105",
      "title": "Symmetric Removal of Niobium Superconducting RF Cavity in Vertical Electropolishing",
      "authors": [
        "V. Chouhan",
        "Y.I. Ida",
        "K.N. Nii",
        "T.Y. Yamaguchi",
        "MGH",
        "Hyogo-ken",
        "Japan",
        "H. Hayano",
        "S. Kato",
        "H. Monjushiro",
        "T. Saeki",
        "M. Sawabe",
        "KEK",
        "Ibaraki",
        "Japan",
        "MGI",
        "Chiba",
        "Japan",
        "Vertical electropolishing (VEP) leads several advantages over horizontal EP in respect of easy operation and mechanism of an EP system resulting in lower cost. However",
        "till yet VEP always resulted inhomogeneous removal of a niobium (Nb) cavity along its length and bubble traces especially on the top iris of a vertically set cavity. In this work we performed lab EP and VEP experiments in order to study and solve these two problems. A coupon cavity which contains 6 disk type Nb coupons positioned at beam pipes",
        "irises and equator was vertically electropolished to optimize VEP parameters so as to get almost uniform removal of Nb and a smooth surface of the cavity without bubble traces. Our patented unique i-Ninja cathode having 4 wings was used with an optimized rotation speed to get homogeneous removal of Nb. The homogeneous removal and the surface without bubble traces might be result of a uniform thickness of a viscous layer on the surface of the cavity cell and no accumulation of hydrogen bubbles on the top iris surface. The surfaces of the coupons were studied in detail with surface analytical tools.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb105_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb105.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb105_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB105",
      "page_number": "409",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB106",
      "title": "Analysis of High Pressure Rinsing Characteristics for SRF Cavities",
      "authors": [
        "Y. Jung",
        "M.O. Hyun",
        "M.J. Joung",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "J. Kim",
        "J. Seo",
        "Vitzrotech Co.",
        "Ltd.",
        "Ansan City",
        "Kyunggi-Do",
        "Republic of Korea",
        "High pressure rinsing (HPR) treatment has been widely used in the SRF cavity fabrication. This well- known process helps remove effectively undesirable emission tips from the inner surface of cavities",
        "which are responsible for a different level's multipaction and hellium quenching. Also",
        "the HPR treatment can clean or polish the RF (Radio Frequency) surface",
        "which is critically sensitive to an applied magnetic field",
        "by removing contaminants such as an organic oil",
        "a remnant metal debris and dirty etchants from the cavity surface. Consequently",
        "the HPR treatment contributes to improve quality factor during the cavity operation both by decreasing various field emission sites and by removing defects from the cavity surface. In this paper",
        "we performed HPR experiments by using a simplified cavity structure",
        "intentionally painted with a pattern on the inner surface. Therefore",
        "we report how the surface treatment by HPR was carried out as functions of the distance between a target to be cleaned and a nozzle",
        "and a water pressure.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb106_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb106.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb106_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB106",
      "page_number": "414",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB110",
      "title": "The Transfer of Improved Cavity Processing Protocols to Industry for LCLS-II: N-Doping and Electropolishing",
      "authors": [
        "C.E. Reece",
        "F. Marhauser",
        "A.D. Palczewski",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Based on the R&D efforts of colleagues at FNAL",
        "Cornell",
        "and JLab",
        "the LCLS-II project adopted a modification to the rather standard niobium SRF cavity surface processing protocol that incorporates a high temperature diffusion doping with nitrogen gas. This change was motivated by the resulting higher Q0 and the prospect of significantly lower cryogenic heat load for LCLS-II. JLab is responsible for managing the cavity procurement for the LCLS-II project. The first phase of the procurement action is to transfer the nitrogen-doping protocol to the industrial vendors. We also seek to exploit improvements in understanding of the niobium electropolishing process as part of the production processing of the TESLA-style LCLS-II cavities. We report on the technology transfer activities and progress toward the envisaged performance demonstration of vendor-processed cavities.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb110_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb110.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb110_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB110",
      "page_number": "418",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB111",
      "title": "Furnace N2 Doping Treatments at Fermilab",
      "authors": [
        "M. Merio",
        "M. Checchin",
        "A.C. Crawford",
        "A. Grassellino",
        "M. Martinello",
        "A.M. Rowe",
        "M. Wong",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "M. Checchin",
        "M. Martinello",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "The Fermilab SRF group regularly performs Nitrogen (N2) doping heat treatments on superconducting cavities in order to improve their Radio Frequency (RF) performances. This paper describes the set up and operations of the Fermilab vacuum furnaces",
        "with a major focus on the implementation and execution of the N2 doping recipe. The cavity preparation will be presented",
        "N2 doping recipes will be analyzed and heat treatment data will be reported in the form of plot showing temperature",
        "total pressure and partial pressures over time. Finally possible upgrades and improvements of the furnace and the N2 doping process are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb111_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb111.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb111_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB111",
      "page_number": "423",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB112",
      "title": "SRF Quality Assurance Studies and Their Application to Cryomodule Repairs at SNS",
      "authors": [
        "J.D. Mammosser",
        "R. Afanador",
        "D.L. Barnhart",
        "B. DeGraff",
        "B.S. Hannah",
        "J. Saunders",
        "P.V. Tyagi",
        "ORNL RAD",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Omega Technical Services",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "M. Doleans",
        "D.K. Hensley",
        "S.-H. Kim",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Many of the SRF activities involve interactions to cavities which presents risk for particulate contamination to RF surfaces. In order to understand and reduce contamination in cavities during cleaning",
        "vacuum pumping and purging",
        "and in-situ cryomodule repairs",
        "a Quality Assurance (QA) studies were initiated to evaluate these activities and improve them where possible. This paper covers the results of investigations on the effectiveness of the SNS ultrasonic cleaning systems",
        "particulate control during pumping and purging",
        "procedure development for in-situ cryomodule repairs",
        "the application of these studies to the repair of a linac cryomodule",
        "and discussion of further improvement in these areas.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb112_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb112.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb112_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB112",
      "page_number": "428",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB113",
      "title": "Study of the Evolution of Artificial Defects on the Surface of Niobium During Electrochemical and Chemical Polishing",
      "authors": [
        "L. Monaco",
        "P. Michelato",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "A. Navitski",
        "J. Schaffran",
        "W. Singer",
        "DESY",
        "Hamburg",
        "Germany",
        "Università degli Studi di Milano & INFN",
        "Segrate",
        "Italy",
        "A.L. Prudnikava",
        "Y. Tamashevich",
        "University of Hamburg",
        "Institut für Experimentalphysik",
        "Hamburg",
        "Germany",
        "The presence of defects on the inner surface of Nb superconducting RF structures might limit its final performance. For this reason",
        "strict requirements are imposed during mechanical production of the cavities",
        "specifically on the quality control of the inner surface of components",
        "to avoid the presence of defects or scratches. Nevertheless",
        "some defects may remain also after control or can arise from the following production steps. Understanding the evolution of the defect might shine new insight on its origin and help in defining possible repair techniques. This paper reports the topographical evolution of defects on a Nb sample polished with the standard recipe used for the 1.3 GHz cavities of the EXFEL project. Various artificial defects of different shape",
        "dimensions",
        "and thicknesses/depths",
        "with geometrical characteristics similar to the one that may occur during the machining and handling of cavities",
        "have been “ad hoc” produced on the sample of the same material used for the cell fabrication. Analysis shows the evolution of the shape and profile of the defects at the different polishing steps.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb113_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb113.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb113_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB113",
      "page_number": "433",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB115",
      "title": "Surface Studies of Plasma Processed Nb Samples",
      "authors": [
        "P.V. Tyagi",
        "R. Afanador",
        "B. DeGraff",
        "M. Doleans",
        "B.S. Hannah",
        "M.P. Howell",
        "S.-H. Kim",
        "J.D. Mammosser",
        "C.J. McMahan",
        "J. Saunders",
        "S.E. Stewart",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "*M. Doleans et al.",
        "Proc. 2013 SRF",
        "Paris",
        "France.  **P. V. Tyagi",
        "et al.",
        "Proc. Linac14",
        "Geneva",
        "Switzerland. ***M. Doleans et al.",
        "These proceedings."
      ],
      "institutions": [],
      "abstract": "Contaminants present at top surface of superconducting radio frequency (SRF) cavities can act as field emitters and restrict the cavity accelerating gradient. A room temperature in-situ plasma processing technology for SRF cavities aiming to clean hydrocarbons from inner surface of cavities has been recently developed at the Spallation Neutron Source (SNS). Surface studies of the plasma processed Nb samples by Secondary ion mass spectrometry (SIMS) and Scanning Kelvin Probe (SKP) showed that the NeO2 plasma processing is very effective to remove carbonaceous contaminants from top surface and improves the surface work function by 0.5 to 1.0 eV.",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb115_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb115.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb115_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB115",
      "page_number": "438",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB116",
      "title": "Developments of Horizontal High Pressure Rinsing for SuperKEKB SRF Cavities",
      "authors": [
        "Y. Morita",
        "K. Akai",
        "T. Furuya",
        "A. Kabe",
        "S. Mitsunobu",
        "M. Nishiwaki",
        "KEK",
        "Ibaraki",
        "Japan",
        "The Q factors of the eight superconducting accelerating cavities gradually degraded during the long-term operation of the KEKB accelerator. Since we will re-use those SRF cavities for the SuperKEKB",
        "the performance degradation will be a serious problem. Several cavities degraded their performance significantly at high accelerating fields. The Q degradation is still acceptable for the 1.5 MV operations at SuperKEKB. However",
        "further degradation will make the operation difficult. In order to recover the cavity performance",
        "we developed horizontal high pressure water rinsing (HHPR). This method uses a horizontal high pressure water nozzle and inserts it directly into the cavity module. We applied this method to two degraded cavities and their degraded Q factors recovered above 109 at around 2 MV. In this paper we will present the HHPR method",
        "high power test results after the HHPR and the residual gas analysis.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb116_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb116.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb116_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB116",
      "page_number": "443",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB117",
      "title": "Identification and Evaluation of Contamination Sources During Clean Room Preparation of SRF Cavities",
      "authors": [
        "L. Zhao",
        "G.K. Davis",
        "A.V. Reilly",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Particles are one possible cause of field emission issues in SRF cavity operations. During clean room cavity preparation",
        "several processes could contribute to the generation of particles. One of them is friction between hardware during assembly and disassembly. It is important to understand the behaviours that generate and propagate particles into cavities. Using a single cell cavity",
        "particle shedding between flanges and other materials have been tested. The number of particles is recorded with an airborne particle counter",
        "and the generated particles are examined with microscope. The migration of particles into a cavity due to different movements is studied. Suggestions are made to reduce particle generation and prevent contamination of the cavity interior area."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb117_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb117.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb117_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB117",
      "page_number": "448",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB118",
      "title": "Cleanliness and Vacuum Acceptance Tests for the UHV Cavity String of the XFEL Linac",
      "authors": [
        "S. Berry",
        "O. Napoly",
        "B. Visentin",
        "CEA/DSM/IRFU",
        "France",
        "C. Boulch",
        "C. Cloué",
        "C. Madec",
        "T. Trublet",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "D. Henning",
        "L. Lilje",
        "A. Matheisen",
        "M. Schmökel",
        "DESY",
        "Hamburg",
        "Germany",
        "The main linac of the European XFEL will consist of 100 accelerator modules",
        "i.e. 800 superconducting accelerator cavities operated at a design gradient of 23.6MV/m. In this context CEA-Saclay built an assembly facility designed to produce one module per week",
        "ready to be tested at DESY. The facility overcame the foreseen production rate. We would like to highlight and discuss the critical fields: cleanliness and vacuum. A new assembly method to protect final assembly against particulates contamination has been implemented on the production line. Impact on cryomodule RF test is presented. Particle transport measurements on components used for the European XFEL accelerator module are presented. The results indicate that the nominal operation of the automated pumping and venting units will not lead to particle transport. Vacuum acceptance tests are of major interest: leak tests and residual gas analysis (RGA) are used to control the absence of air leak and contamination. The RGA specifications have been slightly relaxed to ensure the production rate.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/mopb118_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/mopb118.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/mopb118_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-MOPB118",
      "page_number": "452",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 89,
  "scrape_time": "2025-10-11 03:52:24"
}