{
  "session_info": {
    "id": "FRM2C",
    "name": "FRM2C - Friday Morning Contributed Oral 2",
    "url": "https://proceedings.jacow.org/HIAT2015/html/frm2c.htm"
  },
  "papers": [
    {
      "paper_id": "FRM2C01",
      "title": "Heavy Ion Laboratory, University of Warsaw - a Unique Research Center in Poland",
      "authors": [
        "Warsaw University",
        "Warsaw",
        "Poland",
        "HIL",
        "Warsaw",
        "Poland",
        "The Heavy Ion Laboratory of the University of Warsaw (HIL) is a user facility operating a Kmax=160 isochronous heavy ion cyclotron",
        "unique in central Europe. Two ECR ion sources",
        "a homemade 10 GHz and a commercial (supernanogan Pantechnik) 14.5 GHz",
        "supply ions to the machine. In the center of the machine a \"spiral\" type inflector bends the ion beams into the median plane. The current system allows ions from He up to Xe to be accelerated with energies up to 10 A MeV. The research program of HIL includes nuclear physics",
        "solid state physics",
        "medical radioisotope production",
        "biology and detector testing. In 2012 HIL launched a new facility - the Radiopharmaceuticals Production and Research Center (RPRC). This is a fully GMP compliant production center of radiopharmaceuticals for PET. It operates a General Electric PETtrace 840 cyclotron and a complete production line of FDG. An external beam line with target station\"*\"",
        "designed and constructed by the Laboratory",
        "allows metallic and powdered samples to be irradiated",
        "extending medical isotope research with proton and deuteron beams.",
        "* Construction of this station was funded by the National Centre for Research and Development",
        "Agreement No PBS1/A9/2/2012.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "Slides FRM2C01 [22.446 MB] reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/frm2c01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/frm2c01.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/frm2c01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-FRM2C01",
      "page_number": "297",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:39:31"
}