{
  "session_info": {
    "id": "WEBO",
    "name": "WEBO - Data Acquisition and Digital Architecture",
    "url": "https://proceedings.jacow.org/ibic2019/html/webo.htm"
  },
  "papers": [
    {
      "paper_id": "WEBO01",
      "title": "Generic Hardware, Firmware and Embedded Software Platforms for Particle Accelerators",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "In the last decades",
        "the architecture of electronics",
        "firmware and embedded software for beam instrumentation and accelerator feedback systems has migrated from rather system specific designs towards more generic solutions",
        "where different systems can share quite a large amount of common components. This conference contribution gives an overview of generic design approaches",
        "platforms and related technology being used today",
        "and provides an outlook on future developments and trends. Topics and technologies discussed include design crate and hardware standards",
        "development tools and languages",
        "multi-gigabit communication protocols",
        "FPGAs",
        "multiprocessor system-on-chip (MPSoC)",
        "RF system-on-chip (RFSoC)",
        "and adaptive compute acceleration platforms (ACAPs). Some examples of existing and future applications are also presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2019/talks/webo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2019/papers/webo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2019/posters/webo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2019-WEBO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEBO02",
      "title": "MicroTCA.4 at Sirius and a Closer Look into the Community",
      "authors": [
        "D.O. Tavares",
        "G.B.M. Bruno",
        "S.R. Marques",
        "L.M. Russo",
        "H.A. Silva",
        "LNLS",
        "Campinas",
        "Brazil",
        "More and more facilities have been adopting MicroTCA.4 as the standard for new electronics. Despite the advertised advantages in terms of system manageability",
        "high availability",
        "backplane performance and supply of high quality COTS modules by industry",
        "the standard still lacks a greater acceptance in the accelerators community. This paper reports on the deployment of MicroTCA.4 systems at Sirius light source",
        "which comprised the development and manufacturing of several open hardware modules",
        "development of a generic gateware/software framework and re-implementation of MMC IPMI firmware as an open source project. A special focus will be given to the difficulties found",
        "unforeseen expansions of the system and general architectural aspects. Based on this experience and on a survey carried out among other MicroTCA.4 adopters",
        "the perceived strengths and weaknesses of the standard will be discussed and a tentative outlook on how it could be evolved to better suit the accelerators community will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2019/talks/webo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2019/papers/webo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2019/posters/webo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2019-WEBO02",
      "page_number": "461",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBO03",
      "title": "Development of MTCA.4-Based BPM Electronics for SPring-8 Upgrade",
      "authors": [
        "H. Maesaka",
        "T. Fukui",
        "RIKEN SPring-8 Center",
        "Innovative Light Sources Division",
        "Hyogo",
        "Japan",
        "H. Dewa",
        "T. Fujita",
        "M. Masaki",
        "C. Saji",
        "S. Takano",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "We have developed a new button-BPM readout electronics based on the MTCA.4 standard for the low-emittance upgrade of SPring-8 [*]. Requirements for the BPM system are a high single-pass BPM resolution of better than 100 µm for a 100 pC injected bunch to achieve first-turn steering in the commissioning of the upgraded ring and a highly stable COD BPM within 5 µm error for 1 month to maintain the optical axis of brilliant x-rays for users [**]. We designed an rf front-end rear transition module (RTM) having band-pass filters",
        "low-noise amplifiers",
        "step attenuators",
        "and calibration tone generators. The rf signal is detected by a 16-bit 370 MSPS high-speed digitizer advanced mezzanine card (AMC) developed for the new low-level rf system of SPring-8 [***]. The firmware of the FPGA on the digitizer AMC was newly developed to implement various functions of the BPM system. We evaluated the readout system at a laboratory and then tested at the present SPring-8 storage ring with a prototype BPM head for the SPring-8 upgrade. We confirmed that the new readout system satisfies the requirements for the single-pass BPM resolution and the COD BPM stability.",
        "* SPring-8-II Conceptual Design Report",
        "http://rsc.riken.jp/pdf/SPring-8-II.pdf  ** H. Maesaka et al.",
        "Proc. IBIC¿18",
        "paper"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2019/talks/webo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2019/papers/webo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2019/posters/webo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2019-WEBO03",
      "page_number": "471",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBO04",
      "title": "Enhancement of the S-DALINAC Control System with Machine Learning Methods",
      "authors": [
        "J.H. Hanten",
        "M. Arnold",
        "J. Birkhan",
        "C. Caliari",
        "N. Pietralla",
        "M. Steinhorst",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "For the EPICS-based control system of the superconducting Darmstadt electron linear accelerator S-DALINAC**",
        "supporting infrastructures based on machine learning are currently developed. The most important support for the operators is to assist the beam setup and controlling with reinforcement learning using artificial neural networks. A particle accelerator has a very large parameter space with often hidden relationships between them. Therefore neural networks are a suited instrument to use for approximating the needed value function which represents the value of a certain action in a certain state. Different neural network structures and their training with reinforcement learning are currently tested with simulations. Also there are different candidates for the reinforcement learning algorithms such as Deep-Q-Networks (DQN) or Deep-Deterministic-Policy-Gradient (DDPG). In this contribution the concept and first results will be presented.",
        "**N. Pietralla",
        "Nuclear Physics News",
        "Vol. 28",
        "No.2",
        "4 (2018)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2019/talks/webo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2019/papers/webo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2019/posters/webo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2019-WEBO04",
      "page_number": "475",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:45:08"
}