{
  "session_info": {
    "id": "WEIOB",
    "name": "WEIOB - Invited Orals Proton/Ion accelerators",
    "url": "https://proceedings.jacow.org/LINAC2014/html/weiob.htm"
  },
  "papers": [
    {
      "paper_id": "WEIOB01",
      "title": "Chopping High-Intensity Ion Beams at FRANZ",
      "authors": [
        "C. Wiesner",
        "M. Droba",
        "O. Meusel",
        "D. Noll",
        "O. Payir",
        "U. Ratzinger",
        "P.P. Schneider",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "The accelerator-driven Frankfurt Neutron Source FRANZ is under construction at the science campus of Frankfurt University. Its Low-Energy Beam Transport (LEBT) line also serves as test stand for transport and chopping experiments with high-intensity ion beams. The high-current proton source was tested successfully with dc currents above 200 mA . The LEBT section consisting of four solenoids and a 250 kHz",
        "120 ns chopper was successfully commissioned using a helium test beam at low beam currents. Transport simulations including space-charge compensation and measurements are discussed. Simulations and experimental results of the novel LEBT chopper using a Wien-filter type field array and pulsed electrode voltages of up to ±6kV will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/LINAC2014/talks/weiob01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/LINAC2014/papers/weiob01.pdf",
      "poster_url": "https://proceedings.jacow.org/LINAC2014/posters/weiob01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2014-WEIOB01",
      "page_number": "765",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEIOB02",
      "title": "SARAF Phase-I Proton / Deuteron Linac Beam Operation Status",
      "authors": [
        "A. Kreisel",
        "A. Arenshtam",
        "Y. Ben Aliz",
        "D. Berkovits",
        "Y. Buzaglo",
        "O. Dudovich",
        "Y. Eisen",
        "I. Eliyahu",
        "G. Feinberg",
        "I. Fishman",
        "I.G. Gertz",
        "A. Grin",
        "S. Halfon",
        "Y.F. Haruvy",
        "T. Hirsch",
        "D. Hirschmann",
        "Z. Horvitz",
        "B. Kaizer",
        "D. Kijel",
        "J. Luner",
        "I. Mor",
        "J. Rodnizki",
        "G. Shimel",
        "A. Shor",
        "I. Silverman",
        "D. Vartsky",
        "L. Weissman",
        "E. Zemach",
        "Soreq NRC",
        "Yavne",
        "Israel",
        "SARAF Phase-I linac is the first accelerator to demonstrate acceleration of variable energy 2 mA CW proton beam. Such intense beam is used in SARAF Phase-I to irradiate a liquid lithium jet target for nuclear astrophysics studies. Several improvements were necessary to allow beam operation with such high current. The improvements include a DC bias that was introduced on the cavity RF coupler to reduce coupler heating. A new slow chopper was commissioned to enable increase the current by increasing the duty cycle with fewer changes in the beam optics. A beam dump was developed to allow beam studies of a 2 mA CW proton beam. The beam dump is based on tungsten pins which distributes",
        "by radiation",
        "the high beam power over a large area which is then easily water cooled. While most of beam tuning is done using a low intensity pilot beam",
        "some nondestructive methods were studied to monitor the high intensity beam. These include a current transformer and a residual gas monitor (RGM) to monitor beam transverse distribution. Additional valuable information about the beam current and energy is gained from measurements of the nuclear reaction products of the proton on lithium targets."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/LINAC2014/talks/weiob02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/LINAC2014/papers/weiob02.pdf",
      "poster_url": "https://proceedings.jacow.org/LINAC2014/posters/weiob02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2014-WEIOB02",
      "page_number": "770",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEIOB03",
      "title": "Status of RAON Heavy Ion Accelerator Project",
      "authors": [
        "D. Jeon",
        "H.J. Kim",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "Construction of the RAON heavy ion accelerator facility is under way in Korea to build the In-flight Fragment (IF) and Isotope Separation On-Line (ISOL) facilities to support cutting-edge researches in various science fields. At present prototyping of major components are proceeding including 28 GHz ECR ion source",
        "RFQ",
        "superconducting cavities",
        "magnets and cryomodules. Superconducting magnets of 28 GHz ECR ion source are fabricated and tested. First article of prototype superconducting cavities are delivered that were fabricated through domestic vendors. Prototype HTS quadrupole is under development. Progress report of the RAON accelerator systems is presented."
      ],
      "institutions": [
        "Funding: This work was supported by the Institute for Basic Science funded by the Ministry of Science, ICT and Future Planning (MSIP) and the NRF of Korea under Contract 2013M7A1A1075764."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/LINAC2014/talks/weiob03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/LINAC2014/papers/weiob03.pdf",
      "poster_url": "https://proceedings.jacow.org/LINAC2014/posters/weiob03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2014-WEIOB03",
      "page_number": "775",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEIOB04",
      "title": "CW Heavy Ion Accelerator With Adjustable Energy for Material Science",
      "authors": [
        "S.V. Kutsaev",
        "B. Mustapha",
        "J.A. Nolen",
        "P.N. Ostroumov",
        "ANL",
        "Argonne",
        "USA",
        "The proposed eXtreme MATerial (XMAT) research facility at ANL’s Advanced Photon Source (APS) combines medium-energy heavy-ion accelerator capability with the high-energy X-ray analysis to enable rapid in situ mesoscale bulk analysis of ion radiation damage in advanced materials and nuclear fuels. The XMAT facility requires CW heavy ion accelerator with adjustable beam energy in the range of 300 keV/u to 1.25 MeV/u. Such an accelerator has been developed and based on ECR",
        "normal conducting RFQ and multi-gap quarter wave resonators (QWR) operating at 60 MHz. This talk will present complete 3D beam dynamics studies and multi-physics design of both RFQ and QWRs. The design includes a beam transport system capable to focus ions into 20-micron diameter spot on the target."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/LINAC2014/talks/weiob04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/LINAC2014/papers/weiob04.pdf",
      "poster_url": "https://proceedings.jacow.org/LINAC2014/posters/weiob04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2014-WEIOB04",
      "page_number": "780",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 23:14:10"
}