{
  "session_info": {
    "id": "TUPSH",
    "name": "TUPSH - Poster Session: Strippers, Extraction, Magnets, Beam Transport",
    "url": "https://proceedings.jacow.org/CYCLOTRONS2013/html/tupsh.htm"
  },
  "papers": [
    {
      "paper_id": "TUPSH002",
      "title": "Design and Construction of Combination Magnet for CYCIAE-100",
      "authors": [
        "S.M. Wei",
        "Shizhong. An",
        "M. Li",
        "C. Wang",
        "M. Yin",
        "T.J. Zhang",
        "X. Zheng",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "The high intensity compact cyclotron CYCIAE-100 being constructed at China Institue of Atomic Energy (CIAE) is designed to extract proton beam from 75MeV to 100MeV in two opposite directions by stripping foil. Two combination magnets have been designed to bend the proton beams with different energies into one common beam line. The combination magnets have been designed into the return yoke of the main magnet of CYCIAE-100 for the dynamic reason. 2 D and 3D simulation of these combination magnets has been finished",
        "the machining of them has also been finished. The magnetic field of the combination magnets has been measured and the results show that the measurements are very closed to the calculation",
        "indicating these two magnets can be used in the BRIF project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/tupsh002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/tupsh002.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/tupsh002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-TUPSH002",
      "page_number": "221",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSH003",
      "title": "Conceptual Design of a 100 MeV Injector Cyclotron",
      "authors": [
        "M. Li",
        "J.J. Yang",
        "T.J. Zhang",
        "J.Q. Zhong",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "Accelerator driven system (ADS) is advanced clean nuclear energy system based on a high power accelerator",
        "which has been proposed worldwide in recent years. Referring to the experiences from the existing PSI high power proton facility",
        "an 800 MeV cyclotron is under design at CIAE (China Institute of Atomic Energy) as a candidate of high power proton driver. Given the extremely high beam power to be extracted",
        "a tiny beam loss can lead to disastrous result for the cyclotron. Especially",
        "the beam loss during extraction is the critical issue with respect to the feasibility and reliability of the design",
        "which needs to be investigated in great detail from the very beginning. In this paper",
        "the extraction scheme and beamline elements design are presented",
        "and the detailed beam loss distribution during extraction will be calculated by numerical simulation with the large-scale parallel code OPAL-CYCL."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/tupsh003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/tupsh003.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/tupsh003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-TUPSH003",
      "page_number": "224",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSH005",
      "title": "Investigation of Cyclotron Carbon Foil Lifetime in Relation to its Thickness",
      "authors": [
        "J.-W. Kim",
        "S. Hong",
        "J.H. Kim",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "Dongguk University",
        "Gyeongju",
        "Republic of Korea",
        "Energy & Environmental System",
        "Gyeongju",
        "Republic of Korea",
        "For extracting positive hydrogen atoms from accelerated negative ones",
        "a thin carbon foil is usually used to stripe two electrons from negative atoms",
        "which consists of one proton and two electrons traveling together up to 70MeV proton. The kinetic energy of electron is 38.13keV at the moment of stripping. The energy loss of protons and electrons in carbon foil could be estimated by the multiplication of stopping power (dE/dz) and the foil thickness where passing through. The stopping powers were estimated with 8.5 and 7.25 MeV/(g/cm2) for the proton and electron",
        "respectively. In cyclotron the stripper is located in a strong magnetic field of ~Tesla",
        "which makes electrons circular motion around the foil depositing all their kinetic energies into it. In this study",
        "three different carbon foil thicknesses (200",
        "400",
        "and 800 ug/cm2) were employed to investigate the correlation of foil temperature and their lifetime for the case of 1mA proton extraction. We are aiming the lifetime of a stripper foil to be as long as 2 weeks for irradiating protons onto an ISOL target. An effective lifetime of foils will be discussed as a function of a foil peak temperature."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/tupsh005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/tupsh005.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/tupsh005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-TUPSH005",
      "page_number": "227",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSH006",
      "title": "Development of a New Active-Type Gradient Corrector for an AVF Cyclotron",
      "authors": [
        "M. Fukuda",
        "N. Hamatani",
        "K. Hatanaka",
        "K. Kamakura",
        "S. Morinobu",
        "K. Nagayama",
        "T. Saito",
        "H. Tamura",
        "H. Ueda",
        "Y. Yasuda",
        "T. Yorita",
        "RCNP",
        "Osaka",
        "Japan",
        "A new gradient corrector with active coils has been developed for beam focusing and bending in the extraction region of the RCNP AVF cyclotron. The gradient corrector is a quadrupole type consisting of a pair of a C-type iron yoke. A sixteen-turn hollow conductor was coiled around each side yoke",
        "and the two iron dipoles generate a linear field gradient independently. A field gradient up to 9 T/m is available for focusing a heavy ion beam with magnetic rigidity up to 1.6 T-m. The position of the gradient corrector is manually changeable within ±20 mm from a beam extraction base line. A field measurement was carried out with a Hall-element and we confirmed generation of the designed field gradient under excitation of the main coil. We have succeeded in focusing an extracted beam at an object point of the beam transport optics by a combination of the gradient corrector and a triplet quadrupole magnet following the gradient corrector. Correction of an extracted beam orbit was also demonstrated by optimizing the coil current and position of the gradient corrector. We will report the design and performance of the new gradient corrector."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/tupsh006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/tupsh006.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/tupsh006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-TUPSH006",
      "page_number": "230",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSH007",
      "title": "Improvement in Design of 10 MeV AVF Cyclotron Magnet",
      "authors": [
        "R. Solhju",
        "H. Afarideh",
        "B. Mahdian",
        "AUT",
        "Tehran",
        "Iran",
        "J.-S. Chai",
        "M. Ghergherehchi",
        "SKKU",
        "Suwon",
        "Republic of Korea",
        "Design study of a 10 MeV baby cyclotron which accelerates H− ions is started in March",
        "2012 at Amirkabir University of Technology (AUT). Up to this point",
        "conceptual design of the cyclotron magnet is finished. This process has been done in two steps: initial design and then optimization. After finishing the initial design of the magnet by CST software and adopting hard-edge approximation for finding the pole tip",
        "an optimization process has been followed to smooth the pole edge in order to decrease the tension in sharp edges of the pole. In this paper",
        "we are going to explain about the optimization process in details. Actually",
        "we tried to fit the best curve at the pole edges of the magnet with goal of having minimum magnetic field error. Also a short report of results which was obtained before optimization is provided here. Precision of this design is ensured by checking the magnetic field and beam dynamic parameters during the optimization."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/tupsh007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/tupsh007.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/tupsh007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-TUPSH007",
      "page_number": "233",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSH008",
      "title": "Conceptual Design of the 100 MeV Separated Sector Cyclotron",
      "authors": [
        "B. Mahdian",
        "H. Afarideh",
        "R. Solhju",
        "AUT",
        "Tehran",
        "Iran",
        "J.-S. Chai",
        "M. Ghergherehchi",
        "SKKU",
        "Suwon",
        "Republic of Korea",
        "The 100 MeV separated sector cyclotron was designed at Amirkabir University of Technology (AUT)",
        "which was aimed for various applications including radioactive ion-beam (RIB) production and proton therapy. It has four separated sector magnets. The cyclotron magnet design was based on an iterative process starting from a simple model that requires the vision of the complete cyclotron and the possibility of integration of all subsystems. By computer simulation with the 3D (CST) and 2D (POSSION) codes",
        "principle parameters of the cyclotron magnet system were estimated (pole radius 180 cm",
        "outer diameter 640 cm",
        "height 300 cm). The results showed that the isochronous deviations between simulated values and the calculation one are smaller than 5 Gauss at most radii and therefore fulfilled the requirements. This work has been done with high accuracy which is proved by particle trajectories and considered mesh range. It has been concluded that it can be possible to design and develop this high energy cyclotron by introducing simple model without using trim and harmonic coils."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/tupsh008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/tupsh008.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/tupsh008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-TUPSH008",
      "page_number": "236",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSH009",
      "title": "Magnetic Field Mapping of the Best 70 MeV Cyclotron",
      "authors": [
        "F.S. Grillet",
        "B.F. Milton",
        "BCSI",
        "Vancouver",
        "BC",
        "Canada",
        "Cedarflat Precision Inc.",
        "Burnaby",
        "British Columbia",
        "Canada",
        "As is well known",
        "the mapping of a cyclotron magnet presents several key challenges including requirements for a high degree of accuracy and difficult space constraints in the region to be measured. Several novel solutions were used to create the mapper for the Best 70 MeV cyclotron",
        "which is based on an earlier version used to map the Best 14 MeV cyclotron. Based on a temperature compensated 3-Axis hall probe that is continuously sampled while the probe travels along a radial arm a high degree of positional accuracy is achieved by simultaneously sampling optical encoders located with the probe. A novel implementation using air bearings and air jets provides axial rotation of the arm with almost no metal parts. The mapper has achieved a full 360 degree map in 1 degree theta steps",
        "and 2.5mm radial steps in 2 hours and 40 minutes",
        "with a relative radial accuracy of ±0.02mm and angular accuracy of ±0.001 degrees. This paper will describe how the simultaneous challenges of designing with no metal parts while achieving a high degree of rigidity and precision have been addressed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/tupsh009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/tupsh009.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/tupsh009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-TUPSH009",
      "page_number": "239",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSH011",
      "title": "Developments of HTS Magnets at RCNP",
      "authors": [
        "K. Hatanaka",
        "M. Fukuda",
        "K. Kamakura",
        "S. Takemura",
        "H. Ueda",
        "Y. Yasuda",
        "K. Yokoyama",
        "T. Yorita",
        "RCNP",
        "Osaka",
        "Japan",
        "KT Science Ltd.",
        "Akashi",
        "Japan",
        "At RCNP",
        "we have been developing magnets utilizing high temperature super conducting (HTS) wires for this decade. They are a cylindrical magnet",
        "two dimensional scanning coils",
        "a super ferric dipole magnet whose coils have a negative curvature. Recently we built a cylindrical magnet for a practical use. It is used to polarize ultra cold neutrons. The maximum field is higher than 3.5 T at the center. We are fabricating a switching magnet which is excited by pulse currents to realize a time sharing of beams in two target positions. In the paper",
        "we report specifications and performances of these magnets."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/tupsh011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/tupsh011.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/tupsh011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-TUPSH011",
      "page_number": "242",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSH012",
      "title": "The Development of High Stability Magnet Power Supply",
      "authors": [
        "K.-H. Park",
        "H.S. Han",
        "Y.-G. Jung",
        "D.E. Kim",
        "S.-C. Kim",
        "H.-G. Lee",
        "H.S. Suh",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "J.-S. Chai",
        "Y.S. Lee",
        "SKKU",
        "Suwon",
        "Republic of Korea",
        "This paper presents the magnet power supply (MPS) for the beam correction magnet. The required current to energize the magnet was ±20 A. The MPS has been implemented using the digital signal processing technology and shows the high stability and other good responses. The stability of the MPS was about ~10 ppm in short and long term",
        "respectively. Various experimental results such as stability",
        "bandwidth and simulation are given in this paper"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/tupsh012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/tupsh012.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/tupsh012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-TUPSH012",
      "page_number": "245",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSH013",
      "title": "Design Study of 10 MeV H− Cyclotron Magnet",
      "authors": [
        "H.S. Kim",
        "J.-S. Chai",
        "M. Ghergherehchi",
        "H.W. Kim",
        "S.H. Kim",
        "S.H. Lee",
        "SKKU",
        "Suwon",
        "Republic of Korea",
        "For the past decades",
        "PET (positron emission tomography) has been remarkable growth in market. PET using 18F is widely provided for cancer screening and expected to be installed at small and medium hospital for convenience of patients. At Sungkyunkwan University",
        "10 MeV H− cyclotron",
        "which produces 18F is being developed. In this paper",
        "we demonstrated main magnet design and whole design procedure was explained. The result of design is verified by orbit analysis and single particle tracking. The description of the obtained result is presented in this paper."
      ],
      "institutions": [
        "Funding: This work has been supported by National Research Foundation of Korea funded by the Ministry of Science, ICT and Future Planning (NRF-2010-0025952)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/tupsh013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/tupsh013.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/tupsh013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-TUPSH013",
      "page_number": "248",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSH014",
      "title": "An Integrated Self-Supporting Mini-Beamline for PET Cyclotrons",
      "authors": [
        "M.P. Dehnel",
        "D.E. Potkins",
        "T.M. Stewart",
        "D-Pace",
        "Nelson",
        "British Columbia",
        "Canada",
        "A commercial fluorine-18 water-target can now handle 150 μA of 10-19 MeV proton current. The days of a few tens of micro-amperes bombarding a PET target with low residual activity on a self-shielded cyclotron are over. Now an integrated self-supporting mini-beamline is essential for safe",
        "optimized and reliable operation of PET cyclotrons. The high levels of prompt/residual radiation are moved (~1 m) away from the cyclotron so that local-shielding can be placed around the target/selector assembly",
        "which minimizes cyclotron component damage due to prompt neutrons/gammas",
        "and ensures the high residual target radiation is attenuated",
        "so maintenance personnel can work on the cyclotron in a “cool” environment. Beam diagnostic readbacks from baffles/collimators provide steering and focusing control of the beam. This \"plug-n-play\" beamline is an integrated self-supporting unit cantilevered from the cyclotron. The single aluminum sub-structure acts as mounting flange",
        "support structure",
        "beampipe",
        "and magnet registration device. A diamond-shaped vacuum envelope through the compound quadrupole/steering magnets results in maximum beam throughput and optimization."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/tupsh014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/tupsh014.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/tupsh014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-TUPSH014",
      "page_number": "251",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSH016",
      "title": "Trim Coil Unbalance of the 88-Inch Cyclotron",
      "authors": [
        "M. Kireeff Covo",
        "B. Bingham",
        "C.M. Lyneis",
        "B. Ninemire",
        "L. Phair",
        "P. Pipersky",
        "A. Ratti",
        "M.M. Strohmeier",
        "D.S. Todd",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Mevion",
        "Littleton",
        "Massachusetts",
        "USA",
        "The 88-inch cyclotron Dee probe shows large losses inside the radius of 20 cm and suggests problems in the ion beam injection. The current of the top and bottom innermost trim coil 1 is unbalanced to study effects of the axial injection displacement. A new beam profile monitor images the ion beam bunches",
        "turn by turn",
        "and the beam center of mass position is measured. The technique allows increasing the beam transmission through the cyclotron."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/tupsh016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/tupsh016.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/tupsh016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-TUPSH016",
      "page_number": "254",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 12,
  "scrape_time": "2025-10-10 17:24:14"
}