{
  "session_info": {
    "id": "WEZAT01",
    "name": "WEZAT01 - WG4: Beam-beam & Instabilities",
    "url": "https://proceedings.jacow.org/eefact2022/html/wezat01.htm"
  },
  "papers": [
    {
      "paper_id": "WEZAT0101",
      "title": "FCC-ee Parameter Choice for Luminosity Optimization",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Beam dynamics in FCC-ee will be very different from all previous e+e colliders as it will be heavily influenced by new effects (such as beamstrahlung) and new types of instabilities (such as coherent beam-beam instability and 3D flip-flop). Optimization of the main FCC-ee parameters was carried out taking into account all these factors",
        "and this was recorded in the CDR. Another important feature of FCC-ee is the great sensitivity of the lattice and 6D dynamic aperture to misalignments and field errors. Now this problem is seen as one of the main bottlenecks limiting the luminosity. In this paper",
        "we consider the main effects and dependencies that determine the choice of collider parameters at different energies. We will then discuss [currently known] existing problems and possible solutions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/wezat0101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/wezat0101.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/wezat0101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-WEZAT0101",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEZAT0102",
      "title": "Towards Beam-Beam Simulations for FCC-ee",
      "authors": [
        "P. Kicsiny",
        "X. Buffat",
        "G. Iadarola",
        "D. Schulte",
        "CERN",
        "Meyrin",
        "Switzerland",
        "T. Pieloni",
        "M. Seidel",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "The FCC-ee (Future Circular Collider) lepton collider is currently the most favored next generation research infrastructure project at CERN",
        "aimed at studying properties of standard model particles with the highest precision ever. The chosen parameters of the machine yield unprecedented conditions which give rise to previously unseen dynamical effects during collisions. The exploration and understanding of these beam-beam effects is of crucial importance for the success of the FCC-ee feasibility study. To address this challenge",
        "a new general purpose software framework for beam dynamics simulations is currently under development at CERN. This presentation will discuss the contributions to the software development related to beam-beam effects with benchmark studies and applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/wezat0102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/wezat0102.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/wezat0102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-WEZAT0102",
      "page_number": "165",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZAT0103",
      "title": "Impedance And Collective Effects Studies For PETRA-IV",
      "authors": [
        "C. Li",
        "Y.-C. Chae",
        "DESY",
        "Hamburg",
        "Germany",
        "In this paper",
        "recent studies on the beam collective effects in the PETRA-IV H6BA lattice due to the impedance and wake-filed are reported. In general",
        "the single bunch motion lies in board band impedance",
        "whereas the coupled bunch could be excited by HOM",
        "beam-ion effect",
        "beam-loading",
        "et. ac. Beam intensity limits either the charge in the bunch (single-bunch instabilities) or the total current of the accumulated beam (multi-bunch instabilities) are studied. With the nominal chromaticity setting 5",
        "the maximum 3 mA single bunch can be delivered in the current design scheme. With the help of an external feedback system",
        "which supplies 100 turns damping time",
        "the coupled bunch motion can also be well stabilized."
      ],
      "institutions": [],
      "abstract": "This project has received funding from the European Union’s Horizon 2020 research and innovation program under grant agreement No. 871072",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/wezat0103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/wezat0103.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/wezat0103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-WEZAT0103",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-11 08:35:16"
}