{
  "session_info": {
    "id": "THCEMH",
    "name": "THCEMH - Magnetic and vacuum systems, power supplies",
    "url": "https://proceedings.jacow.org/rupac2016/html/thcemh.htm"
  },
  "papers": [
    {
      "paper_id": "THCEMH01",
      "title": "Vacuum Insulation Tandem Accelerator: Progress and Prospects",
      "authors": [
        "S.Yu. Taskaev",
        "A.A. Ivanov",
        "D.A. Kasatov",
        "A.N. Makarov",
        "Y.M. Ostreinov",
        "I.M. Shchudlo",
        "I.N. Sorokin",
        "T. Sycheva",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Budker INP & NSU",
        "Novosibirsk",
        "Russia",
        "A.A. Ivanov",
        "Ya.A. Kolesnikov",
        "A.M. Koshkarev",
        "E.O. Sokolova",
        "S.Yu. Taskaev",
        "NSU",
        "Novosibirsk",
        "Russia",
        "A promising method of treatment of many malignant tumors is the boron neutron capture therapy (BNCT)*. It provides a selective destruction of tumor cells by prior accumulation of a stable boron-10 isotope inside them and subsequent irradiation with epithermal neutrons. It is expected that accelerator based neutron sources will be created for the clinical practice. One such source could be an original source of epithermal neutrons**",
        "created in BINP. To obtain proton beam a new type of particle accelerator is used - tandem accelerator with vacuum insulation. Generation of neutrons is carried out as a result of the threshold reaction 7Li(p",
        "n)7Be. During 2015-2016 in the construction of tandem accelerator with vacuum insulation several changes were made. This allowed us to suppress the unwanted flow of charged particles in the accelerator",
        "to improve its high-voltage stability",
        "and to increase the proton beam current from 1.6 to 5 mA. Such current value is sufficient for BNCT. The report describes in detail the modernization of the accelerator",
        "presents and discusses the results of experiments on obtaining the proton beam and the formation of neutron flux using lithium target",
        "and declares our prospective plans. The obtained neutron beam meets the requirements of BNCT: the irradiation of cell cultures provides the destruction of cells with boron and preservation of cells without boron. Irradiation of immunodeficient mice with grafted glioblastoma results in their recovery.",
        "*Neutron Capture Therapy. Principles and Applications. Eds: W. Sauerwein",
        "A. Wittig",
        "R. Moss",
        "Y. Nakagawa. Springer",
        "2012. **S. Taskaev. Accelerator based epithermal neutron source. Physics of Particles and Nuclei 46 (2015) 956-990."
      ],
      "institutions": [
        "Funding: The study was supported by the grants from the Ministry of Science of the Russian Federation, the Russian Science Foundation, Budker Institute of Nuclear Physics and Novosibirsk State University."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/thcemh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/thcemh01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/thcemh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-THCEMH01",
      "page_number": "147",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCEMH20",
      "title": "HV Nanosecond Generators for Accelerators on the Basis of FID-Technology",
      "authors": [
        "M.V. Efanov",
        "V.M. Efanov",
        "A.V. Kriklenko",
        "S.V. Zazulin",
        "JSC FID Technology",
        "Saint Petersburg",
        "Russia",
        "High voltage pulse generators (HVG) in accelerators usually have 1-100kV amplitude",
        "1-100ns pulse duration",
        "PRF up to dozens of MHz. Wide opportunities can be provided by new generation high power DRD and FID switches produced by JSC \"FID Technology\". The company has developed kicker HVG for accelerators with 1-5kV amplitude",
        "5-50ns pulse duration and PRF up to 5MHz. Rise time can be 1-2ns and fall time - 3-4ns. Pulses are generated in burst mode. Pulse amplitude stability within a burst is better than 1%. PRF within a burst can vary. The other kicker HVG type provides square pulses with 10-100kV amplitude",
        "1-100ns pulse duration. PRF can be up to 1kHz",
        "0",
        "1-10ns rise time. HVG is connected to load via 75-50Ohm coaxial cables. Peak current is up to several kA",
        "and generated pulses have high amplitude and time stability",
        "time jitter does not exceed 30ps. This gives possibility of using multichannel HVGs in synchronous mode. HVGs for klystrons have 50-300kV amplitude",
        "100ns-several mks pulse duration. Minimum rise time is about 10-20ns",
        "stability of pulse flat top is a few per cent. All HVGs can be PC-controlled",
        "have either one-phase or three-phase input power.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/thcemh20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/thcemh20.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/thcemh20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-THCEMH20",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 02:39:50"
}