{
  "session_info": {
    "id": "FRKPL",
    "name": "FRKPL - Keynote Speaker",
    "url": "https://proceedings.jacow.org/icalepcs2017/html/frkpl.htm"
  },
  "papers": [
    {
      "paper_id": "FRKPL01",
      "title": "The Birth of the Gravitational Wave Astronomy",
      "authors": [
        "LNGS",
        "Assergi",
        "Italy",
        "Prof. Eugenio Coccia is the founder of the School of Advanced Studies GSSI (Gran Sasso Science Institute) and its Rector since 2016. He is a physicist with expertise on astroparticle physics",
        "with a focus on gravitational wave experiments. He is recognized for the development of cryogenic detectors of gravitational waves and is one of the authors of the recent discovery of gravitational waves and of the first observation of Black Holes. He has been Full Professor at the Università di Roma Tor Vergata (2000-2016)",
        "Chair of the INFN Scientific Committee on Astroparticle Physics (2002-2003)",
        "Director of the INFN Gran Sasso Laboratory (2003-2009)",
        "President of the Italian Society of General Relativity and Gravitational Physics (2000-2004)",
        "Chair of the Gravitational Wave International Committee (GWIC) (2011-2015)",
        "among other responsibilities. He has given lectures and seminars in Universities and research centers all over the world and is the author of about 300 scientific articles in international journals and editor of six books in the field of astroparticle physics. He is member of the Academia Europaea",
        "honoris causa",
        "and Fellow of the European Physical Society."
      ],
      "institutions": [],
      "abstract": "Talk as video stream: https://youtu.be/akvZemt3wK4",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/frkpl01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/frkpl01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/frkpl01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-FRKPL01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:20:14"
}