{
  "session_info": {
    "id": "WECC",
    "name": "WECC - Contributed Talk in Wednesday-C",
    "url": "https://proceedings.jacow.org/IBIC2012/html/wecc.htm"
  },
  "papers": [
    {
      "paper_id": "WECC01",
      "title": "IFMIF-LIPAc Diagnostics and its Challenges",
      "authors": [
        "J. Marroncle",
        "P. Abbon",
        "J.F. Denis",
        "J. Egberts",
        "J.-F. Gournay",
        "F. Jeanneau",
        "A. Marchix",
        "J.-Ph. Mols",
        "T. Papaevangelou",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "J.C. Calvo",
        "J.M. Carmona",
        "P. Fernández",
        "A. Guirao",
        "D. Iglesias",
        "C. Oliver",
        "I. Podadera",
        "A. Soleto",
        "CIEMAT",
        "Madrid",
        "Spain",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "CEA/DRT/LIST",
        "Gif-sur-Yvette Cedex",
        "France",
        "The International Fusion Materials Irradiation Facility (IFMIF) aims at providing a very intense neutron source (1017 neutron/s) to test the structure materials for the future fusion reactors",
        "beyond ITER (International Thermonuclear Experimental Reactor). Such a source will be driven using 2 deuteron accelerators 125 mA cw up to 40 MeV impinging into a lithium liquid curtain",
        "thus producing very high neutron flux with a similar spectrum as those expected in fusion reactors. A validation phase was decided for this 10 MW facility consisting partly in the design of the prototype accelerator LIPAc (Linear IFMIF Prototype Accelerator). LIPAc",
        "which is in design phase",
        "will accelerate a 125 mA cw beam deuteron up to the first superconductive linac module (4 for IFMIF). The 9 MeV beam will be driven through a HEBT to beam dump. This facility is currently under construction at Rokkasho (Japan). We propose to describe the beam diagnostics foreseen for this 1.125 MW accelerator emphasizing the challenges encountered and the overcome solutions",
        "if any."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/wecc01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/wecc01.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/wecc01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-WECC01",
      "page_number": "557",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECC03",
      "title": "Intensity Imbalance Optical Interferometer Beam Size Monitor",
      "authors": [
        "ASCo",
        "Clayton",
        "Victoria",
        "Australia",
        "T.M. Mitsuhashi",
        "T. Naito",
        "KEK",
        "Ibaraki",
        "Japan",
        "The University of Melbourne",
        "Melbourne",
        "Australia",
        "The technique of measuring the beam size in a particle accelerator with an optical interferometer with the Mitsuhashi apparatus is well established and one of the only direct measurement techniques available. However",
        "one of the limitations of the technique is the dynamic range and noise level of CCD cameras when measuring ultra low emittance beams and hence visibilities close to unity. A new design has been successfully tested to overcome these limitations by introducing a know intensity imbalance in one of the light paths of the interferometer. This modification reduces the visibility in a controlled way and lifts the measured interference pattern out of the noise level of the CCD",
        "thus increasing the dynamic range of the apparatus. Results are presented from tests at the ATF2 at KEK and on the optical diagnostic beamline at the Australian Synchrotron storage ring."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/wecc03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/wecc03.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/wecc03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-WECC03",
      "page_number": "566",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECC04",
      "title": "Analysis of the Electro-optical Front End for the New 40 GHz Bunch Arrival Time Monitor System",
      "authors": [
        "A. Kuhl",
        "J. Rönsch-Schulenburg",
        "J. Roßbach",
        "Uni HH",
        "Hamburg",
        "Germany",
        "A. Angelovski",
        "R. Jakoby",
        "A. Penirschke",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "M. Bousonville",
        "M.K. Czwalinna",
        "H. Schlarb",
        "C. Sydlo",
        "DESY",
        "Hamburg",
        "Germany",
        "IFH",
        "Zurich",
        "Switzerland",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "The Free electron LASer in Hamburg (FLASH) is currently equipped with four Bunch Arrival time Monitors (BAMs) which achieve a time resolution of less than 10 fs for bunch charges higher than 500 pC (1). In order to achieve single spike FEL pulses at FLASH",
        "electron bunch charges down to 20 pC are of interest. With the current BAMs the required time resolution is not reachable for bunch charges below 500 pC. Therefore new pickups with a bandwidth of up to 40 GHz (2) are designed and manufactured. The signal evaluation takes place with a time-stabilized reference laser pulse train which is modulated with an Electro-Optical intensity Modulator (EOM). The new pickup system also requires a new electro-optical frontend with a 40 GHz EOM. The theoretical limits of the time resolution depending on the RF signal at different bunch charges and on the jitter of the reference laser pulses where analyzed for the new EOM.",
        "(1) M. K. Bock et al. in Proceedings of DIPAC 2011",
        "Hamburg",
        "Germany",
        "2011",
        "p. 365  (2) A. Angelovski",
        "A. Kuhl et al. in Proceedings of IPAC 2011",
        "San Sebastian",
        "Spain",
        "2011",
        "p. 1177 and p. 1186"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/wecc04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/wecc04.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/wecc04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-WECC04",
      "page_number": "571",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 18:03:49"
}