{
  "session_info": {
    "id": "TUXGBD",
    "name": "TUXGBD - MC1 Orals",
    "url": "https://proceedings.jacow.org/ipac2018/html/tuxgbd.htm"
  },
  "papers": [
    {
      "paper_id": "TUXGBD1",
      "title": "Potential and Issues for Future Accelerators and Ultimate Colliders",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Particle colliders have been remarkably successful tools in particle and nuclear physics. What are the future trends and limitations of accelerators as they currently exist",
        "and are there possible alternative approaches? What would the ultimate collider look like? This talk examines some challenges and possible solutions. Accelerating a single particle rather than a thermal distribution may allow exploration of more controlled interactions without background. Also",
        "cost drivers are possibly the most important limiting factor for large accelerators in the foreseeable future so emerging technologies to reduce cost are highlighted."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tuxgbd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tuxgbd1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tuxgbd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUXGBD1",
      "page_number": "578",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXGBD2",
      "title": "Colliding Heavy Ions in the LHC",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "The Large Hadron Collider at CERN not only collides protons but also heavier nuclei. So far Pb+Pb",
        "Xe-Xe and p+Pb collisions",
        "at multiple energies",
        "have been provided for what was initially conceived as a distinct physics program on the collective behavior of QCD matter at extreme energy density and temperature. However unexpected phenomena observed in p+Pb and p+p collisions at equivalent energies have blurred the distinction. Intense",
        "low-emittance",
        "ion beams are provided by a dedicated source and injector chain setup. When Pb beams collide",
        "new luminosity limits arise from photon-photon and photonuclear interactions but effective mitigations have allowed luminosities over 3 times design. Asymmetric p+Pb collisions introduce new features and beam-dynamical phenomena into operation of the LHC but have also achieved luminosity far beyond expectations. With experimental requirements for multiple changes in energy and data-taking configurations during very short heavy-ion runs",
        "high operational efficiency and reliability are vital. This invited talk discusses performance",
        "future prospects",
        "and technical challenges for the LHC heavy ion program",
        "including injector performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tuxgbd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tuxgbd2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tuxgbd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUXGBD2",
      "page_number": "584",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXGBD3",
      "title": "Ideas and Concepts for Future Electron Ion Colliders",
      "authors": [
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Different versions of future electron-ion colliders have been proposed by Brookhaven National Laboratory (BNL) and Thomas Jefferson National Laboratory (JLAB)",
        "one based on colliding protons in a ring with electrons from an Energy Recovery Linac (ERL)",
        "the other two based on ring-ring colliders. To attain the luminosity goal strong hadron cooling is required",
        "as could be provided with several proposed new cooling schemes. Polarization of both colliding beams is essential. This invited talk will compare the various designs and highlight some of the novel ideas and concepts."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tuxgbd3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tuxgbd3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tuxgbd3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUXGBD3",
      "page_number": "590",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:24:18"
}