{
  "session_info": {
    "id": "MOPFI",
    "name": "MOPFI - Poster Session",
    "url": "https://proceedings.jacow.org/IPAC2013/html/mopfi.htm"
  },
  "papers": [
    {
      "paper_id": "MOPFI001",
      "title": "Characterization of a Superconducting Pb Photocathode in a SRF Gun Cavity",
      "authors": [
        "R. Barday",
        "T. Kamps",
        "O. Kugeler",
        "A. Neumann",
        "M. Schmeißer",
        "J. Völker",
        "HZB",
        "Berlin",
        "Germany",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "NCBJ",
        "Świerk/Otwock",
        "Poland",
        "DESY",
        "Hamburg",
        "Germany",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Photocathodes are a limiting factor for the next generation of ultra-high brightness photoinjector driven accelerators. We studied the behavior of a superconducting Pb cathode in the cryogenic environment of a superconducting rf gun cavity related to the quantum efficiency",
        "its spatial distribution and the work function. Cathode surface contaminations can modify the performance of the photocathodes as well as the gun cavity. We discuss the possibilities to remove these contaminations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi001.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI001",
      "page_number": "279",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI002",
      "title": "Results from Beam Commissioning of an SRF Plug-gun Cavity Photoinjector",
      "authors": [
        "M. Schmeißer",
        "R. Barday",
        "A. Burrill",
        "A. Jankowiak",
        "T. Kamps",
        "J. Knobloch",
        "O. Kugeler",
        "P. Lauinger",
        "A. Neumann",
        "J. Völker",
        "HZB",
        "Berlin",
        "Germany",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "NCBJ",
        "Świerk/Otwock",
        "Poland",
        "DESY",
        "Hamburg",
        "Germany",
        "MBI",
        "Berlin",
        "Germany",
        "Superconducting rf photoelectron injectors (SRF guns) hold the promise to deliver high brightness",
        "high average current electron beam for future lightsources or other applications demanding continuous wave operation of an electron injector. This paper discusses results from beam commissioning of a hybrid Pb coated plug-gun Nb cavity based SRF photoinjector for beam energies up to 3 MeV at Helmholtz-Zentrum Berlin. Emittance measurements and transverse phase space characterization with solenoid-scan and pepperpot methods will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi002.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI002",
      "page_number": "282",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI003",
      "title": "SRF Photoinjector Cavity for BERLinPro",
      "authors": [
        "A. Neumann",
        "W. Anders",
        "A. Burrill",
        "A. Frahm",
        "T. Kamps",
        "J. Knobloch",
        "O. Kugeler",
        "HZB",
        "Berlin",
        "Germany",
        "FZJ",
        "Jülich",
        "Germany",
        "For the funded BERLinPro project",
        "a 100 mA CW-driven SRF energy recovery linac",
        "a SRF photoinjector cavity has to be developed which delivers a small emittance",
        "1 mm*mr",
        "high brightness beam while accelerating a high average current within given high power limitations. To achieve these goals the injector is being developed in a three stage approach. In the current design step a cavity shape was developed which fulfills the beam dynamics requirements",
        "implements a high quantum efficiency normal conducting photocathode with the HZDR choke and insert design and allows for beam studies at currents up to 4 mA. This paper will describe the RF design process",
        "higher order mode studies and final mechanical calculations prior to the cavity production."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi003.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI003",
      "page_number": "285",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI004",
      "title": "The Injector Layout of BERLinPro",
      "authors": [
        "B.C. Kuske",
        "M. Abo-Bakr",
        "V. Dürr",
        "A. Jankowiak",
        "T. Kamps",
        "J. Knobloch",
        "P. Kuske",
        "S. Wesch",
        "HZB",
        "Berlin",
        "Germany"
      ],
      "institutions": [],
      "abstract": "BERLinPro is an Energy Recovery Linac Project running since 2011 at the HZB in Berlin. The key component of the project is the 100mA superconducting RF photocathode gun under development at the HZB since 2010. Starting in 2016 the injector will go into operation providing 6 MeV electrons with an emittance well below 1mm mrad and bunches shorter than 4ps. 2017 the 50MeV linac will be set up and full recirculation is planned for 2018. The injector design including a dogleg merger has been finalized and is described in detail in this paper. Emphasis is laid on the final layout including collimators and diagnostics and performance simulations of two different gun cavities and first tolerance studies.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi004.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI004",
      "page_number": "288",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI005",
      "title": "XPS and UHV-AFM Analysis of the K2CsSb Photocathodes Growth",
      "authors": [
        "HZB",
        "Berlin",
        "Germany",
        "I. Ben-Zvi",
        "M. Ruiz-Osés",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "SBU",
        "Stony Brook",
        "New York",
        "USA",
        "H.A. Padmore",
        "T. Vecchione",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "T. Rao",
        "J. Smedley",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Next generation light sources",
        "based on Energy Recovery Linac and Free Electron Laser technology will rely on photoinjector based electron sources. Successful operation of such sources requires reliable photocathodes with long operational life",
        "uniform and high quantum efficiency",
        "low thermal emittance and low dark current. The goal of this project is to construct a cathode which meets these requirements. Advances in photocathode research must take a combined effort. The materials have to be analyzed by means of chemical composition",
        "surface structure and these findings have to be correlated to the quantum efficiency and performance in the injector. The presented work focuses on the chemical composition and surface structure of K2CsSb photocathodes. The XPS and AFM measurements were performed at the Center of Functional Nanomaterials at BNL. K2CsSb photocathodes were grown under UHV conditions. The components were adsorbed one at a time and after each growth step the corresponding XPS spectra was taken. During growth the quantum efficiency was recorded. As last step the sample was moved into the AFM without exposure to air to determine the surface roughness."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi005.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI005",
      "page_number": "291",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI006",
      "title": "A New Load Lock System for the Source of Polarised Electrons at ELSA",
      "authors": [
        "D. Heiliger",
        "W. Hillert",
        "B. Neff",
        "ELSA",
        "Bonn",
        "Germany",
        "The inverted source of polarized electrons at the electron stretcher accelerator ELSA routinely provides a pulsed beam with a current of 100 mA and a polarization degree of about 80%. One micro-second long pulses with 100 nC charge are produced by irradiating a GaAs strained-layer superlattice photocathode (8 mm in diameter) with laser light. Future accelerator operation requires a significantly higher beam intensity",
        "which can be achieved by using photocathodes with sufficiently high quantum efficiency. Therefore",
        "and in order to enhance the reliability and uptime of the source",
        "a new extreme high-vacuum (XHV) load lock system was installed and commissioned. It consists of a loading chamber in which an atomic hydrogen source is used to remove any remaining surface oxidation",
        "an activation chamber for heat cleaning of the photocathodes and activation with cesium and oxygen and a storage chamber in which up to five different types of photocathodes with various diameters of the emitting surface can be stored under XHV conditions. Additionally",
        "tests of the photocathodes' properties can be performed during accelerator operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi006.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI006",
      "page_number": "294",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI007",
      "title": "SIS-18 RF Knock-Out Optimization Studies",
      "authors": [
        "M.M. Kirk",
        "D. Ondreka",
        "P.J. Spiller",
        "GSI",
        "Darmstadt",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The extraction efficiency and spill temporal-structure of the SIS-18 heavy ion synchrotron are part of the upgrades to the GSI accelerator complex. Losses to the extraction septum can be minimised through implementation of the Hardt condition resulting however in a poorer quality of the spill microstructure at resolutions of a few microseconds due to lowering of the horizontal chromaticity from its 'natural' value. Ways to improve the extraction efficiency and spill microstructure are investigated with a tracking code. One possibility for improvement may be to use an alternative RF modulation applied to the knock-out exciter.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi007.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI007",
      "page_number": "297",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI010",
      "title": "Initial Beam Loss and Control of Dynamic Vacuum Effects in SIS18",
      "authors": [
        "FIAS",
        "Frankfurt am Main",
        "Germany",
        "M.M. Kirk",
        "D. Ondreka",
        "P.J. Spiller",
        "GSI",
        "Darmstadt",
        "Germany",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "To stabilize the dynamic pressure in the SIS18",
        "the systematic initial beam loss must be minimized. Beam Particles",
        "which are lost on the vaccum chamber cause a local pressure increase. Thereby the collision rate between beam ions and residual gas particles and consequently beam loss by ionization is enhanced. The reduction and control of beam loss in the injection channel",
        "during multiturn injection and during the Rf capture process has an outstanding importance for the vacuum dynamics. One way to minimize the initial losses in the synchrotron is to displace the beam loss into the transfer channel (TK) between UNILAC and SIS. In the transfer channel",
        "the beam edges are trimmed by means of a collimator system and a sharply defined phase space area can be injected into SIS18. The effect of reduced initial beam loss on the vaccum dynamics is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi010.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI010",
      "page_number": "300",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI011",
      "title": "Construction and First Tests of the New Injection System for the Linac II at DESY",
      "authors": [
        "C. Liebig",
        "M. Hüning",
        "M. Schmitz",
        "DESY",
        "Hamburg",
        "Germany",
        "For the Linac II",
        "which supplies the accelerator chain at DESY with electrons and positrons",
        "a new injection system is planned. It is supposed to ensure reliable operation and to avoid the beam loss of about 60% at energies up to 400 MeV and the associated activation. The function of the injector components",
        "the entire injection system and the acceleration in the linac sections were optimized in simulations. The main components are a 6 A/100 kV triode gun",
        "buncher and a dispersive section for energy collimation. The output energy is 5 MeV and the beam pulse length can be chosen from 5 ns to 50 ns. The new buncher structure is a hybrid of a standing wave and traveling wave structure and allows a compact design and good electron capture. One of two assembled structures has been tuned and completed a test rig in the linac tunnel. In this test system detailed analysis of its properties is in progress as well as minor corrections like alignment and improvements of reliability. The final installation is going to take place from September 2013. First experimental analysis compared to simulation results will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi011.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI011",
      "page_number": "303",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI012",
      "title": "Measurement of Adsorption Rates of Residual Gases for NEA-GaAs Surface",
      "authors": [
        "M. Kuriki",
        "H. Iijima",
        "K. Miyoshi",
        "K.U. Uchida",
        "HU/AdSM",
        "Higashi-Hiroshima",
        "Japan",
        "A GaAs photocathode activated the surface to negative-electron-affinity (NEA) is an important device for high-average-current electron accelerators such as a next-generation light source based on an energy recovery linac. The NEA surface is normally formed by a yo-yo technique in which cesium and oxygen are applied onto the surface alternately. Although the initial quantum efficiency is relatively larger than that of another cathode",
        "the lifetime is shorter. The degradation with time elapsing even if the electron beam is not extracted is mainly caused by adsorption of residual gases in a vacuum chamber. We have evaluated the adsorption rates of various gases for the NEA surface by measuring the dark lifetime in sample gases such as hydrogen",
        "carbon oxide and carbon dioxide."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi012.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI012",
      "page_number": "306",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI013",
      "title": "A Lifetime Study of CsK2Sb Cathode",
      "authors": [
        "M. Kuriki",
        "H. Iijima",
        "K. Miyoshi",
        "N. Norihito",
        "HU/AdSM",
        "Higashi-Hiroshima",
        "Japan",
        "CsK2Sb multi-alkali cathode is one of the candidates of robust and high efficiency cathode for high brightness electron source. CsKSb can be driven by green laser and it is a big advantage comparing to Cs2Te cathode which is widely used as a robust photo-cathode and driven by UV light. In Hiroshima University",
        "a test chamber for CsK2Sb photo-cathode study is developed. In the chamber",
        "CsK2Sb photo-cathode is formed by evaporation on SUS base plate. During the evaporation",
        "amount is monitored by quartz meter. We devised good locations of the evaporation source",
        "base plate",
        "and thickness monitor",
        "so that all evaporation processes for Cs",
        "K",
        "and Sb are under control. The base plate temperature is also controlled during the cathode formation. More than 2.0% quantum efficiency was achieved at the first activation test. The cathode lifetime was more than 200 hours and more than 20C in charge. The latest experimental result will be reported."
      ],
      "institutions": [
        "Funding: Cooperative and Supporting Program for Researches and Educations in　Universities by High energy accelerator research organization (KEK)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI013",
      "page_number": "309",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI014",
      "title": "A Charge Lifetime Study of NEA GaAs Cathode by Ion Back-bombardment",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "L. Guo",
        "H. Iijima",
        "K. Miyoshi",
        "HU/AdSM",
        "Higashi-Hiroshima",
        "Japan",
        "NEA GaAs cathode is one of the most important techniques for advanced future projects based on linac. Up to 90% polarized beam can be generated with high quantum efficiency",
        "0.1 – 10%. The extremely low emittance beam can be generated driven by optimized wavelength laser. Although these remarkable features",
        "the less robustness has been the biggest issue on the real operation of this cathode. According to past experiments",
        "there are three sources of the cathode degradation; gas absorption",
        "thermal desorption",
        "and ion-back bombardment. First two processes could be controlled by less vacuum pressure in order of 10-10Pa and keeping the cathode temperature low. The ion back-bombardment is the last issue which should be solved for high brightness operation in such as ERL. We observed the cathode quantum efficiency evolution in various laser power density and bias voltage. We found that the cathode degradation was due to the ion back-bombardment quantitatively and the deactivation coefficient of NEA surface by one ion collision did not depend on the bias voltage. We report the experimental results and its analysis based on the ion back-bombardment hypothesis."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi014.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI014",
      "page_number": "312",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI017",
      "title": "SuperKEKB Positron Source Target Protection Scheme",
      "authors": [
        "L. Zang",
        "T. Kamitani",
        "KEK",
        "Ibaraki",
        "Japan",
        "The SuperKEKB requires an intense beam with a large number of positrons",
        "which is generated by a high energy electron beam strike on a solid tungsten target. The cascade shower in the target deposits large amount of energy in the material leading to target damage. The pulsed electron beam distributed the energy non-uniformly over the target. In that case",
        "a mechanical stress appears due to the large thermal gradient during each pulse",
        "which could potentially destroy the target. Based on the analysis of the SLAC damaged target",
        "peak energy deposition density (PEDD) should not exceed 35 J/g to ensure a long term of safe operation. One way of reducing PEDD is increasing the beam spot size. Hence we proposed a target protection scheme",
        "in which a protection target is placed upstream of generation target as a spoiler. The aim is to maintain the generation target’s PEDD below 35 J/g even with a point primary electron beam. In this paper",
        "we will introduce graphite",
        "aluminum and copper as the protection target material candidates. And also present the PEDD and positron yield evaluation as a function of various parameters such as protection target thickness and drift space."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi017.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI017",
      "page_number": "315",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI018",
      "title": "Design Study of a New Large Aperture Flux Concentrator",
      "authors": [
        "L. Zang",
        "M. Akemoto",
        "S. Fukuda",
        "K. Furukawa",
        "T. Higo",
        "K. Kakihara",
        "T. Kamitani",
        "Y. Ogawa",
        "H. Someya",
        "T. Takatomi",
        "KEK",
        "Ibaraki",
        "Japan",
        "For high luminosity electron-positron colliders",
        "intense positron beam production is one of the key issues. Flux Concentrator (FC) is a pulsed solenoid that can generate high magnetic field of several Tesla and is often used for focusing positrons emerged from a production target. It works as an optical matching device in a positron capture section. With this device",
        "high capture efficiency is achieved. In this paper",
        "we will introduce a new design of a FC for the SuperKEKB positron source. The advantages of the new design are: 1. the aperture could be doubled of the previous design",
        "2. the transverse components are only 1/10 of the previous design",
        "3. maintain the same high peak longitudinal field. The new FC modeling has been done in CST Studio and we will report the results of new FC field evaluation. In order to calculate the positron yield and capture efficiency",
        "a tracking simulation to the end of capture section has also been carried out",
        "which is also included in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi018.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI018",
      "page_number": "318",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI019",
      "title": "Beam Generation from a 500 kV DC Photoemission Electron Gun",
      "authors": [
        "N. Nishimori",
        "R. Hajima",
        "S.M. Matsuba",
        "R. Nagai",
        "JAEA",
        "Ibaraki-ken",
        "Japan",
        "Y. Honda",
        "T. Miyajima",
        "M. Yamamoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "H. Iijima",
        "M. Kuriki",
        "HU/AdSM",
        "Higashi-Hiroshima",
        "Japan",
        "Nagoya University",
        "Nagoya",
        "Japan"
      ],
      "institutions": [
        "The next generation light source such as X-ray FEL oscillator requires high brightness electron gun with megahertz repetition rate. We have developed a DC photoemission electron gun at JAEA for the compact energy recovery linac (cERL) light source under construction at KEK. This DC gun employs a segmented insulator with guard rings to protect the insulator from field emission generated from central stem electrode. We have successfully applied 500-kV on the ceramics with a cathode electrode in place and generated beam from the 500kV DC photoemission gun in October 2012. Details of the beam generation test will be presented."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi019.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI019",
      "page_number": "321",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI020",
      "title": "Cold Test of the Coaxial Cavity for Thermionic Triode Type RF Gun",
      "authors": [
        "T. Konstantin",
        "Y.W. Choi",
        "T. Kii",
        "R. Kinjo",
        "K. Masuda",
        "M. Mishima",
        "K. Nagasaki",
        "H. Negm",
        "H. Ohgaki",
        "K. Okumura",
        "M. Omer",
        "S. Shibata",
        "K. Shimahashi",
        "K. Yoshida",
        "H. Zen",
        "Kyoto University",
        "Institute for Advanced Energy",
        "Kyoto",
        "Japan",
        "A thermionic rf gun has several advantages as compared to photocathode gun. Such as low cost",
        "high averaged current and simple operation. However a thermionic rf gun has a significant disadvantage in form of back bombardment effect. The KU-FEL facility is an oscillator type FEL",
        "which uses a thermionic 4.5 cell S-band RF gun for electron beam generation. The back bombardment effect causes increasing current in macropulse",
        "which limits the gain of the FEL. In order to mitigate the current increase we plan to modify thermionic rf gun to triode type rf gun. Therefore an additional rf cavity has been designed. This cavity has separate rf power supply with amplitude and phase control. By this means we can properly adjust the injection of electrons into the main gun body. According to simulations the triode type gun can reduce 80% of back streaming electron energy*. The cold tests of the first prototype have revealed deviation from designed values**. Based on the tests of the first prototype new prototype with integrated mechanism for resonance tuning has been designed and fabricated. In this work we report the cold test of the redesigned prototype of the coaxial rf cavity.",
        "* K. Masuda et al. Proceedings of FEL 2006",
        "BESSY Berlin.  ** M. Takasaki et al. Proceedings of FEL 2010",
        "Malbö"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi020.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI020",
      "page_number": "324",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI023",
      "title": "Development of Better Quantum Efficiency and Long Lifetime Iridium Cerium Photocathode for High Charge electron RF Gun",
      "authors": [
        "TIT",
        "Tokyo",
        "Japan",
        "RLNR",
        "Tokyo",
        "Japan",
        "KEK",
        "Ibaraki",
        "Japan",
        "We developed an Ir5Ce photocathode as a high charge electron source for SuperKEKB electron linac. The required electron beam parameters are 5 nC and 10 mm•mrad from the electron gun of the SuperKEKB electron linac. We plan to generate this electron beam using a laser-driven RF gun installed with a photocathode that has a long lifetime and a high-power laser system through more than a year without replacement. Therefore",
        "we focused on the Ir5Ce compound as a new photocathode which has a high melting point (> 2100 K) and a low work function (2.57 eV). The results of measurements showed that the quantum efficiency of Ir5Ce photocathode was 1.0×10-4 treated by the laser cleaning using the 4nd harmonic of Nd:YAG laser or the heater treatment. Furthermore",
        "its photoemission properties could be maintained for a long term even if its photocathode was in the low vacuum conditions ( ～10-6 Pa) since the Ir5Ce compound is far less contaminated than other photocathodes. Finally",
        "We have succeed to generate electron beams of 4.4 nC by the Ir5Ce photocathode installed at the 3-2 sector DAW type RF gun and accelerate it through a linac end in KEK electron linac."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI023",
      "page_number": "327",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI024",
      "title": "Ultra-short Electron Bunch Generation by an ECC RF Gun",
      "authors": [
        "Y. Koshiba",
        "T. Aoki",
        "M. Mizugaki",
        "K. Sakaue",
        "M. Washio",
        "Waseda University",
        "Tokyo",
        "Japan",
        "T. Takatomi",
        "J. Urakawa",
        "KEK",
        "Ibaraki",
        "Japan",
        "Energy Chirping Cell attached rf gun (ECC rf gun) is a photocathode rf gun specialized for ultra-short bunch generation. This ECC rf gun has been made with the collaboration of High Energy Accelerator Research Organization (KEK). Although the bunch length could be controlled by the laser pulse width",
        "the bunch length ends up to be more than 1ps due to space charge effect when using a femto-second laser and a normal 1.6 cell cavity. Concerning this phenomenon",
        "ECC is attached right after the 1.6 cell so that the electron bunch would be compressed after the electron bunch is accelerated around 5MeV. The roll of ECC is to chirp the energy with the linear part of the rf electric field. The electron bunch would be compressed by velocity difference as it drifts. Simulation results from PARMELA and GPT show that ECC rf gun can accelerate an 100pC bunch with the bunch length less than 100fs. We already manufactured this ECC rf gun and installed in our system. We demonstrated the ultra-short bunch by measuring the coherent THz light by synchrotron radiation and transition radiation. In this conference",
        "we will report the results of ultra-short bunch generation experiments",
        "and future plans."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi024.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI024",
      "page_number": "330",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI025",
      "title": "Progress Towards High-Intensity Heavy-Ion Beams at RIKEN RIBF",
      "authors": [
        "O. Kamigaito",
        "T. Dantsuka",
        "M. Fujimaki",
        "T. Fujinawa",
        "N. Fukunishi",
        "H. Hasebe",
        "Y. Higurashi",
        "E. Ikezawa",
        "H. Imao",
        "T. Kageyama",
        "M. Kase",
        "M. Kidera",
        "M. Komiyama",
        "H. Kuboki",
        "K. Kumagai",
        "T. Maie",
        "M. Nagase",
        "T. Nakagawa",
        "M. Nakamura",
        "J. Ohnishi",
        "H. Okuno",
        "K. Ozeki",
        "N. Sakamoto",
        "K. Suda",
        "H. Watanabe",
        "T. Watanabe",
        "Y. Watanabe",
        "K. Yamada",
        "H. Yamasawa",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "The RIKEN RIBF(Radioactive Isotope Beam Factory) accelerator complex has been designed and constructed to provide heavy-ion beams from D to U ions with the energy of 400 MeV/u to the maximum. Though the goal intensity is 1 particle μ amperes for the whole mass range",
        "the intensities of very heavy-ions from Ca to U are still not satisfactory. In 2012",
        "owing to the intensity upgrade of 48Ca beams from ECR ion source",
        "the beam current of 48Ca was 400 pnA which was improved by factors of 2 in comparison with that in 2011. Since 2011",
        "the new injector"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi025.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI025",
      "page_number": "333",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI026",
      "title": "Thermal Simulations of a New Target Configuration for Production of Radioactive Nuclide",
      "authors": [
        "L.H. Chen",
        "B.Q. Cui",
        "Q.H. Huang",
        "W. Jiang",
        "R. Ma",
        "Y.J. Ma",
        "B. Tang",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "China Advanced Rare Ion-beam Facility (CARIF) based on China Advanced Research Reactor (CARR) has been proposed in order exploring the frontier of nuclear physics. A target with 5 g 235U is proposed in the project. The thermal neutron fission of 235U will produce radioactive nuclei and the great thermal load (~50 kW). The target of CARIF needs endure high temperature and thermal energy deposit. A new multi-targets configuration is proposed. It consists of several discrete targets instead of traditional single-target structure used in accelerator driven facility. Because there is more thermal radiation area in this configuration",
        "thermal radiation capacity is enhanced",
        "so the target can withstand higher thermal power. The temperature distribution of multi-targets was simulated with finite element code. The results show that the configuration of multi targets can effectively reduce the target temperature. From the perspective of target temperature distribution",
        "the configuration could endure 50kW thermal deposit. It's possible to use 5 g 235U in CARIF for production of radioactive nuclide."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi026.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI026",
      "page_number": "336",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI027",
      "title": "The Progress of the BRISOL Facility at CIAE",
      "authors": [
        "B. Tang",
        "L.H. Chen",
        "B.Q. Cui",
        "Q.H. Huang",
        "W. Jiang",
        "R. Ma",
        "Y.J. Ma",
        "Z. Peng",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "Beijing Radioactive Ion-beam Facilities Isotope Separator On-Line (BRISOL)",
        "aiming to generate short life radioactive ion beam (RIB) on-line",
        "is being constructed at China Institute of Atomic Energy(CIAE). Up to now",
        "construction of major equipment for BRISOL is completed",
        "including ion source",
        "vacuum system",
        "separator",
        "optical element",
        "and beam diagnostic system",
        "and assembling is underway in laboratory. The on-site installation of all the beam line will be carried out soon. All the major element prototype including surface ion source",
        "quadrupole",
        "hexapole",
        "multipole and beam diagnostic system have been studied off-line on a test-bench for BRISOL. A Li beam was generated and separated . The primary tests show that the ion source and the optical elements work well. The test charge exchange cell (CEC) is under way. BRISOL will be commissioned next year."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi027.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI027",
      "page_number": "339",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI028",
      "title": "Physical Design Progress of an 800 MeV High Power Proton Driver",
      "authors": [
        "J.J. Yang",
        "Shizhong. An",
        "M. Li",
        "T.J. Zhang",
        "J.Q. Zhong",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "We presented the conceptual design of an 800 MeV high power proton ring cyclotron in the paper[1] . A more detailed physical design was carried out since then. The most challenging issues regarding the high power operation",
        "including the space charge effects and beam loss during the extraction",
        "are quantitatively studied by using state-of-the-art high performance computation technique. On that basis the fundamental structure of the cyclotron is adjusted and optimized so as to meet the requirements of MW-class operation. Reference: [1] T. Zhang",
        "J. Yang",
        "M. Li",
        "et. al.",
        "Conceptual design of an 800 MeV high power proton driver",
        "Nuclear Instruments and Methods in Physics Research Section B: Beam Interactions with Materials and Atoms 269(24) (2011) 2964-2967"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi028.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI028",
      "page_number": "342",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI029",
      "title": "The Construction Progress of Beijing Radioactive Ion-beam Facility",
      "authors": [
        "T.J. Zhang",
        "Shizhong. An",
        "B.Q. Cui",
        "Z.G. Li",
        "Y.L. Lu",
        "C.H. Peng",
        "F. Yang",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "The Beijing Radioactive Ion-Beam Facility (BRIF) is being constructed at CIAE. The project consists of a 100 MeV high intensity cyclotron CYCIAE-100",
        "an ISOL system with a mass resolution of 20000",
        "and a superconducting booster. The construction of the building was started on April 28",
        "2011 and the roof was sealed on Jan. 16",
        "2012. The on-site installation conditions have been ready since Sept. 27",
        "2012. Up to now",
        "the fabrication of all major components for CYCIAE-100 have been completed",
        "including the main magnet system",
        "the RF system",
        "ion source and injection",
        "main vacuum",
        "etc. The equipment fabrication for the ISOL system has been completed and magnetic mapping and shimming is being performed on the large-scale analysis magnet. The fabrication of the major components for the superconducting booster has been accomplished",
        "and the work on copper-niobium sputtering is under way. At present",
        "the installation and assembly is in full swing and the beam commissioning is to predicted to be finished in mid 2013. Taking advantage of the experiences accumulated on the CRM cyclotron with beam up to 430 uA",
        "it is likely that the first beams of 100 MeV can be achieved by the end of 2013."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi029.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI029",
      "page_number": "345",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI030",
      "title": "Study of the Beam Injection and Extraction of the Proton Irradiation Accelerator",
      "authors": [
        "Y.W. An",
        "H.F. Ji",
        "S. Wang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The proton irradiation accelerator is widely founded for industry application",
        "and the extracted beam is required to have large intensity as a pulse beam or uniform distribution for scanning. A multi-turn injection is adopted and the proton beam is injected into the ring with the energy of 10MeV. In order to increase injection beam intensity",
        "local bump orbit including two-bump",
        "three-bump and four-bump is well studied and optimized",
        "and the septum magnet thickness and localization are also studied for an effective injection. A RF knock-out method is used for slow extraction due to the fast response character. In order to decrease the global spill",
        "double RF kicker and the control of the aptitude modulation (AM) function of the transverse RF field are well studied."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi030.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI030",
      "page_number": "348",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI031",
      "title": "Progress on the Construction of the 100 MeV / 100 kW Electron Linac for the NSC KIPT Neutron Source",
      "authors": [
        "Y.L. Chi",
        "J. Cao",
        "P. Chen",
        "B. Deng",
        "C.D. Deng",
        "D.Y. He",
        "X. He",
        "M. Hou",
        "X.C. Kong",
        "Q. Le",
        "X.P. Li",
        "J. Liu",
        "R.L. Liu",
        "W.B. Liu",
        "H.Z. Ma",
        "G. Pei",
        "S. Pei",
        "H. Song",
        "L. Wang",
        "S.H. Wang",
        "X. Wang",
        "Q. Yang",
        "J. Yue",
        "J.B. Zhao",
        "J.X. Zhao",
        "Z.S. Zhou",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "M.I. Ayzatskiy",
        "I.M. Karnaukhov",
        "V.A. Kushnir",
        "V.V. Mytrochenko",
        "A.Y. Zelinsky",
        "NSC/KIPT",
        "Kharkov",
        "Ukraine",
        "ANL",
        "Argonne",
        "USA",
        "IHEP",
        "China is constructing a 100 MeV / 100 kW electron linac for NSC KIPT",
        "Ukraine. This linac will be used as the driver of a neutron source based on a subcritical assembly. In 2012",
        "the injector part of the linac was pre-installed as a testing facility in the experimental hall #2 of IHEP. The injector beam and key hardware testing results were satisfying. Recently",
        "the injector testing facility was disassembled and all of the components for the whole linac have been shipped to Ukraine from China by ocean shipping. The installation of the whole machine in KIPT will be started in June. The progress on the construction are reported",
        "injector beam and key hardware testing results are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi031.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI031",
      "page_number": "351",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI032",
      "title": "Electron Emission of the Stripping Foil and Collimation System for CSNS/RCS",
      "authors": [
        "M.Y. Huang",
        "Y.D. Liu",
        "N. Wang",
        "S. Wang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For the Rapid Cycling Synchrotron of the China Spallation Neutron Source (CSNS/RCS)",
        "the electron emission plays an important role in the accelerator limitation. The interactions between the proton beam and the stripping foil were studied",
        "and the electron scattering processes were simulated by the ORBIT and FLUKA codes. Then",
        "the electron energy distribution and the electron yielding rate can be given. Furthermore",
        "the interactions between the proton beam and the collimation system were studied",
        "and the electron scattering processes were simulated. Then",
        "the energy distribution of the primary electron emission can be given and the yielding rate of the primary electron can be obtained."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi032.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI032",
      "page_number": "354",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI033",
      "title": "Commissioning Results and Progress of a Helium Injector for Coupled RFQ and SFRFQ Project at Peking University",
      "authors": [
        "J. Chen",
        "J.E. Chen",
        "S.L. Gao",
        "Z.Y. Guo",
        "Y.T. Luo",
        "S.X. Peng",
        "H.T. Ren",
        "Z. Wang",
        "Z.H. Wang",
        "W.L. Xia",
        "Y. Xu",
        "A.L. Zhang",
        "T. Zhang",
        "J. Zhao",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "At Peking University (PKU) a new helium injector for coupled radio frequency quadrupole(RFQ) and separated function radio frequency quadrupole(SFRFQ) within one cavity",
        "so called as coupled RFQ & SFRFQ",
        "was designed recently*. It will provide a 30keV 20mA He+ beam whose emittance is less than 0.15 π.mm.mrad for the accelerator. It is a combination of a 2.45GHz PKU PMECRIS (Permanent Magnet ECRIS) and a 1.16 m long LEBT. Within the 1.16 m LEBT",
        "2 solenoids",
        "2 steering magnets",
        "a kicker",
        "a space charge compensation section",
        "a collimator",
        "two vacuum valves",
        "a Faraday cup and an ACCT are installed. The manufacture has been completed and the commissioning is on the way. In this paper we will address the commissioning results and its progress.",
        "* Haitao Ren",
        "et al.",
        "A Helium Injector for Coupled RFQ and SFRFQ Cavity Project at Peking University. Proc. LINAC’12",
        "Paper"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi033.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI033",
      "page_number": "357",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI034",
      "title": "First Intense H− Beam Generated by a Microwave-driven Pure Volume Source",
      "authors": [
        "S.X. Peng",
        "J. Chen",
        "J.E. Chen",
        "Z.Y. Guo",
        "H.T. Ren",
        "Zh.W. Wang",
        "Y. Xu",
        "T. Zhang",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Graduate University",
        "Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "State Key Laboratory of Nuclear Physics and Technology",
        "Beijing",
        "Haidian District",
        "People's Republic of China",
        "The 2.45 GHz Electron cyclotron resonance (ECR) plasma generators have demonstrated their efficiency",
        "reproducibility on producing H+",
        "D+",
        "O+",
        "N+",
        "He+",
        "Ar+* and He2+ at Peking University(PKU). Recently",
        "modifications on magnet field configuration",
        "discharge chamber structure and extraction system have been done to set-up a microwave-driven pure volume H− ion source. First experiment was done on PKU ion source test bench at the beginning of Nov",
        "2012. A 15 mA H− ion beam has been produced at 40 keV by this prototype source. This paper describes the source principle and design in detail and reports on the current status of the development work.",
        "* H. T. Ren",
        "S. X. Peng*",
        "P. N. Lu",
        "S. Yan",
        "Q. F. Zhou",
        "J. Zhao",
        "Z. X. Yuan",
        "Z. Y. Guo and J. E. Chen",
        "Rev. Sci. Instrum. 83",
        "02B905 (2012)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi034.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI034",
      "page_number": "360",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI035",
      "title": "Preliminary Results of H2+ Beam Generated by a 2.45 GHz Permanent Magnet ECR Ion Source at PKU",
      "authors": [
        "Y. Xu",
        "J. Chen",
        "J.E. Chen",
        "Z.Y. Guo",
        "Y.T. Luo",
        "S.X. Peng",
        "H.T. Ren",
        "Z.H. Wang",
        "T. Zhang",
        "J. Zhao",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Graduate University",
        "Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "Recently",
        "the need to build an ion source generating high current hydrogen molecular ion H2+ beam has been growing rapidly. For example",
        "H2+ ion can be used as a pilot beam of the intense deuteron beam during the commission phase of linear accelerators to minimize the activation of components. And it is an effective way to improve the output current of cyclotrons by accelerating H2+ and stripping it into H+ at the exit of accelerator",
        "instead of accelerating H+ beam directly. To obtain high-yield H2+ ion beam",
        "experimental and theoretical study was carried out on the 2.45 GHz Peking University permanent magnet electron cyclotron resonance ion source (PKU PMECR). With PMECR II*",
        "studies on the size of discharge chamber and the operation pressure were carried out to increase H2+ ion fraction. Beam analysis results prove that the H2+ can reach 40.5% with suitable operation parameters. More details will be presented in this paper.",
        "* Zhizhong Song",
        "Shixiang Peng et al.",
        "Rev. Sci. Instrum. 77",
        "03A305 (2006)  ** Author to whom correspondence should be addressed. Electronic mail:  sxpeng@pku.edu.cn."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi035.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI035",
      "page_number": "363",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI036",
      "title": "Study of the Cold Cathode RF Electron Gun Based on Doped Diamond Films at CAEP",
      "authors": [
        "TUB",
        "Beijing",
        "People's Republic of China",
        "W. Bai",
        "M. Li",
        "CAEP/IAE",
        "Mianyang",
        "Sichuan",
        "People's Republic of China"
      ],
      "institutions": [],
      "abstract": "Diamond relevant materials have been considered as a promising field emission cathode in recent years. High current density can be obtained either by diamond field emission arrays or by doped diamond films under electrical strengths of several decades of MV/m. Based on the doped films a half cell S-band electron gun has been designed and constructed at CAEP. The gun can provide an accelerating gradient of 60-80 MV/m on the cathode surface (6 mm in diameter). Simulations have proven good performance of such a gun but it needs confirmed by further experiments. Details of the experiments and comparisons with simulations will be reported.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi036.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI036",
      "page_number": "366",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI037",
      "title": "Design and Experiment of a Compact C-band Photocathode RF Gun for UED",
      "authors": [
        "X.H. Liu",
        "H.B. Chen",
        "W.-H. Huang",
        "C.-X. Tang",
        "Z. Zhang",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "A compact C-band photocathode RF gun for the MeV UED facility is developed in Tsinghua University",
        "which is designed to work at the frequency of 5.712GHz. This paper presents the physics and RF structure design",
        "and beam dynamics optimization of this C-band RF gun. Some new structure design will be adopted in this gun",
        "including the optimized cavity length and elliptical iris",
        "which is helpful to achieve lower emittance and larger mode separation. This paper likewise presents experiment parameters and the cold test results of this C-band RF gun."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi037.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI037",
      "page_number": "369",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI038",
      "title": "Generation and Measurement of Sub-picosecond Electron Bunch in Photocathode RF Gun",
      "authors": [
        "W.W. Li",
        "Z.G. He",
        "R. Huang",
        "Q.K. Jia",
        "G. Zhou",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "The generation of subpicosecond electron bunch in the photocathode rf gun was considered and simulated by improving the acceleration gradient of the gun",
        "suitably tuning the charge of the electron bunch and the acceleration phase. To measure the length of the electron bunch",
        "the design of a nondestructive bunch length measurement technology was also presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi038.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI038",
      "page_number": "372",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI039",
      "title": "The Design of a Compact THz Source Based on Photocathode RF Gun",
      "authors": [
        "W.W. Li",
        "Z.G. He",
        "R. Huang",
        "Q.K. Jia",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Narrow-band THz coherent Cherenkov radiation can be driven by a subpicosecond electron bunch traveling along the axis of a hollow cylindrical dielectric-lined waveguide. We present a scheme of compact THz radiation source based on the photocathode rf gun. On the basis of our analytic result",
        "the subpicosecond electron bunch with high charge (800pC) can be generated directly in the photocathode rf gun. A narrow emission spectrum peaked at 0.24 THz with 2 megawatt (MW) peak power is expected to gain in the proposed scheme (the length of the facility is about 1.2 m)",
        "according to the analytical and simulated results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi039.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI039",
      "page_number": "375",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI041",
      "title": "Study of Beam Longitudinal Motion for SSC",
      "authors": [
        "X.N. Li",
        "Y.J. Yuan",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "The injection",
        "acceleration and extraction of SSC（Separate Sector Cyclotron） is analyzed and simulated to get the longitudinal acceptance",
        "using the typical ion 238U36+ with energy 9.7MeV/u. In order to study the actual longitudinal acceptance of SSC",
        "the isochronous magnetic field model in coincidence with the real one is established by Kr-Kb and Lagrange methods based on the actual measurement. Under the isochronous magnetic field",
        "the longitudinal acceptance at the injection",
        "acceleration and extraction is calculated. From the simulation results the transmission efficiency is very low in SSC because of the large phase width of the beam from the injector SFC (Sector Focus Cyclotron). In the machine commissioning",
        "the phase width of the beam line from SFC to SSC is measured by the phase probe",
        "the results show that the actual phase width is larger than the acceptance of SSC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi041.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI041",
      "page_number": "378",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI044",
      "title": "VHF Gun Research at SINAP",
      "authors": [
        "Q. Gu",
        "L. Chen",
        "W. Fang",
        "G.Q. Lin",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "The R&D work on the high power THz based on energy recovery linac (ERL) has been carried out in Shanghai Institute of Applied Physics (SINAP). One of the key components for the ERL is the high brightness electron source. The low frequency gun technology has been adopted",
        "by comparing with the SRF gun and DC gun. In this paper",
        "the design and cold test of a 250MHz gun will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi044.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI044",
      "page_number": "380",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI045",
      "title": "Studying of Multipacting in Micro-pulse Electron Gun",
      "authors": [
        "L. Liao",
        "W. Fang",
        "Q. Gu",
        "M. Zhang",
        "M.H. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "Depending on the complexity of multipacting phenomenon",
        "more works are focused on the occurrence of multipacting in the micro-pulse electron gun. In this paper",
        "the multipacting resonance condition is determined in a reentrant cavity model of the gun. The resonance parameters work as the input for VORPAL simulations in order to achieve a steady state saturation in the cavity. The simulation results showed that the gun can give rise to electrons beam with high currents and short pulses."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI045",
      "page_number": "383",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI046",
      "title": "Transverse RF Kicker Excitation and Longitudinal RF Noise Diffusion for Slow Extraction from SAPT",
      "authors": [
        "L. Ouyang",
        "M. Gu",
        "D.M. Li",
        "Q. Yuan",
        "M.Z. Zhang",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "Two key techniques used in the slow extraction from synchrotron accelerator: longitudinal RF stochastic noise acceleration",
        "and transverse RF knock out excitation have been studied in this paper. Detailed comparison have revealed the potentials and limits of both methods. For the longitudinal RF stochastic acceleration excitation",
        "the focus has been the phase space compression of particles",
        "which makes the them to hasten around the RF bucket of the cavity",
        "thus to lower the senstivity to ripple. For the transverse RF knock out excitation",
        "the emphasis have been optimal schemes of amplitude modulation and frequency modulation of the RF singals. The optimizations are also used to lower the senstivity of the beam to the ripple and to enhance the uniformity of the extracted beam."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI046",
      "page_number": "386",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI047",
      "title": "Analysis and Design of Matching Unit for a RF Driven Plasma Source for Fusion Purpose",
      "authors": [
        "Huazhong University of Science and Technology(HUST)",
        "Wuhan",
        "People's Republic of China",
        "D.Z. Chen",
        "M. Fan",
        "J. Huang",
        "D. Li",
        "X.F. Li",
        "K.F. Liu",
        "C.R. Wan",
        "C. Zhou",
        "HUST",
        "Wuhan",
        "People's Republic of China",
        "A RF driven plasma exciter for producing negative ions",
        "aiming for heating and current drive neutral beam injectors for fusion applications",
        "is in developing in Huazhong University of Science and Technology (HUST). In order to couple the maximum RF power to the source",
        "the matching unit is designed to match the impedance of the source to that of the RF coaxial line. Firstly",
        "a FEM model was built to estimate the equivalent circuit parameters of the source. Numerical predictions were compared with a small experimental setup to verify the accuracy of the fem model. Based on the numerical results",
        "the RF coil and the matching components were carefully designed. Finally",
        "the matching circuit for the source is developed and tested. Experimental results will be presented in the full paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi047.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI047",
      "page_number": "389",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI050",
      "title": "Non-local Fast Extraction from the CERN SPS at 100 and 440 GeV",
      "authors": [
        "F.M. Velotti",
        "A. Alekou",
        "W. Bartmann",
        "E. Carlier",
        "K. Cornelis",
        "I. Efthymiopoulos",
        "B. Goddard",
        "L.K. Jensen",
        "V. Kain",
        "M. Kowalska",
        "V. Mertens",
        "R. Steerenberg",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Long Straight Section 2 (LSS2) of the CERN SPS is connected with the North Area (NA)",
        "to which the beam to date has always been extracted using a resonant extraction technique. For new proposed short- and long-baseline neutrino experiments",
        "a fast single turn extraction to this experimental area is required. As there are no kickers in LSS2",
        "and the integration of any new kickers with the existing electrostatic septum would be problematic",
        "a solution has been developed to fast extract the beam using non-local extraction with other SPS kickers. Two different kicker systems have been used",
        "the injection kicker in LSS1 and the stronger extraction kicker in LSS6 to extract 100 and 440 GeV beam",
        "respectively. For both solutions a large emittance beam was extracted after 5 or 9 full betatron periods. The concept and simulation details are presented with the analysis of the aperture and beam loss considerations and experimental results collected during a series of beam tests."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi050.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI050",
      "page_number": "392",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI051",
      "title": "Beam Transfer Systems for the LAGUNA-LBNO Long Baseline Neutrino Beam from the CERN SPS",
      "authors": [
        "B. Goddard",
        "W. Bartmann",
        "I. Efthymiopoulos",
        "Y. Papaphilippou",
        "A.S. Parfenova",
        "CERN",
        "Geneva",
        "Switzerland",
        "For the Long Baseline neutrino facility under study at CERN (LAGUNA-LBNO) it is initially planned to extract a 400 GeV beam from the second long straight section in the SPS into the existing transfer channel TT20 leading to the North Area experimental zone",
        "to a new target aligned with a far detector in Finland. In a second phase a new High-Power Proton Synchrotron (HPPS) accelerator is proposed",
        "to give a 2 MW beam at about 50 GeV on the same target. In this paper the beam transfer systems required for the project are outlined",
        "including the new sections of transfer line between the SPL",
        "HPPS and SPS",
        "and from the SPS to the target",
        "and also the injection and extraction systems in the long straight section of the HPPS. The feasibility of a 4 GeV H− injection system is discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi051.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI051",
      "page_number": "395",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI052",
      "title": "A New Lead Ion Injection System for the CERN SPS with 50 ns Rise Time",
      "authors": [
        "B. Goddard",
        "O. Aberle",
        "J. Borburgh",
        "E. Carlier",
        "K. Cornelis",
        "L. Ducimetière",
        "L.K. Jensen",
        "T. Kramer",
        "D. Manglunki",
        "A. Mereghetti",
        "V. Mertens",
        "D. Nisbet",
        "B. Salvant",
        "L. Sermeus",
        "CERN",
        "Geneva",
        "Switzerland",
        "The LHC High Luminosity upgrade project includes a performance upgrade for heavy ions. One of the present performance limitations is the rise time of the SPS injection kicker system",
        "which imposes a spacing of at least 220 ns between injected bunch trains at the operational rigidity. A reduction of this rise time to 50 ns for lead ions is requested as part of the suite of measures needed to increase the present design performance by a factor three. A new injection system based on a fast pulsed septum and a fast kicker has been proposed to fulfil this rise time requirement",
        "and to meet all the constraints associated with the existing high intensity proton injection in the same region. This paper describes the concept and the required equipment parameters",
        "and explores the implications of such a system for SPS operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi052.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI052",
      "page_number": "398",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI053",
      "title": "Upgrades of the SPS, Transfer Line and LHC Injection Protection Devices for the HL-LHC Era",
      "authors": [
        "Ö. Mete",
        "O. Aberle",
        "F. Cerutti",
        "K. Cornelis",
        "B. Goddard",
        "V. Kain",
        "R. Losito",
        "F.L. Maciariello",
        "M. Meddahi",
        "A. Mereghetti",
        "J.A. Uythoven",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "Fermilab",
        "Batavia",
        "USA",
        "The challenging High Luminosity LHC (HL-LHC) beam requirements will lead in the future to unprecedented beam parameters along the LHC injector chain. In the SPS accelerator these requests translate into about a factor two higher intensity and brightness than the present design performance. In addition to the challenge of producing and accelerating such beams",
        "these parameters affect the resistance of the existing equipment against beam impact. Most of the protection devices in the SPS ring",
        "its transfer lines and the LHC injection areas will be put under operational constraints which are beyond their design specification. The equipment concerned has been reviewed and their resistance to the HL-LHC beams checked. Theoretical and simulation studies have been performed for the SPS beam scraping system",
        "the protection devices and the dump absorbers of the SPS-to-LHC transfer lines",
        "as well as for the LHC injection protection devices. The first results of these studies are reported",
        "together with the future prospects."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi053.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI053",
      "page_number": "401",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI054",
      "title": "Upgrades for the CERN PSB-TO-PS Transfer at 2 GeV",
      "authors": [
        "W. Bartmann",
        "J. Borburgh",
        "J.R.T. Cole",
        "S.S. Gilardoni",
        "B. Goddard",
        "O. Hans",
        "M. Hourican",
        "L. Sermeus",
        "R. Steerenberg",
        "CERN",
        "Geneva",
        "Switzerland",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The CERN PS Booster extraction energy will be upgraded from 1.4 to 2.0 GeV to alleviate the direct space charge tune shift in the PS. The focussing structure of the transfer line will be modified in order to better match the optics between the PSB and the PS. The optics of the PS at injection and",
        "with it",
        "of the transfer line can be adapted to reduce the continuous losses from the already injected and circulating beam bumped towards the septum. Experimental results of the optics optimisation and probing the injection kicker gap will be shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi054.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI054",
      "page_number": "404",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI055",
      "title": "Design Study of a 100 GeV Beam Transfer Line from the SPS for a Short Baseline Neutrino Facility",
      "authors": [
        "W. Bartmann",
        "B. Goddard",
        "A. Kosmicki",
        "M. Kowalska",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "A Short Baseline neutrino facility at CERN is presently under study. It is considered to extract a 100 GeV beam from the second long straight section of the SPS into the existing transfer channel TT20",
        "which leads to the North Area experimental zone. A new transfer line would branch off the existing TT20 line around 600 m downstream of the extraction",
        "followed by an S-shaped horizontal bending arc to direct the beam with the correct angle onto the defined target location. This paper describes the optimisation of the line geometry with respect to the switch regions in TT20",
        "the integration into the existing facilities and the potential refurbishment of existing magnets. The optics design is shown",
        "and the requirements for the magnets",
        "power converters and instrumentation hardware are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi055.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI055",
      "page_number": "407",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI057",
      "title": "Studies for the LHeC Beam Transfer Systems",
      "authors": [
        "C. Bracco",
        "B. Goddard",
        "CERN",
        "Geneva",
        "Switzerland",
        "The LHeC would allow for collisions between an electron beam from a new accelerator with the existing LHC hadron beam. Two possible configurations were studied: a separate LINAC (LINAC-ring) or a new electron ring superimposed on the LHC (ring-ring). The racetrack LINAC is now considered as the baseline for the LHeC design",
        "with the ring-ring solution a back up. The studies performed for all the considered options are presented in this paper. For the LINAC-ring option the requirements for the post-collision line and the beam dump design have been evaluated in the cases of a 140 GeV and a 60 GeV electron beam. In the ring-ring option studies have been performed of the optics design of the transfer line from the a 10 GeV injector LINAC into the LHeC ring and of the injection system. The internal 60 GeV electron ring dump design has also been considered."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi057.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI057",
      "page_number": "410",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI058",
      "title": "Studies of Cs3Sb Cathodes for the CLIC Drive Beam Photoinjector Option",
      "authors": [
        "I. Martini",
        "E. Chevallay",
        "S. Döbert",
        "V. Fedosseev",
        "C. Heßler",
        "M. Martyanov",
        "CERN",
        "Geneva",
        "Switzerland",
        "Within the CLIC (Compact Linear Collider) project",
        "feasibility studies of a photoinjector option for the drive beam as an alternative to its baseline design using a thermionic electron gun are on-going. This R&D program covers both the laser and the photocathode side. Whereas the available laser pulse energy in ultra-violet (UV) is currently limited by the optical defects in the 4th harmonics frequency conversion crystal induced by the 0.14 ms long pulse trains",
        "recent measurements of Cs3Sb photocathodes sensitive to green light showed their potential to overcome this limitation. Moreover",
        "using visible laser beams leads to better stability of produced electron bunches and one can take advantages of the availability of higher quality optics. The studied Cs3Sb photocathodes have been produced in the CERN photoemission laboratory using the co-deposition technique and tested in a DC gun set-up. The analysis of data acquired during the cathode production process will be presented in this paper",
        "as well as the results of life-time measurements in the DC gun."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi058.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI058",
      "page_number": "413",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI059",
      "title": "Design and Performance of the Beam Transfer Lines for the HIE-ISOLDE Project",
      "authors": [
        "A.S. Parfenova",
        "W. Andreazza",
        "J. Bauche",
        "E.D. Cantero",
        "P. Farantatos",
        "M.A. Fraser",
        "B. Goddard",
        "Y. Kadi",
        "A.J. Kolehmainen",
        "D. Lanaia",
        "M. Martino",
        "R. Mompo",
        "E. Siesling",
        "A.G. Sosa",
        "M.A. Timmins",
        "G. Vandoni",
        "D. Voulot",
        "E.S. Zografos",
        "CERN",
        "Geneva",
        "Switzerland",
        "Beam design and beam optics studies for the HIE-ISOLDE transfer lines have been carried out in MadX",
        "and benchmarked against Trace3D results. Magnet field errors and alignment imperfections leading to deviations from design parameters have been treated explicitly",
        "and the sensitivity of the machine's lattice to different individual error sources was studied. As a result",
        "the tolerances for the various error-contributions have been specified for the different equipment systems. The design choices for the expected magnet field and power supply quality",
        "alignment tolerances",
        "instrument resolution and physical aperture were validated. The methodology and results of the studies are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi059.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI059",
      "page_number": "416",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI060",
      "title": "Beam Transfer to LHC with the Low Gamma-transition SPS Optics",
      "authors": [
        "G. Vanbavinckhove",
        "W. Bartmann",
        "H. Bartosik",
        "C. Bracco",
        "L.N. Drøsdal",
        "B. Goddard",
        "V. Kain",
        "M. Meddahi",
        "V. Mertens",
        "Y. Papaphilippou",
        "J.A. Uythoven",
        "J. Wenninger",
        "CERN",
        "Geneva",
        "Switzerland",
        "Fermilab",
        "Batavia",
        "USA",
        "A new low gamma-transition optics with a lower integer tune",
        "was introduced in the SPS to improve beam stability at high intensity. For transferring the beam to the LHC",
        "the extraction bumps",
        "extraction kickers and transfer lines needed to be adapted to the new optics. In particular",
        "the transfer lines were re-matched and re-commissioned with the new optics. The first operational results are discussed for the SPS extraction",
        "the transfer lines and the LHC injection. A detailed comparison is presented between the old and the new optics of the trajectories",
        "dispersion",
        "losses and other performance aspects."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi060.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI060",
      "page_number": "419",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI061",
      "title": "Concept for Elena Extraction and Beam Transfer Elements",
      "authors": [
        "J. Borburgh",
        "B. Balhan",
        "W. Bartmann",
        "T. Fowler",
        "L. Sermeus",
        "G. Vanbavinckhove",
        "CERN",
        "Geneva",
        "Switzerland",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "University of Tokyo",
        "Tokyo",
        "Japan",
        "Transilvania University of Brasov",
        "Brasov",
        "Romania",
        "In 2011 the ELENA decelerator was approved as a CERN project. Initially one extraction was foreseen",
        "which should use a kicker and a magnetic septum which can be recuperated from an earlier installation. Since then a second extraction has been approved and a new solution was studied using only electric fields to extract the beam. This will be achieved by fast pulsing a separator",
        "allowing single-bunch but also a full single-turn extraction from ELENA towards the experiments. The extraction and transfer requirements of ELENA are described",
        "followed by the principal differences between the magnetic and electric field concepts. The design of electrostatic focussing and bending devices for the transfer lines will be presented. Finally the field quality which can be achieved with the separator and the concept of its power supply will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi061.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI061",
      "page_number": "422",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI062",
      "title": "Optimization Studies for the SwissFEL RF-Gun",
      "authors": [
        "M. Schaer",
        "A. Adelmann",
        "A. Anghel",
        "S. Bettoni",
        "P. Craievich",
        "L. Stingelin",
        "C. Vicario",
        "R. Zennaro",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "The 250 MeV SwissFEL injector test facility is in operation since August 2010. Measurements with the \"CTF2 Gun 5\" photocathode S-band rf-gun show promising beam parameters and satisfy the requirements of the SwissFEL project. Since the performance of the electron source is fundamental for the stability and brightness of a free electron laser",
        "further gun optimization studies are pursued. Under investigation is currently a 3.6 cell C-band gun. First ASTRA simulations indicate that with this gun the peak-current can be increased",
        "thanks to a shorter laser pulse and a higher initial acceleration",
        "by almost a factor of two",
        "at slightly better emittance values than the S-band \"PSI Gun 1\". Since the beam-quality depends also on the achieved performance of the cathode",
        "several copper cathodes had been tested in the SwissFEL injector test facility to analyze the observed rapid degradation of quantum efficiency."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi062.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI062",
      "page_number": "425",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI063",
      "title": "Progress on Designs for 180 MeV Injection into the ISIS Synchrotron",
      "authors": [
        "B. Jones",
        "D.J. Adams",
        "B.S. Drumm",
        "M.C. Hughes",
        "A.J. McFarland",
        "C.M. Warsop",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The ISIS Facility at the Rutherford Appleton Laboratory in the UK produces intense neutron and muon beams for condensed matter research. It operates at 50Hz accelerating beam via a 70 MeV H− linac and an 800 MeV proton synchrotron",
        "delivering a mean beam power of 0.2 MW. As an initial step towards megawatt operations at ISIS",
        "a study of replacement of the existing injector with a new 180 MeV H− linac has recently been completed. This could enable an increase in beam power to approximately 0.5 MW. The ISIS Facility at the Rutherford Appleton Laboratory in the UK produces intense neutron and muon beams for condensed matter research. It accelerates 3×1013 protons per pulse (ppp) at 50 Hz through a 70 MeV H− linac and an 800 MeV proton synchrotron",
        "delivering a mean beam power of ~0.2 MW. A favoured first step to upgrade ISIS towards the megawatt regime is replacement of the linac with a new 180 MeV injector described in [1]. Studies of this upgrade",
        "which aims to increase mean beam power up to 0.5 MW are outlined in [2]. This paper reports on recent development of the designs including the injection septum",
        "dipole power supplies and detailed tracking of partially stripped foil products."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi063.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI063",
      "page_number": "428",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI065",
      "title": "VELA (formerly EBTF) Simulations and First Beam Commissioning",
      "authors": [
        "J.W. McKenzie",
        "D. Angal-Kalinin",
        "J.K. Jones",
        "B.L. Militsyn",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "VELA (Versatile Electron Linear Accelerator)",
        "formerly known as EBTF (Electron Beam Test Facility)",
        "at STFC Daresbury Laboratory",
        "is a photoinjector test facility which will provide beam into two user areas for scientific and industrial applications. It is based on a 2.5 cell S-band RF photoinjector driven by a Ti:Sapphire laser. The design is aimed to deliver short bunches at 10-250 pC charge with low transverse emittance. We present beam dynamics simulations of VELA as well as the results from first beam commissioning."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi065.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI065",
      "page_number": "431",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI066",
      "title": "An Ultra-Low Energy Electron Beam Ion Trap in Shanghai",
      "authors": [
        "J. Xiao",
        "R. Hutton",
        "X. Jin",
        "D. Lu",
        "B. Tu",
        "Y. Yang",
        "R. Zhao",
        "Y. Zou",
        "Fudan University",
        "Shanghai",
        "People's Republic of China",
        "Electron beam ion traps (EBITs) are very useful tools for disentanglement studies of atomic processes in plasmas. In this paper",
        "a new ultra-low energy EBIT",
        "SH-HtscEBIT",
        "is reported. This EBIT can operate in the electron energy range of 30–4000 eV",
        "with a current density of up to 100 A/cm2. The low energy limit of this machine is 30 eV",
        "which is the lowest energy among the EBITs around the world. The maximum magnetic field in the central drift tube region of this EBIT is around 0.25 T",
        "produced by a pair of high temperature superconductor coils. This EBIT is set up for the purpose of disentangling spectroscopic studies of edge plasmas relevant to magnetic fusion devices",
        "and of astro-plasmas. All the elements for the spectroscopic studies can be injected through an injection system. Both the design and the performance of this EBIT are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi066.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI066",
      "page_number": "434",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI068",
      "title": "High Repetition Rate Highly Stable S-band Photocathode Gun for the CLARA Project",
      "authors": [
        "B.L. Militsyn",
        "L.S. Cowie",
        "P. Goudket",
        "S.P. Jamison",
        "J.W. McKenzie",
        "K.J. Middleman",
        "R. Valizadeh",
        "A.E. Wheelhouse",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "RAS/INR",
        "Moscow",
        "Russia",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Compact Linear Accelerator for Research and Applications (CLARA) is a 250 MeV electron facility which is under development at STFC ASTeC. The CLARA photo-injector is based on a RF photocathode gun operating with metal photocathodes and driven by a third harmonic of Ti: Sapphire laser (266 nm). The injector will be operated with laser pulses with an energy of up to 2 mJ",
        "pulse durations down to 180 fs FWHM and a repetition rate of up to 400 Hz. In order to investigate performance of different photocathodes the gun is equipped with a load-lock system which would allow replacement of the photocathodes. Duration and emittance of electron bunches essentially depends on the mode of operation and vary from 0.1 ps at 20 pC to 5 ps at 200 pC and from 0.2 to 2 mm mrad respectively. Requirements for the stability of beam arrival time at the CLARA experimental area are extremely high and vary from hundreds down to tenths femtoseconds. In the presented article we analyse stability of the guns with 1.5 and 2.5 cell and the beam quality delivered by a gun with coaxial and waveguide coupler and analyse possibility of injection time stabilisation with low level RF and optical feedback system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi068.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI068",
      "page_number": "437",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI069",
      "title": "Preparation of the Polycrystalline Copper Photocathodes for the VELA RF Photocathode Gun",
      "authors": [
        "R. Valizadeh",
        "A.N. Hannah",
        "K.J. Middleman",
        "B.L. Militsyn",
        "T.C.Q. Noakes",
        "R.N.C. Santer",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The Electron Beam Test Facility (EBTF) is a high performance electron source under commissioning at ASTeC. The photoinjector of the source is based on a S-band photocathode RF gun operating with a copper photocathode which is driven by a third harmonic of Ti: Sapphire laser (266 nm). The photocathode used in the RF gun is an integrated part of the gun cavity which is polycrystalline copper disk",
        "polished to 1um roughness",
        "and is placed at the back wall of the first 0.5 cell in the gun cavity. In order to accomplish a procedure to activate surface prior installation",
        "copper test samples with roughness of 0.1 um were prepared by different techniques. The best results have been obtained by ex-situ plasma cleaning in an oxygen atmosphere. Analyses showed that there was no carbon on the surface and the surface was composed of copper oxide. After heating the sample in-situ to 220 C for almost all the surface oxide was removed. For this surface a QE of 2 x10-5 was measured. Further heating to higher temperature did not result in any improvement either in surface composition nor a noticeable increase in QE. Prepared such a way operational photocathode is now under commissioning in the gun."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi069.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI069",
      "page_number": "440",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI070",
      "title": "Spallation is not the only Fruit: Low Energy Fusion as a Source of Neutrons",
      "authors": [
        "S.C.P. Albright",
        "R. Seviour",
        "University of Huddersfield",
        "Huddersfield",
        "United Kingdom",
        "Commercially there is a growing interest in applications of neutrons. Currently the majority of neutron sources are based at research institutions from either reactors or spallation sources. Smaller portable sources contain either fissile isotope or sealed fusors are available",
        "although they either use or produce tritium",
        "or other long lived decay products. As an alternative to the large facilities and the radio-toxicology of current portable sources research is being performed with an aim to produce a fusion based neutron source with neither of these concerns. We show that MCNPX is able to accurately reproduce (p",
        "n) reactions for a number of light elements. Simulations of low energy proton reactions with light nuclei simulated with MCNPX and Geant4 are compared with experiment."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi070.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI070",
      "page_number": "443",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI071",
      "title": "High Power Cyclotrons for the Neutrino Experiments DAEδALUS and IsoDAR",
      "authors": [
        "R.J. Barlow",
        "A. Bungau",
        "A.M. Kolano",
        "University of Huddersfield",
        "Huddersfield",
        "United Kingdom",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "W.A. Barletta",
        "A. Calanna",
        "D. Campo",
        "J.M. Conrad",
        "MIT",
        "Cambridge",
        "Massachusetts",
        "USA",
        "INFN/LNS",
        "Catania",
        "Italy",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Columbia University",
        "New York",
        "USA",
        "DAEδALUS (Decay At rest Experiment for δcp At a Laboratory for Underground Science) has been proposed to measure the value of the CP violating phase delta through the oscillation of low energy muon anti-neutrinos to electron antineutrinos. With a single large detector",
        "three accelerators at different distances enable the oscillation to be measured with sufficient accuracy. We have proposed the superconducting multi-megawatt DAEδALUS Supercinducting Ring Cyclotron (DSRC) as the means of producing the 800 MeV 12 mA protons required",
        "through the acceleration of H2+",
        "ions with highly efficient stripping extraction. The DSRC comprises twin ion sources and injector cyclotrons",
        "followed by a booster. The injector cyclotron can also be used for a separate experiment",
        "IsoDAR (Isotope Decay At Rest) in which low energy protons produce Lithium 8",
        "and thus a very pure electron antineutrino source which can be used to measure",
        "or rule out",
        "short range oscillation to a sterile neutrino. We describe recent developments in the designs of the injector and the booster",
        "and the prospects for the two experiments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi071_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi071.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi071_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI071",
      "page_number": "446",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI073",
      "title": "Optimisation Studies of a High Intensity Electron Antineutrino Source",
      "authors": [
        "A. Bungau",
        "R.J. Barlow",
        "University of Huddersfield",
        "Huddersfield",
        "United Kingdom",
        "J.R. Alonso",
        "J.M. Conrad",
        "J. Spitz",
        "MIT",
        "Cambridge",
        "Massachusetts",
        "USA",
        "Columbia University",
        "New York",
        "USA",
        "ISODAR (Isotopes-Decay-At-Rest) is a novel",
        "high intensity source of electron antineutrinos produced by the decay of Li-8 isotopes",
        "which aims for searches for physics beyond the standard model. The Li-8 isotopes are produced in the inelastic interactions of low energy protons or deuterons with a Beryllium target. In addition the Li-8 is produced in the surrounding materials by secondary neutrons. This paper focuses on the optimisation of the base design target",
        "moderator and reflector."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi073.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI073",
      "page_number": "449",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI074",
      "title": "Ultracold and High Brightness Electron Source for Next Generation Particle Accelerators",
      "authors": [
        "G.X. Xia",
        "R. Appleby",
        "W. Bertsche",
        "M.A. Harvey",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The University of Manchester",
        "The Photon Science Institute",
        "Manchester",
        "United Kingdom",
        "The ultra-cold plasma-based electron source has recently been proposed as an alternative to the conventional photoemitters or thermionic electron guns",
        "which are widely used in today’s particle accelerators. The advantages of the ultra-cold plasma-based electron source lie in the fact that the electron beam extracted from the cold plasma (from ionization of cold atoms) has very low electron temperature",
        "e.g. down to 10 K",
        "and has the potential for producing high brightness and ultra-short electron bunches. All these features are crucial for the next generation particle accelerators",
        "e.g. free electron lasers",
        "plasma-based accelerators and the future linear colliders. In this paper",
        "we will introduce our proposed facility on cold electron source based at Photon Science Institute (PSI) in the University of Manchester."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi074.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI074",
      "page_number": "452",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI076",
      "title": "Electron Emission Studies in the New High-charge Cs2Te Photoinjector at Argonne National Laboratory",
      "authors": [
        "E.E. Wisniewski",
        "M.E. Conde",
        "W. Gai",
        "C.-J. Jing",
        "W. Liu",
        "J.G. Power",
        "ANL",
        "Argonne",
        "USA",
        "L.K. Spentzouris",
        "Z.M. Yusof",
        "Illinois Institute of Technology",
        "Chicago",
        "Illinois",
        "USA",
        "A new L-band 1.3 GHz 1.5 cell gun for the new 75 MeV drive beam is being commissioned and will soon be operating at the Argonne Wakefield Accelerator (AWA) facility as part of the facility upgrade (see M. E. Conde",
        "this proceedings.) The photoinjector is high-field (peak accelerating field > 80MV/m) and has a large \\mathrm{Cs}2\\mathrm{Te} photocathode (diameter > 30 mm) fabricated in-house. The photoinjector generates high-charge",
        "short pulse",
        "single bunches (Q > 100 nC) or bunch-trains (Q ≈ 1000 nC) for wakefield experiments. Field emission from the \\mathrm{Cs}2\\mathrm{Te} cathode is to be measured during RF conditioning and benchmarked against measurements from a copper cathode. Quantum efficiency (QE) will be measured in single and multi-bunch modes. Preliminary results are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi076.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI076",
      "page_number": "455",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI078",
      "title": "The Possibility of Generation of High Energy Electron Beam at the SNS Facility",
      "authors": [
        "T.V. Gorlov",
        "A.V. Aleksandrov",
        "V.V. Danilov",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "The linac of the SNS accelerator facility can be used to produce an electron beam with 300-400 MeV energy. At present there are a few predesigned experiments with electron beam that can be alternatively carried out at the SNS. However",
        "the SNS linac is designed and optimized for acceleration of H−",
        "which brings some problems when considering direct acceleration of electrons. Alternative machine setup for electron acceleration and transport are discussed. Here",
        "we present a study of the optimal electron beam parameters that can be achieved without any significant changes of the SNS accelerator."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi078.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI078",
      "page_number": "458",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI080",
      "title": "Fabrication, Transport and Characterization of Cesium Potassium Antimonide Cathode in Electron Guns",
      "authors": [
        "T. Rao",
        "S.A. Belomestnykh",
        "I. Ben-Zvi",
        "X. Liang",
        "I. Pinayev",
        "B. Sheehy",
        "J. Skaritka",
        "J. Smedley",
        "E. Wang",
        "T. Xin",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "R.R. Mammei",
        "J.L. McCarter",
        "M. Poelker",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "a number of accelerator applications need high current",
        "low emittance and high brightness electron beams. Recent studies have shown cesium potassium antimonide to be a robust photocathode capable of producing high peak and average currents. However",
        "for some applications",
        "the UHV conditions required for producing these cathodes necessitate their fabrication site to be physically removed from the gun location and the cathode to be transferred between the two sites in UHV load-lock chambers. We have fabricated two cathodes at BNL",
        "transported and tested them in DC gun at JLab at 100 kV and 200 kV. These cathodes have delivered up to 8A/cm2 without significant degradation. Localized changes in the QE have been attributed to heating due to laser",
        "increasing the QE at lower laser power",
        "but damaging the cathode at higher power. Two more load-lock chambers have been built to transport and insert similar cathodes in SRF guns operating at 700 MHz and 112 MHz for the first time. In this paper",
        "we will describe the design of the load-lock chambers",
        "transfer mechanisms",
        "transport of the cathodes over ~ 1000 km and the cathode performance in gun environment."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi080.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI080",
      "page_number": "461",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI081",
      "title": "Correlating Structure and Function - In situ X-ray Analysis of High QE Alkali-antimonide Photocathodes",
      "authors": [
        "J. Smedley",
        "K. Attenkofer",
        "S.G. Schubert",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "I. Ben-Zvi",
        "X. Liang",
        "E.M. Muller",
        "M. Ruiz-Osés",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "T. Forrest",
        "H.A. Padmore",
        "T. Vecchione",
        "J.J. Wong",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "ANL",
        "Argonne",
        "USA",
        "Alkali antimonide photocathodes have high quantum efficiency and low emittance when illuminated by visible light",
        "and are thought to be well suited for use in high-brightness photoinjectors of 4th generation light sources. Here we report on the growth of multi-alkali K2CsSb cathodes on [100] silicon substrates measured using in-situ X-ray diffraction (XRD) and X-ray reflection (XRR). Correlations between cathode structure and growth parameters and the resulting quantum efficiency (QE) are also explored. The best cathodes have a QE at 532 nm in excess of 6% and are structurally textured K2CsSb with grain sizes in excess of 20 nm. In an attempt to reduce the complexity of the current growth methodology we are also making alkali antimonides in parallel via the reaction of bulk materials in an inert environment. This approach has the advantage that the desired stoichiometry can be obtained exactly. Initial diffraction results from prepared bulk materials are promising and show the formation of well reacted K3Sb. In the future we intend to transfer this material to smooth thin photocathode films by either sputtering or pulsed laser deposition."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi081_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi081.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi081_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI081",
      "page_number": "464",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFI082",
      "title": "Redesign and Development of the Shanghai Electron Beam Ion Trap",
      "authors": [
        "D. Lu",
        "Y. Shen",
        "Z. Shi",
        "J. Xiao",
        "Y. Yang",
        "Y. Zou",
        "Fudan University",
        "Shanghai",
        "People's Republic of China",
        "Over the last few years the Shanghai Electron Beam Ion Trap (EBIT) has been successfully redesigned and rebuilt. The original machine",
        "developed under collaboration with the Shanghai Institute of Nuclear and Applied Physics",
        "first generated an electron beam in 2005. Shanghai EBIT could be operated with electron beam energies between 1 and 130 keV and currents up to 160 mAmps. After several years of operation",
        "it was found that some improvements/modifications to the old design were necessary. This contribution will discuss several of the main aspects of the redesigned Shanghai EBIT. So far it has been operated up to an electron energy of 40 keV with an current density of over 2400 A per square cm. The new EBIT is made primarily from Titanium instead of Stainless Steel and has an order of magnitude better background vacuum",
        "a more efficient and economical cryogenic system",
        "and also excellent optical alignment. Finally the magnetic field in the central drift tube region can reach up till 4.8 T."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mopfi082_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mopfi082.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mopfi082_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOPFI082",
      "page_number": "467",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 64,
  "scrape_time": "2025-10-10 21:05:15"
}