{
  "session_info": {
    "id": "TUIANO",
    "name": "TUIANO - Technology II",
    "url": "https://proceedings.jacow.org/FEL2013/html/tuiano.htm"
  },
  "papers": [
    {
      "paper_id": "TUIANO01",
      "title": "Seed Laser Configurations for Advanced Pump-probe Schemes With FELs",
      "authors": [
        "M.B. Danailov",
        "P. Cinquegrana",
        "A.A. Demidovich",
        "R. Ivanov",
        "G. Kurdi",
        "I. Nikolov",
        "P. Sigalotti",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "This work presents novel techniques developed and under development at the FERMI FEL for implementing new modalities of FEL operation allowing pump-probe experiments with practically no jitter between the pump and probe pulses. One of the proposed techniques takes advantage of the fact that in seeded FELs the exact time at which FEL pulses are generated is locked to the one of the seed laser",
        "and uses a part of the seed laser light for pump-probe experiments. We are presenting the design of a scheme implementing this idea at the FERMI FEL. We address the design of the optical beam transport as well as of the high performance feedbacks driven by optically derived error signals needed to cancel the temporal and pointing drifts. Another new technique",
        "described for the first time to our knowledge",
        "is the use of a double-pulse seed laser which seeds the same electron bunch and allows to generate two FEL pulses with tunable time delay and wavelengths. First experimental results are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tuiano01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tuiano01.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tuiano01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUIANO01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:30:53"
}