{
  "session_info": {
    "id": "TUODB1",
    "name": "TUODB1 - Contributed Oral Presentations (Beam Dynamics and Electromagnetic Fields)",
    "url": "https://proceedings.jacow.org/IPAC2013/html/tuodb1.htm"
  },
  "papers": [
    {
      "paper_id": "TUODB101",
      "title": "Studies on An S-band Bunching System with Hybrid Buncher",
      "authors": [
        "S. Pei",
        "O. Xiao",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Generally",
        "a standard bunching system is composed by a SW pre-buncher",
        "a TW buncher and a standard accelerating section. However",
        "there is one way to simplify the whole system to some extent by using the hybrid buncher",
        "which is a combined structure of the SW pre-buncher and the TW buncher. Here the beam dynamics studies on an S-band bunching system with hybrid buncher is presented",
        "simulation results shows that similar beam performance can be obtained at the linac exit by using this kind of bunching system rather than the standard one. In the meantime",
        "the structure design of the hybrid buncher is also described. Furthermore",
        "the standard accelerating section can also be integrated with the hybrid buncher",
        "this can further simplify the bunching system and lower the construction cost."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tuodb101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tuodb101.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tuodb101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUODB101",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUODB102",
      "title": "Intrabeam Scattering Studies for Low Emittance of BAPS",
      "authors": [
        "S.K. Tian",
        "Y. Jiao",
        "J.Q. Wang",
        "G. Xu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "In modern storage ring light sources",
        "intra-beam scattering (IBS) is often thought of as a fundamental limitation to achieving ultra-low emittance and hence higher brightness. Beijing Advanced Photon Source (BAPS) is under design at Institute of High Energy Physics (IHEP) which aims to emittance less than 1nm at 5GeV. To improve the coherence and high brightness",
        "low emittance- in both transverse planes at the diffraction limit for the range of x-ray wavelengths(≈10 pm)- is being pursued. Thus",
        "due to the very low emittance",
        "intra-beam scattering effect is an issue. Accurate estimation to check if the design goal can be reached is necessary. In this paper",
        "we use the 6-D accelerator simulation code-elegant and Accelerator Toolbox (AT)-a collection of tools to model storage rings in the MATLAB environment. Based on a temporary design lattice of BAPS",
        "we present the results of particle simulation study of intra-beam scattering effect versus the beam energy",
        "the emittance coupling factor",
        "the bunch length",
        "the bunch current and so on. We also studied the mitigating method by adopting damping wigglers in one or more dispersion-free regions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tuodb102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tuodb102.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tuodb102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUODB102",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUODB103",
      "title": "Recent Results from CesrTA Intrabeam Scattering Investigations",
      "authors": [
        "M. P. Ehrlichman",
        "A. Chatterjee",
        "W. Hartung",
        "D.P. Peterson",
        "N.T. Rider",
        "D. L. Rubin",
        "D. Sagan",
        "J.P. Shanks",
        "S. Wang",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "Manifestation of intrabeam scattering (IBS) in an electron/positron storage ring depends on the radiation damping time in two ways. First",
        "the beam size is the equilibrium of the IBS growth rate in each of the three degrees of freedom and corresponding damping rates. Second",
        "scattering events that occur less frequently than order once per damping time contribute to non-Gaussian tails that are invisible to our beam size monitors. The tail cut procedure excludes these relatively rare events in the calculation of equilibrium beam size. In machines with short damping times",
        "the tail cut significantly reduces the effective IBS growth rate. At CesrTA",
        "we measure the dependence of beam size on bunch charge in IBS-dominated beams. We vary the vertical emittance using a closed optics bump that increases the vertical dispersion and transverse coupling in the wiggler regions. Measurements are taken at both 2.1 and 2.3 GeV. Here we report the results of these experiments and compare those results to theory."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tuodb103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tuodb103.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tuodb103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUODB103",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 21:13:57"
}