{
  "session_info": {
    "id": "TUXMH",
    "name": "TUXMH - Modern trends in accelerators",
    "url": "https://proceedings.jacow.org/rupac2018/html/tuxmh.htm"
  },
  "papers": [
    {
      "paper_id": "TUXMH01",
      "title": "Status and Prospects of Charged Particle Accelerators Development in RFNC-VNIIEF",
      "authors": [
        "VNIIEF",
        "Sarov",
        "Russia",
        "Since the sixties of the 20th century a large experiment and test park of facilities and complexes has been developed in RFNC-VNIIEF",
        "making it possible to investigate radiation resistance of electronics",
        "to perform X-ray investigation of fast processes",
        "to carry out nuclear-physics researches. Being a federal structure the RFNC-VNIIEF experiment and test park meets the requirements of the following organizations: State Corporation \"RosAtom\"",
        "Department of Defense",
        "Department of Industry and Commerce and State Corporation \"RosKosmos\". Into the experiment and test park there are incorporated pulsed high-current accelerators of electrons (LIU-30 (40 MeV",
        "100 kA",
        "25 ns)",
        "LIU-10M (25 MeV",
        "50 kA",
        "15 ns) etc.)",
        "pulsed nuclear reactors (PNR)",
        "linear resonance accelerators of electrons (LU-50 (55 MeV",
        "10 kW)",
        "LU-10-20 (5-9 MeV",
        "10 kW) etc.)",
        "electrostatic tandem accelerator EhGP-10",
        "plasma pulse generators of neutron radiation. On the base of LIU and PNR there have been created irradiating complexes. Over a period of the last few years there has been produced on the base of linear induction accelerator LIU-R-T (12 MeV",
        "20 kA",
        "60 ns) an X-ray accelerator which dose parameters are ten times higher than those of the existing home analogues",
        "thus it approaches the best foreign facilities of similar class. To simulate ionization effect of superhard X-radiation on electronics there is being created a full-scale multiterawatt electrophysical facility \"Gamma\" (2 MeV",
        "12 MA",
        "65 ns). By now there has been produced the first phase of the \"Gamma\" facility - this is a four-module facility \"Gamma-4\"",
        "consisting of four pulsed high-current electron accelerators (2 MeV",
        "750 kA",
        "65 ns). The creation of resonance accelerator with high average beam power BETA-8 (1-7.5 MeV",
        "300 kW) is being completed now."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tuxmh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tuxmh01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tuxmh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUXMH01",
      "page_number": "17",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXMH02",
      "title": "The Main Problems and Its Solutions in Modern SR Sources",
      "authors": [
        "NRC",
        "Moscow",
        "Russia",
        "This report is an attempt to consider the main experimental requirements for modern sources of synchrotron radiation based on electron storage rings",
        "the accelerating problems arising from these requirements and their technologically available solutions for today."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tuxmh02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tuxmh02.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tuxmh02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUXMH02",
      "page_number": "22",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXMH03",
      "title": "Accelerator and Storage Ring Facility for Radioactive Ion Beam Physics - DERICA Project",
      "authors": [
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The concept and scientific agenda of accelerator and storage ring facility for the radioactive ion beam (RIB) research are proposed for the large-scale international project at the Joint Institute for Nuclear Research*. Motivation for the new facility is discussed and its parameters are presented",
        "showing to be unique in comparison with other most advanced world centers - so-called \"RIB factories\". The emphasis in the project is put on the studies with the short-lived RIBs in storage rings. A unique feature of the project is the possibility to study the electron-RI interactions in the collider mode for research into fundamental properties of the nuclear matter",
        "in particular",
        "electromagnetic form-factors of exotic nuclei."
      ],
      "institutions": [],
      "abstract": "*http://aculina.jinr.ru/derica.php",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tuxmh03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tuxmh03.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tuxmh03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUXMH03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-11 02:14:10"
}