{
  "session_info": {
    "id": "WEXC",
    "name": "WEXC - Wednesday Oral Parallel C",
    "url": "https://proceedings.jacow.org/ipac2021/html/wexc.htm"
  },
  "papers": [
    {
      "paper_id": "WEXC01",
      "title": "Generation of High-Brightness Self-Seeded X-Ray Free Electron Laser",
      "authors": [
        "PAL",
        "Pohang",
        "Republic of Korea",
        "At the PAL-XFEL",
        "we demonstrate substantially improved self-seeded XFEL performance",
        "which promises to add another popular XFEL operation mode with up to ~mJ pulse energy at 9.7 keV (peak spectral brightness",
        "3.2×1035 photons s-1 mm-2 mrad-2 (0.1%BW)-1) and wide tunability (3.5-14.6 keV). The machine is tuned to get stable seeding and its monochromatic amplification process and provide a stable amplitude (better than filtered SASE using DCM) and the time-bandwidth product is close to transform-limited. The suppression ofμbunching instability using a laser heater is much more effective in this narrow spectral bandwidth compared to SASE mode with a broad spectrum. The benefit of this seeded XFEL is demonstrated in serial femtosecond crystallography experiments.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexc01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexc01.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexc01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXC01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXC02",
      "title": "Enhanced Seeded Free Electron Laser Performance with a \"Cold\" Electron Beam",
      "authors": [
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "In a seeded free-electron laser operating in high gain harmonic generation (HGHG) as FERMI",
        "the harmonic conversion efficiency decreases at high harmonics and the quality of the pulses is increasingly affected by the electron beam phase space distortions. The lower the electron time-slice energy spread the higher harmonic of the seed is efficiently obtained. The optimization of the FERMI photoinjector and of some linac parameters has allowed a reduction of the relative slice energy spread to the level of few times of 105. With these new conditions",
        "the FEL can be operated without the need for a laser heater to suppress micro-bunching instabilities and this \"cold\" beam has allowed the generation of extreme UV pulses with pulse energy exceeding 1 mJ",
        "and with peak power of about 10 GW. We describe the electron beam characterization and the FEL performance improvement",
        "including the extension of the range of harmonics of the seed which can be amplified",
        "up to the twenty-fifth harmonic",
        "i.e.",
        "10 nm.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexc02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexc02.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexc02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXC02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXC03",
      "title": "Review of Superconducting Radio Frequency Gun",
      "authors": [
        "HZDR",
        "Dresden",
        "Germany",
        "The success of proposed high power free-electron lasers (FELs) and energy recovery linac (ERL) largely depends on the development of the electron source",
        "which requires the best beam quality and CW operation. An elegant way to realize this average brilliance is to combine the high beam quality of mature normal conducting radio frequency photoinjector with the quick developing superconducting radio frequency technology",
        "to build superconducting rf photoinjectors (SRF guns). In last decade",
        "several SRF gun programs based on different approaches have achieved promising progress",
        "even succeeded in routine operation at BNL and HZDR [*",
        "**]. In the near future SRF guns are expected to play an important role for hard X-ray FEL facilities. In this contribution",
        "we will review the design concepts",
        "parameters",
        "and the status of the major SRF gun projects.",
        "*I. Petrushina et al.",
        "Phys. Rev. Lett. 124",
        "244801  **J. Teichert at al.",
        "Phys. Rev. Accel. Beams 24",
        "033401"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexc03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexc03.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexc03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXC03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXC04",
      "title": "Simulations of Beam Strikes on Advanced Photon Source Upgrade Collimators using FLASH, MARS, and elegant",
      "authors": [
        "J.C. Dooling",
        "M. Borland",
        "A.M. Grannan",
        "C.J. Graziani",
        "R.R. Lindberg",
        "G. Navrotski",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "D.W. Lee",
        "Y. Lee",
        "UCSC",
        "Santa Cruz",
        "California",
        "USA",
        "Modeling of high-energy-density electron beams on collimators proposed for the Advanced Photon Source Upgrade (APS-U) storage ring (SR) is carried out with codes FLASH",
        "MARS",
        "and elegant. Code results are compared with experimental data from two separate beam dump studies conducted in the present APS SR. Whole beam dumps of the 6-GeV",
        "200 mA",
        "ultra-low emittance beam will deposit acute doses of 30 MGy within 10 to 20 microseconds",
        "leading to hydrodynamic behavior in the collimator material. Goals for coupling the codes include accurate modeling of the hydrodynamic behavior",
        "methods to mitigate damage",
        "and understanding the effects of the resulting shower downstream of the collimator. Relevant experiments",
        "though valuable",
        "are difficult and expensive to conduct. The coupled codes will provide a method to model differing geometries",
        "materials",
        "and loss scenarios. Efforts thus far have been directed toward using FLASH to reproduce observed damage seen in aluminum test pieces subjected to varying beam strike currents. Stabilizing the Eulerian mesh against large energy density gradients as well as establishing release criteria from solid to fluid forms are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexc04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexc04.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexc04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXC04",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXC05",
      "title": "First Results Operating a Long-Period EPU in Universal Mode at the Canadian Light Source",
      "authors": [
        "W.A. Wurtz",
        "C.K. Baribeau",
        "D. Bertwistle",
        "M.J. Sigrist",
        "CLS",
        "Saskatoon",
        "Saskatchewan",
        "Canada",
        "The Quantum Materials Spectroscopy Centre beamline at the Canadian Light Source (CLS) requires photons with energies as low as 15 eV with circular polarization at the end station. This energy range is accomplished on the 2.9 GeV CLS storage ring using an elliptically polarizing undulator (EPU) with a 180 mm period",
        "which we call EPU180. In order to realize circular polarized photons at the end station with this low energy",
        "we must overcome two technical issues. First",
        "the beamline optics distort the polarization of the light",
        "so we compensate by providing light with a flattened",
        "tilted polarization ellipse at the source point - a mode of operation known as universal mode. Second",
        "the device has a strong effect on the electron beam due to dynamic focusing and is capable of reducing the injection efficiency to zero. We overcome this non-linear dynamic focusing using current strips adhered to the vacuum chamber. In this report",
        "we present the first results with operating EPU180 in universal mode and we recover the dynamic aperture using the current strips."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexc05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexc05.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexc05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXC05",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXC06",
      "title": "Eddy Current Effects on the Stored Beam Generated by the Pulsed Sextupole Magnet at KEK-PF",
      "authors": [
        "H. Takaki",
        "K. Harada",
        "Y. Kobayashi",
        "C. Mitsuda",
        "T. Nogami",
        "T. Obina",
        "R. Takai",
        "T. Uchiyama",
        "KEK",
        "Ibaraki",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "The Photon Factory (KEK-PF) has been continuously developing new technologies for the top-up injection using the pulsed multipole magnets (PMM). We demonstrated beam injection with the PMM successfully at KEK-PF and operated for synchrotron user experiments with top-up injection in four years. One of the important issues to be solved in this injection is the effect of eddy currents on the stored beam generated in the PMM and its inner coating of the ceramic duct. The magnetic field of the PMM is designed so that it does not affect the stored beam",
        "however",
        "the eddy currents that occurred on the coating give an unwanted kick to the stored beam at the injection. In this paper",
        "we report eddy current effects on the stored beam generated by the pulsed sextupole magnet.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexc06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexc06.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexc06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXC06",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXC07",
      "title": "Nucleation of Single Crystal Photocathode on Atomically Thin Graphene Substrate Using Co-Deposition of Cesium Telluride",
      "authors": [
        "M. Gaowei",
        "J. Cen",
        "J. Sinsheimer",
        "J. Walsh",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "A.M. Alexander",
        "F. Liu",
        "V.N. Pavlenko",
        "J. Smedley",
        "H. Yamaguchi",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "HZB",
        "Berlin",
        "Germany",
        "For the past decades",
        "cesium telluride (CsTe) has been chosen as the electron source material for high bunch charge",
        "high repetition rate superconducting radio frequency electron injectors. The application of cesium telluride photocathode has been reported by accelerators all over the world. Alkali based semiconductor photocathode material has always been vapor deposited thin films",
        "with amorphous or very limited crystalline phases. The fragility of alkali-based photocathode partially comes from its disordered and unstable structure. The limited crystallinity also limits the quantum efficiency to improve. Therefore",
        "growing large crystal or even single crystal of the alkali-based photocathode material is the goal of many scientific projects these days. Nucleation of cesium telluride crystalline phase was observed via co-deposition method on atomically thin graphene substrate",
        "which is is a recognized sign of the first step of the formation of single crystal. In situ and operando X-ray characterization has been performed on this process and the results in the evolution of crystal structure",
        "chemical stoichiometry as well as the surface morphology and quantum efficiency are reported.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexc07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexc07.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexc07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXC07",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 7,
  "scrape_time": "2025-10-10 18:54:25"
}