{
  "session_info": {
    "id": "MOYMH",
    "name": "MOYMH - Modern trends in accelerators",
    "url": "https://proceedings.jacow.org/rupac2016/html/moymh.htm"
  },
  "papers": [
    {
      "paper_id": "MOYMH01",
      "title": "Experimental Approach to the Synthesis of Exotic Nuclei Using Heavy Ion Accelerators",
      "authors": [
        "JINR/FLNR",
        "Moscow region",
        "Russia",
        "Speaking of exotic nuclei",
        "we have in mind nuclei with ratios of proton to neutron numbers significantly differing from those of nuclei lying at the beta-stability valley",
        "nuclei existing only due to stabilizing effects of nuclear shells",
        "nuclei having unusual form or nucleon density distribution. The study of exotic nuclei provides excellent possibilities for testing models of nuclear forces and structure",
        "reaction mechanisms and astrophysical processes. For producing exotic nuclei",
        "different types of reactions induced by heavy ions are used: direct reactions - Coulomb excitation",
        "nucleon transfer and spallation reactions",
        "fragmentation of target and projectile nuclei",
        "heavy ion induced fission and complete fusion reactions. To induce reactions ions with energy from n*MeV up to n*GeV",
        "in the full accessible range of atomic numbers and masses are used. Secondary beams of exotic nuclei employed for producing of even more exotic species. For isolation of reaction products from primary beam on-line electromagnetic fragment separators",
        "electrostatic separators",
        "velocity selectors and gas-filled set-ups equipped with sophisticated detection systems find application. For producing secondary beams",
        "IGISOL technique is effective in several cases. Special attention is payed to synthesis of super heavy nuclei. Over the past decade",
        "numerous isotopes of super heavy elements with Z=112-118 have been produced in complete fusion reactions of accelerated 48Ca ions with actinide targets."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/moymh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/moymh01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/moymh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-MOYMH01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOYMH02",
      "title": "Physics Basis for the AWAKE Experiment",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "AWAKE",
        "an Advanced Wakefield Experiment at CERN aims at the first experimental demonstration of plasma wakefield acceleration driven by a high-energy proton beam. The proton beam must be sliced into the train of short micro-bunches in the plasma by a controllable beam-plasma instability. The self-modulated proton beam then excites the plasma wave",
        "by which a bunch of externally injected electrons is trapped and accelerated. The acceleration scenario relies on several key effects",
        "which thus far were observed in numerical simulations only. Their experimental proof will be an important step toward using proton beams for generation of high-energy",
        "accelerator-quality lepton beams."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/moymh02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/moymh02.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/moymh02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-MOYMH02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOYMH03",
      "title": "The MICE Muon Ionisation Cooling Experiment: Progress and First Results",
      "authors": [
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "The Muon Ionisation Cooling experiment (MICE) is designed to demonstrate the reduction of the phase-space volume occupied by a muon beam using the ionization-cooling technique",
        "for the first time. This demonstration will be an important step in establishing the feasibility of muon accelerators for particle physics. The emittance of the beam is reduced through ionization as it passes through a cooling cell (or absorber) and is measured before and after the cooling cell using two high-precision scintillating-fibre tracking detectors (Trackers). Each Tracker is immersed in a uniform magnetic field produced by solenoidal spectrometers. The Trackers combined with a suite of other detectors perform the particle identification measurements. MICE is is now taking data at the Rutherford Appleton Laboratory in the UK. The design",
        "hardware",
        "status and first results from the MICE experiment are presented here.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/moymh03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/moymh03.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/moymh03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-MOYMH03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-11 02:29:04"
}