{
  "session_info": {
    "id": "TUXC",
    "name": "TUXC - Tuesday Oral Parallel C",
    "url": "https://proceedings.jacow.org/ipac2021/html/tuxc.htm"
  },
  "papers": [
    {
      "paper_id": "TUXC01",
      "title": "Fabrication and Test Challenges of the SC Transport Solenoid for Mu2e Experiment",
      "authors": [
        "M.J. Lamm",
        "G. Ambrosio",
        "K.E. Badgley",
        "J.S. Brandt",
        "D.A. Evbota",
        "A. Hocker",
        "V. Lombardo",
        "T.H. Nicol",
        "P. Schlabach",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "A muon transport system (TS) is being built for the Fermilab Mu2e Experiment. The system consists of 52 superconducting solenoid magnets organized into two separately powered and cryostated elements TSu/TSd. Each cryostated element is further segmented into seven test units that form the TSu/TSd cold mass. The s-shaped geometry of the transport as well as its magnetic coupling to adjacent solenoid elements provides challenging requirements for the system design and fabrication. The acceptance campaign for the 14 test units is nearly completed and one of the two cold masses has been fully mechanically assembled. After presenting an overview of the Mu2e solenoid system",
        "we report on the fabrication and test challenges and progress on the TS system including quench performance and coil alignment.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/tuxc01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/tuxc01.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/tuxc01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-TUXC01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXC02",
      "title": "The LCLS-II-HE R&D Program: New Insights into Improving the Performance of Nitrogen-Doped SRF Cavities",
      "authors": [
        "D. Gonnella",
        "S. Aderhold",
        "J.T. Maniscalco",
        "M.C. Ross",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "D. Bafia",
        "M. Checchin",
        "A. Grassellino",
        "S. Posen",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "A.D. Palczewski",
        "C.E. Reece",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Nitrogen doping has now been demonstrated to produce SRF cavities of unprecedented Q0 values when manufactured in an industrial setting. LCLS-II has shown over 300 cavities with an average Q0 of more than 3·1010 at 16 MV/m and represents an overwhelming success of the doping protocol. LCLS-II-HE will add an additional 23 superconducting cryomodules to the LCLS-II linac",
        "requiring cavities to operate at similar levels of high Q0 but at 21 MV/m instead of 16 MV/m. Nitrogen-doped cavities have been historically plagued by lower quench fields than other cavity preparation methods. Therefore",
        "an R&D effort was launched to improve upon the quench fields of doped cavities while maintaining the high Q0. Here we present results on single-cells and 9-cells from new doping recipe pursuits",
        "transfer of these new recipes to cavity vendors",
        "and results on vendor-produced 9-cell cavities. This program has led to the discovery of the importance of the cold electropolish for producing higher quench fields. Finally",
        "we will show results from the first cryomodule produced with these new cavities operating at HE gradients.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/tuxc02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/tuxc02.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/tuxc02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-TUXC02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXC03",
      "title": "Ferro-Electric Fast Reactive Tuner Applications for SRF Cavities",
      "authors": [
        "N.C. Shipman",
        "A. Castilla",
        "M.R. Coly",
        "F. Gerigk",
        "A. Macpherson",
        "N. Stapley",
        "H. Timko",
        "CERN",
        "Geneva",
        "Switzerland",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "G. Burt",
        "A. Castilla",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "C.-J. Jing",
        "A. Kanareykin",
        "Euclid TechLabs",
        "Solon",
        "Ohio",
        "USA",
        "A Ferro-Electric fast Reactive Tuner (FE-FRT) is a novel type of RF cavity tuner containing a low loss ferroelectric material. FE-FRTs have no moving parts and allow cavity frequencies to be changed extremely quickly (on the timescale of 100s of ns or less). They are of particular interest for SRF cavities as they can be placed outside the liquid helium environment and without an FE-FRT it’s typically very difficult to tune SRF cavities quickly. FE-FRTs can be used for a wide variety of use cases including microphonics suppression",
        "RF switching",
        "and transient beam loading compensation. This promises entirely new operational capabilities",
        "increased performance and cost savings for a variety of existing and proposed accelerators. An overview of the theory and potential applications will be discussed in detail."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/tuxc03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/tuxc03.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/tuxc03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-TUXC03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXC04",
      "title": "Electron Desorption From Porous Materials of Interest for Future Accelerators",
      "authors": [
        "L. Spallino",
        "M. Angelucci",
        "R. Cimino",
        "G. Costella",
        "INFN/LNF",
        "Frascati",
        "Italy",
        "Sapienza University of Rome",
        "Rome",
        "Italy",
        "Laser ablated Cu surfaces (LASE) have been proposed to mitigate electron cloud phenomena due to their porous structure*. When such surfaces are used as cryogenic components in accelerators",
        "they will undergo thermal fluctuation",
        "photon",
        "and e-irradiation. A rigorous evaluation of their overall behavior in such vacuum conditions is clearly required. Our studies on thermal desorption of gas from LASE have shown that the morphology gives rise to a vaster and higher desorption temperature (T) with respect to what has been observed from a flat surface**. This implies that gas desorption from LASE will occur in an unexpected T range",
        "but also that cryosorbed gas will be on those surfaces at temperatures and quantities very different from what is expected to occur on flat surfaces. This gas can participate in other desorption mechanisms",
        "such as e-desorption. Here we report some measurements of e-desorption yield from such LASE treated surfaces at low T. Such results can be useful to predict the gas quantity finally delivered in accelerators’ cryogenic vacuum from a porous surface under e-irradiation.",
        "* R. Valizadeh et al.",
        "Appl. Surf. Sci. 404",
        "370 (2017) ** L. Spallino et al.",
        "Phys. Rev.. Accel. Beams 23",
        "063201 (2020)",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Funding: ARYA project funded by INFN Scientific National Committee 5"
      ],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/tuxc04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/tuxc04.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/tuxc04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-TUXC04",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXC05",
      "title": "Production and testing of NICA collider magnets",
      "authors": [
        "D. Nikiforov",
        "H.G. Khodzhibagiyan",
        "M.V. Petrov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Yu.G. Bespalov",
        "S.A. Kostromin",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "The commissioning of the accelerating complex NICA (Nuclotron-based Ion Collider fAcility) will be carried out at the end of 2022. The NICA complex includes a heavy ion linear accelerator (HILAc) and three superconducting (SC) rings new Booster synchrotron (Booster)",
        "synchrotron - Nuclotron",
        "and collider. Collider has a two-aperture structure and consists 327 SC magnets. The report presents the results of cryogenic tests of SC magnets on a cryogenic test bench",
        "such as research quench histories of the SC coils",
        "measurement static heat leak and dynamic heat releases",
        "search cold leaks. More than 80% of the collider’s dipole magnets successfully passed cryogenic tests at the end of January 2021. The first successful cryogenic tests of quadrupole lenses with correcting SC magnets were carried out.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/tuxc05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/tuxc05.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/tuxc05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-TUXC05",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXC06",
      "title": "Visualizing Lattice Dynamic Behavior by Acquiring a Single Time-Resolved MeV",
      "authors": [
        "X. Yang",
        "T.V. Shaftan",
        "V.V. Smaluk",
        "J. Tao",
        "L. Wu",
        "Y. Zhu",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "ShanghaiTech University",
        "Shanghai",
        "People’s Republic of China",
        "We explore the possibility of visualizing the lattice dynamic behavior by acquiring a single time-resolved MeV UED image. Conventionally",
        "multiple UED shots with varying time delays are needed to map out the entire dynamic process. The measurement precision is limited by the timing jitter between the pulses of laser pump and UED probe. We show that",
        "by converting the longitudinal time of an electron bunch to the transverse position of a Bragg peak on the detector",
        "one can obtain the full lattice dynamic process in a single electron pulse. We propose a novel design of a time-resolved UED with the capability of capturing a wide range of dynamic features in a single diffraction image. The work presented here is not only an extension of the ultrashort-pulse pump/long-pulse probe scheme being used in transient spectroscopy studies for decades but also advances the capabilities of MeV UED for future applications with tunable electron probe profile and detecting time range with femtosecond resolution. Furthermore",
        "we present numerical simulations illustrating the capability of acquiring a single time-resolved diffraction image based on the case-by-case studies of lattice dynamic behavior."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/tuxc06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/tuxc06.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/tuxc06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-TUXC06",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXC07",
      "title": "Modified Halbach Magnets for Emerging Accelerator Applications",
      "authors": [
        "BNL",
        "Upton",
        "New York",
        "USA",
        "The original circular Halbach magnet design creates a strong pure multipole field from permanent magnet pieces without intervening iron. This design has been extended recently at the CBETA 4-turn ERL",
        "whose return loop includes combined-function (dipole+quadrupole) Halbach-derived magnets",
        "plus a modular system of tuning shims to improve all 216 magnets’ relative field accuracy to better than 10-3. This paper describes further modifications of the Halbach design enable a larger range of accelerator applications in the future: (1) open-midplane designs to allow synchrotron radiation in light sources and other high-energy electron rings",
        "ERLs or RLAs to escape. (2) Quadrupole magnets with an oval aperture allow larger gradients than a circular aperture",
        "provided the beam is more extended in one axis than the other",
        "as usual for a quadrupole in a focussing system. These can be used in compact hadron therapy gantries. (3) New collider complexes often require multiple rings for acceleration or top-up",
        "accumulation",
        "collision and cooling. Multi-aperture permanent magnets are possible to cheaply and compactly build ring systems with several stable orbits separated by a few cm."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/tuxc07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/tuxc07.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/tuxc07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-TUXC07",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXC08",
      "title": "Simulation and Beam Experiments of a Multi-Harmonics Buncher in SSC-Linac",
      "authors": [
        "Q.Y. Kong",
        "H. Du",
        "P. Jin",
        "L. Jing",
        "X.N. Li",
        "Z.S. Li",
        "Zh. Liu",
        "J.W. Xia",
        "X. Yin",
        "Y. Zhang",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "A compact dual-gap Multi-Harmonics Buncher has been successfully used at the SSC-Linac",
        "a linear accelerator dedicates to beam injection into SSC in HIRFL. SSC-Linac operates at 53.667MHz",
        "which is forth time of the RF frequency of the SSC. In order to increase the longitudinal capture efficiency",
        "and enhance the current out of SSC",
        "an independent MHB(Multi-Harmonics Buncher) had been installed into the LEBT of SSC-Linac. The fundamental frequency of the MHB is 13.417MHz. The buncher adopts the mechanical structure of dual-gap and sawtooth waveform is generated by multi-harmonics synthetic technology. Beam performance simulation with MHB have been done with code BEAMPATH. Besides",
        "84Kr14+ beam has been bunched successfully using the MHB in our experiments",
        "the maximum bunch efficiency of 86.1% has been measured in experiments."
      ],
      "institutions": [
        "Funding: This work was supported by the National Natural Science Foundation of China(No. 11375243) and Guangdong Innovative and Entrepreneurial Research Team Program(No.2016ZT06G373)."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/tuxc08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/tuxc08.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/tuxc08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-TUXC08",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 8,
  "scrape_time": "2025-10-10 18:50:05"
}