{
  "session_info": {
    "id": "WEXB",
    "name": "WEXB - Invited Oral Presentations, Beam Dynamics and Electromagnetic Fields",
    "url": "https://proceedings.jacow.org/ipac2017/html/wexb.htm"
  },
  "papers": [
    {
      "paper_id": "WEXB1",
      "title": "Studies and Observations of Beam Dynamics Near a Sum Resonance",
      "authors": [
        "GSI",
        "Darmstadt",
        "Germany",
        "S.S. Gilardoni",
        "A. Huschauer",
        "F. Schmidt",
        "R. Wasef",
        "CERN",
        "Geneva",
        "Switzerland",
        "The effect of space charge on bunches stored for long term in a can be severe for beam survival. This may be the case in projects as SIS100 at GSI or LIU at CERN. In the past decade systematic simulation studies and experiments performed at CERN and GSI have highlighted the space charge induced periodic crossing of Â“one dimensionalÂ” resonances as the underlying mechanism of long term beam loss or emittance growth. However only in 2012",
        "for the first time",
        "the effect of space charge on a normal third order coupled resonance was investigated at the CERN-PS. The experimental results have highlighted an unprecedented asymmetric beam response where in the horizontal plane the beam exhibits a thick halo",
        "whereas the vertical profile has only core growth. The quest for explaining these results requires a journey thorough the 4 dimensional dynamics of the coupled resonance investigating the fix-lines",
        "and requires a detailed code-experiment benchmarking also including beam profile benchmarking. This study shows that the experimental results of the 2012 PS measurements can be explained by the dynamics the fixed lines also including the effect of the dispersion."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wexb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wexb1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wexb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEXB1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 19:51:41"
}