{
  "session_info": {
    "id": "THMPA",
    "name": "THMPA - Mini-Oral",
    "url": "https://proceedings.jacow.org/icalepcs2017/html/thmpa.htm"
  },
  "papers": [
    {
      "paper_id": "THMPA01",
      "title": "The Interlock System of FELiChEM",
      "authors": [
        "Z. Huang",
        "G. Liu",
        "Y. Song",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China"
      ],
      "institutions": [
        "Funding: National Natural Science Foundation of China(No.11375186, No.21327901)"
      ],
      "abstract": "FELiChEM is an infrared free-electron laser user facility under construction at NSRL. The design of the interlock system of FELiChEM is based on EPICS. The interlock system is made up of the hardware interlock system and the software interlock system. The hardware interlock system is constructed with PROFINET and redundancy technology. The software interlock system is designed with an independent configuration file to improve the flexibility. The test results of the prototype system are also described in this paper.",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thmpa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thmpa01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thmpa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THMPA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THMPA02",
      "title": "Investigations of Spatial Process Model for the Closed Orbit Feedback System at the Sis18 Synchrotron at GSI",
      "authors": [
        "S.H. Mirza",
        "P. Forck",
        "H. Klingbeil",
        "R. Singh",
        "GSI",
        "Darmstadt",
        "Germany",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "A closed orbit feedback system is under development at the GSI SIS18 synchrotron for usage during the whole acceleration cycle including the acceleration ramp. Singular value decomposition (SVD) is the most widely used technique in global closed orbit correction for eigenmode decomposition",
        "mode selection and pseudo-inversion of Orbit Response Matrix (ORM) for robust calculation of corrector magnet strengths. A new faster inversion technique based upon Discrete Fourier Transform (DFT) has been proposed for SIS18 ORM exploiting the Circulant symmetry",
        "a class of matrices which can be diagonalized by the DFT using only one row or column of the matrix. The existence of a clear relationship between SVD modes and singular values to DFT modes and coefficients for such matrices has been described. The DFT based decomposition of Circulant ORM gives hints on physical interpretation of SVD and DFT modes of perturbed closed orbit in a synchrotron. As a first practical application",
        "DFT modes were used to provide robustness against sensor failures such as one or two malfunctioning BPMs."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thmpa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thmpa02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thmpa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THMPA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THMPA03",
      "title": "A Simulation System for the European Spallation Source (ESS) Distributed Data Streaming",
      "authors": [
        "C. Reis",
        "R. Borghes",
        "G. Kourousias",
        "R. Pugliese",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "European Spallation Source (ESS)",
        "the next-generation neutron source facility",
        "is expected to produce an immense amount of data. Various working groups mostly associated with the EU project BrightnESS aim at developing solutions for its data-intensive challenges. The real-time data management and aggregation is among the top priorities. The Apache KAFKA framework will be the base for ESS real-time distributed data streaming. One of the major challenges is the simulation of data streams from experimental data generation to data analysis and storage. This presentation outlines a simulation approach based on the DonkiOrchestra data acquisition and experiment control framework",
        "re-purposed as a data streaming simulation system compatible with the ESS-KAFKA infrastructure."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thmpa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thmpa03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thmpa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THMPA03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THMPA04",
      "title": "RF-Energy Management for the European XFEL",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "The European XFEL is in its commissioning phase at this time. One of the major tasks is to bring up all the 25 installed RF-stations",
        "which will allow for beam energy of up to 17.5GeV. It is expected",
        "that a klystron may fail every 1-2 month. The accelerator is designed at the moment with an energy overhead corresponding to 2-3 RF-station",
        "as the last 4 accelerating modules will be installed in a later stage. This will allow recovering the missing energy with the other functioning RF-stations to keep downtime as short as possible in the order of seconds. The concept and corresponding High-Level software accomplishing this task will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thmpa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thmpa04.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thmpa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THMPA04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THMPA05",
      "title": "The AFP Detector Control System",
      "authors": [
        "LIP",
        "Lisboa",
        "Portugal",
        "E. Banaś",
        "S. Czekierda",
        "Z. Hajduk",
        "J. Olszowska",
        "B. Zabinski",
        "IFJ-PAN",
        "Kraków",
        "Poland",
        "Institute of Experimental and Applied Physicis",
        "Czech Technical University in Prague",
        "Praha",
        "Czech Republic",
        "Czech Republic Academy of Sciences",
        "Institute of Physics",
        "Prague",
        "Czech Republic",
        "The ATLAS Forward Proton (AFP) detector is one of the forward detectors of the ATLAS experiment at CERN aiming at measuring momenta and angles of diffractively scattered protons. Silicon Tracking and Time-of-Flight detectors are located inside Roman Pot stations inserted into beam pipe aperture. The AFP detector is composed of two stations on each side of the ATLAS interaction point and is under commissioning. The detector is provided with high and low voltage distribution systems. Each station has vacuum and cooling systems",
        "movement control and all the required electronics for signal processing. Monitoring of environmental parameters",
        "like temperature",
        "is also available. The Detector Control System (DCS) provides control and monitoring of the detector hardware and ensures the safe and reliable operation of the detector",
        "assuring good data quality. Comparing with DCS systems of other detectors",
        "the AFP DCS main challenge is to cope with the large variety of AFP equipment. This paper describes the AFP DCS system: a detector overview",
        "the operational aspects",
        "the hardware control of the AFP detectors",
        "the high precision movement",
        "cooling",
        "and safety vacuum systems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thmpa05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thmpa05.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thmpa05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THMPA05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THMPA06",
      "title": "Building Controls Applications Using HTTP Services",
      "authors": [
        "T. D'Ottavio",
        "K.A. Brown",
        "A. Fernando",
        "S. Nemesure",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "This paper describes the development and use of an HTTP services architecture for building controls applications within the BNL Collider-Accelerator department. Instead of binding application services (access to live",
        "database",
        "and archived data",
        "etc.) into monolithic applications using libraries written in C++ or Java",
        "this new method moves those services onto networked processes that communicate with the core applications using the HTTP protocol and a RESTful interface. This allows applications to be built for a variety of different environments",
        "including web browsers and mobile devices",
        "without the need to rewrite existing library code that has been built and tested over many years. Making these HTTP services available via a reverse proxy server (NGINX) adds additional flexibility and security. This paper presents implementation details",
        "pros and cons to this approach",
        "and expected future directions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thmpa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thmpa06.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thmpa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THMPA06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THMPA07",
      "title": "Improvement of Temperature and Humidity Measurement System for KEK Injector Linac",
      "authors": [
        "I. Satake",
        "M. Satoh",
        "T. Suwada",
        "Y. Yano",
        "KEK",
        "Ibaraki",
        "Japan",
        "T. Kudou",
        "S. Kusano",
        "Y. Mizukawa",
        "Mitsubishi Electric System & Service Co.",
        "Ltd",
        "Tsukuba",
        "Japan",
        "A temperature and humidity measurement system at the KEK injector linac consists of 26 data loggers connected to around 700 temperature and humidity sensors",
        "one EPICS IOC",
        "and CSS archiver. CSS archiver engine retrieves the temperature and humidity data measured by the data loggers via Ethernet. These data are finally stored into the PostgreSQL based database. A new server computer has been recently utilized for the archiver of CSS version 4 instead of version 3. It can drastically improve the speed performance for retrieving the archived data. The long-term beam stability of linac is getting a quite important figure of merit since the simultaneous top up injection is required for the independent four storage rings toward the SuperKEKB Phase II operation. For this reason",
        "we developed a new archiver data management application with a good operability. Since it can bring the operators a quick detection of anomalous behavior of temperature and humidity data resulting in the deterioration of beam quality",
        "the improved temperature and humidity measurement system can be much effective. We will report the detailed system description and practical application to the daily beam operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thmpa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thmpa07.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thmpa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THMPA07",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THMPA08",
      "title": "Processing of the Schottky Signals at RHIC",
      "authors": [
        "A. Sukhanov",
        "K.A. Brown",
        "C.W. Dawson",
        "J.P. Jamilkowski",
        "A. Marusic",
        "J. Morris",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Schottky monitors are used to determine important beam parameters in a non-destructive way. In this paper we present improved processing of the transverse and longitudinal Schottky signals from a hi-Q resonant 2.07 GHz cavity and transverse signals from a low-Q 245 MHz cavity with the main focus on providing the real-time measurement of beam tune",
        "chromaticity and emittance during injection and ramp when the beam condition is changing rapidly. The analysis and control is done in python using recently developed interfaces to Accelerator Device Objects."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thmpa08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thmpa08.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thmpa08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THMPA08",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THMPA09",
      "title": "MACUP (Material for data ACquisition - UPgrade): Project Focusing on DAQ Hardware Architecture Upgrades for SOLEIL",
      "authors": [
        "G. Renaud",
        "Y.-M. Abiven",
        "F. Ta",
        "Q.H. Tran",
        "S. Zhang",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "Since operation-startup more than 10 years ago",
        "Synchrotron SOLEIL has chosen acquisition architectures that are mainly based on CompactPCI systems. The last few years there has however been an acceleration of obsolescence issues on the CPCI products and it has also been identified that this technology would become a bottleneck in terms of performance for new projects. The MACUP project was therefore created with two main objectives: maintaining the current facility operations by addressing the hardware obsolescence risks",
        "all while searching for alternate high-performance solutions with better embedded processing capabilities to face new challenging requirements. One additional guideline for the project is to facilitate collaborative work for accelerator and beamline projects by evaluating and standardizing a limited set of technologies like the Xilinx ZYNQ SOC",
        "VITA 57 FMC and μTCA standards. This paper describes the adopted methodologies and roadmap to drive this project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thmpa09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thmpa09.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thmpa09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THMPA09",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 9,
  "scrape_time": "2025-10-10 18:18:16"
}