{
  "session_info": {
    "id": "WEPHA",
    "name": "WEPHA - Posters",
    "url": "https://proceedings.jacow.org/icalepcs2019/html/wepha.htm"
  },
  "papers": [
    {
      "paper_id": "WEPHA002",
      "title": "LCLS-II Cryomodule and Cryogenic Distribution Control",
      "authors": [
        "D.T. Robinson",
        "A.L. Benwell",
        "C. Bianchini",
        "D. Fairley",
        "S.L. Hoobler",
        "K.J. Mattison",
        "J. Nelson",
        "A. Ratti",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "L.E. Farrish",
        "J. Gubeli",
        "C. Hovater",
        "K. Jordan",
        "W. Moore",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "J.A. Kaluzny",
        "A. Martinez",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The new superconducting Linear Coherent Light Source (LCLS-II) at the SLAC National Accelerator Laboratory will be an upgrade to LCLS",
        "the world’s first hard X-ray free-electron laser. LCLS-II is in an advanced stage of construction with equipment for both Cryoplants as well as more than half of the 37 cryomodules onsite. Jefferson Lab (JLab) is a partner lab responsible for building half of the LCLS-II cryomodules. Hence the Low Energy Recirculation Facility (LERF) at JLab was used to stage and test LCLS-II cryomodules before shipping them to SLAC. LERF was set up to test two cryomodules at a time. LERF used LCLS-II cryogenic controls instrumentation racks",
        "Programmable Logic Controllers (PLC) controls and Experimental Physics and Industrial Control System (EPICS) Input/Output Controllers (IOCs) with the intention to use the LERF setup to check-out and verify cryogenic controls for LCLS-II. The cryogenic controls first utilized at LERF would then be replicated for controlling all 37 cryomodules via an EPICS user interface. This paper discusses the cryogenic controls currently developed for implementation in the LCLS-II project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha002.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA003",
      "title": "An Application of Machine Learning for the Analysis of Temperature Rise on the Production Target in Hadron Experimental Facility at J-PARC",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha003.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA005",
      "title": "Project Nheengatu: EPICS support for CompactRIO FPGA and LabVIEW-RT",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha005.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA010",
      "title": "Control Systems Design for LCLS-II Fast Wire Scanners at SLAC National Accelerator Laboratory",
      "authors": [
        "N. Balakrishnan",
        "H. Bassan",
        "J.D. Bong",
        "M.L. Campell",
        "P. Krejcik",
        "K.R. Lauer",
        "J.J. Olsen",
        "L. Sapozhnikov",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "One of the primary diagnostic tools for beam emittance measurement at the Linac Coherent Light Source II (LCLS-II)",
        "an upgrade of the SLAC National Accelerator Laboratory’s Linac Coherent Light Source (LCLS) facility",
        "is the wire scanners. LCLS-II’s new Fast Wire Scanner (FWS) is based on a similar mechanical design of linear servo motor with position feedback from an incremental encoder as that for LCLS. With a high repetition rate of up to 1 MHz from the superconducting accelerator of LCLS-II",
        "it is no longer sufficient to use point-to-point EPICS-controlled moves from wire to wire",
        "as continued exposure will damage the wires. The system needs to perform on-the-fly scans",
        "with a single position versus time profile calculated in advance and executed in a single coordinated motion by Aerotech Ensemble motion controller. The new fast wire scanner control system has several advantages over LCLS fast wire scanner controls with the capability to program safety features directly on the drive and integrate machine protection checks on an FPGA. This paper will focus on the software architecture and implementation for LCLS-II Fast Wire Scanners."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha010.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA011",
      "title": "Scaling Agile for the Square Kilometre Array",
      "authors": [
        "M. Bartolini",
        "L.R. Brederode",
        "M. Deegan",
        "M. Miccolis",
        "N.P. Rees",
        "J. Santander-Vela",
        "SKA Organisation",
        "Macclesfield",
        "United Kingdom",
        "The SKA Observatory is approaching the construction of the SKA1 radio telescopes",
        "concluding the pre-construction phase in December 2019. A bridging phase has commenced before construction commences during which lean-agile processes",
        "structures and practices are being prototyped. By the end of the bridging phase we plan to have pivoted from a document based",
        "earned value",
        "stage gated set of processes arranged around pre-construction consortia to a code based",
        "value flow driven",
        "lean-agile set of processes unified around the Scaled Agile Framework. During the bridging process we have onboarded more than 10 agile development teams and in this paper we describe the processes",
        "the main technical and cultural challenges and the preliminary results of adopting a lean-agile culture within the SKA organization."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha011.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA012",
      "title": "A General Multiple-Input Multiple-Output Feedback Device in Tango for the MAX IV Accelerators",
      "authors": [
        "P.J. Bell",
        "V.H. Hardion",
        "M. Lindbergpresenter",
        "V. Martos",
        "M. Sjöström",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden"
      ],
      "institutions": [],
      "abstract": "A general multiple-input multiple-output feedback device has been implemented in Tango for various applications in the MAX IV accelerators. The device has a configurable list of sensors and actuators, response matrix inversion, gain and frequency regulation, takes account of the validity of the sensor inputs and may respond to external interlocks. In the storage rings, it performs the slow orbit feedback (SOFB) using the 10 Hz data stream from the Libera Brilliance Plus Beam Position Measurement (BPM) electronics, reading 194 (34) BPMs in the large (small) ring as sensor inputs. The BPM readings are received as Tango events and a corrector-to-BPM response matrix calculation outputs the corrector magnet settings. In the linac, the device is used for the trajectory correction, again with sensor input data sent as Tango events, in this case from the Single Pass BPM electronics. The device is also used for tune feedback in the storage rings, making use of its own polling thread to read the sensors. In the future, a custom SOFB device may be spun off in order to integrate the hardware-based fast orbit feedback, though the general device is also seeing new applications at the beamlines. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha012.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA013",
      "title": "Programmable Logic Controller Systems for",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha013.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA014",
      "title": "EPICS Archiver Appliance - Installation and Use at BESSY/HZB",
      "authors": [
        "HZB",
        "Berlin",
        "Germany",
        "After 2 years of tests and development",
        "the EPICS Archiver Appliance went into operation at HZB/BESSY in April 2018. After running for a year as an optional new archiver",
        "the Archiver Appliance switched places with the old Channel Archiver and is now the central productive archiver in currently three installations (four at the time of this conference) at HZB. To provide a smooth transition from the Channel Archiver to the EPICS Archiver Appliance for end users as well as applications",
        "some frontends like e.g. the ArchiveViewer and other applications needed some modifications to be fully usable. New retrieval frontends are also provided and will replace the ArchiveViewer in the future. In addition the versatile retrieval API rapidly improved the development of Python applications for analysis and optimization. Experiences with installation",
        "configuration",
        "maintenance and use of the EPICS Archiver Appliance will be shared in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha014.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA016",
      "title": "A/D and D/A Processing Unit for Real Time Control of Suspended Masses in Advanced Virgo Interferometer",
      "authors": [
        "M. Bitossi",
        "A. Gennai",
        "INFN-Pisa",
        "Pisa",
        "Italy",
        "University of Pisa and INFN",
        "Pisa",
        "Italy",
        "AdV* is the project to upgrade** the VIRGO*** interferometric detector of gravitational waves. We present a major upgrade consisting of the design of new control electronics of the seismic isolation systems called Super-Attenuators (SAs)*. SAs are mechanical structures used to insulate optical elements from seismic noise. The control electronics are used to manage sensors",
        "actuators",
        "and stepping motors placed in the SAs. The design effort resulted in a high-performance signal conditioning and processing platform (UDSPT) that enables users to implement hard real-time control systems. The form factor is a variation of a double compact Module PICMG AMC.0 R2.0 Advanced MC. The key features are a TI DSP embedded",
        "two GE ports",
        "an AMC Interface containing SRIO",
        "and GE",
        "an FPGA interfacing data converters through PCIe. Additionally",
        "it includes six 24-bit 3.83 MHz ADC and six 24-bit 320 kHz DAC converters",
        "with fully differential inputs and outputs. In a single local control unit - a single 6U x 19 crate - up to 72 ADC + 72 DAC channels supported by 720 GFLOPs are allocated. A total of 20 local control units have been installed and currently are controlling ten SAs in the AdV detector.",
        "*AdV Tech Des Rep 13 April 2012.  **Advanced Virgo Baseline Design ***J. Phys.: Conf. Ser.",
        "203(2010)012074."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha016.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA017",
      "title": "Integration of Wireless Mobile Equipment in Supervisory Application",
      "authors": [
        "S. Blanchard",
        "R. Ferreira",
        "P. Gomes",
        "G. Pigny",
        "A.P. Rochapresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Pumping group stations and bake-out control cabinets are temporarily installed close to vacuum systems in CERN accelerator tunnels",
        "during their commissioning. The quality of the beam vacuum during operation depends greatly on the quality of the commissioning. Therefore",
        "the integration of mobile equipment in the vacuum supervisory application is primordial. When connected to the control system",
        "the mobile stations appear automatically integrated in the synoptic. They are granted with the same level of remote control",
        "diagnostics and data logging as fixed equipment. The wireless connection and the communication protocol with the supervisory application offer a flexible and reliable solution with high level of integrity."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha017.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA018",
      "title": "Testing Solutions for Siemens PLCs Programs Based on PLCSIM Advanced",
      "authors": [
        "E. Blanco Viñuela",
        "D. Darvas",
        "CERN",
        "Geneva",
        "Switzerland",
        "BUTE",
        "Budapest",
        "Hungary",
        "Testing Programmable Logic Controllers (PLCs) is challenging",
        "partially due to the lack of tools for testing. Isolating a part of the PLC program",
        "feeding it with test inputs and checking the test outputs often require manual work and physical hardware. The Siemens PLCSIM Advanced tool can simulate PLCs and provide a rich application programming interface (API). This paper presents a new CERN made tool based on PLCSIM Advanced and the TIA Portal Openness API. The tool takes a test case described in an intuitive",
        "tabular format",
        "which is then executed with the full PLC program or a selected part of it",
        "effectively allowing unit testing. The inputs can be fed and the outputs can be captured via the PLCSIM API. This way the tests can be executed and evaluated automatically",
        "without manual work or physical hardware. Therefore",
        "it is possible to provide an automated and scalable continuous testing solution for PLC programs to reveal errors as early as possible."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha018.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA019",
      "title": "MONARC: Supervising the Archiving Infrastructure of CERN Control Systems",
      "authors": [
        "J-C. Tournier",
        "E. Blanco Vinuelapresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN industrial control systems",
        "using WinCC OA as SCADA (Supervisory Control and Data Acquisition)",
        "share a common history data archiving system relying on an Oracle infrastructure. It consists of 2 clusters of two nodes for a total of more than 250 schemas. Due to the large number of schemas and of the shared nature of the infrastructure",
        "three basic needs arose: (1) monitor",
        "i.e. get the inventory of all DB nodes and schemas along with their configurations such as the type of partitioning and their retention period; (2) control",
        "i.e. parameterise each schema individually; and (3) supervise",
        "i.e. have an overview of the health of the infrastructure and be notified of misbehaving schemas or database node. In this publication",
        "we are presenting a way to monitor",
        "control and supervise the data archiving system based on a classical SCADA system. The paper is organized in three parts: the first part presents the main functionalities of the application",
        "while the second part digs into its architecture and implementation. The third part presents a set of use cases demonstrating the benefit of using the application."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha019.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA020",
      "title": "Pushing the Limits of Tango Archiving System using PostgreSQL and Time Series Databases",
      "authors": [
        "R. Bourtembourg",
        "S. James",
        "J.L. Pons",
        "P.V. Verdier",
        "ESRF",
        "Grenoble",
        "France",
        "G. Cuní",
        "S. Rubio-Manriquepresenter",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "INAF - OAAB",
        "Teramo",
        "Italy",
        "G.A. Fatkin",
        "A.I. Senchenko",
        "V. Sitnov",
        "NSU",
        "Novosibirsk",
        "Russia",
        "G.A. Fatkin",
        "A.I. Senchenko",
        "V. Sitnov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "L. Pivetta",
        "C. Scafuri",
        "G. Scalamera",
        "G. Strangolino",
        "L. Zambon",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "The Tango HDB++ project is a high performance event-driven archiving system which stores data with micro-second resolution timestamps",
        "using archivers written in C++. HDB++ supports MySQL/MariaDB and Apache Cassandra backends and has been recently extended to support PostgreSQL and TimescaleDB*",
        "a time-series PostgreSQL extension. The PostgreSQL backend has enabled efficient multi-dimensional data storage in a relational database. Time series databases are ideal for archiving and can take advantage of the fact that data inserted do not change. TimescaleDB has pushed the performance of HDB++ to new limits. The paper will present the benchmarking tools that have been developed to compare the performance of different backends and the extension of HDB++ to support TimescaleDB for insertion and extraction. A comparison of the different supported back-ends will be presented."
      ],
      "institutions": [],
      "abstract": "https://timescale.com",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha020.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA021",
      "title": "Free-Electron Laser Optimization with Reinforcement Learning",
      "authors": [
        "N. Bruchon",
        "G. Fenu",
        "F.A. Pellegrino",
        "E. Salvato",
        "University of Trieste",
        "Trieste",
        "Italy",
        "G. Gaio",
        "M. Lonza",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "Reinforcement Learning (RL) is one of the most promising techniques in Machine Learning because of its modest computational requirements with respect to other algorithms. RL uses an agent that takes actions within its environment to maximize a reward related to the goal it is designed to achieve. We have recently used RL as a model-free approach to improve the performance of the FERMI Free Electron Laser. A number of machine parameters are adjusted to find the optimum FEL output in terms of intensity and spectral quality. In particular we focus on the problem of the alignment of the seed laser with the electron beam",
        "initially using a simplified model and then applying the developed algorithm on the real machine. This paper reports the results obtained and discusses pros and cons of this approach with plans for future applications."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha021.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA022",
      "title": "Inception of a Learning Organization to Improve SOLEIL’s Operation",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha022.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA023",
      "title": "Co-Simulation of HDL Using Python and MATLAB Over Tcl TCP/IP Socket in Xilinx Vivado and Modelsim Tools",
      "authors": [
        "Ł. Butkowski",
        "B. Dursun",
        "Ç. Gümüş",
        "M.K. Karakurt",
        "DESY",
        "Hamburg",
        "Germany",
        "This paper presents the solution",
        "which helps in the simulation and verification of the implementation of the Digital Signal Processing (DSP) algorithms written in hardware description language (HDL). Many vendor tools such as Xilinx ISE/Vivado or Mentor Graphics ModelSim are using Tcl as an application programming interface. The main idea of the co-simulation is to use the Tcl TCP/IP socket",
        "which is Tcl build in feature",
        "as the interface to the simulation tool. Over this interface the simulation is driven by the external tool. The stimulus vectors as well as the model and verification are implemented in Python or MATLAB and the data with simulator is exchanged over dedicated protocol. The tool",
        "which was called cosimtcp",
        "was developed in Deutsches Elektronen-Synchrotron (DESY). The tool is a set of scripts that provide a set of functions. This tool has been successfully used to verify many DSP algorithms implemented in the FPGA chips of the Low Level Radio Frequency (LLRF) and synchronization systems of the European X-Ray Free Electron Laser (E-XFEL) accelerator. Cosimtcp is an open source available tool."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha023.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA024",
      "title": "A Technology Downselection for SKA User Interface Generator",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha024.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA025",
      "title": "Initial Implementation of a Machine Learning System for SRF Cavity Fault Classification at CEBAF",
      "authors": [
        "A. Carpenter",
        "T. Powers",
        "Y. Roblin",
        "A.D. Solopova Shabalina",
        "C. Tennant",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "K.M. Iftekharuddin",
        "L. Vidyaratne",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "The Continuous Electron Beam Accelerator Facility (CEBAF) at Jefferson Laboratory is a high power Continuous Wave (CW) electron accelerator. It uses a mixture of of SRF cryomodules: older",
        "lower energy C20/C50 modules and newer",
        "higher energy C100 modules. The cryomodules are arrayed in two anti-parallel linear accelerators. Accurately classifying the type of cavity faults is essential to maintaining and improving accelerator performance. Each C100 cryomodule contains eight 7-cell cavities. When a cavity fault occurs within a cryomodule",
        "all eight cavities generate 17 waveforms each containing 8192 points. This data is exported from the control system and saved for review. Analysis of these waveforms is time intensive and requires a subject matter expert (SME). SMEs examine the data from each event and label it according to one of several known cavity fault types. Multiple machine learning models have been developed on this labeled dataset with sufficient performance to warrant the creation of a limited machine learning software system for use by accelerator operations staff. This paper discusses the transition from model development to implementation of a prototype system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha025.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA026",
      "title": "Integrating COTS Equipment in the CERN Accelerator Domain",
      "authors": [
        "O.Ø. Andreassen",
        "C. Charrondièrepresenter",
        "K. Develle",
        "A. Rijllart",
        "R.E. Rossel",
        "J. Steen",
        "J. Tagg",
        "T. Zilliox",
        "CERN",
        "Geneva",
        "Switzerland",
        "Successful integration of industrial equipment in the CERN accelerator complex relies mainly on 3 key components. The first part is the Controls Middleware (CMW). That provides a common communication infrastructure for the accelerator controls at CERN. The second part is timing. To orchestrate and align electronic and electrical equipment across the 27 km Large Hadron Collider (LHC) at sub nanosecond precision",
        "an elaborate timing scheme is needed. Every component has to be configured and aligned within milliseconds and then trigger in perfect harmony with each other. The third and last bit is configuration management. The COTS devices have to be kept up to date",
        "remotely managed and compatible with each other at all times. This is done through a combination of networked Pre eXecution Environments (PXE) mounting network accessible storage on the front ends",
        "where operating systems and packages can be maintained across systems. In this article we demonstrate how COTS based National Instruments PXI and cRIO systems can be integrated in the CERN accelerator domain for measurement and monitoring systems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha026.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA027",
      "title": "Evaluation of Timing and Synchronization Techniques on NI CompactRIO Platforms",
      "authors": [
        "O.Ø. Andreassen",
        "C. Charrondièrepresenter",
        "K. Develle",
        "R.E. Rossel",
        "T. Zilliox",
        "CERN",
        "Geneva",
        "Switzerland",
        "For distributed data acquisition and control system",
        "clock synchronization between devices is key. The internal CPU clock of a CompactRIO has an accuracy of 40 ppm at 25 degree Celsius",
        "which can cause up to 3 sec of drift per day. To compensate for this drift",
        "common practice is to use a central clock (such as NTP) to synchronize the systems. In addition",
        "the cRIO has an onboard FPGA which has its own 40 MHz clock. This clock is not synchronized with the CPU",
        "and will also cause time drift. For short measurements",
        "this drift is usually negligible",
        "but for continuous data acquisition systems",
        "running 24/7",
        "the accumulated error has to be compensated. This article will show how we synchronized all clocks across multiple systems used for monitoring seismic activities in the LHC underground and surface areas. It will also describe the mechanism used to cross check synchronization by using the CERN developed White Rabbit timing system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha027.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA028",
      "title": "Power Supply Controller for Future Accelerator Facilities at BINP",
      "authors": [
        "P.B. Cheblakov",
        "A.V. Gerasevpresenter",
        "S.E. Karnaev",
        "D.V. Senkov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "A design of a new power supply controller was initiated in BINP for upgrade of existing accelerator facilities and for demands of future projects. Any accelerator facility includes a set of diverse power supplies which controllers have different specifications: number and precision of DAC/ADC channels",
        "speed and algorithm of operation. Therefore",
        "the main idea is to elaborate a controller",
        "which consists of common digital part including an interface with a control system and specialized analog frontend that fits to power supplies requirements. The digital part provides easy integration to control system by means of some standard network protocol and performing some data processing and analysis. Ethernet is used for communication with controllers",
        "MQTT is under consideration as a high-level transport protocol in some cases and EPICS IOC was tested to be embedded into controller. The initial prototype of controller is developed and deployed at VEPP-3 storage ring. The status of the work and future plans are presented in the paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha028.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA033",
      "title": "Construction and Implementation of Control and DAQ System of Micro Crystallography (MX) Beamline via Server Virtualization",
      "authors": [
        "H.J. Choi",
        "H.S. Kim",
        "S.W. Kim",
        "W.W. Lee",
        "PAL",
        "Pohang",
        "Republic of Korea",
        "The project aimed to implement a beamline control and data collection system through a server virtualization system",
        "and was applied to the 5C beamline of the 3rd generation beamline of Pohang Accelerator Laboratory (PAL). The 5C beamline is currently under construction for the FBDD beamline with the goal of building a fully automated beamline. Therefore",
        "the project was started to operate stably and efficiently various systems to be applied to the beamline. The control system was implemented using EPICS software tools and MxDC/MxLive software for data acquisition and storage. The control and data collection system of this beamline is integrated using XCP-ng[1] (XenServer Based)",
        "and it is in operation. With the integrated server virtualization system",
        "network organization / simplification and data send/receive between systems are more stabilized. The overall size of the system has been significantly reduced",
        "making maintenance easier."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha033.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA034",
      "title": "Software Tools for Hardware Elliptical Cavity Simulator Management and Configuration",
      "authors": [
        "W. Cichalewski",
        "K. Klys",
        "TUL-DMCS",
        "Łódź",
        "Poland"
      ],
      "institutions": [],
      "abstract": "The European Spallation Source (ESS) is currently in the middle of its construction phase. This facility linear accelerator consists of different sections. Superconducting part of this linac will be equipped with spokes and elliptical cavities (like M-Beta and H-Beta types). Various ESS linac components will be delivered by different in-kind partners from Europe. In order to provide a reliable development and evaluation platform hardware-based electronic cavity simulator have been built. This solution is especially useful for Low Level Radio Frequency (LLRF) systems development and integration in case of limited access to real superconducting structures. This contribution presents software tools developed for efficient cavity simulator parameters configuration and management. Solutions based on Python and EPICS framework are presented. Tool adaptation to ESS proposed E3 framework and experience from cavity simulator operation are also discussed. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha034.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA035",
      "title": "Firmware Layer Implementation of the nBLM and icBLM Systems for ESS Project",
      "authors": [
        "W. Cichalewski",
        "G.W. Jabłoński",
        "W. Jałmużna",
        "R. Kiełbik",
        "TUL-DMCS",
        "Łódź",
        "Poland",
        "F.S. Alves",
        "H. Carling",
        "I. Dolenc Kittelmann",
        "S. Farina",
        "K.E. Rosengren",
        "T.J. Shea",
        "ESS",
        "Lund",
        "Sweden",
        "Both ionization chamber Beam Loss Monitor (icBLM) and neutron Beam Loss Monitor (nBLM) systems are fundamental components of European Spallation Source (ESS) accelerator safety systems. Main responsibility of this system is instantaneous and reliable detection of accelerated proton beam loss that exceeds predefined safety threshold. Nowadays DMCS (as an in-kind partner to ESS) is responsible for beam loss detection algorithm implementation",
        "evaluation and deployment in firmware. As a hardware platform for mentioned systems MTCA.4 based form factor electronic components have been chosen (delivered by IOXOS). This contribution focuses on both cases (nBLM and icBLM) firmware realisation presentation. Proposed and developed firmware structure and functional blocks that fulfills specified by ESS requirements are described. Additionally",
        "some aspects of the system FPGA circuit resource usage and achieved performance is being discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha035.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA037",
      "title": "Status of the CLARA Control System",
      "authors": [
        "W. Smith",
        "R.F. Clarke",
        "G. Cox",
        "M.D. Hancock",
        "P.W. Heath",
        "S. Kinder",
        "N. Knowles",
        "B.G. Martlew",
        "A. Oates",
        "P.H. Owens",
        "J.T.G. Wilson",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "CLARA (Compact Linear Accelerator for Research and Applications) is a test facility for Free Electron Laser (FEL) research and other applications at STFC’s Daresbury Laboratory [1]. The control system for CLARA is a distributed control system based upon the EPICS [2] software framework. The control system builds on experience gained from previous EPICS based facilities at Daresbury including ALICE (formerly ERLP) [3] and VELA [4]. This paper presents the current status of the CLARA control system",
        "experiences during beam exploitation and developments and future plans for the next phases of the facility."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha037.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA038",
      "title": "Extending Tango Control System With Kepler Workflow, Presented on an X-Ray Crystallographic Application",
      "authors": [
        "S. Brockhauser",
        "V. Bugris",
        "K. Csankópresenter",
        "Zs. Filákovics",
        "BRC",
        "Szeged",
        "Hungary",
        "P. Ács",
        "V. Hanyecz",
        "ELI-ALPS",
        "Szeged",
        "Hungary",
        "EuXFEL",
        "Schenefeld",
        "Germany",
        "Nowadays there is a growing need for user friendly workflow editors in all fields of scientific research. A special interest group is present at big physics research facilities where instrumentation is mostly controlled by a robust",
        "and reliable low level control software solution. Different types of specific experiments using predetermined automated protocols and on-line data processing with real-time feedback require a more flexible and abstract high level control system*. Beside flexibility and dynamism",
        "easy usability is also required for researchers collaborating from several different fields. Tentatively",
        "to test the ease and flexible usability",
        "the Kepler workflow-engine was integrated with Tango**. It enables researchers to automate and document experiment protocols without any programming skill. The X-ray crystallography laboratory at the Biological Research Center of Hungarian Academy of Science (BRC) has implemented an example crystallographic workflow to test the integrated system. This development was performed in cooperation with ELI-ALPS.",
        "*S. Brockhauser",
        "et al.",
        "Acta Cryst.",
        "D68",
        "pp. 975-984",
        "2012. **P. Ács",
        "et al.",
        "Proceedings of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha038.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA040",
      "title": "IRFU EPICS Environment",
      "authors": [
        "J.F. Denis",
        "F. Gohier",
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "A. Gaget",
        "F. Gougnaud",
        "T.J. Joannem",
        "Y. Lussignol",
        "CEA-DRF-IRFU",
        "France",
        "The 3 years collaboration with ESS* at Lund (Sweden) has given us the opportunity to use new COTS hardware and new tools. Based on that experience",
        "we have developed the IEE (IRFU** EPICS Environment) by retaining relevant and scalable ESS solutions. This platform centralized several functionalities",
        "fully installed by scripting",
        "on a server that is running on a virtual machine. The functionalities are an EPICS environment and the root file system with the kernel for each embedded systems. In order to provide homogeneous EPICS modules between all collaborators",
        "a template was designed and used as containers for new developments. Furthermore",
        "a development and a production workflow is also proposed and strongly recommended. Due to the current responsibility of CEA IRFU to provide an EPICS platform for SARAF** at Tel Aviv (Israel)",
        "IEE was chosen as the standard platform for the whole accelerator. This paper will present the new standard IRFU EPICS Environment based on MTCA and virtual machines.",
        "*ESS",
        "https://europeanspallationsource.se/  **IRFU",
        "https://irfu.cea.fr/en/  ***SARAF",
        "http://soreq.gov.il/mmg/eng/Pages/SARAF-Facility.aspx"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha040.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA041",
      "title": "The CMS ECAL Control and Safety Systems Upgrades During the CERN LHC Long Shutdown 2",
      "authors": [
        "D.R.S. Di Calafiori",
        "G. Dissertori",
        "R.J. Jiménez Estupinan",
        "W. Lustermann",
        "S. Zelepoukine",
        "ETH",
        "Zurich",
        "Switzerland",
        "CERN",
        "Meyrin",
        "Switzerland",
        "INFN-Pisa",
        "Pisa",
        "Italy",
        "UNIPI",
        "Pisa",
        "Italy",
        "UW-Madison/PD",
        "Madison",
        "Wisconsin",
        "USA",
        "The Electromagnetic Calorimeter (ECAL) is one of the sub-detectors of the Compact Muon Solenoid (CMS)",
        "a general-purpose particle detector at the CERN Large Hadron Collider (LHC). The CMS ECAL Detector Control System (DCS) and the CMS ECAL Safety System (ESS) have supported the detector operations and ensured the detector’s integrity since the CMS commissioning phase",
        "more than 10 years ago. Over this long period",
        "several changes to both systems were necessary to keep them in-line with current hardware technologies and the evolution of software platforms. The acquired experience of long-term running of both systems led to the need of major modifications to the original design and implementation methods. Such interventions to either systems",
        "which require mid- to long-term validation",
        "result in a considerable amount of downtime and therefore can only be performed during long LHC shutdown periods. This paper discusses the software and hardware upgrades to be carried out during the LHC Long Shutdown 2 (LS2)",
        "with emphasis on the evaluation of design choices concerning custom and standard industrial hardware."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha041.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA042",
      "title": "Commissioning of the 352 MHz Transverse Feedback System at the Advance Photon Source",
      "authors": [
        "N.P. DiMonte",
        "C. Yao",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "With the success and reliability of the transverse feedback system installed at the Advance Photon Source (APS)",
        "an upgraded version to this system was commissioned in 2019. The previous system operated at a third of the storage-ring bunch capacity",
        "or 432 of the available 1296 bunches. This upgrade samples all 1296 bunches which allowed corrections to be made on any selected bunch in a single storage-ring turn. To facilitate this upgrade the development of a new analog I/O board capable of 352 MHz operation was necessary. This paper discusses some of the challenges associated in processing one bunch out of 1296 bunches and how flexible the system can be in processing all 1296 bunches. We will also report on the performance of this system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha042.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA043",
      "title": "The Miniscule ELT Control Software: Design, Architecture and HW integration",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha043.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA044",
      "title": "Upgrade of the Bunch Length and Bunch Charge Control Systems for the New SLAC Free Electron Laser",
      "authors": [
        "M.P. Donadio",
        "A.S. Fisher",
        "L. Sapozhnikov",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "In 2019 SLAC is building a new linear accelerator based on superconducting niobium cavities. The first one",
        "now called the copper linac",
        "could generate 120 electron bunches per second. The new one",
        "called superconducting linac",
        "will generate 1 million per second",
        "bringing some challenges to many devices along with the accelerator. Most of them receive sensors and actuators in a VME-based Platform with its control running in software",
        "with RTEMS as OS. This is feasible for 120 Hz",
        "but not for 1 MHz. The new control hardware is ATCA-based Platform",
        "that has carrier boards with FPGA connected to servers running Embedded real-time Linux OS",
        "forming the High-Performance System (HPS). Instead of having all the new architecture installed at the accelerator and tested on the go",
        "SLAC used the strategy of testing the systems in the copper linac",
        "to have them ready to use in the superconducting linac in what was called the Mission Readiness Program. The Bunch Length System and the Bunch Charge System are examples of devices of this program. Both systems were tested in the copper linac at 120 Hz",
        "with excellent results. The next step is to test them at the superconducting linac",
        "at 1 MHz."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha044.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA045",
      "title": "Data Acquisition Strategy and Developments at MAX IV",
      "authors": [
        "M. Eguiraun",
        "A. Amjad",
        "P.J. Bell",
        "A. Dupre",
        "D.A. Erbpresenter",
        "V.H. Hardion",
        "N.A. Håkansson",
        "A. Milan-Otero",
        "J.F.J. Murari",
        "E. Rosendahl",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "The experimental capabilities at the MAX IV synchrotron consists of 17 beamlines at full capacity. Each beamline puts different requirements on the control system in terms of data acquisition",
        "high performance",
        "data volume",
        "pre-processing needs",
        "and fast experiment feedback and online visualization. Therefore",
        "high demands are put on the data management systems",
        "and the reliability and performance of these systems has a big impact on the overall success of the facility. At MAX IV we have started the DataStaMP (Data Storage and Management Project) with the aim of providing a unified and reliable solution for all data sources in our facility. This work presents the control system aspects of the project. It is initially aimed at providing data management solution for a selected number of detectors and beamlines. It is developed in a modular and scalable architecture and combines several programming languages and frameworks. All the software runs in a dedicated cluster and communicates with the experimental stations through high performance networks",
        "using gRPC to talk to the control system and ZMQ for retrieving the data stream."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha045.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA046",
      "title": "EtherCAT Open Source Solution at ESS",
      "authors": [
        "J. Etxeberria",
        "J.H. Lee",
        "A. Sandström",
        "ESS",
        "Lund",
        "Sweden",
        "The European Spallation Source (ESS) is a research facility being built in Lund",
        "Sweden. The Integrated Control System (ICS) division at ESS is responsible for defining and providing a control system for all the ESS facility. ICS decided to establish open-source EtherCAT systems for mid-performance data acquisition and motion control for accelerator applications. For instance",
        "EtherCAT will be used when the I/O system needs to be beam-synchronous; it needs to acquire signals in the kHz range; or needs to be spread across locations that are far from each other and would need cumbersome cabling",
        "but still",
        "belong to one system. Following the ICS guideline",
        "Motion Control and Automation Group developed EtherCAT Motion Control (ECMC) which is based on EtherLab open-source master. This solution was focused on Motion Control applications",
        "but finally",
        "data acquisition systems will be integrated into EPICS using the same approach. In this paper",
        "we will present the ECMC solution and analyze its features showing some real applications at ESS."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha046.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA047",
      "title": "Cable Database at ESS",
      "authors": [
        "R.N. Fernandes",
        "S.R. Gysin",
        "J.A. Persson",
        "S. Regnellpresenter",
        "ESS",
        "Lund",
        "Sweden",
        "OTIF",
        "Malmö",
        "Sweden",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "COSYLAB",
        "Control System Laboratory",
        "Ljubljana",
        "Slovenia",
        "When completed",
        "the European Spallation Source (ESS) will have around half a million of installed cables to power and control both the machine and end-stations instruments. To keep track of all these cables throughout the different phases of ESS",
        "an application called Cable Database was developed at the Integrated Control System (ICS) Division. It provides a web-based graphical interface where authorized users may perform CRUD operations in cables",
        "as well as batch imports (through well-defined EXCEL files) to substantially shortened the time needed to deal with massive amounts of cables at once. Besides cables",
        "the Cable Database manages cable types",
        "connectors",
        "manufacturers and routing points",
        "thus fully handling the information that surrounds cables. Additionally",
        "it provides a programmatic interface through RESTful services that other ICS applications (e.g. CCDB) may consume to successfully perform their domain specific businesses. The present paper introduces the Cable Database and describes its features",
        "architecture and technology stack",
        "data concepts and interfaces. Finally",
        "it enumerates development directions that could be pursued to further improve this application."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha047.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA048",
      "title": "Management of IOCs at ESS",
      "authors": [
        "R.N. Fernandes",
        "S.R. Gysin",
        "T. Korhonenpresenter",
        "J.A. Persson",
        "S. Regnell",
        "ESS",
        "Lund",
        "Sweden",
        "M. Pavleski",
        "S. Sah",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "The European Spallation Source (ESS) is a neutron research facility based in Sweden that will be in operation in 2023. It is expected to have around 1500 IOCs controlling both the machine and end-station instruments. To manage the IOCs",
        "an application called IOC Factory was developed at ESS. It provides a consistent and centralized approach on how IOCs are configured",
        "generated",
        "browsed and audited. The configuration allows users to select EPICS module versions of interest",
        "and set EPICS environment variables and macros for IOCs. The generation automatically creates IOCs according to configurations. Browsing retrieves information on when",
        "how and why IOCs were generated and by whom. Finally",
        "auditing tracks changes of generated IOCs deployed locally. To achieve these functionalities",
        "the IOC Factory relies on two other applications: the Controls Configuration Database (CCDB) and the ESS EPICS Environment (E3). The first stores information about IOCs",
        "devices controlled by these",
        "and required EPICS modules and snippets",
        "while the second stores snippets needed to generate IOCs (st.cmd files). Combined",
        "these applications enable ESS to successfully manage IOCs with minimum effort."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha048.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA049",
      "title": "CERN Neutrino Cryogenic Control System Technology: From the WA105 Test Facility to the NP04 and NP02 Platforms",
      "authors": [
        "M. Pezzetti",
        "C.F. Fluderpresenter",
        "R. Orlandi",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN Neutrino Platform is CERN’s undertaking to foster fundamental research in neutrino physics at particle accelerators worldwide. In this contest CERN has constructed a series of cryogenic test facilities",
        "first of this series is the 5 tons liquid Argon detector named WA105",
        "succeeded by the 800 tons liquid Argon cryostats designated as NP04 and NP02 detectors. The cryogenic control system of these experiments was entirely designed and constructed by CERN to operate 365 days a year in a safe way through all the different phases aimed to cool down and fill the cryostat until reaching nominal stable conditions . This paper describes the process control system design methodology",
        "the off line validation and the operational commissioning including fault scenario handling. A systematic usage of advanced informatics tools",
        "such as CERN/CPC tools",
        "Git and Jenkins",
        "used to ensure a smooth and systematic software development of the process",
        "is presented. Finally",
        "particular attention is given to the adoption of the CERN cryogenic technical standard solutions to enhance reliability",
        "safety",
        "and flexibility of the system working 24 hours a day"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha049.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA050",
      "title": "Status of the Process Control Systems Upgrade for the Cryogenic Installations of the LHC Based ATLAS and CMS Detectors",
      "authors": [
        "C.F. Fluder",
        "M. Pezzetti",
        "A. Tovar González",
        "CERN",
        "Geneva",
        "Switzerland",
        "K.M. Mastyna",
        "P. Peksa",
        "T. Wolak",
        "AGH",
        "Cracow",
        "Poland",
        "The ATLAS and CMS cryogenic control systems have been operational for more than a decade. Over this period",
        "the number of PLCs faults increased due to equipment ageing",
        "leading to systems failures. Maintenance of the systems started to be problematic due to the unavailability of some PLC hardware components",
        "which had become obsolete. This led to a review of the hardware architecture and its upgrade to the latest technology",
        "ensuring a longer equipment life cycle and facilitating the implementation of modifications to the process logic. The change of the hardware provided an opportunity to upgrade the process control applications using the most recent CERN frameworks and commercial engineering software",
        "improving the in-house software production methods and tools. Integration of all software production tasks and technologies using the Continuous Integration practice allows us to prepare and implement more robust software while reducing the required time and effort. The publication presents the current status of the project",
        "the strategy for hardware migration",
        "enhanced software production methodology as well as the experience already gained from the first implementations."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha050.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA052",
      "title": "Engineering Support Activities at ELI-ALPS Through a Systems Engineering Perspective",
      "authors": [
        "L.J. Fülöp",
        "F. Horvath",
        "I. Kiss",
        "A. Makai",
        "L. Schrettner",
        "ELI-ALPS",
        "Szeged",
        "Hungary",
        "ELI-ALPS will be the first large-scale attosecond facility accessible to the international scientific community and its user groups. The core business of ELI-ALPS is to generate attosecond pulses and provide these to the prospective users. In order to reach this ultimate goal",
        "one key support area",
        "the engineering development of complex systems as well as the engineering custom design service",
        "has been systematically elaborated based on the standards",
        "recent results",
        "trends and best practices of systems engineering. It covers the boundaries towards all related support areas",
        "from building operation and maintenance",
        "to the custom manufacturing provided by the workshops",
        "with the intention to make the model as well as the daily work as comprehensive and consistent as possible. Different tools have been evaluated and applied through the years",
        "however",
        "a key lessons learned is that some of the most important tools are teamwork",
        "personal communication and constructive conflicts."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha052.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA053",
      "title": "Control System for Fast Components of Electron Beam Welding Machines",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha053.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA055",
      "title": "A PyDM User Interface for an LCLS Simulator",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha055.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA056",
      "title": "Tango Controls Benchmarking Suite",
      "authors": [
        "M. Liszcz",
        "P.P. Goryl",
        "S2Innovation",
        "Kraków",
        "Poland"
      ],
      "institutions": [],
      "abstract": "Tango Controls is a client-server framework used to build distributed control systems. It is applied at small installations with few clients and servers as well as at large laboratories running hundreds of servers talking to thousands of devices with hundreds of concurrent client applications. A Tango Controls benchmarking suite has been developed. It allows testing of several features of Tango Controls for efficiency. The tool can be used to check the impact of new developments in the framework as well as the impact of specific network-server and deployment architecture implemented at a facility. The tool will be presented along with some benchmark results.",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha056.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA057",
      "title": "Building a Data Analysis as a Service Portal",
      "authors": [
        "A. Götz",
        "A. Campbell",
        "ESRF",
        "Grenoble",
        "France",
        "I. Andrian",
        "G. Kourousias",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "A. Camps",
        "D. Salvat",
        "D. Sanchez",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "As more and more scientific data are stored at photon sources there is a growing need to provide services to access to view",
        "reduce and analyze the data remotely. The Calipsoplus* project",
        "in which all photon sources in Europe are involved in",
        "has recognized this need and created a prototype portal for Data Analysis as a Service. This paper will present the technology choices",
        "the architecture of the blueprint",
        "the prototype services and the objectives of the production version planned in the medium term. The paper will cover the challenges of building a portal from scratch which covers the needs of multiple sites",
        "each with their own data catalogue",
        "local computing infrastructure and different workflows. User authentication and management are essential to creating a useful but sustainable service."
      ],
      "institutions": [],
      "abstract": "*http://www.calipsoplus.eu/ reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha057.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA058",
      "title": "State of the Tango Controls Kernel Development in 2019",
      "authors": [
        "A. Götz",
        "R. Bourtembourg",
        "T. Braun",
        "J.M. Chaize",
        "P.V. Verdier",
        "ESRF",
        "Grenoble",
        "France",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "SKA Organisation",
        "Macclesfield",
        "United Kingdom",
        "T.M. Coutinho",
        "J. Moldes",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "NEXEYA Systems",
        "La Couronne",
        "France",
        "P.P. Goryl",
        "M. Liszcz",
        "S2Innovation",
        "Kraków",
        "Poland",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "SARAO",
        "Cape Town",
        "South Africa",
        "I. Khokhriakov",
        "O. Merkulova",
        "IK",
        "Moscow",
        "Russia",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "This paper will present the state of of kernel developments in the Tango Controls toolkit and community since the previous ICALEPCS 2017. It will describe what changes have been made over the last 2 years to the Long Term Support (LTS) version",
        "how GitHub has been used to provide Continuous Integration (CI) for all platforms",
        "and prepare the latest source code release. It will present how docker containers are supported",
        "how they are being used for CI and for building digital twins. It will describe the outcome of the kernel code camp(s). Finally it will present how Tango is preparing the next version - V10. The paper will explain why new and old installations can continue profiting from Tango Controls or in other words in Tango \"the more things change the better the core concepts become\"."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha058.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA060",
      "title": "Future Acquisition Architecture Investigations at Diamond",
      "authors": [
        "K.A. Ralphs",
        "J.W. Handfordpresenter",
        "DLS",
        "Oxfordshire",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "At Diamond we are reviewing the current stack of in-house Software Applications that are used to control our beamline experiments and analyse the data produced by them. We intend to use this process of analysis and investigation to formulate proposals for a revised architecture to address the issues with the existing architecture, making use of the opportunities presented by modern technologies and methods, where appropriate. In doing so we hope to design a more flexible and maintainable system which addresses technical debt and functional limitations that have built up over the lifetime of our current software. This will allow us to go on to implement a powerful acquisition and analysis system to be used with the new facilities of Diamond II.",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha060.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA061",
      "title": "The MAX IV Way of Agile Project Management for the Control System",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha061.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA063",
      "title": "Precision Insertion Device Control and Simultaneous Monochromator Fly Scanning for NSLS-II",
      "authors": [
        "J. Sinsheimer",
        "P.L. Cappadoro",
        "T.M. Corwin",
        "J. Escallier",
        "D.A. Harder",
        "D.A. Hidas",
        "A. Hunt",
        "M. Musardo",
        "J. Rank",
        "C. Rhein",
        "T. Tanabe",
        "I. Waluyo",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "Beginning in January of 2019",
        "8 of the 10 In-Vacuum Undulators installed in the NSLS-II storage ring underwent in-house in-situ control system upgrades allowing for control of the magnetic gap during motion down to the 50 nm level with an in-position accuracy of nearly 5 nm. Direct linking of Insertion Devices and beamline monochromators is achieved via a fiber interface allowing precise",
        "simultaneous",
        "nonlinear motion of both devices and providing a fast hardware trigger for real-time accurate insertion device and monochromator fly scanning. This presentation will discuss use case scenarios at light source facilities and detail the precision achieved for simultaneous motion. Particular attention is given to the precision at which undulator energy harmonic peaks can be tracked and the variation of the peak flux in motion."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha063.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA065",
      "title": "Upgraded Beam Instrumentation DAQ for GSI and FAIR: Overview and First Experiences",
      "authors": [
        "T. Hoffmann",
        "H. Bräuning",
        "GSI",
        "Darmstadt",
        "Germany",
        "As construction of the FAIR accelerator complex progresses",
        "the existing heavy ion synchroton SIS18",
        "the storage ring ESR and the high energy beam transfer lines HEBT have been upgraded to the future control system. Within this upgrade the beam instrumentation (BI) data acquisition systems (DAQ) have been heavily modernized too. These are now integrated into the control system with its White Rabbit based timing system",
        "data supply (i.e. ion species",
        "energy",
        "etc) and services like archiving. Dedicated clients running in the main control room allow visualization and correlation of the data and status of the BI devices. The DAQ hardware has been upgraded using new state-of-the-art components. With a trend to slowly phase out VME based systems",
        "solutions based on standard Industrial PC for few channels as well as on the new µTCA standard for many channels have been successfully implemented. This contribution will give an overview over the upgraded BI-DAQ systems like current transformers and counter applications for ionization chambers",
        "scintillators",
        "and more. It will also present first experiences during beam operation with the new control system",
        "which started summer last year."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha065.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA067",
      "title": "Control System Developments and Machine Model Benchmark for the GSI Fragment Separator FRS",
      "authors": [
        "J.P. Hucka",
        "J. Fitzek",
        "D. Ondreka",
        "S. Pietri",
        "B.R. Schlei",
        "H. Weick",
        "GSI",
        "Darmstadt",
        "Germany",
        "TU Darmstadt",
        "Darmstadt",
        "Germany"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha067.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA068",
      "title": "A Control System Using EtherCAT Technology for The Next-Generation Accelerator",
      "authors": [
        "M. Ishii",
        "M.T. Takeuchi",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "RIKEN SPring-8 Center",
        "Innovative Light Sources Division",
        "Hyogo",
        "Japan",
        "JASRI",
        "Hyogo",
        "Japan",
        "The construction of a new 3 GeV Light Source is in progress. The 3 GeV Light Source will be designed a compact and stable Linac based on the C-band accelerator developed by SACLA. Furthermore",
        "we have an upgrade project of SPring-8 that we call SPring-8-II. We adopted EtherCAT technology as a network fieldbus for the next-generation control system. Currently",
        "as the control systems using EtherCAT",
        "a low-level RF system and a new standard in-vacuum undulator system are running at the SPring-8 storage ring. Additionally",
        "it is necessary to upgrade a high-power RF (HPRF) system at SACLA and a magnet power supply system. The current HPRF system consists of a VME and four PLCs. These PLCs are connected by an optical FA-Link that had been discontinued. Therefore",
        "we will construct a new HPRF system that is replaced a VME with MTCA.4 and is used EtherCAT as a fieldbus. A fieldbus of a magnet power supply system will be replaced an old optical link with EtherCAT. The new systems will be verified into a prototype accelerator for the 3 GeV Light Source in SPring-8 site. The control systems using EtherCAT will be installed into the 3 GeV Light Source and SPring-8-II."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha068.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA069",
      "title": "babyIOC - Control System in a Box Small Factor Solution",
      "authors": [
        "O. Ivashkevych",
        "M.C. Cowan",
        "L.F. Flaks",
        "D. Poshka",
        "T. Smith",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "In the world of increasing complexity and integration",
        "experiments often stretch over multiple beamlines or several facilities. Users may come with their own sample environments and detectors. It is always a challenge to integrate user end-station equipment into the hosting facility controls. Recognizing this trend"
      ],
      "institutions": [
        "Funding: National Synchrotron Light Source, a U.S. Department of Energy (DOE) Office of Science User Facility operated by Brookhaven National Laboratory under Contract No. DE-AC02-98CH10886."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha069.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA069",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA071",
      "title": "Timing System Integration with MTCA at ESS",
      "authors": [
        "J.J. Jamróz",
        "J. Cereijo García",
        "T. Korhonen",
        "J.H. Lee",
        "ESS",
        "Lund",
        "Sweden",
        "European Spallation Source (ESS) organization has selected cutting-edge technologies to satisfy performance and scalability expectations: - Micro Telecommunications Computing Architecture (MTCA). - Micro Research Finland (MRF) based timing system with delay compensation. - Experimental Physics and Industrial Control System (EPICS). To achieve optimal data acquisition quality",
        "the control system is built on top of the timing system which gives the same absolute time reference to all EPICS process variables (PVs). The MTCA system gives configurable cableless access to manage connections among different electronic mezzanine cards",
        "therefore reducing installation workload."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha071_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha071.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha071_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA071",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA072",
      "title": "Tracking APS-U Production Components With the Component Database and eTraveler Applications",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha072_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha072.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha072_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA072",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA075",
      "title": "EPICS Also for Small and Medium Sized Experiments",
      "authors": [
        "FHI",
        "Berlin",
        "Germany",
        "The Max Planck Society (MPS) is now promoting the use of EPICS for data acquisition within its organization. An attempt is being made to establish an alternative to commercial systems. Not only the big experiments like radio telescopes",
        "LIGO",
        "accelerators and FELs will be supported",
        "but also smaller to medium experiments. This will also benefit MPS users at beamlines of accelerators. In order to make EPICS also attractive for less IT-affine experimenters (besides physicists also chemists and biochemists)",
        "the first step is to revise the documentation",
        "to create some dummy instructions",
        "but also to develop",
        "set up and test demonstration and production hardware. One focus at a later stage will be the use of the real-time operating system RTEMS. The poster shows the current status of the project and explains the planned further measures."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha075.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA075",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA077",
      "title": "CS-Studio Alarm System Based on Kafka",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha077.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA077",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA078",
      "title": "A Virtualized Beamline Control and DAQ Environment at PAL",
      "authors": [
        "S.W. Kim",
        "H.J. Choi",
        "H.S. Kim",
        "W.W. Lee",
        "PAL",
        "Pohang",
        "Republic of Korea",
        "At least three different computers are used in the beamline of PAL",
        "first for EPICS IOC",
        "second for device control and data acquisition(DAQ)",
        "and third for analyzing data for users. In the meantime",
        "stable beamline control was possible by maintaining the policy of separating applications listed above from the hardware layer. As data volumes grow and the resulting data throughput increases",
        "demands for replacement of highly efficient computers has increased. Advances in virtualization technology and robust computer performance have enabled a policy shift from hardware-level isolation to software-level isolation without replacing all the computers. DAQ and analysis software using the Bluesky Data Collection Framework have been implemented on this virtualized OS. In this presentation",
        "we introduce the DAQ system implemented by this virtualization method."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha078.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA078",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA080",
      "title": "A Communication Protocol for Motion Control Applications at the JCNS Neutron Instruments",
      "authors": [
        "H. Kleines",
        "F. Suxdorf",
        "FZJ",
        "Jülich",
        "Germany",
        "Main focus of slow control in neutron scattering is motion control for the movement of around 25 mechanical axes in a typical neutron instrument. The implementation of motion control functions in the JCNS neutron instruments at the FRM II research reactor in Garching",
        "Germany",
        "is based on Siemens S7 PLCs. A communication protocol called PMcomm which is optimized for motion control applications in neutron instruments has been developed at JCNS. PMcomm (PROFI motion communication) is based on PROFINET or PROFIBUS as the underlying transport protocol in order to facilitate the easy integration into the PLC world. It relies on the producer/consumer communication mechanism of PROFINET and PROFIBUS for the efficient direct access to often-used data like positions or status information. Coordinated movement of groups of axes is facilitated by a generic controller/axes model that abstracts from the specifics of the underlying motion control hardware. Simplicity was a major design goal of the protocol in order to allow an efficient and easy implementation on PLCs."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha080.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA080",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA081",
      "title": "Analysis and Diagnostic Toolkit for Operation Event in the NSRRC",
      "authors": [
        "C.H. Kuo",
        "B.Y. Chen",
        "H.H. Chen",
        "H.C. Chen",
        "T.W. Hsu",
        "B.Y. Huang",
        "S.J. Huang",
        "T.Y. Lee",
        "J.A. Li",
        "W.Y. Lin",
        "Y.K. Lin",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Taiwan Photon Source (TPS) and Taiwan light source (TLS) have been operated in the same time. TPS is a 3 GeV electron energy",
        "518 m circumference",
        "low-emittance synchrotron storage ring which will offer one of the synchrotron x-ray sources",
        "provide cutting-edge experimental facilities and novel multidisciplinary scientific research. TLS is a 1.5 Gev electron energy. The control system is difference between two facilities. Amount of instruments and devices these must be monitored and controlled by operator. The difference diagnostic tools will be difficult to operate and analysis between two system. These utility toolkits are effective to reduce operator loading. However",
        "these tools are developed with same concept",
        "combined with two difference machine is effective and reduce maintenance efforts. These applications of software will be reported in this conference."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha081_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha081.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha081_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA081",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA083",
      "title": "ophyd Devices: Imposing Hierarchy on the Flat EPICS V3 Namespace",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "EPICS V3 provides simple data types accessible over the network through Channel Access identified by a flat process variable (PV) name. This flexibility is often regarded as a strength of EPICS",
        "as the user can easily pick and choose the information they require. However",
        "such data is almost always inter-related in some manner",
        "pushing the burden of reconstructing that relationship to the end-user/client. ophyd represents hardware in Python as hierarchical classes",
        "grouping together related signals from the underlying control system. ophyd devices make imposing this hierarchy simple",
        "readable",
        "and descriptive. This structure allows ophyd to provide a consistent interface across a wide-range of devices",
        "which can then be used by higher-level software for any number of tasks: from command-line inspection",
        "to scanning/data collection (bluesky)",
        "or even automatic GUI generation (typhon",
        "adviewer). ophyd contains a number of pre-built devices for common hardware (and IOCs) as well as the tools to build custom devices."
      ],
      "institutions": [
        "Funding: This work was performed in support of the LCLS project at SLAC supported by the U.S. Department of Energy, Office of Science, Office of Basic Energy Sciences, under Contract No. DE-AC02-76SF00515."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha083_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha083.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha083_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA083",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA086",
      "title": "A Fast Wire Scanner System for the European Xfel and Its Impact on Safety Systems",
      "authors": [
        "T. Lensch",
        "T. Wamsat",
        "DESY",
        "Hamburg",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The European-XFEL is an X-ray Free Electron Laser facility located in Hamburg (Germany). The 17.5 GeV superconducting accelerator will provide photons simultaneously to several user stations. Currently 12 Wire Scanner stations are used to image transverse beam profiles in the high energy sections. These scanners provide a slow scan mode for single bunch operation. When operating with long bunch trains (>100 bunches) fast scans are used to measure beam sizes in an almost nondestructive manner. To operate fast scans multiple impacts on the beam loss system (BLM) and the charge transmission interlock (TIS) have to be taken into account. This paper focuses on the interaction between these systems and first experiences performing measurements. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha086_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha086.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha086_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA086",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA089",
      "title": "Design and Implementation of Superconducting Booster Control System",
      "authors": [
        "A.L. Li",
        "Z. Peng",
        "J. Zheng",
        "CIAE",
        "Beijing",
        "People’s Republic of China",
        "In order to improve beam energy",
        "a superconducting booster is built behind the tandem accelerator. The Control system is designed based on EPICS according to its functional needs. It gives a detailed description of hardware and software. The control system realizes data acquisition",
        "network monitoring",
        "Process variable (PV) management",
        "database services",
        "historical data analysis",
        "alarm and other functions of remote device. The running result shows that the control system has fast response time and works stably and reliably",
        "which meets the control requirement."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha089_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha089.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha089_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA089",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA090",
      "title": "Testing Tools for the IBEX Control System",
      "authors": [
        "T. Löhnert",
        "F.A. Akeroyd",
        "K.V.L. Baker",
        "D.P. Keymer",
        "A.J. Long",
        "C. Moreton-Smith",
        "D.E. Oram",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "J.R. Holt",
        "T.A. Willemsen",
        "K. Woods",
        "Tessella",
        "Abingdon",
        "United Kingdom",
        "At the ISIS Neutron and Muon Source",
        "we are in the process of upgrading from the LabVIEW-based SECI instrument control system to the new IBEX control system* based on EPICS**. It is crucial to the running of experiments that IBEX has a high uptime and few bugs. However",
        "it is often not possible to test the system live on an instrument prior to an experiment and thus we must be sure that it is ready to go as soon as we have users. To test that we are correctly communicating with hardware we have built a framework to automate testing of EPICS IOCs using device emulators created using the LeWIS*** Python package. This lets us test that new drivers are functionally the same as those under SECI. To ensure that the full instrument control system stack is working as intended we are also using the Squish testing tool****. Whilst this is used by industry as a GUI focused tool we have used it in conjugation with a fully simulated IBEX installation to create system tests",
        "letting us directly simulate the interactions a user has with IBEX and validate its behavior. This poster will present how using these tools has made IBEX a more robust system."
      ],
      "institutions": [],
      "abstract": "*https://iopscience.iop.org/article/10.1088/1742-6596/1021/1/012019/pdf  **https://epics-controls.org/  ***https://lewis.readthedocs.io/en/latest/ ****https://www.froglogic.com/squish/",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha090_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha090.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha090_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA090",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA091",
      "title": "Generalising the High-Level Geometry System for Reflectometry Instruments at ISIS",
      "authors": [
        "T. Löhnert",
        "A.J. Long",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Tessella",
        "Abingdon",
        "United Kingdom",
        "At the ISIS Pulsed Neutron and Muon Source",
        "we in the Experiment Control Group are currently upgrading from the LabVIEW*-based SECI instrument control system to the new IBEX control system** based on EPICS***. One class of instrument we have yet to migrate to the new system is reflectometers. These instruments require equipment to track the path of the neutron beam to high levels of precision over various experimental configurations",
        "which results in a unique set of control system requirements. Since August 2018",
        "we have been implementing a higher level geometry layer responsible for linking beamline components together and preserving experimental parameters such as the incident beam angle across different configurations. This layer is written as a Python server running on the instrument",
        "which interfaces to the Channel Access protocol used by EPICS. This talk will provide an overview of the system architecture",
        "specifically how it supports the design goal of making the system easy to extend and reconfigure while preserving the functionality of the existing solution",
        "as well as an outlook on future plans for a more sophisticated motion control system."
      ],
      "institutions": [],
      "abstract": "*http://www.ni.com/en-gb/shop/labview.html  **https://iopscience.iop.org/article/10.1088/1742-6596/1021/1/012019/pdf ***https://epics-controls.org/",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha091_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha091.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha091_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA091",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA092",
      "title": "SNS Credited Pulse Energy Limit System Conceptual Design",
      "authors": [
        "C. Deibele",
        "D.C. Williamspresenter",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "ORNL RAD",
        "Oak Ridge",
        "Tennessee",
        "USA"
      ],
      "institutions": [],
      "abstract": "The Controls Group at the Spallation Neutron Source (SNS) is designing a programmable signal processor based credited safety control that calculates pulsed beam energy based on beam kinetic energy and charge. The SNS Pulsed Energy Limit System (SPELS) must reliably shut off the beam if the average power exceeds 2.145 MW averaged over 60 seconds. This paper will cover the architecture and design choices needed to develop the system under the auspices of a programmable radiation-safety credit control. The authors will also introduce the concept of a graded failure approach that allows the credited system to continue operation in the presence of some faults.",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha092_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha092.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha092_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA092",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA093",
      "title": "Code Generation based on IFML for the User Interfaces of the Square Kilometre Array (SKA)",
      "authors": [
        "M. Brambilla",
        "M. Gasparini",
        "S. Pavanetto",
        "POLIMI",
        "Milano",
        "Italy",
        "R. Ciramipresenter",
        "A. Marassi",
        "INAF-OAT",
        "Trieste",
        "Italy",
        "The Square Kilometre Array (SKA) project is responsible for developing the SKA Observatory",
        "the world’s largest radiotelescope ever built. In this context",
        "a number of Graphical User Interfaces (GUI) have to be designed and built to be used for monitoring and control",
        "testing",
        "simulation",
        "integration",
        "commissioning and maintenance. The Tango framework and its UI tools",
        "selected for SKA in 2015",
        "support the types of basic control interfaces currently used at both radio telescopes and within high energy physics experiments. This paper reports on the development of a Qt/Taurus code generator prototype based on the IFML (Interaction Flow Modeling Language) standard and respective modeling tools",
        "that are extended for supporting the platform-specific code generation. The purpose of this work is to enable the use of low-code development in SKA GUI design",
        "thus enabling increased efficiency",
        "reliability and coherency of the produced UI. We present a simple GUI use case as complete example of software development cycle starting from requirements and including IFML modelling",
        "Qt/Taurus automatic coding",
        "interface evaluation and validation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha093_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha093.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha093_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA093",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA094",
      "title": "Data Analysis Infrastructure for Diamond Light Source Macromolecular & Chemical Crystallography and Beyond",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha094_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha094.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha094_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA094",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA095",
      "title": "Managing Archiver Rules for Individual EPICS PVs in FRIB’s Diagnostics System",
      "authors": [
        "B.S. Martins",
        "S. Cogan",
        "S.M. Lidia",
        "D.O. Omitto",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The Beam Instrumentation and Measurements group at the Facility for Rare Isotope Beams is responsible for maintaining several EPICS IOC instances for beam diagnostics",
        "of different IOC types",
        "which end up generating tens of thousands of PVs. Given the heterogeneity of Diagnostics devices",
        "the need to archive data for scientific and debugging purposes",
        "and space limitations for archived data storage",
        "there is a need for having per-PV (as opposed to per-Record) archiving rules in order to maximize utility and minimize storage footprint. This work will present our solution to the problem: \"IOC Manager\"",
        "a custom tool that leverages continuous integration",
        "a relational database",
        "and a custom EPICS module to allow users to specify regular-expression based rules for the archiver in a web interface."
      ],
      "institutions": [
        "Funding: This material is based upon work supported by the U.S. Department of Energy Office of Science under Cooperative Agreement DE-SC0000661, the State of Michigan, and Michigan State University."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha095_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha095.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha095_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA095",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA096",
      "title": "Timing Signal Distribution for Synchrotron Radiation Experiments Using RF Over White Rabbit",
      "authors": [
        "JASRI",
        "Hyogo",
        "Japan",
        "In synchrotron radiation experiments",
        "some measurements such as nuclear resonant scattering",
        "time-of-flight",
        "and time-resolved measurements necessitate an RF clock and fundamental revolution frequency (zero-address) signals synchronized with a storage ring. Currently",
        "these timing signals are delivered directly over dedicated cables from an accelerator timing station to each experimental station. Considering the upcoming IoT era",
        "it is preferable that these signals can be distributed over a network based on digital technology. Therefore",
        "I am building a proof of concept system (PoCS) that will achieve distributions of the 508.58 MHz clock and the zero-address signals synchronized with the storage ring using RF over White Rabbit*. The PoCS consists of a master node",
        "which receives the RF clock and the zero-address signals from the accelerator",
        "and two slave nodes which generate timing signals near experimental stations. Each node employs a SPEC** board and a new FMC DDS***. The slave node will be able to output the RF clock with the arbitrary division rate and phase after reproducing the 508.58 MHz clock. This paper will describe the achieved functions and performance of the PoCS."
      ],
      "institutions": [],
      "abstract": "*https://ohwr.org/project/wr-d3s  **https://ohwr.org/project/spec ***https://ohwr.org/project/fmc-dac-600m-12b-1cha-dds",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha096_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha096.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha096_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA096",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA097",
      "title": "Development of a Tango Interface for the Siemens-Based Control System of the Elettra Infrastructure Plants",
      "authors": [
        "P. Michelini",
        "I. Ferigutti",
        "F. Giacuzzo",
        "M. Lonzapresenter",
        "G. Scalamera",
        "G. Strangolino",
        "M. Trevi",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "The control system of the Elettra Sincrotrone Trieste infrastructure plants (cooling water",
        "air conditioning",
        "electricity",
        "etc.) consists of several Siemens PLCs connected by an Ethernet network and a number of management stations running the Siemens Desigo software for high-level operation and monitoring",
        "graphical display of the process variables",
        "automatic alarm distribution and a wide range of different data analysis features. No external interface has been realized so far to connect Desigo to the Elettra and FERMI accelerator control systems based on Tango",
        "making it difficult for the control room operators to monitor the conventional plant operation and parameters (temperature",
        "humidity",
        "water pressure",
        "etc.)",
        "which are essential for the accelerator performance and reliability. This paper describes the development of a dedicated Desigo application to make selected process variables externally visible to a specific Tango device server",
        "which then enables the use of all the tools provided by this software framework to implement graphical interfaces",
        "alarms",
        "archiving",
        "etc. New proposals and developments to expand and improve the system are also discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha097_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha097.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha097_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA097",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA099",
      "title": "XLEAP-II Motion Control",
      "authors": [
        "M.A. Montironi",
        "H. Bassan",
        "M.A. Carrasco",
        "E.M. Kraft",
        "A. Marinelli",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The XLEAP project was conceived with the main scope of extending the generation of ultrashort pulses at LCLS to the sub-femtosecond (sub-fs) regime. As the project produced the expected results",
        "an upgrade called XLEAP-II is being designed to provide the same functionality to LCLS-II. The XLEAP project utilized one variable gap wiggler to produce sub-fs X-ray pulses. The upgrade will involve four additional wigglers in the form of repurposed LCLS fixed gap undulators mounted on translation stages. This paper describes the design of the hardware and software architecture utilized in the motion control system of the wigglers. First it discusses how the variable gap wiggler was upgraded to be controlled by an Aerotech Ensemble motion controller through an EPICS Soft IOC (input-output controller). Then the motion control strategy for the additional four wigglers",
        "also based around Aerotech controllers driving servomotors",
        "is presented. Lessons learned from operating the wiggler and undulators during LCLS operation are discussed and utilized as a base upon which the upgraded motion control system is designed and built. Novel challenges are also identified and mitigations are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha099_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha099.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha099_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA099",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA101",
      "title": "VR as a Service: Use of Virtual Reality in a Nuclear Accelerator Facility",
      "authors": [
        "L. Pranovi",
        "M. Montispresenter",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "A nuclear plant",
        "for energy or for nuclear physics",
        "is a complex facility where high level security is mandatory",
        "both for machines and people. But sometimes the status of danger is not correctly felt",
        "inducing workers to misinterpret situations and",
        "as consequence",
        "not act in the best way. At the same time problems related to area accessibility can occur during normal machine operations",
        "limiting actions related to local maintenance and environment supervision. It would be suitable to have the opportunity to perform these tasks in an independently from environment limitations and machine operations. In order to overcome these limits",
        "we applied Virtual Technology to the nuclear physics context. As consequence",
        "this new tool has given us the chance to reinterpret concepts like training or maintenance planning. In this paper the main proof of concept implemented are described and additional information related to different VR technology usages are exposed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha101.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA101",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA102",
      "title": "A Software Suite for the Radiation Tolerant Giga-bit Transceiver - Slow Control Adapter",
      "authors": [
        "P. Moschovakos",
        "P.P. Nikiel",
        "S. Schlenker",
        "CERN",
        "Meyrin",
        "Switzerland",
        "NIKHEF",
        "Amsterdam",
        "The Netherlands",
        "NTUA",
        "Athens",
        "Greece",
        "The future upgrades of the LHC (Large Hadron Collider) will increase its luminosity. To fulfill the needs of the detector electronic upgrades and in particular to cope with the extreme radiation environment",
        "the GBT-SCA (Giga-Bit Transceiver - Slow Control Adapter) ASIC was developed for the control and monitoring of on-detector electronics. To benefit maximally from the ASIC",
        "a flexible and hardware interface agnostic software suite was developed. A hardware abstraction layer - the SCA software package - exploits the abilities of the chip",
        "maximizes its potential performance for back-end implementations",
        "provides control over ASIC configuration",
        "and enables concurrent operations wherever possible. An OPC UA server was developed on top of the SCA software library to integrate seamlessly with distributed control systems used for detector control and Trigger/DAQ (Data AcQuisition) configuration",
        "both of which communicate with the GBT-SCA via network-attached optical link receivers based on FPGAs. This paper describes the architecture",
        "design and implementation aspects of the SCA software suite components and their application in the ATLAS experiment."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha102.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA102",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA103",
      "title": "Backward Compatible Update of the Timing System of WEST",
      "authors": [
        "Y. Moudden",
        "A. Barbuti",
        "G. Caulier",
        "T. Poirier",
        "B. Santraine",
        "B. Vincent",
        "CEA/DRF/IRFM",
        "St Paul Lez Durance",
        "France",
        "Between 2013 and 2016",
        "the tokamak Tore Supra in operation at Cadarache (CEA-France) since 1988 underwent a major upgrade following which it was renamed WEST (Tungsten [W] Environment in Steady state Tokamak). The synchronization system however was not upgraded since 1999*. At the time",
        "a robust design was achieved based on AMD’s TAXI chip**: clock and events are distributed from a central emitter over a star shaped network of simplex optical links to electronic crates around the tokamak. Unfortunately",
        "spare boards were not produced in sufficient quantities and the TAXI is obsolete. In fact",
        "multigigabit serial communication standards question the future availability of any such low rate SerDeses. Designing replacement boards provides an opportunity for a new CDR solution and extended functionalities (loss-of-lock detection",
        "latency monitoring). Backward compatibility is a major constraint given the lack of resources for a full upgrade. We will first describe the current state of the timing network of WEST",
        "then the implementation of a custom CDR in full firmware",
        "using the IOSerDeses of Xilinx FPGAs and will finally provide preliminary results on development boards.",
        "*\"Upgrade of the timing system for Tore Supra long pulses\"",
        "D. Moulin et al. IEEE RealTime Conference 1999  **http://hep.uchicago.edu/~thliu/projects/Pulsar/otherdoc/TAXIchip.pdf"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha103.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA103",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA104",
      "title": "Managing Cybersecurity for Control System Safety System development environments",
      "authors": [
        "R. Mudingay",
        "S. Armanet",
        "ESS",
        "Lund",
        "Sweden",
        "At ESS",
        "we manage cyber security for our control system infrastructure by mixing together technologies that are relevant for each system. User access to the control system networks is controlled by an internal DMZ concept whereby we use standard security tools (vulnerability scanners",
        "central logging",
        "firewall policies",
        "system and network monitoring)",
        "and users have to go through dedicated control points (reverse proxy",
        "jump hosts",
        "privileged access management solutions or EPICS channel or PV access gateways). The infrastructure is managed though a DevOps approach: describing each component using a configuration management solution; using version control to track changes",
        "with continuous integration workflows to our development process; and constructing the deployment of the lab/staging area to mimic the production environment. We also believe in the flexibility of visualization. This is particularly true for safety systems where the development of safety-critical code requires a high level of isolation. To this end",
        "we utilize dedicated virtualized infrastructure and isolated development environments to improve control (remote access",
        "software update",
        "safety code management)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha104_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha104.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha104_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA104",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA105",
      "title": "Beam Synchronous Data Acquisition Using the Virtual Event Receiver",
      "authors": [
        "G. Mun",
        "J. Hu",
        "H.-S. Kang",
        "C. Kim",
        "G. Kim",
        "W.W. Lee",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "The 4th generation light source",
        "PAL-XFEL",
        "is an X-ray free electron laser in Pohang",
        "Korea. One of key features of the event timing system in the PAL-XFEL",
        "the beam synchronous acquisition is used in many beam diagnostics and analysis and the species of that increase gradually. In order to reduce the cost for event receivers which are required for operating the beam synchronous acquisition and to resolve the difficulty of the limited platform dependent on event receivers",
        "we developed the virtual event receiver system receiving timestamps and BSA information from an event generator not using real event receivers. In this paper",
        "we introduce the software architecture of the virtual event receiving system and present test results of it."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha105_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha105.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha105_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA105",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA107",
      "title": "Exploring Embedded Systems’ Dedicated Cores for Real-Time Applications",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha107_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha107.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha107_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA107",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA108",
      "title": "Modernization Plans for Fermilab’s Accelerator Control System",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The control system",
        "ACNET",
        "for Fermilab’s accelerator complex has enabled the lab’s scientific mission for decades. ACNET has evolved over the years to incorporate new technologies. However",
        "as Fermilab prepares to enter a new era with its PIP-II superconducting linear accelerator",
        "ACNET is at a crossroads. There are several components that are either obsolete or outdated",
        "or certainly will be over the long lifetime of PIP-II. We have begun a plan to modernize our accelerator control system. This paper discusses some of the obsolete hardware and software that needs to be replaced",
        "and lays out options and technologies that we might adopt as part of this modernization effort."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha108_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha108.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha108_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA108",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA109",
      "title": "Why Should You Invest in Asset Management? A Fire and Gas Use Case",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha109_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha109.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha109_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA109",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA112",
      "title": "Database Scheme for On-Demand Beam Route Switching Operations at SACLA/SPring-8",
      "authors": [
        "K. Okada",
        "N. Hosoda",
        "T. Ohshima",
        "T. Sugimoto",
        "M. Yamaga",
        "JASRI",
        "Hyogo",
        "Japan",
        "T. Fujiwara",
        "T. Maruyama",
        "T. Ohshima",
        "T. Okada",
        "RIKEN SPring-8 Center",
        "Hyogo",
        "Japan",
        "T. Fukui",
        "N. Hosoda",
        "H. Maesaka",
        "RIKEN SPring-8 Center",
        "Innovative Light Sources Division",
        "Hyogo",
        "Japan",
        "O. Morimoto",
        "Y. Tajiri",
        "SES",
        "Hyogo-pref.",
        "Japan",
        "At SACLA",
        "the X-ray free electron laser (XFEL) facility",
        "we have been operating the electron linac in time-sharing (equal duty) mode between beamlines. The next step is to vary the duty factor on an on-demand basis and to bring the beam into the SP8 storage ring. It is a part of a big picture of an upgrade*. The low-emittance beam is ideal for the next generation storage ring. In every 60 Hz repetition cycle",
        "we have to deal a bunch of electrons properly. The challenge here is we must keep the beam quality for the XFEL demands while responding occasional injection requests from the storage ring**. This paper describes the database system that supports both SACLA/SP8 operations. The system is a combination of RDB and NoSQL databases. In the on-demand beam switching operation",
        "the RDB part keeps the parameters to define sequences",
        "which include a set of one-second route patterns",
        "and a bucket sequence for the injection",
        "etc. As for data analysis",
        "it is going to be a post-process to build an event for a certain route",
        "because not all equipment get the route command in real time. We present the preparation status toward the standard operation for beamline users."
      ],
      "institutions": [],
      "abstract": "*http://rsc.riken.jp/pdf/SPring-8-II.pdf  **",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha112_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha112.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha112_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA112",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA113",
      "title": "EPICS Maintenance Tools and Practices at FRIB’s Diagnostics Department",
      "authors": [
        "D.O. Omitto",
        "S. Cogan",
        "B.S. Martins",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The Beam Instrumentation and Measurements department is responsible for dozens of different diagnostics devices deployed at multiple locations at the Facility for Rare Isotope Beam. In order to manage such a high number of devices",
        "different tools were created to address preventive and corrective maintenance tasks and check the overall health of the equipment. This work will present how the EPICS tools and frameworks",
        "such as archiver",
        "channel finder",
        "and pyDevSup",
        "were integrated with our environment to help achieve a high availability for the beam diagnostic devices."
      ],
      "institutions": [
        "Funding: This material is based upon work supported by the U.S. Department of Energy Office of Science under Cooperative Agreement DE-SC0000661, the State of Michigan and Michigan State University."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha113_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha113.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha113_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA113",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA114",
      "title": "Integration of New Siemens S7-1500 PLC Family in UNICOS-CPC: Engineering Challenges and Performance Evaluation",
      "authors": [
        "J.O. Ortolá Vidal",
        "M. Vazquez Muñiz",
        "CERN",
        "Geneva",
        "Switzerland",
        "UNICOS-CPC (UNified Industrial COntrol System - Continuous Control Package) framework is the CERN standard solution for the design and implementation of continuous industrial process control applications. This paper reports on the design and test results of the integration of a new PLC platform",
        "the new S7-1500 Siemens PLC (Programmable Logic Controllers) series. Special focus is given to the challenges faced during the integration due to the new software architecture of the PLC",
        "as well as to the early stage of the development and interfaces provided by the supplier. The paper shows the TIA portal openness capabilities of the PLC development tool and presents a comprehensive evaluation of the PLC-SCADA communication mechanisms",
        "as well as their integration in UNICOS-CPC."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha114_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha114.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha114_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA114",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA115",
      "title": "From MXCuBE3 to BSXCuBE3  a Web Application for BioSAXS Experiment Control",
      "authors": [
        "M. Oskarsson",
        "A. Beteva",
        "D.D.S. De Sanctis",
        "S. Fisher",
        "G. Leonard",
        "P. Pernot",
        "M.D. Tully",
        "ESRF",
        "Grenoble",
        "France",
        "J.B. Florialpresenter",
        "A.A. McCarthy",
        "EMBL",
        "Grenoble",
        "France",
        "A new version of the beamline control application BSXCuBE (BioSAXS Customized Beamline Environment) designed to control BioSAXS experiments at the new ESRF Extremely Brilliant Source (EBS) is under development. The new application is implemented as a Web application and it is based on MXCuBE3 (Macromolecular Crystallography Customized Beamline Environment version 3) from which inherits the same technology stack and application structure. This approach allows for faster development and easier maintenance. The advances in architecture and the design of new features in BSXCuBE3 are intended to enhance the automation on BioSAXS beamlines and facilitate the integration of new sample setups",
        "such as microfluidics. As for MXCuBE3",
        "the access to the application from any web browser natively allows the execution of remote experiments. Moreover",
        "the ergonomics of the interface further simplifies beamline operation even for non-experienced users. This work presents the current status of BSXCuBE3 and demonstrates how the development of MXCuBE3 has contributed to the construction of a BioSAXS application."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha115_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha115.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha115_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA115",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA117",
      "title": "The Array Control and Data Acquisition System of the Cherenkov Telescope Array",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha117_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha117.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha117_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA117",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA118",
      "title": "Application Development in the Face of Evolving Web Technologies at the National Ignition Facility",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha118_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha118.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha118_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA118",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA119",
      "title": "Asynchronous Driver Evaluation and Development for Digital Systems at the Argonne Tandem Linear Accelerating System",
      "authors": [
        "C.E. Peters",
        "J. Reyna",
        "D. Stanton",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "The ATLAS (Argonne Tandem Linear Accelerating System) accelerator at Argonne National Laboratory",
        "near Chicago",
        "IL.",
        "has recently been upgraded via the addition of a pulsed mode Electron Beam Ion Source (EBIS). Pulsed operation requires finer levels of control of various digital systems like fast switching high-voltage power supplies and remotely controlled function generators. Additionally",
        "pico-level and femto-level ammeters need per-device zero correction and calibration to accurately read beam intensities. As the facility moves away from fast register-based analog signals",
        "new and slower digital protocols adversely affect the perceived execution time of the control system. This work presents options",
        "research",
        "and results of implementing an asynchronous layer between high level user interfaces and the low level communication drivers in order to increase the perceived responsiveness of the system. Solutions are evaluated ranging from in-house codes",
        "which implement system-wide mutual exclusion and prioritization",
        "to drivers available from the EPICS control system. Key performance criteria include ease of implementation",
        "cross platform availability",
        "and overall robustness."
      ],
      "institutions": [
        "Funding: This work was supported by the U.S. DOE, Office of Nuclear Physics, under Contract DE-AC02-06CH11357. The research used resources of ANL’s ATLAS Facility, a DOE Office of Science User Facility."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha119_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha119.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha119_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA119",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA120",
      "title": "Management of MicroTCA Systems and its Components with a DOOCS-Based Control System",
      "authors": [
        "V. Petrosyan",
        "K. Rehlich",
        "E. Sombrowski",
        "DESY",
        "Hamburg",
        "Germany",
        "An extensive management functionality is one of the key advantages of the MicroTCA.4 standard. Monitoring and control of more than 350 MicroTCA crates and thousands of AMC and RTM modules installed at XFEL",
        "FLASH",
        "SINBAD and ANGUS experiments has been integrated into the DOOCS-based control system. A DOOCS middle layer server together with Java-based GUIs - JDDD and JDTool - developed at DESY",
        "enable remote management and provide information about MicroTCA shelves and components. The integrated management includes inventory information",
        "monitoring current consumption",
        "temperatures",
        "voltages and various types of the built-in sensors. The system event logs and collected histories of the sensors are used to investigate failures and issues."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha120_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha120.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha120_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA120",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA121",
      "title": "Deep Neural Network for Anomaly Detection in Accelerators",
      "authors": [
        "M. Piekarski",
        "W.T. Kitka",
        "NSRC SOLARIS",
        "Kraków",
        "Poland",
        "AGH University of Science and Technology",
        "Faculty of Electrical Engineering",
        "Automatics",
        "Computer Science and Biomedical Engineering",
        "Kraków",
        "Poland",
        "The main goal of NSRC SOLARIS is to provide scientific community with high quality synchrotron light. In order to do this it is essential to monitor subsystems that are responsible for beam stability. In this paper a deep neural network for anomaly detection in time series data is proposed. Base model is a pre-trained",
        "19-layer convolutional neural network VGG-19. Its task is to identify abnormal status of sensors in certain time step. Each time window is a square matrix so can be treated as an image. Any kind of anomalies in synchrotron’s subsystems may lead to beam loss",
        "affect experiments and in extreme cases can cause damage of the infrastructure",
        "therefore when anomaly is detected operator should receive a warning about possible instability."
      ],
      "institutions": [],
      "abstract": "J. Jaworek-Korjakowska",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha121_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha121.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha121_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA121",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA124",
      "title": "CERN Accelerators Beam Optimization Algorithm",
      "authors": [
        "E. Piselli",
        "A. Akroh",
        "S. Rothe",
        "CERN",
        "Geneva",
        "Switzerland",
        "K. Blaum",
        "M. Door",
        "MPI-K",
        "Heidelberg",
        "Germany",
        "IKP",
        "Mainz",
        "Germany",
        "In experimental physics",
        "computer algorithms are used to make decisions to perform measurements and different types of operations. To create a useful algorithm",
        "the optimization parameters should be based on real time data. However",
        "parameter optimization is a time consuming task",
        "due to the large search space. In order to cut down the runtime of optimization we propose an algorithm inspired by the numerical method Nelder-Mead. This paper presents details of our method and selected experimental results from high-energy (CERN accelerators) to low-energy (Penning-trap systems) experiments as to demonstrate its efficiency. We also show simulations performed on standard test functions for optimization."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha124_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha124.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha124_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA124",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA125",
      "title": "Integrating IoT Devices Into the CERN Control and Monitoring Platform",
      "authors": [
        "B. Copy",
        "M. Bräger",
        "A. Papageorgiou Koufidis",
        "E. Pisellipresenter",
        "I. Prieto Barreiro",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN Control and Monitoring Platform (C2MON) offers interesting features required in the industrial controls domain to support Internet of Things (IoT) scenarios. This paper aims to highlight the main advantages of a cloud deployment solution",
        "in order to support large-scale embedded data acquisition and edge computing. Several IoT use cases will be explained",
        "illustrated by real examples carried out in collaboration with CERN Knowledge Transfer programme."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha125_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha125.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha125_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA125",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA127",
      "title": "The IRRAD Proton Irradiation Facility Control, Data Management and Beam Diagnostic Systems: An Outlook of the Major Upgrades Beyond the CERN Long Shutdown 2",
      "authors": [
        "F. Ravotti",
        "B. Gkotse",
        "M. Glaser",
        "I.M. Mateu",
        "V. Meskova",
        "G. Pezzullo",
        "CERN",
        "Geneva",
        "Switzerland",
        "B. Gkotse",
        "P. Jouvelot",
        "MINES ParisTech",
        "PSL Research University",
        "Paris",
        "France",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "The IRRAD proton irradiation facility at CERN was built during the Long Shutdown 1 (LS1) to address the irradiation experiment needs of the community working for the High-Luminosity (HL) upgrade of the LHC. The present IRRAD is an upgrade of a historical service at CERN that",
        "since the 90’s",
        "exploits the high-intensity 24 GeV/c PS proton beam for radiation-hardness studies of detector",
        "accelerator and semiconductor components and materials. During its first run (2015-2018)",
        "IRRAD provided a key service to the CERN community",
        "with more than 2500 samples irradiated. IRRAD is operated via custom-made irradiation systems",
        "beam diagnostics and data management tools. During the Long Shutdown 2 (LS2)",
        "IRRAD will undergo several upgrades in order to cope also with new requirements arising for projects beyond the HL-LHC. In this paper",
        "we (1) describe the various hardware and software equipment developed for IRRAD",
        "and (2) present the main challenges encountered during the first years of operation",
        "which have driven most of the improvements planned for LS2 such as applying machine-learning techniques in the processing and real-time analysis of beam profile data."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha127_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha127.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha127_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA127",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA129",
      "title": "Synchronizing LabVIEW Development and Deployment Environment",
      "authors": [
        "O.Ø. Andreassen",
        "C. Charrondière",
        "M.K. Miskowiec",
        "H. Reymondpresenter",
        "A. Rijllart",
        "CERN",
        "Geneva",
        "Switzerland",
        "LabVIEW with its graphical approach is suited for engineers used to design and implement systems based on schematics and designs. Being a graphical language",
        "it can be challenging to keep track of drivers",
        "runtime engines",
        "deployments and configurations since most of the tools on the market aimed towards this are implemented for textual languages. Configuration management is possible in the development environment via version control systems such as perforce",
        "however at CERN and in the open source software development community in general",
        "the tendency is moving towards Git. In this paper we demonstrate how the combination of automated builds",
        "packaging",
        "versioning and consistent deployment can further ease and speed up development",
        "while ensure robustness and coherency across systems. We also show how an in-house built tool called \"RADE Installer\" synchronizes both development environments and drivers across workstations",
        "empowering graphical development at CERN",
        "by merging the open source toolchains with the workflow of LabVIEW. RADE installer represents definitively a solution for LabVIEW to keep track of drivers",
        "runtime engines",
        "deployments and configurations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha129_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha129.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha129_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA129",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA131",
      "title": "Evaluation of an SFP Based Test Loop for a Future Upgrade of the Optical Transmission for CERN’s Beam Interlock System",
      "authors": [
        "R. Secondo",
        "M.A. Galilée",
        "J.C. Garnier",
        "C. Martin",
        "I. Romerapresenter",
        "A.P. Siemko",
        "J.A. Uythoven",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The Beam Interlock System (BIS) is the backbone of CERN’s machine protection system. The BIS is responsible for relaying the so-called Beam Permit signal",
        "initiating in case of need the controlled removal of the beam by the LHC Beam Dumping System. The Beam Permit is encoded as a specific frequency traveling over a more than 30 km long network of optical fibers all around the LHC ring. The progressive degradation of the optical fibers and the aging of electronics affect the decoding of the Beam Permit",
        "thus potentially resulting in an undesired beam dump event and by this reduce the machine availability. Commercial off-the-shelf SFP transceivers were studied with the aim to improve the performance of the optical transmission of the Beam Permit Network. This paper describes the tests carried out in the LHC accelerator to evaluate the selected SFP transceivers and it reports the results of the test loop reaction time measurements during operation. The use of SFPs to optically transmit safety critical signals is being considered as an interesting option not only for the planned major upgrade of the BIS for the HL-LHC era but also for other protection systems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha131_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha131.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha131_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA131",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA132",
      "title": "The Development of Object Detection System for Industrial Linac Project at SLRI",
      "authors": [
        "R. Rujanakraikarn",
        "P. Koonpong",
        "S. Tesprasitte",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "The prototype of linear accelerator for industrial applications has been under development at Synchrotron Light Research Institute (SLRI). The primary purpose of this new project is for food irradiation application using x-ray. For efficient beam scanning purpose",
        "a real-time object detection system has been developed by using a machine vision USB camera. The software has been developed by using OpenCV which is run on an embedded system platform. The result of the image analysis algorithm is used to control a beam scanning magnet system of the linac in real-time. The embedded system",
        "both hardware selection and software design",
        "running the object detection task will be described in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha132_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha132.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha132_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA132",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA133",
      "title": "Sirius Diagnostics IOC Deployment Strategy",
      "authors": [
        "LNLS",
        "Campinas",
        "Brazil",
        "Sirius beam diagnostics group is responsible for specifying",
        "designing and developing IOCs for most of the diagnostics in the Booster",
        "Storage Ring and Transport Lines",
        "such as: Screens",
        "Slits",
        "Scrapers",
        "Beam Position Monitors",
        "Tune Measurement",
        "Beam Profile",
        "Current Measurement",
        "Injection Efficiency and Bunch-by-Bunch Feedback. In order to ease maintenance",
        "improve robustness",
        "repeatability and dependency isolation a set of guidelines and recipes were developed for standardizing the IOC deployment. It is based on two main components: containerization",
        "which isolates the IOC in a well-known environment",
        "and a remote boot strategy for our diagnostics servers",
        "which ensures all hosts boot in the same base operating system image. In this paper",
        "the remote boot strategy",
        "along with its constituent parts",
        "as well as the containerization guidelines will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha133_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha133.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha133_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA133",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA134",
      "title": "Monitoring System for IT Infrastructure and EPICS Control System at SuperKEKB",
      "authors": [
        "S. Sasaki",
        "T.T. Nakamura",
        "KEK",
        "Ibaraki",
        "Japan",
        "KIS",
        "Ibaraki",
        "Japan",
        "The monitoring system has been deployed to efficiently monitor IT infrastructure and EPICS control system at SuperKEKB. The system monitors two types of data: metrics and logs. Metrics such as network traffic and CPU usage are monitored with Zabbix. In addition",
        "we developed an EPICS Channel Access client application that sends PV values to Zabbix server and the status of each IOC is monitored with it. The archived data in Zabbix are visualized on Grafana",
        "which allows us to easily create dashboards and analyze the data. Logs such as text data are monitored with the Elastic Stack",
        "which lets us collect",
        "search",
        "analyze and visualize logs. We apply it to monitor broadcast packets in the control network and the frequency of Channel Access search for each PV. Moreover",
        "a Grafana plugin is developed to visualize the data from pvAccess RPC servers and various data such as CSS alarm status data can be displayed on it."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha134_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha134.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha134_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA134",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA136",
      "title": "The Software-Based Machine Protection System Using EPICS in J-PARC MR",
      "authors": [
        "K.C. Sato",
        "N. Kamikubota",
        "T. Kimura",
        "S. Yamada",
        "N. Yamamoto",
        "J-PARC",
        "KEK & JAEA",
        "Ibaraki-ken",
        "Japan",
        "Kanto Information Service (KIS)",
        "Accelerator Group",
        "Ibaraki",
        "Japan",
        "In J-PARC",
        "a Machine Protection System (MPS) stops accelerator beam operation automatically when an interlock signal comes. Normal MPS accepts interlock signals by hard-wire",
        "but a software-based MPS",
        "called \"Soft-MPS\"",
        "uses only EPICS PVs without wiring. A PLC controller running Linux was introduced to watch at some EPICS PVs over Ethernet",
        "and outputs Soft-MPS signals to the MPS unit after logical calculates. There are 2 reasons of using Soft-MPS. (1) To install interlock signals rapidly. This type of Soft-MPS will switch to hard-wire later. (2) To use non-hardware parameters: for example",
        "machine operation modes",
        "beam bunch information",
        "etc. From the first Soft-MPS setup in 2018 spring",
        "9 Soft-MPS signals are currently used. As more Soft-MPS signals are expected in the future",
        "we need to discuss the policy."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha136_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha136.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha136_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA136",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA137",
      "title": "Integration of a Model Server into the Control System of the Synchrotron Light Source DELTA",
      "authors": [
        "D. Schirmer",
        "A. Althaus",
        "DELTA",
        "Dortmund",
        "Germany",
        "During the past decades",
        "a variety of particle optics programs have been applied for accelerator studies at the storage ring facility DELTA. Depending on the application",
        "most programs were used offline without dynamic machine synchronisation. In order to centralize and standardize storage ring modeling capabilities",
        "a dedicated online model server was developed and integrated into the EPICS-based control system. The core server is based on Python/EPICS service modules using OCELOT and COBEA as simulation tools. All data",
        "actual machine readings/settings",
        "conversion coefficients",
        "results of simulation calculations as well as manual parameter settings",
        "are handled via EPICS process variables. Thus",
        "the data are transparently available in the entire control system for further processing or visualisation. To improve maintainability and adaptability",
        "the remote presentation model controller concept was realized in the implementation. The paper explains the setup of the model server and discusses first use cases."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha137_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha137.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha137_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA137",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA138",
      "title": "Orbit Correction With Machine Learning Techniques at the Synchrotron Light Source DELTA",
      "authors": [
        "DELTA",
        "Dortmund",
        "Germany",
        "In the last years",
        "artificial intelligence (AI) has experienced a renaissance in many fields. AI-based concepts are nature-inspired and can also be used in the field of accelerator controls. At DELTA",
        "various studies on this subject were conducted in the past. Among other possible applications",
        "the use of neural networks for automated correction of the electron beam position (orbit control) is of interest. Machine learning (ML) simulations with a DELTA storage ring model were already successful. Recently",
        "conventional Feed-Forward Neural Networks (FFNN) were trained on measured orbits to apply local and global beam position corrections to the 1.5 GeV storage ring DELTA. First experimental results are presented and compared with other orbit control methods."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha138_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha138.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha138_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA138",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA139",
      "title": "Scaling Up the Deployment and Operation of an ELK Technology Stack",
      "authors": [
        "S. Boychenko",
        "P. Martel",
        "B. Schofieldpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Since its integration into the CERN industrial controls environment",
        "the SCADA Statistics project has become a valuable asset for controls engineers and hardware experts in their daily monitoring and maintenance tasks. The adoption of the tool outside of the Industrial Controls and Safety Systems group scope is currently being evaluated by ALICE",
        "since they have similar requirements for alarms and value changes monitoring in their experiment. The increasing interest in scaling up the SCADA Statistics project with new customers has motivated the review of the infrastructure deployment",
        "configuration management and service maintenance policies. In this paper we present the modifications we have integrated in order to improve its configuration flexibility",
        "maintainability and reliability. With this improved solution we believe we can propose our solution to a wider scope of customers."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha139_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha139.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha139_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA139",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA140",
      "title": "Continuous Integration for PLC-based Control Systems",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha140_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha140.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha140_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA140",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA143",
      "title": "High-Level Application Architecture Design for the Aps Upgrade",
      "authors": [
        "G. Shen",
        "N.D. Arnold",
        "S.J. Benes",
        "D.P. Jarosz",
        "A.N. Johnson",
        "D.F. Stasic",
        "I.A. Usmani",
        "S. Veseli",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Osprey DCS LLC",
        "Ocean City",
        "USA",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "A modular software platform is under active design and development for high level applications to meet the requirements from APS Upgrade (APS-U) project. The design is based on a modern software architecture",
        "which has been used in many other accelerator facilities",
        "demonstrated to be effective",
        "and stable. At APS-U",
        "we are extending the architecture in order to efficiently commission",
        "operate and maintain APS-U. Its open architecture provides good flexibility and scalability. This paper presents current status of high level application architecture design",
        "implementation",
        "and progress for APS Upgrade."
      ],
      "institutions": [
        "Funding: Argonne National Laboratory’s work was supported by the U.S. Department of Energy, Office of Science, Office of Basic Energy Sciences, under contract DE-AC02-06CH11357"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha143_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha143.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha143_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA143",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA144",
      "title": "New Java Frameworks for Building Next Generation EPICS Applications",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha144_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha144.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha144_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA144",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA146",
      "title": "Web Extensible Display Manager 2",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha146_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha146.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha146_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA146",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA147",
      "title": "jddd Migration to OpenJDK11+: Benefits and Pitfalls",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha147_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha147.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha147_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA147",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA148",
      "title": "Cumbia-Telegram-Bot: Use Cumbia and Telegram to Read, Monitor and Receive Alerts From the Control Systems",
      "authors": [
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "Telegram is a cloud-based mobile and desktop messaging app focused on security and speed. It is available for Android",
        "iPhone/iPad",
        "Windows",
        "macOS",
        "Linux and as a web application. The user signs in the cumbia-telegram bot to chat with a Tango or EPICS control system from everywhere. One can read and monitor values",
        "as well as receive alerts when something special happens. Simple source names or their combination into formulas can be sent to the bot. It replies and notifies results. It is simple",
        "fast",
        "intuitive. A phone number to register with telegram and a client are the necessary ingredients. On the server side",
        "cumbia-telegram provides the administrator with full control over the allocation of resources",
        "the network load and the clients authorized to chat with the bot. Additionally",
        "the access to the systems is read only. On the client side",
        "the bot has been meticulously crafted to make interaction easy and fast: history",
        "bookmarks and alias plugins pare texting down to the bone. Preferred and most frequent operations are accessible by simple taps on special command links. The bot relies on modules and plugins",
        "that make the application extensible."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha148_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha148.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha148_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA148",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA149",
      "title": "Development of Event Receiver on Zynq-7000 Evaluation Board",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha149_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha149.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha149_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA149",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA150",
      "title": "SLED Tuning Control System for PAL-XFEL",
      "authors": [
        "Y.J. Suh",
        "H. Heo",
        "H.-S. Kang",
        "C. Kim",
        "K.H. Kim",
        "G. Mun",
        "Y.J. Park",
        "PAL",
        "Pohang",
        "Republic of Korea",
        "A total of 42 SLED Tuners are installed at the PAL-XFEL (4th generation light source) acceleration section. To adjust this",
        "a person directly enters the Tunnels and adjusts them manually. When the SLED Tuners are equipped with a motor",
        "it can be adjusted remotely and the intensity of the beam is also monitored while monitored while monitoring the output of the Klystron. In addition",
        "by storing the tuning point according to the XFEL beam rate as the LVDT value",
        "it is possible to control the SLED bar according to the beam rate changing in real time",
        "which is helpful to provide stable beam. In order to remotely control this device",
        "an additional motor",
        "LVDT",
        "and limit switch are attached. Each device is connected to the controller and can be operated and data remotely from the cab through the EPICS IOC and CSS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha150_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha150.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha150_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA150",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA151",
      "title": "A Very Lightweight Process Variable Server",
      "authors": [
        "A. Sukhanov",
        "J.P. Jamilkowski",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "Modern instruments are often supplied with rich proprietary software tools",
        "which makes it difficult to integrate them to an existing control systems. The liteServer is very lightweight",
        "low latency",
        "cross-platform network protocol for signal monitoring and control. It provides very basic functionality of popular channel access protocols like CA or pvAccess of EPICS. It supports request-reply patterns: ’info’",
        "’get’ and ’set’ requests and publish-subscribe pattern: ’monitor’ request. The main scope of the liteServer is: 1) provide control and monitoring for instruments supplied with proprietary software",
        "2) provide fastest possible Ethernet transactions",
        "3) make it possible to implement in FPGA without CPU core. The transport protocol is connection-less (UDP) and data serialization format is Universal Binary JSON (UBJSON). The UBJSON provides complete compatibility with the JSON specification",
        "it is very efficient and fast. A liteServer-based system can be connected to existing control system using simple bridge program (bridges for EPICS and RHIC Ado are provided)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha151_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha151.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha151_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA151",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA153",
      "title": "A State Machine Solution to Control Superconducting Cavities",
      "authors": [
        "D. Touchard",
        "R. Ferdinand",
        "M. Lechartier",
        "F. Pillon",
        "L. Valentin",
        "GANIL",
        "Caen",
        "France",
        "CEA-DRF-IRFU",
        "France"
      ],
      "institutions": [],
      "abstract": "For the commissioning of the",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha153_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha153.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha153_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA153",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA155",
      "title": "Anomaly Detection for CERN Beam Transfer Installations Using Machine Learning",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha155_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha155.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha155_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA155",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA156",
      "title": "Toward Continuous Delivery Of A Nontrivial Distributed Software System",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha156_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha156.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha156_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA156",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA159",
      "title": "Integrating Conventional Facilities Systems via BACnet",
      "authors": [
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Conventional facility controls",
        "such as those used for water and cooling systems",
        "are often developed and operated independent of the accelerator control system using commercial SCADA systems. At the Spallation Neutron Source",
        "these systems are fully integrated into the EPICS based machine control system to facilitate optimal machine performance. BACnet is the predominant communication protocol used in the building automation industry",
        "thus inspiring SNS to develop a BACnet/IP software driver for EPICS to enable this integration. This paper describes how SNS uses the BACnet driver and standard EPICS tools to perform custom chiller sequencing to manage chiller system performance and meet accelerator requirements for high availability."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha159_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha159.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha159_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA159",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA160",
      "title": "EPICS pva Access Control at ESS",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha160_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha160.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha160_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA160",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA161",
      "title": "Revisiting the Bunch-Synchronized Data Acquisition System for the European XFEL Accelerator",
      "authors": [
        "T. Wilksen",
        "A. Aghababyan",
        "L. Fröhlich",
        "O. Hensler",
        "R. Kammering",
        "K. Rehlich",
        "V. Rybnikov",
        "DESY",
        "Hamburg",
        "Germany",
        "After about two years in operation the bunch-synchronized data acquisition as used with the accelerator control system at the European XFEL is being revisited and reevaluated. As we have now gained quite some experience with the current system design it was found to have shortfalls specifically with respect to the offered methods for data retrieval and management. In the context of modern data collection and management technologies readily in use by huge internet companies",
        "new frameworks are being evaluated as a control-system independent replacement for data reduction",
        "processing and online analysis. The main focus here is currently put on streaming technologies. Different approaches are being discussed in this paper and reviewed for feasibility and adaptability for control system architectures used at DESY’s accelerator facilities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha161_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha161.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha161_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA161",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA163",
      "title": "NXCALS - Architecture and Challenges of the Next CERN Accelerator Logging Service",
      "authors": [
        "J.P. Wozniak",
        "C. Roderick",
        "CERN",
        "Geneva",
        "Switzerland",
        "CERN’s Accelerator Logging Service (CALS) is in production since 2003 and stores data from accelerator infrastructure and beam observation devices. Initially expecting 1 TB/year",
        "the Oracle based system has scaled to cope with 2.5 TB/day coming from >2.3 million signals. It serves >1000 users making an average of 5 million extraction requests per day. Nevertheless",
        "with a large data increase during LHC Run 2 the CALS system began to show its limits",
        "particularly for supporting data analytics. In 2016 the NXCALS project was launched with the aim of replacing CALS from Run 3 onwards",
        "with a scalable system using \"Big Data\" technologies. The NXCALS core is production-ready",
        "based on open-source technologies such as Hadoop",
        "HBase",
        "Spark and Kafka. This paper will describe the NXCALS architecture and design choices",
        "together with challenges faced while adopting these technologies. This includes: write/read performance when dealing with vast amounts of data from heterogenous data sources with strict latency requirements; how to extract",
        "transform and load >1 PB of data from CALS to NXCALS. NXCALS is not CERN-specific and can be relevant to other institutes facing similar challenges."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha163_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha163.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha163_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA163",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA164",
      "title": "CAFlux: A New EPICS Channel Archiver System",
      "authors": [
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "We post a new EPICS channel archiver system that is being developed at LANSCE of Los Alamos National Laboratory. Different from the legacy archiver system",
        "this system is built on InfluxDB database and Plotly visualization toolkits. InfluxDB is an open­source time series database system and provides a SQL-like language for fast storage and retrieval of time series data. By replacing the old archiving engine and index file with InfluxDB",
        "we have a more robust",
        "compact and stable archiving server. On a client side",
        "we intro­duce a new implementation combined with asynchronous programming and multithreaded programming. We also describe a web-based archiver configuration system that is associ­ated with our current IRMIS system. To visualize the data stored",
        "we use the JavaScript Plotly graphing library",
        "another open source toolkit for time series data",
        "to build front­end pages. In addition",
        "we also develop a viewer application with more functionality including basic data statistics and simple arithmetic for channel values. Finally",
        "we propose some ideas to integrate more statistical analysis into this system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha164_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha164.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha164_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA164",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA165",
      "title": "Upgrade of the European XFEL Phase Shifters",
      "authors": [
        "M. Yakopov",
        "S. Abeghyan",
        "M. Bagha-Shanjani",
        "S. Karabekyan",
        "J. Pflüger",
        "F. Preisskorn",
        "EuXFEL",
        "Schenefeld",
        "Germany",
        "CAEP",
        "Sichuan",
        "People’s Republic of China",
        "To eliminate the impact of radiation shower on the incremental encoder readout and provide a better dynamic movement the upgrade of all 88 phase shifters of the European XFEL have been successfully done without interruption of the operation schedule. The implementation steps",
        "as well as the results of the hardware and software tests made in the laboratory",
        "are presented. The sensitivity of the Renishaw RGH22O15D00A encoder to the radiation shower was measured in the"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha165_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha165.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha165_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA165",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPHA166",
      "title": "Development of Web-based Parameter Management System for SHINE",
      "authors": [
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "Y.B. Leng",
        "Y.B. Yanpresenter",
        "SSRF",
        "Shanghai",
        "People’s Republic of China"
      ],
      "institutions": [],
      "abstract": "A web-based parameter management system for Shanghai High repetition rate XFEL aNd Extreme light facility (SHINE) is developed for accelerator physicists and researchers to communicate with each other and track the modified history. The system is based on standard J2EE Glassfish platform with MySQL database utilized as backend data storage. The user interface is designed with JavaServer Faces which incorporates MVC architecture. It is of great convenience for researchers in the facility designing process. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha166_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha166.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha166_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA166",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA167",
      "title": "Status of the SHINE Control System",
      "authors": [
        "Y.B. Yan",
        "G.H. Chen",
        "J.F. Chen",
        "J.G. Ding",
        "Y.B. Leng",
        "Y.J. Liu",
        "Q.R. Mi",
        "H.F. Miao",
        "C.L. Yu",
        "H. Zhao",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "H.Y. Wang",
        "P.X. Yu",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "The high-gain free electron lasers have given scientists hopes for new scientific discoveries in many frontier research areas. The Shanghai HIgh repetition rate XFEL aNd Extreme light facility (SHINE) is under construction in China",
        "which is a quasi-continuous wave hard X-ray free electron laser facility. The control system is responsible for the facility-wide device control",
        "data acquisition",
        "machine protection",
        "high level database or application",
        "as well as network and computing platform. It will be mainly based on EPICS to reach the balance between the high performance and costs of maintenance. The latest technology will be adopted for the high repetition rate data acquisition and feedback system. The details of the control system design will be reported in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha167_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha167.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha167_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA167",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA168",
      "title": "Status of the TPS Vacuum Control System",
      "authors": [
        "Y.C. Yang",
        "C.K. Chan",
        "C.-C. Chang",
        "J.-Y. Chuang",
        "Y.Z. Lin",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The Taiwan photon source (TPS) is a 3 GeV photon source. For the vacuum system NI CompactRIO controllers with embedded real-time processors and programmable FPGAs were selected to design the inter-lock system to maintain ultra-high vacuum conditions and protect vacuum devices. The vacuum pressure protection function and component protection logics worked well during the past years of operation. Be-sides",
        "basic function and other applications such as TCP/IP Modbus communication and real time message APIs were developed. The architecture of the vacuum control system is presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha168_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha168.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha168_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA168",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA170",
      "title": "First Steps in Automated Software Development Approach for LHC Phase II Upgrades CO2 Detector Cooling Systems",
      "authors": [
        "L. Zwalinski",
        "J. Daguin",
        "L.T. Davoine",
        "N. Frank",
        "D. Giakoumi",
        "M. Ostrega",
        "P. Petagna",
        "P. Tropea",
        "B. Verlaat",
        "CERN",
        "Meyrin",
        "Switzerland",
        "With refrigerating power of the order of 1.5 kW at -35 °C and full compatibility with Detector Control System standards",
        "Light Use Cooling Appliance for Surface Zones (LUCASZ) is the first movable medium size evaporative CO2 detector cooling system. By 2018 a series of 4 LUCASZ units has been fully deployed by the EP-DT group at CERN. LUCASZ is capable to provide CO2 cooling for various needs of detector development and testing required for Phase I&II upgrades of LHC experiments. This paper describes selected software and controls hardware ideas used to develop the LUCASZ control system as baseline solutions for CO2 cooling systems for Phase II upgrade of ATLAS and CMS trackers. The main challenges for future control system development will come from the number of cooling plants",
        "the modularity",
        "operation",
        "and the implementation of backup philosophy. The introduction of automated software generation for both PLC and SCADA is expected to bring major improvement on the efficiency of control system implementation. In this respect",
        "a unification step between experiments is highly required without neglecting specific needs of ATLAS and CMS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha170_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha170.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha170_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA170",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA172",
      "title": "Waltz - A Platform for Tango Controls Web Applications",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha172_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha172.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha172_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA172",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA173",
      "title": "EPICS Controlled Wireless Sensors",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha173_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha173.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha173_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA173",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA174",
      "title": "ADUVC - an EPICS Areadetector Driver for USB Video Class Devices",
      "authors": [
        "Stony Brook University",
        "Computer Science Department",
        "Stony Brook",
        "New York",
        "USA",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "Most devices supported by EPICS areaDetector fall under one of two categories: detectors and cameras. Many of the cameras in this group can be classified as industrial cameras",
        "and allow for fine control of exposure time",
        "gain",
        "frame rate",
        "and many other image acquisition parameters. This flexibility can come at a cost however",
        "with most such industrial cameras’ prices starting near one thousand dollars",
        "with the price rising for cameras with more features and better hardware. While these prices are justified for situations that require a large amount of control over the camera",
        "for monitoring tasks and some basic data acquisition the use of consumer devices may be sufficient while being far less cost-prohibitive. The solution we developed was to write an areaDetector driver for USB Video Class (UVC) devices",
        "which allows for a variety of cameras and webcams to be used through EPICS and areaDetector",
        "with most costing under $100."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wepha174_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wepha174.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wepha174_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WEPHA174",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 123,
  "scrape_time": "2025-10-10 18:13:08"
}