{
  "session_info": {
    "id": "TUBA",
    "name": "TUBA - Fundamentals II - Beyond Nb",
    "url": "https://proceedings.jacow.org/SRF2015/html/tuba.htm"
  },
  "papers": [
    {
      "paper_id": "TUBA01",
      "title": "Status of the SRF Systems at HIE-ISOLDE",
      "authors": [
        "W. Venturini Delsolaro",
        "L. Arnaudon",
        "K. Artoos",
        "C. Bertone",
        "J.A. Bousquet",
        "N. Delruelle",
        "M. Elias",
        "J.A. Ferreira Somoza",
        "F. Formenti",
        "J. Gayde",
        "J.L. Grenard",
        "Y. Kadi",
        "G. Kautzmann",
        "Y. Leclercq",
        "M. Mician",
        "A. Miyazaki",
        "E. Montesinos",
        "V. Parma",
        "G.J. Rosaz",
        "K.M. Schirm",
        "E. Siesling",
        "A. Sublet",
        "M. Therasse",
        "L. Valdarno",
        "D. Valuch",
        "G. Vandoni",
        "L.R. Williams",
        "P. Zhang",
        "CERN",
        "Geneva",
        "Switzerland",
        "The HIE-ISOLDE project has been approved by CERN in 2009 and gained momentum after 2011. The final energy goal of the upgrade is to boost the radioactive beams of REX-ISOLDE from the present 3 MeV/u up to 10 MeV/u for A/q up to 4.5. This is to be achieved by means of a new superconducting linac",
        "operating at 101.28 MHz and 4.5 K with independently phased quarter wave resonators (QWR). The QWRs are based on the Nb sputtering on copper technology",
        "pioneered at CERN and developed at INFN-LNL for this cavity shape. Transverse focusing is provided by Nb-Ti superconducting solenoids. The cryomodules hosting the active elements are of the common vacuum type. In this contribution we will report on the recent advancements of the HIE-ISOLDE linac technical systems involving SRF technology. The paper is focused on the cavity production",
        "on the experience with the assembly of the first cryomodule (CM1)",
        "and on the results of the first hardware commissioning campaign."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/tuba01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/tuba01.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/tuba01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-TUBA01",
      "page_number": "481",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBA02",
      "title": "Thermal Contact Resistance at the Nb-Cu Interface",
      "authors": [
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "UniNa",
        "Napoli",
        "Italy",
        "Niobium thin film sputtered copper cavities are strongly limited for the application in high field accelerators by the unsolved “Q-slope” problem. In the present paper",
        "we examine the different contributions of the niobium film",
        "the copper substrate",
        "the Helium-Copper interface and the Niobium-Copper Interface",
        "proposing the hypothesis that main cause of losses is due to an enhanced thermal boundary resistance RNb/Cu at the Nb/Cu interface",
        "due to poor thermal contact between film and substrate. So",
        "starting from different Q vs Eacc experimental curves from different sources",
        "and using a typical “inverse problem” method",
        "we deduced the corresponding distribution functions generating those curves. Assuming that only a small fraction of the film over the cavity surface is in poor thermal contact with the substrate (or even partially detached)",
        "due to bad adhesion problems",
        "we propose as a possible solution of the problem",
        "the possibility to use higher temperatures of deposition and the adoption at the interface of a buffer layer of a material that alloys both with Copper and with Niobium."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/tuba02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/tuba02.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/tuba02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-TUBA02",
      "page_number": "488",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBA03",
      "title": "On the Understanding of Q-Slope of Niobium Thin Films",
      "authors": [
        "S. Aull",
        "T. Junginger",
        "A. Sublet",
        "W. Venturini Delsolaro",
        "P. Zhang",
        "CERN",
        "Geneva",
        "Switzerland",
        "HZB",
        "Berlin",
        "Germany",
        "University of Siegen",
        "Siegen",
        "Germany",
        "JLab",
        "Newport News",
        "Virginia",
        "USA"
      ],
      "institutions": [],
      "abstract": "A-M. Valente-Feliciano The Q-slope of niobium coated copper cavities at medium fields is still the limiting factor for the application the Nb/Cu technology in accelerators. This paper presents a dedicated study of a niobium coating with bulk-like characteristics which shows a Q-slope comparable to bulk Nb at 400 MHz and 4 K. Combining the bulk like film with recent findings of the HIE Isolde indicates that the film microstructure and the Nb/Cu interface are the key aspects to understanding the Q-slope.",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/tuba03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/tuba03.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/tuba03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-TUBA03",
      "page_number": "494",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBA04",
      "title": "Nb3Sn Cavities: Material Characterization and Coating Process Optimization",
      "authors": [
        "D.L. Hall",
        "T. Gruber",
        "J.J. Kaufman",
        "M. Liepe",
        "J.T. Maniscalco",
        "S. Posen",
        "B. Yu",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Recent progress on vapour diffusion coated Nb3Sn SRF cavities makes this material a very promising alternative for CW medium field SRF applications. In this paper we report on several systematic studies to determine the sources currently limiting the performance of Nb3Sn cavities to determine improved coating parameters to overcome these limitations. These include a detailed study of the sensitivity of Nb3Sn to trapped ambient magnetic flux",
        "a first measurement of the field dependence of the energy gap in Nb3Sn and detailed measurements of the stoichiometry of the obtained Nb3Sn coatings with synchrotron x-ray diffraction and STEM. Initial results from a study on the impact of the coating process parameters on energy gap",
        "Q-slope",
        "and residual resistance",
        "show clear dependencies",
        "and thus directions for process optimization."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/tuba04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/tuba04.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/tuba04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-TUBA04",
      "page_number": "501",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBA05",
      "title": "Progress With Multi-Cell Nb3Sn Cavity Development Linked With Sample Materials Characterization",
      "authors": [
        "G.V. Eremeev",
        "M.J. Kelley",
        "C.E. Reece",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "M.J. Kelley",
        "U. Pudasaini",
        "The College of William and Mary",
        "Williamsburg",
        "Virginia",
        "USA",
        "Virginia Polytechnic Institute and State University",
        "Blacksburg",
        "USA",
        "Exploiting both the new Nb3Sn coating system and the materials characterization tools nearby",
        "we report our progress in low-loss Nb3Sn films development. Nb3Sn films a few micrometers thick were grown on Nb coupons as well as single- and multi-cell cavities by the Sn-diffusion technique. Films structure and composition were investigated on coated samples and cavity cutouts with characterization tools including SEM/EDS/EBSD",
        "AFM",
        "XPS",
        "SIMS towards correlating film growth and RF loss to material properties and deposition parameters. Cavity coating efforts focused on establishing techniques for coating progressively more complicated RF structures",
        "and understanding limiting mechanisms in coated cavities. Nb3Sn coated 1.5 GHz 1-cell and 1.3 GHz 2-cell cavities have shown quality factors of 1010 at 4.3 K",
        "with several cavities reaching above Eacc = 10 MV/m. The dominant limiting mechanisms were low field quenches and quality factor degradation above 8 MV/m. The surface data indicates a near-stoichiometric Nb3Sn consistent with the transition temperature and gap measurements. The Nb3Sn layer is covered with Nb2O5 and SnO2 native oxides and has little memory of the pre-coating surface."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/tuba05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/tuba05.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/tuba05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-TUBA05",
      "page_number": "505",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBA06",
      "title": "Increase in Vortex Penetration Field on Nb Ellipsoid Coated With a MbB2 Thin Film",
      "authors": [
        "T. Tan",
        "M.A. Wolak",
        "X. Xi",
        "Temple University",
        "Philadelphia",
        "USA",
        "L. Civale",
        "T. Tajima",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Since SRF2013",
        "there has been a remarkable progress in terms of sample measurement. Instead of measuring a flat film that allows magnetic field on both sides of the film",
        "which does not simulate the situation on a SRF cavity correctly",
        "an ellipsoidal bulk Nb (rugby-ball shape with ~8 mm long axis) was coated with a MgB2 film and its vortex penetration field has been measured with a SQUID magnetometer and compared with uncoated samples. After a number of measurements",
        "vortex penetration field has been consistent with maximum critical RF field",
        "superheating field. Here",
        "we show that 100 nm and 200 nm thick MgB2 coating increases the vortex penetration field by up to ~70 mT",
        "e.g.",
        "240 mT (200 nm MgB2 coated Nb) vs. 170 mT (uncoated Nb) at 2.8 K (lowest measurement temperature) with the trend of increasing as temperature goes down. This is consistent with recent theoretical development saying that the increase is possible even without an insulation layer",
        "which makes the coating easier. In this talk",
        "the thickness dependence of the rise and comparison with theory will be shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/tuba06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/tuba06.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/tuba06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-TUBA06",
      "page_number": "512",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBA07",
      "title": "Theory of Multilayer Coating for Proof-of-Concept Experiments",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "Structures of alternating layers of superconducting (SC) and insulating layers formed on a bulk SC are actively discussed these years",
        "because of their great possibility in realizing a high-field and high-Q SCRF cavity. In 2013",
        "theoretical studies of an ideal system with a single SC layer and a single insulator layer formed on a bulk SC were carried out",
        "by which appropriate combinations of materials and optimum thicknesses of SC and insulator layers that can enhance field limit were revealed. A more realistic model with nano-scale surface defects on the SC layer was also studied in 2014. As of this year",
        "a sample-experiment-oriented theoretical study is in progress towards proof-of-concept experiments. Theories are becoming realistic every year. In this talk",
        "I will review progresses after 2013 and provide theoretical equipages to tackle experiments of the multilayer coating(*).",
        "*A.Gurevich",
        "Appl. Phys. Lett.88",
        "012511(2006); T.Kubo et al.",
        "Appl. Phys. Lett.104",
        "032603(2014); T.Kubo",
        "Prog. Theor. Exp.Phys.2015",
        "063G01(2015); T.Kubo",
        "Prog. Theor. Exp.Phys.2015",
        "073G01(2015)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/tuba07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/tuba07.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/tuba07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-TUBA07",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUBA08",
      "title": "Growth and Characterization of Multi-Layer NbTiN Films",
      "authors": [
        "A-M. Valente-Feliciano",
        "G.V. Eremeev",
        "C.E. Reece",
        "J.K. Spradlin",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "M.C. Burton",
        "R.A. Lukaszew",
        "The College of William and Mary",
        "Williamsburg",
        "Virginia",
        "USA",
        "Significant theoretical interest has stimulated efforts to grow and characterize thin multi-layer superconductor/insulator/superconductor structures for their potential capability of supporting otherwise inaccessible surface magnetic fields in SRF cavities. The technological challenges include realization of high quality superconductors with sharp",
        "clean",
        "transition to high quality dielectric materials and back to superconductor",
        "with careful thickness control of each layer. Choosing NbTiN as the first candidate material",
        "we have developed the tools and techniques that produce such SIS film structures and have begun their characterization. Using DC magnetron sputtering and HiPIMS",
        "NbTiN and AlN can be deposited with nominal superconducting and dielectric parameters. Hc1 enhancement is observed for NbTiN layers with a Tc of 16.9 K for a thickness less than 150 nm. The optimization of the thickness of each type of layer to reach optimum SRF performance is underway. This talk describes this work and the rf performance characteristics observed to date."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/tuba08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/tuba08.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/tuba08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-TUBA08",
      "page_number": "516",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 8,
  "scrape_time": "2025-10-11 03:55:25"
}