{
  "session_info": {
    "id": "WEPA",
    "name": "WEPA - Wednesday Poster AM Session A",
    "url": "https://proceedings.jacow.org/medsi2020/html/wepa.htm"
  },
  "papers": [
    {
      "paper_id": "WEPA03",
      "title": "Current Status of TPS XBPM System",
      "authors": [
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The blade type X-ray beam position monitor is operating in the TPS front end. After a complete calibration process",
        "the XBPM performed a high precision measurement for beam position monitor. This paper reports the current statuses of XBPMs in phase I TPS that discussed with the calibration method and the results after calibration. A long term record of photon beam stability will also be described in this paper.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPA05",
      "title": "Mechanical Aspects of the New Shutter Design at European XFEL",
      "authors": [
        "N. Kohlstrunk",
        "M. Di Felice",
        "M. Dommach",
        "D. La Civita",
        "H. Sinn",
        "M. Vannoni",
        "F. Yang",
        "EuXFEL",
        "Schenefeld",
        "Germany",
        "DESY",
        "Hamburg",
        "Germany",
        "The European XFEL is a research facility which started operation in September 2017 and generates ultrashort X-ray flashes for photon science experiments with an outstanding peak brilliance. To operate the facility at full performance",
        "an upgrade of the radiation safety system is needed. For this purpose nine Frontends and three Shutters have to be modified. This upgrade includes several mechanical changes like the replacement of the B4C absorber with a diamond and B4C absorber. Since also a new burn through monitor with a graphite block inside has to be installed in the absorber chamber the holder of the B4C has to be changed because of the space constraints in the chamber. This holder consists also of a special flexure plate fixed with springs and screws to allow a certain flexibility of the B4C. For attaching the CVDs to the absorber holder a special CVD clamp system has to be created to release the stress on the diamond and avoid their destruction."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa05.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA05",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "WEPA06",
      "title": "The Beamline Motor Control System of Taiwan Photon Source",
      "authors": [
        "C.F. Chang",
        "C.Y. Liu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Different experiments have different features",
        "so does the optical design; however",
        "all of them are necessary to be adjusted according to mechanism. For example",
        "adjusting mechanism of optical element is often based on stepper motor",
        "for stepper motor possesses high resolution ability",
        "which can adjust mechanism to precise location. This study illustrates how motor system of our Taiwan Photon Source integrates adjusting mechanisms of stepper motor on beamline. In addition",
        "the firmware of close-loop system is cooperated to further improve veracity of location."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa06.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA06",
      "page_number": "232",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA07",
      "title": "The Fizeau System Instrument at ALBA Optics Laboratory",
      "authors": [
        "L.R.M. Ribó",
        "D. Alloza",
        "C. Colldelrampresenter",
        "J. Nicolás",
        "I. Šics",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "The ALBA optics laboratory has recently acquired a new Zygo Verifire HD Fizeau interferometer. The instrument has been integrated into a positioning stage to allow stitching of long x-ray optical elements. The mechanical set up",
        "with four axes",
        "allows for automatic positioning and alignment of the interferometer aperture to the surface under test. The longitudinal movement allows for scan of X-ray mirrors up to 1500 m long. The positioning platform includes two angles",
        "roll and yaw",
        "and two translations",
        "vertical and longitudinal translations. The longitudinal translation is a custom designed linear stage. The yaw rotation is based on a sine arm mechanism. The vertical and roll motions are combined in a single stage",
        "closely integrated around the main linear stage. The system reaches repeatabilities better than 1 µm or 1 µrad for all axes. The system is mounted on top of a vibration isolated bench in the clean room of the laboratory. The control software of the instrument allow direct control of every individual axis",
        "and allows selecting the center of rotation for both roll and yaw. The system includes inclinometers and autocollimators to control the relative orientation between the interferometer and the mirror under test. The system is integrated to the software of the interferometer",
        "and includes features for automatic alignment of the interferometer to the mirror",
        "or for automatic stitching acquisition",
        "with selectable parameters. The system allows for full three-dimensional characterization of the optical surface of mirrors and gratings",
        "and provides height map reconstructions with accuracy in the order of 1 nm",
        "for flat or curved surfaces with lengths up to 1500 mm."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa07.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA07",
      "page_number": "235",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA08",
      "title": "Investigating of EBW Process Weldment Connections Stresses in ILSF 100 MHz Cavity by Simufact. Welding Software",
      "authors": [
        "ILSF",
        "Tehran",
        "Iran",
        "A. Adamian",
        "N.B. Arab",
        "PPRC",
        "Tehran",
        "Iran",
        "The cavity is one of the main components of all accelerators",
        "which is used to increase the energy level of charged particles (electrons",
        "protons",
        "etc.). The cavities increase the energy level of the charged particle by providing a suitable electric field to accelerate the charged particle. Here",
        "information about electron beam welding analysis in 100 MHz cavities of ILSF design will be explained. According to studies performed in most accelerators in the world",
        "connections in cavities are made by various methods such as explosive welding",
        "brazing",
        "electron beam welding",
        "etc. Many articles on large cavities state that the connection of the side doors must be done by the electron beam welding process. However",
        "in the present paper",
        "the three-dimensional model of the cavity is imported into Simufact. Welding software after simplification and mesh process was done",
        "and then the heat source of electron beam welding and other welding factors such as beam power",
        "Gaussian distribution",
        "etc. are applied in the software. The purpose of this study is the number of residual stresses during the EBW process in the 100 MHz cavity of ILSF."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa08.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA08",
      "page_number": "239",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA09",
      "title": "A New Three-Signal 2D-Beam-Position-Monitor Based on a Segmented Ionization Chamber",
      "authors": [
        "M. Goerlitz",
        "W.A. Caliebe",
        "DESY",
        "Hamburg",
        "Germany",
        "*W.A. Caliebe",
        "V. Murzin",
        "A. Kalinko",
        "and M. Görlitz",
        "AIP Conf. Proc. 2054",
        "060031 (2019)."
      ],
      "institutions": [
        "At the DESY-beamline P64* a new three-signal beam position monitor (BPM) was constructed and tested in 2020. The BPM is based on the working-principle of an Ionization Chamber with splitted electrodes and a 120°-symmetry. The chamber is filled with an inert gas, which is ionized in presence of a beam. The gas can be changed, and the absorption can be adjusted in dependency of the X-ray-energy. The 2D-position is calculated out of three signals by a multiple-linear regression, where the position can be obtained by using a coordinate-transformation, similar to the Park-transformation, which is well-known in the field of drive control. Calibration factors have been evaluated in detail by using linear optimization algorithms including weighted residuals. The calculation is an inverse problem, which can be solved either by Simplex-algorithm or by Moore-Penrose-Pseudoinverse. The different results have been compared. Moreover, in order to validate the feasibility, calibration factors have been compared in regard to different beam sizes. Non-linearities are shown for a grid of 3x3 mm."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa09.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA09",
      "page_number": "243",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA10",
      "title": "Design and Ray-Tracing of the BEATS Beamline of SESAME",
      "authors": [
        "G. Iori",
        "M.M. Al Shehab",
        "M.A. Al-Najdawi",
        "A. Lausi",
        "SESAME",
        "Allan",
        "Jordan",
        "M. Altissimo",
        "I. Cudin",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "A. Kaprolat",
        "J. Reyes-Herrera",
        "P. Van Vaerenbergh",
        "ESRF",
        "Grenoble",
        "France",
        "NSRC SOLARIS",
        "Kraków",
        "Poland",
        "The BEAmline for Tomography at SESAME (BEATS) will operate an X-rayμtomography station providing service to scientists from archaeology",
        "cultural heritage",
        "medicine",
        "biology",
        "material science and engineering",
        "geology and environmental sciences*. BEATS will have a length of 45 m with a 3-pole-wiggler source (3 T peak magnetic field at 11 mm gap). Filtered white and monochromatic beam (8 keV to 50 keV",
        "dE/E: 2% to 3% using a double-multilayer-monochromator) modalities will be available. In this work we present the beamline optical design",
        "verified with simulation tools included in OASYS**. The calculated flux through 1 mm2 at the sample position will be as high as 8.5×109 Ph/s/mm2 in 0.1% of the source bandwidth",
        "for a maximum usable beam size of 70×15 mm2. Beam transverse coherence will be limited to below 1 µm by the horizontal size of the X-ray source (~2 mm FWHM). For phase contrast applications requiring enhanced coherence",
        "front end slits can be closed to 0.5 mm horizontally",
        "with a reduction of the available beam size and photon flux. The BEATS beamline will fulfill the needs of the tomography community of SESAME.",
        "* H2020 project BEATS",
        "Technical Design Report (July 2020). ** L. Rebuffi and M. Sanchez del Rio",
        "Proc. SPIE 10388: 130080S (2017)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa10.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA10",
      "page_number": "246",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA11",
      "title": "Design of Monochromatic and White Beam Fluorescence Screen Monitors for XAIRA Beamline at the ALBA Synchrotron",
      "authors": [
        "J.M. Álvarez",
        "C. Colldelram",
        "N González",
        "J. Juanhuix",
        "J. Nicolás",
        "I. Šics",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "XAIRA",
        "the hard X-ray microfocus beamline at ALBA",
        "includes three monochromatic fluorescence screens and one water cooled white beam monitor in its layout",
        "mounting respectively YAG:Ce and polycrystalline CVD diamond as scintillator screens. All monitors share the same design scheme",
        "with a re-entrant viewport for the visualization system that allows reducing the working distance",
        "as required for high magnification imaging. The scintillator screen assembly is held by the same CF63 flange",
        "making the whole system very compact and stable. The re-entrant flange is driven by a stepper motor actuated linear stage that positions or retracts the screen with respect to the beam path. To cope with high power density (18",
        "6 W/m2) on the white beam monitor 100 µm-thick diamond screen",
        "an InGa-based cooling system has been developed. The general design of the new fluorescence screens",
        "to be used also in other ALBA’s upcoming beamlines",
        "with particular detail on the water-cooled white beam monitor",
        "is described here."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa11.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA11",
      "page_number": "249",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA12",
      "title": "X-Ray Facility for the Characterization of the ATHENA Mirror Modules at the ALBA Synchrotron",
      "authors": [
        "A. Carballedo",
        "J.J. Casas",
        "C. Colldelram",
        "G. Cuní",
        "D. Heinis",
        "J. Marcos",
        "O. Matilla",
        "J. Nicolás",
        "A. Sánchez",
        "N. Valls Vidal",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "N. Barrière",
        "M.J. Collon",
        "G. Vacanti",
        "Cosine Measurement Systems",
        "Warmond",
        "The Netherlands",
        "M. Bavdaz",
        "I. Ferreira",
        "ESA-ESTEC",
        "Noordwijk",
        "The Netherlands",
        "E. Handick",
        "M. Krumrey",
        "P. Mueller",
        "PTB",
        "Berlin",
        "Germany",
        "MINERVA is a new X-ray facility under construction at the ALBA synchrotron specially designed to support the development of the ATHENA (Advanced Telescope for High Energy Astrophysics) mission. The beamline design is originally based on the monochromatic pencil beam XPBF 2.0 from the Physikalisch-Technische Bundesanstalt (PTB)",
        "at BESSY II already in use at this effect. MINERVA will host the necessary metrology equipment to integrate the stacks produced by the cosine company in a mirror module (MM) and characterize their optical performances. From the opto-mechanical point of view",
        "the beamline is made up of three main subsystems. First of all",
        "a water-cooled multilayer toroidal mirror based on a high precision mechanical goniometer",
        "then a sample manipulator constituted by a combination of linear stages and in-vacuum hexapod and finally an X-ray detector which trajectory follows a cylinder of about 12 m radius away from the MM. MINERVA is funded by the European Space Agency (ESA) and the Spanish Ministry of Science and Innovation. MINERVA is today under construction and will be completed to operate in 2022."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa12.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA12",
      "page_number": "252",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA13",
      "title": "Design of a High-Precision Lifting System for the HL-LHC Heavy Components in the Interaction Region",
      "authors": [
        "F. Micolon",
        "M. Sosin",
        "CERN",
        "Meyrin",
        "Switzerland",
        "Given the high radiation level and the tight alignment tolerances",
        "the HL-LHC interaction region components are designed to be realigned remotely using motorized supporting jacks",
        "as human interventions in these zones must be limited to the strict minimum. A position adjustment system will allow a vertical and horizontal displacement of each jack support by at least ±2.5 mm with a resolution of less than 10 µm. The weight of the supported elements",
        "up to 170 kN and transverse loads reaching 30 kN",
        "will have to be remotely moved by means of mechanical actuators. The system will be exposed to a cumulated radiation dose of up to 2 MGy during the 15 years of lifetime. To comply with these requirements",
        "an extensive de-sign effort has been initiated at CERN to study the possible system layouts. This includes the prototyping of various solutions",
        "studying subsystems through dedicated test setups and using simulations to obtain a clear under-standing of the mechanical principles at play. This paper reports on the work undertaken to design the high-precision lifting system",
        "the various mechanical analysis carried out",
        "and their main outcome. It reviews the proposed solutions and their expected alignment performance."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa13.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA13",
      "page_number": "255",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPA14",
      "title": "All Applications of the ALBA Skin Concept",
      "authors": [
        "A. Crisol",
        "A. Carballedo",
        "C. Colldelrampresenter",
        "N González",
        "J. Juanhuix",
        "J. Nicolás",
        "L.R.M. Ribó",
        "C. Ruget",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "ASCo",
        "Clayton",
        "Victoria",
        "Australia",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "FMB Oxford",
        "Oxford",
        "United Kingdom",
        "During the ALBA design phase",
        "the protein macromolecular protein crystallography beamline",
        "XALOC",
        "required several in-house developments. The major part of these designs was at the end station where the necessity of customization is always much higher. The most relevant of these instruments was the beam conditioning elements table [1]. This accurate stage",
        "which supports the diffractometer as well",
        "includes the four movements required to align the components to the nominal beam as well as position the diffractometer. This design compacts",
        "especially the vertical and pitch movements",
        "both in a single stage",
        "with a couple of stages for all four excursions. The solution maximise the stiffness and preserves at the same time the resolution close to 0.1µm while being able to withstand a half tone of payload. Thanks this compactness and performances this design concept",
        "the vertical and pitch combined stage",
        "was not only applied at XALOC for its diffractometer and detector table",
        "but it has been widely adapted at several ALBA beamlines: at NCD-SWEET [2] as a detector table",
        "a beam conditioning elements table [3] and sample table",
        "at MSPD beamline as the KB table",
        "at NOTOS beamline as metrology table",
        "and also at the new ESA MINERVA beamline [4] for their sample mirror modules positioning. Beamlines have not been the only beneficiaries of this design",
        "also different kind of instrumentation like an hall probe measuring bench [5]",
        "and even a stitching platform for the ALBA optics laboratory [6]. Moreover",
        "the concept has outreach ALBA and has been adopted also at other facilities worldwide",
        "synchrotrons and also scientific instrumentation suppliers around Europe. This poster presents most of the applications of the skin concept and their variations and main measured performances."
      ],
      "institutions": [],
      "abstract": "J.B. González Fernández",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa14.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA14",
      "page_number": "259",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA15",
      "title": "A Rapid Two Axis Scanner for Vacuum Environments With High EMP",
      "authors": [
        "C. Deiter",
        "M. Kitel",
        "J. Schulz",
        "EuXFEL",
        "Schenefeld",
        "Germany",
        "We present a two axis scanner for the rapid scanning of solid samples up to 10 Hz in vacuum under harsh EMP conditions. The samples are carried by a standardized sample frame system developed in the EUCALL project (2015-2018",
        "WP6 HIREP) and can be transferred without breaking the vacuum conditions of the interaction chamber. All electronic devices inside the chamber",
        "where the high-power laser shot and the FEL’s X-ray pulses hit the sample",
        "can be disconnected with 10 Hz. To ensure a continuous monitoring of the sample’s position",
        "the role of the encoder is taken over by an interferometer with only optical components inside the chamber. The linear stages are powered by high frequency piezo motors capable to do power cycles with up to 1 kHz. The scanner is controlled by the Beckhoff EtherCAT automation system with an in-house software framework.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa15.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA15",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPA16",
      "title": "Development and Applications of the White Beam Position Monitor for Bending Magnet Beamlines",
      "authors": [
        "C.Y. Chang",
        "C.F. Chang",
        "C.H. Chang",
        "S.H. Chang",
        "L.C. Chiang",
        "R. Lee",
        "B.Y. Liao",
        "C.Y. Liu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "We developed a white beam position detector to be applied in beamlines with bending magnets. By 0.1 mm light-receiving opening",
        "the beam is split and converted to a photocurrent intensity which can be used to detect the size and position of the beam is less than or equal to 50 mm",
        "and to locate the positions of the beamline components. This is a stop-beam measurement method",
        "so it cannot be used to monitor the beam in real time. The motorized stage of the detector has a range of motion up to ± 25 mm with position accuracy not more than 1 micrometer and vacuum capability not more than 5 × 10 -10 Torr",
        "which is compatible with ultra-high vacuum environments. In addition",
        "taking the thermal load 62.89 W of the TPS 02A beamline as an example",
        "the thermal deformation of the analog detector opening lead to a result that the measured value will have a maximum of 2 micrometer from the center of the beam. Finally",
        "and the whole system has been successfully applied in the TPS 02A beamline.all features are verified and the performance meets the requirements",
        "Besides the positioning tasks of Mask and Slits1 was completed and the position change of the light source was detected."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepa16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepa16.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepa16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPA16",
      "page_number": "263",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 13,
  "scrape_time": "2025-10-10 23:28:22"
}