{
  "session_info": {
    "id": "WEPG",
    "name": "WEPG - Wednesday Poster Session",
    "url": "https://proceedings.jacow.org/ibic2016/html/wepg.htm"
  },
  "papers": [
    {
      "paper_id": "WEPG01",
      "title": "Numerical Comparative Study of BPM Designs for the HESR at FAIR",
      "authors": [
        "A.J. Halama",
        "C. Böhme",
        "V. Kamerdzhiev",
        "F. Klehr",
        "S. Srinivasan",
        "FZJ",
        "Jülich",
        "Germany",
        "The institute of Nuclear Physics 4(IKP-4) of the Research Center Jülich (FZJ) is in charge of building and commissioning the High Energy Storage Ring (HESR) within the international Facility for Antiproton and Ion Research (FAIR) at Darmstadt. Simulations and numerical calculations were performed to characterize the BPM pickup design that is currently envisaged for the HESR",
        "i.e. a diagonally cut cylindrical pickup. The equivalent circuit has been studied with emphasis on capacitive cross coupling. Based on our findings",
        "performance increasing changes could be introduced. A prototype BPM was constructed and tested on a test bench. A comparison of results is presented. Another proposed design was characterized",
        "as a symmetric coupling behavior is expected. That is a symmetrical straight four-strip geometry. Additionally an extensive study was conducted to see effects due to manufacturing tolerances. Driven by curiosity an eight-strip design was considered",
        "which would allow for beam size measurements. First results for this configuration are shown. Used methodology",
        "tools and results of expected signal level and sensitivity distributions are presented as well."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG01",
      "page_number": "608",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG02",
      "title": "Commissioning of the Bunch-by-Bunch Transverse Feedback System for the TPS Storage Ring",
      "authors": [
        "Y.-S. Cheng",
        "K.T. Hsu",
        "K.H. Hu",
        "C.H. Huang",
        "C.Y. Liao",
        "NSRRC",
        "Hsinchu",
        "Taiwan"
      ],
      "institutions": [],
      "abstract": "TPS finish its Phase II commissioning in December of 2015 after installation of two superconducting RF cavities and ten sets of insertion devices in mid-2015. Storage beam current up to 520 mA was achieved. Intensive insertion devices commissioning were performed in March 2016 and delivery beam for beam-line commissioning and perform pilot experiments. One horizontal stripline kicker and two vertical stripline kickers were installed in May 2015. Bunch-by-bunch feedback system were commissioning in late 2015. Commercial available feedback processor was selected for the feedback system integration. Beam property and performance of the feedback system were measured. Results will summary in this report. reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG02",
      "page_number": "612",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG03",
      "title": "HOM Characterization for Beam Diagnostics at the European XFEL Injector",
      "authors": [
        "N. Baboi",
        "T. Hellert",
        "L. Shi",
        "T. Wamsat",
        "DESY",
        "Hamburg",
        "Germany",
        "R.M. Jones",
        "N.Y. Joshi",
        "L. Shi",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "University of Manchester",
        "Manchester",
        "United Kingdom",
        "Higher Order Modes (HOM) excited by bunched elec-tron beams in accelerating cavities carry information about the beam position and phase. This principle is used at the FLASH facility",
        "at DESY",
        "for beam position monitoring in 1.3 and 3.9 GHz cavities. Dipole modes",
        "which depend on the beam offset",
        "are used. Similar monitors are now under design for the European XFEL. In addition to beam position",
        "the beam phase with respect to the accelerating RF will be monitored using monopole modes from the first higher order monopole band. The HOM signals are available from two couplers installed on each cavity. Their monitoring will allow the on-line tracking of the phase stability over time",
        "and we anticipate that it will improve the stability of the facility. As part of the monitor designing",
        "the HOM spectra in the cavities of the 1.3 and 3.9 GHz cryo-modules installed in the European XFEL injector have been measured. This paper will present their dependence on the beam position. The variation in the modal distribution from cavity to cavity will be discussed. Based on the results",
        "initial phase measurements based on a fast oscilloscope have been made."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG03",
      "page_number": "616",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG05",
      "title": "Design of Stripline Beam Position Monitors for the ESS MEBT",
      "authors": [
        "S. Varnasseri",
        "I. Bustinduy",
        "A. Ortega",
        "I. Rueda",
        "A. Zugazaga",
        "ESS Bilbao",
        "Zamudio",
        "Spain",
        "R.A. Baron",
        "H. Hassanzadegan",
        "A. Jansson",
        "T.J. Shea",
        "ESS",
        "Lund",
        "Sweden",
        "There will be overall 8 Beam Position Monitors (BPM) installed in MEBT of ESS. Seven of them will be used for the measurement of beam position",
        "phase and intensity. One BPM will be used for the fast timing characterization of the chopped beam. The design is based on shortened stripline to accommodate the signal level for low velocity proton beam within MEBT read by electronics. Due to mechanical space limits",
        "all the BPMs are embedded inside quadrupoles; which requires special care on the magnetic properties of the materials within BPM sets and in particular the feedthroughs. The prototype electromagnetic and mechanical design is finished and its fabrication is underway. This paper gives an overview of the electromagnetic and mechanical design and related analysis including position signal sensitivity of the BPMs."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg05.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG05",
      "page_number": "620",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG06",
      "title": "Orbit Feedforward and Feedback Applications in the Taiwan Light Source",
      "authors": [
        "C.H. Kuo",
        "P.C. Chiu",
        "K.T. Hsu",
        "K.H. Hu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Taiwan Light Source (TLS) is a 1.5 GeV third-generation light source with circumference 120 meters. TLS is operated at 360 mA top-up injection mode. The storage ring is 6-fold symmetry with 6-meter straight sections for injection",
        "RF cavity",
        "and insertion devices. There are three undulators were installed in three straight sections to delivery VUV and soft X-ray for users. Beside there undulators",
        "a conventional wiggler (W200 installed at straight sections to provide hard X-ray to serve user. Working parameters of hard X-ray sources are fixed without cause problem on operation. However",
        "undulators should be changing its working parameters during user experiments performed. These undulator during its gap/phase changing will create orbit perturbation due to its field errors. Orbit feedback is main tool to keep orbit without change. However",
        "some correctors setting of the orbit feedback system are easy to saturation due to large perturbation come from U90. To keep functionality of the orbit feedback system working in good condition",
        "combines with orbit feedback and feed-forward is proposed and reported in this conference."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg06.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG06",
      "page_number": "623",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG07",
      "title": "A Heterogeneous FPGA/GPU Architecture for Real-Time Data Analysis and Fast Feedback Systems",
      "authors": [
        "M. Vogelgesang",
        "L.E. Ardila Perez",
        "M. Caselle",
        "S.A. Chilingaryan",
        "A. Kopmann",
        "L. Rotapresenter",
        "M. Weber",
        "KIT",
        "Eggenstein-Leopoldshafen",
        "Germany",
        "We propose a versatile and modular approach for a real-time data acquisition and evaluation system used for monitoring and feedback control in beam diagnostic and photon science experiments. Our hybrid architecture is based on an FPGA readout card* and a GPU for data processing. To increase throughput",
        "lower latencies and reduce overall system strain",
        "the FPGA write data directly in the GPU. After real-time data analysis the GPU writes back results either directly to the FPGA in case of fast feedback systems or to the CPU host system for storage. Communication and scheduling are handled transparently by our processing framework**. However",
        "users can customize and extend it with their own processing plugins. Although the system is designed for real-time purposes",
        "the modular approach also allows standalone usage for high-speed off-line analysis. We evaluated the performance of our solution measuring both processing times of data analysis algorithms used with beam instrumentation detectors as well as transfer times between FPGA and GPU. The latter suggests throughputs of up to 6.5 GB/s with latencies down to tens of microseconds",
        "thus making it suitable for fast feedback systems.",
        "* A PCIe DMA Architecture for Multi-Gigabyte Per Second Data Transmission",
        "10.1109/TNS.2015.2426877 ** A Scalable GPU-based Image Processing Framework for On-line Monitoring",
        "10.1109/HPCC.2012.116"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg07.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG07",
      "page_number": "626",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG08",
      "title": "Fast Orbit Feedback with Linux PREEMPT_RT",
      "authors": [
        "SLSA",
        "Clayton",
        "Australia",
        "The University of Melbourne",
        "Melbourne",
        "Victoria",
        "Australia",
        "LNLS",
        "Campinas",
        "Brazil",
        "The fast orbit feedback system in development at the Australian Synchrotron aims to improve the stability of the electron beam by reducing the impact of insertion devices and targeting orbit perturbations at the line frequency (50 Hz",
        "100 Hz and 300 Hz). The system is designed to have a unity gain at a frequency greater than 300 Hz with a simple PI controller with harmonic suppressors in parallel (as was done at Elettra). With most of the system in place (position aggregation",
        "power supplies and corrector coils) we decided to implement a PC based feedback system to test what has been installed as well as the effectiveness of the proposed control algorithms while the firmware for the FPGA based feedback processor is being developed. This paper will report on effectiveness of a feedback system built using a Linux Operating System with the PREEMPT patch running on an Intel CPU."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg08.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG08",
      "page_number": "630",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG09",
      "title": "Development of a Prototype Electro-Optic Beam Position Monitor at the CERN SPS",
      "authors": [
        "A. Arteche",
        "A. Bosco",
        "S.M. Gibsonpresenter",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "N. Chritin",
        "D. Draskovic",
        "T. Lefèvre",
        "T.E. Levens",
        "CERN",
        "Geneva",
        "Switzerland",
        "A novel electro-optic beam position monitor capable of rapidly (<50ps) monitoring transverse intra-bunch perturbations is under development for the HL-LHC project. The EO-BPM relies on the fast optical response of two pairs of electro-optic crystals",
        "whose birefringence is modified by the passing electric field of a 1ns proton bunch. Analytic models of the electric field are compared with electromagnetic simulations. A preliminary opto-mechanical design of the EO-BPM was manufactured and installed at the CERN SPS in 2016. The prototype is equipped with two pairs of 5mm cubic LiNbO3 crystals",
        "mounted in the horizontal and vertical planes. A polarized CW 780nm laser in the counting room transmits light via 160m of PM fibre to the SPS",
        "where delivery optics directs light through a pair of crystals in the accelerator vacuum. The input polarization state to the crystal can be remotely controlled. The modulated light after the crystal is analyzed",
        "fibre-coupled and recorded by a fast photodetector in the counting room. Following the recent installation",
        "we present the detailed setup and report the latest status on commissioning the device in-situ at the CERN SPS."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg09.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG09",
      "page_number": "634",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG10",
      "title": "Phase and Energy Stabilization System at the S-Dalinac",
      "authors": [
        "T. Bahlo",
        "C. Burandt",
        "L.E. Jürgensen",
        "T. Kürzeder",
        "N. Pietralla",
        "J. Wissmann",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "IKP",
        "Mainz",
        "Germany",
        "The Superconducting Darmstadt Linear Accelerator S‑DALINAC is a recirculating electron accelerator with a design energy of 130 MeV operating in cw. Before entering the 30 MeV main accelerator the low energetic electron beam passes both a normal-conducting injector beamline preparing the beam's 3 GHz time structure as well as a superconducting 10 MeV injector beamline for preacceleration. Since the superconducting injector accelerates on-crest while the main accelerator accelerates off-crest the beam phase is crucial for the efficiency of the acceleration process and the minimization of the energy spread. Due to thermal drifts of the normal-conducting injector cavities this injection phase varies by about 0.2 degree over a timescale of an hour. In order to compensate for these drifts",
        "a high level phase controller has been implemented. Additionally a low-energy scraper system has been installed between the injector and main linac in order to lock both the phase and the energy spread at the linac entrance. We will present the hardware for the phase controller",
        "the control algorithm and the scraper setup. A report on measurements showing the effect of both systems will be given."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg10.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG10",
      "page_number": "638",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG11",
      "title": "Operation of the Beam Position Monitor for the Spiral 2 Linac on the Test Bench of the RFQ",
      "authors": [
        "P. Ausset",
        "M. Ben Abdillah",
        "F. Fournier",
        "IPN",
        "Orsay",
        "France",
        "S.K. Bharade",
        "G. Joshi",
        "P.D. Motiwala",
        "BARC",
        "Trombay",
        "Mumbai",
        "India",
        "R. Ferdinand",
        "D.T. Touchard",
        "GANIL",
        "Caen",
        "France"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg11.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG11",
      "page_number": "642",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG12",
      "title": "A Versatile BPM Signal Processing System Based on the Xilinx Zynq SoC",
      "authors": [
        "R.L. Hulsart",
        "P. Cerniglia",
        "N.M. Day",
        "R.J. Michnoffpresenter",
        "Z. Sorrell",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A new BPM electronics module (V301) has been developed at BNL that uses the latest System on a Chip (SoC) technologies to provide a system with better performance and lower cost per module than before. The future of RHIC ion runs will include new RF conditions as well as a wider dynamic range in intensity. Plans for the use of electron beams",
        "both in ion cooling applications and a future electron-ion collider",
        "have also driven this architecture toward a highly configurable approach. The RF input section has been designed such that jumpers can be changed to allow a single board to provide ion or electron optimized analog filtering. These channels are sampled with four 14-bit 400MSPS A/D converters. The SoC's ARM processor allows a Linux OS to run directly on the module along with a controls system software interface. The FPGA is used to process samples from the ADCs and perform position calculations. A suite of peripherals including dual Ethernet ports",
        "uSD storage",
        "and an interface to the RHIC timing system are also included. A second revision board which includes ultra-low jitter ADC clock synthesis and distribution and improved power supplies is currently being commissioned."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg12.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG12",
      "page_number": "646",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG15",
      "title": "A FPGA Based Common Platform for",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg15.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG15",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG16",
      "title": "The SLAC LINAC LLRF Controls Upgrade",
      "authors": [
        "D. Van Winkle",
        "J.M. D'Ewart",
        "J.C. Frisch",
        "B. Hong",
        "U. Legat",
        "J.J. Olsen",
        "P. Seward",
        "J.A. Vásquez",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The low level RF control for the SLAC LINAC is being upgraded to provide improved performance and maintainability. RF control is through a high performance FPGA based DDS/DDC system built on the SLAC ATCA common platform. The klystron and modulator interlocks are being upgraded",
        "and the interlocks are being moved into a combination of PLC logic and a fast trip system. A new solid state sub-booster amplifier will eliminate the need for the 1960s vintage high RF phase shifters and attenuators."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg16.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG16",
      "page_number": "654",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG17",
      "title": "BATCH APPLICATIONS OF DIGITAL BPM PROCESSORS FROM THE SINAP",
      "authors": [
        "L.W. Lai",
        "F.Z. Chen",
        "Z.C. Chen",
        "Y.B. Leng",
        "Y.B. Yan",
        "W.M. Zhou",
        "SSRF",
        "Shanghai",
        "People's Republic of China",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "During the past several years a digital BPM (DBPM) processor has been developed at the SINAP. After continuous development and optimization",
        "the processor has been finalized and has come to batch application on the signal processing of cavity BPMs and stripline BPMs at the Dalian Coherent Light Source (DCLS) and the Shanghai Soft X-ray FEL (SXFEL). Tests have been done to evaluate the performances",
        "such as the noise level",
        "the SNR and the cross talk. The system resolution of the cavity and stripline BPMs can achieve 1um and 10um respectively. The test results on the Shanghai Deep-Ultra-Violet (SDUV) and the DCLS will be introduced."
      ],
      "institutions": [
        "Funding: Work supported by National Natural Science Foundation (No.11305253, 11575282)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg17.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG17",
      "page_number": "658",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG18",
      "title": "Cavity BPM System for DCLS",
      "authors": [
        "J. Chen",
        "J. Chen",
        "L.W. Lai",
        "Y.B. Yan",
        "L.Y. Yu",
        "R.X. Yuan",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "SSRF",
        "Shanghai",
        "People's Republic of China",
        "Dalian Coherent Light Source (DCLS) is a new FEL fa-cility under construction in China. Cavity beam position monitor (CBPM) is employed to measure the transverse position with a micron level resolution requirement in the undulator section. The design of cavity",
        "RF front end and data acquisition (DAQ) system will be introduced in this paper. The preliminary measurement result with beam at Shanghai Deep ultraviolet (SDUV) FEL facility will be addressed as well."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg18.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG18",
      "page_number": "661",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG19",
      "title": "Conceptual Design of LEReC Fast Machine Protection System",
      "authors": [
        "S. Seletskiy",
        "Z. Altinbas",
        "M.R. Costanzo",
        "A.V. Fedotov",
        "D.M. Gassner",
        "L.R. Hammons",
        "J. Hock",
        "P. Inacker",
        "J.P. Jamilkowski",
        "D. Kayran",
        "K. Mernick",
        "T.A. Miller",
        "M.G. Minty",
        "M.C. Paniccia",
        "I. Pinayev",
        "K.S. Smith",
        "P. Thieberger",
        "J.E. Tuozzolo",
        "W. Xu",
        "Z. Zhao",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The low energy RHIC Electron Cooling (LEReC) accelerator will be running with electron beams of up to 110 kW power with CW operation at 704MHz. Although electron energies are relatively low (< 2.6MeV)",
        "at several locations along the LEReC beamline",
        "where the electron beam has small (about 250 um RMS radius) design size",
        "it can potentially hit the vacuum chamber at a normal incident angle. The accelerator must be protected against such a catastrophic scenario by a dedicated machine protection system (MPS). Such an MPS shall be capable of interrupting the beam within a few tens of microseconds. In this paper we describe the current conceptual design of the LEReC MPS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg19.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG19",
      "page_number": "665",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG20",
      "title": "An Optical Fibre BLM System at the Australian Synchrotron Light Source",
      "authors": [
        "M. Kastriotou",
        "E.B. Holzer",
        "E. Nebot Del Busto",
        "CERN",
        "Geneva",
        "Switzerland",
        "The University of Melbourne",
        "Melbourne",
        "Victoria",
        "Australia",
        "M. Kastriotou",
        "E. Nebot Del Busto",
        "C.P. Welschpresenter",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "M. Kastriotou",
        "C.P. Welschpresenter",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Increasing demands on high energy accelerators are triggering R&D into improved beam loss monitors with a high sensitivity and dynamic range and the potential to efficiently protect the machine over its entire length. Optical fibre beam loss monitors (OBLMs) are based on the detection of Cherenkov radiation from high energy charged particles. Bearing the advantage of covering more than 100m of an accelerator with only one detector and being insensitive to X-rays",
        "OBLMs are ideal for electron machines. The Australian Synchrotron comprises an 100 MeV 15m long linac",
        "an 130m circumference booster synchrotron and a 3 GeV",
        "216m circumference electron storage ring. The entire facility was successfully covered with four OBLMs. This contribution summarises a variety of measurements performed with OBLMs at the Australian Synchrotron",
        "including beam loss measurements during the full booster and measurements of steady-state losses in the storage ring. Different photosensors",
        "namely Silicon Photo Multipliers (SiPM) and fast Photo Multiplier Tubes (PMTs) have been used and their respective performance limits are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg20.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG20",
      "page_number": "669",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG22",
      "title": "Relation between Signals of the Beam Loss Monitors and Residual Radiation in the J-PARC RCS",
      "authors": [
        "M. Yoshimoto",
        "H. Harada",
        "M. Kinsho",
        "K. Yamamoto",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "The most important issue in realizing such a MW-class high-power routine beam operation is to keep machine activations within a permissible level",
        "that is",
        "to preserve a better hands-on-maintenance environment. Thus",
        "a large fraction of our effort has been concentrated on reducing and managing beam losses. To validate the beam loss optimizations",
        "residual radiation measurement along the ring provide us with further information. By relating signals of the beam loss monitors with the measured distribution of the residual radiation",
        "achievements of the high power beam operation will be described. In this presentation",
        "we will report on the measurement results of residual radiation distribution along the ring together with the relation with the beam loss signals."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg22.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG22",
      "page_number": "673",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG23",
      "title": "Evaluating Beam-Loss Detectors for LCLS-2",
      "authors": [
        "A.S. Fisher",
        "R.C. Field",
        "L.Y. Nicolas",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The LCLS x-ray FEL occupies the third km of the 3-km SLAC linac",
        "which accelerates electrons in copper cavities pulsed at 120 Hz. For LCLS-2",
        "the first km of linac will be replaced with superconducting cavities driven by continuous RF at 1300 MHz. The normal-conducting photocathode gun will also use continuous RF",
        "at 186 MHz. The laser pulse rate will be variable up to 1 MHz. With a maximum beam power of 250 kW initially",
        "and eventually 1 MW",
        "the control of beam loss is critical for machine and personnel safety",
        "especially since losses can continue indefinitely in linacs and dark current emitted in the gun or cavities can be lost at any time. SLAC protection systems now depend on ionization chambers",
        "both local devices at expected loss sites and long gas-dielectric coaxial cables for distributed coverage. However",
        "their ion collection time is over 1 ms",
        "far slower than the beam repetition rate. We present simulations showing that with persistent losses",
        "the space charge of accumulated ions can null the electric field inside the detector",
        "blinding it to an increase in loss. We also report on tests comparing these detectors to faster alternatives."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg23.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG23",
      "page_number": "678",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG25",
      "title": "Beam Diagnostics for Charge and Position Measurements in ELI-NP GBS",
      "authors": [
        "G. Franzini",
        "F. Cioeta",
        "O. Coiro",
        "D. Pellegrini",
        "M. Serio",
        "A. Stella",
        "A. Variola",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "A. Mostacci",
        "S. Tocci",
        "University of Rome La Sapienza",
        "Rome",
        "Italy",
        "The advanced source of Gamma-ray photons to be built in Bucharest (Romania)",
        "as part of the ELI-NP European Research Infrastructure",
        "will generate photons by Compton back-scattering in the collision between a multi-bunch electron beam and a high intensity recirculated laser pulse. An S-Band photoinjector and the following C-band Linac at a maximum energy of 720MeV",
        "under construction by an European consortium (EurogammaS) led by INFN",
        "will operate at 100Hz repetition rate with trains of 32 electron bunches",
        "separated by 16ns and a 250pC nominal charge. The different BPMs and current transformers used to measure transverse beam position and charge along the LINAC are described. Design criteria",
        "production status and bench test results of the charge and position pickups are reported in the paper",
        "together with the related data acquisition systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg25.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG25",
      "page_number": "682",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG29",
      "title": "Commissioning Results of the TOP-IMPLART 27 MeV Proton Linear Accelerator",
      "authors": [
        "P. Nenzi",
        "A. Ampollini",
        "G. Bazzano",
        "L. Picardi",
        "M. Piccinini",
        "C. Ronsivalle",
        "V. Surrenti",
        "E. Trinca",
        "M. Vadrucci",
        "ENEA C.R. Frascati",
        "Frascati (Roma)",
        "Italy",
        "The results of a 27MeV proton LINAC commissioning are presented. The linac",
        "operating at ENEA Frascati Research Center",
        "consists of a 425MHz injector followed by a 3GHz booster. The injector is a commercial LINAC (ACCSYS-HITACHI PL7) composed by a duoplasmatron source with einzel lens",
        "a 3MeV RFQ and a 7MeV DTL. Wide injection current range (0-1.5mA) is obtained varying extraction and lens potentials. The booster is a sequence of 3 SCDTL (Side Coupled DTL) modules with output energies of 11.6",
        "18 and 27MeV. Each module requires less than 2MW peak power in 4us length pulses. All modules are powered by a single klystron. The output beam has been characterized at 10Hz PRF. Fast AC transformers",
        "Faraday cup and ionization chamber have been used for current/charge monitoring",
        "while energy has been measured using a novel detector based on LiF crystals. Systematic measurements have been done to investigate the sensitivity of output beam to machine operating parameters (SCDTL temperatures",
        "stability of injector and RF power) highlightning the existing correlations. The LINAC is part of a 150MeV protontherapy accelerator under development in the framework of the TOP-IMPLART Project."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg29.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG29",
      "page_number": "686",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG31",
      "title": "Upgrades to the LANSCE Isotope Production Facilities Beam Diagnostics",
      "authors": [
        "H.A. Watkins",
        "D. Baros",
        "D. Martinez",
        "L. Rybarcyk",
        "J.D. Sedillo",
        "R.A. Valicenti",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "The Los Alamos Neutron Science Center (LANSCE) is currently upgrading the beam diagnostics capability for the Isotope Production Facility (IPF) as part of an Accelerator Improvement Project (AIP). Improvements to measurements of: beam profile",
        "beam energy",
        "beam current and collimator charge are under development. Upgrades include high density harps",
        "emittance slits",
        "wire-scanners",
        "multi-segment adjustable collimator",
        "data acquisition electronics and motion control electronics. These devices will be installed and commissioned for the 2017 run cycle. Details of the hardware design and system development are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg31.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG31",
      "page_number": "690",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG32",
      "title": "First Heating with the European XFEL Laser Heater",
      "authors": [
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "F. Brinker",
        "M. Scholz",
        "DESY",
        "Hamburg",
        "Germany"
      ],
      "institutions": [
        "Funding: DESY and Swedish Research council"
      ],
      "abstract": "The European XFEL is a 3.4 km long free-electron laser (FEL) which will deliver radiation in the wavelength regime of 0.05 to 4.7 nm. To avoid problems with longitudinal microbunching instabilities a laser heater is implemented. It heats up the electron bunches which will improve the overall brightness level of the FEL. I report the commissioning steps undertaken and the first recorded heating outputs observed in the injector section.",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg32.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG32",
      "page_number": "694",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG33",
      "title": "The Measurement and Controlling System of Beam Current for Weak Current Accelerator",
      "authors": [
        "J.H. Yue",
        "Y. Li",
        "Z.J. Ma",
        "Y. Xie",
        "L. Yu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For some detectors' calibration",
        "a very weak electron current provided by accelerator is necessary. In order to control the beam current to the detector",
        "8 movable slits in which the position resolution of the stoppers is better than 5μm are installed along the accelerator. For the weak current measurement",
        "9 movable current monitors based on scintillator are installed along the beam line. These monitors can measure the very weak current",
        "even to several electrons. The monitors can be pulled away the beam axis when the electron beam goes to the downstream."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg33.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG33",
      "page_number": "697",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG34",
      "title": "Heavy Ion Beam Flux and In-situ Energy Measurements at High LET",
      "authors": [
        "S. Mitrofanov",
        "I.V. Kalagin",
        "V.A. Skuratov",
        "Yu.G. Teterev",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "United Rocket and Space Corporation",
        "Institute of Space Device Engineering",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The Russian Space Agency with the TL ISDE involvement has been utilizing ion beams from oxygen up to bismuth delivered from cyclotrons of the FLNR JINR accelerator complex for the SEE testing during last seven years. The detailed overview of the diagnostic set-up features used for low intensity ion beam parameters evaluation and control during the corresponding experiments is presented. Special attention is paid to measurements of ion flux and energy at high LET levels and evaluation of ion beam uniformity over large (200x200 mm) irradiating areas. The online non-invasive (in-situ) time of flight technique designed for low intensity ion beam energy measurements based on scintillation detectors is considered in details. The system has been successfully commissioned and is used routinely in the SEE testing experiments.",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg34.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG34",
      "page_number": "700",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG35",
      "title": "Design of an Electron Cloud Detector in a Quadrupole Magnet at CesrTA",
      "authors": [
        "J.P. Sikora",
        "S.T. Barrettpresenter",
        "M.G. Billing",
        "J.A. Crittenden",
        "K.A. Jones",
        "Y. Li",
        "T.I. O'Connell",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA"
      ],
      "institutions": [
        "Funding: This work is supported by the US National Science Foundation PHY-0734867, PHY-1002467 and the US Department of Energy DE-FC02-08ER41538, DE-SC0006505."
      ],
      "abstract": "We have designed a detector that measures the electron cloud density in a quadrupole magnet using two independent techniques. Stripline electrodes collect electrons that would otherwise impact the beam-pipe surface. The striplines are placed behind an array of small holes in the beam-pipe wall in order to shield them from the beam-induced electromagnetic pulse. There are three striplines placed near one of the pole tips so that they cover a roughly 0.43 radian azimuth. The beam-pipe chamber has also been designed so that microwave measurements of the electron cloud density can be performed. Beam position monitor buttons have been included for excitation and reception of microwaves and the chamber has been designed so that the resonant microwaves are confined to be within the 56 cm length of the quadrupole field. This paper provides some details of the design including CST Microwave Studio time domain simulation of the stripline detectors and eigenmode simulation of the resonant chamber. The detector is installed in the Cornell Electron Storage Ring and is part of the test accelerator program for the study of electron cloud using electron and positron beams from 2 to 5 GeV.",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg35.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG35",
      "page_number": "704",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG37",
      "title": "Nondestructive High-Accuracy Charge Measurement of the Pulses of a 27 MeV Electron Beam from a Linear Accelerator",
      "authors": [
        "A. Schüller",
        "J. Illemann",
        "R.-P. Kapsch",
        "C. Makowski",
        "F. Renner",
        "PTB",
        "Braunschweig",
        "Germany",
        "This work presents a description of measuring devices and procedures in order to enable the nondestructive (non-intercepting) absolute measurement of the charge of individual beam pulses (macro-pulses) from an electron linear accelerator with high accuracy",
        "i.e. with a measurement uncertainty <0.1%. In particular",
        "we demonstrate the readout and calibration of a Bergoz integrating current transformer which is frequently applied at many different types of accelerators as a beam intensity monitor. The current transformer signal is calibrated against a custom-made compact Faraday cup with a high degree of collection efficiency for electron beams in the energy range of 6 MeV to 50 MeV (99.2 % at 27 MeV)",
        "which is well known from measurements and Monte Carlo calculations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg37_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg37.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg37_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG37",
      "page_number": "708",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG39",
      "title": "Measurement Uncertainty Assessments of the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg39_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg39.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg39_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG39",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG40",
      "title": "Optimization Studies for an Advanced Cryogenic Current Comparator (CCC) System for FAIR",
      "authors": [
        "T. Sieber",
        "P. Kowina",
        "M. Schwickert",
        "T. Stöhlker",
        "GSI",
        "Darmstadt",
        "Germany",
        "J. Golm",
        "T. Stöhlker",
        "HIJ",
        "Jena",
        "Germany",
        "F. Kurian",
        "T. Stöhlker",
        "IOQ",
        "Jena",
        "Germany",
        "R. Neubert",
        "V. Tympel",
        "FSU Jena",
        "Jena",
        "Germany",
        "After successful tests with the GSI-CCC prototype",
        "measuring beam intensities down to 2nA at a bandwidth of 10 kHz",
        "a new advanced Cryogenic Current Comparator system with extended geometry (CCC-XD) is under development. This system will be installed in the upcoming Cryring facility for further optimization",
        "beam diagnostics and as an additional instrument for physics experiments. After the test phase in Cryring it is foreseen to build four additional CCC units for FAIR",
        "where they will be installed in the HEBT lines and in the Collector Ring (CR). A universal cryostat has been designed to cope with the various boundary conditions at FAIR and at the same time to allow for uncomplicated access to the inner components. To realize this compact cryostat",
        "the size of the superconducting magnetic shielding has to be minimized as well",
        "without affecting its field attenuation properties. Hence detailed FEM simulations were performed to optimize the attenuation factor by variation of geometrical parameters of the shield. The beam tests results with the GSI-CCC prototype",
        "and the developments for FAIR",
        "as well as the results of simulation for magnetic shield optimization will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg40_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg40.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg40_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG40",
      "page_number": "715",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG41",
      "title": "Measurement of Coupling Impedances using a Goubau Line",
      "authors": [
        "F. Stulle",
        "J.F. Bergoz",
        "BERGOZ Instrumentation",
        "Saint Genis Pouilly",
        "France",
        "HZB",
        "Berlin",
        "Germany",
        "Longitudinal coupling impedances can be deduced from S-Parameter measurements performed on a Goubau Line. The Goubau Line",
        "also known as single wire line",
        "is a variant of the coaxial wire method. Both setups use a wire for mimicking the particle beam. Coaxial tapers at the wire ends adapt wave impedance to the 50ohm impedance of coaxial cables",
        "sources and receivers. But for guiding the electromagnetic wave",
        "the Goubau Line relies on the realistic boundary conditions imposed by an insulated wire instead of using a coaxial shield. Equations for the deduction of longitudinal coupling impedances are reviewed and applied to Goubau Line measurements. Goubau Line measurements and CST Studio simulations are compared",
        "showing good agreement."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg41_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg41.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg41_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG41",
      "page_number": "719",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG42",
      "title": "Energy and Longitudinal Bunch Measurements at the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg42_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg42.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg42_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG42",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG43",
      "title": "A Procedure for the Characterization of Corrector Magnets",
      "authors": [
        "S. Gayadeen",
        "M.J. Furseman",
        "G. Rehm",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "At Diamond Light source",
        "the main assumption for the Fast Orbit Feedback (FOFB) controller design is that the corrector magnets all have the same dynamic response. In this paper",
        "a procedure to measure the frequency responses of the corrector magnets on the Diamond Storage Ring is presented and the magnet responses are measured and compared in order to assess whether this assumption is valid. The measurements are made by exciting a single corrector magnet with a sinusoidal input and measuring the resulting sinusoidal movement on the electron beam using electron Beam Position Monitors (eBPMs). The input excitation is varied from 10 Hz to 5 kHz using a 10 mA sine wave. The amplitude ratio and the phase difference between the input excitation and the beam position excitation are determined for each input frequency and the procedure is repeated for several magnets. Variations in both gain and phase across magnets are discussed in this paper and the effect of such variations on the performance of the FOFB controller performance is determined."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg43_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg43.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg43_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG43",
      "page_number": "728",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG44",
      "title": "Longitudinal Phase Space Measurement at the ELI-NP Compton Gamma Source",
      "authors": [
        "U. Sannio",
        "Benevento",
        "Italy",
        "D. Alesini",
        "G. Franzinipresenter",
        "C. Vaccarezza",
        "A. Variola",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "P. Arpaia",
        "A. Liccardo",
        "Naples University Federico II",
        "Science and Technology Pole",
        "Napoli",
        "Italy",
        "A. Giribono",
        "A. Mostacci",
        "L. Palumbo",
        "University of Rome La Sapienza",
        "Rome",
        "Italy",
        "INFN-Napoli",
        "Napoli",
        "Italy",
        "Virtual bunch length measurement can be carried out by means of ELEGANT code for tracking the bunch particles from RF deflector to the screen. The technique relies on the correlation between the bunch longitudinal coordinate and transverse coordinates induced through a RF deflector. Therefore",
        "the bunch length measurement can be carried out measuring the vertical spot size at the screen",
        "placed after the RF deflector. The deflecting voltage amplitude affects the resolution. Adding a dispersive element",
        "e.g. a magnetic dipole between RF deflector and the screen",
        "the full longitudinal phase space can be measured. In this paper",
        "we discuss some issues relevant for the electron linac of the Compton source at the Extreme Light Infrastructure - Nuclear Physics (ELI-NP)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg44_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg44.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg44_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG44",
      "page_number": "732",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG45",
      "title": "Present Status of the Laser Charge Exchange Test Using the 3-MeV Linac in J-PARC",
      "authors": [
        "H. Takei",
        "E. Chishiro",
        "K. Hirano",
        "Y. Kondo",
        "S.I. Meigo",
        "A. Miura",
        "T. Morishita",
        "H. Oguri",
        "K. Tsutsumi",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "The accelerator-driven system (ADS) is discussed as one of the efficient device to transmute long-lived nuclides. For the efficient transmutation of the minor actinide (MA)",
        "precise prediction of neutronic performance of ADS is indispensable. The Transmutation Physics Experimental Facility (TEF-P) aimed at obtaining experimental data for the accuracy improvement of neutronics evaluation of MA-loaded ADS. The critical assembly installed in TEF-P operates below 500 watt to prevent the excessive radio activation of assembly. For the separation of low power beam from J-PARC intense proton accelerator",
        "the meticulous low power beam extraction method from high power proton beam is required. The laser charge exchange method (LCE) is originally developed to measure the proton beam profile and can be applied to the beam separation device for TEF-P. The LCE device consists of bright YAG-laser and laser transport system with beam position controllers. We performed the stability tests for laser power and position of exposure by no proton beam condition. The further LCE tests using negative 3-MeV proton linac in J-PARC will be conducted. In this paper",
        "present status of LCE tests is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg45_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg45.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg45_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG45",
      "page_number": "736",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG46",
      "title": "KALYPSO: A Mfps Linear Array Detector for Visible to NIR Radiation",
      "authors": [
        "L. Rota",
        "B.M. Balzer",
        "M. Caselle",
        "A.-S. Müller",
        "M.J. Nasse",
        "G. Niehues",
        "P. Schönfeldt",
        "M. Weber",
        "KIT",
        "Eggenstein-Leopoldshafen",
        "Germany",
        "C. Gerth",
        "B. Steffen",
        "DESY",
        "Hamburg",
        "Germany",
        "N. Hiller",
        "A. Mozzanica",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "D.R. Makowski",
        "A. Mielczarek",
        "TUL-DMCS",
        "Łódź",
        "Poland",
        "The acquisition rate of commercially available line array detectors is a bottleneck for beam diagnostics at high-repetition rate machines like synchrotron lightsources or FELs with a quasi-continuous or macro-pulse operation. In order to remove this bottleneck we have developed KALYPSO",
        "an ultra-fast linear array detector operating at a frame-rate of up to 2.7 Mfps. The KALYPSO detector mounts InGaAs or Si linear array sensors to measure radiation in the near-infrared or visible spectrum. The FPGA-based read-out card can be connected to an external data acquisition system through a high-performance PCI-Express 3.0 data-link",
        "allowing continuous data taking and real-time data analysis. The detector is fully synchronized with the timing system of the accelerator and other diagnostic instruments. The detector is currently installed at several accelerators: ANKA",
        "the European XFEL and TELBE. We present the detector and the results obtained with Electro-Optical Spectral Decoding (EOSD) setups."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg46_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg46.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg46_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG46",
      "page_number": "740",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG47",
      "title": "Progress on the PITZ TDS",
      "authors": [
        "H. Huck",
        "P. Boonpornprasert",
        "L. Jachmann",
        "W. Köhler",
        "M. Krasilnikov",
        "A. Oppelt",
        "F. Stephan",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "L.V. Kravchuk",
        "V.V. Paramonov",
        "A.A. Zavadtsev",
        "RAS/INR",
        "Moscow",
        "Russia",
        "Chiang Mai University",
        "Chiang Mai",
        "Thailand",
        "A transverse deflecting system (TDS) is under commissioning at the Photo Injector Test Facility at DESY",
        "Zeuthen site (PITZ). The structure was designed and manufactured by the Institute for Nuclear Research (INR RAS",
        "Moscow",
        "Russia) as prototype for the TDS in the injector part of the European XFEL. Last year the deflection voltage was limited for safety reasons",
        "but after thorough investigations of the waveguide system we are now able to operate the cavity close to design specifications. The PITZ TDS streaks the electron beam vertically",
        "allowing measurements of the longitudinal bunch profile",
        "and",
        "in combination with a subsequent horizontal bending magnet",
        "also of the longitudinal phase space and slice energy spread. Furthermore",
        "several quadrupole magnets and screen stations can be employed for slice emittance measurements using the TDS. This paper describes the progress in commissioning of the hardware",
        "measurement techniques and simulations",
        "and outlines the prospects of reliable slice emittance measurements at 20 MeV/c",
        "where space charge forces complicate the determination of transfer matrices."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg47_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg47.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg47_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG47",
      "page_number": "744",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG48",
      "title": "A THz Driven Transverse Deflector for Femtosecond Longitudinal Profile Diagnostics",
      "authors": [
        "S.P. Jamison",
        "E.W. Snedden",
        "D.A. Walsh",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "M.J. Cliffe",
        "D.M. Graham",
        "D. Lake",
        "The University of Manchester",
        "The Photon Science Institute",
        "Manchester",
        "United Kingdom",
        "Progress towards a THz-driven transverse deflecting longitudinal profile diagnostic is presented. The deflector is driven with sub-picosecond quasi-single cycle THz fields generated by non-linear optical rectification. To utilize the large deflection field strength of the source for longitudinal diagnostics it is necessary to maintain the single-cycle field profile of the THz pulse throughout the interaction with the relativistic beam. Our scheme allows for the octave spanning bandwidth of the single-cycle pulses to propagate without dispersion at subluminal velocities matched to co-propagating relativistic electrons",
        "by passing the pulse distortion and group-carrier walk-off limitations of dielectric loaded waveguide structure. The phase velocity is readily tuneable",
        "both above and below the speed of light in a vacuum",
        "and single-cycle propagation of deflecting fields at velocities down to 0.77c have been demonstrated."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg48_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg48.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg48_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG48",
      "page_number": "748",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG49",
      "title": "A High Resolution Single-Shot Longitudinal Profile Diagnostic Using Electro-Optic Transposition",
      "authors": [
        "D.A. Walsh",
        "S.P. Jamison",
        "E.W. Snedden",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "CERN",
        "Geneva",
        "Switzerland",
        "Electro-Optic Transposition (EOT) is the basis for an improved longitudinal bunch profile diagnostic we are developing in ASTeC as part of the CLIC UK research program. The scheme consists of transposing the Cou-lomb field profile of an electron bunch into the intensity envelope of an optical pulse via the mixing processes that occur between a CW laser probe and Coulomb field in an electro-optic material. This transposed optical pulse can then be amplified and characterised using robust laser techniques ' in this case chirped pulse optical parametric amplification and frequency resolved optical gating",
        "allowing the Coulomb field to be recovered. EOT is an improvement over existing techniques in terms of the achievable resolution which is limited by the EO material response itself",
        "reduced complexity of the laser system required since nanosecond rather than femtosecond lasers are used",
        "and insensitivity of the system to bunch-laser arrival time jitter due to using a nanosecond long probe. We present results showing the retrieval of a THz pulse (Coulomb field stand-in) which confirms the principle behind the EOT system."
      ],
      "institutions": [
        "Funding: This work was funded by CERN through contract KE1866/DG/CLIC and carried out at STFC Daresbury Laboratory."
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg49_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg49.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg49_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG49",
      "page_number": "752",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG50",
      "title": "Non-Invasive Bunch Length Diagnostics of Sub-Picosecond Beams",
      "authors": [
        "S.V. Kuzikov",
        "A.A. Vikharev",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "S.P. Antipov",
        "S.V. Kuzikov",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "UNN",
        "Nizhny Novgorod",
        "Russia",
        "We propose a non-invasive bunch length measurement system based on RF pickup interferometry. A device performs interferometry between two broadband wake signals generated by a single short particle bunch. The mentioned wakes are excited by two consequent small gaps in beam channel. A field pattern formed by interference of the mentioned two coherent wake signals is registered by means of detector arrays placed at outer side of beam channel. The detectors are assumed to be low-cost integrating detectors (pyro-detectors or bolometers) so that integration time is assumed to be much bigger than bunch length. Because RF signals come from gaps to any detector with different time delays which depend on particular detector coordinate",
        "the array allows to substitute measurements in time by measurements in space. Simulations with a 1 ps beam and a set of two 200 micron wide vacuum breaks separated by 0.5 mm were done using CST Particle Studio. These simulations show good accuracy. Moreover",
        "one can recover the detailed temporal structure of the measured pulse using a new developed synthesis procedure."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg50_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg50.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg50_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG50",
      "page_number": "756",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG51",
      "title": "A Transverse Deflecting Structure for the Plasma Wakefield Accelerator Experiment, FLASHForward",
      "authors": [
        "R.T.P. D'Arcy",
        "V. Libov",
        "J. Osterhoff",
        "DESY",
        "Hamburg",
        "Germany",
        "The FLASHForward project at DESY is an innovative plasma-wakefield acceleration experiment",
        "aiming to accelerate electron beams to GeV energies over a few centimeters of ionized gas. These accelerated beams must be of sufficient quality to be used in a free-electron laser; achievable only through rigorous analysis of both the drive- and accelerated-beam's longitudinal phase space. The pulse duration of these accelerated beams is typically in the few femtosecond range",
        "and thus difficult to resolve with traditional diagnostic methods. In order to longitudinally resolve these very short bunch-lengths",
        "it is necessary to utilize the properties of a transverse RF deflector (operating in the hybrid electromagnetic mode",
        "HEM11)",
        "which provides a relation between longitudinal and transverse co-ordinates. It is proposed that this type of device",
        "commonly known as a Transverse Deflecting Structure (TDS) due to its 'streaking' in the transverse plane",
        "will be introduced to the FLASHForward beamline in order to perform these single-shot longitudinal phase space measurements. The initial investigations into the realization of this diagnostic tool are outlined."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg51_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg51.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg51_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG51",
      "page_number": "759",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG52",
      "title": "Laser Arrival Time Measurement and Correction for the SwissFEL Lasers",
      "authors": [
        "M.C. Divall",
        "C.P. Hauri",
        "S. Hunziker",
        "A. Romann",
        "A. Trisorio",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "SwissFEL will ultimately produce sub-fs X-ray pulses. Both the photo-injector laser and the pump lasers used for the experimental end stations therefore have tight requirements for relative arrival time to the machine and the X-rays. The gun laser oscillator delivers excellent jitter performance at ~20fs integrated from 10Hz-10MHz. The Yb:CaF2 regenerative amplifier",
        "with an over 1km total propagation path",
        "calls for active control of the laser arrival time. This is achieved by balanced cross-correlation against the oscillator pulses and a translation stage before amplification. The experimental laser",
        "based on Ti:sapphire laser technology will use a spectrally resolved cross-correlator to determine relative jitter between the optical reference and the laser",
        "with fs resolution. To be able to perform fs resolution pump-probe measurements the laser has to be timed with the X-rays with <10fs accuracy. These systems will be integrated into the machine timing and complemented by electron bunch and X-ray timing tools. Here we present the overall concept and the first results obtained on the existing laser systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg52_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg52.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg52_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG52",
      "page_number": "763",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG53",
      "title": "Unambiguous Electromagnetic Pulse Retrieval Through Frequency Mixing Interference in Frequency Resolved Optical Gating",
      "authors": [
        "E.W. Snedden",
        "S.P. Jamison",
        "D.A. Walsh",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The University of Manchester",
        "The Photon Science Institute",
        "Manchester",
        "United Kingdom",
        "We demonstrate a method for full and unambiguous temporal characterization of few-cycle electromagnetic pulses",
        "including retrieval of the carrier envelope phase (CEP)",
        "in which the interference between non-linear frequency mixing components is spectrally resolved using Frequency Resolved Optical Gating (FROG). We term this process Real-Domain FROG (ReD-FROG) and demonstrate its capabilities through the complete measurement of the temporal profile of a single-cycle THz pulse. When applied at THz frequencies ReD-FROG overcomes the bandwidth limitations relating probe and test pulses in Electro-Optic (EO) sampling. The approach can however be extended generally to any frequency range and we provide a conceptual demonstration of the CEP retrieval of few-cycle optical field."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg53_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg53.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg53_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG53",
      "page_number": "767",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG54",
      "title": "Bunch Shape Measurements at the National Superconducting Cyclotron Laboratory ReAccelerator (ReA3)",
      "authors": [
        "R. Shane",
        "S.M. Lidia",
        "Z. Liu",
        "S. Nash",
        "A.C.C. Villari",
        "O. Yair",
        "FRIB",
        "East Lansing",
        "USA",
        "The longitudinal bunch shape of a reaccelerated heavy-ion beam at the National Superconducting Cyclo-tron Laboratory's (NSCL) ReA3 beamline was measured using an Ostrumov-type bunch-shape monitor. The phase of the last accelerating cavity was varied to change the bunch length",
        "while the energy was kept constant by adjusting the amplitude of the voltage on the cavity. Two peaks were observed in the longitudinal projection of the bunch shape distribution. The widths of the two peaks did not vary much when the cavity phase was changed",
        "while the peak separation decreased to the point that the two peaks became unresolvable as the bunching was increased. The relative amplitudes of the two peaks was very sensitive to tuning parameters. This",
        "coupled with a lack of information about the transverse profile of the bunch",
        "complicated the analysis and made a simple width assignment difficult. Measurements were also made with an MCP timing grid for comparison. The general shape and trend of the two data sets were similar; however",
        "the widths measured by the timing grid were about 30-50% smaller."
      ],
      "institutions": [
        "Funding: This material is based upon work supported by the U.S. Department of Energy Office of Science under Cooperative Agreement DE-SC0000661, the State of Michigan and Michigan State University."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg54_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg54.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg54_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG54",
      "page_number": "771",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG55",
      "title": "Synchronization of ps Electron Bunches and fs Laser Pulses Using a Plasmonics-Enhanced Large-Area Photoconductive Detector",
      "authors": [
        "E.J. Curry",
        "M. Jarrahi",
        "P. Musumeci",
        "N.T. Yardimci",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "RadiaBeam",
        "Santa Monica",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "B.T. Jacobsonpresenter Temporal synchronization between short relativistic electron bunches and laser pulses at the ps and sub-ps level is required for accelerator applications like inverse Compton light sources. Photoconductive antennas with THz and sub-THz bandwidth which are gated by fs lasers provide this level of timing resolution. This paper describes the operating principals of the diagnostic along with bench-top experimental results with recently developed plasmonics-enhanced large-area devices. A vacuum chamber with robust electronic noise reduction has been designed for upcoming beam-based experiments. reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg55_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg55.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg55_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG55",
      "page_number": "774",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG56",
      "title": "Single-Shot THz Spectroscopy for the Characterization of Single-Bunch Bursting CSR",
      "authors": [
        "J. Raasch",
        "M. Arndt",
        "J. Hänisch",
        "K.S. Ilin",
        "K. Kuzmin",
        "A.-S. Müller",
        "A. Schmid",
        "M. Siegel",
        "J.L. Steinmann",
        "S. Wuensch",
        "KIT",
        "Karlsruhe",
        "Germany",
        "G. Cinque",
        "M. Frogley",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Karlsruhe Institute of Technology",
        "Eggenstein-Leopoldshafen",
        "Germany",
        "An integrated array of narrow-band high-Tc YBa2Cu3O7-x (YBCO) detectors embedded in broad-band readout was developed for the future use at synchrotron light sources as a single-shot terahertz (THz) spectrometer. The detection system consists of up to four thin-film YBCO nanobridges fed by planar double-slit antennas covering the frequency range from 140 GHz up to 1 THz. We present first results obtained at the ANKA storage ring and at Diamond Light Source during operation of two and four frequency-selective YBCO detectors",
        "respectively."
      ],
      "institutions": [
        "Funding: The work was supported by the BMBF (05K13VK4), the Helmholtz International Research School for Teratronics & the Karlsruhe School of Elementary Particle and Astroparticle Physics."
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg56_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg56.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg56_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG56",
      "page_number": "778",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG57",
      "title": "Single-Shot THz Spectrometer for Bunch Length Measurements",
      "authors": [
        "S.V. Kutsaev",
        "A.Y. Murokh",
        "M. Ruelaspresenter",
        "H.L. To",
        "RadiaBeam Systems",
        "Santa Monica",
        "California",
        "USA",
        "Logicware Inc",
        "New York",
        "USA",
        "We present a new diagnostics instrument designed to measure bunch length in RF particle accelerators. Typically",
        "scanning-type Michelson or Martin-Puplett interferometers are used to measure the coherent radiation from a short bunch. However",
        "they require averaging over several shots over several minutes",
        "thus being able to report only the average bunch length. We propose to measure the emitted coherent spectrum of a short bunch emission that contains the same spectral information as the bunch shape by means of single-shot spectrometry. In this paper we present design considerations",
        "and first experimental results obtained at FACET for the instrument that allows shot-to-shot measurement of the emitted spectrum."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg57_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg57.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg57_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG57",
      "page_number": "782",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG59",
      "title": "Thermal Simulations of Wire Profile Monitors in ISIS Extracted Proton Beamline 1",
      "authors": [
        "D.W. Posthuma de Boer",
        "A. Pertica",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Wire scanners and secondary emission (SEM) grids are used for measurements of transverse beam profile at the ISIS neutron and muon source. Silicon carbide-coated carbon fibre wires are used in profile monitors throughout the ISIS accelerator. One such SEM grid is currently installed close to the target in EPB2 and is intercepted by the 800 MeV proton beam at a repetition rate of 10 Hz. Future profile measurements will require another of these monitors to be installed close to the target in EPB1; intercepted with a repetition rate of 40 Hz. Wires intercepting the ion beam are heated due to the deposition of beam-energy. Thermal simulations for the higher repetition rate were performed using ANSYS and a numerical code. The numerical code was then expanded to include various beam",
        "wire and material properties. Assumptions for temperature dependent material emissivities and heat capacities were included in the simulation. Estimated temperatures due to the energy deposited by protons",
        "and approximate values of deposited energy from the expected neutron flux are presented. The effects on wire-temperature of various beam and wire parameters are also discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg59_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg59.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg59_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG59",
      "page_number": "785",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG61",
      "title": "Theory of X-Ray Transition Radiation from Graphene for Transition Radiation Detectors",
      "authors": [
        "A.A. Tishchenko",
        "A. Romaniouk",
        "D.Yu. Sergeeva",
        "M.N. Strikhanov",
        "MEPhI",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "We present the theory of transition radiation for monolayers in X-ray domain from the first principles and consider the pros and cons of using graphene-monolayer in transition radiation detectors. reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg61_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg61.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg61_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG61",
      "page_number": "788",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG62",
      "title": "Incoherent and Coherent Polarization Radiation as Instrument of the Transversal Beam Size Diagnostics",
      "authors": [
        "D.Yu. Sergeeva",
        "M.N. Strikhanov",
        "A.A. Tishchenko",
        "MEPhI",
        "Moscow",
        "Russia",
        "Polarization radiation",
        "which includes diffraction radiation (DR)",
        "transition radiation (TR)",
        "Smith-Purcell radiation",
        "and others",
        "can be a good instrument for beam diagnostics. All information about the beam size is contained in the so-called form-factor of the beam. The form-factor represents the sum of two parts corresponding to the coherent and incoherent radiation*. Contrary to the general opinion the incoherent part does not always equal unity*",
        "**. In this report we give theoretical description of the incoherent and coherent parts of the form-factor both for Gaussian and uniform distribution of the ultrarelativistic particles in the bunch*",
        "***. The theory constructed describes also the case of beam skimming the target",
        "which leads to mixing of DR and TR***. We show that the incoherent part depends on the transversal size of the beam",
        "and dependence differs for different distributions. The role of the incoherent part of the form-factor of the bunch for different parameters is discussed.",
        "* D.Yu. Sergeeva",
        "A.A. Tishchenko et al.",
        "NIM B (2013)  ** J.H. Brownell et al.",
        "PRE (1998); G. Doucas et al.",
        "PR STAB (2002) *** A.A. Tishchenko",
        "D.Yu. Sergeeva et al.",
        "Vacuum (2016)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg62_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg62.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg62_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG62",
      "page_number": "792",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG63",
      "title": "Performance Evaluation of Molybdenum Blades in an X-ray Pinhole Camera",
      "authors": [
        "L.M. Bobb",
        "A.F.D. Morgan",
        "G. Rehm",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "At Diamond Light Source transverse profile measurements of the 3 GeV electron beam are provided by x-ray pinhole cameras. From these beam size measurements and given knowledge of the lattice parameters the emittance",
        "coupling and energy spread are calculated. Traditionally",
        "tungsten blades are used to form the pinhole aperture due to the opacity of tungsten to x-rays in the keV spectral range. The physical properties of tungsten also make it difficult to work. To achieve the 25 micron x 25 micron aperture size required for high resolution measurements it is necessary to mount these tungsten blades in an assembly whereby the pinhole aperture size is defined by precisely machined shims. Here we propose to replace the tungsten blade and shim arrangement with machined molybdenum blades and evaluate the performance of the resulting imaging system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg63_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg63.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg63_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG63",
      "page_number": "795",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG66",
      "title": "Beam Induced Fluorescence Monitor R&D for the J-PARC Neutrino Beamline",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "C. Bronner",
        "M. Hartz",
        "Kavli IPMU",
        "Kashiwa",
        "Japan",
        "Proton beam monitoring is essential for the J-PARC neutrino beamline",
        "where neutrinos are produced by the collision of 30 GeV protons with a long carbon target. Along with continued upgrades to the J-PARC beam power",
        "from the current 420 kW to 1.3+ MW",
        "there is also a requirement for monitor upgrades. A Beam Induced Fluorescence monitor is under development",
        "which would continuously and non-destructively measure the proton beam profile spill-by-spill by measuring fluorescence light from proton interactions with gas injected into the beamline. Monitor design is constrained by the J-PARC neutrino beamline configuration",
        "where a major challenge will be getting sufficient signal to precisely reconstruct the proton beam profile. R&D for a pulsed gas injection system is under way",
        "where injected gas uniformity and vacuum pump lifetime are main concerns. Design of a light detection system is also under way",
        "where light transport away from the high radiation environment near the proton beamline",
        "as well as fast detection down to very low light levels",
        "are essential."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg66_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg66.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg66_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG66",
      "page_number": "799",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG67",
      "title": "Non-Invasive Beam Profile Measurement for High Intensity Electron Beams",
      "authors": [
        "T. Weilbach",
        "K. Aulenbacher",
        "M.W. Bruker",
        "HIM",
        "Mainz",
        "Germany",
        "IKP",
        "Mainz",
        "Germany",
        "Beam profile measurements of high intensity electron beams below 10 MeV",
        "e.g. in energy recovery linacs or magnetized high energy electron coolers",
        "have to fulfill special demands. Commonly used diagnostic tools like synchrotron radiation and scintillation screens are ineffective or not able to withstand the beam power without being damaged. Non-invasive methods with comparable resolution are needed. Hence",
        "a beam profile measurement system based on beam-induced fluorescence (BIF) was built. This quite simple system images the light generated by the interaction of the beam with the residual gas onto a PMT. A more elaborated system",
        "the Thomson Laser Scanner (TLS) - the non-relativistic version of the Laser Wire Scanner - is proposed as a method for non-invasive measurement of all phase space components",
        "especially in the injector and merger parts of an ERL. Since this measurement suffers from low count rates",
        "special attention has to be given to the background. Beam profile measurements with the BIF system will be presented as well as a comparison with YAG screen measurements. The recent status of the TLS system will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg67_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg67.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg67_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG67",
      "page_number": "803",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG68",
      "title": "An Investigation into the Behaviour of Residual Gas Ionisation Profile Monitors in the ISIS Extracted Beamline",
      "authors": [
        "C.C. Wilcox",
        "B. Jones",
        "A. Pertica",
        "R.E. Williamson",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Non-destructive beam profile measurements at the ISIS neutron source are performed using Multi-Channel Profile Monitors (MCPMs). These use residual gas ionisation within the beam pipe",
        "with the ions being guided to an array of 40 Channeltron electron multipliers by a high voltage drift field. Non-uniform transverse electric fields within these monitors are caused by the drift field and the beam's space charge. Longitudinally",
        "a saddle point located between the drift field plate and the opposing compensating field plate introduces extra complexity into the ion motion. To allow for detailed studies of this behaviour",
        "an MCPM has been placed in Extracted Proton Beamline 1 (EPB1) where the beam is well defined. Simulations of the profiles obtained by this monitor are performed using machine measurements",
        "CST EM Studio and a simple C++ particle tracking code. This paper describes the process used to simulate MCPM profiles along with a comparison of simulated and measured results. Trajectories of detected ions from their creation to the Channeltrons are discussed",
        "together with a study of Channeltron detection characteristics carried out in the ISIS diagnostics laboratory vacuum tank."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg68_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg68.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg68_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG68",
      "page_number": "807",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG69",
      "title": "Profile Measurement by the Ionization Profile Monitor with 0.2T Magnet System in J-PARC MR",
      "authors": [
        "K. Satou",
        "H. Kuboki",
        "T. Toyama",
        "J-PARC",
        "KEK & JAEA",
        "Ibaraki-ken",
        "Japan",
        "A nondestructive Ionization Profile Monitor (IPM) is widely used to measure transversal profile. At J-PARC Main Ring (MR)",
        "three IPM systems have been used not only to measure emittances but also to correct injection miss matchings. To measure injection 3GeV beam profiles",
        "the high external E field of +50kV/130mm at the maximum is used to guide ionized positive ions to a position sensitive detector; transversal kick force originating from space charge E field of circulating beam is a main error source which deteriorates profile. The strong B field is also used to compensate the kick force. To measure 30GeV bunched beam at the flat top on the fast extraction mode in good resolution",
        "the strong B field of about 0.2T is needed. One set of magnet system",
        "which consists of a C-type and two H-type magnets",
        "were developed and installed in one IPM system. The IPM chamber was inserted between the 2 poles of the C-type magnet. To make the line integral of B field along the beam axis zero",
        "the H-type magnets have the opposite field polarity to that of the C-type magnet and were installed on both sides of the C-type magnet. Details of the magnet system and its first trials will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg69_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg69.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg69_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG69",
      "page_number": "811",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG71",
      "title": "D Density Scans of a Supersonic Gas Jet for Beam Profile Monitoring",
      "authors": [
        "H.D. Zhang",
        "V. Tzoganis",
        "C.P. Welsch",
        "W. Widmann",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "V. Tzoganis",
        "C.P. Welsch",
        "W. Widmann",
        "H.D. Zhang",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "A beam profile monitor based on a supersonic gas jet was successfully tested at the Cockcroft Institute. This monitor can be used for a large variety of beams over a large energy range",
        "including high intensity/high energy beams with large destructive power which make the use of many commonly used diagnostics impossible",
        "and beams with a short life time which require minimum interference of the diagnostics. The achievable resolution of this type of monitor depends on the jet thickness and homogeneity. Detailed knowledge of the jet density profile is hence of high importance. In this contribution we present how a moveable vacuum gauge was successfully used to investigate the 3D density distribution of the jet. We compare the experimental data to results from simulations and discuss how the findings can help further improve of the overall jet design."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg71_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg71.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg71_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG71",
      "page_number": "815",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG73",
      "title": "A Hardware and Software Overview on the New BTF Transverse Profile Monitor",
      "authors": [
        "B. Buonomo",
        "D.G.C. Di Giulio",
        "L.G. Foggettapresenter",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "INFN-Roma",
        "Roma",
        "Italy",
        "In the last 11 years",
        "the Beam-Test Facility (BTF) of the DAΦNE accelerator complex",
        "in the Frascati laboratory",
        "has gained an important role in the EU infrastructures devoted to the development of particle detectors. The facility can provide runtime tuneable electrons and positrons beams in a range of different parameters: energy (up to 750 MeV for e- and 540 MeV for e+)",
        "charge ( up to 1010 e /bunch) and pulse length (1.4-40 ns). The bunch delivering rate is up to 49 Hz and the beam spot and divergence can be adjusted",
        "down to sub-mm sizes and 2 mrad",
        "in order to achieve user needs. In these paper we are going to describe the new implementation of the secondary BTF beam transverse monitor systems based on WIDEPIX FITPIX detectors",
        "operating in bus synchronization mode externally timed to BTF beams. Our software layout includes a data producer",
        "a live-data display consumer and a MEMCACHED caching server. This configuration offers to BTF users a vary fast approach to the transverse data using TCP/IP calls to MEMCACHED with an easy and fast software integration on users DAQ. The data packing permits also to avoid the needs of mixed (user vs BTF) hardware synchronization."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg73_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg73.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg73_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG73",
      "page_number": "818",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG74",
      "title": "Bridging the Gap; Updating LANSCE Digitizers",
      "authors": [
        "D. Baros",
        "J.D. Sedillo",
        "H.A. Watkins",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "The Los Alamos Neutron Science Center (LANSCE) is currently upgrading equipment that is used to digitize transverse beam profile measurements. Emittance measurements were originally digitized using legacy equipment",
        "known as RICE (Remote Indication and Control Equipment). This required 38 RICE modules distributed along the half-mile long accelerator simultaneously recording 4 channels each to populate the 76 data points needed to create a single emittance profile. The system now uses a National Instruments cRIO controller to digitize the entire profile in a single chassis. Details of the hardware selection and performance of the system for different timing structures are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg74_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg74.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg74_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG74",
      "page_number": "822",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG75",
      "title": "The Beam Profile Monitoring System for the CERN IRRAD Proton Facility",
      "authors": [
        "F. Ravotti",
        "B. Gkotse",
        "M. Glaser",
        "E. Matli",
        "G. Pezzullo",
        "CERN",
        "Geneva",
        "Switzerland",
        "K.K. Gan",
        "H. Kagan",
        "S. Smith",
        "J.D. Warner",
        "Ohio State University",
        "Columbus",
        "Ohio",
        "USA",
        "In High Energy Physics (HEP) experiments",
        "devices are required to withstand high radiation levels. As a result",
        "detectors and electronics sitting in the inner detector layers must be irradiated to determine their radiation tolerance. To perform these irradiations",
        "CERN built during LS1 a new irradiation facility in the East Area at the Proton Synchrotron (PS) accelerator. At this facility",
        "named IRRAD",
        "a high-intensity 24 GeV/c proton beam is used. During beam steering and irradiation",
        "the intensity and the transverse profile of the proton beam are monitored online. The IRRAD Beam Profile Monitor (BPM) uses a set of four 39-channel pixel detectors constructed using thin foil copper pads positioned on a flex circuit. When protons pass through the copper pads",
        "they induce a measurable current. To measure this current a new data acquisition system was designed as well as a new database and on-line display system. In this work",
        "we present the design and the architecture of the IRRAD BPM system",
        "some results on its performance with the proton beam",
        "as well as its planned upgrades",
        "including its utilization for monitoring irradiations with an intense 300MeV/c positive pion beam at PSI."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg75_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg75.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg75_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG75",
      "page_number": "825",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG76",
      "title": "Status of the Two-Dimensional Synchrotron Radiation Interferometer at PETRA III",
      "authors": [
        "A.I. Novokshonov",
        "A. Potylitsyn",
        "TPU",
        "Tomsk",
        "Russia",
        "G. Kubepresenter",
        "M. Pelzer",
        "G. Priebe",
        "DESY",
        "Hamburg",
        "Germany",
        "Synchrotron radiation based emittance diagnostics at modern 3rd generation light sources is mainly based on beam profile imaging in the X-ray region in order to overcome the resolution limit imposed by diffraction. A possibility to circumvent this limitation is to probe the spatial coherence with a double-slit interferometer in the optical spectral region [*]. The light source PETRA III at DESY is using this type of interferometer since several years in order to resolve vertical emittances of about 10 pm.rad. The device is set up behind a 30m long optical beamline",
        "connecting the accelerator tunnel and the optical hutch. In order to increase the measurement stability",
        "a much shorter optical beamline with reduced number of optical elements was recently commissioned. At the end of the beamline",
        "a two-dimensional interferometer was installed which allows to deduce transverse emittances in both planes simultaneously. This contribution summarizes the status of beamline and interferometer commissioning together with model calculations in order to investigate systematically the measurement accuracy.",
        "*T. Mitsuhashi",
        "\"Twelve Years of SR Monitor Development\"",
        "2004 Beam Instrumentation Workshop",
        "2014",
        "pp. 5-11."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg76_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg76.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg76_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG76",
      "page_number": "829",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG77",
      "title": "Sub-fs Resolution with the Enhanced Operation of the X-band Transverse Deflecting Cavity using an RF pulse Compression SLED Cavity",
      "authors": [
        "P. Krejcik",
        "G.B. Bowden",
        "S. Condamoor",
        "Y. Ding",
        "V.A. Dolgashev",
        "J.P. Eichner",
        "M.A. Franzi",
        "A.A. Haase",
        "J.R. Lewandowski",
        "T.J. Maxwell",
        "S.G. Tantawi",
        "J.W. Wang",
        "L. Xiao",
        "C. Xu",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The successful operation of the x-band transverse deflecting cavity (XTCAV) installed downstream of the LCLS undulator has been further enhanced by the recent addition of an RF pulse compression \"SLED\" cavity that doubles the temporal resolving power of this powerful diagnostic system for measurement of the longitudinal profile of both the electron bunch and the x-ray FEL pulse. RF pulse compression has allowed us to use the existing SLAC X-band klystron with nominal output power of 50 MW and extend the RF pulse length by a factor 4 to give us 4 times the peak power after compression. A new",
        "innovative SLED cavity was designed and built at SLAC to operate efficiently at X-band*. The elegant design uses a small spherical cavity combined with a polarizing mode coupler hybrid. We will report on the installation",
        "commissioning and beam measurements demonstrating the sub-femtosecond resolution of the XTCAV system.",
        "*J.W. Wang et al.",
        "\"R&D of a Super-compact SLED System at SLAC\"",
        "in Proc. 7th International Particle Accelerator Conference (IPAC'16)",
        "Busan",
        "Korea",
        "May 2016",
        "paper"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg77_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg77.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg77_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG77",
      "page_number": "833",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG78",
      "title": "BPM Based Optics Correction of the Solaris 1.5 GeV Storage Ring",
      "authors": [
        "A. Kisiel",
        "P.B. Borowiec",
        "P.P. Goryl",
        "M.B. Jaglarz",
        "M.P. Kopeć",
        "A.M. Marendziak",
        "S. Piela",
        "P.S. Sagalo",
        "M.J. Stankiewicz",
        "A.I. Wawrzyniak",
        "Solaris",
        "Kraków",
        "Poland",
        "The Solaris is a novel approach for the third generation synchrotron light sources. The machine consists of 600 MeV linear injector and 1.5 GeV storage ring based on 12 compact Double Bend Achromat (DBA) magnets designed in MAX-IV Laboratory in Sweden. After the commissioning phase of the Solaris storage ring the optimization phase has been started along with the commissioning of the first beamline. An essential part of the beam diagnostics and instrumentation system in the storage ring are Beam Position Monitors (BPMs) based on 36 quarter-wave button BPMs spread along the ring. Proper calibration allowed to measure and correct several beam parameters like closed orbit",
        "tune",
        "chromaticity",
        "dispersion and orbit response matrix. The results of the latest machine optimization including the orbit correction",
        "beam-based alignment and BPM phase advance will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg78_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg78.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg78_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG78",
      "page_number": "836",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPG79",
      "title": "Time-Resolved Measurement of Quadrupole Wakefields in Corrugated Structures",
      "authors": [
        "C. Lu",
        "T. Jiang",
        "L.B. Shi",
        "L. Zhao",
        "LLP",
        "Shanghai",
        "People's Republic of China",
        "F. Fu",
        "S. Liu",
        "D. Xiang",
        "P.F. Zhu",
        "Shanghai Jiao Tong University",
        "Shanghai",
        "People's Republic of China",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "Corrugated structures have recently been widely used for manipulating electron beam longitudinal phase space and for producing THz radiation. Here we report on time-resolved measurements of the quadrupole wakefields in planar corrugated structures. It is shown that while the time-dependent quadrupole wakefield produced by a planar corrugated structure causes significant growth in beam transverse emittance",
        "it can be effectively canceled with a second corrugated structure with orthogonal orientation. The strengths of the time-dependent quadrupole wakefields for various corrugated structure gaps are also measured and found to be in good agreement with theories. Our work should forward the applications of corrugated structures in many accelerator based scientific facilities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg79_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg79.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg79_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG79",
      "page_number": "840",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPG80",
      "title": "Optical Effects in High Resolution and High Dynamic Range Beam Imaging Systems",
      "authors": [
        "J. Wolfenden",
        "R.B. Fiorito",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "M. Bergamaschi",
        "R. Kieffer",
        "T. Lefèvre",
        "S. Mazzoni",
        "CERN",
        "Geneva",
        "Switzerland",
        "P. Karataev",
        "K.O. Kruchinin",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "Optical systems are used to transfer light in beam diagnostics for a variety of imaging applications. The effect of the point spread function (PSF) of these optical systems on the resulting measurements is often approximated or misunderstood. It is imperative that the optical PSF is independently characterised",
        "as this can severely impede the attainable resolution of a diagnostic measurement. A high quality laser and specially chosen optics have been used to generate an intense optical point source in order to accomplish such a characterisation. The point source was used to measure the PSFs of various electron-beam imaging systems. These systems incorporate a digital micro-mirror array",
        "which was used to produce very high (>105) dynamic range images. The PSF was measured at each intermediary image plane of the optical system; enabling the origin of any perturbations to the PSF to be isolated and potentially mitigated. One of the characterised systems has been used for optical transition radiation (OTR) measurements of an electron beam at KEK-ATF2 (Tsukuba",
        "Japan)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/wepg80_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/wepg80.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/wepg80_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEPG80",
      "page_number": "844",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 63,
  "scrape_time": "2025-10-10 17:53:15"
}