{
  "session_info": {
    "id": "MOOBA",
    "name": "MOOBA - Contributed Oral Presentations, Accelerator Systems",
    "url": "https://proceedings.jacow.org/PAC2013/html/mooba.htm"
  },
  "papers": [
    {
      "paper_id": "MOOBA1",
      "title": "ARIEL Electron Linac",
      "authors": [
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "The TRIUMF Advanced Rare Isotope Laboratory (ARIEL) phase I is funded since 2010 June by federal and BC provincial governments. ARIEL I comprises buildings and electron linac; the future phase II includes hot cells",
        "target stations",
        "mass separators and beam transport to ISAC experimental areas. The linac vault and He compressor building were completed 2012. The ARIEL targets building completion is 2013 Aug. With the exception of the 30 MeV accelerator cryomodule and second klystron and HV power supply",
        "the linac major procurements are complete. This paper reports highlights from preliminary equipment tests in the following systems: locally manufactured niobium 9-cell cavity",
        "300 keV electron gun",
        "4 K cryogenic plant and sub-atmospheric pumps",
        "270 kW c.w. klystron and 65 kV DC power supply. Status of the 10 MeV injector cryomodule assembly and beamlines construction will also be addressed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mooba1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mooba1.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mooba1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOOBA1",
      "page_number": "46",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOBA2",
      "title": "The RHIC Polarized Source Upgrade",
      "authors": [
        "A. Zelenski",
        "G. Atoian",
        "J.M. Fite",
        "D. Raparia",
        "J. Ritter",
        "D. Steski",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "V.I. Davydenko",
        "A.A. Ivanov",
        "A. Kolmogorov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "V.S. Klenov",
        "V. Zubets",
        "RAS/INR",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "A novel polarization technique had been successfully implemented in the RHIC polarized H− ion source upgrade to higher intensity and polarization for use in the RHIC polarization physics program at enhanced luminosity RHIC operation. In this technique a primary proton beam inside the high magnetic field solenoid is produced by charge-exchange ionization of the atomic hydrogen beam in the He-gas ionizer cell. Further proton polarization is produced in the process of polarized electron capture from the optically-pumped Rb vapour. Formation of the proton beam is produced by four-electrode spherical multi-aperture ion-optical system with geometrical focusing. Polarized beam intensity produced in the source exceeds 4.0 mA.Maximum polarization of 84% was measured at 0.3 mA beam intensity and 80% at 0.5 mA in 200 MeV polarimeter. This high beam intensity allowed reduction of the longitudinal and transverse beam emittances at injection to AGS to reduce polarization losses in AGS. The source reliably delivered polarized beam for 2013 run in RHIC at √s=510 GeV. This was a major contribution to the RHIC polarization increase to over 60 % for colliding beams.",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mooba2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mooba2.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mooba2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOOBA2",
      "page_number": "49",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 01:28:41"
}