{
  "session_info": {
    "id": "FRCOAAB",
    "name": "FRCOAAB - Experiment Control -2",
    "url": "https://proceedings.jacow.org/ICALEPCS2013/html/frcoaab.htm"
  },
  "papers": [
    {
      "paper_id": "FRCOAAB01",
      "title": "CSS Scan System",
      "authors": [
        "K.-U. Kasemir",
        "X.H. Chen",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "NSCL",
        "East Lansing",
        "Michigan",
        "USA",
        "Automation of beam line experiments requires more flexibility than the control of an accelerator. The sample environment devices to control as well as requirements for their operation can change daily. Tools that allow stable automation of an accelerator are not practical in such a dynamic environment. On the other hand",
        "falling back to generic scripts opens too much room for error. The Scan System offers an intermediate approach. Scans can be submitted in numerous ways",
        "from pre-configured operator interface panels",
        "graphical scan editors",
        "scripts",
        "the command line",
        "or a web interface. At the same time",
        "each scan is assembled from a well-defined set of scan commands",
        "each one with robust features like error checking",
        "time-out handling and read-back verification. Integrated into Control System Studio (CSS)",
        "scans can be monitored",
        "paused",
        "modified or aborted as needed. We present details of the implementation and first usage experience."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcoaab01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcoaab01.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcoaab01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOAAB01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCOAAB02",
      "title": "Karabo:  An Integrated Software Framework Combining Control, Data Management, and Scientific Computing Tasks",
      "authors": [
        "B.C. Heisen",
        "D. Boukhelef",
        "S.G. Esenov",
        "S. Hauf",
        "I. Kozlova",
        "L.G. Maia",
        "A. Parenti",
        "J. Szuba",
        "K. Weger",
        "K. Wrona",
        "C. Youngman",
        "XFEL. EU",
        "Hamburg",
        "Germany",
        "The expected very high data rates and volumes at the European XFEL demand an efficient concurrent approach of performing experiments. Data analysis must already start whilst data is still being acquired and initial analysis results must immediately be usable to re-adjust the current experiment setup. We have developed a software framework",
        "called Karabo",
        "which allows such a tight integration of these tasks. Karabo is in essence a pluggable",
        "distributed application management system. All Karabo applications (called “Devices”) have a standardized API for self-description/configuration",
        "program-flow organization (state machine)",
        "logging and communication. Central services exist for user management",
        "access control",
        "data logging",
        "configuration management etc. The design provides a very scalable but still maintainable system that at the same time can act as a fully-fledged control or a highly parallel distributed scientific workflow system. It allows simple integration and adaption to changing control requirements and the addition of new scientific analysis algorithms",
        "making them automatically and immediately available to experimentalists."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcoaab02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcoaab02.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcoaab02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOAAB02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCOAAB03",
      "title": "Experiment Control and Analysis for High-Resolution Tomography",
      "authors": [
        "N. Schwarz",
        "F. De Carlo",
        "A. Glowacki",
        "J.P. Hammonds",
        "F. Khan",
        "K. Yue",
        "ANL",
        "Argonne",
        "USA",
        "X-ray Computed Tomography (XCT) is a powerful technique for imaging 3D structures at the micro- and nano-levels. Recent upgrades to tomography beamlines at the APS have enabled imaging at resolutions up to 20 nm at increased pixel counts and speeds. As detector resolution and speed increase",
        "the amount of data that must be transferred and analyzed also increases. This coupled with growing experiment complexity drives the need for software to automate data acquisition and processing. We present an experiment control and data processing system for tomography beamlines that helps address this concern. The software",
        "written in C++ using Qt",
        "interfaces with EPICS for beamline control and provides live and offline data viewing",
        "basic image manipulation features",
        "and scan sequencing that coordinates EPICS-enabled apparatus. Post acquisition",
        "the software triggers a workflow pipeline",
        "written using ActiveMQ",
        "that transfers data from the detector computer to an analysis computer",
        "and launches a reconstruction process. Experiment metadata and provenance information is stored along with raw and analyzed data in a single HDF5 file."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcoaab03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcoaab03.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcoaab03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOAAB03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCOAAB04",
      "title": "Data Driven Campaign Management at the National Ignition Facility",
      "authors": [
        "D.E. Speck",
        "B.A. Conrad",
        "S.R. Hahn",
        "P.D. Reisdorf",
        "S.M. Reisdorf",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "The Campaign Management Tool Suite (CMT) provides tools for establishing the experimental goals",
        "achieving reviews and approvals",
        "and ensuring readiness for a NIF experiment. Over the last 2 years",
        "CMT has significantly increased the number of diagnostics that supports to around 50. Meeting this ever increasing demand for new functionality has resulted in a design whereby more and more of the functionality can be specified in data rather than coded directly in Java. To do this support tools have been written that manage various aspects of the data and to also handle potential inconsistencies that can arise from a data driven paradigm. For example; drop down menus are specified in the Part and Lists Manager",
        "the Shot Setup reports that lists the configurations for diagnostics are specified in the database",
        "the review tool Approval Manager has a rules engine that can be changed without a software deployment",
        "various template managers are used to provide predefined entry of hundreds parameters and finally a stale data tool validates that experiments contain valid data items. The trade-offs",
        "benefits and issues of adapting and implementing this data driven philosophy will be presented."
      ],
      "institutions": [
        "Funding: * This work performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344. #LLNL-ABS-633255"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcoaab04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcoaab04.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcoaab04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOAAB04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCOAAB05",
      "title": "JOGL Live Rendering Techniques in Data Acquisition Systems",
      "authors": [
        "C. Cocho",
        "F. Cecillon",
        "A. Elaazzouzi",
        "Y. Le Goc",
        "J. Locatelli",
        "P. Mutti",
        "H. Ortiz",
        "J. Ratel",
        "ILL",
        "Grenoble",
        "France",
        "One of the major challenges in instrument control is to provide a fast and scientifically correct representation of the data collected by the detector through the data acquisition system. Despite the availability nowadays of a large number of excellent libraries for off-line data plotting",
        "the real-time 2D and 3D data rendering still suffers of performance issues related namely to the amount of information to be displayed. The current paper describes new methods of image generation (rendering) based on JOGL library used for data acquisition at the Institut Laue-Langevin (ILL) on instruments that require either high image resolution or large number of images rendered at the same time. These new methods involve the definition of data buffers and the usage of the GPU memory",
        "technique known as Vertex Buffer Object (VBO). Implementation of different modes of rendering",
        "on-screen and off-screen",
        "will be also detailed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcoaab05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcoaab05.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcoaab05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOAAB05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCOAAB06",
      "title": "A Common Software Framework for FEL Data Acquisition and Experiment Management at FERMI",
      "authors": [
        "R. Borghes",
        "V. Chenda",
        "A. Curri",
        "G. Kourousias",
        "M. Lonza",
        "M. Prica",
        "M. Pugliese",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom"
      ],
      "institutions": [
        "Funding: Work supported in part by the Italian Ministry of University and Research under grants FIRB-"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcoaab06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcoaab06.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcoaab06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOAAB06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCOAAB07",
      "title": "Operational Experience with the ALICE Detector Control System",
      "authors": [
        "P.Ch. Chochula",
        "A. Augustinus",
        "A.N. Kurepin",
        "M. Lechman",
        "O. Pinazza",
        "P. Rosinský",
        "CERN",
        "Geneva",
        "Switzerland",
        "RAS/INR",
        "Moscow",
        "Russia",
        "INFN-Bologna",
        "Bologna",
        "Italy",
        "The first LHC run period",
        "lasting 4 year brought exciting physics results and new insight into the mysteries of the matter. One of the key components in this achievements were the detectors",
        "which provided unprecedented amounts of data of the highest quality. The control systems",
        "responsible for their smooth and safe operation",
        "played a key role in this success. The design of the ALICE Detector Control System (DCS) started more than 12 years ago. High level of standardization and pragmatic design led to a reliable and stable system",
        "which allowed for efficient experiment operation. In this presentation we summarize the overall architectural principles of the system",
        "the standardized components and procedures. The original expectations and plans are compared with the final design. Focus is given on the operational procedures",
        "which evolved with time. We explain",
        "how a single operator can control and protect a complex device like ALICE",
        "with millions of readout channels and several thousand control devices and boards. We explain what we learned during the first years of LHC operation and which improvements will be implemented to provide excellent DCS service during the next years."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcoaab07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcoaab07.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcoaab07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOAAB07",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCOAAB08",
      "title": "The LIMA Project Update",
      "authors": [
        "S. Petitdemange",
        "L. Claustre",
        "A. Homs",
        "R. Homs Regojo",
        "E. Papillon",
        "ESRF",
        "Grenoble",
        "France",
        "LIMA",
        "a Library for Image Acquisition",
        "was developed at the ESRF to control high-performance 2D detectors used in scientific applications. It provides generic access to common image acquisition concepts",
        "from detector synchronization to online data reduction",
        "including image transformations and storage management. An abstraction of the low-level 2D control defines the interface for camera plugins",
        "allowing different degrees of hardware optimizations. Scientific 2D data throughput up to 250 MB/s is ensured by multi-threaded algorithms exploiting multi-CPU/core technologies. Eighteen detectors are currently supported by LIMA",
        "covering CCD",
        "CMOS and pixel detectors",
        "and video GigE cameras. Control system agnostic by design",
        "LIMA has become the de facto 2D standard in the TANGO community. An active collaboration among large facilities",
        "research laboratories and detector manufacturers joins efforts towards the integration of new core features",
        "detectors and data processing algorithms. The LIMA 2 generation will provide major improvements in several key core elements",
        "like buffer management",
        "data format support (including HDF5) and user-defined software operations",
        "among others."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcoaab08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcoaab08.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcoaab08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOAAB08",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 8,
  "scrape_time": "2025-10-10 18:29:54"
}