{
  "session_info": {
    "id": "WEAL",
    "name": "WEAL - Beam Profile 2",
    "url": "https://proceedings.jacow.org/IBIC2013/html/weal.htm"
  },
  "papers": [
    {
      "paper_id": "WEAL1",
      "title": "Large Aperture X-ray Monitors for Beam Profile Diagnostics",
      "authors": [
        "C.A. Thomas",
        "G. Rehm",
        "Diamond",
        "Oxfordshire",
        "United Kingdom",
        "ESRF",
        "Grenoble",
        "France",
        "KEK",
        "Ibaraki",
        "Japan",
        "Emittance is one of the main characteristic properties of a beam of particles in an accelerator",
        "and it is measured generally by means of the particle beam profile. In particular",
        "when the beam of particles is emitting an X-ray photon beam",
        "a non perturbative way of measuring the particle beam profile is to image it using the emitted X-ray photon beam. Over the years",
        "numerous X-ray imaging methods have been developed",
        "fulfilling the requirements imposed by a particle beam becoming smaller",
        "and approaching micron size for electron beam machine with vertical emittance of the order of 1pm-rad. In this paper",
        "we will first recall the properties of the X-ray photon as function of source and its properties. From this we will derive some natural definition of a large aperture X-ray imaging system. We will then use this selection criterion to select a number of X-ray imaging devices used as a beam profile diagnostics in an attempt to give an overview of what has been achieved and what is possible to achieve with the selected devices."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/weal1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/weal1.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/weal1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEAL1",
      "page_number": "608",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAL2",
      "title": "Extremely Low Emittance Beam Size Diagnostics with Sub-Micrometer Resolution Using Optical Transition Radiation",
      "authors": [
        "K.O. Kruchinin",
        "S.T. Boogert",
        "P. Karataev",
        "L.J. Nevay",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "A.S. Aryshev",
        "M.V. Shevelev",
        "N. Terunuma",
        "J. Urakawa",
        "KEK",
        "Ibaraki",
        "Japan",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "B. Bolzon",
        "T. Lefèvre",
        "S. Mazzoni",
        "CERN",
        "Geneva",
        "Switzerland",
        "Transverse electron beam diagnostics is crucial for stable and reliable operation of the future electron-positron linear colliders such as CLIC or Higgs Factory. The-state-of-the-art in transverse beam diagnostics is based on the laser-wire technology. However",
        "it requires a high power laser significantly increases the cost of the laser-wire system. Therefore",
        "a simpler and relatively inexpensive method is required. A beam profile monitor based on Optical Transition Radiation (OTR) is very promising. The resolution of conventional OTR monitor is defined by a root-mean-square of the so-called Point Spread Function (PSF). In optical wavelength range the resolution is diffraction limited down to a few micrometers. However",
        "in * we demonstrated that the OTR PSF has a structure which visibility can be used to monitor vertical beam size with sub-micrometer resolution. In this report we shall represent the recent experimental results of a micron-scale beam size measurement. We shall describe the entire method including calibration procedure",
        "new analysis",
        "and calculation of uncertainties. We shall discuss the hardware status and future plans.",
        "* P. Karataev et al.",
        "Physical Review Letters 107",
        "174801 (2011)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/weal2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/weal2.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/weal2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEAL2",
      "page_number": "615",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAL3",
      "title": "Diffraction Radiation Test at CesrTA for Non-Intercepting Micron-Scale Beam Size Measurement",
      "authors": [
        "L.M. Bobb",
        "E. Bravin",
        "T. Lefèvre",
        "S. Mazzoni",
        "CERN",
        "Geneva",
        "Switzerland",
        "T. Aumeyr",
        "P. Karataev",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "M.G. Billing",
        "J.V. Conway",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "Diffraction radiation (DR) is produced when a relativistic charged particle moves in the vicinity of a medium. The electric field of the charged particle polarizes the target atoms which then oscillate",
        "emitting radiation with a very broad spectrum. The spatial-spectral properties of DR are sensitive to a range of electron beam parameters. Furthermore",
        "the energy loss due to DR is so small that the electron beam parameters are unchanged. DR can therefore be used to develop non-invasive diagnostic tools. To achieve the micron-scale resolution required to measure the transverse (vertical) beam size using incoherent DR in CLIC",
        "DR in UV and X-ray spectral-range must be investigated. Experimental validation of such a scheme is ongoing at CesrTA at Cornell University",
        "USA. Here we report on the test using 0.5 mm and 1 mm target apertures on a 2.1 GeV electron beam and 400 nm wavelength."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/weal3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/weal3.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/weal3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEAL3",
      "page_number": "619",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 18:00:20"
}