{
  "session_info": {
    "id": "TUCZB",
    "name": "TUCZB - Profile Monitors",
    "url": "https://proceedings.jacow.org/IBIC2014/html/tuczb.htm"
  },
  "papers": [
    {
      "paper_id": "TUCZB1",
      "title": "Novel Emittance Diagnostics for Diffraction Limited Light Sources Based on X-ray Fresnel Diffractometry",
      "authors": [
        "M. Masaki",
        "Y. Shimosaki",
        "S. Takano",
        "M. Takao",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "A novel emittance diagnostics technique with high sensitivity using X-ray Fresnel diffraction by a single slit has been developed to measure micron-order electron beam sizes at insertion devices (IDs) of photon beamlines. The X-ray Fresnel diffractometry (XFD)* is promising for diagnostics especially of a so-called diffraction limited storage ring (DLSR) with ultra-low emittance. In the DLSR",
        "due to inevitable field errors of strong quadrupole and sextupole magnets",
        "unwanted distortion of lattice functions and local betatron coupling will result in a different light source size at each beamline. Therefore",
        "measurements of electron beam sizes at the ID source points will be essential to ensure the absence of degradation of brilliance and transverse coherence of radiation at the beamlines. The XFD observes a double-lobed diffraction pattern that emerges by optimizing the single slit width. The principle is based on a correlation between the depth of a median dip in the double-lobed pattern and the light source size at the ID. The validity of the new technique was theoretically and experimentally studied. The achievable resolution of the XFD will be also discussed.",
        "* M. Masaki",
        "et al.",
        "\"X-ray Fresnel Diffractometry for Ultra-Low Emittance Diagnostics of Next Generation Synchrotron Light Sources\"",
        "submitted to Phys. Rev.ST-AB."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/tuczb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/tuczb1.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/tuczb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-TUCZB1",
      "page_number": "274",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCZB2",
      "title": "Measurements of Small Vertical Beamsize using a Coded Aperture at Diamond Light Source",
      "authors": [
        "C. Bloomer",
        "G. Rehm",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "KEK",
        "Ibaraki",
        "Japan",
        "Diamond Light Source produces a low emittance 3GeV electron beam which is now regularly operated at 8pm.rad vertical emittance. This corresponds to a vertical beamsize of just 13um in the dipole",
        "which is at a high vertical beta location and routinely used for observing the synchrotron radiation using a pinhole camera. Deconvolution of the images from the pinhole camera to maximise resolution is limited by uncertainly regarding the precise shape of the pinhole",
        "resulting in uncertainty on its computed point spread function. Recently a coded aperture has been installed which offers the potential to improve upon the traditional pinhole measurement by offering both higher resolution and increased flux seen through a larger total aperture",
        "however",
        "at the cost of significantly more complex analysis of the recorded images. A comparison of results obtained using the coded aperture and those achieved using the conventional pinhole is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/tuczb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/tuczb2.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/tuczb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-TUCZB2",
      "page_number": "279",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCZB3",
      "title": "A Quantum Gas Jet for Non-Invasive Beam Profile Measurement",
      "authors": [
        "A. Jeff",
        "E.B. Holzer",
        "T. Lefèvre",
        "CERN",
        "Geneva",
        "Switzerland",
        "A. Jeff",
        "V. Tzoganis",
        "C.P. Welsch",
        "H.D. Zhang",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "V. Tzoganis",
        "C.P. Welsch",
        "H.D. Zhang",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A novel instrument for accelerator beam diagnostics is being developed by using De Broglie-wave focusing to create an ultra-thin neutral gas jet. Scanning the gas jet across a particle beam while measuring the interaction products",
        "the beam profile can be measured. Such a jet scanner will provide an invaluable diagnostic tool in beams which are too intense for the use of wire scanners",
        "such as the proposed CLIC Drive Beam. In order to create a sufficiently thin jet",
        "a focusing element working on the DeBroglie wavelength of the Helium atom has been designed. Following the principles of the Photon Sieve",
        "we have constructed an Atomic Sieve consisting of 5230 nano-holes etched into a thin film of silicon nitride. When a quasi-monochromatic Helium jet is incident on the sieve",
        "an interference pattern with a single central maximum is created. The stream of Helium atoms passing through this central maximum is much narrower than a conventional gas jet. The first experiences with this device are presented here",
        "along with plans for further tests."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/tuczb3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/tuczb3.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/tuczb3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-TUCZB3",
      "page_number": "284",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:56:34"
}