{
  "session_info": {
    "id": "WEKA",
    "name": "WEKA - Keynote Talk: Selection of materials and processes for non-magnetic applications",
    "url": "https://proceedings.jacow.org/medsi2018/html/weka.htm"
  },
  "papers": [
    {
      "paper_id": "WEKA01",
      "title": "Selection of Materials and Processes for Vacuum, Cryogenic and Non-Magnetic Applications in Particle Accelerators",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "Stringent requirements are placed on materials of modern accelerators. Their physical and mechanical properties",
        "machinability",
        "weldability or brazeability are key parameters. Adequate strength",
        "ductility",
        "magnetic properties at room as well as low temperatures are important factors for materials of accelerators working at cryogenic temperatures. In addition",
        "components undergoing baking",
        "NEG activation or submitted to the impact of the beam impose specific choices of material grades. Magnetic properties are of paramount importance. In order to minimize the magnetic permeability of the final components",
        "precise specifications in terms of composition and microstructure have to be applied. Today",
        "stainless steels are the dominant materials for accelerator construction. Their metallurgy is extensively treated. It will be shown that a stainless steel does not only consist of a chemical composition or a designation",
        "but is the result of a whole metallurgy and metalworking process",
        "in view of obtaining adequate purity",
        "weldability",
        "inclusion cleanliness and fineness of the microstructure. Innovative manufacturing and non-destructive examination technologies will also be covered."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weka01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weka01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weka01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEKA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 23:36:12"
}