{
  "session_info": {
    "id": "THPOPT",
    "name": "THPOPT - Poster Session - Padthai",
    "url": "https://proceedings.jacow.org/ipac2022/html/thpopt.htm"
  },
  "papers": [
    {
      "paper_id": "THPOPT001",
      "title": "Online Optimization of the ESRF-EBS Storage Ring Lifetime",
      "authors": [
        "N. Carmignani",
        "L.R. Carver",
        "L. Hoummi",
        "S.M. Liuzzo",
        "T.P. Perron",
        "P. Raimondi",
        "S.M. White",
        "ESRF",
        "Grenoble",
        "France",
        "In the first year of operation of the EBS storage ring",
        "online nonlinear dynamics optimisations were performed to increase the Touschek lifetime. Several sextupole",
        "octupole and skew quadrupole knobs have been studied in simulations and tested in the machine. A fast optimisation procedure has been defined and it is followed at each machine restart. The knobs and the optimisation procedure are described in the paper. As a result",
        "up to 41 h Touschek lifetime in nominal multi-bunch mode have been achieved."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt001.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT002",
      "title": "Beam Power Deposition on the Cryogenic Permanent Magnet Undulator",
      "authors": [
        "L.R. Carver",
        "C. Benabderrahmane",
        "P. Brumund",
        "N. Carmignanipresenter",
        "J. Chavanne",
        "G. Le Bec",
        "R. Versteegen",
        "S.M. White",
        "ESRF",
        "Grenoble",
        "France",
        "X-rays with high brilliance and low phase errors are generated in the Cryogenic Permanent Magnet Undulator (CPMU) currently in use at the ESRF. In the event of a failure of the cryogenic cooling the beam will continue to deposit power into the module",
        "even when the undulator jaws are fully opened. This could lead to unacceptably high heating of the magnet blocks which could cause their demagnetisation. Impedance simulations were performed using IW2D and CST to compute the power deposited by the beam in both the closed and open jaw settings. This was followed by thermal simulations to compute the expected temperature rise. These results will help advise the operational procedure in the event of a cooling failure."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT003",
      "title": "A First attempt at implementing TRIBs in BESSY III’s Design Lattice",
      "authors": [
        "M. Arlandoo",
        "P. Goslawski",
        "M. Titzepresenter",
        "HZB",
        "Berlin",
        "Germany",
        "At HZB’s BESSY II and PTB’s Metrology Light Source (MLS)",
        "resonances and islands in transverse phase space are exploited in a special operation mode usually referred to as Transverse Resonance Island Buckets (TRIBs). This mode provides a second stable orbit well separated from the main orbit and one of its applications in photon science is the ultra-fast switching of the helicity of circularly polarized light pulses. In the context of the conceptual design study of BESSY III",
        "it is under investigation how this special optics mode can be implemented in an MBA structure and how it will impact the photon source parameters. In this paper we present a preliminary attempt at implementing TRIBs in BESSY III’s design lattice",
        "a multi-bend achromat",
        "by breaking the symmetry of the lattice."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt003.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT004",
      "title": "Design of a Compact 180-Degree Single-Shot Energy Spectrometer Based on a Halbach Dipole Magnet",
      "authors": [
        "R. Bazrafshan",
        "T. Rohwer",
        "Deutsches Elektronen Synchrotron (DESY) and Center for Free Electron Science (CFEL)",
        "Hamburg",
        "Germany",
        "M. Fakhari",
        "N.H. Matlis",
        "CFEL",
        "Hamburg",
        "Germany",
        "DESY",
        "Hamburg",
        "Germany",
        "In the AXSIS project at DESY",
        "we develop compact THz accelerating structures for a table-top x-ray source. Acceleration is achieved by passing the electron beam through a dielectric-loaded waveguide powered by multi-cycle THz radiation. The final electron energy strongly depends on THz-power injected into the LINAC and timing. Thus in first experiments we expect large energy fluctuations and a large range of energies to cover. We designed an electron energy spectrometer for a wide range of final energies covering 5 to 20 MeV in a single-shot. Here",
        "we present the design of an energy spectrometer which uses a compact dipole magnet based on the Halbach array concept to deflect the electron beam through a 180° path intercepted by a Fiber Optic Scintillator (FOS) mounted inside the vacuum perpendicular to the beam. The 180-degree bending geometry provides the possibility of having the focus point of all energies at the same distance from the magnet edge which makes the design simpler and more compact. It also removes the necessity of installing a safety dipole at the end of the accelerator. A slit system at the spectrometer entrance increases resolution to better than 0.2%."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt004.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT005",
      "title": "Field Enhanced, Compact S-Band Gun Employing a Pin Cathode",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt005.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT006",
      "title": "Beam Dynamics Observations at Negative Momentum Compaction Factors at KARA",
      "authors": [
        "P. Schreiber",
        "M. Brosi",
        "B. Härer",
        "A. Mochihashi",
        "A.-S. Müller",
        "A.I. Papash",
        "R. Ruprecht",
        "M. Schuh",
        "KIT",
        "Karlsruhe",
        "Germany",
        "For the development of future synchrotron light sources new operation modes often have to be considered. One such mode is the operation with a negative momentum compaction factor to provide the possibility of increased dynamic aperture. For successful application in future light sources",
        "the influence of this mode has to be investigated. At the KIT storage ring KARA (Karlsruhe Research Accelerator)",
        "operation with negative momentum compaction has been implemented and the dynamics can now be investigated. Using a variety of high-performance beam diagnostics devices it is possible to observe the beam dynamics under negative momentum compaction conditions. This contribution presents different aspects of the results of these investigations in the longitudinal and transversal plane."
      ],
      "institutions": [
        "Funding: We are supported by the DFG-funded \"Karlsruhe School of Elementary and Astroparticle Physics: Science and Technology\" and European Union’s Horizon 2020 research and innovation programme (No 730871)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt006.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT007",
      "title": "High Bunch Charges in the Second Injection Beamline of MESA",
      "authors": [
        "A.A. Kalamaiko",
        "K. Aulenbacher",
        "M.A. Dehn",
        "S. Friederich",
        "C.P. Stollpresenter",
        "KPH",
        "Mainz",
        "Germany",
        "MESA (Mainz Energy-recovering Superconducting Accelerator) is an accelerator with two laser-driven electron sources (polarized and unpolarized) operating at 100 kV which is under construction at the Johannes Gutenberg University in Mainz. The unpolarized electron source MIST (MESA Injector Source Two) allows to produce high charged electron bunches with charge up to 7.7 pC. This source and a Mott polarimeter will be arranged on the same height above the MESA injector main beamline. A parallel shifting beamline was developed which allows to transport high charged beam from the source MIST to the main MESA beamline. Moreover",
        "the designed beamline allows to transport beam from the electron source STEAM to the Mott polarimeter. This report is dedicated to the design of the separation beamline which transports and compresses highly charged electron bunches from the electron source MIST to the first acceleration section of MESA."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt007.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT008",
      "title": "Beam Orbit Shift Due to BPM Thermal Deformation Using Machine Learning",
      "authors": [
        "K.M. Chen",
        "M. Hosaka",
        "F.Y. Wang",
        "G. Wang",
        "Z. Wang",
        "W. Xu",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "Nagoya University",
        "Nagoya",
        "Japan",
        "Stabilizing beam orbit is critical for advanced synchrotron radiation light sources. The beam orbit can be affected by many sources. To maintain a good orbit stability",
        "global orbit feedback systems (OFB) has been widely used. However",
        "the BPM thermal deformation would lead to BPM misreading",
        "which can not be handled by OFB. Usually",
        "extra diagnostics",
        "such as position transducers",
        "is needed to measure the deformation dependency of BPM readings. Here",
        "an alternative approach by using the machine operation historic data",
        "including BPM temperature",
        "insertion device (ID) gaps and corrector currents",
        "is presented. It is demonstrated at Hefei Light Source (HLS). The average orbit shift due to BPM thermal deformation is about 34.5 microns/degree Celsius (horizontal) and 20.0 microns/degree Celsius (vertical)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt008.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT009",
      "title": "Dependency Measurement of BPM Reading in the HLS-II Storage Ring",
      "authors": [
        "G. Wang",
        "K.M. Chen",
        "G. Feng",
        "M. Hosaka",
        "Z. Wang",
        "W. Xu",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "Nagoya University",
        "Nagoya",
        "Japan",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Beam orbit stability is essential for the operation of the storage ring based light sources. Orbit feedback systems are commonly adopted to maintain the beam on a reference orbit. However",
        "the BPM reading could be affected by its temperature",
        "beam current",
        "etc",
        "which leads to shift of the beam reference orbit. Online experiment is carried out in the HLS-II storage ring to study the dependence of the beam reference orbit on the BPM temperature and beam current. The result shows that the average change of BPM readings due to BPM temperature is about 37.4 ’m/’C horizontally and 11.5 ’m/’C vertically. The average change of BPM readings induced by beam current is about 0.27 ’m/mA horizontally and 0.20 ’m/mA vertically."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt009.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT010",
      "title": "Beam Loss Reduction During Energy Ramp-Up at the SAGA-LS",
      "authors": [
        "SAGA",
        "Tosu",
        "Japan",
        "The accelerator of the SAGA Light Source (SAGA-LS) consists of a 255 MeV injector linac and a 1.4 GeV storage ring. The energy of the electrons is ramped up to 1.4 GeV in 4 minutes in the storage ring. The electron beam current stored in the storage ring is about 300 mA. At the begging of the energy ramp-up",
        "the electron beam was lost like step function. The lost beam current was normally about 5 mA to 30 mA. To understand the beam loss mechanism",
        "we developed simultaneous image logging system of beam profile in addition to the beam current",
        "the magnets power supplies",
        "and the beam positions using National Instruments PXI. It was found that the vertical beam size was growing in the step-like beam loss process. The small perturbation of the output currents of the quadrupole power supplies caused the vertical beam size growth. By optimizing the ramp-up pattern of the quadrupole power supplies",
        "sextupole power supplies",
        "and the steering power supplies for the orbit control",
        "we have achieved the reduction of the step-like beam loss and total time of the ramp-up."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT013",
      "title": "Emittance Reduction with the Variable Dipole for the ELETTRA 2.0 Ring",
      "authors": [
        "A. Poyet",
        "Y. Papaphilippou",
        "CERN",
        "Meyrin",
        "Switzerland",
        "M.A. Domínguez",
        "F. Toral",
        "CIEMAT",
        "Madrid",
        "Spain",
        "R. Geometrante",
        "E. Karantzoulis",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "KYMA",
        "Trieste",
        "Italy",
        "ELETTRA is a 2/2.4 GeV third-generation electron storage ring",
        "located near Trieste",
        "Italy. In view of a substantial increase of the machine performance in terms of brilliance",
        "the so-called ELETTRA 2.0 upgrade is currently on-going. This upgrade is based on a 6-bends achromat",
        "four dipoles of which having a longitudinally variable field. So far",
        "those dipoles are foreseen to provide a field with a two step profile. The VAriable Dipole for the ELETTRA Ring (VADER) task",
        "driven by the I.FAST European project",
        "aims at developing a new dipole design based on a trapezoidal shape of the bending radius",
        "which would allow for a further reduction of the horizontal emittance. A prototype of this magnet should be designed by the CIEMAT laboratory and built by KYMA company. This paper discusses the new dipole field specification and describes the corresponding optics optimization that was performed in order to reduce at best the emittance of the ELETTRA ring."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt013.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT014",
      "title": "Simulation and Optimization of SPS-II Linac",
      "authors": [
        "T. Chanwattana",
        "S. Chunjarean",
        "N. Juntong",
        "S. Klinkhieo",
        "P. Sudmuang",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "Synchrotron Light Research Institute (SLRI)",
        "Muang District",
        "Thailand",
        "Siam Photon Source II (SPS-II)",
        "the new 3-GeV synchrotron light source project in Thailand",
        "has been designed based on an accelerator system consisting of a 150-MeV injector linac",
        "a full-energy booster synchrotron and a storage ring based on a Double Triple Bend Achromat (DTBA) lattice. A turn-key linac system has been used in an injection system of many synchrotron facilities",
        "and thus it is considered for the SPS-II project. Preliminary beam dynamics simulation and optimization of the SPS-II linac are necessary for investigating achievable beam parameters which can be used for study of beam injection through a transfer line to the booster. Multi-objective optimization algorithm (MOGA) has been used in design and optimization of many accelerators including a linac system for synchrotron light sources",
        "similar to the SPS-II linac. In this paper",
        "results of beam dynamics simulation and MOGA optimization of the SPS-II linac are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt014.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT015",
      "title": "The Design of the Full Energy Beam Exploitation (FEBE) Beamline on CLARA",
      "authors": [
        "A.R. Bainbridge",
        "D. Angal-Kalinin",
        "J.K. Jones",
        "T.H. Pacey",
        "Y.M. Saveliev",
        "E.W. Snedden",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The CLARA facility at Daresbury Laboratory was orig-inally designed for the study of novel FEL physics utilis-ing high-quality electron bunches at up to 250 MeV/c. To maximise the exploitation of the accelerator complex",
        "a dedicated full energy beam exploitation (FEBE) beam-line has been designed and is currently being installed in a separate vault on the CLARA accelerator. FEBE will allow the use of high charge (up to 250 pC)",
        "moderate energy (up to 250 MeV)",
        "electron bunches for a wide variety of accelerator applications critical to ongoing accelerator development in the UK and international communities. The facility consists of a shielded enclo-sure",
        "accessible during beam running in CLARA",
        "with two very large experimental chambers compatible with a wide range of experimental proposals. High-power laser beams (up to 100 TW) will be available for electron-beam interactions in the first chamber",
        "and there are concrete plans for a wide variety of advanced diagnostics (includ-ing a high-field permanent magnet spectrometer and dielectric longitudinal streaker)",
        "essential for multiple experimental paradigms",
        "in the second chamber. FEBE will be commissioned in 2024."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt015.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT016",
      "title": "Commissioning Simulations for the DIAMOND-II Upgrade",
      "authors": [
        "H.C. Chao",
        "R.T. Fielder",
        "J. Kallestrup",
        "I.P.S. Martin",
        "B. Singh",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "The Diamond-II storage ring",
        "compared to Diamond",
        "improves the natural beam emittance from 2.7 nm to 160 pm and the beam energy from 3 to 3.5 GeV. The number of straight sections is also doubled from 24 to 48 thanks to the modified hybrid six-bend-achromat lattice. To reduce the impact on the existing science program",
        "the dark time period must be minimised. To assist in this aim",
        "storage ring commissioning simulations have been carried out to predict and resolve possible issues. These studies include beam commissioning starting from on-axis first-turn beam threading up to beam based alignment and full linear optics correction with stored beam. The linear optics corrections with insertion devices are also included. The machine characterisations at different stages are compared. Considerations on realistic chamber limitations",
        "error definitions and some commissioning strategies are also discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt016.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT017",
      "title": "Orbit Stability Studies for the Diamond-II Storage Ring",
      "authors": [
        "I.P.S. Martin",
        "C.A. Abraham",
        "D. Crivelli",
        "H. Ghasempresenter",
        "B. Nicholson",
        "T. Olsson",
        "P. Sanchez Navarro",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "The photon-beam positional stability relative to the beam size is a key performance parameter for storage ring light sources. The natural emittance of the Diamond-II ring will be lowered by a factor 16.7 compared to the existing ring",
        "so the absolute stability requirement for the electron beam must reduce accordingly. In addition",
        "advances in detector speed and resolution mean the tolerances are tighter compared to previous generations of storage rings",
        "with a target of 3 % of beam size up to 1 kHz having been adopted for Diamond-II. In this paper we present studies of how the anticipated ground vibrations",
        "girder motion and power supply ripple will affect the electron beam stability as a function of frequency."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt017.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT018",
      "title": "Aperture Sharing Injection for Diamond-II",
      "authors": [
        "J. Kallestrup",
        "H. Ghasempresenter",
        "I.P.S. Martin",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "The planned Diamond-II storage ring will provide users with an increase in brightness of up to two orders of magnitude compared with the existing Diamond facility. The aim is to maintain excellent photon beam stability in top-up mode",
        "which requires frequent injections. This paper introduces the aperture sharing injection scheme designed for Diamond-II. The scheme promises",
        "through the use of short striplines equipped with high-voltage nano-second pulsers",
        "a quasi-transparent injection while maintaining an approximately 100% injection efficiency."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt018.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT019",
      "title": "Multi-Alkali Antimonide Photocathode Development for High Brightness Beams",
      "authors": [
        "S. Mistry",
        "T. Kamps",
        "J. Kühn",
        "C. Wang",
        "HZB",
        "Berlin",
        "Germany",
        "HU Berlin",
        "Berlin",
        "Germany",
        "University Siegen",
        "Siegen",
        "Germany",
        "Photocathode R&D at the Helmholtz-Zentrum Berlin (HZB) is driven by the motivation to produce high brightness electron beams for the SRF photoinjector test facility",
        "Sealab/ bERLinPro. Multi-alkali antimonides are the choice photocathode material due to high quantum efficiency (QE) and low intrinsic emittance in the visible range. In this work a more robust alternative to the tried and tested Cs-K-Sb is considered. Na-K-Sb offers similar advantages to Cs-K-Sb including",
        "high QE at green wavelengths but moreover",
        "it offers excellent stability at elevated temperatures. This property could lengthen the cathode lifetime by enhancing the robustness of the photocathode inside the SRF gun. In this work",
        "a status report showcasing first results towards the development of a growth procedure for Na-K-Sb is presented by means of spectral response and XPS measurements conducted in the HZB photocathode lab."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt019.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT020",
      "title": "Status and Plans for the New CLS Electron Source Lab",
      "authors": [
        "M.J. Boland",
        "D. Bertwistle",
        "F. Le Pimpec",
        "CLS",
        "Saskatoon",
        "Saskatchewan",
        "Canada",
        "TUE",
        "Eindhoven",
        "The Netherlands",
        "The Canadian Light Source (CLS) has recently created a new Electron Source Lab (ESL) that can run independently from user operations. A section of the old Saskatchewan Accelerator Laboratory experimental nuclear physics tunnels has been rebuilt with new shielding and a separate entrance. The laboratory will be used to prepare an operational spare electron gun for the 250 MeV linac. In addition",
        "there are plans to develop RF guns for a future branch line to inject into the linac and for possible short pulse production. This paper will give an overview of the ESL space and the first electron guns which plan to be installed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt020.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT022",
      "title": "Study on QE Evolution of Cs₂Te Photocathodes in ELBE SRF Gun-II",
      "authors": [
        "R. Xiang",
        "A. Arnold",
        "S. Ma",
        "P. Michelpresenter",
        "P. Murcek",
        "A.A. Ryzhov",
        "J. Schaber",
        "J. Teichert",
        "P.Z. Zwartek",
        "HZDR",
        "Dresden",
        "Germany",
        "The quality of the photocathodes is critical for the sta-bility and reliability of the photoinjector’s operation. Thanks to the robust magnesium and Cs2Te photocathodes",
        "SRF gun-II at HZDR has been proven to be a suc-cessful example in CW mode for high current user operation. In this contribution",
        "we will present our observation of the QE evolution of Cs2Te photocathodes during SRF gun operation. The variables including substrate surface",
        "film thickness",
        "Cs/Te stoichiometric",
        "multipacting",
        "RF loading and charge extract are considered in the analysis."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt022.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT023",
      "title": "Flexible Features of the Compact Storage Ring in the cSTART Project at Karlsruhe Institute of Technology",
      "authors": [
        "A.I. Papash",
        "A. Bernhard",
        "E. Bründermann",
        "D. El Khechen",
        "B. Härer",
        "A.-S. Müller",
        "R. Ruprecht",
        "J. Schaeferpresenter",
        "M. Schwarz",
        "KIT",
        "Karlsruhe",
        "Germany",
        "Within the cSTART project (compact storage ring for accelerator research and technology)",
        "a Very Large Acceptance compact Storage Ring (VLA-cSR) will be realized at the Institute for Beam Physics and Technology (IBPT) of the Karlsruhe Institute of Technology. (KIT). A modified geometry of a compact storage ring operating at 50 MeV energy range has been studied and main features of the new model are described here. The new design",
        "based on 45° bending magnets",
        "is suitable to store a wide momentum spread beam as well as ultra-short electron bunches in the sub-ps range injected from the plasma cell as well as from the Ferninfrarot Linac- Und Test Experiment (FLUTE). The DBA lattice of the VLA-cSR with different settings and relaxed parameters",
        "split elements and higher order optics of tolerable strength allows to improve the dynamic aperture and momentum acceptance to an acceptable level. This contribution discusses the lattice features in detail",
        "expected lifetime",
        "injection",
        "tolerances and different possible operation schemes of the ring."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt023.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT024",
      "title": "MIST - The MESA-Injector Source Two",
      "authors": [
        "M.A. Dehn",
        "P.S. Plattnerpresenter",
        "IKP",
        "Mainz",
        "Germany",
        "HIM",
        "Mainz",
        "Germany",
        "GSI",
        "Darmstadt",
        "Germany",
        "KPH",
        "Mainz",
        "Germany",
        "The new accelerator MESA (Mainz Energy Recovering Superconducting Accelerator) will provide an average CW electron beam current of up to 10 mA. Operating at 1.3 GHz",
        "this corresponds to a bunch charge of 7.7 pC. The new DC photoemission source MIST is optimized for these requirements. A challenge is heating of the photocathode at high laser power. By a suitable mechanical construction and the use of specific materials",
        "the heat can be dissipated during operation. Options for further improvements are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt024.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT025",
      "title": "Photocathode Stress Test Bench at INFN LASA",
      "authors": [
        "D. Sertore",
        "D. Giove",
        "L. Monaco",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "A. Bacci",
        "F. Canella",
        "S. Cialdi",
        "I. Drebotpresenter",
        "D. Giannotti",
        "L. Serafini",
        "INFN-Milano",
        "Milano",
        "Italy",
        "D. Cipriani",
        "E. Suerra",
        "Università degli Studi di Milano",
        "Milano",
        "Italy",
        "POLIMI",
        "Milano",
        "Italy",
        "Università degli Studi di Milano & INFN",
        "Segrate",
        "Italy",
        "A UHV test bench based on a 100 kV DC gun and a 100 MHz repetition rate laser has been setup up at INFN LASA to test Cs2Te photocathodes. This operation mode is the baseline of the BriXSinO project",
        "currently in the design phase in our laboratory",
        "and the qualification of the Cs2Te photocathodes is a key issue. In this paper",
        "we present the recent advances in the different aspects of this R&D activity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt025.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT026",
      "title": "Assembly and Characterization of Low-Energy Electron Transverse Momentum Measurement Device (TRAMM) at INFN LASA",
      "authors": [
        "D. Sertore",
        "M. Bertuccipresenter",
        "A. Bosotti",
        "D. Giove",
        "L. Monaco",
        "R. Paparella",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "G. Guerini Rocco",
        "C. Pagani",
        "Università degli Studi di Milano & INFN",
        "Segrate",
        "Italy",
        "In the framework of high-brightness electron beam generation",
        "thermal emittance is nowadays a key parameter. While alkali tellurides are extensively used in advanced electron sources",
        "alkali antimonides photocathodes demonstrated high QE in the visible",
        "thus making feasible CW operations for RF-based photoinjectors. The INFN LASA laboratory in Milan is fully equipped with dedicated production systems for photocathode preparation and optical setup for QE evaluation. In this paper",
        "we describe a newly designed device dedicated to electron transverse momentum measurement (TRAMM). It will be connected to the main production chambers and will serve as an \"emittance monitoring\" system during photocathode growth. From the design phase",
        "through the parameter estimate",
        "assembly of the components",
        "to the installation and first measurements",
        "we describe the status of this project and its future developments."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt026.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT027",
      "title": "R&D on High QE Photocathodes at INFN LASA",
      "authors": [
        "D. Sertore",
        "M. Bertuccipresenter",
        "L. Monaco",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "Università degli Studi di Milano & INFN",
        "Segrate",
        "Italy",
        "S.K. Mohanty",
        "H.J. Qian",
        "F. Stephan",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany"
      ],
      "institutions": [],
      "abstract": "We present the recent activities on antimonide and telluride alkali based photocathodes at INFN LASA. The R&D on Cs2Te materials is focused on investigating effects of material thickness and growth procedures on the photocathodes performances during operation in RF guns. We aim to improve thermal emittance and long term stability of these films. The more recent work on alkali antimonide showed the need for substantial improvements in stability and QE during operation. We present here our recent achievements and plans for future activities. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt027.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT028",
      "title": "Dependence of CsK2Sb Photocathode Performance on the Quality of Graphene Substrate Film",
      "authors": [
        "L. Guo",
        "K. Goto",
        "Y. Takashima",
        "Nagoya University",
        "Nagoya",
        "Japan",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "KEK",
        "Ibaraki",
        "Japan",
        "A photocathode that extracts electrons by irradiating a semiconductor or metal with a laser is applied to advanced accelerators and electron microscopes as a high-performance cathode. In particular",
        "the CsK2Sb photocathode is of interest because it has features such as low emittance",
        "excitability with visible light",
        "and high quantum efficiency. Generally",
        "the CsK2Sb photocathode is produced by depositing a cathode element on a substrate",
        "so that the cathode performance strongly depends on the surface condition of the substrate. We have found graphene as reusable substrate",
        "which has the property of being chemically inactive. In this study",
        "graphene film quality dependence of CsK2Sb photo-cathode performance was evaluated. Specifically",
        "CsK2Sb cathode was deposited using different quality graphene film substrates and their QE values and uniformity were compared. The quality of graphene films was analyzed using X-ray Photoelectron Spectroscopy (XPS) and X-ray absorption spectroscopy (XAS). We found that the graphene film can be cleaned by heating at 500 deg. The QE of the cathode on a good quality graphene film was higher and more uniform than that on a poor quality graphene film."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt028.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT029",
      "title": "Study on the Performance Improvement of Alkali Antimonide Photocathodes for Radio Frequency Electron Guns",
      "authors": [
        "R. Fukuoka",
        "K. Ezawa",
        "Y. Koshiba",
        "M. Washio",
        "Waseda University",
        "Tokyo",
        "Japan",
        "The University of Tokyo",
        "Graduate School of Engineering",
        "Bunkyo",
        "Japan",
        "Semiconductor photocathodes such as Cs-Te and Cs-K-Sb are used as electron sources in accelerators to generate high brightness beams using radio frequency (rf) electron guns. Alkali antimonide photocathodes have a high quantum efficiency (Q.E.) of ~10%",
        "and their excitation wavelength is in the visible light region (532 nm)",
        "so that they are expected to reduce the requirements on the optical system and increase the amount of charge compared to Cs-Te. However",
        "alkali antimonide photocathodes have a short lifetime and degrade under poor vacuum conditions",
        "so it is essential to improve durability by protective film coatings. Therefore",
        "we are currently working on the fabrication of high Q.E. alkali antimonide photocathodes that can withstand the Q.E. reduction during coating. In this presentation",
        "we will report the results of comparison between the fabricated alkali antimonide photocathode and Cs-Te photocathode",
        "and future prospects."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt029.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT030",
      "title": "Design Study of 30 MeV Linac for a Compact THz Radiation Source",
      "authors": [
        "S. Jummunt",
        "S. Chunjarean",
        "N. Juntong",
        "S. Klinkhieo",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "Synchrotron Light Research Institute (SLRI)",
        "Muang District",
        "Thailand",
        "A compact THz radiation source plays a possibility to achieve intense THz radiation at tunable frequencies between 0.5 and 5.0 THz",
        "with a peak power of several MW and narrow-bandwidth. This source requires essentially the reliable high gradient s-band linear accelerator (linac) to provide an electron beam energy up to 30 MeV with high bunch charge. In order to obtain a high gradient linac mentioned",
        "the cavity structure has been optimized and performed using the software CST. The preliminary design of linac and beam dynamics study are presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt030.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT031",
      "title": "",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt031.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT032",
      "title": "",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt032.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT033",
      "title": "Performance Characterisation at Daresbury Laboratory of Cs-Te Photocathodes Grown at CERN",
      "authors": [
        "L.A.J. Soomary",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "C. Benjamin",
        "H.M. Churn",
        "L.B. Jonespresenter",
        "T.C.Q. Noakes",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "University of Warwick",
        "Coventry",
        "United Kingdom",
        "E. Chevallay",
        "V.N. Fedosseev",
        "E. Granados",
        "M. Himmerlich",
        "H. Panuganti",
        "CERN",
        "Meyrin",
        "Switzerland",
        "L.B. Jonespresenter",
        "T.C.Q. Noakes",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The search for high-performance photocathodes is a priority in the field of particle accelerators. The surface characteristics of a photocathode affect many important factors of the photoemission process including the photoemission threshold",
        "the intrinsic emittance and the quantum efficiency. These factors in turn define the electron beam quality",
        "which is measurable using figures of merit like beam emittance",
        "brightness and energy spread. We present characterisation measurements for four caesium telluride photocathodes synthesized at CERN. The photocathodes were transported under ultra-high vacuum (UHV) and analysed at STFC Daresbury Laboratory",
        "using ASTeC’s Multiprobe (SAPI)* for surface characterisation via XPS and STM",
        "and for Mean Transverse Energy (MTE) measurements using the Transverse Energy Spread Spectrometer (TESS)**. The MTE measurements were estimated at cryogenic and room temperatures based on the respective transverse energy distribution curves. We discuss correlations found between the synthesis parameters",
        "and the measured surface characteristics and MTE values.",
        "*B.L. Militsyn",
        "4-th Eu"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt033.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT034",
      "title": "Controlled Degradation of a Ag Photocathode by Exposure to Multiple Gases",
      "authors": [
        "L.A.J. Soomary",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "L.B. Jonespresenter",
        "T.C.Q. Noakes",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "L.B. Jonespresenter",
        "T.C.Q. Noakes",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The search for high performance photocathode electron sources is a priority in the accelerator science community. The surface characteristics of a photocathode define many important factors of the photoemission process including the work function",
        "the intrinsic emittance and the quantum efficiency of the photocathode. These factors in turn define the ultimate electron beam quality",
        "which is measurable as normalised emittance",
        "brightness and energy spread. Strategies for improving these parameters vary",
        "but understanding and influencing the relevant cathode surface physics which underpin these attributes is a primary focus for the community*. We present performance data under illumination at 266 nm for Ag (100) single-crystal cathode and a Ag polycrystalline cathode after progressive exposure to O2",
        "CO2",
        "CO and N2 using our TESS** instrument both at room and cryogenic temperatures. Crucially the data shows the effect of progressive degradation*** in the photocathode performance as a consequence of exposure to controlled levels of O2 and that exposing an oxidized Ag surface to CO can drive partial QE recovery.",
        "*K.L. Jensen; Appl. Phys. Lett. 89",
        "224103 (2006);  **L.B. Jones et al.; Proc. FEL ’13"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt034.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT035",
      "title": "A Second Generation Light Source Aiming at High Power on the Giant Dipole Resonance",
      "authors": [
        "X. Buffat",
        "L.L. Cuanillon",
        "E.N. Kneubuehler",
        "CERN",
        "Meyrin",
        "Switzerland",
        "We propose an accelerator concept which could enable nuclear waste transmutation and energy amplification using a second generation light source rather than a high power proton beam. The main parameters of the ring and insertion devices are estimated",
        "targeting a photon beam power of 1 GW with a spectrum that maximizes the potential for nuclear reactions via the Giant Dipole Resonance. The synergies with technologies developed for high energy physics",
        "in particular within the Future Circular Collider study (FCC)",
        "are highlighted."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt035.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT036",
      "title": "New Microwave Thermionic Electron Gun for APS Upgrade: Test Results and Operation Experience",
      "authors": [
        "S.V. Kutsaev",
        "R.B. Agustsson",
        "A.C. Araujo Martinez",
        "R.D. Berry",
        "O. Chimalpopoca",
        "A.Y. Murokh",
        "M. Ruelas",
        "A.Yu. Smirnov",
        "S.U. Thielk",
        "RadiaBeam",
        "Santa Monica",
        "California",
        "USA",
        "J.E. Hoyt",
        "W.G. Jansma",
        "A. Nassiri",
        "Y. Sun",
        "G.J. Waldschmidt",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Recently",
        "RadiaBeam has designed and built a robust thermionic RF gun with optimized electromagnetic per-formance",
        "improved thermal engineering",
        "and a robust cathode mounting technique. This gun allows to improve the performance of existing and future light sources",
        "industrial accelerators",
        "and electron beam driven te-rahertz sources. Unlike conventional electrically or side-coupled RF guns",
        "this new gun operates in ’-mode with the help of magnetic coupling holes. Such a design al-lows operation at longer pulses and has negligible dipole and quadrupole components. The gun prototype was built",
        "then installed and tested at the Advanced Photon Source (APS) injector. This paper presents the results of high power and beam tests of this RF gun",
        "and operation-al experience at APS to this moment."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt036.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT037",
      "title": "Ceramics Evaluation for MW-Power Coaxial Windows, Operating in UHF Frequency Range",
      "authors": [
        "S.V. Kutsaev",
        "R.B. Agustsson",
        "P.R. Carriere",
        "N.G. Matavalam",
        "A.Yu. Smirnov",
        "S.U. Thielk",
        "RadiaBeam",
        "Santa Monica",
        "California",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "T.W. Hall",
        "D. Kim",
        "J.T.M. Lyles",
        "K.E. Nichols",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Modern accelerator facilities require reliable high-power RF components. The RF vacuum window is a critical part of the waveguide couplers to the accelerating cavities. It is the point where the RF feed crosses the vacuum boundary and thus forms part of the confinement barrier. RF windows must be designed to have low power dissipation inside their ceramic",
        "be resistant to mechanical stresses",
        "and free of discharges. In this paper",
        "we report on the evaluation of three different ceramic candidates for high power RF windows. These materials have low loss tangents",
        "low secondary electron yield (SEY)",
        "and large thermal expansion coefficients. The acquired materials were inspected",
        "coated",
        "and measured to select the optimal set."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt037.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT038",
      "title": "Sirius Injection Optimization",
      "authors": [
        "X.R. Resende",
        "M.B. Alves",
        "L. Liu",
        "A.C.S. Oliveira",
        "J.V. Quentino",
        "F.H. de Sá",
        "LNLS",
        "Campinas",
        "Brazil",
        "Sirius is the new 3 GeV storage ring (SR)-based 4th generation synchrotron light source built and operated by the Brazilian Synchrotron Light Laboratory (LNLS) located in the CNPEM campus",
        "in Campinas. The foreseeable move to a top-up injection scheme demands improvement of injection efficiency and repeatability levels. In this work we report on the latest efforts in optimizing the Sirius injection system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt038.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT039",
      "title": "Performance Report of the SOLEIL Multipole Injection Kicker",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt039.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT040",
      "title": "Injection Using a Non-Linear Kicker at the ESRF",
      "authors": [
        "S.M. White",
        "T.P. Perronpresenter",
        "ESRF",
        "Grenoble",
        "France"
      ],
      "institutions": [],
      "abstract": "The ESRF injection consists in a standard four kickers bump off-axis injection. Although this scheme is very robust and reliable it is known to disturb users during injections and may represent a severe limitation in case frequent injections are required. The non-linear kicker injection scheme provides a possible solution to this problem by acting only on the injected beam. This paper reports on the potential integration of a non-linear kicker injection scheme at the ESRF. A layout and specifications for the kicker are proposed and simulations are provided to evaluate the performance and limitations of such scheme. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt040.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT041",
      "title": "Commissioning of New Kicker Power Supplies to Improve Injection Perturbations at the ESRF",
      "authors": [
        "S.M. White",
        "N. Carmignani",
        "L.R. Carver",
        "M. Dubrulle",
        "L. Hoummi",
        "M. Morati",
        "T.P. Perronpresenter",
        "B. Roche",
        "ESRF",
        "Grenoble",
        "France",
        "The ESRF-EBS storage ring resumed operation in 2020. Due to the reduced lifetime",
        "top-up injection is required for all operation modes. Perturbations on the stored beam introduced by the pulsed injection elements represent a significant disturbance to the beam lines that need to run experiments across injection. In order to reduce these perturbation",
        "new kicker power supplies with slower ramping times and better shot-to-shot reproducibility were developed at ESRF to improve the efficiency of the feed-forward compensation scheme. This paper reports on the design",
        "commissioning and first experimental validation of these new power supplies."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt041.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT042",
      "title": "Studies for a Laser Wakefield Driven Injector at ELSA",
      "authors": [
        "K. Kranz",
        "K. Desch",
        "D. Elsner",
        "M.T. Switkapresenter",
        "ELSA",
        "Bonn",
        "Germany",
        "At the University of Bonn",
        "Germany",
        "the storage ring ELSA extracts electrons with energies up to 3.2 GeV to hadron physics and novel detector testing experiments. We study the feasibility of replacing the current 26 MeV LINAC injector with a laser wakefield accelerator (LWA). For this",
        "contemporary parameters from current LWA setups at other laboratories are assumed and matched to the acceptance of the booster synchrotron. Moreover",
        "a conceptional draft of a potential LWA setup is created. This takes into consideration the influence of building conditions such as available floor space and building vibrations to estimate a setup and laser beam stability of a plasma generating high power laser system and beamline to the plasma cell. The methods and intermediate results of this study will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt042.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT043",
      "title": "Injection Design Options for the Low-Emittance PETRA IV Storage Ring",
      "authors": [
        "M.A. Jebramcik",
        "I.V. Agapov",
        "S.A. Antipov",
        "R. Bartolini",
        "R. Brinkmann",
        "D. Einfeld",
        "T. Hellert",
        "J. Keil",
        "G. Loisch",
        "F. Obier",
        "DESY",
        "Hamburg",
        "Germany",
        "The proposed PETRA IV electron storage ring that will replace DESY’s flagship synchrotron light source PETRA III will feature a horizontal emittance as low as 20 pm based on a hybrid six-bend achromat lattice. Such a lattice design leads to the difficulty of injecting the incoming beam into an acceptance that is as small as 2.6 um. In contrast to earlier lattice iterations based on a seven-bend achromat lattice",
        "the latest version allows accumulation",
        "i.e.",
        "the off-axis injection of the incoming beam. In this contribution",
        "the effects of deploying different septum types",
        "namely a pulsed or a Lambertson septum",
        "on the injection process as well as the injection efficiency are presented. This analysis includes the effects of common manipulations to the injected beam",
        "e.g.",
        "beam rotation and aperture sharing",
        "on the injection efficiency. Furthermore",
        "the option of a nonlinear kicker and its optimization (wire positions",
        "wire current",
        "optics functions) are presented since a nonlinear kicker could provide an alternative to the rather large number of strip-line kickers that are necessary to generate the orbit bump at the septum."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt043.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT044",
      "title": "The Alkali-Metal Photocathode Preparation Facility at Daresbury Laboratory: First Caesium Telluride Deposition Results",
      "authors": [
        "H.M. Churn",
        "C. Benjamin",
        "L.B. Jones",
        "T.C.Q. Noakes",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "University of Warwick",
        "Coventry",
        "United Kingdom",
        "H.M. Churn",
        "L.B. Jones",
        "T.C.Q. Noakes",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Fourth generation light sources require high brightness electron beams. To achieve this a photocathode with a high quantum efficiency and low intrinsic emittance is required",
        "which is also robust with a long operational lifetime and low dark current. Alkali-metal photocathodes have the potential to fulfil these requirements",
        "so are an important research area for the accelerator physics community. STFC Daresbury Laboratory are currently commissioning the Alkali-metal Photocathode Preparation Facility (APPF) which will be used to grow alkali photocathodes. Photocathodes produced by the APPF will be analysed using Daresbury Laboratory’s existing Multiprobe system* and the Transverse Energy Spread Spectrometer (TESS)**. Multiprobe can perform a variety of surface analysis techniques while the TESS can measure the Mean Transverse Energy of a photocathode from its Transverse Energy Distribution Curve over a large range of illumination wavelengths. We present an overview on our current progress in the commissioning and testing of the APPF",
        "the results from the first Cs-Te deposition and detail the work planned to facilitate the manufacture of Cs2Te photocathodes for the CLARA accelerator***.",
        "*B.L. Militsyn",
        "4th Eu"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt044.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT045",
      "title": "OPAL Simulations of the MESA Injection System",
      "authors": [
        "IKP",
        "Mainz",
        "Germany",
        "HIM",
        "Mainz",
        "Germany",
        "GSI",
        "Darmstadt",
        "Germany",
        "K. Aulenbacher",
        "C.P. Stollpresenter",
        "KPH",
        "Mainz",
        "Germany",
        "The MESA injection system will produce the spin-polarized electron beam for the upcoming accelerator MESA in Germany. The photoemission electron source (STEAM) will deliver 150 uA of spin-polarized electrons from GaAs-based photocathodes for the P2 experiment. Afterwards the low-energy beam transportation system (MELBA) can rotate the spin using two Wien filters and a solenoid for polarization measurements and to compensate for the spin precession in MESA. A chopper and buncher system prepares the phase space for the first acceleration in the normal-conducting pre-booster MAMBO. First OPAL simulation results of MELBA were presented at IPAC’21. Meanwhile these simulations have been extended by a 270-degree-bending alpha magnet as well as the electrostatic and magnetostatic fieldmaps of the Wien filters. Furthermore the fieldmaps of the 4 modules of the pre-accelerator MAMBO have been implemented. Hence",
        "the complete MESA injection system could be simulated in OPAL and the results will be shown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt045.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT047",
      "title": "A Double Dipole Kicker for Off and On-Axis Injection for ALBA-II",
      "authors": [
        "G. Benedetti",
        "M. Carlà",
        "M. Pont",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "Injection into the ALBA-II storage ring will be performed off-axis in a 4 meters straight section with a single multipole kicker. We present a novel topology for the coils of the injection kicker",
        "named double dipole kicker (DDK). The resulting magnetic field is the superposition of two opposite dipoles",
        "generated by four inner and four outer conductor rods. When the eight rods are powered",
        "the dipole term cancels and the remaining multipole field is used for off-axis injection. Alternatively",
        "when the four inner rods are switched off",
        "an almost pure dipole is produced",
        "that is useful for on-axis injection during the commissioning. A prototype of DDK is presently under design to be installed and tested in the existing ALBA storage ring. The positioning of the rods is calculated in order to maximise the kick efficiency in mrad/kA and minimise the disturbance to the orbit and the emittance of the stored beam. A metallic coating with optimised thickness along the inner ceramic vacuum chamber should provide compensation for the eddy currents induced field in order to minimize the disturbance to the stored beam while ensuring sufficiently low heat dissipation by the beam image currents."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt047.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT048",
      "title": "Impact of IDs on the Diamond Storage Ring and Application to Diamond-II",
      "authors": [
        "R.T. Fielder",
        "B. Singhpresenter",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "When investigating the effect of insertion devices (IDs) on storage ring operations",
        "it is not possible to simulate all of the large number of gap",
        "phase and field settings that are available. This can be of particular concern for transient effects in IDs that are moved frequently",
        "or APPLE-II devices which may use many different polarisation states. We therefore present measurements of the impact of selected IDs on various parameters in the current Diamond storage ring including orbit distortion",
        "tunes",
        "chromaticity and emittance",
        "and assess the expected impact when applied to the Diamond-II lattice."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt048.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT049",
      "title": "Beam Dynamics Studies for the Diamond-II Injector",
      "authors": [
        "I.P.S. Martin",
        "R.T. Fielder",
        "J. Kallestrup",
        "T. Olsson",
        "B. Singhpresenter",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "J.K. Jones",
        "B.D. Muratori",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The replacement",
        "low-emittance booster for the Diamond-II project will have a racetrack structure of 36 units cells constructed from alternating focussing and defocussing combined-function dipoles*. In this paper we report on how the design and performance characterisation of the booster has recently developed; this includes an increase in the injection energy from 100 to 150 MeV",
        "a modified circumference to match to the storage ring RF frequency",
        "and a new nominal tune-point to improve the performance and enable emittance exchange. The influence of the vacuum chamber impedance and intra-beam scattering on the electron bunch parameters during the ramp are presented",
        "along with the necessary changes to the transfer line layouts.",
        "*I.P.S. Martin",
        "et al. \"Progress with the Booster Design for the Diamond-II Upgrade\"",
        "in Proc. IPAC’21",
        "paper ID"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt049.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT050",
      "title": "Development and Construction of Cryogenic Permanent Magnet Undulators for ESRF-EBS",
      "authors": [
        "C. Benabderrahmane",
        "P. Brumund",
        "J. Chavanne",
        "D. Coulon",
        "G. Le Bec",
        "B. Ogier",
        "R. Versteegen",
        "ESRF",
        "Grenoble",
        "France",
        "The ESRF Extremely Brilliant Source (ESRF-EBS) is on operation for Users since August 2020 after 20 months of shutdown. This first of a kind fourth generation high energy synchrotron is based on a Hybrid Multi-Bend Achromat lattice. The main goal of the ESRF-EBS is to reduce the horizontal emittance",
        "which leads to a signifi-cant increase of the X-ray source brilliance. To cover the intensive demand of short period small gap undulators at ESRF-EBS",
        "a new design for a 2 m Cryogenic Permanent Magnet Undulator (CPMU) has been developed. Six CPMUs will be installed in the next years; the first two CPMUs have been constructed and actually used on ID15 and ID16 beamline",
        "the third one is under con-structing. An intensive refurbishment work has been done on the existing insertion devices to adapt them to the new accelerator which has shorter straight section and closer dipoles to the IDs than in the old one. This contribution will review the development",
        "construc-tion and commissioning of the new CPMUs",
        "and the refurbishment work done on the existing ones to adapt them to the new accelerator."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt050.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT052",
      "title": "The Status of the In-Vacuum-APPLE II Undulator",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt052.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT053",
      "title": "Goubau-Line Set Up for Bench Testing Impedance of IVU32 Components",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt053.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT056",
      "title": "Emittance Exchange at Sirius Booster for Storage Ring Injection Improvement",
      "authors": [
        "J.V. Quentino",
        "M.B. Alvespresenter",
        "F.H. de Sá",
        "LNLS",
        "Campinas",
        "Brazil",
        "SIRIUS is the new 4th generation storage ring based synchrotron light source built and operated by the Brazilian Synchrotron Light Laboratory (LNLS) at the Brazilian Center for Research in Energy and Materials (CNPEM). Currently",
        "the efficiency of the horizontal off-axis injection system of the storage ring is still not suitable for top-up operation due to a smaller than expected horizontal dynamic aperture. In this work",
        "we report the simulations and experimental results of transverse emittance exchange (TEE) performed at SIRIUS booster by crossing a coupling difference resonance during energy ramp",
        "with the goal of decreasing the injected horizontal beam size and improve the off-axis injection efficiency."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt056.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT058",
      "title": "Status and Powering Test Results of HTS Undulator Coils at 77 K for Compact FEL Designs",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt058.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT059",
      "title": "Development of a Transfer Line for LPA-Generated Electron Bunches to a Compact Storage Ring",
      "authors": [
        "B. Härer",
        "E. Bründermann",
        "D. El Khechen",
        "A.-S. Müller",
        "A.I. Papash",
        "S.C. Richterpresenter",
        "R. Ruprecht",
        "J. Schäfer",
        "M. Schuh",
        "C. Widmann",
        "KIT",
        "Karlsruhe",
        "Germany",
        "Deutsches Elektronen Synchrotron (DESY) and Center for Free Electron Science (CFEL)",
        "Hamburg",
        "Germany",
        "A.R. Maier",
        "J. Osterhoff",
        "E. Panofski",
        "DESY",
        "Hamburg",
        "Germany",
        "University of Hamburg",
        "Hamburg",
        "Germany"
      ],
      "institutions": [
        "The injection of LPA-generated beams into a storage ring is considered to be one of the most prominent applications of laser plasma accelerators (LPAs). In a combined endeavour between Karlsruhe Institute of Technology (KIT) and Deutsches Elektronen-Synchrotron (DESY) the key challenges will be addressed with the aim to successfully demonstrate injection of LPA-generated beams into a compact storage ring with large energy acceptance and dynamic aperture. Such a storage ring and the corresponding transfer line are currently being designed within the cSTART project at KIT and will be ideally suited to accept bunches from a 50 MeV LPA prototype developed at DESY. This contribution presents the foreseen layout of the transfer line from the LPA to the injection point of the storage ring and discusses the status of beams optics calculations."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt059.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT060",
      "title": "Tolerance Study on the Geometrical Errors for a Planar Superconducting Undulator",
      "authors": [
        "V. Grattoni",
        "S. Casalbuonipresenter",
        "B. Marchetti",
        "EuXFEL",
        "Schenefeld",
        "Germany",
        "At the European XFEL",
        "a superconducting afterburner is considered for the"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt060.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT061",
      "title": "European XFEL Undulators - Status and Plans",
      "authors": [
        "S. Casalbuoni",
        "S. Abeghyan",
        "J.E. Baader",
        "U. Englisch",
        "V. Grattoni",
        "S. Karabekyan",
        "B. Marchetti",
        "H. Sinn",
        "F. Wolff-Fabris",
        "M. Yakopov",
        "P. Ziolkowski",
        "EuXFEL",
        "Schenefeld",
        "Germany"
      ],
      "institutions": [],
      "abstract": "European XFEL has three undulator lines based on permanent magnet technology: two for hard and one for soft X-rays. The planar undulators can be tuned to cover the acceptance in terms of photon beam energy of the respective photon beamlines: 3.6-25 keV (",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt061.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT063",
      "title": "Design of Scilab Xcos Simulation Model for Pulsed Wire Method Data Analyses",
      "authors": [
        "NITTTR",
        "Bhopal",
        "India",
        "S.M. Khan",
        "G. Mishra",
        "Devi Ahilya University",
        "Indore",
        "India"
      ],
      "institutions": [],
      "abstract": "Pulsed wire method (PWM)is used for undulator characterisation. Scilab Xcos simulation model is designed for the analyses of data obtained by PWM. The data obtained from PWM is given as input to the model and its output gives the magnetic field of the undulator. Scilab Xcos model can also be utilized for determining the phase error of the undulator. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt063.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT064",
      "title": "Hall Probe Magnetic Measurement of 50 mm Period PPM Undulator",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt064.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT064",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT065",
      "title": "Operation of X-Ray Beam Position Monitors with Zero Bias Voltage at Alba Front Ends",
      "authors": [
        "J. Marcos",
        "U. Irisopresenter",
        "V. Massana",
        "R. Monge",
        "D. Yépez",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "Blade-type X-ray Beam Position Monitors (XBPMs) are customarily operated with a negative bias voltage applied to the blades in order to prevent the transference of photoelectrons between the blades",
        "and hence to maximize the signal at each blade and to avoid cross-talk. This was the selected approach at ALBA since the start of its operation for users in 2012. However",
        "over the years the insulation provided by the ceramic pieces separating the blades from the support structure has degraded progressively",
        "giving rise to an ever-increasing leakage current not related with the photon beam to be monitored. On 2020 the level of these leak currents had already become comparable to the photocurrents generated by the photon beam itself",
        "making the readings from many of the XBPMs unreliable. Following the example from other facilities",
        "we decided to remove the bias voltage from the blades and to test the performance of the XBPMs under these conditions",
        "with such good results that we apply this method also for the new",
        "non degraded",
        "XBPMs. In this paper we present the approach used at ALBA to analyse XBPM data",
        "and our experience operating them with zero bias voltage."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt065.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT066",
      "title": "Helical Wiggler Design for Optical Stochastic Cooling at CESR",
      "authors": [
        "V. Khachatryan",
        "M.B. Andorf",
        "I.V. Bazarov",
        "J.A. Crittenden",
        "S.J. Levenson",
        "J.M. Maxson",
        "D.L. Rubin",
        "J.P. Shanks",
        "S. Wang",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "A helical wiggler with parameter kund=4.35 has been designed for the Optical Stochastic Cooling (OSC) experiment in the Cornell Electron Storage Ring (CESR). We consider four Halbach arrays",
        "which dimensions are optimized to get the required helical field profile",
        "as well as",
        "to get the best Dynamic Aperture (DA) in simulations. The end poles are designed with different dimensions to minimize the first and second field integrals to avoid the need of additional correctors for the beam orbit. The design is adopted to minimize the risks for the magnet blocks demagnetization. To quantify the tolerances",
        "we simulated the effects of different types of geometrical and magnetic field errors on the OSC damping rates. In addition",
        "to understand the challenges for the construction",
        "as well as",
        "to validate the model field calculations",
        "we prototyped a small two period version. The prototype field is compared to the model",
        "and the results are presented in this work."
      ],
      "institutions": [
        "Funding: The authors thank the Center for Bright Beams, NSF award PHY-1549132; W.F.B. was supported by the NSF Graduate Research Fellowship Program under grant number DGE-1650441."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt066.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT067",
      "title": "Propagation of Gaussian Wigner Function Through a Matrix-Aperture Beamline",
      "authors": [
        "B. Nash",
        "D.T. Abell",
        "P. Moeller",
        "I.V. Pogorelov",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt067.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOPT068",
      "title": "Linear Canonical Transform Library for Fast Coherent X-Ray Wavefront Propagation",
      "authors": [
        "B. Nash",
        "D.T. Abell",
        "P. Moeller",
        "I.V. Pogorelov",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpopt068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpopt068.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpopt068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOPT068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 59,
  "scrape_time": "2025-10-10 18:43:51"
}