{
  "session_info": {
    "id": "WEIX",
    "name": "WEIX - Industry Session",
    "url": "https://proceedings.jacow.org/ipac2021/html/weix.htm"
  },
  "papers": [
    {
      "paper_id": "WEIX01",
      "title": "DOE’s Office of Accelerator R&D and Production",
      "authors": [
        "OHEP/DOE",
        "Germantown",
        "Maryland",
        "USA",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "The Office of Accelerator R&D and Production (ARDAP) was formed in April 2020 in recognition of the central importance of accelerators and related technologies to the current and future scientific capabilities stewarded by the DOE Office of Science. ARDAP’s mission is to understand and address accelerator science and technology gaps and accelerator component production gaps that may negatively impact future US accelerator-based physical science R&D priorities. The talk will include an overview of ARDAPs activities and how it coordinates accelerator activities with other programs within the Office of Science. reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/weix01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/weix01.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/weix01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEIX01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEIX02",
      "title": "Effective Software Collaboration Between Industry and National Labs",
      "authors": [
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "The development and implementation of algorithms is a core competency of universities and research labs; however",
        "the resulting codes can be difficult to use and expensive to maintain. Professional software developers could help to resolve the problem",
        "but they are expensive to hire and difficult to retain. Retention difficulties and associated career pipeline problems are due in part to misaligned incentives. For example",
        "making software sustainable and easy-to-use is orthogonal to publishing in academic journals and",
        "perhaps more problematic",
        "the scientific mission of national laboratories and university departments often does not motivate software developers and data scientists sufficiently to retain them. In contrast",
        "software sustainability and ease-of-use are core competencies of software developers in industry. Hence",
        "it is advantageous for national laboratories and universities to actively and routinely collaborate with industry. This more varied range of employment opportunities and internal institutional incentives will also offer possibilities for more varied career paths and",
        "perhaps",
        "better retention of talented individuals within the community.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/weix02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/weix02.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/weix02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEIX02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEIX03",
      "title": "Collaboration Between Industry and Research Institutes: A Win-Win Approach in Large Research Projects",
      "authors": [
        "P. Manini",
        "M. Campaniello",
        "E. Maccallini",
        "M. Mura",
        "T. Porcelli",
        "SAES Getters S.p.A.",
        "Lainate",
        "Italy",
        "M. Canetti",
        "F. Gangini",
        "C. Santini",
        "T.F. Sinkovits",
        "SAES RIAL Vacuum",
        "Parma",
        "Italy",
        "Large research infrastructures and projects are progressively pushing the technological envelop to the limits. The need to increase performances of accelerators and experimental machines requires the adoption of innovative approaches",
        "new materials and configurations as well as efficient and timely management of complex tasks. Manufacturability of reproducible serial products and component with high level technical specifications is key to deliver consistent and reliable performances in the final experiment. In the present talk we report on the experience gathered by SAES Group working on research projects requiring the production of very demanding items. The industrial approach has resulted to be beneficial to improve the design of the products and provide stable performances. On the other hand",
        "the interaction with the research Institutes has been extremely valuable to stimulate new ideas and to find technological solution to challenging problems. This has finally brought to an increase of the company product portfolio and a more competitive technology offer.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/weix03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/weix03.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/weix03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEIX03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 18:54:05"
}