{
  "session_info": {
    "id": "WEOANO",
    "name": "WEOANO - Novel Concepts",
    "url": "https://proceedings.jacow.org/FEL2013/html/weoano.htm"
  },
  "papers": [
    {
      "paper_id": "WEOANO01",
      "title": "New Scheme to Generate a Multi-terawatt and Attosecond X-ray Pulse in XFELs",
      "authors": [
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "A new scheme to be applied in XFELs has been recently proposed*",
        "which effectively compresses the X-ray pulse",
        "i.e.",
        "shortens the pulse length and enhances the peak power by means of inducing a periodic current enhancement with an optical laser and applying a temporal shift between the X-ray and electron beams. In this paper",
        "detailed mechanism of the new scheme is explained together with numerical results applied to the SACLA XFEL facility.",
        "*T. Tanaka",
        "PRL 110",
        "084801 (2013)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/weoano01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/weoano01.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/weoano01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-WEOANO01",
      "page_number": "464",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOANO03",
      "title": "Longitudinal Coherence in an FEL With a Reduced Level of Shot Noise",
      "authors": [
        "Private Address",
        "Uppsala",
        "Sweden",
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "For a planar free electron laser (FEL) configuration we study self-amplified coherent spontaneous emission driven by a gradient of the bunch current in the presence of different levels of noise in bunches [1]. We calculate the probability density distribution of the maximum power of the radiation pulses for different levels of shot noise. It turns out that the temporal coherence quickly increases as the noise level reduces. We also show that the FEL based on coherent spontaneous emission produces almost Fourier transform limited pulses and the time-bandwidth product is mainly determined by the bunch length and the interaction distance in an undulator. We also propose a scheme that permits the formation of electron bunches with a reduced level of noise and a high gradient of the current at the bunch tail to enhance coherent spontaneous emission. The presented scheme uses effects of noise reduction and controlled microbunching instability and consists of a laser heater",
        "a bunch compressor",
        "and a shot noise suppression section. The noise factor and microbunching gain of the overall proposed scheme with and without laser heater are estimated.",
        "V.A. Goryashko and V. Ziemann",
        "Phys. Rev. ST Accel. Beams 16",
        "030702 (2013)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/weoano03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/weoano03.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/weoano03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-WEOANO03",
      "page_number": "469",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOANO04",
      "title": "Two-stream Instability at Soft X-ray Wavelengths for Increasing Brightness of Compton Sources",
      "authors": [
        "N.A. Yampolsky",
        "G.L. Delzanno",
        "C. Huang",
        "D.Y. Shchegolkov",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA"
      ],
      "institutions": [],
      "abstract": "Two-stream instability at soft X-ray wavelengths for increasing brightness of Compton sources. We propose a novel scheme which may result in the next generation Compton source for soft X-rays. The scheme is based on creating an electron beam distribution consisting of several energy bands and allowing for the two-stream instability to develop resulting in a short scale density modulation. The multi-stream beam distribution is created within a single bunch through EEHG mechanism which results in well separated bands with close energies. The wavelength of the microbunching caused by the two-stream instability strongly depends on the beam parameters and can be reduced down to soft X-ray wavelengths that are not achievable with other mechanisms. The microbunching can be used for",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/weoano04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/weoano04.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/weoano04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-WEOANO04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:32:01"
}