{
  "session_info": {
    "id": "TUIOA",
    "name": "TUIOA - Basic R&D Bulk Niobium - High Performances",
    "url": "https://proceedings.jacow.org/SRF2013/html/tuioa.htm"
  },
  "papers": [
    {
      "paper_id": "TUIOA01",
      "title": "Influence of the Couldown at the Transition Temperature on the SRF Cavity Quality Factor",
      "authors": [
        "O. Kugeler",
        "J. Knobloch",
        "J.M. Vogt",
        "HZB",
        "Berlin",
        "Germany",
        "The quality factor Q0 that can be obtained in a superconducting cavity is known to depend on various factors like niobium material properties",
        "treatment history and magnetic shielding. We believe that cooling conditions have an additional impact",
        "as they appear to influence the amount of trapped flux and hence the residual resistance. We constructed a test stand using a niobium rod shorted out by a titanium rod to mimic a cavity in its helium tank to study flux trapping. Here we can precisely control the temperature and measure the dynamics of flux trapping at the superconducting phase transition. We learned that magnetic flux can be generated when a temperature gradient exists along the rod and when the niobium transitions into the superconducting state it subsequently remains trapped. Furthermore",
        "it was shown that the cooling rate during isothermal cooldown through the transition temperature can influence the amount of externally applied flux which remains trapped. The acquired knowledge may be used to modify the cooldown procedure of SRF cavities leading to a reduced level of trapped flux and hence operation closer to the BCS limit."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/tuioa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/tuioa01.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/tuioa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-TUIOA01",
      "page_number": "370",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUIOA02",
      "title": "High Q0 Research: The Dynamics of Flux Trapping in Superconducting Niobium",
      "authors": [
        "HZB",
        "Berlin",
        "Germany",
        "J. Knobloch",
        "O. Kugeler",
        "BESSY GmbH",
        "Berlin",
        "Germany",
        "The quality factor Q0 that can be obtained in a superconducting cavity is known to depend on various factors like niobium material properties",
        "treatment history and magnetic shielding. We believe that cooling conditions have an additional impact",
        "as they appear to influence the amount of trapped flux and hence the residual resistance. We have constructed a test stand using niobium rods to study flux trapping. Here we can precisely control the temperature and measure the dynamics of flux trapping at the superconducting phase transition. We learned that magnetic flux can be generated when a temperature gradient exists along the rod as the niobium transitions to the superconducting state",
        "which subsequently remains trapped. It was also shown that the cooling rate can influence the amount of externally applied flux which is trapped. Furthermore",
        "we also were able to demonstrate that flux lines become mobile if the superconductor is warmed close to below Tc. The acquired knowledge may be used to modify the cooldown procedure of SRF cavities leading to a reduced level of trapped flux and hence operation closer to the BCS limit."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/tuioa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/tuioa02.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/tuioa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-TUIOA02",
      "page_number": "374",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUIOA03",
      "title": "New Insights on the Physics of RF Surface Resistance and a Cure for the Medium Field Q-Slope",
      "authors": [
        "Fermilab",
        "Batavia",
        "USA",
        "In this talk we will present the first deconvolution of surface resistance into BCS and residual resistance as a function of field for differently processed niobium cavities",
        "which provides new insights on the physics of RF surface resistance. Then",
        "new cavity results will be presented where record low values of surface resistances have been achieved. New processing strategies such as annealing and heat treatments in partial pressure of certain gases will be presented",
        "complemented by surface studies. Via these treatments BCS resistances decreasing with the applied field have been reproducibly observed on several cavities",
        "inverting the typical 'medium field Q-slope' trend. These findings represent a long sought solution to the the medium field Q-slope problem."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/tuioa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/tuioa03.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/tuioa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-TUIOA03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUIOA04",
      "title": "Q-Slope Studies at Fermilab: New Insight From Cavity and Cutouts Investigations",
      "authors": [
        "Fermilab",
        "Batavia",
        "USA",
        "In this talk we will present recent cavity experiments (sequential HF",
        "irradiation",
        "temperature mapping) and sample investigations (positron annihilation",
        "low energy and bulk muSR",
        "Bitter decoration",
        "LCSM cold stage hydride imaging",
        "TEM/STEM and SEM room/cryogenic imaging etc)",
        "which are providing new insight on the physical mechanisms behind phenomena leading to Q slope. New findings on relevant mechanisms at work during 120C and 600-800C heat treatments and electropolishing/BCP will also be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/tuioa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/tuioa04.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/tuioa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-TUIOA04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUIOA05",
      "title": "New Insights Into Quench Caused by Surface Pits in SRF Cavities",
      "authors": [
        "Y. Xie",
        "M. Liepe",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Surface defects such as pits have been identified as some of the main sources of limitations of srf cavity performance. A single cell cavity with 30 artificial pits in the high magnetic field region was made to gain new insight in how pits limit the cavity performance*. The test of the pit cavity showed clear evidence that the edges of two of the largest radius pits transitioned into the normal conducting state at field just below the quench field of the cavity",
        "and that the quench was indeed induced by these two pits. The pit geometrical information measured by laser confocal microscopy combined with a numerical finite element ring-type defect model will be compared with temperature mapping results. Insights about quench and non-linear rf resistances will be presented.",
        "*Y. Xie",
        "PhD thesis",
        "Cornell University",
        "2013"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/tuioa05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/tuioa05.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/tuioa05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-TUIOA05",
      "page_number": "378",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUIOA06",
      "title": "Research on Field Emission and Dark Current in ILC Cavities",
      "authors": [
        "Y.M. Li",
        "K.X. Liu",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "R.L. Geng",
        "A.D. Palczewski",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "Field emission and dark current are issues of concern for SRF cavity performance and SRF linac operation. Complete understanding and reliable control of the issue are still needed",
        "especially in full-scale multi-cell cavities. Our work aims at developing a generic procedure for finding an active field emitter in a multi-cell cavity and benchmarking the procedure through cavity vertical test. Our ultimate goal is to provide feedback to cavity preparation and cavity string assembly in order to reduce or eliminate filed emission in SRF cavities. Systematic analysis of behaviors of field emitted electrons is obtained by ACE3P developed by SLAC. Experimental benchmark of the procedure was carried out in a 9-cell cavity vertical test at JLab. The energy spectrum of Bremsstrahlung X-rays is measured using a NaI(Tl) detector. The end-point energy in the X-ray energy spectrum is taken as the highest kinetic electron energy to predict longitudinal position of the active field emitter. Angular location of the field emitter is determined by an array of silicon diodes around irises of the cavity. High-resolution optical inspection was conducted at the predicted field emitter location."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/tuioa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/tuioa06.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/tuioa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-TUIOA06",
      "page_number": "392",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 04:12:12"
}