{
  "session_info": {
    "id": "TUAD",
    "name": "TUAD - Contributed Orals (MC7)",
    "url": "https://proceedings.jacow.org/IPAC2015/html/tuad.htm"
  },
  "papers": [
    {
      "paper_id": "TUAD1",
      "title": "Magnet Design and Control of Field Quality for TPS Booster and Storage Rings",
      "authors": [
        "J.C. Jan",
        "C.H. Chang",
        "C.-T. Chen",
        "H.H. Chen",
        "Y.L. Chu",
        "M.-H. Huang",
        "C.-S. Hwang",
        "C.Y. Kuo",
        "F.-Y. Lin",
        "G.-H. Luo",
        "I.C. Sheng",
        "C.S. Yang",
        "Y.T. Yu",
        "NSRRC",
        "Hsinchu",
        "Taiwan"
      ],
      "institutions": [],
      "abstract": "High-quality and very demanding magnets were designed, fabricated, field quality controlled and installed in the Taiwan Photon Source (TPS). The Storage Ring (SR) lattice is based on double-bend achromat structure with 1.6 nm-rad emittance and slight dispersion in straight sections. The fabrication and field measurement of these magnets were completed in Oct. 2013. The first synchrotron light from TPS storage ring, without applying any corrector at 3 GeV, was observed on Dec. 31, 2014. It indicates that the profile precision and field quality of magnets, and girders alignment reach world class standard. The integral multipoles components of the 240 SR quadrupole and 168 SR sextupole magnets conform to strict specifications. The maximum offset of measured mechanical center in magnets is better than 0.01 mm after feet shimming. The magnetic center offset of the magnets is within 0.02 mm inspected by rotating-coil method. The magnets’ field quality of booster’s pure quadrupole and combined-function quadrupole were accepted according to the errors specifications from beam dynamics and also in the beam commissioning. A permeability study of vacuum chamber was implemented during the booster ring hardware testing. The magnetic field of magnets is distorted by the permeability of vacuum chamber. Study of multipole errors due to magnetized vacuum chamber inside the magnet will be discussed.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tuad1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tuad1.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tuad1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUAD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUAD2",
      "title": "Comparison between Measured and Computed Temperatures of the Internal High Energy Beam Dump in the CERN SPS",
      "authors": [
        "G.E. Steele",
        "R. Folch",
        "V. Kain",
        "I.V. Leitao",
        "R. Losito",
        "C. Maglioni",
        "F. Pasdeloup",
        "A. Perillo-Marcone",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "The SPS high energy internal dump (TIDVG) is designed to receive beam dumps from 102.2 to 450 GeV. The absorbing core is composed of 2.5m graphite",
        "followed by 1m of aluminium",
        "then 0.5m of copper and finally 0.3m of tungsten",
        "all of which is surrounded by a water cooled copper jacket. An inspection during Long Shutdown 1 revealed significant beam induced damage to the Al section of the dump block. Temperature sensors were installed to monitor the new dump replacing the damaged one. This paper summarises the correlation between the temperature measured as a function of the energy deposited and the same temperatures computed in a numerical model combining FLUKA and ANSYS simulations. The goal of this study is the assessment of the thermal contact quality between the beam absorbing blocks and the copper jacket",
        "by analysing the cooling times observed from the measurements and from the thermo-mechanical simulations. This paper presents an improved method to estimate the efficiency and long term reliability of the cooling of this type of design",
        "with the view of optimising the performance of future dump versions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tuad2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tuad2.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tuad2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUAD2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUAD3",
      "title": "LLRF Commissioning of the European XFEL RF Gun and Its First Linac RF Station",
      "authors": [
        "J. Branlard",
        "G. Ayvazyan",
        "V. Ayvazyan",
        "Ł. Butkowski",
        "M.K. Grecki",
        "M. Hoffmann",
        "F. Ludwig",
        "U. Mavrič",
        "M. Omet",
        "S. Pfeiffer",
        "K.P. Przygoda",
        "H. Schlarb",
        "Ch. Schmidt",
        "H.C. Weddig",
        "B.Y. Yang",
        "DESY",
        "Hamburg",
        "Germany",
        "S. Bou Habib",
        "K. Czuba",
        "M. Grzegrzółka",
        "E. Janas",
        "K. Oliwa",
        "J. Piekarski",
        "K.T. Pozniak",
        "I. Rutkowski",
        "R. Rybaniec",
        "D. Sikora",
        "W. Wierba",
        "L.Z. Zembala",
        "M. Żukociński",
        "Warsaw University of Technology",
        "Institute of Electronic Systems",
        "Warsaw",
        "Poland",
        "W. Cichalewski",
        "D.R. Makowski",
        "A. Mielczarek",
        "P. Perek",
        "TUL-DMCS",
        "Łódź",
        "Poland",
        "FastLogic Sp. z o.o.",
        "Łódź",
        "Poland",
        "The European X-ray free electron laser (XFEL) at the Deutsches Elektronen-Synchrotron (DESY)",
        "Hamburg Germany is in its construction phase. Approximately a third of the super-conductive cryomodules have been produced and tested. The RF gun is installed since 2013; periods of commissioning are regularly scheduled between installation phases of the rest of the injector. The first linac",
        "L1",
        "consisting of 4 cryomodules powered by one 10 MW klystron is installed and being commissioned. This contribution reports on the installation and preparation work of the low-level radio frequency system (LLRF) to perform the commissioning of the XFEL first components. The commissioning plans",
        "schedule and first results are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tuad3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tuad3.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tuad3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUAD3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 20:24:24"
}