{
  "session_info": {
    "id": "TUBPL",
    "name": "TUBPL - Data Management",
    "url": "https://proceedings.jacow.org/icalepcs2019/html/tubpl.htm"
  },
  "papers": [
    {
      "paper_id": "TUBPL01",
      "title": "Automatic Web Application Generation From an Irradiation Experiment Data Management Ontology (IEDM)",
      "authors": [
        "B. Gkotse",
        "F. Ravotti",
        "CERN",
        "Meyrin",
        "Switzerland",
        "B. Gkotse",
        "P. Jouvelot",
        "MINES ParisTech",
        "PSL Research University",
        "Paris",
        "France",
        "Detectors and electronic components in High-Energy Physics experiments are nowadays often exposed to harsh radiation environments. Thus",
        "to insure reliable operation over time",
        "their radiation tolerance must be assessed beforehand through dedicated testing experiments in irradiation facilities. To prevent data loss and perform accurate experiments",
        "these facilities need to rely upon a proper data management system. In prior work",
        "we provided a formal description of the key concepts involved in the data management of irradiation experiments using an ontology (IEDM)*. In this work",
        "we show how this formalisation effort has a practical by-product via the introduction of an ontology-based methodology for the automatic generation of web applications",
        "using IEDM as a use case. Moreover",
        "we also compare this IEDM-generated web application to the IRRAD Data Manager (IDM)",
        "the manually developed web application used for the data handling of the CERN Proton Irradiation facility (IRRAD). Our approach should allow irradiation facility teams to gain access to state-of-the-art data management tools without incurring significant software development effort."
      ],
      "institutions": [],
      "abstract": "*Gkotse, B., Jouvelot, P., Ravotti, F.: IEDM: An Ontology for Irradiation Experiments Data Management. In: Extended Semantic Web Conference 2019, accepted in Posters and Demos. http://cern.ch/iedm",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/tubpl01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/tubpl01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/tubpl01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-TUBPL01",
      "page_number": "687",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBPL02",
      "title": "Enabling Open Science for Photon and Neutron Sources",
      "authors": [
        "A. Götz",
        "J. Bodera Sempere",
        "A. Campbell",
        "A. De Maria Antolinos",
        "R.D. Dimper",
        "J. Kieffer",
        "V.A. Solé",
        "T. Vincet",
        "ESRF",
        "Grenoble",
        "France",
        "M. Bertelsen",
        "T. Holm Rod",
        "T.S. Richter",
        "J.W. Taylor",
        "ESS",
        "Copenhagen",
        "Denmark",
        "CERIC-ERIC",
        "Trieste",
        "Italy",
        "S. Caunt",
        "J. Hall",
        "J.F. Perrin",
        "ILL",
        "Grenoble",
        "France",
        "J.C. E",
        "H. Fangohr",
        "C. Fortmann-Grote",
        "T.A. Kluyver",
        "R. Rosca",
        "EuXFEL",
        "Schenefeld",
        "Germany",
        "ELI-DC",
        "Brussels",
        "Belgium",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "ELI-ALPS",
        "Szeged",
        "Hungary",
        "Photon and Neutron sources are producing more and more petabytes of scientific data each year. At the same time scientific publishing is evolving to make scientific data part of publications. The Photon and Neutron Open Science Cloud (PaNOSC*) project is a EU financed project to provide scientific data management for enabling Open Science. Data will be managed according to the FAIR principles. This means data will be curated and made available under an Open Data policy",
        "findable",
        "interoperable and reusable. This paper will describe how the European photon and neutron sources on the ESFRI** roadmap envision PaNOSC as part of the European Open Science Cloud***. The paper will address the issues of data policy",
        "metadata",
        "data curation",
        "long term archiving and data sharing in the context of the latest developments in these areas."
      ],
      "institutions": [],
      "abstract": "*https://panosc.eu  **https://www.esfri.eu/  **https://ec.europa.eu/research/openscience/index.cfm?pg=open-science-cloud",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/tubpl02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/tubpl02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/tubpl02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-TUBPL02",
      "page_number": "694",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBPL03",
      "title": "Experimental Data Transfer System BENTEN at SPring-8",
      "authors": [
        "T. Matsumoto",
        "Y. Furukawa",
        "Y. Hiraoka",
        "M. Kodera",
        "T. Matsushita",
        "K. Nakada",
        "A. Yamashita",
        "S. Yokota",
        "JASRI",
        "Hyogo",
        "Japan",
        "Recently",
        "there are strong demands on open data to promote data science like material informatics. At SPring-8",
        "we have been operated data transfer system for open data of XAFS measurements since 2013* with the second in the world for amount data**. However",
        "it was difficult to satisfy demands such as generic uses in experimental stations and data federation with other facilities. To overcome these",
        "we newly developed data transfer system BENTEN. BENTEN provides easy-to-use and unified interface with REST API for data access from both inside and outside SPring-8. At SPring-8",
        "proposal number is assigned for each experiment and members in the proposal are defined in DB. BENTEN can also realize restricted data access with the members using authentication and the DB. Data registration was performed with metadata such as experimental conditions and samples. Various metadata in the experiments can be easily defined. To achieve flexible data access with full-text search",
        "we used Elasticsearch as metadata store. We began operation of BENTEN and open access of XAFS data since March this year. We plan to utilize BENTEN to promote open data and data science also with other experimental data.",
        "*H. Sakai et al.",
        "Proc. of ICALEPCS 2013",
        "p.577-579  **K. Asakura et al.",
        "J. Synchrotron Rad. (2018)",
        "25",
        "p.967-971"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/tubpl03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/tubpl03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/tubpl03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-TUBPL03",
      "page_number": "702",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBPL04",
      "title": "Public Cloud-based Remote Access Infrastructure for Neutron Scattering Experiments at MLF, J-PARC",
      "authors": [
        "CROSS",
        "Ibaraki",
        "Japan",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "An infrastructure for remote access supporting research workflow is essential for neutron scattering user facilities such as J-PARC MLF. Because the experimental period spans day and night",
        "service monitoring the measurement status from outside the facility is required. Additionally",
        "convenient way to bring a large amount of data back to user’s home institution and to analyze it after experiments is required. To meet these requirements",
        "we are developing a remote access infrastructure as a front-end for facility users based on public clouds. Recently",
        "public clouds have been rapidly developed",
        "so that development and operation schemes of computer systems have changed considerably. Various architectures provided by public clouds enable advanced systems to develop quickly and effectively. Our cloud-based infrastructure comprises services for experimental monitoring",
        "data download and data analysis",
        "using architectures",
        "such as object storage",
        "event-driven server-less computing",
        "and virtual desktop infrastructure (VDI). Facility users can access this infrastructure using a web browser and a VDI client. This contribution reports the current status of the remote access infrastructure."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/tubpl04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/tubpl04.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/tubpl04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-TUBPL04",
      "page_number": "707",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBPL05",
      "title": "RecSyncETCD: A Fault-tolerant Service for EPICS PV Configuration Data",
      "authors": [
        "T. Ashwarya",
        "E.T. Berryman",
        "M.G. Konrad",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/tubpl05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/tubpl05.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/tubpl05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-TUBPL05",
      "page_number": "714",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBPL06",
      "title": "Energy Consumption Monitoring With Graph Databases and Service Oriented Architecture",
      "authors": [
        "A. Kiourkos",
        "S. Infante",
        "K.S. Seintaridis",
        "CERN",
        "Meyrin",
        "Switzerland",
        "CERN is a major electricity consumer. In 2018 it consumed 1.25 TWh",
        "1/3 the consumption of Geneva. Monitoring of this consumption is crucial for operational reasons but also for raising awareness of the users regarding energy utilization. This monitoring is done via a system",
        "developed internally and is quite popular within the CERN community therefore to accommodate the increasing requirements",
        "a migration is underway that utilizes the latest technologies for data modeling and processing. We present the architecture of the new energy monitoring system with an emphasis on the data modeling",
        "versioning and the use of graphs to store and process the model of the electrical network for the energy calculations. The algorithms that are used are presented and a comparison with the existing system is performed in order to demonstrate the performance improvements and flexibility of the new approach. The system embraces the Service Oriented Architecture principles and we illustrate how these have been applied in its design. The different modules and future possibilities are also presented with an analysis of their strengths",
        "weaknesses",
        "and integration within the CERN infrastructure."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/tubpl06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/tubpl06.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/tubpl06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-TUBPL06",
      "page_number": "719",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-10 18:10:33"
}