{
  "session_info": {
    "id": "TUPE",
    "name": "TUPE - Poster Session",
    "url": "https://proceedings.jacow.org/medsi2016/html/tupe.htm"
  },
  "papers": [
    {
      "paper_id": "TUPE01",
      "title": "DMM Thermal Mechanical Design",
      "authors": [
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "A Double Multilayer Monochromator (DMM) was designed in-house for the VMXi beamline. Thermal mechanical finite element analysis was performed to design a novel optic geometry",
        "employing In/Ga eutectic cooling. The integration of a DMM into the existing beamline required additional power management components",
        "such as a low energy power filter",
        "a power detector and compact CuCrZr masks. This paper describes the thermal management challenges and their solutions. The DMM has been fully commissioned and is operational within the original I02 beamline."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE01",
      "page_number": "152",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE02",
      "title": "Experimental Validated CFD Analysis on Helium Discharge",
      "authors": [
        "J.-C. Chang",
        "Y.C. Chang",
        "F.Z. Hsiao",
        "S.P. Kao",
        "H.C. Li",
        "W.R. Liao",
        "C.Y. Liu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Synchrotron Radiation Research Center in Taiwan (NSRRC) had set up three cryogenic systems to provide liquid helium to superconducting radio-frequency (SRF) cavities",
        "insertion devices",
        "and highly brilliant hard X-ray. The first one could produce liquid helium 134 LPH",
        "with maximum cooling capacity of 469 W at 4.5 K. The second one could produce liquid helium 138 LPH",
        "with maximum cooling capacity of 475 W at 4.5 K. The third one could produce liquid helium 239 LPH",
        "with maximum cooling capacity of 890 W at 4.5 K. However",
        "large liquid helium discharge in a closed space will cause personnel danger of lack of oxygen. We performed Computational Fluid Dynamic (CFD) simulation to analyse helium discharge through a SRF cavity in the Taiwan Light Source (TPS) tunnel. We simulated cases of helium discharge flow rates from 0.1 kg/s to 4.2 kg/s with and without fresh air supplied from the air conditioning system. We also set up both physical and numerical models within a space of 2.4m in length",
        "1.2m in width and 0.8m in height with nitrogen discharge inside to validate the CFD simulation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE02",
      "page_number": "156",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE04",
      "title": "Coherent Soft X-Ray EPU Vacuum Chamber Thermal Analysis for Synchrotron Radiation Protection",
      "authors": [
        "H.C. Fernandes",
        "P.L. Cappadoro",
        "D.A. Harder",
        "D.A. Hidas",
        "C.A. Kitégi",
        "M. Musardo",
        "J. Rank",
        "T. Tanabe",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The purpose of this study was to determine the effect of beam mis-steering",
        "on the temperature of the vacuum chamber. The chamber used for this study was for the Coherent Soft X-Ray (CSX) Elliptically Polarizing Undulator (EPU). Finite Element Analysis was conducted on the vacuum chamber to determine the temperature distribution on the chamber for set values of beam mis-steer",
        "for NSLS-II. These results were then compared with on-site temperature measurements taken using RTD¿s",
        "as well as thermal sensitive cameras. The accuracy of these results was analyzed and further FEA studies were proposed for steeper beam mis-steers and beam offsets."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe04.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE04",
      "page_number": "159",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPE05",
      "title": "Numerical Simulation of the ALBA Synchrotron Light Source Cooling System Response for Failure Prevention",
      "authors": [
        "UPC",
        "Barcelona",
        "Spain",
        "J.J. Casas",
        "C. Colldelram",
        "M. Prietopresenter",
        "M. Quispe",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "The ALBA Synchrotron Light Source cooling system is designed with a common return pipe that interconnects the four consumption rings. Such configuration is believed to compromise its optimal operation. To understand its thermo-fluid dynamic behaviour",
        "a detailed 1D model has been built comprising all the components such as the pipes",
        "fittings",
        "bends",
        "valves",
        "pumping stations",
        "heat exchangers and so on",
        "and the various regulation mechanisms. Preliminarily",
        "the model results in steady state operating conditions have been compared with experimental measurements and the maximum deviations have been found below 13%. Then",
        "a series of transient numerical simulations have been carried out to determine the system response. Specifically",
        "effects of the blockage and leakage of a consumption line as well as the increase and decrease of heat duty for the tunnel rings have been investigated. As a result",
        "the stability of the system has been evaluated and the operational limits have been estimated in front of hydraulic and thermal load variations. Moreover",
        "particular behaviors have been identified which can be used to design monitoring and control strategies to prevent unexpected failures."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe05.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE05",
      "page_number": "162",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE06",
      "title": "Thermo-Fluid Numerical Simulation of the Crotch Absorbers’ Cooling Pinholes for ALBA Storage Ring",
      "authors": [
        "X. Escaler",
        "V. Arbo Sangüesa",
        "UPC",
        "Barcelona",
        "Spain",
        "J.J. Casas",
        "C. Colldelram",
        "M. Prieto",
        "M. Quispepresenter",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "The ALBA Synchrotron Light Facility crotch absorbers",
        "that remove the unused storage ring radiation",
        "incorporate an internal cooling system composed by a number of parallel pinholes and by the corresponding stainless steel inner tubes inserted into each of them. Water flows in the resulting annular sections to evacuate the total heat power. Around each inner tube",
        "a spiral wire is fixed along the whole length with a given pitch height in order to enhance the convection heat transfer. The influence of several design parameters on the absorber thermo-fluid behavior has been evaluated by means of the CFD software ANSYS CFX. In particular",
        "the wall heat transfer coefficients and the pressure losses through a single pinhole have been evaluated for a range of different flow rates and pitch heights. Moreover",
        "some modifications of the end wall geometry have been simulated as well as the effect of reversing the flow direction inside the channels. Finally",
        "the critical crotch absorber type 3 has also been simulated and the limiting pitch height-flow rate combinations have been found based on the available driving pressure of the cooling system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe06.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE06",
      "page_number": "165",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE08",
      "title": "Finite Element Analysis of a Photon Absorber Based on Volumetric Absorption of the Photon Beam",
      "authors": [
        "K.J. Suthar",
        "P.K. Den Hartog",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Designing photon absorbers for next generation multibend achromat storage rings can be challenging considering the high power densities and limited space that will typically be present. The potential for problematically high material temperatures and thermal gradients can be expected to be greater than that for previous generation machines on account of the shorter source-to-receiving surface distances. Conventionally",
        "photon absorbers are made from copper which is highly opaque to x-rays. A consequence of this is that the majority of the heat is absorbed within a very short distance of the surface. Utilizing materials that allow a more volumetric absorption of the radiation can improve the efficiency of heat removal as it can keep surface temperatures and thermal gradients lower than would otherwise be possible. This paper discusses multiphysics analysis of a crotch absorber for the APS Upgrade project (APS-U) via full-coupling of heat-transfer and structural mechanics. The simulation results are discussed in detail."
      ],
      "institutions": [
        "Funding: This research used resources of the APS, a U.S. Department of Energy (DOE) Office of Science User Facility operated by Argonne National Laboratory under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe08.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE08",
      "page_number": "169",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE09",
      "title": "Thermo-Fluid Study of the UPC Race-Track Microtron Cooling System",
      "authors": [
        "X. Escaler",
        "V. Blasco",
        "Yu.A. Kubyshin",
        "J.A. Romero",
        "A. Sanchez",
        "UPC",
        "Barcelona",
        "Spain",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "SINP MSU",
        "Moscow",
        "Russia",
        "The cooling system of the race-track microtron (RTM)",
        "which is under construction at the Universitat Politècnica de Catalunya (UPC)",
        "has been simulated by means of a computational fluid dynamics (CFD) software. The hydraulic and thermal performance of the system has been studied for various operation conditions. Firstly",
        "the hydraulic model has been validated by comparison with experimental measurements at different flow rates. Then",
        "the cooling fluid temperatures and the pressure losses of the system have been determined and the capacity of the current design to remove the generated heat at nominal power has been confirmed. Finally",
        "the wall maximum and average temperatures and heat transfer coefficients inside the magnets and the accelerating structure have been calculated. These results have allowed us to localize sections of the cooling system with a low convection due to detached flows where",
        "therefore",
        "a risk of zones of high temperatures exists. An optimization of the cooling circuit with the aim to reduce such high temperature zones has been proposed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe09.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE09",
      "page_number": "173",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE10",
      "title": "A Thermal Exploration of Different Monochromator Crystal Designs",
      "authors": [
        "J.S. Stimson",
        "M.C.L. Ward",
        "BCU",
        "Birmingham",
        "United Kingdom",
        "S. Diaz-Moreno",
        "P. Docker",
        "J. Kay",
        "J. Sutter",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Eight potential monochromator crystal designs were subjected to a combination of three different beam powers on two different footprints. The temperature and thermal deformation were determined for each. It was found that thermal deformation of the lattice is negligible compared to the surface curvature",
        "and that while the thinnest crystal wafer showed the smallest temperature increase",
        "crystals cooled from the bottom alone demonstrated a far more uniform thermal deformation and a larger radius of curvature."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe10.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE10",
      "page_number": "176",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE11",
      "title": "Study on Thermal Mechanical Design and Optimization Analysis for the ALBA Infrared Microspectroscopy Beamline (MIRAS) Extraction Mirror Based on Finite Element Analysis",
      "authors": [
        "M. Quispe",
        "A. Carballedo",
        "J.J. Casas",
        "C. Colldelram",
        "A. Crisol",
        "G. Peña",
        "L. Ribó",
        "I. Sics",
        "I. Yousef",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "This paper reports design",
        "modelling",
        "simulation and optimization results for the ALBA MIRAS infrared radiation extraction mirror. Finite element analysis (FEA) was used to simulate the thermal mechanical behaviour of the device. With the aim to ensure a good thermal performance",
        "conservative assumptions were applied: all of the incident Bending Magnet (BM) radiation is absorbed at the mirror surface",
        "constant bending magnetic field and low thermal contact between the mirror Al 6061 and the OFHC copper arm. A novel solution has been implemented in order to provide an effective cooling by a natural convection on the in-air part of extraction mirror assembly. This has voided the necessity for a water cooling that often causes problems due to the associated vibrations. The power conditions were calculated by using SynRad+. The main ALBA Storage Ring design parameters are: 3 GeV",
        "400 mA and 1.42 T. According to these conditions",
        "the mirror absorbs 15 W with a peak power density of 0.51 W/mm2. The peak temperature calculated was 63.2 °C. The real measurements reported during the commissioning stage showed a good thermal performance",
        "in agreement with the results predicted by FEA."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe11.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE11",
      "page_number": "179",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE12",
      "title": "Developing White Beam Components of TPS Beamline 24A",
      "authors": [
        "M.H. Lee",
        "C.Y. Chang",
        "C.H. Chang",
        "S.H. Chang",
        "C. Chen",
        "C.C. Chiu",
        "L. Huang",
        "L. Lai",
        "L. Lee",
        "D.G. Liu",
        "Y. Su",
        "H.Y. Yan",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The TPS 24A",
        "Soft X-ray Tomography (SXT) beamline",
        "is one of the beamlines in the second construction phase at the Taiwan Photon Source (TPS). This bending magnet (BM) beamline has high flux in the range between 260 eV and 2600 eV. It is designed for transmission full-field imaging of frozen-hydrated biological samples. At the exit slit",
        "the beam flux optimized in 520 eV is 282 billion photons/second with resolving power 2000",
        "the beam size is 0.05 mm × 0.06 mm (V × H",
        "FWHM) and the beam divergence is 1.73 mrad × 1.57 mrad (V × H",
        "FWHM). By contributions of the generic beamline components project in recent years",
        "modular mechanisms would be used in this beamline such as mask",
        "X-ray beam position monitor (XBPM)",
        "photon absorber (PAB)",
        "and screens. However",
        "these beamline components were designed for ID beamlines",
        "so they should be redesigned for BM beamlines. This paper generally introduce these beamline components decided and redesigned for the TPS 24A. They will play important roles at the BM beam-lines in the future."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe12.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE12",
      "page_number": "183",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE13",
      "title": "Numerical Simulation of the ALBA Synchrotron Light Source Cooling System Response to Pump Start-Up and Shut-Down",
      "authors": [
        "X. Escaler",
        "D. Juan Garcia",
        "UPC",
        "Barcelona",
        "Spain",
        "J.J. Casas",
        "C. Colldelram",
        "M. Prieto",
        "M. Quispepresenter",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "The ALBA Synchrotron Light Source cooling system is submitted to regular pump start-ups and shut-downs. Moreover",
        "pumps can trip due to motor power failures. As a result",
        "the piping system can be subjected to surges and pressure oscillations. The 1D thermo-fluid simulation software Flowmaster has been used to predict these transient conditions taking into account the fluid compressibility",
        "the pipe elasticity",
        "the characteristic time response of the check valves and the pump/motors moments of inertia. During pump start-ups",
        "significant pressure rises are detected that can be reduced by readjusting the PID controller parameters. Unexpected pump shut-downs do not appear to provoke significant water hammer conditions. However",
        "pressure fluctuations are generated mainly in the same pumping line but also in the rest of the system due to the particular common return configuration. In all the cases the pressure regulation mechanisms acting on the pump rotating speeds serve to attenuate the consequences of these transients. Finally",
        "the feasibility of the model to simulate the effect on the system response of trapped air inside the pipes has also been evaluated."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe13.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE13",
      "page_number": "187",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE14",
      "title": "Study, Design and Optimization Analysis of the ALBA LOREA Dipole Vacuum Chamber and Crotch Absorbers Based on Finite Element Analysis",
      "authors": [
        "M. Quispe",
        "J. Campmany",
        "J.J. Casas",
        "C. Colldelram",
        "A. Crisol",
        "J. Marcos",
        "G. Peña",
        "M. Tallarida",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "This work deals with the FEA study",
        "design and optimization of the LOREA dipole vacuum chamber and Glidcop Al-15 crotch absorbers. At present LOREA is the ninth beam-line being designed at ALBA with an Insertion Device (ID) consisting of an Apple II-type helical undulator. For the standard dipole chamber the vertical polarized light hits the walls because of the very narrow vertical aperture between the cooling channels. In vertical mode the ID vertical divergence equals ± 2.2 mrad and the peak power density and total power are 5.6 kW/mrad² and 5.5 kW",
        "respectively. Due to the high power a temperature as high as more than 600 °C is calculated. In consequence the dipole chamber has to be modified and the absorbers have to withstand the Bending Magnet (BM) and ID radiation. The new absorbers have to be thicker and its cooling channels are farer from BM power deposition than the standard absorbers. The thermal mechanical simulations show good results",
        "the new absorbers are in a safe range",
        "the maximum temperature",
        "stress and strain are 309.2 °C",
        "164.2 MPa and 0.14%",
        "respectively. The main ALBA Storage Ring design parameters used in the simulations are: 3 GeV",
        "400 mA and 1.42 T (BM)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe14.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE14",
      "page_number": "191",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE15",
      "title": "Thermal Management and Crystal Clamping Concepts for the New High-Dynamics DCM for Sirius",
      "authors": [
        "M. Saveri Silva",
        "R.R. Geraldes",
        "A. Gilmour",
        "LNLS",
        "Campinas",
        "Brazil",
        "T.A.M. Ruijl",
        "R.M. Schneider",
        "MI-Partners",
        "Eindhoven",
        "The Netherlands",
        "The monochromator is known to be one of the most critical optical elements of a synchrotron beamline",
        "since it directly affects the beam quality with respect to energy and position. Naturally",
        "the new 4th generation machines",
        "with their small emittances",
        "start to bring about higher stability performance requirements",
        "in spite of factors as high power loads",
        "power load variation",
        "and vibration sources. A new high-dynamics DCM (Double Crystal Monochromator) is under development at the Brazilian Light Source for the Sirius EMA beamline (Extreme Condition X-ray Methods of Analysis). In order to achieve high-bandwidth control and stability of a few nrad",
        "as well as to prevent unpredicted mounting and clamping distortions",
        "new solutions are proposed for crystal fixation and thermal management. Since the design is based on flexural elements",
        "it should be indeed highly predictable",
        "so that the work was developed using mechanical and thermal FEA",
        "including CFD. Efforts were made to predict thermal boundaries associated with the synchrotron beam",
        "including incident",
        "diffracted and scattered power",
        "for which the undulator spectrum was employed in the Monte Carlo simulation package - FLUKA *.",
        "* \"FLUKA: a multi-particle transport code\"",
        "A. Ferrari",
        "P.R. Sala",
        "A. Fasso‘",
        "and J. Ranft",
        "CERN-2005-10 (2005)",
        "INFN/TC05/11",
        "SLAC-R-773"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe15.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE15",
      "page_number": "194",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE16",
      "title": "Design of A Leaf Spring Bender for Double Laue Crystal Monochromator at SSRF",
      "authors": [
        "H.L. Qin",
        "K. Yang",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "L. Jin",
        "H. Zhang",
        "W. Zhu",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "A leaf spring bender geometry for water-cooled double Laue crystal monochromator (DLM) is presented. The DLM will be employed to acquire high energy mono-chromatic X-ray (60keV to 120keV) on the ultra-hard applications beamline at SSRF. A compact bending mechanism is designed in order to get horizontally fo-cused high energy monochromatic X-ray as small as 0.5mm. The bender applies a piece of thin asymmetric crystal and a pair of leaf springs which push the crystal to a sagittally bent radius as small as 1 meter by a pair of symmetry moments. An optimized crystal geometry is achieved by taking into account the meridional and sagit-tal bendings coupled and defined by the anisotropic elas-ticity of the asymmetric crystal. Furthermore",
        "thermal slope error and structural stress of the bent crystal are analyzed by finite element method (FEA)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe16.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE16",
      "page_number": "198",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPE17",
      "title": "The development of CVD Diamond Based FEL Photon Stoppers in LCLSII",
      "authors": [
        "H. Wang",
        "Y. Feng",
        "J. Krzywiński",
        "E. Ortiz",
        "M. Rowen",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Safety stoppers are required to absorb and stop the LCLS-II Free-Electron Laser (FEL) beam",
        "which has the unique combination of extremely high peak fluence per pulse and enormous average power density. This is unprecedented at the existing 3rd generation synchrotron or current 4th generation low repetition rate FEL source",
        "so that new solutions are required. CVD diamond has been proposed as the absorber material",
        "for its low Z number",
        "high thermal conductivity and high thermal shock resistance. The Photon Stopper design consists of a perimeter cooled CVD diamond absorber",
        "clamped in between two copper (OFHC) heat sinks",
        "with one looped with a water cooling line. The thermal studies include both steady state and instantaneous analysis. Diamond damage test results using LCLS FEL beam will also be reported.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe17.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE17",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPE18",
      "title": "Design and FEA of a 3D Printed Detector Window Frame",
      "authors": [
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "The purpose of the project was to design and simulate a window assembly to be used in GISAX/GIWAX experiments. The window lies between the sample and the WAXS** detector",
        "a modified",
        "in-vacuum detector",
        "with modules removed to allow scattered radiation to pass through to a SAXS*** detector positioned downstream. The window uses 75um thick Kapton HN film and given the size",
        "pressure and the short distance to the sensors",
        "it was necessary to support it on a frame. To avoid any information loss from shadowing of the detector",
        "a frame was designed so that shadows will be projected into the gaps between the detector modules. The geometry was such that DMLS**** was an effective way of producing the item. Given the slenderness of the structure and the forces it supports",
        "the material approaches or exceeds its yield point",
        "so a bilinear",
        "isotropic",
        "hardening material model was chosen; moreover",
        "large deflections were enabled. Also",
        "the contacts were modelled with augmented Lagrange frictional formulation. All these assumptions made the analysis strongly non-linear."
      ],
      "institutions": [],
      "abstract": "*Grazing Incidence Small/Wide Angle X-ray scattering  **Wide Angle X-ray Scattering  ***Small Angle X-ray Scattering ****Digital Metal Laser Sintering",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe18.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE18",
      "page_number": "201",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE19",
      "title": "Application of a NEG Coated Chamber at the Canadian Light Source",
      "authors": [
        "S.Y. Chen",
        "D. Bertwistle",
        "K. Kei",
        "C. Murray",
        "T.M. Pedersen",
        "CLS",
        "Saskatoon",
        "Saskatchewan",
        "Canada",
        "In the Fall of 2015 a 4800 mm long NEG coated chamber was installed in the Canadian Light Source in cell 9 straight section. The chamber will occupy to majority of the straight length. The chambers vacuum has been monitored for +1 year and no obvious issues has been found. The chamber body is 10 mm thick and the aperture is an ellipse with a 8 mm height and a 65 mm width. A design feature of the chamber is a lack of support in-between the ends of the chamber. The lack of support space is due to the double elliptically polarizing undulator (54 mm",
        "and 180 mm period). This proceeding details the following: a.The structure design and Finite Element Analysis for the deflection and strength; b.Heat loads and cooling calculation; c.Supports design; d.Deflection and correction with the supports; e.Current strips installation f.Activation;"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe19.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE19",
      "page_number": "205",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPE20",
      "title": "Noble Gases Flow Management in the European XFEL Project UHV Photon Transport System",
      "authors": [
        "XFEL. EU",
        "Hamburg",
        "Germany",
        "The European XFEL facility in Hamburg is based on a linear accelerator and three Free-Electron-Laser beam-lines covering the energy range from 250 eV to 24 keV. It will provide 2700 pulses in trains of 600 microsecond duration at a repetition rate of 10 Hz. For the photon beam diagnostics",
        "several gas-based devices have been developed and placed in the beam transport system. They operate with different noble gases (Xe",
        "Ne",
        "Ar) with pressures up to 1·10-4 mbar. Having a windowless beam-line",
        "and a limited capability for noble gases that can be provided by the distributed array of ion pumps sustaining the UHV environment",
        "a turbo-molecular based differential pumping section has been developed. This modular system is able to minimize the gas flow to the rest of the beam transport system",
        "also offering a large optical clear aperture between pumping stages",
        "and enabling the required installation and alignment flexibility in all the tunnel locations (up to 10)",
        "including variations as floor and ceiling-mounted versions. An overview of the vacuum system analysis",
        "validation procedures",
        "and structural and alignment concept",
        "as well as installation status is reported.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "J.R. Villanueva Guerrero reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe20.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE20",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPE21",
      "title": "CLSI BMIT’s Super-Conducting Wiggler Cryogenic Safety Improvements*",
      "authors": [
        "L.X. Lin",
        "T.W. Wysokinski",
        "CLS",
        "Saskatoon",
        "Saskatchewan",
        "Canada",
        "4.1 T superconducting (SC) wiggler on CLS Biomedical Imaging and Therapy (BMIT) beamline [1-4] developed a critical problem in the cryogenic safety relief and refill paths. Ice blockage formed and prevented helium gas from relieving during liquid helium (LHe) refill. This resulted in an internal pressure built up",
        "which caused expelling of the LHe and cold gas helium (GHe) from the wiggler cryostat. Several improvements were performed over the years including replacement of the original rupture disk",
        "the pressure relief valves and installation of metal O-ring seals at external ports. Following these improvements",
        "a major upgrade on the wiggler safety relief path was implemented by adding a new vent pipe directly connected to the cryostat for safety exhaust. The LHe refill path was also modified to eliminate possibility of ice blockage. During initial tests after the up-grades",
        "we experienced significant heat load increase which was linked to the thermal acoustic oscillations in the LHe transfer line. The problem was resolved by improving the insulation vacuum in the transfer line and adding a super insulation assembly into the direct vent pipe along with a plug at the refill path."
      ],
      "institutions": [
        "*Work supported by Budker Institute of Nuclear Physics under contract No. C60109-029  ¿ Linda. Lin@lightsource.ca"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe21.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE21",
      "page_number": "209",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPE22",
      "title": "Low-Order Aberrations Correction of Extreme Ultraviolet Imaging Objective with Deformable Multilayer Mirrors",
      "authors": [
        "M. Toyoda",
        "R. Sunayama",
        "M. Yanagihara",
        "Tohoku University",
        "Institute of Multidisciplinary Research for Advanced Materials",
        "Sendai",
        "Japan",
        "For at-wavelength observation of a lithography mask",
        "recently",
        "we proposed an EUV microscope consisting of multilayer-mirror objective (operating wavelength: 13.5 nm",
        "numerical aperture: 0.25). To provide diffraction-limited spatial resolution below 30 nm",
        "reduction of wave aberrations of low order",
        "i.e.",
        "spherical aberration",
        "coma",
        "and astigmatism",
        "should be key technical challenge for the microscope. In this paper",
        "firstly",
        "we describe detail of optical design and instrumentation of the point diffraction interferometer (PDI)",
        "so as to provide high enough sensing accuracy of 100 pm",
        "which would be required for an optical axis adjustment of the EUV objective. Next",
        "experimental results of wave front correction on the EUV objective are reported. We corrected spherical aberration and coma by precisely aligning an optical axis of the mirrors",
        "while effects of astigmatism were also minimized with a figure-deformable mirror which can control radius of curvature in two mutually orthogonal directions. We confirmed that these low order terms should be less than 0.3 nm RMS."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe22.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE22",
      "page_number": "213",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE23",
      "title": "Glidcop Brazing in Sirius’ High Heat Load Front-End Components",
      "authors": [
        "G.V. Claudiano",
        "O.R. Bagnato",
        "P.T. Fonseca",
        "F.R. Francisco",
        "R.L. Parise",
        "L.M. Volpepresenter",
        "LNLS",
        "Campinas",
        "Brazil",
        "Sirius is a 4th generation synchrotron light source in project. Some of Sirius’ beamlines will have a very high power density",
        "more than 50 kW/mrad²",
        "to be dissipated in components that have a limited space condition. Thus",
        "the refrigeration of these components is complex when one has in mind that the coolant flow cannot be too turbulent in order to not induce much vibration in the components. Oxygen Free Electrolytic Cu (OFEC) has been replaced by the Glidcop",
        "on 4th generation synchrotron applications",
        "due to its good thermal conductivity and preservation of mechanical properties after heating cycles. However",
        "as this material is not very workable in terms of union with other materials",
        "which led to the development of a brazing process for Glidcop and stainless steel union. Glidcop samples were submitted to a Cu-electroplating process and a silver base alloy (BVAg-8) was used to join the parts in a high vacuum furnace. Electroplating was used to improve the filler metal wettability. The results were very satisfactory",
        "ensuring water and vacuum tightness. A desirable characteristic not yet proved is the virtual leak property. This paper will discourse about this brazing method."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe23.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE23",
      "page_number": "216",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE24",
      "title": "Electro-Formed Copper Cooling Block for AGIPD @ European XFEL",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "The European XFEL will generate ultrashort X-ray flashes with a brilliance a billion times higher than that of the best conventional X-ray radiation sources. The AGIPD (Adaptive Gain Integrating Pixel Detector) is a high speed detector for XFEL. It allows single pulse imaging at 4.5 a MHz frame rate with a dynamic range allowing single photon detection and detection of more than 10",
        "000 12.4 keV photons per pixel in the same image. This development is a collaboration between DESY",
        "the University of Hamburg",
        "the University of Bonn (all in Germany) and the Paul Scherrer Institute (PSI) in Switzerland. Four AGIPD modules are mounted on a cooling block using silicone oil as a coolant. The total heat load is about 200 W per cooling block. The aim is to achieve -20°C sensor temperature with a non-uniformity of less than 5 K on the sensors and to cool electronic components with the return flow. The detector components are operated in vacuum. Following first tests with different materials and production methods",
        "the copper cooling blocks were manufactured by electro-forming. The poster gives information on production details and results on cooling tests done on the final detector assembly."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe24.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE24",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPE25",
      "title": "Metallurgical Evaluation of Dissimilar Metal Joints for Accelerator Vacuum Chamber Construction at the Advanced Photon Source Upgrade Project",
      "authors": [
        "G. Navrotski",
        "B. Brajuskovic",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Tubular vacuum chamber assemblies made of aluminum",
        "copper and stainless steel alloys will be used in the new Multi Bend Achromat (MBA) storage ring that is being developed at Advanced Photon Source (APS). Details of the new lattice magnet system design and ring impedance considerations continue to drive these vacuum chambers to smaller dimensions and thinner walls with tighter geometric tolerances under higher thermal loads. It is important to carefully evaluate the methods used to join these dissimilar metal components looking for compromise in primary strength",
        "permeability",
        "electrical and thermal properties while still creating structures that are ultra-high vacuum compatible and leak-tight. This paper visually details the underlying metallurgical changes that occur when joining various combinations of aluminum",
        "OFE copper",
        "GlidCop® and stainless steel using brazing",
        "bonding and welding techniques. Each of the techniques has its advantages and disadvantages with engineering and economic consequences."
      ],
      "institutions": [
        "Funding: Funding provided by the Advanced Photon Source, U.S. Department of Energy, Office of Science, Argonne National Laboratory under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe25.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE25",
      "page_number": "220",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE26",
      "title": "Carbon-Steel/poliethylene Radiation Enclosures for the Sirius Beamlines",
      "authors": [
        "L. Sanfelici",
        "H.F. Canova",
        "F.H. Cardoso",
        "R. Madacki",
        "M.A. Pereira",
        "M.L. Roca Santo",
        "L.G. Silva",
        "M.S. Silva",
        "J.E. dos Santos",
        "LNLS",
        "Campinas",
        "Brazil",
        "L. Buccianti",
        "M.H.A. Costa",
        "E. Palombarini",
        "Biotec Controle Ambiental",
        "São José dos Campos",
        "SP",
        "Brazil",
        "Prudente Engenharia Ltda.",
        "Uberlândia",
        "Minas Gerais",
        "Brazil",
        "Lead enclosures have been used over the past decades for radiation protection at mid and high-energy synchrotron light-sources",
        "requiring nearly 10% of the investment needed to set up a new beamline. Due to the increasing concern about neutron levels",
        "in part due to the reduction of the photon radiation levels with the increased thickness of the hutch walls",
        "the existing constructive models were revisited and a new constructive approach based on Carbon-Steel (CS) and High-Density Polyethylene (HDPE) is proposed for the SIRIUS beamlines",
        "leading to increased overall radiation protection and potentially lower cost. This work is going to show preliminary simulation results",
        "cost-comparison",
        "as well as a few mechanical design details and prototyping initiatives."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe26.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE26",
      "page_number": "223",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE27",
      "title": "A New Generation of X-ray Absorbers for the EBS Storage Ring",
      "authors": [
        "E. Gagliardini",
        "J.C. Biasci",
        "D. Coulon",
        "Y. Dabin",
        "T. Ducoing",
        "F. Ewald",
        "P. Marion",
        "F. Thomas",
        "ESRF",
        "Grenoble",
        "France",
        "The X-ray absorbers are essential components of the storage ring vacuum system. Their function is to protect the vacuum chambers from the high power density produced by the dipole magnets synchrotron radiation. In the EBS storage ring",
        "the 430 kW total heatload will be stopped by 400 individual absorbers of twelve different types. In order to simplify their design and reduce their costs",
        "a new material will be used (CuCr1Zr) associated with a novel design integrating the vacuum sealing flange in the CuCr1 absorber body and avoiding any brazed or welded junctions. This alloy",
        "used for other applications (ITER-Fusion for Energy)",
        "offers an alternative to Glidcop with a very good compromise between thermal and mechanical characteristics. The exact location of each absorber is established through precise ray-tracing studies",
        "which define the best place between the optical elements. The design of the absorbers will be described including technological aspects",
        "together with the investigations on the CuCr1Zr material",
        "the prototypes and tests carried out to validate the novel design choices."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe27.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE27",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPE28",
      "title": "Characterization of the Acoustic Field Generated by the Single-Axis Acoustic Levitator",
      "authors": [
        "GIT/ECE",
        "Atlanta",
        "Georgia",
        "USA",
        "A. DiChiara",
        "P.D. Hartog",
        "B. Hu",
        "K.J. Suthar",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The acoustic levitator utilizes two transducers that emit acoustic waves. A standing wave is generated between the two transducers that allows for the levitation of particles at the nodes of the standing wave. These levitated particles experience an instability. In order to aid in the process of solving this instability",
        "the acoustic field created by one of the transducers was characterized in this experiment. This characterization helps to understand the intensity of the acoustic field at different points throughout the region and how the acoustic wave diverges as it travels away from the transducer."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe28.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE28",
      "page_number": "226",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPE29",
      "title": "Integration of a Stripline Kicker Prototype for CLIC Project Into ALBA Storage Ring",
      "authors": [
        "R. Monge",
        "J.C. Giraldo",
        "J. Ladrera Fernández",
        "M.L. Llonch",
        "L. Nikitina",
        "M. Pont",
        "M. Quispe",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "The Compact Linear Collider (CLIC) project is an international collaboration with CERN for developing a high-energy and high-luminosity machine which accelerates and collides electrons and positrons at energies up to several tera-electron volts. The extraction system for the Damping Rings of the CLIC shall follow very tight requirements in order to maintain the ultra-low emittance of the extracted bunches. A first prototype of the extraction kicker based on stripline technologies has been built and characterized at CERN without beam. The stripline chamber will be shortly installed in the ALBA Synchrotron to be tested under beam. In situ measurements of the impedance",
        "transversal field homogeneity and flat-top ripple aims to complete its characterization. This contribution presents the design of the set up for the integration of the stripline chamber in one of the medium straight sections of ALBA storage ring."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe29.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE29",
      "page_number": "230",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE30",
      "title": "Design of the Straight Sections of the EBS Storage Ring",
      "authors": [
        "B. Ogier",
        "J.C. Biasci",
        "J. Chavanne",
        "L. Goirand",
        "J. Jacob",
        "ESRF",
        "Grenoble",
        "France",
        "The new lattice will require the complete substitution of the 32 arcs of the storage ring by a new hybrid multi-bend achromat. The length of the straight sections will be 5m. This new lattice results in different geometrical characteristics that require a new design of all transitions chambers",
        "photon absorbers",
        "in-vacuum undulators and also adjustment of the insertion device layout for existing sections longer than 5m. The Radiofrequency straight sections are also upgraded by replacing existing 5-cells cavities with single cell HOM damped cavities.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe30.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE30",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPE31",
      "title": "Manufacturing of Photon Beam-Intercepting Components from CuCrZr",
      "authors": [
        "F.A. DePaola",
        "C. Amundsen",
        "S.K. Sharma",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Photon beam-intercepting components in synchrotron light sources have usually been made as water-cooled Glidcop bodies brazed to stainless steel conflate flanges. This fabrication method involves many manufacturing steps which result in increased cost",
        "long procurement time and lower manufacturing reliability. A new design approach was recently proposed which simplifies fabrication by eliminating brazing and utilizes a readily available copper alloy",
        "CuCrZr. This paper describes the manufacturing experience gained at NSLS-II from fabricating many components of this new design. Results of an investigation of various techniques for joining CuCrZr to itself and to SS304 and AL-6061 are also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe31.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE31",
      "page_number": "233",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPE32",
      "title": "A Girder-Free Magnet Support System Design",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Magnet support systems for the new light sources are required to satisfy several rigorous performance specifications. The support system must be rigid so that its static deflection under its own weight and the combined weight of the magnets is small and repeatable. For vibration stability the lowest natural frequency of the magnet-support assembly should be greater than 50 Hz. To meet thermal stability requirements it is desirable to minimize bending deformation of the support system when subjected to temperature changes. In addition",
        "the magnet support system should be easy to transport",
        "easy to align",
        "and cost effective. Altogether these requirements are difficult to satisfy",
        "especially if the main structural component of the support system is a girder of length greater than 3 meters. In this paper we propose a magnet support system design consisting of column-type supports joined by removable C-beams. The column-type supports provide a superior stability performance without compromising the alignment capability. Analysis results are presented to characterize the performance of this support system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe32.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE32",
      "page_number": "236",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPE33",
      "title": "NSLS-II Beam Aperture Slit Vibration Studies",
      "authors": [
        "C.J. Spataro",
        "C. Amundsen",
        "H. Bassan",
        "S.K. Sharma",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Beam aperture slits mounted on stepper-motor driven X-Y stages are used in NSLS-II frontends to define the beam size and to limit thermal loads on downstream optical components. The X-Y stages have positional and resolution requirements of 1 µm and 0.1 µm",
        "respectively. This is achieved by micro-stepping the stepper motor by a Delta-Tau GeoBrick-LV-NSLS-II controller. During the initial operation of the X-Y stages unacceptable levels of vibration when the stages were in motion",
        "and an intermittent sharp squealing when they were at rest",
        "were discovered. In this paper we present the studies that were undertaken to investigate these issues and the solutions that were implemented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe33.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE33",
      "page_number": "239",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPE34",
      "title": "Development of a Vertically Focusing Combined Function Dipole Magnet for Chess-U",
      "authors": [
        "A. Lyndaker",
        "S.T. Barrett",
        "A.B. Temnykh",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "There is an on-going major upgrade program for the Cornell High-Energy Synchrotron Source (CHESS) to boost the photon beam brilliance by an order of magnitude. In this project upgrade",
        "dubbed CHESS-U",
        "approximately an 80 meter section of the Cornell Electron Storage Ring (CESR) will be replaced by 12 compact double-bend achromats (DMA’s) to lower electron beam emittance by a factor of three. The critical element in the achromat is a 2.3 meter long combined function (CF) dipole magnet which has a curved geometry. In this cost-effective and transversely compact design",
        "the magnet has a \"C-shape\" laminated core of dimensions 260 x 412 mm and with a tapered pole shape. This vertically focusing bending magnet will produce a nominal field of 0.651 T and a gradient of 9.365 T/m. A short",
        "37 cm CF dipole magnet prototype was constructed and is presently being tested. In this paper",
        "design considerations",
        "fabrication techniques",
        "and assembly methods of the CF magnet are discussed. Characterization results of the 37 cm CF prototype magnet will also be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe34.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE34",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPE35",
      "title": "Challenges in the Mechanical Design of the Injection Zone in the New ESRF Storage Ring",
      "authors": [
        "T.R. Mairs",
        "S.M. White",
        "ESRF",
        "Grenoble",
        "France",
        "Most documents describing the lattice and performance of low emittance light sources concentrate on the standard cells where x-rays are produced. The requirements of the standard cells are different from those of the injection cell where electrons are introduced into the storage ring. The difficulties in adapting the existing injection facilities at the ESRF together with the integration of new injection elements in the storage ring are described. The new ESRF storage rings is extremely limited in space availability and",
        "in particular",
        "the positioning of the kicker magnets and the septa magnets have posed specific problems. An introduction to the various different electron trajectories together with a description of the specific elements and their functions in the injection process is made. The mechanical engineering design solutions that have been adopted are outlined.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe35.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE35",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPE36",
      "title": "Ground Vibration Monitoring for SXFEL Construction at SSRF",
      "authors": [
        "R.B. Deng",
        "F. Gao",
        "L. Yin",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "Shanghai X-ray Free Electron Laser test facility (SXFEL) began construction on Dec.30 2014. It is quite important to monitor the ground vibration influenced by the construction at Shanghai Synchrotron Radiation Facility (SSRF)",
        "because the SXFEL is just in the north of SSRF and the nearest distance is only 20m. In this paper",
        "the results of ground vibration measurement during the construction period at SSRF experimental hall",
        "tunnel and experimental room near the SXFEL site are shown. Vibrations at different hours",
        "frequency bands and directions are discussed to provide more detailed information on the influence of SXFEL construction to SSRF."
      ],
      "institutions": [
        "Funding: Project supported by the National Natural Science Foundation of China (Grant No. 11405255)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe36.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE36",
      "page_number": "242",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPE37",
      "title": "The European XFEL Photon Beam Transport System",
      "authors": [
        "XFEL. EU",
        "Hamburg",
        "Germany",
        "European XFEL",
        "the fourth generation Free-Electron-Laser facility in Hamburg (Germany)",
        "is going to start user operation in early 2017. In full operation the novel facility will produce at MHz repetition rate coherent femtosecond pulses with unprecedented brilliance in the energy range from 250 eV to 25 keV. The facility comprises of a linear accelerator and three beam-lines:"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe37_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe37.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe37_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE37",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPE38",
      "title": "Progress and Mechanical Engineering of FEL Projects at SINAP",
      "authors": [
        "L. Yin",
        "W. Fang",
        "X. Hu",
        "S. Sun",
        "L. Wang",
        "L.Y. Yu",
        "W. Zhang",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "Free electron laser (FEL) technology is the next focus at Shanghai Institute of Applied Physics (SINAP). Shanghai Deep Ultraviolet Free-Electron Laser (SDUV-FEL)",
        "a test facility for new FEL principles",
        "was operated for 5 years and got a series of important results. Dalian Coherent Light Source (DCLS)",
        "a 50~150nm wavelength FEL user facility based on a 300MeV linac located at Dalian Institute of Chemical Physics",
        "started beam commissioning in August. Shanghai X-ray Free-Electron Laser (SXFEL)",
        "a soft X-ray FEL test facility based on an 840MeV linac",
        "will be installed in this month and the commissioning is scheduled at the beginning of 2017. The Progress of the FEL projects and the mechanical engineering in the design and construction are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe38_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe38.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe38_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE38",
      "page_number": "246",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE39",
      "title": "Feasibility of a 4.5-T Cryogenic Permanent-Magnet Wavelength Shifter",
      "authors": [
        "C.-H. Chang",
        "H.-H. Chen",
        "J.C. Huang",
        "C.-S. Hwang",
        "Y.T. Yu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "NCTU",
        "Hsinchu",
        "Taiwan",
        "A three-pole wavelength shifter with a cryogenic permanent magnet is designed to extend the critical photon energy in a 3-GeV storage ring to 27-keV Xrays. The cryogenic wavelength shifter has a PrFeB permanent magnet and a vanadium-cobalt-steel (Permendur) pole to produce a magnetic field of flux density 4.5 T at fixed gap 5 mm. The magnet structure is optimized to prevent irreversible demagnetization of the permanent magnet near 300 K. A 77-K cryo-cooler is used to cool the magnets and to maintain the magnets at a uniform temperature",
        "77 K",
        "in the vacuum vessel. This work describes the advanced design of the magnetic field and the simulations of the cooling temperature for the compact wavelength-shifter magnet."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe39_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe39.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe39_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE39",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPE40",
      "title": "Cryo-Ready Undulator U15: Passing SOLEIL’s 2 Meters Threshold in Useful Magnetic Length",
      "authors": [
        "M. Tilmont",
        "F. Briquez",
        "N. Béchu",
        "L. Chapuis",
        "M.-E. Couprie",
        "J.M. Dubuisson",
        "J.P. Duval",
        "C. Herbeaux",
        "A. Lestrade",
        "J.L. Marlats",
        "M. Sebdaoui",
        "K.T. Tavakoli",
        "C. de Olivera",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "The U15 is an in-vacuum undulator designed to operate at room temperature and at 70K. It is the first in-vacuum undulator designed",
        "assembled and which will be used in SOLEIL’s storage ring that have support beams for magnets longer than 2 meters. A clear gap is felt in the technologies used for manufacturing and assembling compared to our standard 2m length in-vacuum undulators. This is due",
        "in part",
        "to the tolerances imposed by the maximum phase error admissible in SOLEIL’s storage ring. The poster will shine lights on those difficulties from a design and manufacturing point of view."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe40_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe40.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe40_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE40",
      "page_number": "249",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPE41",
      "title": "Design and Development of a System of Hybrid Type to Measure the Magnetic Field of a Cryogenic Undulator",
      "authors": [
        "C.H. Chang",
        "S.D. Chen",
        "J.C. Huang",
        "C.-S. Hwang",
        "C.K. Yangpresenter",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Cryogenic permanent-magnet undulators (CU) have currently become the most important scheme serving as sources of hard X-rays in medium-energy facilities worldwide. One such set (length 2 m",
        "period length 15 mm) is under development for Taiwan Photon Source (TPS). To obtain a magnetic-field distribution of the cryogenic undulator after it is cooled to an operating target temperature below 80 K",
        "a device of hybrid type combining a Hall probe and stretched-wire method has been designed and developed",
        "to perform the field measurement at low temperature and in an ultra-high vacuum environment. The Hall probe is used to measure the field on axis in the transverse and vertical directions; the stretched wire is utilized to measure the field integral in the vertical and horizontal directions in the horizontal plane. Unlike a conventional field-measurement system in air",
        "this innovative system must be located in an ultra-high vacuum environment with limited clearance. This paper describes mainly the entire system",
        "including kernel components",
        "control systems and preliminary test results in detail."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe41_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe41.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe41_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE41",
      "page_number": "251",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPE42",
      "title": "Insertion Device Installation Status at MAX IV",
      "authors": [
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "At present the first five insertion devices have been installed in the 3GeV-ring of MAX IV. Two of these are in house built Apple II devices with period lengths 48mm and 53mm. These two undulators cover the entire available straight section length and are designed for a minimum mechanical gap of 11mm. The flat extruded aluminium vacuum chamber is supported by 5 points of suspension in order to minimize bending effects. Magnetic and mechanical shimming was finished and both undulators have been fiducialized before the installation. The final alignement in the ring bases on their magnetic centre as reference. With the weight of 13.5t per undulator ground transportation was demanding. A special transport frame has been designed and mounted to ease air cushion and fork lift transport. reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe42_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe42.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe42_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE42",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPE44",
      "title": "Optimization for the APS-U Magnet Support Structure",
      "authors": [
        "Z. Liu",
        "H. Cease",
        "J.T. Collins",
        "J. Nudell",
        "C.A. Preissner",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The Advanced Photon Source Upgrade (APSU) is to replace the existing storage ring with a multi-bend achromats (MBA) accelerator lattice *. For the APS-U removal and installation",
        "current planning calls for a 12-month shutdown and testing period",
        "prior to resumption of operations. It calls for quick installation of the magnet support system with assembly and installation alignment tolerance. A three-point",
        "semi-kinematic vertical mount for the magnet modules is the approach to reduce time for alignment. The longest section is the curved FODO section (four quads with three Q-bends interleaved",
        "and a three-pole wiggler). All magnets of the FODO section sit on a single piece of support structure in order to have a good control over the magnet-to-magnet alignment tolerance. It brings challenge to minimize the top surface deflection and maximize the first mode frequency of the magnet support structure that is supported at three points. These constraints call for the need of optimizing the magnet support structures. Details of the optimization",
        "including three-point positioning",
        "material selection",
        "and topology optimization",
        "are reported in this study."
      ],
      "institutions": [
        "Funding: Work supported by: Argonne is managed by UChicago Argonne, LLC, for the U.S. Department of Energy under contract DE-AC02-06CH11357.",
        "* Glenn Decker (2014) Design Study of an MBA Lattice for the Advanced Photon Source, Synchrotron Radiation News, 27:6, 13-17, DOI: 10.1080/08940886.2014.970932"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tupe44_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tupe44.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tupe44_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUPE44",
      "page_number": "254",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 41,
  "scrape_time": "2025-10-10 23:57:47"
}