{
  "session_info": {
    "id": "MOXAA",
    "name": "MOXAA - Synchrotrons and Storage Rings",
    "url": "https://proceedings.jacow.org/hiat2018/html/moxaa.htm"
  },
  "papers": [
    {
      "paper_id": "MOXAA01",
      "title": "Nuclear Physics Research at Heavy Ion Accelerators: Precision Studies with Stored and Cooled Exotic Nuclei",
      "authors": [
        "Yu.A. Litvinov",
        "T. Stöhlker",
        "GSI",
        "Darmstadt",
        "Germany",
        "X. Ma",
        "Y.H. Zhang",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "HIJ",
        "Jena",
        "Germany",
        "Saitama University",
        "Saitama",
        "Japan",
        "Nuclear physics is more than 100 years old and is still rapidly developing field of research driven by the progress in accelerator concepts and detector technologies. By now",
        "scientists have created in laboratory about 3000 nuclides. However",
        "about 7000 nuclides are expected to exist with majority of yet unknown nuclei belonging to neutron-rich systems",
        "which have extremely small production cross sections and short lifetimes. Sophisticated experimental techniques are needed for precision studies of such nuclides. Here",
        "heavy-ion storage rings coupled to radioactive ion beam facilities offer unique capabilities. There are presently three operational facilities",
        "namely the Experimental Storage Ring (ESR) at GSI",
        "the experimental Cooler-Storage Ring (CSRe) at IMP",
        "and the Rare RI Ring (R3) Facility at RIKEN [*]. Furthermore",
        "dedicated low-energy storage ring facilities are being constructed or planned at various laboratories [**]. In this contribution I will try to illustrate the power of heavy-ion storage rings for unique precision studies at the forefront nuclear structure and astrophysics research. And",
        "I will give my biased outlook onto the future experimental activities.",
        "[*] Y. H. Zhang et al.",
        "Phys. Scripta 91 (2016) 073002 [**] M. Lestinsky et al.",
        "Eur. Phys. J. Special Topics 225 (2016) 797"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hiat2018/talks/moxaa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hiat2018/papers/moxaa01.pdf",
      "poster_url": "https://proceedings.jacow.org/hiat2018/posters/moxaa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2018-MOXAA01",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:36:25"
}