{
  "session_info": {
    "id": "THXAA",
    "name": "THXAA - Electrostatic Accelerators",
    "url": "https://proceedings.jacow.org/hiat2018/html/thxaa.htm"
  },
  "papers": [
    {
      "paper_id": "THXAA01",
      "title": "The status of accelerator mass spectrometry at CIAE",
      "authors": [
        "CIAE",
        "Beijing",
        "People’s Republic of China",
        "Accelerator mass spectrometry (AMS) is the most sensitive measurement technique for long-lived nuclides",
        "it can be used in many research field. There are three AMS system at CIAE: the HI-13 AMS system",
        "the single stage AMS system and the heavy nuclides AMS system. the HI-13 tandem accelerator is the first AMS beam line in China",
        "based on the system",
        "more than 10 kinds of long lived nuclides have been developed and applications in many research fields have been carried out. The single stage AMS (SSAMS) system is a home-made compact AMS system which working at terminal of 180KV. Based on the SSAMS system",
        "the measurement techniques of 14C and 3H with high performances have been established",
        "the applications have been carried out. The heavy nuclides AMS system is also a home-made system. It is a kind of tandem accelerator with a terminal voltage of 350KV. Air insulated accelerator tubes are used to connect high voltage deck and the ground potential. This system is dedicated for the heavy nuclides measurement. A brief introduction of HI-13 accelerator",
        "applications based on the accelerator and currently upgrading systems and will also be given."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hiat2018/talks/thxaa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hiat2018/papers/thxaa01.pdf",
      "poster_url": "https://proceedings.jacow.org/hiat2018/posters/thxaa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2018-THXAA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:37:29"
}