{
  "session_info": {
    "id": "MOODB1",
    "name": "MOODB1 - Contributed Oral Presentations (Accelerator Technology)",
    "url": "https://proceedings.jacow.org/IPAC2013/html/moodb1.htm"
  },
  "papers": [
    {
      "paper_id": "MOODB101",
      "title": "Manufacturing of the First of Series SIS100 Dipole Magnet",
      "authors": [
        "St. Sattler",
        "W. Gärtner",
        "Dr. Scheller",
        "R. Schönbein",
        "W. Walter",
        "BNG",
        "Würzburg",
        "Germany",
        "E.S. Fischer",
        "J.P. Meier",
        "H. Müller",
        "P. Schnizer",
        "GSI",
        "Darmstadt",
        "Germany",
        "Babcock Noell (Würzburg",
        "Germany) manufactures the First of Series (FOS) SIS100 dipole magnet for the FAIR project. This contribution reports on the progress during the design-phase",
        "performed together with GSI",
        "and on the manufacturing- and assembly-processes. Special emphasis will be given on new or special techniques adopted to fulfill the stringent requirements demanded by such a magnet. The new tooling systems and machines which were developed and brought into operation for this FOS magnet will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/moodb101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/moodb101.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/moodb101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOODB101",
      "page_number": "31",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOODB102",
      "title": "Multiple Function Magnet Systems for MAX IV",
      "authors": [
        "F. Bødker",
        "C.E. Hansen",
        "N. Hauge",
        "E.K. Krauthammer",
        "D. Kristoffersen",
        "G. Nielsen",
        "C.W.O. Ostenfeld",
        "C.G. Pedersen",
        "Danfysik A/S",
        "Taastrup",
        "Denmark",
        "Danfysik is currently producing 60 up to 3.3 m long magnet systems consisting of up to 12 multipole magnets integrated into each of the yokes for the bending achromats of the MAX IV 3 GeV storage ring and 12 similar systems for the MAX IV 1.5 GeV storage ring. Each magnet yoke contains combined function soft-end dipole and quadrupole elements which are machined out of one single iron block at tolerances of ± 0.02 mm. In addition",
        "separate",
        "higher order multipole magnets are kinematically mounted into the yokes. The integration of many magnetic elements into single yoke structures enables a compact",
        "low emittance storage ring design. The dipole and quadrupole magnetic elements are magnetically field mapped with high precision on a 3D hall probe measuring bench. Higher order multipoles are measured on a slow rotating coil system developed for that purpose. Much effort has been put into automation in order to quickly perform the very comprehensive measurement program each girder will through."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/moodb102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/moodb102.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/moodb102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOODB102",
      "page_number": "34",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOODB103",
      "title": "Results of an Experiment on Hydrodynamic Tunnelling at the SPS HiRadMat High Intensity Proton Facility",
      "authors": [
        "R. Schmidt",
        "J. Blanco",
        "F. Burkart",
        "D. Grenier",
        "D. Wollmann",
        "CERN",
        "Geneva",
        "Switzerland",
        "CIVIDEC Instrumentation",
        "Wien",
        "Austria",
        "GSI",
        "Darmstadt",
        "Germany",
        "To predict the damage for a catastrophic failure of the protections systems for the LHC when operating with beams storing 362 MJ",
        "simulation studies of the impact of an LHC beam on targets were performed. Firstly",
        "the energy deposition of the first bunches in a target with FLUKA is calculated. The effect of the energy deposition on the target is then calculated with a hydrodynamic code",
        "BIG2. The impact of only a few bunches leads to a change of target density. The calculations are done iteratively in several steps and show that such beam can tunnel up to 30-35 m into a target. Validation experiments for these calculations at LHC are not possible",
        "therefore experiments were suggested for the CERN Super Proton Synchrotron (SPS)",
        "since simulation studies with the tools used for the LHC also predict hydrodynamic tunnelling for SPS beams. An experiment at the SPS-HiRadMat facility (High-Radiation to Materials) using the 440 GeV beam with 144 bunches was performed in July 2012. In this paper we compare the results of this experiment with our calculations of hydrodynamic tunnelling."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/moodb103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/moodb103.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/moodb103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOODB103",
      "page_number": "37",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 21:00:48"
}