{
  "session_info": {
    "id": "THPSC",
    "name": "THPSC - Poster session C",
    "url": "https://proceedings.jacow.org/rupac2014/html/thpsc.htm"
  },
  "papers": [
    {
      "paper_id": "THPSC01",
      "title": "Status of Linacs with High-frequency Quadrupole Focusing  LU-30 and LU-30M in IHEP",
      "authors": [
        "IHEP",
        "Moscow Region",
        "Russia",
        "There are two RFQ DT proton linacs",
        "named the LU-30 and LU-30M",
        "in the SRC IHEP of NRC \"Kurchatov Institute\" that are presently in operation. Both are the unique machines employing radio-frequency quadrupole focusing up to 30 MeV at exit. The LU-30 machine now runs as a proton injector to the booster RC PS U-1.5 that feeds the main PS U-70 ultimately. The LU-30M is now run in a stand-alone test operation mode. Such a parallel functioning of these two accelerators allows to use the LU-30M as an experimental facility enabling R&D on new technical decisions and upgrades for the ageing LU-30. On the other hand",
        "the routine operation of the workhorse LU-30 allows for testing of the technical decisions proposed under a heavy non-stop operation during the U-70 runs for fixed-target physics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC01",
      "page_number": "312",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC02",
      "title": "Geometry of Quadrupole Magnet for the U-3.5 Accelerator in the OMEGA Project",
      "authors": [
        "L. Tkachenko",
        "S. Kozub",
        "P.A. Shcherbakov",
        "IHEP",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Accelerating complex of intensive beams of charged particles (project Omega) is being developed at IHEP. The main part of this complex is 3.5 GeV ring accelerator. The basic parameters of the quadrupole magnet for this ring are: 5.564 T/m central gradient in the 102.9 mm radius of the \"good field\"; the injection gradient is 1.222 T/m; the gradient ramp rate is 334 T/m/s. Different profiles of the poles were considered for the purpose of selecting the most optimal 2D and 3D geometries of the magnet. The basic parameters of the optimal geometries are presented.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc02.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC02",
      "page_number": "315",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC03",
      "title": "Study of Superconducting Accelerating Structures for Megawatt Proton Driver Linac",
      "authors": [
        "S.M. Polozov",
        "K.A. Aliev",
        "A.M. Fadeev",
        "M. Gusarova",
        "T. Kulevoy",
        "M.V. Lalayan",
        "N.P. Sobenin",
        "O. Verjbitskiy",
        "MEPhI",
        "Moscow",
        "Russia",
        "The preliminary design of megawatt level proton accelerator-driver is carrying out by collaboration between Russian scientific centers MEPhI",
        "ITEP",
        "Kurchatov Institute. This project was supported in 2013 by the Ministry of Science and Education of Russia. The linac general layout includes SC Spoke-cavities at middle energy range and elliptical cavity at high energy one. The usage of QWR and/or HWR at 10-30 MeV was also discussed. Due to electrodynamics models of all structures types were designed and the electrodynamics characteristics were studied. QWR",
        "HWQ and Spoke-cavities were proposed to operate on 324 MHz and elliptical cavities on 972 MHz. The main electrodynamics simulation results will present in report. The multipactor study results will also discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc03.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC03",
      "page_number": "318",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC04",
      "title": "Study of Normal Conducting Accelerating Structures for Megawatt Proton Driver Linac",
      "authors": [
        "S.M. Polozov",
        "A.E. Aksentyev",
        "A.A. Kalashnikova",
        "T. Kulevoy",
        "M.V. Lalayan",
        "S.E. Toporkov",
        "MEPhI",
        "Moscow",
        "Russia",
        "The preliminary design of megawatt level proton accelerator-driver is carrying out by collaboration between Russian scientific centers MEPhI",
        "ITEP",
        "Kurchatov Institute. This project was supported in 2013 by the Ministry of Science and Education of Russia. The linac general layout includes RFQ section and section(s) with radiofrequency focusing. The different types of RF focusing were studied due to this project: RF crossed lenses",
        "modified electrodes RFQ",
        "axi-symmetrical RF focusing. All such focusing can be realized by IH-type cavities. The design of segmented vane RFQ (SVRFQ) with coupling windows and IH− and CH-type normal conducting cavities will discuss in the report. All cavities operate on 162 MHz. The main electrodynamics simulation results will present."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc04.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC04",
      "page_number": "321",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC05",
      "title": "Study of Possibility of 600-1000 MeV and 1 MW Proton Driver Linac Development in Russia",
      "authors": [
        "S.M. Polozov",
        "A.E. Aksentyev",
        "K.A. Aliev",
        "I.A. Ashanin",
        "Y.A. Bashmakov",
        "A.A. Blinnikov",
        "T.V. Bondarenko",
        "A.N. Didenko",
        "M.S. Dmitriyev",
        "V.V. Dmitriyeva",
        "V.S. Dyubkov",
        "A.M. Fadeev",
        "A. Fertman",
        "M. Gusarova",
        "A.A. Kalashnikova",
        "V.I. Kaminsky",
        "E. Khabibullina",
        "Yu.D. Kliuchevskaia",
        "A.D. Kolyaskin",
        "T. Kulevoy",
        "M.V. Lalayan",
        "S.V. Matsievskiy",
        "V.I. Rashchikov",
        "A.V. Samoshin",
        "E.A. Savin",
        "Ya.V. Shashkov",
        "A.Yu. Smirnov",
        "N.P. Sobenin",
        "S.E. Toporkov",
        "O. Verjbitskiy",
        "A.V. Ziiatdinova",
        "V. Zvyagintsev",
        "MEPhI",
        "Moscow",
        "Russia",
        "P.N. Alekseev",
        "V.A. Nevinnitsa",
        "NRC",
        "Moscow",
        "Russia",
        "V.F. Batyaev",
        "G. Kropachev",
        "D.A. Liakin",
        "S.V. Rogozhkin",
        "Y.E. Titarenko",
        "ITEP",
        "Moscow",
        "Russia",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "Alternative nuclear energetic's technologies as fast reactors and accelerating driven systems (ADS) are necessary to solve a number of problems as U-238 or thorium fuel reactor and nuclear wastes transmutation. ADS subcritical system should consist of megawatt-power proton accelerator",
        "neutron producing target and breeder. A number of ADS projects are under development in EU",
        "Japan",
        "USA",
        "China",
        "S.Korea at present. Superconducting linacs or their complexes with high energy storage synchrotron are under design in main projects as a megawatt power proton beam driver. In Russian Federation the complex design for accelerator-driver was carried down more than ten years ago. The new approach to the ADS complex is now under development in framework of the project carried out by collaboration between Russian scientific centers MEPhI",
        "ITEP",
        "Kurchatov Institute. This project was supported in 2013 by the Ministry of Science and Education of Russia. A brief results observation for accelerator part of the project is presented in report. It includes accelerator-driver general layout",
        "beam dynamics simulation",
        "electrodynamics simulations of accelerating cavities and analysis of technological background in Russia."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc05.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC05",
      "page_number": "324",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC06",
      "title": "Development and Testing of Powerful High-voltage Electron Accelerator for Energy-intensive Industries",
      "authors": [
        "N.G. Tolstun",
        "A.V. Efremov",
        "A.N. Kuzhlev",
        "A.I. Machecha",
        "V.P. Maznev",
        "V.P. Ovchinnikov",
        "D.E. Pavluhov",
        "M.P. Svinin",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "The report describes the results of the development and testing of the Electron-23high-voltage high-power electron accelerator rated for an accelerating voltage of 1 MV and beam power up to 500 kW at the \"NIIEFA\" testing facilities. The accelerator is intended for industrial processing of flue gases from coal burning thermal power stations with the aim to reduce concentrations of nitrogen and sulfur oxides. The accelerator may also be used for other energy-consuming processes",
        "such as radiation treatment of wastewater for the purpose of their decontamination or processing of natural gases for their conversion into engine fuel. The report describes the main components and systems of the accelerator",
        "such as the high-voltage generator",
        "the accelerating voltage regulation device",
        "the electron-optical system",
        "the electron source and the accelerating tube",
        "the irradiation field forming system",
        "the beam output device and vacuum system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc06.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC06",
      "page_number": "327",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC07",
      "title": "Single Frequency High Intensity High Energy Normal Conducting Hadron Linac",
      "authors": [
        "V.V. Paramonov",
        "V.N. Leontiev",
        "RAS/INR",
        "Moscow",
        "Russia",
        "MNIRTI",
        "Moscow",
        "Russia",
        "ITEP",
        "Moscow",
        "Russia",
        "Taking the care for beam quality and the possibility of practical realization",
        "the scheme and parameters for 400 MeV H− linac are considered. The concepts for beam emittance preservation",
        "both transverse and longitudinal",
        "starting from RFQ",
        "following with PMQ focusing DTL and finishing with high energy CCL part are summarized. Different focusing schemes are analyzed for DTL and CCL parts. The pulse beam current is limited to the safe value 40 mA and the average current up to 2 mA is supposed by duty factor of 5%. The single operating frequency 352 MHz is for all linac parts",
        "providing the strong unification both for RF system and elements of accelerating structures. Referring and comparing with existing solutions for another intense linacs",
        "the feasibility and reality of the proposal is confirmed. Expected performances both in beam",
        "parameters and hardware are summarized."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc07.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC07",
      "page_number": "330",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC08",
      "title": "The Project of the HV Axial Injection for the DC-280 Cyclotron at the FLNR JINR",
      "authors": [
        "G.G. Gulbekyan",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "A.A. Efremov",
        "B. Gikal",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "N.Yu. Kazarinov",
        "M.V. Khabarov",
        "V.N. Melnikov",
        "N.F. Osipov",
        "S.V. Prokhorov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The project of the high-voltage (HV) axial injection for the DC-280 cyclotron which is being created at the FLNR JINR is presented. The injection system will consists of a Permanent Magnet ECR ion source and a Superconducting ECR ion source",
        "beam analyzing magnets",
        "focusing solenoids",
        "beam choppers",
        "a polyharmonic buncher",
        "75 kV DC accelerating tubes",
        "a commutating electrostatic deflector and a spiral inflector. One part of the injection system is situated on the HV platform",
        "another part is on the grounded yoke of the DC-280 magnet. The injection system will allow one to inject efficiently ions of elements from Helium to Uranium with the atomic mass to charge ratio in the range of 4-7.5 providing acceleration of ion currents with intensity more than 10 pmkA."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc08.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC08",
      "page_number": "333",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC09",
      "title": "The Project of Beam Transportation Lines for the DC-280 Cyclotron at the FLNR JINR",
      "authors": [
        "G.G. Gulbekyan",
        "B. Gikal",
        "G.N. Ivanov",
        "I.V. Kalagin",
        "V.I. Kazacha",
        "N.Yu. Kazarinov",
        "M.V. Khabarov",
        "V.N. Melnikov",
        "N.F. Osipov",
        "Yu.G. Teterev",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The project of beam lines for carrying out physical experiments at the DC-280 cyclotron which is being created at the FLNR JINR is presented. The commutating magnet with variable magnetic field induction up to 1.5 T gives us possibility to bend ion beams in five directions providing ion transportation through beam lines to five experimental setups. The beam focusing in the beam lines is provided by set of quadrupole lenses having the gradients up to 7.7 T/m. The beam lines are intended for the efficient ion transportation of elements from Helium to Uranium with the atomic mass to charge ratio in the range of 4-7.5 at energies from 4 up to 8 MeV/amu. The ion beam power will reach the value about 3 kW. The water cooled current aperture diaphragms will be installed into all beam lines to prevent the tube damage. The beam diagnostics consists of the Faraday caps (FC)",
        "slit collimators",
        "sector aperture diaphragms and ionization beam profile monitors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc09.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC09",
      "page_number": "336",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC10",
      "title": "Magnets of Injection and Extraction Systems of Cyclotron DC280",
      "authors": [
        "N.Yu. Kazarinov",
        "I.A. Ivanenko",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The design of two magnets of the cyclotron DC280 is presented. The magnets are the parts of injection and extraction systems the cyclotron. The design is based on three-dimensional calculation of the magnet field carried out by using OPERA 3D program code. The influence of the magnetic fields nonlinearities on ion beam dynamics is analyzed.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc10.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC10",
      "page_number": "339",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC11",
      "title": "NSLS-II Booster Vacuum System",
      "authors": [
        "A.M. Semenov",
        "V.V. Anashin",
        "S.M. Gurov",
        "V.A. Kiselev",
        "A.A. Krasnov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "H.-C. Hseuh",
        "T.V. Shaftan",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "One of the last SR source third generation (NSLS-II) is constructed in Brookhaven National Laboratory in present time. To raise the operation effectiveness in continued mode with irradiation of maximum brightness injectors of these SR sources is operated continually on the energy up to energy of the main ring (linac or synchrotron booster). The injection on the full energy allows add electrons to early moved electrons in a storage ring rather than to regulate a magnet system. This operating mode is often named \"Top-Up\". NSLS-II consists of a linear accelerator on the electron energy up to 200 MeV",
        "a synchrotron booster on the energy 3 GeV",
        "a main storage ring. The status and review of vacuum system are written in this report."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc11.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC11",
      "page_number": "342",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC12",
      "title": "Effect of the Vertical Velocity Component on Properties of Synchrotron Radiation",
      "authors": [
        "MSIU",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "This subject determines more precisely characteristics of synchrotron radiation when charge particle moves on the spiral in physical devices and a space. For this purpose first the Bessel functions of a high order are approximated to within the second approach. It is discussed that the vertical component of velocity in alternating magnetic fields of accelerators significantly changes spectral and angular distributions of radiation intensity.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc12.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC12",
      "page_number": "345",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC13",
      "title": "Horizontal Emittance Regulation at SIBERIA-2",
      "authors": [
        "A.G. Valentinov",
        "V. Korchuganov",
        "Y.V. Krylov",
        "Y.L. Yupinov",
        "NRC",
        "Moscow",
        "Russia"
      ],
      "institutions": [
        "Synchrotron radiation (SR) brightness is the most valuable parameter of every SR light source. It depends greatly on horizontal emittance of an electron beam. That's why all modern SR light sources have designed emittance of several nanometers. A horizontal emittance of Siberia-2 now equals to 98 nm. It can be decreased by two ways. First way is to find another working point (betatron tunes) with lower emittance. Maximal possible current values of existing power supplies must be taken into account. Injection efficiency may become worse because of smaller dynamic aperture due to stronger sextupoles. Second way is to rebuild magnetic structure keeping the same betatron tunes. Advantages of this method are good injection efficiency and proved energy ramping process. Modification of the magnetic structure may be done at high energy with more stable electron beam. But the second way is not allowed to reach as lower emittance level as in the first way. Theoretical and practical aspects of these two ways are described in the report. Magnetic structures with dispersion-free straight sections and smooth horizontal dispersion function are presented. Also structure with higher emittance is described in order to reach higher injection efficiency."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc13.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC13",
      "page_number": "347",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC14",
      "title": "Electron Emission and Trapping in Non-Uniform Fields of Magnet Structure and Insertion Devices at SR Source Siberia-2",
      "authors": [
        "V.I. Moiseev",
        "V. Korchuganov",
        "N.V. Smolyakov",
        "NRC",
        "Moscow",
        "Russia",
        "In vacuum chamber of SR source",
        "scattered photons provide high intensity flows of photo emitted electrons along the magnetic fields lines. The unperturbed electrons reach the opposite walls. The relativistic bunches influence the trajectories of low energy electrons. These electrons can be trapped by non-uniform magnetic field. The low energy electron distributions change the operating settings of the storage ring. For Siberia-2 case",
        "the low energy electron densities are evaluated both in quadrupole lenses and in superconducting wiggler on 7.5 T field. The qualitative description of the trapped electrons behavior was developed. In calculations",
        "the analitical solution was obtained and used for estimations of the single impact of relativistic bunch."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc14.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC14",
      "page_number": "350",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC15",
      "title": "Modernisation of the ILC Cryomodule Using High-tech Tchnology – Explosion Welding",
      "authors": [
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The world first samples of Ti and Nb tubes joint with stainless steel ones by an explosion welding by the JINR-VNIIEF-FNAL-INFN cooperation were manufactured in the frame of ILC R&D program. An applying methods of relaxation of residual tensions (after explosion and electron beam welding)",
        "macro-and microanalyses of welding seam and cryogenic tests of the samples produced manifest the achievement of high mechanic strength (~250 MPa/share) of welding seam",
        "solidity and leak absence on 10-10 l*atm/sec level at 1.8 K. The explosion welding technology and methods introducing to industrial manufacturing of the 4-th generation of cryomodule of TESLA TYPE DESIGN can exclude the Ti – communications as cover of the vessel. The Agreement between JINR and E.Paton IEW (Kiev",
        "Ukraine) was achieved for manufacturing Nb+SS transition samples using new technology and new design of Nb+Ti+SS junction. We suppose this samples should be more technological",
        "simpler in manufacturing and cheaper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc15.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC15",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPSC16",
      "title": "Analysis of High Order Modes Damping Techniques for 800 MHz Single Cell Superconducting Cavities",
      "authors": [
        "Ya.V. Shashkov",
        "N.P. Sobenin",
        "MEPhI",
        "Moscow",
        "Russia",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "The High Luminosity LHC upgrade program foresees a possibility of using the second harmonic cavities working at 800 MHz for the collider bunch length variation. Such harmonic cavities should provide an opportunity to vary the length of colliding bunches. In order to supply the required harmonic voltage several single cell superconducting cavities are to be used. Different cavity designs and several higher order mode (HOM) damping techniques are being studied in order to reduce the cavity HOM impact on the beam stability and to minimize parasitic power losses. In this paper we analyze and compare the HOM electromagnetic characteristics and respective wake potential decay rates for cavities with grooves",
        "fluted and ridged beam pipes. The problem of Lorentz force detuning is also addressed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc16.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC16",
      "page_number": "353",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC17",
      "title": "Higher Order Modes Damping for 9-cell Structure with Modified Drift Tubes",
      "authors": [
        "Ya.V. Shashkov",
        "A.A. Mitrofanov",
        "N.P. Sobenin",
        "MEPhI",
        "Moscow",
        "Russia",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada"
      ],
      "institutions": [],
      "abstract": "This paper is focused on HOM damping in 9-cell superconducting cavities. We are considering HOM propagation outside from the cavity ridged and fluted drift tubes. The analysis of the influence of the parameters of the drift tube on the HOM damping was conducted. The considered methods were analysed and compared.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc17.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC17",
      "page_number": "356",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC18",
      "title": "Suppression of Mechanical Oscillations in Quarterwave 106 MHz Resonator",
      "authors": [
        "M. Gusarova",
        "I.I. Petrushina",
        "I.V. Rybakov",
        "Ya.V. Shashkov",
        "Ya.V. Shashkov",
        "V. Zvyagintsev",
        "MEPhI",
        "Moscow",
        "Russia",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada"
      ],
      "institutions": [],
      "abstract": "Analytical calculations and numerical simulations have been done for mechanical eigenmodes of quarter wave superconducting resonators with operating frequency of 106 MHz and 80 MHz. A possibility of frequency shift of mechanical modes in 106 MHz resonator has been estimated by application of the damper. We have optimized the damper's position for suppression efficiency. We have also compared the numerical and experimental results.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc18.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC18",
      "page_number": "359",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC19",
      "title": "Influence of the Different Geometric Parameters of Superconducting Elliptical Cavities on the Multipactor",
      "authors": [
        "M. Gusarova",
        "I.I. Petrushina",
        "MEPhI",
        "Moscow",
        "Russia",
        "The results of numerical simulations of multipacting in the different superconducting elliptical cavities are presented. Question of influence of the aperture radius",
        "equator shape",
        "iris shape and frequency and electron trajectories for different geometrical parameters of elliptic structures are considered."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc19.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC19",
      "page_number": "362",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC20",
      "title": "Multipactor in Elliptical Cavities 800 MHz",
      "authors": [
        "M. Gusarova",
        "I.I. Petrushina",
        "MEPhI",
        "Moscow",
        "Russia",
        "The studies of the multipacting discharge possibility in elliptic single-cell cavities at 800 MHz with three types of hifger order modes couplers were done. The ranges of the field gradients where the conditions for the occurrence of first order multipacting discharge in the equatorial region",
        "as well as the HOM field levels were determined."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc20.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC20",
      "page_number": "365",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC21",
      "title": "Observation of Characteristic X-ray Radiation Induced by 450 MeV/nucleon C+6 Ions and 1 GeV Protons Impact in Solid Targets at Extracted and Circulated Beams of Accelerator U70",
      "authors": [
        "R.M. Nazhmudinov",
        "A.S. Kubankin",
        "A.V. Shchagin",
        "BelSU",
        "Belgorod",
        "Russia",
        "A.G. Afonin",
        "G.I. Britvich",
        "Y.A. Chesnokov",
        "A.A. Durum",
        "M.Yu. Kostin",
        "V.A. Maisheev",
        "D.A. Savin",
        "A.A. Yanovich",
        "IHEP",
        "Moscow Region",
        "Russia",
        "A.S. Gogolev",
        "S.R. Uglov",
        "TPU",
        "Tomsk",
        "Russia",
        "A.V. Shchagin",
        "N.F. Shul'ga",
        "NSC/KIPT",
        "Kharkov",
        "Ukraine",
        "KhNU",
        "Kharkov",
        "Ukraine",
        "* S. Ivanov et al.",
        "Proceedings of RUPAC 2012",
        "Saint-Petersburg",
        "Russia p. 120–122.  ** A.G. Afonin et al.",
        "Problems of Atomic Science and Technology",
        "№4 (86) (2013) 315-319."
      ],
      "institutions": [],
      "abstract": "Results of experimental research on observation of characteristic X-ray radiation excited in solid thin targets by the extracted beam of C+6 ions* and circulated beam of 1 GeV protons are presented. It was found that the background radiation of secondary particles** is not as an obstacle for observation of characteristic X-ray radiation spectral peaks at energies from a few to tens of keVs. Spectra of X-ray radiation from Ti and W targets are presented. It is shown that characteristic X-ray radiation can be used for monitoring of the number of particles passed through a non-crystalline target. The applicability of the characteristic X-ray radiation for the monitoring of the number of incident particles in experiments on steering of proton and ion beams by crystalline deflectors as well as for study of parametric X-ray radiation from crystalline deflectors is discussed.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc21.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC21",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPSC22",
      "title": "Electron Beam Deflection by Pyroelectric Crystals",
      "authors": [
        "R.M. Nazhmudinov",
        "A.S. Kubankin",
        "A.N. Oleinik",
        "A.V. Shchagin",
        "K.A. Vokhmyanina",
        "BelSU",
        "Belgorod",
        "Russia",
        "NSC/KIPT",
        "Kharkov",
        "Ukraine"
      ],
      "institutions": [],
      "abstract": "Turning of non-relativistic electron beam moving in the transverse electric field created by the pair of pyroelectric crystals is shown experimentally for the first time. The transverse electric field arises between the crystals at their heating and cooling. The angle of the electron beam deflection is measured and the value of the transverse electric field is estimated. Prospects for application of pyroelectric crystals for steering of particle beams are discussed.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc22.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC22",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPSC23",
      "title": "Upgrade of BPM System at VEPP-4M Collider",
      "authors": [
        "NSU",
        "Novosibirsk",
        "Russia",
        "E.A. Bekhtenev",
        "G.V. Karpov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Developed in BINP wideband beam position monitor (BPM) electronics has been installed at the VEPP-4M electron-positron collider. The VEPP-4M operates with two electron and two positron bunches. Wide bandwidth of new electronics (200 MHz) allows the separate measurements of electron and positron bunches with time interval between bunches up to 18 ns. 18 BPMs located near four meeting points are supplied with new electronics. The electronics can measure the position of each of four bunches. BPM system works at two modes: slow closed orbit measurements and turn-by-turn measurements. We present details of system design and operation.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc23.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC23",
      "page_number": "368",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC24",
      "title": "Fast Digital Phasemeter for Booster of NICA Project",
      "authors": [
        "A.S. Styuf",
        "G.V. Karpov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Measurement of phase difference of two signals is widely-spread task in various regions of science and engineering. For example",
        "in heavy ions accelerators phase difference between high frequency accelerating voltage and first harmonics of beam signal has to be measured. In this case phase measurement is complicated due to fast changing of signals frequency and amplitude. This task can be easy solved if both signals are converted in digital form and processed in FPGA. Fast phase difference meter for frequency range 0.2-6 MHz is described in this paper. The device provides phase difference measurements with measurement time ~17 microseconds and error less than 1 Degree. Signals frequency can be changed with speed up to 20 MHz/sec",
        "signal amplitude can be changed with speed up to 40 dB/sec. A key procedure of phase meter operation is forming of two orthogonal signals on base of reference signal. During quadrature detecting the signal integration for the time equaled the integer number of signal periods is performed. It allows effectively suppress high signal harmonics. Analog electronics contains programmable gain amplifier with gain range 22-50 dB and can work in wide range of signal amplitude. Phase meter electronics features and signal processing methods are represented in this paper. Phase meter parameters and results obtained in ion accelerator are also given."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc24.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC24",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPSC25",
      "title": "Extending VEPP-5 Control System by Middleware for Injection/extraction Automation",
      "authors": [
        "F.E. Emanov",
        "D. Bolkhovityanov",
        "A.R. Frolov",
        "Ye.A. Gusev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "NSU",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "CX and EPICS are used at VEPP-5 Injection complex. Each system is in charge of some part of accelerator devices. Middleware layer was added in order to make data processing and facility-level control actions more straightforward. Middleware is separated from clients layer by means of additional CX-server. Architectural approach is discussed by the example of complex injection/extraction automation.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc25.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC25",
      "page_number": "371",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC26",
      "title": "Distributed Beam Loss Monitor Based on the Cherenkov Effect in Optical Fiber",
      "authors": [
        "Yu. Maltseva",
        "F.E. Emanov",
        "A.V. Petrenko",
        "V.G. Prisekin",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "NSU",
        "Novosibirsk",
        "Russia",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [],
      "abstract": "A distributed beam loss monitor based on the Cherenkov effect in optical fiber has been implemented for the VEPP-5 electron and positron linacs and the 510 MeV damping ring at the Budker INP. The monitor operation is based on detection of the Cherenkov radiation generated in optical fiber by means of relativistic particles created in electromagnetic shower after highly relativistic beam particles (electrons or positrons) hit the vacuum pipe. The main advantage of the distributed monitor compared to local ones is that a long optical fiber section can be used instead of a large number of local beam loss monitors. In our experiments the Cherenkov light was detected by photomultiplier tube (PMT). Timing of PMT signal gives the location of the beam loss. In the experiment with 20 m long optical fiber we achieved 3 m spatial resolution. To improve spatial resolution optimization and selection process of optical fiber and PMT are needed and according to our theoretical estimations 0.5 m spatial resolution can be achieved. We also suggest similar techniques for detection of electron (or positron) losses due to Touschek effect in storage rings.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc26.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC26",
      "page_number": "374",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC27",
      "title": "Modernization of VEPP-2000 Control System",
      "authors": [
        "NSU",
        "Novosibirsk",
        "Russia",
        "D.E. Berkaev",
        "O.V. Gorbatenko",
        "A.P. Lysenko",
        "Yu. A. Rogovsky",
        "A.L. Romanov",
        "A.I. Senchenko",
        "P.Yu. Shatunov",
        "Y.M. Shatunov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Electron-positron collider VEPP-2000 delivered data for the high energy physics since the end of 2009. In the summer of 2013 the long shutdown was started dedicated to the deep upgrade of the wide range of subsystems. The main goal of the improvements is to reach or exceed design luminosity in the whole energy range from 200 MeV to 1000 MeV per bunch. The hardware of the accelerator complex consists of high current main field power supplies",
        "low current power supplies for steering and multipole magnets",
        "pulsed power supplies for channel's elements",
        "RF subsystems",
        "BPM and some other special subsystems (such as vacuum",
        "temperature",
        "etc.). The control system is based on CANbas",
        "CAMAC and VME devices. The wide range of software corresponding to specific hardware subsystems forms complicated interacting system that manages all parts of the VEPP-2000 accelerator facility. Automation software is running on several TCP/IP connected PC platforms under operating system Linux and uses client-server techniques. The paper presents general overview and changes made in architecture",
        "implementation and functionality of hardware and software of the VEPP-2000 collider control system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc27.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC27",
      "page_number": "377",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPSC28",
      "title": "Development of Automation System of the Ion Source",
      "authors": [
        "A.M. Koshkarev",
        "Y.I. Belchenko",
        "A.N. Kvashnin",
        "A.L. Sanin",
        "P.V. Zubarev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "To operate a source of negative hydrogen ions an automatic distributed control system was developed. This system consists of master controller (Slab C8051F120) and a set of peripheral local controllers (PLC) based on microcontroller Slab C8051F350. Using an optical link between PLC and master controller there was created a system resistant to high-voltage breakdowns of the ion source. To control the system",
        "a special programming language has been created. It includes procedures for checking the necessary parameters",
        "setting the value of the physical quantities to simplify the experiment",
        "verifying the lock status and protection. This system provides two programmable timers",
        "as well as procedures in emergency situations",
        "such as: lack of water",
        "poor vacuum. It can be operated in semi-automatic mode: the script asks operator about preferable actions and then it continues actions depending on the response. All scripts are performed by master controller",
        "and this makes system very rapid (for example system response time is 1 ms)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc28.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC28",
      "page_number": "380",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC29",
      "title": "Controller for RF Stations for Booster of NICA Project",
      "authors": [
        "G.A. Fatkin",
        "A.M. Batrakov",
        "I.V. Ilyin",
        "G.Y. Kurkin",
        "A.M. Pilan",
        "M.Yu. Vasilyev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "NSU",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Intellectual Controller for RF stations based on CPU module",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc29.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC29",
      "page_number": "383",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPSC30",
      "title": "Development of an Integrated Tomography Experiment Control Environment",
      "authors": [
        "I.A. Khokhriakov",
        "F. Beckmann",
        "HZG",
        "Geesthacht",
        "Germany",
        "The Helmholtz-Zentrum Geesthacht is operating beamlines optimized for materials research using synchrotron radiation at the Deutsches Elektronen-Synchrotron DESY in Hamburg and beamlines using neutrons at the FRM II in Munich. With the beginning of the operation of the 3rd generation synchrotron-radiation source PETRA III",
        "Hamburg",
        "and the design and planning of the new neutron source ESS",
        "Lund",
        "there is a strong demand to increase the data throughput",
        "to make optimal use of the beamtime",
        "together with a full controlled experiment. Especially in tomography the data pipeline from the experiment to the 3D reconstruction has to be redesigned. Furthermore",
        "the extensive progress in hardware in recent years makes it now possible to develop nearly real time tomography experiment control system. Such system can perform all the routines that are necessary for the experiment and provide real time feedback to the user. This feedback can be used for instant monitoring and/or for real time reconstruction. The most important task for such system is the collection of the data. The data can be divided into three main groups: 1) static data; 2) data collected during the experiment; 3) persistent data. Finally all data is stored in the NeXus format. This data can be interpreted on the fly",
        "for instance to generate a feedback or to perform a reconstruction. This system is now in an approbation stage at IBL (P05) and HEMS (P07) beamlines",
        "PETRA III",
        "DESY",
        "Hamburg",
        "Germany."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc30.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC30",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPSC31",
      "title": "Media Server for Video and Audio Exchange between the U-70 Accelerator Complex Control Rooms",
      "authors": [
        "I. Lobov",
        "V. Gotman",
        "IHEP",
        "Moscow Region",
        "Russia",
        "The media server was developed that implements the exchange of video and audio streams between control rooms for U-70 technological subsystems. Media server has the possibility of making changes into the intermediate video images to embed current technological information. The media server is implemented as a set of threads of execution",
        "one for each video format conversion module. The media server is a chain of successive transformations of video and audio streams from one format to another: H264 - Y4M - Theora formats for video",
        "PCM - Vorbis formats for audio. The final video and audio streams are encapsulated into the OGG container stream which is translating into the local network. OGG container has been chosen because of its completely open",
        "patent-free technology and full support in"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc31.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC31",
      "page_number": "386",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC32",
      "title": "U-70 Accelerator Complex: Centralized Access to IP-Devices with Embedded Web-Server",
      "authors": [
        "Yu.V. Milichenko",
        "E.V. Takaeva",
        "V.P. Voevodin",
        "IHEP",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The paper describes our efforts to organize centralized access to IP-devices of specific types. Each device includes proper embedded web-server and is connected to an accelerator department network. Today there are tens of the devices are used to give pictures online. A device access is carried out by user understandable device names with the aid of accelerator department web-server. Some arisen problems are pointed. Possible manifold forms of on screen presentation of pictures derived from devices are presented.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc32.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC32",
      "page_number": "389",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC33",
      "title": "Digital Signal Processing Algorithms for Linac Low-Level RF Systems",
      "authors": [
        "D.A. Liakin",
        "S.V. Barabin",
        "A.Y. Orlov",
        "ITEP",
        "Moscow",
        "Russia",
        "A set of LLRF systems had been designed for various applications of resonant RF devices such as accelerators or beam deflectors. This report presents compact signal detection algorithms",
        "used in most of developed systems. Application-specific extension of the signal processing procedure allows the system be synchronized to external self-excited oscillator."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc33.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC33",
      "page_number": "392",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPSC34",
      "title": "A Digital Low-Level RF System for Resonant Beam Deflector of LAPLAS Experiment",
      "authors": [
        "D.A. Liakin",
        "S.V. Barabin",
        "A.Y. Orlov",
        "ITEP",
        "Moscow",
        "Russia",
        "A two-resonator heavy ion deflecting system is a part of LAPLAS experiment. ITEP built and put into operation a lightweight prototype of a deflector. Developed high performance radio-frequency control unit provides all necessary options for successful operation in LAPLAS or ITEP installations. The LLRF includes a two-channel reference generator based on a digital signal processing core and resonant frequency control modules",
        "also powered by an appropriate DSP."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc34.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC34",
      "page_number": "395",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPSC35",
      "title": "Quench Detector for Superconducting Elements of  the NICA Accelerator Complex",
      "authors": [
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "A.O. Sidorin",
        "Z.I. Smirnova",
        "L.A. Svetov",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The system provides highly effective detection of quenches in superconducting elements of Nuclotron and NICA facility. Full information about quench element is transmitted to control room. Diagram of analogue quench signal could be displayed on screen for further analysis. The system performs scheduled self-test diagnostics in real time and controls power elements of energy evacuation.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc35.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC35",
      "page_number": "398",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC36",
      "title": "Experimental Study of the Scattering of  7.4 Mev Electrons Intersecting a Foil at an angle of  5–60 degree to its Surface",
      "authors": [
        "A.V. Serov",
        "A.V. Koltsov",
        "LPI",
        "Moscow",
        "Russia",
        "NRNU",
        "Moscow",
        "Russia",
        "Angular distributions of electrons incident of a planar target at a small angle to its surface have been measured. Electrons have been injected from a microtron with a particle energy of 7.4 MeV. The dependence of the characteristics of beams on the initial energy and direction of injection of particles",
        "as well as on the material and thickness of the target",
        "has been considered. The intersection and reflection of electrons in the target have been investigated. The angle between the trajectory of the particles and the surface of the target was varied in the range of 5-60 degree. Aluminum",
        "lead",
        "and copper foils have been tested. The thickness of the foils was varied from 50 mkm to 600 mkm."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc36.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC36",
      "page_number": "401",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC37",
      "title": "A Pulse Generator of X-Ray Quants for Remote Radiation Monitoring",
      "authors": [
        "A.V. Il'inskiy",
        "B.Y. Bogdanovich",
        "D.R. Khasaya",
        "A. Nesterovich",
        "A.E. Shikanov",
        "MEPhI",
        "Moscow",
        "Russia",
        "For effective implementation of modern methods of X-raying required equipment complexes with increased requirements to the generator X-rays compared to conventional devices used in radiography. These requirements basically boil down to the fact that the radiation source along with small dimensions should provide at least 0.5 m from the target minimum exposure dose of about 10 mR for 1 with the appliance with a minimum area of the radiating surface of the target. These parameters are obtained by using X-rays generator based on high-current diode accelerating tube (AT) operating in the pulse-periodic regime at current amplitude of the accelerated electrons in the tube Im ~ 1 kA",
        "pulse duration 1-10 ns and a maximum energy of electrons reaching several hundred keV The report presents the development of compact AT",
        "which improved definition x-ray image is ensured by using a diode system with a coaxial geometry acceleration of electrons to the anode electrode internal target and explosive emission cathode. AT used to run a specially designed high-voltage pulse transformer-based \"Tesla\" with surge sharpener. Describes the design and block diagram interface generator X-ray quanta. Feature is the high stability of the generator is not dependent on the voltage",
        "battery charge. Presented the results of experimental testing of the generator X-ray quanta. Also shows the waveform duration x-ray pulses in the presence of the lead filter and without it."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc37_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc37.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc37_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC37",
      "page_number": "404",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC38",
      "title": "Development of the Software for the Accelerating Fields in Linear Structures Measurement",
      "authors": [
        "E.A. Savin",
        "M.V. Lalayan",
        "A.Yu. Smirnov",
        "MEPhI",
        "Moscow",
        "Russia",
        "Nano",
        "Moscow",
        "Russia",
        "The software which allows controlling the whole installation to measure electric fields in the linear structures has been developed. The installation consists of linear structure",
        "step motor drive",
        "motor controller",
        "a probe which moves on the string throw the structure to perturb the field to use the perturbation measuring method",
        "network vector analyzer and the PC. He software interface is user-friendly",
        "user only needs to write down the length of the structure",
        "a desired step of the probe and push the start button. As a result user can obtain the picture of electric field on the structure axis. It is possible to choose between two measuring methods: by S11 of by S21."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc38_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc38.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc38_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC38",
      "page_number": "407",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC39",
      "title": "Control Systems for Radiography and Cargo Inspection RF Accelerators",
      "authors": [
        "MSU",
        "Moscow",
        "Russia",
        "A.N. Kamanin",
        "V.G. Sayapin",
        "V.I. Shvedunov",
        "D.S. Yurov",
        "M.V. Lomonosov Moscow State University (MSU)",
        "Skobeltsyn Institute of Nuclear Physics",
        "Moscow",
        "Russia",
        "Federal State Unitary Enterprise",
        "Laboratory of Electron Accelerators MSU",
        "Ltd",
        "Moscow",
        "Russia",
        "Based on \"open technologies\" approach to design of control systems for radiography and cargo inspection electron RF accelerators constructed at Laboratory of Electron Accelerators MSU is described. The control system consists of a number of specialized controllers each responsible for separate accelerator subsystem connected via Ethernet interface and Modbus/TCP protocol with control computer which in turn is connected with control panel computer",
        "modulator",
        "power supplies etc. each having its own digital interface. Each controller contains one or several special boards conditioning external analogue and discrete signals and universal microcontroller part providing controller operation and network connection. Both control computer and control panel computer are based on BlueShark SOM (System on a Module) amd run Linux operating system. Custom SCADA-like system has been developed to provide proper accelerator operation and operator interface with support for different levels of access to accelerator parameters."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc39_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc39.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc39_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC39",
      "page_number": "410",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC40",
      "title": "Automated Control System of Target System for PET radionuclids Production",
      "authors": [
        "R.M. Klopenkov",
        "P.A. Gnutov",
        "M.L. Klopenkov",
        "A.N. Kuzhlev",
        "A.A. Melnikov",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "St. Petersburg State Polytechnic University",
        "St. Petersburg",
        "Russia",
        "An Automated Control System of target system for production of PET-radionuclids has been designed. The system allows on-line obtaining of the data on the status of the target system and remote control of loading",
        "irradiation and evacuation of the activity to synthesis modules. According to algorithms available in the software",
        "this system makes possible emergency situations to be prevented and incorrect actions of the operator to be blocked."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc40_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc40.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc40_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC40",
      "page_number": "413",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC41",
      "title": "System for Remote Replacement of Targets of the Target System for CC-Cyclotrons",
      "authors": [
        "R.M. Klopenkov",
        "P.A. Gnutov",
        "M.L. Klopenkov",
        "A.N. Kuzhlev",
        "A.A. Melnikov",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "An automated system for remote replacement of target devices of the target system for cyclotrons of the CC-series has been designed. The system allows one of 5 available targets to be positioned under the beam of the cyclotron at the operator choice. Such a technical solution allows us to have sufficiently smaller overall dimensions of the equipment and less time is required for servicing of water and gas targets. Separate system for target replacement is provided for each beam extraction",
        "which allows the cyclotron to be equipped with 10 different target devices",
        "and makes possible simultaneous irradiation of 2 targets."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc41_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc41.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc41_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC41",
      "page_number": "415",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC42",
      "title": "Modernization of the Automated Control System of  Kurchatov Synchrotron Radiation Source Using Citect SCADA",
      "authors": [
        "E.V. Kaportsev",
        "V. Dombrovsky",
        "Y.V. Efimov",
        "V. Korchuganov",
        "Y.V. Krylov",
        "K. Moseev",
        "N.I. Moseiko",
        "A.G. Valentinov",
        "NRC",
        "Moscow",
        "Russia",
        "The running cycle of Kurchatov Synchrotron Radiation Source (KSRS) includes the injection of electrons with energy 80 MeV from the linear accelerator in the booster storage ring Siberia-1",
        "the accumulation of a electron current up to 400 mA and",
        "then",
        "electron energy ramping up to 450 MeV with the subsequent extraction of electrons in the main ring",
        "storage ring Siberia-2",
        "and accumulation there up to 300 mA",
        "and at last the energy ramping up to 2.5 GeV. A few years ago we started modernization of the automated control systems (ACS) of accelerator - storage complex. Modernization has affected the most important parts of the system - the system of data collection and control system. Used advanced solutions based on CAN and VME and modular complexes National Instruments. Currently begins implementation of the Citect SCADA system. In this paper the stages of implementation of the SCADA control system. Showing part of the system",
        "which is already widely used",
        "as well as parts of the system",
        "which is scheduled to launch in the near future."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc42_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc42.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc42_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC42",
      "page_number": "417",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC43",
      "title": "Electrostatic Pick-ups for Debunched Beams at INR Linac",
      "authors": [
        "S.A. Gavrilov",
        "P.I. Reinhardt-Nickoulin",
        "I.V. Vasilyev",
        "RAS/INR",
        "Moscow",
        "Russia",
        "Pick-ups are one of the most widespread non-destructive diagnostics at charged particle accelerators. These detectors",
        "also known as beam position monitors",
        "are generally used for the center-of-mass position measurements of bunched beams. The paper describes the research results for infrequent case of debunched beams operation. Measurement peculiarities and distinctive features of electronics are presented. The results of test bench-based measurements and 3D finite element simulations are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc43_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc43.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc43_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC43",
      "page_number": "420",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPSC44",
      "title": "Development of Remote Control System for H-minus Ions Source of INR LINAC",
      "authors": [
        "V.S. Klenov",
        "Yu.V. Kiselev",
        "O. Volodkevich",
        "V. Zubets",
        "RAS/INR",
        "Moscow",
        "Russia",
        "A system of remote control of surface plasma source of negative ions for INR RAS LINAC was designed",
        "constructed and put into operation. The INR LINAC negative ions injector is based on the accelerating tube at energy of 400 keV and surface plasma source of negative ions. Galvanic isolation and spatial separation of elements that are at potential 400 kV in the power rack of the ion source and the host computer are carried out by means of fiber-optic USB-interface extender from firms Icron. A set of multifunctional units from National Instruments allows to monitor the oscilloscope signals with up to 50 Ms/s and to control the ions source power settings. The data acquisition devices programming performed in a LabView graphical environment. Algorithm and LabVew code for fast and safe \"conditioning\" of the ion source discharge gap and extractor gap from arcing and breakdowns were developed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc44_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc44.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc44_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC44",
      "page_number": "423",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC45",
      "title": "Use of Fast Magnetic Beam Raster System for INR Isotope Production Facility",
      "authors": [
        "O. Volodkevich",
        "S. Bragin",
        "A. Feschenko",
        "O.V. Grekhov",
        "Yu.V. Kiselev",
        "V.M. Kokhanyuk",
        "V.N. Mikhailov",
        "A.N. Mirzojan",
        "V.L. Serov",
        "RAS/INR",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Fast magnetic beam raster system for INR isotope production facility is developed and implemented. The system enables to increase the isotope production efficiency by providing a possibility of using a higher intensity proton beam on the target of the isotope production facility. First experimental results of system application for irradiation of the targets are presented.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc45_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc45.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc45_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC45",
      "page_number": "426",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC46",
      "title": "Simulation and Optimization of Ion Optical  Extraction, Acceleration and H-minus Ion Beam Matching Systems",
      "authors": [
        "IHEP",
        "Moscow Region",
        "Russia",
        "V.S. Klenov",
        "V.N. Mikhailov",
        "O. Volodkevich",
        "RAS/INR",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Source of negative hydrogen ions for the implementation of multiturn charge-exchange injection to increase the intensity of IHEP buster is developed. Surface-plasma ion source with Penning discharge is selected as a source of H-minus ions. A high-current extraction system with downstream electron dumping has been designed. A three-dimensional ion optical code IBSimu has been utilized for modelling and optimization the extraction system and ion beam acceleration to energy of 100 keV. A magnetic low energy beam transport line consisting of two solenoids has been designed to match the beam with RFQ. TRACE 2D code was used to optimize LEBT. A deflecting magnet with small angular deflection (10) has been installed between solenoids to eliminate forward tracing of neutral atoms from ions source to RFQ.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc46_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc46.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc46_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC46",
      "page_number": "429",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC47",
      "title": "Production of Metal Ion Beams from ECR Ion Sources by MIVOC Method",
      "authors": [
        "K.I. Kuzmenkov",
        "S.L. Bogomolov",
        "A.E. Bondarchenko",
        "A.A. Efremov",
        "N. Lebedev",
        "K.V. Lebedev",
        "V.Ya. Lebedev",
        "V.N. Loginov",
        "Yu. Yazvitsky",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Z. Asfari",
        "B.J.P. Gall",
        "IPHC",
        "Strasbourg Cedex 2",
        "France",
        "The production of metal ion beams with ECR ion sources using MIVOC method is described. The method is based on the use of metal compounds having a high vapor pressure at room temperature: for example",
        "C2B10H12",
        "Fe(C5H5)2 and several others. Intense ion beams of B and Fe were produced at the FLNR JINR cyclotrons using this method. The main efforts were went into production and acceleration of 50Ti ion beam at the U-400 cyclotron. The experiments on production of 50Ti ion beam were performed at the test bench with the natural and enriched compounds of titanium (CH3)5C5Ti(CH3)3. In the experiments at the test bench the beam currents of Ti5+ - 80 mkA and Ti11+ - 70 mkA were achieved at different settings of the source. After successful tests two 3 weeks runs with Ti-50 beam were performed at the U-400 cyclotron for the experiments on spectroscopy of super heavy elements. The intensity of the injected beam of 50Ti5+ was about of 50-60 mkA",
        "during experiment the source have shown stable operation. The compound consumption rate was determined to be about of 2.4 mg/h",
        "corresponding to 50Ti consumption of 0.52 mg/h."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc47_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc47.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc47_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC47",
      "page_number": "432",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC48",
      "title": "Hydrogen Nuclides Acceleration from Laser Plasma in the Diode with Magnetic Insulation of Electrons",
      "authors": [
        "A.E. Shikanov",
        "K.I. Kozlovskiy",
        "V.L. Shatokhin",
        "E.D. Vovchenko",
        "MEPhI",
        "Moscow",
        "Russia",
        "New experimental results of obtaining accelerated deuterons in the small-sized diode with magnetic insulation are reported. The effective mode of ion acceleration to energies at 300 keV in the diode with a high voltage anode in order to initiate nuclear reactions D(d",
        "n)3He is obtained with diode current ~0",
        "5 kA and impulse duration ~1 mks in vacuum ~5*10-2 Pa. Containing deuterons laser plasma was generated at the anode during TiD target laser irradiation with a wavelength of 1.06 microns and a power density of ~5*1014 W/m2. Accelerating voltage impulse was formed using Arkadyev–Marx 20 cascade impulse voltage generator with air insulation. Diode cathode covers the anode symmetrically. It is a hollow cylinder permanent magnet with induction on the axis ~0",
        "4 T. Magnetic insulation in accelerating gap leads to suppression of the accelerated electrons current at level of 0.5 in relation to the total diode current. Used methods of accelerating diode ion current",
        "accelerating impulse voltage and penetrating radiations characteristics measurements are described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc48_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc48.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc48_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC48",
      "page_number": "435",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC49",
      "title": "Hydrogen Nuclides Removing From Pulse Plasma Formations",
      "authors": [
        "B.Y. Bogdanovich",
        "A. Nesterovich",
        "V.L. Shatokhin",
        "A.E. Shikanov",
        "MEPhI",
        "Moscow",
        "Russia",
        "The features of hydrogen nuclides extraction from vacuum-arc plasma and laser sources by electric field research results are presented in the report. Such sources can be used in accelerators injection systems and in neutron generators. These processes",
        "found",
        "are strongly influenced by electrostatic oscillations in the plasma boundary",
        "which position continuously varies",
        "in addition to the ions thermal motion. Such movement kinematics determined by the velocity field in plasma formation and its concentration reducing because of the ions extraction. On the basis of this model it shows that plasma boundary moves initially in the direction to the ejection electrode",
        "then stops and begins quickly move back. An equation for the nuclides emission current density from hydrogen plasma surface for their quasiplanar extraction geometry is obtained."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc49_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc49.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc49_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC49",
      "page_number": "438",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC50",
      "title": "Neutron Accelerating Tubes with Microwave Deuterons Source Using Electron-cyclotron Resonance Effect",
      "authors": [
        "A.N. Didenko",
        "B.Y. Bogdanovich",
        "K.I. Kozlovskiy",
        "A. Nesterovich",
        "A.V. Prokopenko",
        "V.L. Shatokhin",
        "A.E. Shikanov",
        "MEPhI",
        "Moscow",
        "Russia",
        "The physical principles of increased efficiency neutron accelerating tubes based on the microwave sources of heavy hydrogen nuclides",
        "using the electron-cyclotron resonance effect (ECR) are considered. The authors' theoretical results are given on electromagnetic oscillations generation in the working volume of the ion source of the accelerating tube with the boundary excitation of a microwave discharge. Resonator and waveguide modes for ECR-plasma excitation are thus examined. Features of neutron generation in these accelerator neutron tubes based on microwave source of heavy hydrogen nuclides are analyzed. The algorithm is developed and numerical simulation of neutron pulse formation in neutron generators based on microwave source is done taking into account target shape and the possible deuterons resonant recharge. Frequency dependences of the energy flux density transmitted from an alternating electromagnetic field to the electron component of the plasma are obtained depending on the constant longitudinal magnetic field induction and pressure in the discharge chamber. The results of these studies could form the basis for the efficient domestic portable neutron generators development based on accelerating tubes with microwave hydrogen nuclides sources."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc50_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc50.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc50_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC50",
      "page_number": "441",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC51",
      "title": "Ion Source Deuteron Beam Acceleration in Gas-filled Ion-optic System",
      "authors": [
        "MEPhI",
        "Moscow",
        "Russia",
        "Deuteron beam acceleration in ion-optic system of gas-filled neutron tubes was investigated. PIC code SUMA* used for computer simulation of ionization and knock on processes and there influence on deuteron beam parameters. When deuteron and ionized particles space charge self-field forces become the same order of magnitude as external one",
        "virtual cathode may occurs. It is happens because of injected from ion source deuterons cannot overcome their own space charge potential wall and move in transverse direction. However",
        "electrons",
        "produced by ionization",
        "are trapped within the deuteron beam space charge potential wall and decrease it significantly. Thus",
        "space charge neutralization of deuteron beams by electrons",
        "may considerably increase target current and",
        "as a result",
        "output neutron flow. Moreover",
        "own longitudinal electric field rise near the target leads to reduction of accelerating electrode – target potential wall",
        "which was made to prevent knock on emission from the target. As a result",
        "additional knocked on electrons may appear in the region and should be taken into account. The data obtained were compared with experimental results.",
        "* A.N. Didenko",
        "V.I. Rashchikov",
        "V.E. Fortov",
        "Technical Physics",
        "Vol. 56",
        "No. 10",
        "pp. 1535–1538",
        "2011"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc51_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc51.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc51_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC51",
      "page_number": "444",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC52",
      "title": "Dynamics of Plasma-Beam Formations in the Acceleration Gap of the Pulse Neutron Generator-based Vacuum Neutron Tube",
      "authors": [
        "S. Sergey",
        "S. Maslennikov",
        "E. Shkolnikov",
        "National Research Nuclear University (MEPhI)",
        "Moscow",
        "Russia",
        "LPI RAS",
        "Moscow",
        "Russia",
        "The analysis of dynamics of plasma flows containing deuterium",
        "zirconium ions",
        "and electrons in acceleration gap of the pulsed neutron generator vacuum neutron tube* is presented in the paper. The investigations have been undertaken with the use of code KARAT** for the two-dimensional time-dependant regime. The limiting currents of each component for the real geometry of acceleration gap have been determined. The differences between the values of these currents and those determined with the use of the Child-Langmuir equation have been demonstrated. The analysis of dynamics of plasma emitter in the gap has been performed by the example of accelerating voltage of 120 kV and pulse duration of 1.2 mks. It has been shown that the value of the current incoming in the gap from the ions source can differ strongly from the current value at the target. For increasing of this value the partitioning of acceleration gap with the use of conductive grid which is transparent for beam and has several geometric configurations has been proposed. The ring configuration of the emitter has been considered for the same purposes. The calculations have shown that the combination of these two methods described above can allow transporting deuterons current from the anode grid to the target without losses.",
        "* E.P.Bogolubov",
        "V.I.Ryzhkov",
        "D.I.Yurkov. Conference \"PNG and Technologies on Their Basis\"",
        "2013",
        "p.14.  ** V.P.Tarakanov. User's Manual for Code KARAT. Berkeley Research Associates",
        "Inc. 1992",
        "p.127."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc52_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc52.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc52_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC52",
      "page_number": "447",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC53",
      "title": "The NG-10 Neutron Generator for Production of Neutron Fluxes in Continuous and Pulse Modes",
      "authors": [
        "D.A. Solnyshkov",
        "A.V. Antonov",
        "A.N. Kuzhlev",
        "N.P. Mikulinas",
        "A.V. Morozov",
        "G.G. Voronin",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "Designed neutron generator is designed for a neutron yield 1x1011 neutrons / s in continuous mode and includes ion accelerator with an accelerating voltage",
        "continuously adjustable in the range of 120-150 keV and a beam current of atomic deuterium ions up to 2 mA",
        "and the target device",
        "in which used Ti-T target different diameters. In addition to high and stable yield of neutrons in time when operating continuously generator provides pulsed mode of operation over a wide range of duration and pulse repetition rate. Pulsed neutron generator operation is performed by modulating the discharge current of the ion source. For this purpose",
        "a unique system of power discharge",
        "which allows for both continuous and pulse modes. In this case it is possible to produce a smooth adjustment of the pulse width of the beam current. Switch from pulse mode to DC promptly made with the remote control."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc53_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc53.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc53_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC53",
      "page_number": "450",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSC54",
      "title": "Studies on Radially-Directed Electron Beam Formation in the Secondary-Emission Source",
      "authors": [
        "N.G. Reshetnyak",
        "N. Ayzatsky",
        "I.A. Chertishchev",
        "A.N. Dovbnya",
        "A.S. Mazmanishvili",
        "V.P. Romas'ko",
        "NSC/KIPT",
        "Kharkov",
        "Ukraine",
        "The present paper describes the experimental and theoretical data on radial electron beam formation in a secondary-emission source during the beam transport in a decreasing magnetic field of the solenoid. The magnetron gun with a secondary-emission cathode",
        "36 mm in diameter",
        "and a 78 mm anode",
        "was used as an electron source. The beam transport was performed in the system for two cases. In the first case",
        "the system consisted of 5 rings with an inside diameter 66 mm and of width 30 mm; and in the second case",
        "the system included 15 copper rings of inside diameter 66 mm and 8 mm wide",
        "and was at a distance of 85 mm from the anode of the magnetron gun. In the second case",
        "for realization of the local decrease of the solenoidal field a scattered magnetic field was used",
        "the magnetic field being produced by a SmCO5 permanent magnet. The beam current and its distribution along the length of ring system were investigated as functions of the magnetic field amplitude and the gradient of field decrease in the electron energy range from 35 till 85 keV. The mode of electron current bunch formation was also studied. A mathematical model of electron flow motion in the decreasing field has been constructed. Numerical results are found to be in satisfactory agreement with the experimental data."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc54_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc54.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc54_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC54",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPSC55",
      "title": "Improvement of the Beam Transmission in the Central Region Of Warsaw U200P Cyclotron",
      "authors": [
        "O. Steczkiewicz",
        "J. Choinski",
        "P. Gmaj",
        "HIL",
        "Warsaw",
        "Poland",
        "V. Bekhterev",
        "I.A. Ivanenko",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "To date",
        "Warsaw U200P cyclotron exploited a mirror inflector to feed heavy ions extracted from ECR ion source (10 GHz",
        "11 kV) to the central region of the cyclotron. However",
        "in such configuration very low transmission was reachable after many optimizations. Additionally",
        "the new ECR ion source (14",
        "5 GHz",
        "14-24 kV) was installed",
        "which offers energies far exceeding capabilities of the currently operated inflector and central region. To avoid these obstacles",
        "we have developed a spiral inflector and redesigned central region of the cyclotron. It was a very challenging task",
        "bearing in mind limited volume of central region in our compact machine",
        "to carve these elements suitably for decent versatility of ion beams offered by Warsaw cyclotron. This project was executed in the collaboration with FLNR in Dubna",
        "Russia. The cyclotron equipped with the new central region works in the \"constant orbit\" regime. Here we present the results of both computational simulations and measurements of the beam transmission in upgraded central region."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/thpsc55_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/thpsc55.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/thpsc55_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-THPSC55",
      "page_number": "453",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 55,
  "scrape_time": "2025-10-11 02:53:16"
}