{
  "session_info": {
    "id": "WEPHO",
    "name": "WEPHO - Poster Session",
    "url": "https://proceedings.jacow.org/PAC2013/html/wepho.htm"
  },
  "papers": [
    {
      "paper_id": "WEPHO01",
      "title": "High Power RF System for e-linac for TRIUMF",
      "authors": [
        "A.K. Mitra",
        "Z.T. Ang",
        "I.V. Bylinskii",
        "S. Calic",
        "D. Dale",
        "S.R. Koscielniak",
        "R.E. Laxdal",
        "F. Mammarella",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "The TRIUMF e-linac high power system will be built in stages. For the first phase of installation to be completed by September 2014",
        "the injector cryomodule (EINJ) will be fed by a 290 kW cw at a reduced power level and the accelerating cryomodule (EACA) will be powered by an identical 290 kW CW klystron. The second klystron and second high voltage power supply are also being procured from CPI and Ampegon respectively. The 290 kW cw 1.3 GHz klystron is a factory tuned multi-cavity",
        "high efficiency",
        "high gain",
        "broadband",
        "water cooled tube. The klystron has been tested at the factory. The maximum usable linear range of the rf output power of the klystron is 270 kW and is governed by the incremental gain of 0.5 dB/dB. The high voltage power supply system (KPS) for the klystron",
        "based on a voltage controlled power module technology",
        "consists of 65 kV beam power supply",
        "focus supply",
        "filament power supply and vacuum ion pump power supply. The klystron will be tested to full power on a dummy load by October 2013. At the same time",
        "the KPS will be tested fully with all controls",
        "interlocks",
        "protections and integration of the klystron and a 300 kW high power circulator."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho01.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO01",
      "page_number": "934",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO03",
      "title": "The Layout of 352 MHz 400 kW RF Power Amplifier",
      "authors": [
        "A.Yu. Smirnov",
        "E.V. Ivanov",
        "A.A. Krasnov",
        "K.I. Nikolskiy",
        "S.A. Polikhov",
        "I. Řežanov",
        "Siemens Research Center",
        "Moscow",
        "Russia",
        "Siemens LLC",
        "Moscow",
        "Russia",
        "In this paper",
        "we present the current status of the RF power amplifier under development for European Spallation Source (ESS",
        "Sweden) normal conducting and superconducting accelerating sections based on solid-state architecture. A single 400 kW pulsed machine is represented with four standard 19\" cabinets. Brief description and technical solutions regarding 8 kW (Class-AB",
        "Si transistor based) RF modules",
        "different power combiners and control system are shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho03.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO03",
      "page_number": "937",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO04",
      "title": "The Layout of 72 MHz 16 kW RF Power Generator",
      "authors": [
        "A.Yu. Smirnov",
        "E.V. Ivanov",
        "A.A. Krasnov",
        "K.I. Nikolskiy",
        "S.A. Polikhov",
        "I. Řežanov",
        "Siemens Research Center",
        "Moscow",
        "Russia",
        "Siemens LLC",
        "Moscow",
        "Russia",
        "In this paper",
        "we present the current design of the RF power generator for medical cyclotron Eclipse (Siemens Healthcare) based on solid-state architecture. The 16 kW machine operating at 72 MHz in continuous wave regime is being assembled into standard 19\" cabinet. Brief description and technical solutions regarding 2 kW (Class-AB",
        "Si transistor based) RF modules",
        "power combiner and control system are shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho04.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO04",
      "page_number": "940",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO05",
      "title": "Overview of the RHIC e-Lens Superconducting Magnet Power Supply System",
      "authors": [
        "D. Bruno",
        "A. Di Lieto",
        "G. Ganetis",
        "R.F. Lambiase",
        "W. Louie",
        "C. Mi",
        "T. Samms",
        "J. Sandberg",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A new superconducting solenoid magnet was installed in the yellow ring of RHIC before Run 13 as part of the e-lens project. The second solenoid superconducting magnet will be installed in RHIC after Run 13 is over. There are 6 power supplies required for the solenoid",
        "fringe and anti-fringe coils for both magnets. Commercial off the shelf unipolar power supplies are used to power the solenoid",
        "fringe and anti-fringe coils. There are 24 corrector power supplies required for both magnets. Custom built 50A bipolar power supplies are used to power the correctors. Quench protection and quench detection have also been installed in this power supply system. In addition",
        "4 new phase shift power supplies have been installed in RHIC which are needed for the new e-lens system. These phase shift power supplies have been installed across the yellow focusing and defocusing arcs as well as the blue focusing and defocusing arcs from sector 8 to sector 10. Power Supply technology",
        "control system",
        "connections",
        "the quench detection/protection system",
        "and status will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho05.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO05",
      "page_number": "943",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO08",
      "title": "kW CW, 350 MHz Multiple Beam Inductive Output Tube",
      "authors": [
        "L.R. Ives",
        "G. Collins",
        "R. Karimov",
        "D. Marsden",
        "M.E. Read",
        "CCR",
        "San Mateo",
        "California",
        "USA",
        "E.L. Eisen",
        "T. Kimura",
        "CPI",
        "Palo Alto",
        "California",
        "USA",
        "Calabazas Creek Research",
        "Inc.",
        "in collaboration with Communications & Power Industries",
        "Inc.",
        "is completing assembly of a 200 kW CW",
        "350 MHz",
        "multiple beam inductive output tube (MBIOT). Seven production IOT guns in a circular pattern are driven by a coaxial input cavity. The beams drive a fundamental mode cavity with the power coupled through a coaxial window on the axis and passing through a coaxial collector. The RF input power enters through a coaxial waveguide on the electron gun end of the IOT. The principle challenge is driving all seven electron guns with same RF power and phase. The MBIOT is designed to operate at 22 kV with a total beam current of approximately 13 A. Simulations predict an output power of 210 kW with an efficiency of 71%",
        "23 dB gain and 4 MW bandwidth. Initial testing is scheduled for fall 2013 and will be performed at the Naval Surface Weapons Center",
        "followed by delivery and final testing at the Advanced Photon Source (APS) at Argonne National Laboratory. The device will be evaluated as a potential replacement for the klystrons now driving the APS. This presentation will describe the design and fabrication. Any test results will also be presented."
      ],
      "institutions": [
        "Funding: This development is funded by a grant from the U.S. Department of Energy with additional funding from communications & Power Industries, Inc and the Naval Surface Weapons Center."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho08.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO08",
      "page_number": "946",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO09",
      "title": "MW, L-Band, Annular Beam Klystron for Accelerator Applications",
      "authors": [
        "M.E. Read",
        "G. Collins",
        "P. Ferguson",
        "L.R. Ives",
        "R.H. Jackson",
        "D. Marsden",
        "CCR",
        "San Mateo",
        "California",
        "USA",
        "Calabazas Creek Research Inc. (CCR) is developing an Annular Beam Klystron (ABK) for advanced accelerators. The power and frequency",
        "10 MW and 1.3 GHz",
        "respectively",
        "are consistent with requirements for the International Linear Collider (ILC)",
        "but the primary goal of the program is to demonstrate the feasibility of the configuration. The ABK uses a large diameter annular beam propagated close to the drift tube wall to reduce the plasma density",
        "allowing high efficiency with high beam perveance. This allows the voltage to be less than 120 kV",
        "as required for the ILC. The perveance is similar to that of multiple beam klystrons",
        "but the ABK",
        "with a single beam",
        "is much simpler and is expected to be less expensive than the MBK. The CCR ABK has a calculated efficiency of 67% with a perveance of 3.4. The pulse width and pulse repetition frequency are 1.5 ms and 10 pps",
        "respectively. The ABK has been modeled extensively using multiple codes",
        "including KLSC",
        "TESLA and MAGIC. The mechanical design is complete and assembly of the tube is expected by the fall of 2013. Test results will be reported",
        "as available. Use of the concept for other accelerator requirements will also be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho09.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO09",
      "page_number": "948",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO10",
      "title": "X-Band RF Power Generation via an L-Band Accelerator System and Uses",
      "authors": [
        "N. Sipahi",
        "S. Biedron",
        "S.V. Milton",
        "T. Sipahi",
        "CSU",
        "Fort Collins",
        "Colorado",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The development of compact",
        "cost effective sources of high-energy electron beams is a major thrust of the Colorado State University Accelerator Laboratory team. In this paper we describe a way to generate usable X-Band RF power suitable for powering an X-Band accelerating structure to overall potentials significantly higher than what we are presently able to obtain from our L-Band photocathode RF gun system. The concept relies on the use of the L-band accelerator beam to generate the X-band power that is then delivered to a suitable X-band structure. Once powered this X-band structure can be used to accelerate an electron bunch to high beam energies."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho10.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO10",
      "page_number": "951",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO11",
      "title": "Components of Heating and Fueling of Fusion Plasmas",
      "authors": [
        "J. Kinross-Wright",
        "M.P.J. Gaudreau",
        "F.M. Niell",
        "K. Schrock",
        "B.E. Simpson",
        "Diversified Technologies",
        "Inc.",
        "Bedford",
        "Massachusetts",
        "USA",
        "Next generation fusion facilities will require many megawatts of RF power from dozens of gyrotrons. Each gyrotron requires a power system that must deliver the high-voltage power",
        "modulate cathode voltage",
        "and protect these expensive gyrotrons from arcing damage. It must be highly efficient",
        "to minimize both the power and cooling costs associated with operation and to ensure high facility availability. Diversified Technologies",
        "Inc. (DTI) has bench-tested a table-top scale ‘Buck Matrix’ modulator which uses a single set of IGBT switches for voltage regulation",
        "arc protection",
        "and pulse modulation. Although pulse step modulators represent a one-step solution",
        "their size",
        "and the complexity of their driving transformer make them more expensive than DTI’s two-step approach. DTI’s Buck Matrix modulator",
        "with an efficiency of ~96%",
        "cuts the size of the system in half",
        "using a single layer of solid state switches for both voltage regulation and arc protection/modulation. This cuts the total hardware costs by a~30% or more",
        "and eliminates the need for a separate opening switch or crowbar. DTI will present the system components of the design as well as the performance results to date."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho11.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO11",
      "page_number": "954",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO12",
      "title": "Affordable, Short Pulse Marx Modulator",
      "authors": [
        "R.A. Phillips",
        "M.P.J. Gaudreau",
        "B.E. Simpson",
        "Diversified Technologies",
        "Inc.",
        "Bedford",
        "Massachusetts",
        "USA",
        "Under a U.S. Department of Energy grant",
        "Diversified Technologies",
        "Inc. (DTI) is developing a short pulse",
        "solid-state Marx modulator for the next generation of klystrons and accelerators. For short-pulse modulators",
        "this Marx topology provides a means to achieve astounding risetimes and flattop control that are simply not available with hard switch or transformer coupled topologies. The design is a high peak-power pulse modulator of greater efficiency than presently available",
        "in the 100 kV to 1 MV range",
        "for currents of 0.1 to 1 kA",
        "pulse lengths of 0.2 to 5.0 us",
        "and rise/fall times 10% of pulse length. A key objective of the development effort is a design which is modular and scalable",
        "yet low cost",
        "and easy to manufacture and maintain. The modulator will be delivered to Yale Beam Physics Laboratory for evaluation",
        "and will be affordable for deployment at other national labs for klystron and modulator evaluation. In this paper",
        "DTI will describe the new design and provide an update on progress."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho12.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO12",
      "page_number": "957",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO13",
      "title": "Test of an L-Band Energy-Efficiency Solid State RF Power Source",
      "authors": [
        "X. Chang",
        "N. Barov",
        "D.J. Newsham",
        "D. Wu",
        "Far-Tech",
        "Inc.",
        "San Diego",
        "California",
        "USA",
        "We present the test results of a 1.497 GHz Solid State RF Power Source for the CEBAF linac at Thomas Jefferson National Accelerator Facility. The power amplifier was designed to operate at output power of 6.4 kW",
        "with an overall efficiency greater than 55% at peak power",
        "and is sufficiently compact to fit the existing rack space and cooling requirements at the installation site. Our solid state amplifier is designed for high efficiency",
        "band width of more than ±5MHz at 1.497GHz",
        "and long lifetime. The test results of the whole unit test will be shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho13.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO13",
      "page_number": "960",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO14",
      "title": "System Considerations for 201.25 MHz RF System for LANSCE",
      "authors": [
        "J.T.M. Lyles",
        "W.C. Barkley",
        "J. Davis",
        "A.C. Naranjo",
        "P.D. Olivas",
        "D. Rees",
        "G. M. Sandoval",
        "Jr.",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "D. Baca",
        "R.E. Bratton",
        "R.D. Summers",
        "Compa Industries",
        "Inc.",
        "Los Alamos",
        "USA",
        "The 45-year-old RF system for the LANSCE drift tube linac accelerator is being restored to 12% operating duty factor. It has been operating with reduced power capability since 2006 due to triode limitations",
        "and has impacted the ability to accelerate high average accelerate proton current. Alternatives considered included the development of high power klystrons",
        "solid-state or power grid tube amplifiers. The power grid tube was favored as it had already been demonstrated by the manufacturer and reused much of the existing infrastructure including water systems",
        "coaxial transmission lines",
        "and high voltage power systems. High duty factor tetrodes called Diacrodes® supply the requirements with ample headroom. A new power amplifier system was developed using these devices and has produced 3 MW peak and 300 kW of mean power with > 14 dB of power gain and > 62% efficiency. It has been operating for over five thousand hours into a test load. All ancillary components have been designed",
        "fabricated and tested. The new system is scheduled for installation in early 2014."
      ],
      "institutions": [
        "Funding: Work supported by the United States Department of Energy, National Nuclear Security Agency, under contract DE-AC52-06NA25396."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho14.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO14",
      "page_number": "963",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO15",
      "title": "Modeling of Magnetron Transmitter for the Project X CW 1 GEV Linac",
      "authors": [
        "G.M. Kazakevich",
        "R.P. Johnson",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "B. Chase",
        "R.J. Pasquinelli",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "USA",
        "A 650 MHz 50 kW transmitter with a wide-band control in phase and power",
        "based on injection-locked CW magnetrons",
        "intended to drive individually Superconducting RF (SRF) cavities has been proposed for the Project X CW 1 GeV linac. Utilization of the magnetron RF sources for the intensity-frontier project will save a significant capital cost in comparison with traditional RF sources based on klystrons",
        "Inductive Output Tubes (IOTs)",
        "solid-state amplifiers. The transmitter setup has been modelled experimentally and by simulation using 2.45 GHz CW magnetrons with output power up to 1 kW. The measurements and simulations performed with the injection-locked magnetrons demonstrated capability of the proposed transmitter concept to power individually the superconducting cavities suppressing parasitic modulation of the accelerating field caused by mechanical oscillation (microphonics and oscillations resulted from Lorentz-force)",
        "beam loading",
        "dynamic tuning errors",
        "and other low-frequency disturbances of the magnetron performance. Results of the experimental and theoretical modelling are analysed and discussed in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho15.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO15",
      "page_number": "966",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO16",
      "title": "An Efficient RF Source for JLab",
      "authors": [
        "M.L. Neubauer",
        "A. Dudas",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "R.A. Rimmer",
        "H. Wang",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA"
      ],
      "institutions": [],
      "abstract": "We propose the development of a highly reliable high efficiency RF source for JLAB with a lower lifetime cost operating at 80% efficiency with system operating costs of about 0.7M$/year for the 6 GeV machine. The design of the RF source will be based upon two injection locked magnetrons in a novel combining architecture for amplitude modulation and a cross field amplifier (CFA) as an output tube for the 12 GeV upgrade. A cost analysis including efficiency and reliability will be performed to determine the optimum system architecture. Several different system architectures will be designed and evaluated for a dual injection locked magnetron source using novel combining techniques and possibly a CFA as the output tube. A paper design for the 1497 MHz magnetron system will be completed. The optimum system architecture with all relevant specifications will be completed so that a prototype can be built",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho16.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO16",
      "page_number": "969",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO17",
      "title": "High Power Co-Axial Coupler",
      "authors": [
        "M.L. Neubauer",
        "A. Dudas",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "J. Guo",
        "R.A. Rimmer",
        "R.S. Williams",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "A very high power Coax RF Coupler (MW-Level) is very desirable for a number of accelerator and commercial applications. For example",
        "the development of such a coupler operating at 1.5 GHz may permit the construction of a higher-luminosity version of the Electron-Ion Collider (EIC) being planned at JLab. Muons",
        "Inc. is currently funded by a DOE STTR grant to develop a 1.5-GHz high-power doublewindowcoax coupler with JLab (about 150 kW). Excellent progress has been made on this R&D project",
        "so we propose an extension of this development to build a very high power coax coupler (MW level peak power and a max duty factor of about 4%). The dimensions of the current coax coupler will be scaled up to provide higher power capability."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho17.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO17",
      "page_number": "972",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO18",
      "title": "S-Band Load Design for SLAC",
      "authors": [
        "M.L. Neubauer",
        "A. Dudas",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "S-Band vacuum loads at the SLAC linac are encountering operational problems",
        "now that they have to operate under the stringent requirements of the LCLS: 50 MW peak power",
        "6 kW average power",
        "and extremely tight phase stability for the linac. Failure mechanisms have been studied which suggest an RF surface breakdown of the 200 μm Kanthal layer. We propose a novel solution which incorporates mode conversion from TE10 in rectangular waveguide to TE01 in round waveguide. Lossy material will be placed in the round waveguide",
        "and the selection of the TE01 mode minimizes the electric field normal to the surface of the lossy material. A novel lossy ceramic material and a mechanical system for incorporating it into an S-band dry load were designed and tested. The manufacturing of components with the lossy ceramic material will be studied to find the optimum design for low-cost manufacturing of the complete load."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho18.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO18",
      "page_number": "975",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHO19",
      "title": "High-Power Low-Voltage Multi-Beam Klystrons for ILC and Project-X",
      "authors": [
        "Yale University",
        "Beam Physics Laboratory",
        "New Haven",
        "Connecticut",
        "USA",
        "Yale University",
        "Physics Department",
        "New Haven",
        "CT",
        "USA",
        "Omega-P",
        "Inc.",
        "New Haven",
        "USA",
        "S. Kazakov",
        "N. Solyak",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "USA",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Two conceptual designs of multi-beam klystrons with parameters suitable for ILC and for the 8-GeV pulsed stage of Project X (PX) have been developed. The chief distinction of these tubes from other MBKs is their low operating voltage",
        "namely 60 kV for the ILC tube and 30 kV for the PX tube. Advantages of low voltage include no requirement for pulse transformers or oil-tanks for high-voltage components",
        "and compact modulators. A 6-beamlet quadrant of the ILC tube has been built and is undergoing tests; it is designed to produce 2.5 MW at 1.3 GHz in a 1.6 ms wide pulse at a 10 Hz pulse rate; a four-quadrant future version would produce 10 MW. The 6-beamlet PX tube is to produce 520kW",
        "and would operate in one of two regimes",
        "either at a repetition rate of 2Hz delivering 30 msec pulses",
        "or at a repetition rate of 10Hz delivering 8.5 msec-long pulses. The PX tube is currently undergoing engineering design",
        "with construction scheduled for completion towards the end of 2014."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepho19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepho19.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepho19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPHO19",
      "page_number": "978",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 16,
  "scrape_time": "2025-10-11 01:47:57"
}