{
  "session_info": {
    "id": "MOPOB",
    "name": "MOPOB - Poster Session (MC7)",
    "url": "https://proceedings.jacow.org/napac2016/html/mopob.htm"
  },
  "papers": [
    {
      "paper_id": "MOPOB05",
      "title": "Tokamak Accelerator",
      "authors": [
        "ASIPP",
        "Hefei",
        "People's Republic of China",
        "Tokamak accelerator within plasma is analyzed to be implemented in existing machines for speeding the development of fusion energy with seeding fast particles from high current accelerators - the so-called two-component reactor approach [J. M. Dawson",
        "H. P. Furth",
        "and F. H. Tenney",
        "Phys. Rev. Lett. 26",
        "1156 (1971)]. All plasma particles are heated at the same time by inductively-coupled power transfer (IPT) within an energy confinement time. This could facilitate the attainment of ignition in tokamak by forming high-gain high-field (HGHF) fusion plasma suggested in [Li. G.",
        "Sci. Rep.5",
        "15790 (2015)]. HGHF mechanism is validated by the flux-conserving process existed in discharges of tokamak plasma at normal operation with long pulses or at compression process within an energy confinement time. Differences between HGHF plasma and former unity-beta plasma are discussed. Tokamak as an accelerator could scale down the design capacity of fusion power plant by simply inserting in-vacuum vertical field coils (IVC) within its vacuum vessel",
        "such as China Fusion Engineering Test Reactor (CFETR)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob05.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB05",
      "page_number": "76",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB06",
      "title": "MAX IV and Solaris Linac Magnets Production Series Measurement Results",
      "authors": [
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "NCBJ",
        "Świerk/Otwock",
        "Poland",
        "The linacs of the MAX IV and Solaris synchrotron radiation light sources",
        "currently in operation in Lund",
        "Sweden",
        "and Kraków",
        "Poland",
        "use various conventional magnet designs. The production series of totally more than 100 magnets of more than 10 types or variants",
        "which were all outsourced to industry",
        "with combined orders for the types that are common to both MAX IV and Solaris",
        "were completed in 2013 with mechanical and magnetic QA conforming to specifications. This article presents an overview of the different magnet types installed in these machines",
        "and mechanical and magnetic measurement results of the full production series."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob06.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB06",
      "page_number": "79",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPOB07",
      "title": "Off-Orbit Ray Tracing Analysis for the APS-Upgrade Storage Ring Vacuum System",
      "authors": [
        "J.A. Carter",
        "K.C. Harkay",
        "B.K. Stillwell",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "A MatLab program has been created to investigate off-orbit ray tracing possibilities for the APS-Upgrade stor-age ring vacuum system design. The goals for the pro-gram include calculating worst case thermal loading conditions and finding minimum shielding heights for photon absorbers. The program computes the deviation possibilities of synchrotron radiation rays emitted along bending magnet paths using discretized local phase space ellipses. The sizes of the ellipses are computed based on multi-bend achromat (MBA) lattice parameters and the limiting aperture size within the future storage ring vacuum system. For absorber height calculations",
        "rays are projected from each point in the discretized ellipse to the locations of downstream absorbers. The absorber heights are mini-mized while protecting downstream components from all possible rays. For heat loads",
        "rays are projected until they hit a vacuum chamber wall. The area and linear power densities are calculated based on a ray's distance trav-elled and striking incidence angle. A set of worse case local heat loads is collected revealing a maximum condi-tion that each vacuum component must be designed to withstand."
      ],
      "institutions": [
        "Funding: Argonne National Laboratory's work was supported by the U.S. Department of Energy, Office of Science under contract DE-AC02-06CH11357."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob07.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB07",
      "page_number": "82",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPOB08",
      "title": "Streak Camera Measurements of the APS PC Gun Drive Laser",
      "authors": [
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "We report recent pulse-duration measurements of the APS PC Gun drive laser at both second harmonic (SH",
        "527 nm) and fourth harmonic (FH. 263 nm) wavelengths. The drive laser is a Nd:Glass-based CPA with the IR wavelength (1053 nm) twice doubled to obtain UV output for the gun. A Hamamatsu C5680 streak camera and an M5675 synchroscan unit are used for these measurements; the synchroscan unit is tuned to 119 MHz",
        "the 24th subharmonic of the linac operating frequency. Calibration is accomplished both electronically and optically. Electronic calibration utilizes a programmable delay line in the 119 MHz rf path. The optical delay employs an etalon with known spacing between reflecting surfaces; this etalon is coated for the visible",
        "SH wavelength. IR pulse duration is monitored with an autocorrelator. Fitting the streak camera image projected profiles with Gaussians",
        "UV rms pulse durations are found to vary from 2.1 ps to 3.5 ps as the IR varies from 2.2 ps to 5.2 ps."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob08.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB08",
      "page_number": "85",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB10",
      "title": "Design of the HGVPU Undulator Vacuum Chamber for LCLS-II",
      "authors": [
        "J.E. Lerch",
        "J.A. Carter",
        "P.K. Den Hartog",
        "G.E. Wiemerslage",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "A vacuum chamber has been designed and prototyped for the new Horizontal Gap Vertically Polarization Undulator (HGVPU) as part of the LCLS-II upgrade project. Numerous functional requirements for the HGVPU assembly constrained the vacuum chamber design. These constraints included spatial restrictions to achieve small magnet gaps",
        "narrow temperature and alignment specifications",
        "and minimization of wall erosion and pressure drop within the cooling channels. This led to the design of a 3.5-meter length",
        "thin walled",
        "extruded aluminium chamber with interior water cooling. FEA stress analysis was performed to ensure the chamber will not fail under vacuum and water pressure. A cooling scheme was optimized to ensure water flow is sufficient to maintain temperature without the risk of erosion and to minimize pres-sure drop across the chamber."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob10.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB10",
      "page_number": "89",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPOB11",
      "title": "Research and Development on the Storage Ring Vacuum System for the APS Upgrade Project",
      "authors": [
        "B.K. Stillwell",
        "B. Brajuskovic",
        "J.A. Carter",
        "H. Cease",
        "R.M. Lill",
        "G. Navrotski",
        "J. R. Noonan",
        "K.J. Suthar",
        "D.R. Walters",
        "G.E. Wiemerslage",
        "J. Zientek",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "A number of research and development activities are underway at Argonne National Laboratory to build confidence in the designs for the storage ring vacuum system required for the Advanced Photon Source Upgrade project (APS-U) [1]. The predominant technical risks are: excessive residual gas pressures during operation",
        "insufficient beam position monitor stability",
        "excessive beam impedance",
        "excessive heating by induced electrical surface currents",
        "and insufficient operational reliability. Present efforts to mitigate these risks include: building and evaluating mock-up assemblies",
        "performing mechanical testing of chamber weld joints",
        "developing computational tools",
        "investigating design alternatives",
        "and performing electrical bench measurements. Status of these activities and some of what has been learned to date will be shared.",
        "*B. Stillwell et al.",
        "Conceptual Design of a Storage Ring Vacuum System Compatible with Implementation of a Seven Bend Achromat Lattice at the APS",
        "in Proc. IPAC'14",
        "Dresden",
        "Germany",
        "2409-2411."
      ],
      "institutions": [
        "Funding: UChicago Argonne, LLC, operator of Argonne National Laboratory, a U.S. Department of Energy Office of Science laboratory, is operated under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob11.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB11",
      "page_number": "92",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB12",
      "title": "A High Bandwidth Bipolar Power Supply for the Fast Correctors in the APS Upgrade",
      "authors": [
        "J. Wang",
        "G.S. Sprau",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The APS Upgrade of a multi-bend achromat (MBA) storage ring requires a fast bipolar power supply for the fast correction magnets. The key performance requirement of the power supply includes a small-signal bandwidth of 10 kHz for the output current. This requirement presents a challenge to the design because of the high inductance of the magnet load and a limited input DC voltage. A prototype DC/DC power supply utilizing a MOSFET H-bridge circuit with a 500 kHz PWM has been developed and tested successfully. The prototype achieved a 10-kHz bandwidth with less than 3-dB attenuation for a signal 0.5% of the maximum operating current of 15 amperes. This paper presents the design of the power circuit",
        "the PWM method",
        "the control loop",
        "and the test results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob12.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB12",
      "page_number": "96",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB13",
      "title": "Post Irradiation Examination Results of the NT-02 Graphite Fins Numi Target",
      "authors": [
        "K. Ammigan",
        "P. Hurh",
        "V.I. Sidorov",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "D. Asner",
        "A.M. Casella",
        "D.J. Edwards",
        "A.L. Schemer-Kohrn",
        "D.J. Senor",
        "PNNL",
        "Richland",
        "Washington",
        "USA",
        "The NT-02 neutrino target in the NuMI beamline at Fermilab is a 95 cm long target made up of segmented graphite fins. It is the longest running NuMI target",
        "which operated with a 120 GeV proton beam with maximum power of 340 kW",
        "and saw an integrated total proton on target of 6.1 x 1020. Over the last half of its life",
        "gradual degradation of neutrino yield was observed until the target was replaced. The probable causes for the target performance degradation are attributed to radiation damage",
        "possibly including cracking caused by reduction in thermal shock resistance",
        "as well as potential localized oxidation in the heated region of the target. Understanding the long-term structural response of target materials exposed to proton irradiation is critical as future proton accelerator sources are becoming increasingly more powerful. As a result",
        "an autopsy of the target was carried out to facilitate post-irradiation examination of selected graphite fins. Advanced microstructural imaging and surface elemental analysis techniques were used to characterize the condition of the fins in an effort to identify degradation mechanisms",
        "and the relevant findings are presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob13.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB13",
      "page_number": "99",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB14",
      "title": "Experimental Results of Beryllium Exposed to Intense High Energy Proton Beam Pulses",
      "authors": [
        "K. Ammigan",
        "B.D. Hartsell",
        "P. Hurh",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "M.E.J. Butcher",
        "M. Calviani",
        "M. Guinchard",
        "R. Losito",
        "CERN",
        "Geneva",
        "Switzerland",
        "O. Caretta",
        "T.R. Davenne",
        "C.J. Densham",
        "M.D. Fitton",
        "P. Loveridge",
        "J. O'Dell",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "V.I. Kuksenko",
        "S.G. Roberts",
        "University of Oxford",
        "Oxford",
        "United Kingdom",
        "CCFE",
        "Abingdon",
        "Oxon",
        "United Kingdom",
        "Beryllium is extensively used in various accelerator beam lines and target facilities as material for beam windows",
        "and to a lesser extent",
        "as secondary particle production targets. With increasing beam intensities of future accelerator facilities",
        "it is critical to understand the response of beryllium under extreme conditions to reliably operate these components as well as avoid compromising particle production efficiency by limiting beam parameters. As a result",
        "an exploratory experiment at CERN's HiRadMat facility was carried out to take advantage of the test facility's tunable high intensity proton beam to probe and investigate the damage mechanisms of several beryllium grades. The test matrix consisted of multiple arrays of thin discs of varying thicknesses as well as cylinders",
        "each exposed to increasing beam intensities. This paper outlines the experimental measurements",
        "as well as findings from Post-Irradiation-Examination (PIE) work where different imaging techniques were used to analyze and compare surface evolution and microstructural response of the test matrix specimens."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob14.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB14",
      "page_number": "102",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB16",
      "title": "Higher Order Modes Analysis of Fermilab's Recycler Cavity",
      "authors": [
        "M.H. Awida",
        "J.E. Dey",
        "T.N. Khabiboulline",
        "V.A. Lebedev",
        "R.L. Madrak",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Two recycler cavities are being employed in Fermilab's Recycler Ring for the purpose of slip stacking proton bunches",
        "where 6 batches of 8 GeV protons coming from the Booster are stacked on top of 6 circulating batches. Slip stacking requires two RF cavities operating at 52.809 and 51.545 MHz. In this paper",
        "we report on the analysis of higher order modes in the Recycler cavity",
        "presenting the values for R/Q and shunt impedances. Knowing the frequencies and properties of higher order modes is particularly critical for beam physics and avoidance of beam instabilities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob16.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB16",
      "page_number": "106",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB17",
      "title": "Resonant Frequency Control for the PIP-II Injector Test RFQ: Control Framework and Initial Results",
      "authors": [
        "A.L. Edelen",
        "S. Biedron",
        "S.V. Milton",
        "CSU",
        "Fort Collins",
        "Colorado",
        "USA",
        "D.L. Bowringpresenter",
        "B.E. Chase",
        "J.P. Edelen",
        "D.J. Nicklaus",
        "J. Steimel",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "For the PIP-II Injector Test (PI-Test) at Fermilab",
        "a four-vane radio frequency quadrupole (RFQ) is designed to accelerate a 30-keV",
        "1-mA to 10-mA H' beam to 2.1 MeV under both pulsed and continuous wave (CW) RF operation. The available headroom of the RF amplifiers limit the maximum allowable detuning to 3 kHz",
        "and the detuning is controlled entirely via thermal regulation. Fine control over the detuning",
        "minimal manual intervention",
        "and fast trip recovery is desired. In addition",
        "having active control over both the walls and vanes provides a wider tuning range. For this",
        "we intend to use model predictive control (MPC). To facilitate these objectives",
        "we developed a dedicated control framework that handles higher-level system decisions as well as executes control calculations. It is written in Python in a modular fashion for easy adjustments",
        "readability",
        "and portability. Here we describe the framework and present the first control results for the PI-Test RFQ under pulsed and CW operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob17.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB17",
      "page_number": "109",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB20",
      "title": "Enhancement of the Accelerating Gradient in Superconducting Microwave Resonators",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob20.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB20",
      "page_number": "113",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB23",
      "title": "The Radiation Damage In Accelerator Target Environments (RaDIATE) Collaboration R&D Program - Status and Future Activities",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The RaDIATE collaboration (Radiation Damage In Accelerator Target Environments)",
        "founded in 2012",
        "has grown to over 50 participants and 11 institutions globally. The primary objective is to harness existing expertise in nuclear materials and accelerator targets to generate new and useful materials data for application within the accelerator and fission/fusion communities. Current activities include post-irradiation examination of materials taken from existing beamlines (such as the NuMI primary beam window from Fermilab) as well as new irradiations of candidate target materials at low energy and high energy beam facilities. In addition",
        "the program includes thermal shock experiments utilizing high intensity proton beam pulses available at the HiRadMat facility at CERN. Status of current RaDIATE activities as well as future plans will be discussed",
        "including special focus on the upcoming RaDIATE irradiation at the Brookhaven Linac Isotope Producer facility (BLIP) in which multiple materials of interest (e.g. beryllium",
        "graphite",
        "silicon",
        "titanium",
        "iridium) will simultaneously be exposed to 120 - 181 MeV proton beam to relevant radiation damage levels."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob23.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB23",
      "page_number": "117",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB24",
      "title": "Design of Main Coupler for 650 MHz SC Cavities of PIP-II Project",
      "authors": [
        "O.V. Pronitchev",
        "S. Kazakov",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "Proton Improvement Plan-II at Fermilab has designed an 800MeV superconducting pulsed linac which is also capable of running in CW mode. The high energy section from 185MeV to 800MeV will be using cryomodules with two types of 650MHz elliptical cavities. Both types of cryomodules will include six 5-cell elliptical cavities. Each cavity will have one coupler. Updated design of the 650 MHz main coupler is reported.",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob24.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB24",
      "page_number": "121",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPOB25",
      "title": "The Use of KF Style Flanges in Low Particlulate Applications",
      "authors": [
        "K.R. Kendziora",
        "J.J. Angelo",
        "C.M. Baffes",
        "D. Franck",
        "R.J. Kellett",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "As SCRF particle accelerator technology advances the need for 'low particulate' and 'particle free' vacuum systems becomes greater and greater. In the course of the operation of these systems, there comes a time when vari-ous instruments have to be temporarily attached for diag-nostic purposes: RGAs, leak detectors, and additional pumps. In an effort to make the additions of these instru-ments easier and more time effective, we propose to use KF style flanges for these types of temporary diagnostic connections. This document will describe the tests used to compare the particles generated using the assembly of the, widely accepted for 'particle free' use, conflat flange to the proposed KF style flange, and demonstrate that KF flanges produce less particles. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob25.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB25",
      "page_number": "124",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB27",
      "title": "Superconducting Coil Winding Machine Control System",
      "authors": [
        "J.M. Nogiec",
        "S. Kotelnikov",
        "A. Makulski",
        "K. Trombly-Freytag",
        "D.G.C. Walbridgepresenter",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Spirex magnet coil winder has been equipped with an automation system",
        "which allows operation from both a computer and a remote control unit. This machine is about 6m long with a bridge that moves along a track and supports a rotating boom holding a spool of cable and providing cable tension. The machine control system is distributed between three layers: PC",
        "RTOS",
        "and FPGA providing respectively HMI",
        "operational logic and controls. The PC stores the history of operation",
        "shows the machine positions",
        "status",
        "and their history. Keeping cable tension constant is non-trivial in situations where the length of the cable changes with varying speeds. This has been addressed by a PID controller with feed forward augmentation and low-pass filters. Another challenging problem",
        "synchronizing multiple servo motors",
        "has been solved by designing an innovative decentralized algorithm. Extra attention was given to the safety aspects; a fail-safe",
        "redundant safety system with interlocks has been developed",
        "including protection for the operator and the superconducting cable against such situations as accidental over tension",
        "or fast movement of the cable due to operational errors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob27.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB27",
      "page_number": "127",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPOB28",
      "title": "Progress on the Design of a Perpendicularly Biased 2nd Harmonic Cavity for the Fermilab Booster",
      "authors": [
        "R.L. Madrak",
        "J.E. Dey",
        "K.L. Duel",
        "J. Kuharik",
        "W. Pellico",
        "J. Reid",
        "G.V. Romanov",
        "M. Slabaugh",
        "D. Sun",
        "C.-Y. Tan",
        "I. Terechkine",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "A perpendicular biased 2nd harmonic cavity is being designed and built for the Fermilab Booster. Its purpose is to flatten the bucket at injection and thus change the longitudinal beam distribution to decrease space charge effects. It can also help with transition crossing. The cavity frequency range is 76 - 106 MHz. It is modeled using CST microwave studio and COMSOL. The power amplifier will use the same tetrode as is used for the fundamental mode cavities in the Fermilab Booster (Y567B). We discuss recent progress on the cavity design",
        "plans for testing the tuner's garnet material",
        "and tests of the power source."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob28.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB28",
      "page_number": "130",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB29",
      "title": "Measurements of the Properties of Garnet Material for Tuning a 2nd Harmonic Cavity for the Fermilab Booster",
      "authors": [
        "R.L. Madrak",
        "W. Pellico",
        "G.V. Romanov",
        "C.-Y. Tan",
        "I. Terechkine",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "A perpendicular biased 2nd harmonic cavity is being designed and built for the Fermilab Booster",
        "to help with injection and transition. The frequency range is 76 - 106 MHz. The garnet material chosen for the tuner is AL800. To reliably model the cavity",
        "its static permeability and loss tangent must be well known. We present our measurements of these properties."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob29.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB29",
      "page_number": "134",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB30",
      "title": "Development and Comparison of Mechanical Structures for FNAL 15 T Nb3Sn Dipole Demonstrator",
      "authors": [
        "A.V. Zlobin",
        "I. Novitskipresenter",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Main design challenges for 15 T accelerator magnets are large Lorentz forces at this field level. The large Lorentz forces generate high stresses in the coil and mechanical structure and",
        "thus",
        "need stress control to maintain them at the acceptable level for brittle Nb3Sn coils and other elements of magnet mechanical structure. To provide these conditions and achieve the design field in the FNAL 15 T dipole demonstrator",
        "several mechanical structures have been developed and analysed. The possibilities and limitations of these designs are discussed in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob30.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB30",
      "page_number": "137",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB32",
      "title": "Design and Test of the Prototype Tuner for 3.9 GHz SRF Cavity for LCLS II Project",
      "authors": [
        "Y.M. Pischalnikov",
        "E. Borissov",
        "J.C. Yun",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Fermilab is responsible for the design of the 3.9GHz cryomodule for the LCLS-II that will operate in continuous wave (CW) mode. Bandwidth of the SRF cavities will be in the range of the 180Hz. In our tuner design",
        "we adopted as the slow tuner-mechanism slim blade tuner originated by INFN for the European XFEL 3.9GHz. At the same time bandwidth of the SRF cavities for LCLS II will be in the range of the 180Hz and fine/fast tuning of the cavity frequency required. We added to the design fast/fine tuner made with 2 encapsulated piezos. First prototype tuner has been built and went through testing at warm conditions. Details of the design and summary of the tests will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob32.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB32",
      "page_number": "140",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB33",
      "title": "LCLS-II Tuner Assembly for the Prototype Cryomodule at FNAL",
      "authors": [
        "Y.M. Pischalnikov",
        "E. Borissov",
        "T.N. Khabiboulline",
        "J.C. Yun",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The tuner design for LCLS-II has been thoroughly verified and fabricated for used in the LCLS-II prototype modules. This paper will present the lessons learned during the installation of these tuners for the prototype modules at FNAL",
        "including installation procedures",
        "best practices",
        "and challenges encountered."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob33.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB33",
      "page_number": "143",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB35",
      "title": "Design of the LBNF Beamline Target Station",
      "authors": [
        "S. Tariq",
        "K. Ammigan",
        "K. Anderson",
        "S.A. Buccellato",
        "C.F. Crowley",
        "B.D. Hartsell",
        "P. Hurh",
        "J. Hylen",
        "P.H. Kasper",
        "G.E. Krafczyk",
        "A. Lee",
        "B.G. Lundberg",
        "A. Marchionni",
        "N.V. Mokhov",
        "C.D. Moore",
        "V. Papadimitriou",
        "D. Pushkapresenter",
        "I.L. Rakhno",
        "S.D. Reitzner",
        "V.I. Sidorov",
        "A.M. Stefanik",
        "I.S. Tropin",
        "K. Vaziri",
        "K.E. Williams",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The Long Baseline Neutrino Facility (LBNF) project will build a beamline located at Fermilab to create and aim an intense neutrino beam of appropriate energy range toward the DUNE detectors at the SURF facility in Lead",
        "South Dakota. Neutrino production starts in the Target Station",
        "which consists of a solid target",
        "magnetic focusing horns",
        "and the associated sub-systems and shielding infrastructure. Protons hit the target producing mesons which are then focused by the horns into a helium-filled decay pipe where they decay into muons and neutrinos. The target and horns are encased in actively cooled steel and concrete shielding in a chamber called the target chase. The reference design chase is filled with air",
        "but nitrogen and helium are being evaluated as alternatives. A replaceable beam window separates the decay pipe from the target chase. The facility is designed for initial operation at 1.2 MW",
        "with the ability to upgrade to 2.4 MW",
        "and is taking advantage of the experience gained by operating Fermilab's NuMI facility. We discuss here the design status",
        "associated challenges",
        "and ongoing R&D and physics-driven component optimization of the Target Station."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob35.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB35",
      "page_number": "146",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB36",
      "title": "Design of the High Beta 650 MHz Cryomodule - PIP II",
      "authors": [
        "V. Roger",
        "T.H. Nicol",
        "Y.O. Orlov",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "In this paper the design of the high beta 650 MHz cryomodule will be presented. This cryomodule is composed of six 5-cell 650 MHz elliptical cavities",
        "designed for β=0.92. These cryomodules are the last elements of the Super Conducting (SC) linac architecture which is the main component of the Proton Improvement Plan-II (PIP-II) at Fermilab. This paper summarizes the design choices which have been done. Mechanical",
        "thermal and cryogenic analyses have been performed to ensure the proper operation. First the concept of having a strong-back at room temperature has been validated. Then the heat loads have been estimated and all the components have been integrated inside the cryomodule by designing the supports",
        "the beam line",
        "the thermal shield and the cryogenic lines. All these elements and the calculations leading to the design of this cryomodule will be described in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob36.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB36",
      "page_number": "149",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB39",
      "title": "A 600 Volt Multi-Stage, High Repetition Rate GaN FET Switch",
      "authors": [
        "G.W. Saewert",
        "D. Frolov",
        "H. Pfeffer",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Using recently available GaN FETs",
        "a 600 Volt three-stage",
        "multi-FET switch has been developed having 2 nanosecond rise time driving a 200 Ω load with the potential of approaching 30 MHz average switching rates. Possible applications include driving particle beam choppers kicking bunch-by-bunch and beam deflectors where the rise time needs to be custom tailored. This paper reports on the engineering issues addressed",
        "the design approach taken and some performance results of this switch."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob39_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob39.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob39_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB39",
      "page_number": "152",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB40",
      "title": "Quench Training Analysis of Nb3Sn Accelerator Magnets",
      "authors": [
        "S. Stoynev",
        "K.H. Riemer",
        "A.V. Zlobin",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Nb3Sn accelerator magnet technology has made significant progress during the past decades. Thanks to that 11-12 T Nb3Sn dipoles and quadrupoles are planned to be used in accelerators such as LHC in near future for the luminosity upgrade and in longer term for the LHC energy upgrade or a future Very High Energy pp Collider. However",
        "all the state of the art Nb3Sn accelerator magnets show quite long training. This specific feature significantly raises the required design margin or limit the nominal operation field of Nb3Sn accelerator magnets and",
        "thus",
        "increases their cost. To resolve this problem Fermilab has launched a study aiming to analyze the relatively large amount of Nb3Sn magnet training data accumulated at Fermilab magnet test facility. The ultimate goal is to correlate magnet design and manufacturing features and magnet material properties with training performance parameters which will eventually allow us to optimize both the magnet design",
        "fabrication and the training processes. This paper describes the general strategy of the analysis and presents the first results based on partial data processing. Conclusions and further steps are also outlined and discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob40_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob40.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob40_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB40",
      "page_number": "155",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB41",
      "title": "Field Quality Measurements in the FNAL Twin-Aperture 11 T Dipole for LHC Upgrades",
      "authors": [
        "T. Strauss",
        "G. Apollinari",
        "E.Z. Barzi",
        "G. Chlachidze",
        "J. DiMarco",
        "A. Nobrega",
        "I. Novitski",
        "S. Stoynev",
        "D. Turrioni",
        "G. Velev",
        "A.V. Zlobinpresenter",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "B. Auchmann",
        "S. Izquierdo Bermudez",
        "M. Karppinen",
        "L. Rossi",
        "F. Savary",
        "D. Smekens",
        "CERN",
        "Geneva",
        "Switzerland",
        "FNAL and CERN magnet groups are developing a twin-aperture Nb3Sn 11 T dipole suitable for installation in the LHC to provide room for additional collimators in the dispersion suppressor (DS) areas. Two of these magnets with a collimator in between will replace one regular MB dipole. A single-aperture 2-m long dipole demonstrator and two 1-m long dipole models have been assembled and tested at FNAL in 2012-2014. The 1 m long collared coils were then assembled into the twin-aperture configuration and tested in 2015. The first magnet test was focused on the quench performance of twin-aperture magnet configuration including magnet training",
        "ramp rate sensitivity and temperature dependence of magnet quench current. In the second test performed in July 2016 field quality in one of the two magnet apertures has been measured and compared with the data for the single-aperture models. These results are reported and discussed in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob41_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob41.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob41_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB41",
      "page_number": "158",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB44",
      "title": "Thyratron Replacement",
      "authors": [
        "I. Roth",
        "M.P.J. Gaudreau",
        "M.K. Kempkes",
        "M.G. Mundervillepresenter",
        "R.E. Simpson",
        "Diversified Technologies",
        "Inc.",
        "Bedford",
        "Massachusetts",
        "USA",
        "Semiconductor thyristors have long been used as a replacement for thyratrons in low power or long pulse RF systems. To date",
        "however",
        "such thyristor assemblies have not demonstrated the reliability needed for installation in short pulse",
        "high peak power RF stations used with many pulsed electron accelerators. The fast rising current in a thyristor tends to be carried in a small region",
        "rather than across the whole device",
        "and this localized current concentration can cause a short circuit failure. An alternate solid-state device",
        "the insulated-gate bipolar transistor (IGBT)",
        "can readily operate at the speed needed for the accelerator",
        "but commercial IGBTs cannot handle the voltage and current required. It is",
        "however",
        "possible to assemble these devices in arrays to reach the required performance levels without sacrificing their inherent speed. Diversified Technologies",
        "Inc. (DTI) has patented and refined the technology required to build these arrays of series-parallel connected switches. DTI is currently developing an affordable",
        "reliable",
        "form-fit-function replacement for the klystron modulator thyratrons at SLAC capable of pulsing at 360 kV",
        "420 A",
        "6μs",
        "and 120 Hz."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob44_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob44.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob44_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB44",
      "page_number": "162",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB46",
      "title": "Long Pulse Solid-State Pulsed Power Systems Built to ESS Specifications",
      "authors": [
        "I. Roth",
        "M.P.J. Gaudreau",
        "M.K. Kempkespresenter",
        "M.G. Munderville",
        "R.E. Simpson",
        "Diversified Technologies",
        "Inc.",
        "Bedford",
        "Massachusetts",
        "USA",
        "Sigma Phi Electronics",
        "Wissembourg",
        "France",
        "Sigmaphi",
        "Vannes",
        "France",
        "Diversified Technologies",
        "Inc. (DTI)",
        "in partnership with SigmaPhi Electronics (SPE) has built three long pulse solid-state klystron transmitters to meet spallation source requirements. Two of the three units are installed at CEA Saclay and the National Institute of Nuclear and Particle Physics (IN2P3)",
        "where they will be used as test stands for the European Spallation Source (ESS). The systems delivered to CEA and IN2P3 demonstrate that the ESS klystron modulator specifications (115 kV",
        "25 A per klystron",
        "3.5 ms",
        "14 Hz) have been achieved in a reliable",
        "manufacturable",
        "and cost-effective design. There are only minor modifications required to support transition of this design to the full ESS Accelerator",
        "with up to 100 klystrons. The systems will accommodate the recently-determined increase in average power (~660 kW)",
        "can offer flicker-free operation",
        "are equally-capable of driving Klystrons or MBIOTs",
        "and are designed for an expected MTBCF of over ten years",
        "based on operational experience with similar systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob46_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob46.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob46_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB46",
      "page_number": "165",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB47",
      "title": "Beam Coupling Impedance Characterization of Third Harmonic Cavity for ALS Upgrade",
      "authors": [
        "T.H. Luo",
        "K.M. Baptiste",
        "M. Betz",
        "J.M. Byrd",
        "S. De Santis",
        "S. Kwiatkowski",
        "S. Persichelli",
        "Y. Yangpresenter",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The ALS upgrade to a diffraction-limited light source (ALS-U) depends on the ability to lengthen the stored bunches to limit the emittance growth and increase the beam life time. In order to achieve lengthening in excess of fourfold necessary to this end",
        "we are investigating the use of the same passive 1.5 GHz normal-conducting RF cavities currently used on the ALS. While the upgraded ring RF parameters and fill pattern make it easier as long as the beam-induced phase transient is concerned",
        "the large lengthening factor and the strongly non-linear lattice require particular attention to the cavities contribution to the machine overall impedance budget. In this paper we present our estimates of the narrow-band impedance obtained by numerical simulation and bench measurements of the cavities' resonant modes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob47_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob47.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob47_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB47",
      "page_number": "167",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB49",
      "title": "Persistent Current Effects in RHIC Arc Dipole Magnets Operated at Low Currents",
      "authors": [
        "X. Wang",
        "S. Caspipresenter",
        "S.A. Gourlay",
        "G.L. Sabbi",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "A.K. Ghosh",
        "R.C. Gupta",
        "A.K. Jain",
        "P. Wanderer",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob49_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob49.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob49_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB49",
      "page_number": "170",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB51",
      "title": "High-Efficiency 500-W RF-Power Modules for UHF",
      "authors": [
        "Green Mountain Radio Research",
        "Boone",
        "USA",
        "GMRR has developed solid-state RF-power modules that deliver up to 650 W at frequencies from 325 to 704 MHz. The nominal output of 500 W is delivered with an overall efficiency from 79% at 704 MHz to 83% percent at 325 MHz. In contrast to conventional solid-state power amplifiers",
        "high efficiency is maintained over a wide range of output powers; e.g.",
        "70 percent or better for outputs of 30 W or higher. Each 500-W module contains five 120-W RF power amplifiers (PAs) and a Gysel* splitter and combiner. The class-F** PAs employ GaN FETs and produce over 120 W with efficiencies from 82-86%. A class-S modulator maintains high efficiency over nearly the entire range of amplitudes. Supporting hardware includes a control computer",
        "DSP",
        "low-level RF amplifiers",
        "and drivers. The 500-W modules are intended to be building blocks of a multi-kW RF power source. A system based these modules will consume 1/3 to 1/2 of the prime power required by a system based upon klystrons or conventional solid-state amplifiers and will have significantly lower cooling requirements.",
        "* U. H. Gysel",
        "Int. Microwave Symp. Digest",
        "May 12 - 14",
        "1975.  ** F. H. Raab et al.",
        "IEEE Trans. Microwave Theory Tech.",
        "March 2002."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob51_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob51.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob51_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB51",
      "page_number": "174",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB52",
      "title": "Dielectric Loaded High Pressure Gas Filled RF Cavities for Use in Muon Cooling Channels",
      "authors": [
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "M. Backfish",
        "D.L. Bowring",
        "A. Moretti",
        "D.W. Peterson",
        "A.V. Tollestrup",
        "K. Yonehara",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "University of Chicago",
        "Chicago",
        "Illinois",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "High brightness muon beams require significant six dimensional cooling. One cooling scheme",
        "the Helical Cooling Channel",
        "employs high pressure gas filled radio frequency cavities",
        "which provide both the absorber needed for ionization cooling",
        "and a means to mitigate RF breakdown. The cavities are placed along the beam's trajectory",
        "and contained within the bores of superconducting solenoid magnets. Gas filled RF cavities have been shown to successfully operate within multi-Tesla external magnetic fields",
        "and not be overcome with the loading resulting from beam-induced plasma. The remaining engineering hurdle is to find a way to fit 325 and 650 MHz single cell pillbox cavities within the bores of the magnets using modern technology. One method to accomplish this is to partially fill the cavities with a dielectric material. Alumina (Al2O3) is an ideal dielectric",
        "and the experimental test program to determine its performance under high power in a gas filled cavity has concluded. The final results",
        "and their implications for the design of a muon cooling channel based on gas filled RF cavities will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob52_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob52.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob52_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB52",
      "page_number": "177",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB53",
      "title": "Simulation of Ping-Pong Multipactor with Continuous Electron Seeding",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob53_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob53.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob53_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB53",
      "page_number": "181",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB54",
      "title": "Superferric Arc Dipoles for the Ion Ring and Booster of JLEIC",
      "authors": [
        "P.M. McIntyre",
        "J. Breitschopfpresenter",
        "T. Elliott",
        "R. Garrison",
        "J. Gerity",
        "J.N. Kellams",
        "A. Sattarov",
        "Texas A&M University",
        "College Station",
        "USA",
        "DCI-UG",
        "León",
        "Mexico",
        "The JLEIC project requires 3 T superferric dipoles and quadrupoles for the half-cell arcs of its Ion Ring and Booster. A superferric design using NbTi cable-in-conduit conductor is being developed. A mockup winding has been completed",
        "with the objectives to develop and evaluate the coil structure and the winding tooling and methods",
        "and to measure errors in the position of each cable turn in the dipole body. The results of the mockup winding study are presented. The CIC design is now ready for construction and testing of a first model dipole."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob54_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob54.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob54_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB54",
      "page_number": "184",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPOB55",
      "title": "Room Temperature Magnets in FRIB Driver Linac",
      "authors": [
        "Y. Yamazaki",
        "N.K. Bultman",
        "E.E. Burkhardt",
        "F. Feyzi",
        "K. Holland",
        "A. Hussain",
        "M. Ikegami",
        "F. Marti",
        "S.J. Miller",
        "T. Russo",
        "J. Wei",
        "Q. Zhao",
        "FRIB",
        "East Lansing",
        "USA",
        "W.J. Yang",
        "Q.G. Yao",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "The FRIB Driver Linac* is to accelerate all the stable ions beyond 200 MeV/nucleon with a beam power of 400 kW. The linac is unique",
        "being compactly folded twice. In this report",
        "the room temperature magnets",
        "amounting 147 in total",
        "after Front End with a 0.5-MeV RFQ",
        "are detailed",
        "emphasizing the rotating coil field measurements and fiducialization.",
        "*E. Pozdeyev et al.",
        "\"Status of FRIB\" in this conference. T. Xu",
        "\"Superconducting Cryomodule Development and Production for the FRIB Linac\" in this conference."
      ],
      "institutions": [
        "Funding: Work supported by the U.S. Department of Energy Office of Science under Cooperative Agreement DE-SC0000661 and the National Science Foundation under Cooperative Agreement PHY-1102511."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob55_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob55.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob55_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB55",
      "page_number": "188",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB56",
      "title": "Frequency Domain Simulations of Rf Cavity Structures and Coupler Designs for Co-Linear X-Band Energy Booster (CXEB) with ACE3P",
      "authors": [
        "T. Sipahi",
        "S. Biedron",
        "S.V. Milton",
        "CSU",
        "Fort Collins",
        "Colorado",
        "USA",
        "Due to their higher intrinsic shunt impedance X-band accelerating structures offer significant gradients with relatively modest input powers",
        "and this can lead to more compact light sources. At the Colorado State University Accelerator Laboratory (CSUAL) we would like to adapt this technology to our 1.3-GHz",
        "L-band accelerator system using a passively driven 11.7 GHz traveling wave X-band configuration that capitalizes on the high shunt impedances achievable in X-band accelerating structures in order to increase our overall beam energy in a manner that does not require investment in an expensive",
        "custom",
        "high-power X-band klystron system. Here we provide the frequency domain simulation results using the ACE3P Electromagnetic Suite's"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob56_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob56.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob56_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB56",
      "page_number": "191",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB57",
      "title": "Wakefield Excitation in Power Extraction Cavity of Co-Linear X-Band Energy Booster in Time Domain With ACE3P",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob57_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob57.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob57_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB57",
      "page_number": "195",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB58",
      "title": "Eddy Current Calculations for a 1.495 GHz Injection-Locked Magnetron",
      "authors": [
        "S.A. Kahn",
        "A. Dudas",
        "R.P. Johnson",
        "M.L. Neubauer",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "An injection-locked amplitude modulated magnetron is being developed as a reliable",
        "efficient RF source that could replace klystrons used in particle accelerators. The magnetron amplitude is modulated using a trim magnetic coil to alter the magnetic field in conjunction with the anode voltage to suppress the emittance growth due to microphonics and changing beam loads. The rate for microphonic noise can have frequencies in the range 10-50 Hz. This is competitive to the inductive decay time of the trim coil. Eddy currents will be induced in the copper anode of the magnetron that will buck the field from the trim coil in the interaction region. This paper will describe the magnetic circuit of the proposed magnetron as well as the calculation and handling of the Eddy currents on the magnetic field."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob58_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob58.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob58_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB58",
      "page_number": "198",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB59",
      "title": "Magnet Design for the Splitter/Combiner Regions of CBETA, the Cornell-Brookhaven Energy-Recovery-Linac Test Accelerator",
      "authors": [
        "J.A. Crittenden",
        "D.C. Burke",
        "Y.L.P. Fuentes",
        "C.E. Mayes",
        "K.W. Smolenski",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The Cornell-Brookhaven Energy-Recovery-Linac Test Accelerator (CBETA) will provide a 150-MeV electron beam using four acceleration and four deceleration passes through the Cornell Main Linac Cryomodule housing six 1.3-GHz superconducting RF cavities. The return path of this 76-m-circumference accelerator will be provided by 106 fixed-field alternating-gradient (FFAG) cells which carry the four beams of 42",
        "78",
        "114 and 150-MeV. Here we describe magnet designs for the splitter and combiner regions which serve to match the on-axis linac beam to the off-axis beams in the FFAG cells",
        "providing the path-length adjustment necessary to energy recovery for each of the four beams. The path lengths of the four beamlines in each of the splitter and combiner regions are designed to be adapted to 1-",
        "2-",
        "3-",
        "and 4-pass staged operations. Design specifications and modeling for the 24 dipole and 32 quadrupole electromagnets in each region are presented. The CBETA project will serve as the first demonstration of multi-pass energy recovery using superconducting RF cavities with FFAG cell optics for the return loop."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob59_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob59.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob59_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB59",
      "page_number": "201",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPOB60",
      "title": "Performance of the Cornell Main Linac Prototype Cryomodule for the CBETA Project",
      "authors": [
        "F. Furuta",
        "N. Banerjee",
        "J. Dobbins",
        "R.G. Eichhorn",
        "M. Gepresenter",
        "D. Gonnella",
        "G.H. Hoffstaetter",
        "M. Liepe",
        "T.I. O'Connell",
        "P. Quigley",
        "D.M. Sabol",
        "J. Sears",
        "E.N. Smith",
        "V. Veshcherevich",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The main linac prototype cryomodule (MLC) is a key component for the Cornell-BNL ERL Test Accelerator (CBETA)",
        "which is a 4-turn FFAG ERL under construction at Cornell University. The MLC has been designed for high current and efficient continuous wave (CW) SRF cavity operation",
        "and houses six high Q0 7-cell SRF cavities with individual beamline higher order-modes (HOMs) absorbers for strong HOM suppression in high beam current operation. Cavities have achieved specification values of 16.2MV/m with high Q0 of 2.0·1010 at 1.8K in CW operation after cooldown optimizations and RF processing. Damping of the HOMs has been measured in detail",
        "indicating that the loaded quality-factors of all critical modes are low enough to avoid BBU in high current",
        "multi-turn ERL operation. Microphonics measurements have been carried out as well",
        "and vibration sources have been determined and eliminated. Here we report on these cryomodule performance studies."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob60_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob60.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob60_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB60",
      "page_number": "204",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPOB61",
      "title": "Updates of Vertical Electropolishing Studies at Cornell with KEK and Marui Galvanizing Co. Ltd  .",
      "authors": [
        "F. Furuta",
        "M. Gepresenter",
        "T. Gruber",
        "J.J. Kaufman",
        "M. Liepe",
        "J. Sears",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "V. Chouhan",
        "Y.I. Ida",
        "K.N. Nii",
        "T.Y. Yamaguchi",
        "MGH",
        "Hyogo-ken",
        "Japan",
        "H. Hayano",
        "S. Kato",
        "T. Saeki",
        "KEK",
        "Ibaraki",
        "Japan",
        "Cornell",
        "KEK",
        "and Marui Galvanizing Co. Ltd (MGI) have started new Vertical Electro-Polishing (VEP) R&D collaboration in 2014. MGI and KEK has developed their original VEP cathode named 'i-cathode Ninja'® which has four retractable wing-shape parts per cell for single-/9-cell cavities. One single cell cavity had processed with VEP using i-cathode Ninja at Cornell. Cornell also performed the vertical test on that cavity. We will present the details of process and RF test result at Cornell."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob61_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob61.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob61_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB61",
      "page_number": "208",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPOB62",
      "title": "SRF Half Wave Resonator Activities at Cornell for the RAON Project",
      "authors": [
        "M. Ge",
        "F. Furuta",
        "T. Gruber",
        "S.W. Hartman",
        "C. Henderson",
        "M. Liepe",
        "S. Lok",
        "T.I. O'Connell",
        "P.J. Pamel",
        "J. Sears",
        "V. Veshcherevich",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "J. Joo",
        "J.-W. Kim",
        "W.K. Kim",
        "J. Lee",
        "I. Shin",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "The RAON heavy-ion accelerator requires ninety-eight 162.5MHz Half-Wave-Resonators (HWR) with a geometrical β=0.12. Cornell University will test a prototype HWR as well as develop a frequency tuner for this cavity. In this paper we report on the progress in designing",
        "fabricating",
        "and commissioning of new HWR preparation and testing infrastructure at Cornell. The HWR infrastructure work includes new input and pick-up couplers",
        "a modified vertical test insert with a 162.5MHz RF system",
        "a new High-Pressure-Water-Rinsing (HPR) setup",
        "and a modified chemical etching system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob62_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob62.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob62_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB62",
      "page_number": "211",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB63",
      "title": "Impact of Cooldown Procedure and Ambient Magnetic Field on the Quality Factor of State-of-the-Art Nb3Sn Single-Cell ILC Cavities",
      "authors": [
        "D.L. Hall",
        "M. Gepresenter",
        "J.J. Kaufman",
        "M. Liepe",
        "R.D. Porter",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Single-cell Nb3Sn cavities coated at Cornell University have demonstrated quality factors of 1010 at 16 MV/m and 4.2 K in vertical tests",
        "achieving the performance requirements of contemporary modern accelerator designs. In this paper",
        "we present results demonstrating the impact of the cooldown procedure and ambient magnetic fields on the cavity's ability to achieve these quality factors and accelerating gradients. The impact of the magnetic fields from thermoelectric currents",
        "generated by thermal gradients across the cavity during cooldown",
        "are shown to be equivalent to the impact of magnetic fields trapped from ambient sources. Furthermore",
        "the increase in the residual surface resistance due to trapped magnetic flux",
        "from both ambient sources and thermoelectric currents",
        "is found to be a function of the applied RF magnetic field amplitude. A hypothesis for this observation is given",
        "and conclusions are drawn regarding the demands on the cooldown procedure and ambient magnetic fields necessary to achieve quality factors of 1010 at 4.2 K and 16 MV/m or higher."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob63_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob63.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob63_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB63",
      "page_number": "215",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB65",
      "title": "Investigation of the Origin of the Anti-Q-Slope",
      "authors": [
        "J.T. Maniscalco",
        "M. Gepresenter",
        "D. Gonnella",
        "M. Liepe",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The surface resistance of a superconductor",
        "a property very relevant to SRF accelerators",
        "has long been known to depend on the strength of the surface magnetic field. A recent discovery showed that",
        "for certain surface treatments",
        "microwave cavities can be shown to have an inverse field dependence",
        "dubbed the ‘‘anti-Q-slope''",
        "in which the surface resistance decreases over an increasing field. Here we present an investigation into what causes the anti-Q-slope in nitrogen-doped niobium cavities",
        "drawing a direct connection between the electron mean free path of the SRF material and the magnitude of the anti-Q-slope. Further",
        "we incorporate residual resistance due to flux trapping to calculate an optimal mean free path for a given trapped flux."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob65_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob65.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob65_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB65",
      "page_number": "218",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB68",
      "title": "A New Method for Grain Texture Manipulation in Post-Deposition Niobium Films",
      "authors": [
        "J. Musson",
        "K. Macha",
        "H.L. Phillips",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "W. Cao",
        "H. Elsayed-Ali",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "Niobium films are frequently grown using forms of energetic condensation",
        "with modest substrate temperatures to control grain structure. As an alternative",
        "energetic deposition onto a cold substrate results in a dense amorphous film",
        "with a much larger energy density than the re-crystallized state. Re-crystallization is then performed using a pulsed UV (HIPPO) laser",
        "with minimal damage to the substrate. In addition",
        "a graded interface between the substrate and Nb film is created during the early stages of energetic deposition. Experimental approach and apparatus are described."
      ],
      "institutions": [
        "Funding: Notice: Authored by Jefferson Science Associates, LLC under U.S. DOE Contract No. DE-AC05-06OR23177. Old Dominion University"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob68_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob68.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob68_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB68",
      "page_number": "221",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB69",
      "title": "Wire Stretching Technique for Measuring RF Crabbing/Deflecting Cavity Electrical Center and a Demonstration Experiment on Its Accuracy",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The fabrication accuracy of a superconducting RF crab cavity for the Large Hadron Collider High Luminosity Upgrade and the future Electron Ion Collider requires the cavity's electric center line relative to the crabbing plane within sub mm offset and sub degree in rotation. It is very hard for the cavity's niobium sheet formation",
        "high temperature bake and chemistry processes and finally cooling down in cryomodule to satisfy such tight tolerance. A new wire stretching technique combining with the RF measurement in the deflecting modes has been demonstrated on the bench to detect less than 10um resolution on the RF signal when the wire is moving away from the ideal electric center line. The foundation of this technique and its difference from the use in other applications will be reviewed. Based on this principle",
        "the possible implementations for detecting RF leakage to the higher older mode couplers",
        "cavity string alignment and cryomodule assembly will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob69_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob69.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob69_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB69",
      "page_number": "225",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB71",
      "title": "Consideration on Determination of Coupling Factors of Waveguide Iris Couplers",
      "authors": [
        "S.W. Lee",
        "M.S. Champion",
        "Y.W. Kang",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Waveguide iris couplers are frequently used to power accelerating cavities in low beta sections of ion accelerators. In ORNL Spallation Neutron Source (SNS)",
        "six drift tube linac (DTL) cavity structures have been operating. An iris input coupler with a tapered ridge waveguide and a waveguide ceramic disk window feeds each cavity. The original couplers and cavities have been in service for more than a decade. Since all DTL cavity structures are fully utilized for neutron production",
        "none of the cavity structures is available as a test cavity or a spare. Maintaining spares of the iris couplers for operations and future system upgrade without using the full DTL structure",
        "a test setup for precision tuning is needed. A smaller single-cell cavity may be used for pretuning of the coupling irises as the test cavity and high power RF conditioning of the iris couplers as the bridge waveguide. In this paper",
        "study of using a single-cell cavity for the iris tuning and the conditioning is presented with 3D simulations. A single-cell test cavity has been built and used for low power bench measurement with the iris couplers to demonstrate the approach."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob71_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob71.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob71_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB71",
      "page_number": "229",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB72",
      "title": "Update on CW 8 kW 1.5 GHz Klystron Replacement",
      "authors": [
        "A.V. Smirnov",
        "S. Boucher",
        "RadiaBeam Systems",
        "Santa Monica",
        "California",
        "USA",
        "R.B. Agustsson",
        "D.I. Gavryushkin",
        "J.J. Hartzell",
        "K.J. Hoyt",
        "A.Y. Murokh",
        "T.J. Villabona",
        "RadiaBeam",
        "Santa Monica",
        "California",
        "USA",
        "G.R. Branner",
        "K.S. Yuk",
        "UC Davis",
        "Davis",
        "USA",
        "Sierra Nevada Corporation",
        "Irvine",
        "USA",
        "JLAB upgrade program requires a ~8 kW",
        "1497 MHz amplifier operating at more than 55-60% efficiency",
        "and 8 kW CW power to replace up to 340 klystrons. One of possibilities for the klystron replacement is usage of high electron mobility packaged GaN transistors applied in array of highly efficient amplifiers using precise in-phase",
        "low-loss combiners-dividers. Design features and challenges related to amplifier modules and radial multi-way dividers/combiners are discussed including HFSS simulations and measurements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob72_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob72.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob72_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB72",
      "page_number": "232",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPOB76",
      "title": "Field Emission Dark Current Simulation for eRHIC ERL Cavities",
      "authors": [
        "C. Xu",
        "I. Ben-Zvi",
        "Y. Hao",
        "V. Ptitsyn",
        "K.S. Smith",
        "B. P. Xiao",
        "W. Xu",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The eRHIC project will be a electron and proton collider proposed in BNL. These high repetition rates will require Super-Conducting Radio-Frequency cavities with fundamental frequency of 650MHZ for high current applications. Each with a string of two of those cavities. The strong electromagnetic fields in the SRF cavities will extract electrons from the cavity walls and will accelerate those. Most dark current will be deposited locally",
        "although some electrons may reach several neighbour cyromodules",
        "thereby gaining substantial energy before they hit a collimator or other aperture. Simulation of these effects is therefore crucial for the design of the machine. Track3P code was used to simulate field-emission electrons from different SRF cavities setup to optimize the field emission dark current characterizes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob76_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob76.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob76_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB76",
      "page_number": "235",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB80",
      "title": "MAX IV and Solaris 1.5 GeV Storage Rings Magnet Block Production Series Measurement Results",
      "authors": [
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "Solaris National Synchrotron Radiation Centre",
        "Jagiellonian University",
        "Kraków",
        "Poland",
        "NCBJ",
        "Świerk/Otwock",
        "Poland",
        "The magnet design of the MAX IV and Solaris 1.5 GeV storage rings replaces the conventional support girder + discrete magnets scheme of previous third-generation synchrotron radiation light sources with an integrated design having several consecutive magnet elements precision-machined out of a common solid iron block",
        "with mechanical tolerances of ±0.02 mm over the 4.5 m block length. The production series of 12+12 integrated magnet block units",
        "which was totally outsourced to industry",
        "was completed in the spring of 2015",
        "with mechanical and magnetic QA conforming to specifications. This article presents mechanical and magnetic field measurement results of the full production series."
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob80_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob80.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob80_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB80",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPOB81",
      "title": "Deposition of Non-Evaporative Getters R&D Activity for HEPS-TF",
      "authors": [
        "P. He",
        "D.Z. Guo",
        "B. Liu",
        "Y. Ma",
        "Y.C. Yang",
        "L. Zhang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Non Evaporable Getter(NEG) coating technology was widely used around the world's ultra-low emittance storage rings. It will provide the distributed pumping which is the obvious solution to solve the conductance limitation of narrow vacuum chamber at small magnet aperture. The HEPS-TF is the R&D project of HEPS (High Energy Photon Source)",
        "it will cover all of the key technology for HEPS accelerator system and beamlines. In order to meet the small aperture vacuum chamber distributed pumping requirement",
        "the NEG coating R&D for HEPS vacuum chamber is under the way. Getter films deposited on the inner surface of the chamber would transform the vacuum chamber from an outgassing source into a pump. The coating test bench will be shown here and coating procedure will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/mopob81_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/mopob81.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/mopob81_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-MOPOB81",
      "page_number": "238",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 51,
  "scrape_time": "2025-10-11 01:13:28"
}