{
  "session_info": {
    "id": "TUBA",
    "name": "TUBA - Precision Mechanics",
    "url": "https://proceedings.jacow.org/medsi2016/html/tuba.htm"
  },
  "papers": [
    {
      "paper_id": "TUBA01",
      "title": "The Design of a Precision Mechanical Assembly for a Hard X-ray Polarizer",
      "authors": [
        "S.P. Kearney",
        "D. Shu",
        "T.S. Toellner",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Hard x-ray polarisers are commonly applied in synchrotron radiation research to produce photons in a pure polarization state",
        "and as polarization filters to analyse the photon’s polarization state after their interaction with a sample medium. We present the design of a mechanical assembly suitable for a hard X-ray polariser that requires multiple degrees of freedom with the base stage capable of handling at least 2-3 kg loads. The intermediary stages (roll",
        "yaw",
        "and translation directions) consist of commercially available tip/tilt and translational stages (Kohzu Precision Co.",
        "LTD). However",
        "the requirements of the pitch stage are much more demanding and require a custom-designed flexure-based rotation stage. The design and analysis of this flexure-based rotation stage will be discussed in this study. This will include FEA analysis of the dynamic response and rotation range capabilities which will then be compared to mechanical performance test results using laser interferometers and accelerometer sensors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tuba01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tuba01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tuba01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUBA01",
      "page_number": "116",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBA02",
      "title": "The New ID11 Nanoscope End-Station - A Nano-Tomography Scanner",
      "authors": [
        "L. Ducotté",
        "J.M. Clement",
        "H. Gleyzolle",
        "J. Wright",
        "ESRF",
        "Grenoble",
        "France",
        "The Nanoscope end-station is currently commissioned at beamline ID11. This end-station is designed for nano-focusing applications and dedicated to diffraction and microscopy experiments using nano diffraction tomography techniques",
        "with a 100 nm size X-ray beam. The distinctive characteristic of this end-station is the integration of commercial nano-positioning stages on top of a high precision air-bearing rotary stage for continuous rotation scans with infinite rotation. For this purpose",
        "a customised electrical slip-ring has been integrated in such a way as to maintain the intrinsic guiding performances of the main rotation stage",
        "i.e. axial and radial errors < 20nm. This slip-ring is designed to carry signals from capacitive probes",
        "encoders",
        "piezo actuators",
        "and is coupled to a rotary joint for vacuum. Another key component is a high precision linear stage for scanning the sample across the beam by moving the rotation axis with a resolution and repeatability < 10nm at the sample position and over a stroke of 10 mm. It has been designed",
        "assembled and characterised at ESRF. The critical design aspects of this end-station and the metrology characterisations will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tuba02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tuba02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tuba02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUBA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUBA03",
      "title": "The Generic Mirror Chamber for the European XFEL",
      "authors": [
        "BESSY GmbH",
        "Berlin",
        "Germany",
        "H. Sinn",
        "A. Trapp",
        "XFEL. EU",
        "Hamburg",
        "Germany",
        "For the high demanding requirements of the beam-lines of the European XFEL [*] new mirror chambers were developed",
        "designed and tested. A prototype contains the main features of all needed ten units which are tested extensively. The concept of the mirror chamber is a further development of our Cartesian parallel kinematics for X-ray optics in the UHV [**]. The stiffness and vibration behaviour were further improved and the position resolution was increased compared to earlier implementations at Bessy and Flash. For that the drives were redesigned and now feature a stroke of 100 mm with nanometer resolution."
      ],
      "institutions": [],
      "abstract": "* H. Sinn, TDR: X-Ray Optics and Beam Transport, December 2012, XFEL. EU TR-2012-006 doi:10.3204 ** T. Noll, Parallel kinematics for nanoscale Car-tesian motions, Precision Engineering Vol.33/3 Pg.291",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tuba03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tuba03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tuba03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUBA03",
      "page_number": "121",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBA04",
      "title": "Mechanical Design and Development of Compact Linear Nanopositioning Flexure Stages with Centimeter-Level Travel Range and Nanometer-Level Resolution",
      "authors": [
        "D. Shu",
        "J.W.J. Anton",
        "S.P. Kearney",
        "B. Lai",
        "W. Liu",
        "J. Maser",
        "C. Roehrig",
        "J.Z. Tischler",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "University of Illinois at Chicago",
        "Chicago",
        "USA",
        "Nanopositioning techniques present an important capability to support the state-of-the-art synchrotron radiation instrumentation research for the APS operations and upgrade project. To overcome the performance limitations of precision ball-bearing-based or roller-bearing-based linear stage systems",
        "two compact linear nanopositiioning flexure stages have been designed and developed at the APS with centimeter-level travel range and nanometer-level resolution for x-ray experimental applications. The APS T8-54 linear flexure stage is designed to perform a precision wire scan as a differential aperture for the 3-D diffraction microscope at the APS sector 34",
        "and the APS T8-56 linear flexure stage is designed for a horizontal sample scanning stage for a hard x-ray microscope at the APS sector 2. Both linear flexure stages are using a similar improved deformation compensated linear guiding mechanism which was developed initially at the APS for the T8-52 flexural linear stage *. The mechanical design and finite element analyses of the APS T8-54 and T8-56 flexural stages",
        "as well as its initial mechanical test results with laser interferometer are described in this paper.",
        "* U.S. Patent granted No. 8",
        "957",
        "567",
        "D. Shu",
        "S. Kearney",
        "and C. Preissner",
        "2015."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tuba04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tuba04.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tuba04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUBA04",
      "page_number": "124",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 23:54:57"
}