{
  "session_info": {
    "id": "THOA",
    "name": "THOA - Overview and Commissioning 2 & Machine Parameter Measurements",
    "url": "https://proceedings.jacow.org/ibic2021/html/thoa.htm"
  },
  "papers": [
    {
      "paper_id": "THOA01",
      "title": "Commissioning and Performance of Beam Diagnostics in the FACET-II Beam Spectrometer",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The FACET-II facility has begun beam delivery to the experimental user area and the suite of instrumentation in the spectrometer beamline following the experimental area is currently being commissioned. The performance of these diagnostics systems will be described",
        "including the single shot \"butterfly\" emittance diagnostic that will be key to demonstrating emittance preservation of mm-mrad emittances in plasma wakefield acceleration experiments. Additionally",
        "the gamma ray diagnostics will be discussed that will be used to assess the beam dynamics of low emittance beams in plasmas and to characterize beam-plasma filamentation instabilities.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted! reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/thoa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/thoa01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/thoa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-THOA01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THOA02",
      "title": "Non-Invasive Machine Parameters Measurement in a Storage Ring Based on Bunch-by-Bunch 3d Position Data Correlation Analysis",
      "authors": [
        "X.Y. Xu",
        "Y.B. Leng",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "University of Chinese Academy of Sciences",
        "Beijing",
        "People’s Republic of China",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "In order to improve machine performance",
        "the machine parameters of the storage ring (including optics parameters and insert devices parameters",
        "etc.) need to be accurately measured. It is difficult to measure them with traditional methods during the user operation run. The behaviour of each bunch in the ring will not be exactly the same",
        "but has its own personality (different transverse positions",
        "longitudinal phases and different bunch charges). If the bunch-by-bunch 3D position can be accurately measured",
        "every individual bunch can be used as probes to extract the dynamics parameters of the storage ring. Based on a broadband oscilloscope with a high sampling rate",
        "a bunch-by-bunch three-dimensional parameter measurement system was built at the Shanghai synchrotron radiation facility(SSRF). The measurement uncertainty of longitudinal phase is less than 0.2 ps",
        "the uncertainty of transverse position is less than 10 um and the charge uncertainty is 0.3% under the condition that the bunch charge is 600 pC. A general software package was developed to process the bunch signals and extract bunch parameters. The functions of this software package mainly include three-dimensional position",
        "charge extraction",
        "refilled charge signal stripping",
        "and cable reflection signal stripping. Using this software package",
        "the injection transient process was studied and the momentum contraction factor",
        "dispersion function",
        "and longitudinal damping oscillation parameters measurement were realized during the normal operation at SSRF. Because the software package does not require special acquisition equipment and does not have strict requirements on the state of the accelerator",
        "the software package can be widely used in the bunch-by-bunch measurement of all ring accelerators."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/thoa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/thoa02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/thoa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-THOA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THOA03",
      "title": "Progress Towards Machine Learning-Based Real-Time Non-Destructive Prediction of the Longitudinal Phase Space Evolution in a Particle Accelerator",
      "authors": [
        "C. Emma",
        "O.R. Convery",
        "A.L. Edelen",
        "M.J. Hogan",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "We discuss progress towards the implementation of machine learning based real-time prediction of the Longitudinal Phase Space (LPS) evolution in a particle accelerator*. This work focuses specifically on the implementation of three separate longitudinal phase space virtual diagnostics at the FACET-II accelerator facility: one at the exit of the photoinjector",
        "one after the second bunch compressor and one and the end of the linac before the experimental area. We present simulation results describing the simultaneous prediction of the LPS in a single-bunch and two-bunch mode of operation and discuss design choices for the machine learning architecture selected for the LPS prediction task**. Finally we discuss initial experimental deployment of the virtual diagnostics in regular accelerator operations.",
        "*C. Emma et al.",
        "Phys. Rev. Accel. Beams 21",
        "112802 2018 **C. Emma et al.",
        "IBIC 2018"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/thoa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/thoa03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/thoa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-THOA03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:41:38"
}