{
  "session_info": {
    "id": "TUCASH",
    "name": "TUCASH - High intensity cyclic and linear accelerators",
    "url": "https://proceedings.jacow.org/rupac2016/html/tucash.htm"
  },
  "papers": [
    {
      "paper_id": "TUCASH01",
      "title": "Low-Beta High Gradient S-Band Accelerating Structure for Hadron Therapy Linacs",
      "authors": [
        "MEPhI",
        "Moscow",
        "Russia",
        "L. Faillace",
        "S.V. Kutsaev",
        "RadiaBeam",
        "Marina del Rey",
        "California",
        "USA",
        "B. Mustapha",
        "A. Nassiri",
        "P.N. Ostroumov",
        "A.S. Plastun",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "RadiaBeam Technologies",
        "in collaboration with Argonne National Laboratory",
        "are developing low-beta S-band accelerating structures capable to operate at ~50 MV/m accelerating gradients. These structures are designed to provide very high energy gain both in proton and carbon ion linac in the velocity range above β=v/c=0.3. The structures have been optimized to operate below the known breakdown and structural limits supporting the required accelerating gradient with 500 ns flat-top RF pulses. The detailed RF design of the accelerating structures with β = 0.3 and 0.43 is presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/tucash01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/tucash01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/tucash01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-TUCASH01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUCASH02",
      "title": "Commissioning and First Tests of the New Standing Wave 10 Mev Electron Accelerator",
      "authors": [
        "S.M. Polozov",
        "D.B. Bazyl",
        "T.V. Bondarenko",
        "M. Gusarova",
        "Yu.D. Kliuchevskaia",
        "M.V. Lalayan",
        "V.I. Rashchikov",
        "E.A. Savin",
        "MEPhI",
        "Moscow",
        "Russia",
        "M.I. Demskypresenter",
        "A.A. Eliseev",
        "V.V. Krotov",
        "D.E. Trifonov",
        "CORAD Ltd.",
        "St. Petersburg",
        "Russia",
        "A new linear electron accelerator for industrial applications was developed by the joint team of CORAD and MEPhI. It is based on conventional biperiodical accelerating structure for energy range from 7.5 to 10 MeV and beam power up to 20 kW. The use of modern methods and codes for beam dynamics simulation",
        "raised coupling coefficient and group velocity of SW biperiodic accelerating structure allowed to reach high pulse power utilization and obtain high efficiency. The first two accelerators with the new structure have been installed and tested."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/tucash02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/tucash02.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/tucash02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-TUCASH02",
      "page_number": "173",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCASH03",
      "title": "High Efficiency Stripping Extraction on 80 MeV H-minus Isochronous Cyclotron in PNPI",
      "authors": [
        "S.A. Artamonov",
        "A.N. Chernov",
        "E.M. Ivanov",
        "G.A. Riabovpresenter",
        "V.A. Tonkikh",
        "PNPI",
        "Gatchina",
        "Leningrad District",
        "Russia",
        "H-minus cyclotron has the advantage that high intensity internal beam can be extracted from the acceleration chamber with practically 100% efficiency by transformation H-minus ions into H-plus ion by using thin foil. The extraction system is consists from the probe with stripping foil",
        "extraction window in the vacuum chamber and two correct magnets to match the extracted beam with beam transport line. The beam optics calculations in the measured magnetic field make it possible to find optimal relative position of the extraction system elements as well the parameters of the extracted beam with energy 40 - 80 MeV. At present time the beam is extracted from the chamber with efficiency 100 % and there is good agreement with the optic calculations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/tucash03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/tucash03.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/tucash03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-TUCASH03",
      "page_number": "176",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCASH04",
      "title": "Physical Start-up of the C-80 Isochronous Cyclotron",
      "authors": [
        "Yu.N. Gavrish",
        "A.V. Galchuck",
        "S.V. Grigorenko",
        "A.N. Kuzhlev",
        "V.G. Mudrolyubov",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "D.A. Amerkanov",
        "S.A. Artamonov",
        "E.M. Ivanov",
        "G.A. Riabov",
        "V.I. Yurchenko",
        "PNPI",
        "Gatchina",
        "Leningrad District",
        "Russia",
        "Works on the creation of a cyclotron for the acceleration of H− ions at energies ranging from 40 up to 80 MeV have been carried out over a number of years in PNPI",
        "the National Research Centre Kurchatov Institute. The cyclotron is intended for production of a wide assortment of radioisotopes for medicine including radiation generators (Sr-Rb",
        "Ge-Ga)",
        "proton therapy of ophthalmic diseases",
        "tests of radioelectronic components for radiation resistance",
        "studies in the field of nuclear physics and radiation material science. In June",
        "2016 physical start-up of the cyclotron was realized in the pulsed mode; the beam of ~10 mkA was obtained at the inner probe",
        "the extracted beam at the first diagnostic device was ~8 mkA and ~7.5 mkA at the final diagnostic device of the beamline. In the near future we plan to obtain the design intensity of 100 mkA."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/tucash04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/tucash04.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/tucash04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-TUCASH04",
      "page_number": "179",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCASH05",
      "title": "The CC1-3 Cyclotron System. Installation and Test Results",
      "authors": [
        "V.G. Mudrolyubov",
        "A.V. Antonov",
        "M.A. Emeljanov",
        "A.V. Galchuck",
        "Yu.N. Gavrish",
        "S.V. Grigorenko",
        "V.I. Grigoriev",
        "L.E. Korolev",
        "M.T. Kozienko",
        "A.N. Kuzhlev",
        "A.G. Miroshnichenko",
        "G.V. Muraviov",
        "V.I. Nikishkin",
        "V.I. Ponomarenko",
        "K.E. Smirnov",
        "Yu.I. Stogov",
        "A.P. Strokach",
        "S.S. Tsygankov",
        "O.L. Veresov",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "A unique CC1-3 cyclotron system has been installed in the Vinca Institute of Nuclear Sciences",
        "Belgrade",
        "Serbia to be used in the laboratory of nuclear-physical methods of the elemental analysis A compact cyclotron and a beam shaping system ensure an accelerated proton beam in a wide range of energies from 1 to 3 MeV with a spectrum width not more than 0.1%. Tests of the cyclotron system have been carried out at proton energies of 1.0",
        "1.7 and 3 MeV with the beam transport to the final diagnostic device."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/tucash05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/tucash05.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/tucash05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-TUCASH05",
      "page_number": "182",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCASH06",
      "title": "Progress in CW Mode Electron Resonance Accelerator BETA-8 Development",
      "authors": [
        "VNIIEF",
        "Sarov",
        "Russia",
        "This paper presents the status of powerful linear electron accelerator BETA-8 development. The accelerator is operating in CW mode and used for ionizing radiation research. The basic constituent of accelerator is coaxial half-wave resonator excited on T1 wave. Required electron beam energy is attained by multiple passing through central transversal plane of resonator. Electron beam iterative passing is realized by turning magnets located on resonator outwalls. The main parameters of the accelerator are: beam output energy 1.5 - 7.5 MeV",
        "average power up to 300 kW",
        "operating frequency 100 MHz. By now the main components of facility",
        "namely",
        "coaxial resonator",
        "three HF generator units each with output power 180 kW",
        "HF power summation device",
        "the unit of power input (UPI) designed to transfer HF signal of 600 kW have been designed and manufactured. Electron beam transport system project consisting of up to five full sequential passes through accelerating resonator has been developed. Turning electromagnets have been designed and manufactured. HF parameters measurements for coaxial resonator assembled with UPI have been realized at low HF power level. All HF generator units and HF power summation devices have been tested. HF electron injector has been designed",
        "manufactured and tested. The accelerator testing is supposed to be carried out in one HF generator unit supply mode."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/tucash06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/tucash06.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/tucash06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-TUCASH06",
      "page_number": "185",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCASH07",
      "title": "HF Structure of BETA-8 Electron Resonance Accelerator",
      "authors": [
        "VNIIEF",
        "Sarov",
        "Russia",
        "BETA-8 is new powerful resonance electron accelerator designed in RFNC-VNIIEF to operate in continuous wave generating regime. The basic constituent of accelerator is half-wave coaxial resonator excited at T1 wave. The work presents the main approaches to numerical modeling of accelerator HF power system components. The results of computation of accelerating resonator with operating frequency of 100 MHz and inductive unit of HF power input (UPI) designed to transmit continuous HF signal at operating frequency with mean power level of 600 kW are reported. The transmitting coaxial waveguide connecting UPI with feeding HF generator has been computed",
        "designed and manufactured. The calculated results have been tested by measurements of HF parameters of the resonator assembled with UPI and connecting waveguide. The possibility to locate indicating loop (a detector working in frequency feedback circuit of feeding HF generator) in transmitting feeder has been demonstrated. The method of calibration computation of measuring inductive loop that is an element of amplitude feedback circuit of HF generator is presented. The dual matched load necessary for preliminary adjustment of operating modes of feeding HF generator unit (with mean power up to 180 kW) and technological systems of accelerating complex has been computed",
        "designed and put into operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/tucash07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/tucash07.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/tucash07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-TUCASH07",
      "page_number": "188",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 7,
  "scrape_time": "2025-10-11 02:42:37"
}