{
  "session_info": {
    "id": "MOPA",
    "name": "MOPA - Poster Session",
    "url": "https://proceedings.jacow.org/napac2022/html/mopa.htm"
  },
  "papers": [
    {
      "paper_id": "MOPA01",
      "title": "Realistic CAD-Based Geometries for Arbitrary Magnets with Beam Delivery Simulation (BDSIM)",
      "authors": [
        "E. Ramoisiaux",
        "R. Dantinne",
        "E. Gnacadja",
        "C. Hernalsteens",
        "S. Musibau",
        "B. Ndihokubwayo",
        "N. Pauly",
        "R. Tesse",
        "M. Vanwelde",
        "ULB",
        "Bruxelles",
        "Belgium",
        "S.T. Boogert",
        "L.J. Nevay",
        "W. Shields",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "CERN",
        "Meyrin",
        "Switzerland",
        "Monte Carlo simulations are required to evaluate beam losses and secondary radiation accurately in particle accelerators and beamlines. Detailed CAD geometries are critical to account for a realistic distribution of material masses but increase the model complexity and often lead to code duplication. Beam Delivery Simulation (BDSIM) and the Python package pyg4ometry enable handling such accelerator models within a single",
        "simplified workflow to run complete simulations of primary and secondary particle tracking and interactions with matter using Geant4 routines. Additional capabilities have been developed to model arbitrary bent magnets by associating externally modeled geometries to the magnet poles",
        "yoke",
        "and beampipe. Individual field descriptions can be associated with the yoke and vacuum pipe separately to provide fine-grained control of the magnet model. The implementation of these new features is described in detail and applied to the modeling of the CERN Proton Synchrotron (PS) combined function magnets."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa01.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA01",
      "page_number": "55",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA02",
      "title": "Activation of the IBA Proteus One Proton Therapy Beamline Using BDSIM and FISPACT-II",
      "authors": [
        "E. Ramoisiaux",
        "E. Gnacadja",
        "C. Hernalsteens",
        "N. Pauly",
        "R. Tesse",
        "M. Vanwelde",
        "ULB",
        "Bruxelles",
        "Belgium",
        "CERN",
        "Meyrin",
        "Switzerland",
        "Cyclotron-based proton therapy systems generate large fluxes of secondary particles due to the beam interactions with the beamline elements",
        "with the energy degrader being the dominant source. Compact systems exacerbate these challenges for concrete shielding and beamline element activation. Our implementation of the Rigorous Two-Step method uses Beam Delivery Simulation (BDSIM)",
        "a Geant4-based particle tracking code",
        "for primary and secondary particles transport and fluence scoring",
        "and FISPACT-II for time-dependent nuclear inventory and solving the rate equations. This approach is applied to the Ion Beam Applications (IBA) Proteus®ONE (P1) system",
        "for which a complete model has been built",
        "validated",
        "and used for shielding activation simulations. We detail the first simulations of the activation on quadrupole magnets in high-fluence locations downstream of the degrader. Results show the evolution of the long-lived nuclide concentrations for short and long timescales throughout the facility lifetime for a typical operation scenario."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa02.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA02",
      "page_number": "59",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA08",
      "title": "Beamline Optimization Methods for High Intensity Muon Beams at PSI",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "We perform beamline design optimization for the High Intensity Muon Beams (HIMB) project at the Paul Scherrer Institute (PSI)",
        "which will deliver muon beams at the unprecedented rate of 1·1010 muons/s to next-generation intensity frontier particle physics and material science experiments. For optimization of the design and operational parameters to maximize the beamline transmission",
        "we use the asynchronous Bayesian optimization package DeepHyper and a custom build of G4beamline with variance reduction and measured cross sections. We minimize the beam spot size at the final foci using a COSY INFINITY model with differential-algebraic system knobs",
        "where we minimize the respective transfer map elements using the Levenberg-Marquardt and simulated annealing optimizers. We obtained a transmission of 1.34·1010 muons/s in a G4beamline model of HIMB’s MUH2 beamline into the experimental area."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa08.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA08",
      "page_number": "63",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA09",
      "title": "Design of a 4D Emittance Diagnostic for Low-Energy Ion Beams",
      "authors": [
        "T.R. Curtin",
        "M.S. Curtin",
        "Ion Linac Systems",
        "Inc.",
        "Albuquerque",
        "USA",
        "Characterization of ion beams from an ion injector consisting of an electron-cyclotron-resonance (ECR) source in combination with a low-energy-beam-transport (LEBT) typically exhibits a complex four-dimensional transverse phase-space distribution. The importance of measuring the ion beam correlations following extraction and transport of the low-energy beam is critical to enabling optimization of beam transmission through downstream accelerating structures. A design for a transverse",
        "four-dimensional emittance meter for low-energy protons from the Ion Linac Systems (ILS) ECR-LEBT ion injector is provided."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa09.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA09",
      "page_number": "67",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA12",
      "title": "Commissioning of HOM Detectors in the First Cryomodule of the LCLS-II Linac",
      "authors": [
        "UNM-ECE",
        "Albuquerque",
        "USA",
        "B.T. Jacobson",
        "N.R. Neveu",
        "J.P. Sikora",
        "SLAC",
        "Menlo Park",
        "California",
        "USA"
      ],
      "institutions": [
        "Long-range wakefields (LRWs) may cause emittance dilution effects. LWRs are especially unwanted at facilities with low emittance beams like the LCLS-II at SLAC. Dipolar higher-order modes (HOMs) are a set of LRWs that are excited by off-axis beams. Two 4-channel HOM detectors were built to measure the beam-induced HOM signals for TESLA-type superconducting RF (SRF) cavities; they were tested at the Fermilab Accelerator Science and Technology (FAST) facility and are now installed at SLAC. The HOM detectors were designed to investigate LRW effects on the beam and to help with beam alignment. This paper presents preliminary results of HOM measurements at the first cryomodule (CM01) of the LCLS-II linac and describes the relevant hardware and setup of the experiment."
      ],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa12.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA12",
      "page_number": "69",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA13",
      "title": "Design of a Surrogate Model for MUED at BNL Using VSim, Elegant and HPC",
      "authors": [
        "S.I. Sosa Guitron",
        "S. Biedron",
        "T.B. Bolin",
        "UNM-ECE",
        "Albuquerque",
        "USA",
        "Element Aero",
        "Chicago",
        "USA",
        "UNM-ME",
        "Albuquerque",
        "New Mexico",
        "USA",
        "The MeV Ultrafast Electron Diffraction (MUED) instrument at Brookhaven National Laboratory is a unique capability for material science. As part of a plan to make MUED a high-throughput user facility",
        "we are exploring instrumentation developments based on Machine Learning (ML). We are developing a surrogate model of MUED that can be used to support control tasks. The surrogate model will be based on beam simulations that are benchmarked to experimental observations. We use VSim to model the beam dynamics of the radio-frequency gun and Elegant to transport the beam through the rest of the beam-line. We also use High Performance Computing resources from Argonne Leadership Computing Facility to generate the data for the surrogate model based on the original simulation as well as training the ML model."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa13.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA13",
      "page_number": "72",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA14",
      "title": "A Wide Dynamic-Range Halo Monitor for 8 GeV Proton Beams at FNAL",
      "authors": [
        "Y. Hashimoto",
        "C. Ohmori",
        "T. Sasaki",
        "M. Tejima",
        "T. Toyama",
        "M. Uota",
        "KEK",
        "Tokai",
        "Ibaraki",
        "Japan",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Mitsubishi Electric System & Service Co.",
        "Ltd",
        "Tsukuba",
        "Japan",
        "J-PARC",
        "KEK & JAEA",
        "Ibaraki-ken",
        "Japan",
        "Eliminating harmful beam halos is the most important technique for high-intensity proton accelerators. Therefore",
        "beam halo diagnosis is indispensable and becomes more and more important. At J-PARC",
        "a wide dynamic range monitor was installed in the beam transport line in 2012. The device is a two-dimensional beam profile monitor [*",
        "**]",
        "and it has a dynamic range of approximately six digits of magnitude by using Optical Transition Radiation and fluorescence screens. The FNAL accelerator complex has been upgrading through increased beam intensity and beam quality. A new beam halo diagnostic device is required in the beam transport line between the booster and recycler. It will be manufactured in a collaboration between J-PARC and FNAL as a part of the U.S.-Japan Science and Technology Cooperation Program in High Energy Physics. We are redesigning the monitor to satisfy FNAL specifications for beam energy",
        "intensity",
        "and size. The equipment will be manufactured at J-PARC and then shipped to FNAL in 2024. In this report",
        "the design of the device will be described."
      ],
      "institutions": [],
      "abstract": "R. Ainsworthpresenter * https://accelconf.web.cern.ch/",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa14.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA14",
      "page_number": "75",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA15",
      "title": "Synchronous High-Frequency Distributed Readout for Edge Processing at the Fermilab Main Injector and Recycler",
      "authors": [
        "J.R. Berlioz",
        "J.M.S. Arnold",
        "M.R. Austin",
        "P.M. Hanlet",
        "K.J. Hazelwood",
        "M.A. Ibrahim",
        "A. Narayanan",
        "D.J. Nicklaus",
        "G. Pradhan",
        "A.L. Saewert",
        "B.A. Schupbach",
        "R.M. Thurman-Keup",
        "N.V. Tran",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "J. Jiang",
        "H. Liu",
        "S. Memik",
        "R. Shi",
        "M. Thieme",
        "D. Ulusel",
        "Northwestern University",
        "Evanston",
        "Illinois",
        "USA",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "The Main Injector (MI) was commissioned using data acquisition systems developed for the Fermilab Main Ring in the 1980s. New VME-based instrumentation was commissioned in 2006 for beam loss monitors (BLM)",
        "which provided a more systematic study of the machine and improved displays of routine operation. However",
        "current projects are demanding more data and at a faster rate from this aging hardware. One such project",
        "Real-time Edge AI for Distributed Systems (READS)",
        "requires the high-frequency",
        "low-latency collection of synchronized BLM readings from around the approximately two-mile accelerator complex. Significant work has been done to develop new hardware to monitor the VME backplane and broadcast BLM measurements over Ethernet",
        "while not disrupting the existing operations-critical functions of the BLM system. This paper will detail the design",
        "implementation",
        "and testing of this parallel data pathway."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa15.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA15",
      "page_number": "79",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA17",
      "title": "Symplectic Particle Tracking in a Thick Nonlinear McMillan Lens for the  Fermilab Integrable Optics Test Accelerator (IOTA)",
      "authors": [
        "B.L. Cathey",
        "G. Stancari",
        "T. Zolkin",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The McMillan system is a novel method to increase the tune spread of a beam without decreasing its dynamic aperture due to the system’s integrability. While the ideal system is based on an infinitely thin kick",
        "the physical design requires a thick electron lens",
        "including a solenoid. Particle transport through the lens is difficult to simulate due to the nature of the force on the circulating beam. This paper demonstrates accurate simulation of a thick McMillan lens in a solenoid using symplectic integrators derived from Yoshida’s method."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa17.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA17",
      "page_number": "83",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA18",
      "title": "Residual Dose and Environmental Monitoring for the Fermilab Main Injector Tunnel Using the Data Acquisition Logging Engine (Dale)",
      "authors": [
        "N. Chelidze",
        "R. Ainsworth",
        "B.C. Brown",
        "D. Capista",
        "K.J. Hazelwood",
        "D.K. Morris",
        "M.J. Murphy",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Recycler and the Main Injector are part of the Fermilab Accelerator complex used to deliver proton beam to the different experiments. It is very important to control and minimize losses in both machines during operation",
        "to reduce personnel dose from residual activation and to preserve component lifetime. To minimize losses",
        "we need to identify the loss points and adjust the components accordingly. The Data Acquisition Loss Engine (DALE) platform has been developed within the Main Injector department and upgraded throughout the years. DALE is used to survey the entire enclosure for residual dose rates and environmental readings when unrestricted access to the enclosure is possible. Currently DALE has two radiation meters",
        "which are aligned along each machine",
        "so loss points can be identified for both at the same time. DALE attaches to the enclosure carts and is continuously in motion monitoring dose rates and other environmental readings. In this paper we will describe how DALE is used to provide radiation maps of the residual dose rates in the enclosure. We will also compare the loss points with the Beam Loss monitor data."
      ],
      "institutions": [
        "Funding: Fermi National Accelerator Laboratory"
      ],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa18.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA18",
      "page_number": "87",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA19",
      "title": "The Effect of the Main Injector Ramp on the Recycler",
      "authors": [
        "N. Chelidze",
        "R. Ainsworth",
        "K.J. Hazelwood",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Recycler and Main Injector are part of the Fermilab Accelerator complex used to deliver a high power proton beam. Both machines share the same enclosure with the Recycler mounted 6 ft above the Main Injector. The Main Injector accelerates beam from 8 GeV to 120 GeV. While the majority of the Recycler has mu metal shielding",
        "the effect of the Main Injector ramp is still significant and can affect both the tunes and the orbit. In this paper",
        "we detail the size of these effects."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa19.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA19",
      "page_number": "90",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA21",
      "title": "Effect of Electropolishing on Nitrogen Doped and Undoped Niobium Surfaces",
      "authors": [
        "V. Chouhan",
        "F. Furuta",
        "M. Martinello",
        "T.J. Ring",
        "G. Wu",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Cold electropolishing (EP) of a nitrogen-doped (N-doped) niobium (Nb) superconducting RF (SRF) cavity was found to improve its quality factor. In order to understand the effect of EP temperature on N-doped and undoped surfaces",
        "a systematic EP study was conducted with 2/0 N-doped and heat-treated Nb samples in a beaker. The Nb samples were electropolished at different surface temperatures ranging from 0 to 42 C. The results showed that the doped surface was susceptible to the sample temperature during EP. EP resulted in the surface pitting on the doped samples where the number density of pits increased at a higher temperature. The surface results were compared with the surface of cutouts from a 9-cell cavity which was 2/0 N-doped and electropolished. This paper shows de-tailed surface features of the N-doped and undoped Nb surfaces electropolished at different temperatures."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa21.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA21",
      "page_number": "93",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA22",
      "title": "Study on Electropolishing Conditions for 650 MHz Niobium SRF Cavity",
      "authors": [
        "V. Chouhan",
        "D.J. Bice",
        "F. Furuta",
        "M. Martinello",
        "M.K. Ng",
        "H. Park",
        "T.J. Ring",
        "G. Wu",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "B.M. Guilfoyle",
        "M.P. Kelly",
        "T. Reid",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "The PIP II linear accelerator includes different types of niobium SRF cavities including 650 MHz elliptical low (0.61) and high (0.92) beta cavities. The elliptical cavity surface is processed with the electropolishing method. The elliptical cavities especially the low-beta 650 MHz cavities showed a rough equator surface after the EP was performed with the standard EP conditions. This work was focused to study the effect of different EP parameters",
        "including cathode surface area",
        "temperature and voltage",
        "and optimize them to improve the cavity surface."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa22.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA22",
      "page_number": "97",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA23",
      "title": "Tests of the Extended Range SRF Cavity Tuners for the LCLS-II HE Project",
      "authors": [
        "C. Contreras-Martinez",
        "T.T. Arkan",
        "A.T. Cravatta",
        "B.D. Hartsell",
        "J.A. Kaluzny",
        "T.N. Khabiboulline",
        "Y.M. Pischalnikov",
        "S. Posen",
        "G.V. Romanov",
        "J.C. Yun",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The LCLS-II HE superconducting linac will produce multi-energy beams by supporting multiple undulator lines simultaneously. This could be achieved by using the cavity SRF tuner in the off-frequency detune mode. This off-frequency operation method was tested in the verification cryomodule (vCM) and CM 1 at Fermilab at 2 K. In both cases",
        "the tuners achieved a frequency shift of -565±80 kHz. This study will discuss cavity frequency during each step as it is being assembled in the cryomodule string and finally when it is being tested at 2 K. Tracking the cavity frequency helped enable the tuners to reach this large frequency shift. The specific procedures of tuner setting during assembly will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa23.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA23",
      "page_number": "100",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA24",
      "title": "LCLS-II and HE Cryomodule Microphonics at CMTF at Fermilab",
      "authors": [
        "C. Contreras-Martinez",
        "B.E. Chase",
        "A.T. Cravatta",
        "J.A. Einstein-Curtis",
        "E.R. Harms",
        "J.P. Holzbauer",
        "J.N. Makara",
        "S. Posen",
        "R. Wang",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Microphonics causes the cavity to detune. This study discusses the microphonics of 16 cryomodules",
        "14 for LCLS-II and 2 for LCLS-II HE tested at CMTF. The peak detuning",
        "as well as the RMS detuning for each cryomodule",
        "will be discussed. For each cryomodule",
        "the data was taken with enough soaking time to prevent any thermalization effects which can show up in the detuning. Each data capture taken was 30 minutes or longer and sampled at 1 kHz."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa24.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA24",
      "page_number": "103",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA25",
      "title": "Simulated Lorentz Force Detuning Compensation with a Double Lever Tuner on a Dressed ILC/1.3 GHz Cavity at Room Temperature",
      "authors": [
        "C. Contreras-Martinez",
        "Y.M. Pischalnikov",
        "J.C. Yun",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "Pulsed SRF linacs with high accelerating gradients experience large frequency shifts caused by Lorentz force detuning (LFD). A piezoelectric actuator with a resonance control algorithm can maintain the cavity frequency at the nominal level thus reducing the RF power. This study uses a double lever tuner with a piezoelectric actuator for compensation and another piezoelectric actuator to simulate the effects of the Lorentz force pulse. A double lever tuner has an advantage by increasing the stiffness of the cavity-tuner system thus reducing the effects of LFD. The tests are conducted at room temperature and with a dressed 1.3 GHz 9-cell cavity.",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa25.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA25",
      "page_number": "106",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA27",
      "title": "Validation of the 650 MHz SRF Tuner on the Low and High Beta Cavities for PIP-II at 2 K",
      "authors": [
        "C. Contreras-Martinez",
        "S.K. Chandrasekaran",
        "S. Cheban",
        "G.V. Eremeev",
        "I.V. Gonin",
        "T.N. Khabiboulline",
        "Y.M. Pischalnikov",
        "O.V. Prokofiev",
        "A.I. Sukhanov",
        "J.C. Yun",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "The PIP-II linac will include thirty-six BG=0.61 and twenty-four BG=0.92 650 MHz 5 cell elliptical SRF cavities. Each cavity will be equipped with a tuning system consisting of a double lever slow tuner for coarse frequency tuning and a piezoelectric actuator for fine frequency tuning. The same tuner will be used for both the BG=0.61 and BG=0.92 cavities. Results of testing the cavity-tuner system for the BG=0.61 will be presented for the first time.",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa27.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA27",
      "page_number": "109",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA28",
      "title": "Semantic Regression for Disentangling Beam Losses in the Fermilab Main Injector and Recycler",
      "authors": [
        "M. Thieme",
        "H. Liu",
        "S. Memik",
        "R. Shi",
        "Northwestern University",
        "Evanston",
        "Illinois",
        "USA",
        "J.M.S. Arnold",
        "M.R. Austin",
        "P.M. Hanlet",
        "K.J. Hazelwoodpresenter",
        "M.A. Ibrahim",
        "V.P. Nagaslaev",
        "A. Narayanan",
        "D.J. Nicklaus",
        "G. Pradhan",
        "A.L. Saewert",
        "B.A. Schupbach",
        "K. Seiya",
        "R.M. Thurman-Keup",
        "N.V. Tran",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Fermilab’s Main Injector enclosure houses two accelerators: the Main Injector (MI) and the Recycler (RR). In periods of joint operation",
        "when both machines contain high intensity beam",
        "radiative beam losses from MI and RR overlap on the enclosure’s beam loss monitoring (BLM) system",
        "making it difficult to attribute those losses to a single machine. Incorrect diagnoses result in unnecessary downtime that incurs both financial and experimental cost. In this work",
        "we introduce a novel neural approach for automatically disentangling each machine’s contributions to those measured losses. Using a continuous adaptation of the popular UNet architecture in conjunction with a novel data augmentation scheme",
        "our model accurately infers the machine of origin on a per-BLM basis in periods of joint and independent operation. Crucially",
        "by extracting beam loss information at varying receptive fields",
        "the method is capable of learning both local and global machine signatures and producing high quality inferences using only raw BLM loss measurements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa28.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA28",
      "page_number": "112",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA29",
      "title": "Second Generation Fermilab Main Injector 8 GeV Beamline Collimation Preliminary Design",
      "authors": [
        "K.J. Hazelwood",
        "P. Adamson",
        "B.C. Brown",
        "D. Capista",
        "R.M. Donahue",
        "B.L. Klein",
        "N.V. Mokhov",
        "V.S. Pronskikh",
        "V.I. Sidorov",
        "M.C. Vincent",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The current Fermilab Main Injector 8 GeV beamline transverse collimation system was installed in 2006. Since then",
        "proton beam intensities and rates have increased significantly. With the promise of even greater beam intensities and a faster repetition rate when the PIP-II upgrade completes later this decade",
        "the current collimation system will be insufficient. Over the past 18 months",
        "multiple collimation designs have been investigated",
        "some more traditional and others novel. A preliminary design review was conducted and a design chosen. Work is underway to finalize the chosen design",
        "prototype some of its novel components and procure parts for installation Summer 2023."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa29.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA29",
      "page_number": "116",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA30",
      "title": "LCLS-II BCS Average Current Monitor",
      "authors": [
        "N.M. Ludlow",
        "T.L. Allison",
        "J.P. Sikora",
        "J.J. Welch",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "LCLS-II is a 4th generation light source at the SLAC National Accelerator Laboratory. LCLS-II will accelerate a 30 µA electron beam with a 1 MHz bunch rate with a new superconducting Continuous Waveform (CW) RF accelerator. The Average Current Monitor (ACM) is part of the Beam Containment System (BCS) for the LCLS-II accelerator. The Beam Containment System is a safety system that provides paths to safely shut the accelerator beam off under a variety of conditions. The Average Current Monitor is a beam diagnostic within the BCS that is used to verify that the accelerator is producing the appropriate current level and to limit beam power to allowed values to protect the machine and beam dumps. The average beam current is obtained by measuring the power level induced by the beam in a low Q cavity. By knowing the Q",
        "the beta",
        "and the coupling of the cavity",
        "the instantaneous charge can be calculated",
        "then integrating the instantaneous charge over one millisecond will yield the average current. This paper will discuss progress in the checkout process of the ACM LLRF hardware leading to LCLS-II commissioning."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa30.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA30",
      "page_number": "120",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA33",
      "title": "Waker Experiments at Fermilab Recycler Ring",
      "authors": [
        "O. Mohsen",
        "R. Ainsworth",
        "N. Eddy",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Attaining high-intensity hadron beams is often limited due to the transverse collective instabilities",
        "whose understanding is thus required to see and possibly extend the intensity limitations. To explore such instabilities",
        "a novel artificial wake system",
        "the waker",
        "has been built and tested at the Fermilab Recycler Ring (RR). In this report",
        "we show recent upgrades of the waker. Also",
        "we present experimental studies of instabilities at various space charge and wake parameters."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa33.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA33",
      "page_number": "124",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA34",
      "title": "Noise in Intense Electron Bunches",
      "authors": [
        "S. Nagaitsev",
        "D.R. Broemmelsiek",
        "J.D. Jarvis",
        "A.H. Lumpkin",
        "J. Ruan",
        "G.W. Saewert",
        "R.M. Thurman-Keup",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Z. Huang",
        "G. Stupakov",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "University of Chicago",
        "Chicago",
        "Illinois",
        "USA",
        "We report on our investigations into density fluctuations in electron bunches. Noise and density fluctuations in relativistic electron bunches",
        "accelerated in a linac",
        "are of critical importance to various Coherent Electron Cooling (CEC) concepts as well as to free-electron lasers (FELs). For CEC",
        "the beam noise results in additional diffusion that counteracts cooling. In SASE FELs",
        "a microwave instability starts from the initial noise in the beam and eventually leads to the beam microbunching yielding coherent radiation",
        "and the initial noise in the FEL bandwidth plays a useful role. In seeded FELs",
        "in contrast",
        "such noise interferes with the seed signal",
        "so that reducing noise at the initial seed wavelength would lower the seed laser power requirement. Status of the project will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa34.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA34",
      "page_number": "128",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA36",
      "title": "Optimization of Superconducting Linac for Proton Improvement Plan-II (PIP-II)",
      "authors": [
        "A. Pathak",
        "E. Pozdeyev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "PIP-II is an essential upgrade of the Fermilab complex that will enable the world’s most intense high-energy beam of neutrinos for the international Deep Underground Neutrino Experiment at LBNF and support a broad physics program at Fermilab. Ultimately",
        "the PIP-II superconducting linac will be capable of accelerating the H− CW beam to 800 MeV with an average power of 1.6 MW. To operate the linac with such high power",
        "beam losses and beam emittance growth must be tightly controlled. In this paper",
        "we present the results of global optimization of the Linac options towards a robust and efficient physics design for the superconducting section of the PIP-II linac. We also investigate the impact of the nonlinear field of the dipole correctors on the beam quality and derive the requirement on the field quality using statistical analysis. Finally",
        "we assess the need to correct the quadrupole focusing produced by Half Wave",
        "and Single Spoke accelerating cavities. We assess the feasibility of controlling the beam coupling in the machine by changing the polarity of the field of Linac focusing solenoids"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa36.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA36",
      "page_number": "132",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA38",
      "title": "Accelerated Lifetime Test of the SRF Dressed Cavity/Tuner System for the LCLS II HE Project",
      "authors": [
        "Y.M. Pischalnikov",
        "T.T. Arkan",
        "C. Contreras-Martinez",
        "B.D. Hartsell",
        "J.A. Kaluzny",
        "Y.M. Orlov",
        "R.V. Pilipenko",
        "J.C. Yun",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Wahid Lahmadi",
        "Williston",
        "USA",
        "The off-frequency detune method is being considered for application in the LCLS-II-HE superconducting linac to produce multi-energy electron beams for supporting multiple undulator lines simultaneously. Design of the tuner has been changed to deliver roughly 3 times larger frequency tuning range. Working requirements for off-frequency operation (OFO) state that cavities be tuned at least twice a month. This specification requires the increase of the tuner longevity by 30 times compared with LCLS-II demands. Accelerated longevity tests of the LCLS-II HE dressed cavity with tuner were conducted at FNAL’s HTS. Detail analysis of wearing and impacts on performances of the tuner’s piezo and stepper motor actuators will be presented. Additionally",
        "results of longevity testing of the dressed cavity bellow",
        "when cooled down to 2 K and compressed by 2.6 mm for roughly 2000 cycles",
        "will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa38_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa38.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa38_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA38",
      "page_number": "136",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA41",
      "title": "Diagnostics for LINAC Optimization with Machine Learning",
      "authors": [
        "R.V. Sharankova",
        "M.W. Mwaniki",
        "K. Seiya",
        "M.E. Wesley",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Fermilab Linac delivers 400 MeV H− beam to the rest of the accelerator chain. Providing stable intensity",
        "energy",
        "and emittance is key since it directly affects downstream machines. To operate high current beam",
        "accelerators must minimize uncontrolled particle loss; this is generally accomplished by minimizing beam emittance. Ambient temperature and humidity variations are known to affect resonance frequency of the accelerating cavities which induces emittance growth. In addition",
        "the energy and phase space distribution of particles emerging from the ion source are subject to fluctuations. To counter these effects we are working on implementing dynamic longitudinal parameter optimization based on Machine Learning (ML). As an input for the ML model",
        "signals from beam diagnostic have to be well understand and reliable. We have been revisiting diagnostics in the linac. In this presentation we discuss the status of the diagnostics and beam studies as well as the status and plans for ML-based optimization."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa41_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa41.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa41_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA41",
      "page_number": "139",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA42",
      "title": "Considerations Concerning the Use of HTS Conductor for Accelerator Dipoles with Inductions above 15 T",
      "authors": [
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The use of high temperature superconductors for accelerator dipole has been discussed for about twenty years and maybe a little more. Conductors that can potentially be used for accelerator magnets have been available for about fifteen years. These conductors are REBCO tape conductors",
        "which can be wound into coils with no reaction after winding",
        "and BISSCO cable conductors",
        "which require reaction after winding and insulation after reaction in a process similar to Nb3Sn cables. Both conductors are expensive and the process after reacting is expensive. Some unknown factors that remain: Will either conductor degrade in current carrying capacity with repeated cycling like Nb3Sn cables do? The other two issues are problems for both types of HTS conductors and they are; 1) quench protection in the event of a normal region run-away and 2) dealing with the superconducting magnetization inherent with HTS cables and tapes. This paper will discuss the last two issues and maybe will provide a partial solution to these problems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa42_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa42.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa42_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA42",
      "page_number": "143",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA43",
      "title": "Dee Voltage Regulator for the 88-Inch Cyclotron",
      "authors": [
        "M. Kireeff",
        "P. Bloemhard",
        "T. Hassan",
        "L. Phair",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "A new broadband Dee voltage regulator was designed and built for the 88-Inch Cyclotron at Lawrence Berkeley National Laboratory. The previous regulator was obsolete",
        "consequently",
        "it was difficult to troubleshoot and repair. Additionally",
        "during operation",
        "it displayed problems of distortion and stability at certain frequencies. The new regulator uses off-the-shelf components that can detect and disable the RF during sparking events",
        "protecting the RF driver system. Furthermore",
        "it improves the tuning of the cyclotron and allows consistency in operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa43_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa43.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa43_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA43",
      "page_number": "147",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA44",
      "title": "Utilizing Python to Prepare the VENUS Ion Source for Machine Learning",
      "authors": [
        "A. Kireeff",
        "L. Phair",
        "M.J. Regis",
        "M. Salathe",
        "D.S. Todd",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The fully superconducting electron cyclotron resonance (ECR) ion source VENUS is one of the world’s two highest-performing ECR ion sources",
        "and a copy of this source will soon be used to produce ion beams at FRIB. The tuning and optimization of ECR ion sources is time consuming",
        "and there are few detailed theoretical models to guide this work. To aid in this process",
        "we are working toward utilizing machine learning to both efficiently optimize VENUS and reliably maintain its stability for long campaigns. We have created a Python library to interface with the programmable logic controller (PLC) in order to operate VENUS and collect and store source and beam data. We will discuss the design and safety considerations that went into creating this library",
        "the implementation of the library",
        "and some of the capabilities it enables."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa44_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa44.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa44_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA44",
      "page_number": "151",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA45",
      "title": "Vacuum Electron Devices in the 88-Inch Cyclotron",
      "authors": [
        "M. Kireeff Covo",
        "J.Y. Benitez",
        "P. Bloemhard",
        "J.P. Garcia",
        "B. Ninemire",
        "L. Phair",
        "D.S. Todd",
        "D.Z. Xie",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The 88-Inch Cyclotron at Lawrence Berkeley National Laboratory is a sector-focused cyclotron that has light- and heavy-ion capabilities and supports a local research program in Nuclear Science and is the home of the Berkeley Accelerator Space Effects Facility",
        "which studies effects of radiation on microelectronics",
        "optics",
        "materials",
        "and cells. The cyclotron utilizes several vacuum electron devices (VEDs) in different systems",
        "mainly to convey plasma heating",
        "high power RF generation",
        "and high-voltage and current DC power generation. VEDs have been proven reliable",
        "robust",
        "and radiation resistant. They also have wide range",
        "good response against transients",
        "and stable operation with load mismatch during system tuning",
        "instabilities",
        "or breakdowns. The paper will describe applications of these devices in the 88-Inch Cyclotron"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa45_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa45.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa45_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA45",
      "page_number": "154",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA46",
      "title": "Cryogenic Dielectric Structure with GΩ/m Level Shunt Impedance",
      "authors": [
        "R.A. Kostin",
        "C. Jing",
        "Euclid Beamlabs",
        "Bolingbrook",
        "USA",
        "Shunt impedance is one of the most important parameters characterizing particle acceleration efficiency. It is known that RF losses are reduced at cryogenic temperatures. For example",
        "a record high shunt impedance of 350 MΩ/m was demonstrated recently for all metal X-band accelerating structure",
        "which is more than 2 times higher than that at room temperature. In this article we present a novel hybrid dielectric structure which can achieve even higher shunt impedance due to the fact that losses in dielectric materials reduced much more than in pure copper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa46_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa46.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa46_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA46",
      "page_number": "157",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA50",
      "title": "Integrated Photonics Structure Cathodes for Longitudinally Shaped Bunch Trains",
      "authors": [
        "S.J. Coleman",
        "D.T. Abell",
        "C.C. Hall",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "University of Southern California",
        "Los Angeles",
        "California",
        "USA",
        "Arizona State University",
        "Tempe",
        "USA",
        "S.Y. Kim",
        "P. Piot",
        "J.F. Power",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Compact",
        "high-gradient structure wakefield accelerators can operate at improved efficiency using shaped electron beams",
        "such as a high transformer ratio beam shape",
        "to drive the wakes. These shapes have generally come from a photocathode gun followed by a transverse mask to imprint a desired shape on the transverse distribution",
        "and then an emittance exchanger (EEX) to convert that transverse shape into a longitudinal distribution. This process discards some large fraction of the beam",
        "limiting wall-plug efficiency as well as leaving a solid object in the path of the beam. In this paper",
        "we present a proposed method of using integrated photonics structures to control the emission pattern on the cathode surface. This transverse pattern is then converted into a longitudinal pattern at the end of an EEX. This removes the need for the mask",
        "preserving the total charge produced at the cathode surface. We present simulations of an experimental set-up to demonstrate this concept at the Argonne Wakefield Accelerator."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa50_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa50.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa50_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA50",
      "page_number": "160",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA55",
      "title": "Facilitating Machine Learning Collaborations Between Labs, Universities, and Industry",
      "authors": [
        "J.P. Edelen",
        "D.T. Abell",
        "D.L. Bruhwiler",
        "S.J. Coleman",
        "N.M. Cook",
        "A. Diaw",
        "J.A. Einstein-Curtis",
        "C.C. Hall",
        "M.C. Kilpatrick",
        "B. Nash",
        "I.V. Pogorelov",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "ORNL RAD",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "A.L. Edelen",
        "B.D. O’Shea",
        "R.J. Roussel",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA"
      ],
      "institutions": [],
      "abstract": "It is clear from numerous recent community reports, papers, and proposals that machine learning is of tremendous interest for particle accelerator applications. The quickly evolving landscape continues to grow in both the breadth and depth of applications including physics modeling, anomaly detection, controls, diagnostics, and analysis. Consequently, laboratories, universities, and companies across the globe have established dedicated machine learning (ML) and data-science efforts aiming to make use of these new state-of-the-art tools. The current funding environment in the U.S. is structured in a way that supports specific application spaces rather than larger collaboration on community software. Here, we discuss the existing collaboration bottlenecks and how a shift in the funding environment, and how we develop collaborative tools, can help fuel the next wave of ML advancements for particle accelerators. reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa55_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa55.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa55_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA55",
      "page_number": "164",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA57",
      "title": "Online Models for X-Ray Beamlines",
      "authors": [
        "B. Nash",
        "D.T. Abell",
        "M.V. Keilman",
        "P. Moeller",
        "I.V. Pogorelov",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "Y. Du",
        "A. Giles",
        "J. Lynch",
        "T. Morris",
        "M.S. Rakitin",
        "A. Walter",
        "BNL",
        "Upton",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa57_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa57.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa57_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA57",
      "page_number": "170",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA59",
      "title": "Prediction of Gaseous Breakdown for Plasma Cleaning of RF Cavities",
      "authors": [
        "Ansys",
        "Inc.",
        "Canonsburg",
        "USA",
        "The quest for a high accelerating gradient in superconducting radio frequency cavity attracted scientists to adopt the plasma cleaning technology. Generating an efficient plasma inside a complex cavity structure for a desired frequency",
        "gas types",
        "and pressure for a given temperature is a challenge. The onset of discharge can be obtained from the well-known Paschen curve. Setting up an experiment is expensive and time-consuming",
        "which may lead to a significant delay in the project. A high-fidelity computer simulation",
        "modeling an arbitrary geometry and tracking the Paschen curve in a complex electromagnetic environment is therefore necessary. Ansys HFSS through its Finite Element Mesh (FEM) for the full-wave EM simulations combined with the electron impact ionization of gases enables the successful prediction of plasma breakdown for an arbitrary configuration for a wide frequency band and variety of gases. A comprehensive study will be demonstrated at the conference."
      ],
      "institutions": [],
      "abstract": "The author like to thank Robert Chao for the valuable discussions and his efforts in developing this capability in the Ansys Electronics Desktop. reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa59_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa59.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa59_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA59",
      "page_number": "174",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA60",
      "title": "HFSS Enables Multipaction Analysis of High Power RF/Microwave Components",
      "authors": [
        "Ansys",
        "Inc.",
        "Canonsburg",
        "USA",
        "The radiofrequency (RF) components in particle accelerators operated under a vacuum and driven by high RF power may be prone to electron multipaction ’ an RF triggered electron resonance phenomenon causing malfunction or complete breakdown. Therefore",
        "exploring the design challenges of vacuum RF windows",
        "cavities",
        "and other devices for the electron multipaction becomes necessary. Setting up an experiment to mitigate the failure of RF devices is expensive and time-consuming",
        "which may cause a significant delay in the project. Therefore",
        "a high-fidelity computer simulation modeling the arbitrary geometry and tracking the particles (electrons) in a complex electromagnetic environment is desirable. Ansys HFSS through Finite Element Mesh (FEM) for the full-wave RF simulation combined with the particle-in-cell (PIC) technique for tracking particles in EM fields; enables the engineers/physicist successful prediction of system failure against the electron multipaction. This paper will demonstrate the workflow of the HFSS multipaction analysis."
      ],
      "institutions": [],
      "abstract": "The author like to thank Robert Chao for the valuable discussions and his efforts in developing this capability in the Ansys Electronics Desktop. reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa60_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa60.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa60_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA60",
      "page_number": "176",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA61",
      "title": "Modular Solid-State Switching and Arc Suppression for Vacuum Tube Bias Circuits",
      "authors": [
        "E.L. Atkinson",
        "T.J. Houlahan",
        "B.E. Jurczyk",
        "R.A. Stubbers",
        "Starfire Industries LLC",
        "Champaign",
        "USA",
        "In this work",
        "we present operational and performance data for a solid-state switching circuit that delivers pulsed power at up to 12 kV and 100 A. This circuit",
        "which is comprised of a series configuration of IGBT-based subcircuits",
        "is suitable for driving the high-power vacuum-tube amplifiers that are typically used in RF accelerator systems. Each subcircuit can switch up to 3 kV",
        "and the subcircuits can be stacked in series to extend the overall voltage capabilities of the switch. The circuit is designed to prevent overvoltaging any single transistor during switching transients or faults",
        "regardless of the number of series subcircuits. Further",
        "the circuit also includes the capability for rapid arc detection and suppression. Testing has shown effective switching at up to 100 A at 12 kV and for pulse repetition frequencies and durations in the range of 1-200 Hz and 10-50 µs",
        "respectively. Additionally",
        "the arc suppression circuitry has been shown to reliably limit arcs at 8-12 kV with a quench time of <1 µs and with a total energy of <0.2 J",
        "minimizing the grid erosion in the vacuum-tube during an arc."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa61_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa61.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa61_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA61",
      "page_number": "179",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA62",
      "title": "High Quality Conformal Coatings on Accelerator Components via Novel Radial Magnetron with High-Power Impulse Magnetron Sputtering",
      "authors": [
        "W.M. Huber",
        "I. Haehnlein",
        "T.J. Houlahan",
        "B.E. Jurczyk",
        "A.S. Morrice",
        "R.A. Stubbers",
        "Starfire Industries LLC",
        "Champaign",
        "USA",
        "In this work",
        "we present two configurations of a novel radial magnetron design that are suitable for coating the complex inner surfaces of a variety of modern particle accelerator components. These devices have been used in conjunction with high-power impulse magnetron sputtering (HiPIMS) to deposit copper and niobium films onto the inner surfaces of bellows assemblies",
        "waveguides",
        "and SRF cavities. These films",
        "with thicknesses of up to 3 µm and 40 µm for niobium and copper",
        "respectively",
        "have been shown to be conformal",
        "adherent",
        "and conductive. In the case of copper",
        "the post-bake RRR values of the resulting films are well within the range specified for electroplating of the LCLS-II bellows and CEBAF waveguide assemblies. In addition to requiring no chemical processing beyond a detergent rinse and solvent degrease",
        "this magnetron design exhibits over 80% target material utilization. Further",
        "in the case of niobium",
        "an enhancement in RRR over that of the bulk (target) material has been observed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa62_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa62.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa62_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA62",
      "page_number": "182",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA63",
      "title": "Multiphysics Simulation of the Thermal Response of a Nanofibrous Target in a High-Intensity Beam",
      "authors": [
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "S.K. Bidhar",
        "F. Pellemoine",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "IIT Bhubaneswar",
        "Jatni",
        "India",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "Nanofibrous structures are of high interest to the fields of engineering and materials science",
        "and investigation of their properties as well as discovery of novel applications for them both constitute lively areas of research. A very promising application of nanofiber mats lies in the field of accelerator technology: beam targets made from nanofiber mats offer a solution to the problem of advancing the \"intensity frontier\"–-the limit on the beam intensities that can be realized in fixed target experiments and neutrino production facilities. However",
        "testing has shown that the survivability of these nanofiber targets depends strongly on their manufacturing parameters",
        "such as the packing density of fibers. In this work",
        "we will use multiphysics simulations to perform a thermal study on how nanofiber targets react to high intensity beams",
        "so that the dependency of the targets’ lifetime on their construction parameters can be better understood."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa63_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa63.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa63_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA63",
      "page_number": "185",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA64",
      "title": "Circular Modes for Mitigating Space-Charge Effects and Enabling Flat Beams",
      "authors": [
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "Flat beams are preferred in high-intensity accelerators and high-energy colliders due to one of the transverse plane emittances being smaller",
        "which enhances luminosity and beam brightness. However",
        "flat beams are devastating at low energies due to space charge forces which are significantly enhanced in one plane. The same is true",
        "although to a lesser degree",
        "for non-symmetric elliptical beams. In order to mitigate this effect",
        "circular mode beam optics can be used. In this paper",
        "we show that circular mode beams dilute space charge effects at lower energies",
        "and can be transformed to flat beams later on."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa64_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa64.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa64_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA64",
      "page_number": "189",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA66",
      "title": "Hadron Monitor Calibration System for NuMI",
      "authors": [
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "NuMI (Neutrinos at Main Injector) beamline at Fermi National Accelerator Laboratory provides neutrinos to various neutrino experiments. The hadron monitor consisting of a 5 by 5 array of ionization chambers is part of the diagnostics for the beamline. In order to calibrate the hadron monitor",
        "a gamma source is needed. We present the status and progress of the development of the calibration system for the hadron monitor. The system based on Raspberry Pi controlled CNC system",
        "motors",
        "and position sensors would allow us to place the gamma source precisely to calibrate the signal gain of individual pixels. The ultimate outcome of the study is a prototype of the calibration system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa66_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa66.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa66_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA66",
      "page_number": "193",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA67",
      "title": "Examining the Effects of Oxygen Doping on SRF Cavity Performance",
      "authors": [
        "H. Hu",
        "Y.K. Kim",
        "University of Chicago",
        "Chicago",
        "Illinois",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Superconducting radiofrequency (SRF) cavities are resonators with extremely low surface resistance that enable accelerating cavities to have extremely high quality factors (Q0). High (Q0) decreases the capital required to keep accelerators cold by reducing power loss. The performance of SRF cavities is largely governed by the surface composition of the first 100 nm of the cavity surface. Impurities such as oxygen and nitrogen have been observed to yield high Q0",
        "but their precise roles are still being studied. Here",
        "we compare the performance of cavities doped with nitrogen and oxygen in terms of fundamental material properties to understand how these impurities affect performance. This enables us to have further insight into the underlying mechanisms that enable these surface treatments to yield high Q0 performance."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa67_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa67.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa67_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA67",
      "page_number": "196",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA69",
      "title": "Adjoint Optimization Applied to Flat to Round Transformers",
      "authors": [
        "UMD",
        "College Park",
        "Maryland",
        "USA"
      ],
      "institutions": [],
      "abstract": "T.M. Antonsen, B.L. Beaudoin, S. Bernal, L. Dovlatyan, I. Haber, P.G. O’Shea, D.F. Sutter",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa69_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa69.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa69_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA69",
      "page_number": "199",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA70",
      "title": "Film Dosimetry Characterization of the Research Linac at the University of Maryland",
      "authors": [
        "A.S. Johnson",
        "L.T. Gilde",
        "M.K. Hottinger",
        "T.W. Koeth",
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "A heavily modified Varian linac was installed as part of the University of Maryland Radiation Facilities in the early 1980s. The electron linac was initially used for materials testing and pulsed radiolysis. Overtime",
        "diagnostics such as a spectrometer magnet and scintillator screens have been removed",
        "limiting the ability to describe the electron beam. The beamline is currently configured with a thin titanium window to allow the electrons to escape the vacuum region and interact with samples in air. A calibrated film dosimetry system was used to characterize the transverse beam dimensions and uniformity in air. The results of these experimental measurements will be described in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa70_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa70.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa70_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA70",
      "page_number": "203",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA72",
      "title": "Preliminary Tests and Beam Dynamics Simulations of a Straight-Merger Beamline",
      "authors": [
        "A.A. Al Marzouk",
        "P. Piot",
        "T. Xu",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "S.V. Benson",
        "K.E. Deitrick",
        "J. Guo",
        "A. Hutton",
        "G.-T. Park",
        "S. Wang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "D.S. Doran",
        "G. Ha",
        "P. Piot",
        "J.G. Power",
        "C. Whiteford",
        "E.E. Wisniewski",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "C.E. Mitchell",
        "J. Qiang",
        "R.D. Ryne",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Beamlines capable of merging beams with different energies are critical to many applications related to advanced accelerator concepts and energy-recovery linacs (ERLs). In an ERL",
        "a low-energy \"fresh\" bright bunch is generally injected into a superconducting linac for acceleration using the fields established by a decelerated \"spent\" beam traveling on the same axis. A straight-merger system composed of a selecting cavity with a superimposed dipole magnet was proposed and recently test at AWA. This paper reports on the experimental results obtained so far along with detailed beam dynamics investigations of the merger concept and its ability to conserve the beam brightness associated with the fresh bunch."
      ],
      "institutions": [
        "Funding: NSF award PHY-1549132 to Cornell University and NIU, U.S. DOE contract DE-AC02-06CH11357 with ANL and DE-AC05-06OR23177 with JLAB."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa72_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa72.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa72_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA72",
      "page_number": "206",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA74",
      "title": "Design of a W-Band Corrugated Waveguide for Structure Wakefield Acceleration",
      "authors": [
        "B. Leung",
        "X. Lu",
        "C.L. Phillips",
        "P. Piot",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "D.S. Doran",
        "X. Lu",
        "P. Piot",
        "J.G. Power",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Current research on structure wakefield acceleration aims to develop radio-frequency structures that can produce high gradients",
        "with work in the sub-terahertz regime being particularly interesting because of the potential to create more compact and economical accelerators. Metallic corrugated waveguides at sub-terahertz frequencies are one such structure. We have designed a W-band corrugated waveguide for a collinear wakefield acceleration experiment at the Argonne Wakefield Accelerator (AWA). Using the CST Studio Suite",
        "we have optimized the structure for the maximum achievable gradient in the wakefield from a nominal AWA electron bunch at 65 MeV. Simulation results from different solvers of CST were benchmarked with each other",
        "with analytical models",
        "and with another simulation code",
        "ECHO. We are investigating the mechanical design",
        "suitable fabrication technologies",
        "and the possibility to apply advanced bunch shaping techniques to improve the structure performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa74_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa74.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa74_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA74",
      "page_number": "210",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA75",
      "title": "Machine Learning for Slow Spill Regulation in the Fermilab Delivery Ring for Mu2e",
      "authors": [
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "J.M.S. Arnold",
        "M.R. Austin",
        "J.R. Berlioz",
        "P.M. Hanlet",
        "K.J. Hazelwood",
        "M.A. Ibrahim",
        "V.P. Nagaslaev",
        "D.J. Nicklaus",
        "G. Pradhan",
        "P.S. Prieto",
        "A.L. Saewert",
        "B.A. Schupbach",
        "K. Seiya",
        "R.M. Thurman-Keup",
        "N.V. Tran",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "J. Jiang",
        "H. Liu",
        "S. Memik",
        "R. Shi",
        "M. Thieme",
        "D. Ulusel",
        "Northwestern University",
        "Evanston",
        "Illinois",
        "USA",
        "A third-integer resonant slow extraction system is being developed for the Fermilab’s Delivery Ring to deliver protons to the Mu2e experiment. During a slow extraction process",
        "the beam on target is liable to experience small intensity variations due to many factors. Owing to the experiment’s strict requirements in the quality of the spill",
        "a Spill Regulation System (SRS) is currently under design. The SRS primarily consists of three components - slow regulation",
        "fast regulation",
        "and harmonic content tracker. In this presentation",
        "we shall present the investigations of using Machine Learning (ML) in the fast regulation system",
        "including further optimizations of PID controller gains for the fast regulation",
        "prospects of an ML agent completely replacing the PID controller using supervised learning schemes such as Long Short-Term Memory (LSTM) and Gated Recurrent Unit (GRU) ML models",
        "the simulated impact and limitation of machine response characteristics on the effectiveness of both PID and ML regulation of the spill. We also present here nascent results of Reinforcement Learning efforts",
        "including continuous-action soft actor-critic methods",
        "to regulate the spill rate."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa75_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa75.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa75_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA75",
      "page_number": "214",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA76",
      "title": "Wakefield Modeling in Sub-THz Dielectric-Lined Waveguides",
      "authors": [
        "C.L. Phillips",
        "B. Leung",
        "X. Lu",
        "P. Piot",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "Dielectric-lined waveguides have been extensively studied to potentially support high-gradient acceleration in beam-driven dielectric wakefield acceleration (DWFA) and for beam manipulations. In this paper",
        "we investigate the wakefield generated by a relativistic bunch passing through a dielectric waveguide with different transverse sections. We specifically consider the case of a structure consisting of two dielectric slabs",
        "along with rectangular and square structures. Numerical simulations performed with the fine-difference time-domain of the WarpX program reveal some interesting features of the transverse wake and a possible experiment at the Argonne Wakefield Accelerator (AWA) is proposed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa76_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa76.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa76_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA76",
      "page_number": "218",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA78",
      "title": "Temporally-Shaped Ultraviolet Pulses for Tailored Bunch Generation at Argonne Wakefield Accelerator",
      "authors": [
        "T. Xu",
        "P. Piot",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "S. Carbajo",
        "R.A. Lemons",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Photocathode laser shaping is an appealing technique to generate tailored electron bunches due to its versatility and simplicity. Most photocathodes require photon energies exceeding the nominal photon energy produced by the lasing medium. A common setup consists of an infrared (IR) laser system with nonlinear frequency conversion to the ultraviolet (UV). In this work",
        "we present the numerical modeling of a temporal shaping technique capable of producing electron bunches with linearly-ramped current profiles for application to collinear wakefield accelerators. Specifically",
        "we show that controlling higher-order dispersion terms associated with the IR pulse provides some control over the UV temporal shape. Beam dynamics simulation of an electron-bunch shaping experiment at the Argonne Wakefield Accelerator is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa78_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa78.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa78_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA78",
      "page_number": "222",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA79",
      "title": "Studying the Emission Characteristics of Field Emission Cathodes with Various Geometries",
      "authors": [
        "M.R. Howard",
        "S.M. Lidia",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "The cathode test stand (CTS) at LANL is designed to hold off voltages of up to 500kV and can supply pulse durations up to 2.6 μs. Using this test stand",
        "we are able to test both field emission and photocathodes with different geometries and materials at various pulse lengths and PFN voltages. Currently",
        "the test stand is used to evaluate field emission using a velvet cathode over various pulse lengths. The CTS employs various diagnostic tools",
        "including E-dots",
        "B-dots",
        "and a scintillator coupled with a pepperpot mask in order to measure the extracted voltage",
        "current",
        "beam distribution",
        "and transverse emittance. Xenos [1] has been used to create and simulate diode geometries that permits study to optimize various beam parameters. These geometries include changing the size and recess of the cathode as well as implementing a Pierce geometry. Here",
        "we will discuss comparisons for various simulated cathodes and how changes in geometry impact given beam parameters."
      ],
      "institutions": [
        "Funding: Work supported by the NNSA of US DOE under contract 89233218CNA000001 and partially supported by the US DOE under Cooperative Agreement award number DE-SC0018362 and Michigan State University."
      ],
      "abstract": "[1] See https://www.fieldp.com/xenos.html for information about the Xenos software. reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa79_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa79.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa79_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA79",
      "page_number": "226",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA80",
      "title": "Design Study for Non-Intercepting Gas-Sheet Profile Monitor at FRIB",
      "authors": [
        "A. Lokey",
        "S.M. Lidia",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Non-invasive profile monitors offer a significant advantage for continuous",
        "online monitoring of transverse beam profile and tuning of beam parameters during operation. This is due to both the non-destructive nature of the measurement and the unique feature that some monitors have of being able to determine both transverse profiles in one measurement [1]. One method of interest for making this measurement is the use of a thin gas curtain",
        "which intercepts the beam and generates both ions and photons",
        "which can be collected at a detector situated perpendicular to the gas sheet. This study will investigate the requirements for developing such a measurement device for use at the Facility for Rare Isotope Beams (FRIB)",
        "which produces high-intensity",
        "multi charge state",
        "heavy ion beams. Included will be an initial design specifications and an analysis of alternatives between ionization and beam-induced fluorescence measurement techniques for acquiring signal from the gas sheet.",
        "[1] I. Yamada",
        "M. Wada",
        "K. Moriya",
        "et al",
        "\"High-intensity beam profile measurement using a gas sheet monitor by beam induced fluorescence detection",
        "\" Phys. Rev. Accel. Beams 24",
        "042801",
        "2021."
      ],
      "institutions": [
        "Funding: Work supported by the US Department of Energy, Office of Science, High Energy Physics under Cooperative Agreement award number DE-SC0018362 and Michigan State University."
      ],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa80_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa80.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa80_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA80",
      "page_number": "229",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA81",
      "title": "Study of Nonlinear Dynamics in the 4-D Hénon Map Using the Square Matrix Method and Iterative Methods",
      "authors": [
        "K.J. Anderson",
        "Y. Hao",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "BNL",
        "Upton",
        "New York",
        "USA"
      ],
      "institutions": [
        "Funding: Accelerator Stewardship program under award number DE-SC0019403 US Department of Energy, Office of Science, High Energy Physics under award number DE-SC0018362 and Michigan State University"
      ],
      "abstract": "The Hénon Map represents a linear lattice with a single sextupole kick. This map has been extensively studied due to its chaotic behavior. The case for the two dimensional phase space has recently been revisited using ideas from KAM theory to create an iterative process that transforms nonlinear perturbed trajectories into rigid rotations*. The convergence of this method relates to the resonance structure and can be used as an indicator of the dynamic aperture. The studies of this method have been extended to the four dimensional phase space case which introduces coupling between the transverse coordinates. *Hao, Y., Anderson, K., & Yu, L. H. (2021, August). Revisit of Nonlinear Dynamics in Hénon Map Using Square Matrix Method. https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa81_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa81.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa81_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA81",
      "page_number": "232",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA82",
      "title": "Space Charge Driven Third Order Resonance at AGS Injection",
      "authors": [
        "M.A. Balcewicz",
        "Y. Hao",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Y. Hao",
        "H. Huang",
        "C. Liu",
        "K. Zeno",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "Resonance line crossings at significant space charge tune shifts can exhibit various phenomena due to periodic resonance crossing from synchrotron motion* and manifests as halo generation and bunch shortening along with the more mundane emittance growth and beam loss. An injection experiment is conducted at the AGS using the fast wall current monitor and electron collecting Ionization Profile Monitor (eIPM) to probe third order resonances to better characterize the resonance crossing over a 4 ms time scale. This experiment shows some agreement with previous experiments",
        "save for lack of bunch shortening",
        "possibly due to relative resonance strength.",
        "* G. Franchetti et al. PRSTAB 13",
        "114203. 2010"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa82_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa82.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa82_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA82",
      "page_number": "236",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA83",
      "title": "Automation of Superconducting Cavity and Superconducting Magnet Operation for FRIB",
      "authors": [
        "W. Chang",
        "Y. Choi",
        "X.-J. Du",
        "W. Hartung",
        "S.H. Kim",
        "T. Konomi",
        "S.R. Kunjir",
        "H. Nguyen",
        "J.T. Popielarski",
        "K. Saito",
        "T. Xu",
        "S. Zhao",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The superconducting (SC) driver linac for the Facility for Rare Isotope Beams (FRIB) is a heavy-ion accelerator that accelerate ions to 200 MeV per nucleon. The linac has 46 cryomodules that contain 324 SC cavities and 69 SC solenoid packages. For linac operation with high availability and high reliability",
        "automation is essential for such tasks as fast device turn-on/off",
        "fast recovery from trips",
        "and real-time monitoring of operational performance. We have implemented several automation algorithms",
        "including one-button turn-on/off of SC cavities and SC magnets; automated degaussing of SC solenoids; mitigation of field emission-induced multipacting during recovery from cavity trips; and real-time monitoring of the cavity field level calibration. The design",
        "development",
        "and operating experience with automation will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa83_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa83.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa83_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA83",
      "page_number": "239",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA84",
      "title": "Superconducting Cavity Commissioning for the FRIB Linac",
      "authors": [
        "W. Chang",
        "W. Hartung",
        "S.H. Kim",
        "T. Konomi",
        "S.R. Kunjir",
        "J.T. Popielarski",
        "K. Saito",
        "T. Xu",
        "S. Zhao",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The superconducting driver linac for the Facility for Rare Isotope Beams (FRIB) is a heavy ion accelerator that has 46 cryomodules with 324 superconducting (SC) cavities that accelerate ions to 200 MeV per nucleon. Linac commissioning was done in multiple phases",
        "in parallel with technical installation. Ion beam have now been accelerated to the design energy through the full linac; rare isotopes were first produced in December 2021; and the first user experiment was completed in May 2022. All cryomodules were successfully commissioned. Cryomodule commissioning included establishing the desired cavity fields",
        "measuring field emission X-rays",
        "optimizing the tuner control loops",
        "measuring the cavity dynamic heat load",
        "and confirming the low-level RF control (amplitude and phase stability). Results on cryomodule commissioning and cryomodule performance will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa84_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa84.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa84_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA84",
      "page_number": "242",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA85",
      "title": "Design of a 185.7 MHz Superconducting RF Photoinjector Quarter-Wave Resonator for the LCLS-II-HE Low Emittance Injector",
      "authors": [
        "S.H. Kim",
        "W. Hartung",
        "T. Konomi",
        "S.J. Miller",
        "M.S. Patil",
        "J.T. Popielarski",
        "K. Saito",
        "T. Xu",
        "T. Xu",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "C. Adolphsen",
        "L. Ge",
        "F. Ji",
        "J.W. Lewellen",
        "L. Xiao",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "M.P. Kelly",
        "T.B. Petersen",
        "P. Piot",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "A 185.7 MHz superconducting quarter-wave resonator (QWR) was designed for the low emittance injector of the Linac Coherent Light Source high energy upgrade (LCLS-II-HE). The cavity was designed to minimize the risk of cathode efficiency degradation due to multipacting or field emission and to operate with a high RF electric field at the cathode for low electron-beam emittance. Cavity design features include: (1) shaping of the cavity wall to reduce the strength of the low-field coaxial multipacting barrier; (2) four ports for electropolishing and high-pressure water rinsing; and (3) a fundamental power coupler (FPC) port located away from the accelerating gap. The design is oriented toward minimizing the risk of particulate contamination and avoid harmful dipole components in the RF field. The ANL 162 MHz FPC design for PIP-II is being adapted for the gun cavity. We will present the RF design of the cavity integrated with the FPC. reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa85_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa85.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa85_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA85",
      "page_number": "245",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA86",
      "title": "Conditioning of Low-Field Multipacting Barriers in Superconducting Quarter-Wave Resonators",
      "authors": [
        "S.H. Kim",
        "W. Chang",
        "W. Hartung",
        "J.T. Popielarski",
        "T. Xu",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Multipacting (MP) barriers are typically observed at very low RF amplitude",
        "at a field 2 to 3 orders of magnitude below the operating gradient",
        "in low-frequency (<~100 MHz)",
        "quarter-wave resonators (QWRs). Such barriers may be troublesome",
        "as RF conditioning with a fundamental power coupler (FPC) of typical coupling strength (external Q = 106 to 107) is generally difficult. For the FRIB \\beta = 0.085 QWRs (80.5 MHz)",
        "the low barrier is observed at an accelerating gradient (Eacc) of ~10 kV/m; the operating Eacc is 5.6 MV/m. Theoretical and simulation studies suggested that the conditioning is difficult due to the relatively low RF power dissipated into multipacting rather than being a problem of the low barrier being stronger than other barriers. We developed a single-stub coaxial FPC matching element for external adjustment of the external Q by one order of magnitude. The matching element provided a significant reduction in the time to condition the low barrier. We will present theoretical and simulation studies of the low MP barrier and experimental results on MP conditioning with the single-stub FPC matching element."
      ],
      "institutions": [
        "Funding: This is based upon work supported by the U.S. Department of Energy Office of Science under Cooperative Agreement DE-SC0000661, the State of Michigan and Michigan State University."
      ],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa86_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa86.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa86_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA86",
      "page_number": "249",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA87",
      "title": "Design of the Cathode Stalk for the LCLS-II-HE Low Emittance Injector",
      "authors": [
        "T. Konomi",
        "W. Hartung",
        "S.H. Kim",
        "S.J. Miller",
        "D.G. Morris",
        "J.T. Popielarski",
        "K. Saito",
        "A. Taylor",
        "T. Xu",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "C. Adolphsen",
        "J.W. Lewellen",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "S. Gatzmaga",
        "P. Murcek",
        "R. Xiang",
        "HZDR",
        "Dresden",
        "Germany",
        "M.P. Kelly",
        "T.B. Petersen",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Superconducting radio-frequency (SRF) electron guns are attractive for delivery of beams at a high bunch repetition rate with a high accelerating field. An SRF gun is the most suitable injector for the high-energy upgrade of the Linac Coherent Light Source (LCLS-II-HE)",
        "which will produce high-energy X-rays at high repetition rate. An SRF gun is being developed for LCLS-II-HE as a collaborative effort by FRIB",
        "HZDR",
        "ANL",
        "and SLAC. The cavity operating frequency is 185.7 MHz",
        "and the target accelerating field at the photocathode is 30 MV/m. The photocathode is replaceable. The cathode is held by a fixture (’cathode stalk’) that is designed for thermal isolation and particle-free cathode exchange. The stalk must allow for precise alignment of the cathode position",
        "cryogenic or room-temperature cathode operating temperature",
        "and DC bias to inhibit multipacting. We are planning a test of the stalk to confirm that the design meets the requirements for RF power dissipation and biasing. In this presentation",
        "we will describe the cathode stalk design and RF/DC stalk test plan."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa87_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa87.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa87_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA87",
      "page_number": "253",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA88",
      "title": "FRIB and UEM LLRF Controller Upgrade",
      "authors": [
        "S.R. Kunjir",
        "E. Bernal",
        "D.G. Morris",
        "S. Zhao",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "The Facility for Rare Isotope Beams (FRIB) is developing a 644 MHz superconducting (SC) cavity for a future upgrade project. The current low level radio frequency (LLRF) controller at FRIB is not able to operate at 644 MHz. The Ultrafast Electron Microscope (UEM) laboratory within the Department of Physics at Michigan State University designed an LLRF controller based on analog RF components to operate a 1.013 GHz room temperature (RT) cavity. With requirements for improved stability",
        "performance and user controls there was a need to upgrade the analog LLRF controller. The FRIB radio frequency (RF) group designed",
        "developed and fabricated a new digital LLRF controller",
        "with high-speed serial interface between system on chip field programmable gate array and fast data converters and capable of high frequency direct sampling",
        "to meet the requirements of 644 MHz SC cavity and 1.013 GHz UEM RT cavity. This paper gives an overview of the upgraded digital LLRF controller",
        "its features",
        "improvements and preliminary test results."
      ],
      "institutions": [
        "Funding: Supported by the U.S. DOE Office of Science under Cooperative Agreement DE-SC0000661, the State of Michigan, Michigan State University and U.S. National Science Foundation grant DMR-1625181."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa88_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa88.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa88_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA88",
      "page_number": "256",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA89",
      "title": "RHIC Electron Beam Cooling Analysis Using Principle Component and Autoencoder Analysis",
      "authors": [
        "A.D. Tran",
        "Y. Hao",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "BNL",
        "Upton",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "Principal component analysis and autoencoder analysis were used to analyze the experimental data of RHIC operation with low energy RHIC electron cooling (LEReC). This is unsupervised learning which includes electron beam settings and observable during operation. Both analyses were used to gauge the dimensional reducibility of the data and to understand which features are important to beam cooling. reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa89_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa89.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa89_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA89",
      "page_number": "260",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA90",
      "title": "Relating Initial Distribution to Beam Loss on the Front End of a Heavy-Ion Linac Using Machine Learning",
      "authors": [
        "A.D. Tran",
        "Y. Hao",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "J.L. Martinez Marin",
        "B. Mustapha",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "This work demonstrates using a Neural Network and a Gaussian Process to model the ATLAS front-end. Various neural network architectures were created and trained on the machine settings and outputs to model the phase space projections. The model was then trained on a dataset",
        "with non-linear distortion",
        "to gauge the transferability of the model from simulation to machine."
      ],
      "institutions": [
        "Funding: This work was supported by a sub-reward from Argonne National Laboratory and supported by the U.S. Department of Energy, under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa90_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa90.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa90_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA90",
      "page_number": "263",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA91",
      "title": "Plasma Processing of Superconducting Quarter-Wave Resonators Using a Higher-Order Mode",
      "authors": [
        "W. Hartung",
        "W. Chang",
        "K. Elliott",
        "S.H. Kim",
        "T. Konomipresenter",
        "J.T. Popielarski",
        "K. Saito",
        "T. Xu",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The Facility for Rare Isotope Beams (FRIB) is a superconducting ion linac with acceleration provided by 104 quarter-wave resonators (QWRs) and 220 half-wave resonators (HWRs); FRIB user operations began in May 2022. Plasma cleaning is being developed as a method to mitigate possible future degradation of QWR or HWR performance: in-situ plasma cleaning represents an alternative to removal and disassembly of cryomodules for refurbishment of each cavity via repeat etching and rinsing. Initial measurements were done on a QWR and an HWR with room-temperature-matched input couplers to drive the plasma via the fundamental mode. Subsequent plasma cleaning tests were done on two additional FRIB QWRs using the fundamental power coupler (FPC) to drive the plasma. When using the FPC",
        "a higher-order mode (HOM) at 5 times the accelerating mode frequency was used to drive the plasma. Use of the HOM allowed for less mismatch at the FPC and hence lower field in the coupler relative to the cavity. A neon-oxygen gas mixture was used for plasma generation. Before and after cold tests showed a significant reduction in field emission X-rays after plasma cleaning. Results will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mopa91_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mopa91.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mopa91_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOPA91",
      "page_number": "267",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 61,
  "scrape_time": "2025-10-11 00:11:56"
}