{
  "session_info": {
    "id": "WECPL",
    "name": "WECPL - Control System Upgrades 1",
    "url": "https://proceedings.jacow.org/icalepcs2019/html/wecpl.htm"
  },
  "papers": [
    {
      "paper_id": "WECPL01",
      "title": "Status of the Control System for Fully Integrated SACLA/SPring-8 Accelerator Complex and New 3 GeV Light Source Being Constructed at Tohoku, Japan",
      "authors": [
        "T. Sugimoto",
        "N. Hosoda",
        "K. Okada",
        "M. Yamaga",
        "JASRI",
        "Hyogo",
        "Japan",
        "RIKEN SPring-8 Center",
        "Innovative Light Sources Division",
        "Hyogo",
        "Japan",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "In the SPring-8 upgrade project",
        "we plan to use the linear accelerator of SACLA as a full-energy injector to the storage ring. For the purpose of simultaneous operation of XFEL lasing and on-demand injection",
        "we developed a new control framework that inherits the concepts of MADOCA. We plan to use the same control framework for a 3 GeV light source under construction at Tohoku",
        "Japan. Messaging of the new control system is based on the MQTT protocol",
        "which enables slow control and data acquisition with sub-second response time. The data acquisition framework",
        "named MDAQ",
        "covers both periodic polling and event-synchronizing data. To ensure scalability",
        "we applied a key-value storage scheme",
        "Apache Cassandra",
        "to the logging database of the MDAQ. We also developed a new parameter database scheme",
        "that handles operational parameter sets for XFEL lasing and on-demand top-up injection. These parameter sets are combined into 60 Hz operation patterns. For the top-up injection",
        "we can select the operational pattern every second on an on-demand basis. In this paper",
        "we report an overview of the new control system and the preliminary results of the integrated operation of SACLA and SPring-8."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wecpl01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wecpl01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wecpl01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WECPL01",
      "page_number": "904",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECPL02",
      "title": "Roadmap to 100 Hz DAQ at SwissFEL: Experiences and Lessons Learned",
      "authors": [
        "T. Celcer",
        "A. Babic",
        "S.G. Ebner",
        "F. Märki",
        "L. Sala",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Providing reliable and performant Data Acquisition System (DAQ) at Free Electron Lasers (FELs) is a challenging and complex task due to the inherent characteristics of a pulsed machine and consequent need of beam synchronous shot-to-shot DAQ",
        "which enables correlation of collected data associated with each FEL pulse. We will focus on experiences gathered during the process of moving towards 100 Hz operation at SwissFEL from the perspective of beam synchronous DAQ. Given the scarce resources and challenging deadlines",
        "a lot of efforts went into managing conflicting stakeholder expectations and priorities and into allocation of time for operation support and maintenance tasks on one side and time for design and development tasks on the other side. The technical challenges we encountered have shown a great importance of having proper requirements in the early phase",
        "a well thought system design concept",
        "which considers all subsystems in the DAQ chain",
        "and a well-defined test framework for validation of recorded beam synchronous data."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wecpl02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wecpl02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wecpl02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WECPL02",
      "page_number": "909",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECPL03",
      "title": "Implementation of the Motion Control System for LCLS-II Undulators",
      "authors": [
        "M.A. Montironi",
        "C.J. Andrews",
        "H. Bassan",
        "K.R. Lauer",
        "Yu.I. Levashov",
        "H.-D. Nuhn",
        "Z.R. Wolf",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "As part of the LCLS upgrade called LCLS-II",
        "two new undulator lines were introduced: a soft X-Ray line (SXR) and a hard H-Ray line (HXR). Serving distinct purposes",
        "the two undulator lines employ different undulator designs. The SXR line is composed of 21 vertical gap",
        "horizontally polarized undulators while the HXR line is composed of 32 undulator segments designed to operate on the horizontal axis and to produce a vertically polarized beam. The HXR undulators will replace the LCLS ones and thus the control system was designed with the main goal of maximizing the re-utilization of existing hardware and software. For this purpose",
        "the motion control system based on RTEMS running on VME with Animatics SmartMotors was developed as an upgrade of the LCLS design and the cam-based undulator girder positioning system has been reused. The all new SXR undulators employ a new control system design based on Aerotech motion controllers and EPICS soft IOCs (input-output controllers). This paper describes how the most challenging motion control requirements were implemented focusing on motion synchronization",
        "K-value to gap transformation",
        "cams kinematics and calibration",
        "and user interaction."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wecpl03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wecpl03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wecpl03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WECPL03",
      "page_number": "915",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECPL04",
      "title": "Beamline Control System Upgrade Strategy for the APS-U",
      "authors": [
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "This talk will be on the beamline controls design and support philosophy used by the APS X-ray Science (XSD) Beamline Controls (BC) Group and how that impacts control system upgrade decisions for the APS-U Project. The XSD/BC philosophy is based on providing high performance",
        "long-lived",
        "and supportable solutions given limited resources. Maximizing the use of EPICS and COTS hardware are the enabling technologies that makes that philosophy sustainable. Meeting the requirements of APS-U beamlines while still abiding by a proven successful approach to control system design will be described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wecpl04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wecpl04.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wecpl04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WECPL04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WECPL05",
      "title": "Migrating to Tiny Core Linux in a Control System",
      "authors": [
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The ISIS Accelerator Controls (IAC) group currently uses a version of Microsoft Windows Embedded as its chosen Operating System (OS) for control of front-line hardware. Upgrading to the current version of the Windows Embedded OS is not possible without also upgrading hardware",
        "or changing the way software is delivered to the hardware platform. The memory requirements are simply too large to be considered a viable option. A new alternative was sought and that process led to Tiny Core Linux being selected due to its frugal memory requirements and ability to run from a RAM-disk. This paper describes the process of migrating from Windows Embedded Standard 2009 to Tiny Core Linux as the OS platform for IAC embedded hardware."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/wecpl05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/wecpl05.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/wecpl05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-WECPL05",
      "page_number": "920",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-10 18:11:11"
}