{
  "session_info": {
    "id": "WEPOST",
    "name": "WEPOST - Poster Session - Somtam",
    "url": "https://proceedings.jacow.org/ipac2022/html/wepost.htm"
  },
  "papers": [
    {
      "paper_id": "WEPOST001",
      "title": "Radiation Load Studies for Superconducting Dipole Magnets in a 10 TeV Muon Collider",
      "authors": [
        "D. Calzolari",
        "C. Carli",
        "B. Humannpresenter",
        "A. Lechner",
        "G. Lerner",
        "F. Salvat Pujol",
        "D. Schulte",
        "K. Skoufaris",
        "CERN",
        "Meyrin",
        "Switzerland",
        "TU Vienna",
        "Wien",
        "Austria",
        "Among the various future lepton colliders under study",
        "muon colliders offer the prospect of reaching the highest collision energies. Despite the promising potential of a multi-TeV muon collider",
        "the short lifetime of muons poses a severe technological challenge for the collider design. In particular",
        "the copious production of decay electrons and positrons along the collider ring requires the integration of continuous radiation absorbers inside superconducting magnets. The absorbers are needed to avoid quenches",
        "reduce the heat dissipation in the cold mass and prevent magnet failures due to long-term radiation damage. In this paper",
        "we present FLUKA shower simulations assessing the shielding requirements for high-field magnets of a 10 TeV muon collider. We quantify in particular the role of synchrotron photon emission by decay electrons and positrons",
        "which helps in dispersing the energy carried by the decay products. For comparison",
        "selected results for a 3 TeV muon collider are also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost001.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST002",
      "title": "Synchrotron Radiation Impact on the FCC-ee Arcs",
      "authors": [
        "TU Vienna",
        "Wien",
        "Austria",
        "F. Cerutti",
        "B. Humann",
        "R. Kersevan",
        "CERN",
        "Meyrin",
        "Switzerland",
        "Synchrotron radiation (SR) emitted by electron and positrons beams represents a major loss source in high energy circular colliders",
        "such as the lepton version of the Future Circular Collider (FCC-ee) at CERN. In particular",
        "for the operation mode at 182.5 GeV (above the top pair threshold)",
        "its spectrum makes it penetrate well beyond the vacuum chamber walls. In order to optimize its containment",
        "dedicated absorbers are envisaged. In this contribution we report the energy deposition studies performed with FLUKA to assess heat load",
        "time-integrated dose",
        "power density and particle fluence distribution in the machine components and the surrounding environment. Different choices for the absorber material were considered and shielding options for electronics were investigated. Furthermore",
        "possible positions for the booster ring were reviewed from the radiation exposure point of view."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST003",
      "title": "Implications of the Upgrade II of LHCb on the LHC Insertion Region 8: From Energy Deposition Studies to Mitigation Strategies",
      "authors": [
        "The University of Manchester",
        "Manchester",
        "United Kingdom",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "F. Butin",
        "F. Cerutti",
        "A. Ciccotelli",
        "L.S. Esposito",
        "B. Humannpresenter",
        "M. Wehrle",
        "CERN",
        "Meyrin",
        "Switzerland",
        "TU Vienna",
        "Wien",
        "Austria",
        "Starting from LHC Run3",
        "a first upgrade of the LHCb experiment (Upgrade I) will enable oeration with a significantly increased instantaneous luminosity in the LHC Insertion Region 8 (IR8)",
        "up to 2·1033/(cm2 s). Moreover",
        "the proposed second upgrade of the LHCb experiment (Upgrade II) aims at increasing it by an extra factor 7.5 and collecting an integrated luminosity of 400/fb by the end of Run6. Such an ambitious goal poses challenges not only for the detector but also for the accelerator components. Monte Carlo simulations represent a valuable tool to predict the implications of the radiation impact on the machine",
        "especially for future operational scenarios. A detailed IR8 model implemented by means of the FLUKA code is presented in this study. With such a model",
        "we calculated the power density and dose distributions in the superconducting coils of the LHC final focusing quadrupoles (Q1-Q3) and separation dipole (D1) and we highlight a few critical issues calling for mitigation measures. Our study addresses also the recombination dipole (D2) and the suitability of the present TANb absorber",
        "as well as the proton losses in the Dispersion Suppressor (DS) and their implications."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost003.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST007",
      "title": "Centre-of-Mass Energy in FCC-ee",
      "authors": [
        "J. Keintzel",
        "R. Tomás García",
        "F. Zimmermann",
        "CERN",
        "Meyrin",
        "Switzerland",
        "DPNC",
        "Genève",
        "Switzerland",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The Future Circular electron-positron Collider (FCC-ee) is designed for high precision particle physics experiments. This demands a precise knowledge of the beam energies",
        "obtained by resonant depolarization",
        "and from which the center-of-mass energy and possible boosts at all interaction points are then determined. At the highest beam energy mode of 182.5 GeV",
        "the energy loss due to synchrotron radiation is about 10 GeV per revolution. Hence",
        "not only the location of the RF cavities",
        "but also a precise control of the optics and understanding of beam dynamics",
        "are crucial. In the studies presented here",
        "different possible locations of the RF-cavities are considered",
        "when calculating the beam energies over the machine circumference",
        "including energy losses from crossing angles",
        "a non-homogeneous dipole distribution",
        "and an estimate of the beamstrahlung effect at the collision point."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost007.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST008",
      "title": "Optics Correction Strategy for Run 3 of the LHC",
      "authors": [
        "T.H.B. Persson",
        "F.S. Carlier",
        "A. Costa Ojeda",
        "J. Dilly",
        "V. Ferrentino",
        "E. Fol",
        "H. García Morales",
        "M. Hofer",
        "E.J. Høydalsvik",
        "J. Keintzel",
        "M. Le Garrec",
        "E.H. Maclean",
        "L. Malina",
        "F. Soubelet",
        "R. Tomás García",
        "A. Wegscheiderpresenter",
        "L. van Riesen-Haupt",
        "CERN",
        "Meyrin",
        "Switzerland",
        "UNAL",
        "Bogota D.C",
        "Colombia",
        "After almost 4 years of shutdown the LHC is again operational in 2022. Experience from the previous Long Shutdown (LS) has shown that the local errors around the triplet magnets changed significantly and it is likely we will again see different errors in 2022. In the LHC there is an interplay between the linear and the nonlinear correction which can make the corrections difficult and time-consuming to find. In this article",
        "we describe the measurements and corrections performed during the commissioning in 2022 in order to control both the linear and the nonlinear optics to high precision."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost008.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST009",
      "title": "Muon Collider Based on Gamma Factory, FCC-ee and Plasma Target",
      "authors": [
        "F. Zimmermann",
        "A. Latina",
        "CERN",
        "Meyrin",
        "Switzerland",
        "M. Antonelli",
        "M. Boscolo",
        "LNF-INFN",
        "Frascati",
        "Italy",
        "DPNC",
        "Genève",
        "Switzerland",
        "MPI-P",
        "München",
        "Germany",
        "The LEMMA-type muon collider generates muon pairs by the annihilation of 45 GeV positrons with electrons at rest. Due to the small cross section",
        "an extremely high rate of positrons is required",
        "which could be achieved by a ’Gamma factory’ based on the LHC. Other challenges with the LEMMA-type muon production scheme include the emittance preservation of muons and muon-generating positrons upon multiple traversals through a target",
        "and the merging of many separate muon bunchlets. These two challenges may potentially be overcome by (1) operating the FCC-ee booster with a barrier bucket and induction acceleration",
        "so that all positrons of a production cycle are merged into one single superbunch instead of storing ~10",
        "000 separate bunches; and (2) sending the positron superbunch into a plasma target. During the passage of the positron superbunch",
        "the electron density is enhanced 100–1000 fold without any increase in the density of nuclei",
        "so that beamstrahlung and Coulomb scattering are essentially absent. We investigate prospects and difficulties of this approach",
        "including emittance growth due to filamentation in the nonlinear plasma channel and due to positron self-modulation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost009.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST010",
      "title": "Controlling e⁺/e⁻ Circular Collider Bunch Intensity by Laser Compton Scattering",
      "authors": [
        "CERN",
        "Meyrin",
        "Switzerland",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "In the future circular electron-positron collider \"FCC-ee\"",
        "the intensity of colliding bunches must be tightly controlled",
        "with a maximum charge imbalance between collision partner bunches of less than 3-5%. Laser Compton back scattering could be used to adjust and fine-tune the bunch intensity. We discuss a possible implementation and suitable laser parameters."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST011",
      "title": "Studies on Top-Up Injection into the FCC-ee Collider Ring",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost011.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST012",
      "title": "Feasibility of Slow-Extracted High-Energy Ions From the CERN Proton Synchrotron for CHARM",
      "authors": [
        "M.A. Fraser",
        "P.A. Arrutia Sota",
        "K. Biłko",
        "N. Charitonidis",
        "S. Danzecapresenter",
        "M. Delrieux",
        "M. Duraffourg",
        "N. Emriskova",
        "L.S. Esposito",
        "R. García Alía",
        "A. Guerrero",
        "O. Hans",
        "G.I. Imesch",
        "E.P. Johnson",
        "G. Lerner",
        "I. Ortega Ruiz",
        "G. Pezzullo",
        "D. Prelipcean",
        "F. Ravotti",
        "F. Roncarolo",
        "A. Waets",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The CHARM High-energy Ions for Micro Electronics Reliability Assurance (CHIMERA) working group at CERN is investigating the feasibility of delivering high energy ion beams to the CHARM facility for the study of radiation effects to electronics components engineered to operate in harsh radiation environments",
        "such as space or high-energy accelerators. The Proton Synchrotron has the potential of delivering the required high energy and high-Z (in this case",
        "Pb) ions for radiation tests over the relevant range of Linear Energy Transfer of ~ 10 - 40 MeV cm2/mg with a > 1 mm penetration depth in silicon",
        "specifically for single event effect tests. This contribution summarises the working group’s progress in demonstrating the feasibility of variable energy slow extraction and over a wide range of intensities. The results of a dedicated 6 GeV/u Pb ion beam test are reported to understand the performance limitations of the beam instrumentation systems needed to characterise the beam in CHARM."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost012.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST013",
      "title": "Exploitation of Crystal Shadowing via Multi-Crystal Array, Optimisers and Reinforcement Learning",
      "authors": [
        "F.M. Velotti",
        "M. Di Castro",
        "L.S. Esposito",
        "M.A. Fraser",
        "S.S. Gilardoni",
        "B. Goddard",
        "V. Kain",
        "E. Matheson",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The CERN Super Proton Synchrotron (SPS) routinely delivers proton and heavy ion beams to the North experimental Area (NA) in the form of 4.8 s spills. To produce such a long flux of particles",
        "resonant third integer slow extraction is used",
        "which",
        "by design",
        "foresees primary beam lost on the electrostatic septum wires to separate circulating from extracted beam. Shadowing with thin bent crystal has been proposed and successfully tested in the SPS",
        "as detailed in *. In 2021",
        "a thin crystal was used for physics production showing results compatible with what measured during early testing. In this paper",
        "the results from the 2021 physics run are presented also comparing particle losses at extraction with previous operational years. The setting up of the crystal using numerical optimisers is detailed",
        "with possible implementation of reinforcement learning (RL) agents to improve the setting up time. Finally",
        "the full exploitation of crystal shadowing via multi-array crystals is discussed",
        "together with the performance reach in the SPS.",
        "F.Velotti",
        "et. al",
        "\"Septum shadowing by means of a bent crystal to reduce slow extraction beam loss\"",
        "Phys. Rev. Accel. Beams 22",
        "093502 - Published 27 September 2019"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost013.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST014",
      "title": "Studies on Pre-Computation of SPS-to-LHC Transfer Line Corrections",
      "authors": [
        "C. Bracco",
        "F.M. Velottipresenter",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The injection process in the LHC gives a non-negligible contribution to the turnaround time between two consecutive physics fills. Mainly due to orbit drifts in the SPS",
        "the steering of the SPS-to-LHC transfer lines (TL) had to be regularly performed in view of minimising injection oscillations and losses",
        "which otherwise would trigger beam dumps. Moreover",
        "for machine protection purposes",
        "a maximum of twelve bunches had to be injected after any TL steering to validate the actual applied corrections. This implied at several occasions the need to interrupt a fill to steer the lines and introduced a further delay between fills. Studies were performed to evaluate the option of pre-calculating the required TL corrections based on SPS orbit measurements during the LHC magnet ramp down and the reconstruction of the beam position and angle at the SPS extraction point."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost014.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST015",
      "title": "Implementation of a Tune Sweep Slow Extraction with Constant Optics at MedAustron",
      "authors": [
        "P.A. Arrutia Sota",
        "M.A. Fraser",
        "B. Goddard",
        "V. Kain",
        "F.M. Velottipresenter",
        "CERN",
        "Meyrin",
        "Switzerland",
        "JAI",
        "Oxford",
        "United Kingdom",
        "QST Rokkasho",
        "Aomori",
        "Japan",
        "F. Kuehteubl",
        "M.T.F. Pivi",
        "D.A. Prokopovich",
        "EBG MedAustron",
        "Wr. Neustadt",
        "Austria",
        "Conventional slow extraction driven by a tune sweep perturbs the optics and changes the presentation of the beam separatrix to the extraction septum during the spill. The constant optics slow extraction (COSE) technique",
        "recently developed and deployed operationally at the CERN Super Proton Synchrotron to reduce beam loss on the extraction septum",
        "was implemented at MedAustron to facilitate extraction with a tune sweep of operational beam quality. COSE fixes the optics of the extracted beam by scaling all machine settings with the beam rigidity following the extracted beam’s momentum. In this contribution the implementation of the COSE extraction technique is described before it is compared to the conventional tune sweep and operational betatron core driven cases using both simulations and recent measurements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost015.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST016",
      "title": "Development of Collimation Simulations for the FCC-ee",
      "authors": [
        "A. Abramov",
        "R. Bruce",
        "M. Hoferpresenter",
        "G. Iadarola",
        "S. Redaelli",
        "CERN",
        "Meyrin",
        "Switzerland",
        "F.S. Carlier",
        "T. Pieloni",
        "M. Rakic",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "ESRF",
        "Grenoble",
        "France",
        "A collimation system is under study for the FCC-ee to protect the machine from the multi-MJ electron and positron beams and limit the backgrounds to the detectors. One of the key aspects of the collimation system design is the setup of simulation studies combining particle tracking and scattering in the collimators. The tracking must include effects important for electron beam single-particle dynamics in the FCC-ee",
        "such as synchrotron radiation. For collimation",
        "an aperture model and particle-matter interactions for electrons are required. There are currently no established simulation frameworks that include all the required features. The latest developments of an integrated framework for multi-turn collimation studies in the FCC-ee are presented. The framework is based on an interface between tracking codes",
        "pyAT and Xtrack",
        "and a particle-matter interaction code",
        "BDSIM",
        "based on Geant4. Promising alternative simulation codes and frameworks are also discussed. The challenges are outlined",
        "and the first results are presented",
        "including preliminary loss maps for the FCC-ee."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost016.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST017",
      "title": "Design of a Collimation Section for the FCC-ee",
      "authors": [
        "M. Hofer",
        "A. Abramov",
        "R. Bruce",
        "K. Oide",
        "F. Zimmermann",
        "CERN",
        "Meyrin",
        "Switzerland",
        "M. Moudgalya",
        "T. Pieloni",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "KEK",
        "Ibaraki",
        "Japan",
        "The design parameters of the FCC-ee foresee operation with a total stored beam energy of about 20 MJ",
        "exceeding those of previous lepton colliders by almost two orders of magnitude. Given the inherent damage potential",
        "a halo collimation system is studied to protect the machine hardware",
        "in particular superconducting equipment such as the final focus quadrupoles",
        "from sudden beam loss. The different constraints that led to dedicating one straight section to collimation will be outlined. In addition",
        "a preliminary layout and optics for a collimation insertion are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost017.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST018",
      "title": "Power Deposition Studies for Crystal-Based Heavy Ion Collimation in the LHC",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost018.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST019",
      "title": "Benchmarks of Energy Deposition Studies for Heavy-Ion Collimation Losses at the LHC",
      "authors": [
        "J.B. Potoine",
        "R. Bruce",
        "R. Cai",
        "P.D. Hermes",
        "A. Lechner",
        "S. Redaelli",
        "A. Waets",
        "CERN",
        "Meyrin",
        "Switzerland",
        "IES",
        "Montpellier",
        "France",
        "During some periods in its second physics run (2015-2018)",
        "the LHC has been operated with 208Pb82+ ion beams at an energy of 6.37 ZTeV. The LHC is equipped with a betatron collimation system",
        "which intercepts the transverse beam halo and protects sensitive equipment such as superconducting magnets against beam losses. However",
        "hadronic fragmentation and electromagnetic dissociation of heavy ions in collimators generate off-rigidity particles",
        "which can be lost in the downstream dispersion suppressor",
        "putting the magnets at risk to quench. An accurate modelling of the beam-induced energy deposition in the collimation system and superconducting magnets is important for quantifying possible performance limitations arising from magnet quenches. In this paper",
        "we compare FLUKA shower simulations against beam loss monitor measurements recorded during the 2018 208Pb82+ run. In particular",
        "we investigate fast beam loss events",
        "which lead to recurring beam aborts in 2018 operation. Based on these studies",
        "we assess the ability of the simulation model to reproduce the observed loss patterns in the collimation region and dispersion suppressor."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost019.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST020",
      "title": "EIC Hadron Spin Rotators",
      "authors": [
        "V. Ptitsyn",
        "J.S. Berg",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "The Electron-Ion Collider in BNL will collide polarized electrons with polarized protons or polarized 3He ions. Spin rotators will be used to create the longitudinal beam polarization at a location of the EIC experimental detector. Helical spin rotators utilized for polarized proton operation in present RHIC will be reused in the EIC Hadron Storage Ring. However",
        "due to a significant difference of EIC and RHIC interaction region layouts",
        "the EIC spin rotator arrangement has several challenges. Turning on the EIC spin rotators may lead to a significant spin tune shift. To prevent beam depolarization during the spin rotator turn-on",
        "Siberian Snakes have to be tuned simultaneously with rotators. The EIC spin rotators must be able to operate in a wide energy range for polarized protons and polarized 3He ions. The paper presents the challenges of spin rotator usage in the EIC and remedies assuring the successful operation with the rotators."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost020.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST021",
      "title": "Theoretical Study of Laser Energy Absorption Towards Energetic Proton and Electron Sources",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost021.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST023",
      "title": "Design of a Very Low Energy Beamline for NA61/SHINE",
      "authors": [
        "C.A. Mussolini",
        "N. Charitonidis",
        "CERN",
        "Meyrin",
        "Switzerland",
        "P. Burrows",
        "C.A. Mussolini",
        "JAI",
        "Oxford",
        "United Kingdom",
        "P. Burrows",
        "C.A. Mussolini",
        "Oxford University",
        "Physics Department",
        "Oxford",
        "Oxon",
        "United Kingdom",
        "Colorado University at Boulder",
        "Boulder",
        "Colorado",
        "USA",
        "CIPS",
        "Boulder",
        "Colorado",
        "USA",
        "A new",
        "low-energy branch is being designed for the H2 beamline at the CERN North Experimental Area. This new low-energy branch would extend the capabilities of the current infrastructure enabling the study of particles in the low",
        "1 - 13 GeV/c",
        "momentum range. The first experiment to profit from this new line will be NA61/SHINE (SPS Heavy Ion and Neutrino Experiment)",
        "a multi-purpose experiment studying hadron production in hadron-proton",
        "hadron-nucleus and nucleus-nucleus collisions at the SPS. However",
        "other future fixed target experiments or test-beam experiments installed in the downstream zones could also benefit from the low-energy particles provided. The proposed layout and expected performance of this line",
        "along with estimates of particle rates",
        "and considerations on the technical implementation of the beamline are presented in this contribution. A description on the instrumentation",
        "which will enable particle-by-particle tagging",
        "crucial for the experiments scope",
        "is also discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost023.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST024",
      "title": "Physics Beyond Colliders: The Conventional Beams Working Group",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost024.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST025",
      "title": "A High Power Prototype of a Harmonic Kicker Cavity",
      "authors": [
        "G.-T. Park",
        "G.A. Grose",
        "J. Guopresenter",
        "A. OBrien",
        "R.A. Rimmer",
        "H. Wang",
        "R.S. Williams",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "A harmonic kicker",
        "a beam exchange device that can deflect the beam at an ultra-fast time scale (a few ns)",
        "has been developed in Jefferson Lab *",
        "**. The high power prototype that can deliver more than a 100 kV kick at 7 kW was fabricated. The RF performance of cavity such as the harmonic resonant frequencies",
        "kick profiles",
        "it’s stability",
        "and electric center is tested at bench. The cavity will eventually be tested with a beam at Upgraded Injector Test Facility (UITF) in Jefferson Lab. In this paper",
        "we report some features of fabrication and bench test results. We also briefly describe our beam test plan in the future.",
        "* G.Park",
        "H.Wang",
        "R.A.Rimmer",
        "S. Wang",
        "and J.Guo",
        "THP092",
        "Proceedings of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost025.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST026",
      "title": "Conceptual Design of the FCC-ee Beam Dumping System",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost026.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST029",
      "title": "First Start-to-End Simulations of the 6 GeV Laser-Plasma Injector at DESY",
      "authors": [
        "S.A. Antipov",
        "I.V. Agapov",
        "R. Brinkmann",
        "Á. Ferran Pousa",
        "M.A. Jebramcik",
        "A. Martinez de la Ossa",
        "M. Thévenet",
        "DESY",
        "Hamburg",
        "Germany",
        "DESY is studying the feasibility of a 6 GeV laser-plasma injector for top-up operation of its future flagship synchrotron light source PETRA IV. A potential design of such an injector involves a single plasma stage",
        "a beamline for beam capture and phase space manipulation",
        "and a X-band rf energy compressor. Numerical tracking with realistic beam distributions shows that an energy variation below 0.1%",
        "rms and a transverse emittance about 1 nm-rad",
        "rms can be achieved under realistic timing",
        "energy",
        "and pointing jitters. PETRA IV injection efficiency studies performed with a conservative 5% beta-beating indicate negligible beam losses for the simulated beams during top-up. Provided the necessary progress on high-power lasers and plasma cells",
        "the laser plasma injector could become a competitive alternative to the conventional injector chain."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost029.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST030",
      "title": "Multitask Optimization of Laser-Plasma Accelerators Using Simulation Codes with Different Fidelities",
      "authors": [
        "Á. Ferran Pousa",
        "M. Kirchen",
        "A. Martinez de la Ossa",
        "M. Thévenet",
        "DESY",
        "Hamburg",
        "Germany",
        "S.T.P. Hudson",
        "J.M. Larson",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "A. Huebl",
        "R. Lehé",
        "J.-L. Vay",
        "LBNL",
        "Berkeley",
        "USA",
        "University of Hamburg",
        "Hamburg",
        "Germany",
        "When designing a laser-plasma acceleration experiment",
        "one commonly explores the parameter space (plasma density",
        "laser intensity",
        "focal position",
        "etc.) with simulations in order to find an optimal configuration that",
        "for example",
        "minimizes the energy spread or emittance of the accelerated beam. However",
        "laser-plasma acceleration is typically modeled with full particle-in-cell (PIC) codes",
        "which can be computationally expensive. Various reduced models can approximate beam behavior at a much lower computational cost. Although such models do not capture the full physics",
        "they could still suggest promising sets of parameters to be simulated with a full PIC code and thereby speed up the overall design optimization. In this work we automate such a workflow with a Bayesian multitask algorithm",
        "where each task has a different fidelity. This algorithm learns from past simulation results from both full PIC codes and reduced PIC codes and dynamically chooses the next parameters to be simulated. We illustrate this workflow with a proof-of-concept optimization using the Wake-T and FBPIC codes. The libEnsemble library is used to orchestrate this workflow on a modern GPU-accelerated high-performance computing system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost030.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST031",
      "title": "RHIC Polarized Proton Operation in Run 22",
      "authors": [
        "V. Schoefer",
        "E.C. Aschenauer",
        "D. Bruno",
        "K.A. Drees",
        "W. Fischer",
        "C.J. Gardner",
        "K. Hockpresenter",
        "H. Huang",
        "R.L. Hulsart",
        "C. Liu",
        "Y. Luo",
        "I. Marneris",
        "G.J. Marr",
        "A. Marusic",
        "F. Méot",
        "K. Mernick",
        "R.J. Michnoff",
        "M.G. Minty",
        "J. Morris",
        "A. Poblaguev",
        "V. Ptitsyn",
        "V.H. Ranjbar",
        "D. Raparia",
        "G. Robert-Demolaize",
        "J. Sandberg",
        "W.B. Schmidke",
        "F. Severino",
        "T.C. Shrey",
        "P. Thieberger",
        "J.E. Tuozzolo",
        "M. Valette",
        "K. Yip",
        "A. Zaltsman",
        "A. Zelenski",
        "K. Zeno",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "The Relativistic Heavy Ion Collider (RHIC) Run 22 physics program consisted of collisions with vertically po- larized proton beams at a single collision point (the STAR detector). During initial startup of the collider",
        "power out- ages damaged two of the coils in one of the RHIC helical dipole snake magnets used for polarization preservation in the Blue ring. That snake was reconfigured for use as a partial snake. We will outline some of the remediating mea- sures taken to maximize polarization transmission in this configuration. These measures included changing the col- liding beam energy from 255 GeV to 254.2 GeV to adjust the spin closed orbit at store and adjustment of the field in the other helical dipole in the Blue ring to improve injection spin matching. Later in the run",
        "the primary motor gener- ator for the AGS (the injector to RHIC) failed and a lower voltage backup had to be used",
        "resulting in a period of lower polarization. Other efforts include detailed measurement of the stable spin direction at store and the commissioning of a machine protection relay system to prevent spurious firing of the RHIC abort kickers."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost031.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST032",
      "title": "Status Report of the 50 MeV LPA-Based Injector at ATHENA for a Compact Storage Ring",
      "authors": [
        "E. Panofski",
        "C. Braun",
        "J. Dirkwinkel",
        "J.B. Gonzalez",
        "T. Hülsenbusch",
        "A.R. Maier",
        "J. Osterhoff",
        "G. Palmer",
        "P.A. Walker",
        "P. Winkler",
        "DESY",
        "Hamburg",
        "Germany",
        "E. Bründermann",
        "B. Härer",
        "A.-S. Müller",
        "A.I. Papash",
        "C. Widmann",
        "KIT",
        "Karlsruhe",
        "Germany",
        "T.F.J. Eichner",
        "L. Hübner",
        "S. Jalas",
        "L. Jeppe",
        "M. Kirchen",
        "P. Messner",
        "M. Schnepp",
        "M. Trunk",
        "C.M. Werle",
        "University of Hamburg",
        "Hamburg",
        "Germany",
        "M. Kaluza",
        "A. Sävert",
        "HIJ",
        "Jena",
        "Germany",
        "Laser-based plasma accelerators (LPA) have successfully demonstrated their capability to generate high-energy electron beams with intrinsically short bunch lengths and high peak currents at a setup with a small footprint. These properties make them attractive drivers for a broad range of different applications including injectors for rf-driven",
        "ring-based light sources. In close collaboration the Deutsches Elektronen-Synchrotron (DESY)",
        "the Karlsruhe Institute of Technology (KIT) and the Helmholtz Institute Jena aim to develop a 50 MeV plasma injector and demonstrate the injection into a compact storage ring. This storage ring will be built within the project cSTART at KIT. As part of the ATHENA (Accelerator Technology HElmholtz iNfrAstructure) project",
        "DESY will design",
        "setup and operate a 50 MeV plasma injector prototype for this endeavor. This contribution gives a status update of the 50 MeV LPA-based injector and presents a first layout of the prototype design at DESY in Hamburg."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost032.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST034",
      "title": "Magnetic Characterization of a Superconducting Transverse Gradient Undulator for Compact Laser Wakefield Accelerator-Driven FELs",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost034.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST035",
      "title": "Spectroscopic Measurements as Diagnostic Tool for Plasma-Filled Capillaries",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost035.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST039",
      "title": "Mapping Charge Capture and Acceleration in a Plasma Wakefield of a Proton Bunch Using Variable Emittance Electron Beam Injection",
      "authors": [
        "E. Granados",
        "A.-M. Bachmann",
        "E. Chevallay",
        "S. Döbert",
        "V.N. Fedosseev",
        "F. Friebel",
        "S.J. Gessner",
        "E. Gschwendtner",
        "S.Y. Kim",
        "S. Mazzoni",
        "M. Turner",
        "L. Verra",
        "CERN",
        "Meyrin",
        "Switzerland",
        "A.-M. Bachmann",
        "L. Verra",
        "MPI",
        "Muenchen",
        "Germany",
        "UNIST",
        "Ulsan",
        "Republic of Korea",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "MPI-P",
        "München",
        "Germany",
        "In the Phase 2 of the AWAKE first experimental run (from May to November 2018)",
        "an electron beam was used to probe and test proton-driven wakefield accelera-tion in a rubidium plasma column. The witness electron bunches were produced using an RF-gun equipped with a Cs2Te photocathode illuminated by a tailorable ultrafast ultraviolet (UV) laser pulse. The construction of the UV beam optical system enabled appropriate transverse beam shaping and control of its pulse duration",
        "size",
        "and position on the photocathode",
        "as well as time delay with respect to the ionizing laser pulse that seeds the plasma wakefields in the proton bunches. Variable photocathode illumination provided the required flexibility to produce electron bunches with variable charge",
        "emittance",
        "and injection trajectory into the plasma column. In this work",
        "we analyze the overall charge capture and shot-to-shot reproducibility of the proton-driven plasma wakefield accelerator with various UV illumination and electron bunch injection parameters."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost039.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST040",
      "title": "Comparing Methods of Recovering Gamma Energy Distributions from PEDRO Spectrometer Responses",
      "authors": [
        "M.H. Oruganti",
        "B. Naranjo",
        "J.B. Rosenzweig",
        "M. Yadavpresenter",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "To calculate the energy levels of the photons emitted from high-energy particle interactions",
        "the new pair spectrometer (PEDRO) channels the photons through several Beryllium nuclear fields to produce electron-positron pairs through the nuclear field interaction. This project compared several methods of reconstruction and determined which best predicts original energy distributions based on simulated spectra. These methods included using Maximum Likelihood Estimation",
        "Machine Learning",
        "and directly analyzing a response matrix that modeled PEDRO’s response to any photon energy distribution. We report that performing the direct analysis",
        "also known as QR decomposition",
        "on a PEDRO-generated spectrum provides by far the most accurate calculation of the spectrum’s original energy distribution. These methods were tested against results from experimental cases",
        "including Nonlinear Compton Scattering and Filamentation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost040.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST041",
      "title": "Physical Aspects of Collinear Laser Injection at SLAC FACET-II E-310: Trojan Horse Experiment",
      "authors": [
        "M. Yadav",
        "Ö. Apsimon",
        "E. Kukstas",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "C.E. Hansel",
        "P. Manwani",
        "B. Naranjo",
        "J.B. Rosenzweig",
        "UCLA",
        "Los Angeles",
        "USA",
        "USTRAT/SUPA",
        "Glasgow",
        "United Kingdom",
        "The Facility for Advanced Accelerator Experimental Tests (FACET-II) is a test accelerator infrastructure at SLAC dedicated to the research and development of advanced accelerator technologies. We performed simulations of electron beam driven wakefields",
        "with collinear lasers used for ionization injection of electrons. We numerically generated a witness beam using the OSIRIS code in an up ramp plasma as well as uniform plasma regimes. We report on challenges and details of the E-310 experiment which aims to demonstrate this plasma photocathode injection at FACET-II. We examine the phenomena beam hosing and drive beam depletion. Details of the witness beam generated are discussed. Computation of betatron-radiation X-ray spatial distribution and critical energy are done for FACET-II low emittance beams."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost041.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST042",
      "title": "Radiation Diagnostics for AWA and FACET-II Flat Beams in Plasma",
      "authors": [
        "M. Yadav",
        "Ö. Apsimon",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "H.S. Ancelin",
        "G. Andonian",
        "P. Manwani",
        "J.B. Rosenzweig",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "In energy beam facilities like FACET and AWA",
        "beams with highly asymmetric emittance are of interest because they are the preferred type of beam for linear colliders. That is ultimately the motivation: building a plasma based LC. In this case",
        "the blowout region is no longer symmetric around an axis is not equal in the two transverse planes. Focusing is required to keep the particles within the tight apertures and characterizing these accelerators shows the benefits of employing ultra low beam emittances. Beams with high charge and high emittance ratios in excess of 100:1 are available at AWA. If the focusing will not be equal",
        "then we will have different radiation signatures for the flat and symmetric beams in plasma. We use OSIRIS particle-in-cell codes to compare various scenarios including a weak blowout and a strong blowout. Further",
        "we determine the radiation generated in the system by importing particle trajectories into a Liénard Weichert code. We discuss future steps towards full diagnostics of flat beams using radiation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost042.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST043",
      "title": "An Effective-Density Model for Accelerating Fields in Laser-Graphene Interactions",
      "authors": [
        "C. Bonțoiu",
        "Ö. Apsimon",
        "E. Kukstas",
        "C.P. Welsch",
        "M. Yadavpresenter",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "Universidade Federal de Ciências da Saúde de Porto Alegre",
        "Porto Alegre",
        "Brazil",
        "ICMUV",
        "Paterna",
        "Spain",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "With the advancement of high-power UV laser technology",
        "the use of nanostructures for particle acceleration attracts renewed interest due to its possibility of achieving TV/m accelerating gradients in solid state plasmas. Electron acceleration in ionized materials such as carbon nanotubes and graphene is currently considered as a potential alternative to the usual laser wakefield acceleration (LWFA) schemes. An evaluation of the suitability of a graphene target for LWFA can be carried out using an effective density model",
        "thus replacing the need to model each layer. We present a 2D evaluation of the longitudinal electric field driven by a short UV laser pulse in a multi-layer graphene structure",
        "showing that longitudinal fields of ~5 TV/m are achievable."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost043.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST045",
      "title": "Simulating Enhanced Focusing Effects of Ion Motion in Adiabatic Plasmas",
      "authors": [
        "D.R. Chow",
        "C.E. Hansel",
        "P. Manwanipresenter",
        "J.B. Rosenzweig",
        "M. Yadav",
        "UCLA",
        "Los Angeles",
        "USA",
        "Ö. Apsimon",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "The FACET-II facility offers the unique opportunity to study low emittance",
        "GeV beams and their interactions with high density plasmas in plasma wakefield acceleration (PWFA) scenarios. One of the experiments relevant to PWFA research at FACET-II is the ion collapse experiment E-314",
        "which aims to study how ion motion in a PWFA can produce dual-focused equilibrium. As nonlinear focusing effects due to nonuniform ion distributions have not been extensively studied; we explore the difficulties of inducing ion motion in an adiabatic plasma and examines the effect an ion column has on beam focusing. A case study is performed on a system containing a plasma lens and adiabatic PWFA. Ions in the lens section are assumed to be static",
        "while simulations of an adiabatic matching section are modified to include the effects of ion column collapse and their nonlinear focusing fields. Using the parameters of the FACET-II beam",
        "we find that a collapsed ion column amplifies the focusing power of a plasma without compromising emittance preservation. This led to a spot size orders of magnitude less than that of a simply matched beam."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost045.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST046",
      "title": "Beam Matching in an Elliptical Plasma Blowout Driven by Highly Asymmetric Flat Beams",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost046.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST048",
      "title": "Excitation of Very High Gradient Plasma Wakefields From Nanometer Scale Beams",
      "authors": [
        "P. Manwani",
        "H.S. Ancelin",
        "G. Andonian",
        "D.R. Chow",
        "N. Majernik",
        "J.B. Rosenzweig",
        "M. Yadav",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "RadiaBeam",
        "Marina del Rey",
        "California",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost048.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST050",
      "title": "Further Measurements of Beam-Beam Interactions in a Gear-Changing System in DESIREE",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "A. Källberg",
        "A. Simonsson",
        "Stockholm University",
        "Stockholm",
        "Sweden",
        "In this work we detail experiments performed on a gear-changing system using the Double ElectroStatic Ion Ring ExpEriment (DESIREE). A gear-changing system is one where there are different harmonic numbers in each ring. This experiment used carbon and nitrogen beams in a 4 on 3 gear-changing arrangement",
        "with the last bunch of each left off. The bunch length can be measured and synchrotron motion detected. We performed this measurement on three different values of carbon current",
        "and present the differences in the bunch length frequency spectrum here",
        "which correspond to twice the synchrotron frequencies."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost050.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST052",
      "title": "Influence of Plasma Electrode Aperture Size on Beam Emittance From a Multicusp Ion Source",
      "authors": [
        "A.M. George",
        "M.P. Dehnel",
        "S.V. Melanson",
        "J.J. Munichpresenter",
        "D-Pace",
        "Nelson",
        "British Columbia",
        "Canada",
        "University of Auckland",
        "Auckland",
        "New Zealand",
        "D-Pace’s TRIUMF-licensed multicusp filament ion source is capable of producing H− beams up to 17.4 mA*. In most cases",
        "the H− beam is transported to the entrance of an accelerator or a magnet for further applications. The emittance of the beam extracted from the ion source should be maintained as low as possible to reduce the beam losses to the walls of the transport pipes. The beam emittance from the ion source can be controlled by changing the aperture diameter of the plasma electrode. The current study deals with the range of H− beam emittance that can be achieved from D-Pace’s filament ion source",
        "using different plasma electrode aperture sizes. The corresponding beam currents and the electron to ion ratios are also reported.",
        "* Melanson",
        "S.",
        "M. Dehnel",
        "D. Potkins",
        "H. McDonald",
        "and C. Philpott. \"H-",
        "D-",
        "C2-: a comparison of RF and filament powered volume-cusp ion sources.\" Ele 5 (2017): 10."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost052.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOST053",
      "title": "Extraction of High-Charge State Argon and α-Particles from D-Pace Penning Ion Source Test Stand",
      "authors": [
        "UBC",
        "Vancouver",
        "B.C.",
        "Canada",
        "M.P. Dehnel",
        "J.J. Munichpresenter",
        "D-Pace",
        "Nelson",
        "British Columbia",
        "Canada",
        "At D-Pace’s Ion Source Test Facility (ISTF)",
        "we measure the extracted current of high-charge state ions from a hot cathode Penning ion source. Producing high-charge states of Boron",
        "Arsenic",
        "and Phosphorous is of interest to the ion implantation community. Higher-charge states allow these doping agents to be accelerated to higher energies within the same accelerating electric fields. When used for doping silicon semiconductors",
        "this allows for deeper implantation of the ions. We use Argon and Helium gas as a proxy to determine whether the Penning ion source could be used for this application as it is less toxic to work with. The ability to reach charge states of greater than 4+ with Argon and 1+ with Helium leads to the possibility of producing highe-charge states of ions used in the ion implantation industry. This paper shows the extracted beam currents of Ar3+ - Ar6+ and alpha-ions for the hot cathode Penning ion source with variations in the confining magnetic field (0.4 - 0.95 T)",
        "gas flow (0.3 - 10 sccm)",
        "and arc discharge current (1 - 3 A)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/wepost053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/wepost053.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/wepost053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEPOST053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 39,
  "scrape_time": "2025-10-10 18:40:24"
}