{
  "session_info": {
    "id": "TUPD",
    "name": "TUPD - XFELs / Seeding and Seeded FELs / FEL Technology -2-",
    "url": "https://proceedings.jacow.org/FEL2012/html/tupd.htm"
  },
  "papers": [
    {
      "paper_id": "TUPD03",
      "title": "Preliminary FEL Simulation Study for PAL XFEL",
      "authors": [
        "I. Hwang",
        "J.H. Han",
        "Y.W. Parc",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "POSTECH",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea"
      ],
      "institutions": [
        "Pohang Accelerator Laboratory X-ray Free Electron Laser (PAL XFEL) will provide X-ray FEL radiation in a range of 0.1 and 10nm with five undulator beamlines. A undulator section for hard X-ray is designed for 0.1nm SASE FEL. The wakefield effect and its cure by tapering are investigated by tracking simulation. We present FEL simulation study by using GENESIS"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd03.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD03",
      "page_number": "229",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD05",
      "title": "Sensitivities of FEL Parameters in",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd05.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD05",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD07",
      "title": "Generation of Longitudinally Coherent Ultra High Power X-Ray FEL Pulses by Phase and Amplitude Mixing",
      "authors": [
        "J. Wu",
        "C. Pellegrini",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "We study an improved-SASE (iSASE) scheme to generate narrow bandwidth Free Electron Laser (FEL) by introducing phase shifter between the undulator segments to speed up the slippage. Due to the shift of the FEL pulse with respect to the electron bunch",
        "spikes with phase relation develop; therefore the coherent length increases faster. Furthermore",
        "due to the similarity of these spikes in the temporal domain with respect to the spikes generated in the previous sections",
        "the spectrum of such an FEL containing a regular temporal spike train is intrinsically narrower than that of a conventional SASE FEL. Here",
        "we report study results for a soft x-ray FEL at 6 nm and a hard x-ray at 0.15 nm. With a narrower bandwidth",
        "the FEL responds to a tapered undulator more efficiently than a conventional SASE FEL does. This then make it possible to reach high power. Analysis is carried out with GENESIS numerical simulation as well as 1-D analytical calculation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd07.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD07",
      "page_number": "237",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD08",
      "title": "Tolerances for a Seeded Free Electron Laser",
      "authors": [
        "J. Wu",
        "T.O. Raubenheimer",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Tolerance and stability are important issues for designing and operating accelerator and FEL. Jitter can come from various sources. We identify and study well known sources as well as some particular ones",
        "important for a seeded tapered high power FEL. Seed laser phase error",
        "electron bunch current profile",
        "self-seeding residual density bunching and energy modulation after the chicane",
        "undulator wakefield",
        "and phase errors in the undulator breaks are just a few important examples. Schemes to improve the stability of a seeded FEL are also discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd08.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD08",
      "page_number": "241",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD10",
      "title": "Status of Polarization Control Experiment at Shanghai Deep Ultraviolet Free Electron Laser",
      "authors": [
        "H.X. Deng",
        "J.H. Chen",
        "Z.M. Dai",
        "Y. Fan",
        "C. Feng",
        "L. Feng",
        "Y.Z. He",
        "T. Lan",
        "B. Liu",
        "D. Wang",
        "X.T. Wang",
        "Z.S. Wang",
        "J.D. Zhang",
        "M. Zhang",
        "M. Zhang",
        "T. Zhang",
        "Z.T. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "BUAA",
        "Beijing",
        "People's Republic of China",
        "A polarization control experiment using a pair of crossed undulators has bee proposed for the Shanghai deep ultraviolet free electron laser (FEL) test facility. Numerical simulation indicates that",
        "with the phase-shifter between the two crossed undulators",
        "Fourier-Transform-Limited output radiation with 100nJ order pulse energy",
        "5ps full pulse length and circular polarization degree above 90% could be achieved. The physical design study and the experimental setup status are presented in the paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd10.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD10",
      "page_number": "245",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD11",
      "title": "Optimization of HHG Seeding at Flash II",
      "authors": [
        "S. Ackermann",
        "B. Faatz",
        "DESY",
        "Hamburg",
        "Germany",
        "V. Miltchev",
        "J. Roßbach",
        "Uni HH",
        "Hamburg",
        "Germany",
        "FLASH* delivers coherent FEL radiation suitable for a variety of scientific purposes. In order to provide more beam time to the photon experiments",
        "the FLASH II project",
        "consisting of a second undulator branch and a new experimental Hall driven by the same superconducting modules as FLASH today has been started in 2008. While in the present undulator the kinetic energy of the electrons has to be changed in order to change the wavelength",
        "the new beamline will benefit from variable gap undulators which will allow to have largely independent radiation wavelength; in the range of 10 to 40 nm an HHG seeding option is foreseen which will improve radiation quality for users beyond SASE. For experiments it is important to have the source point of the FEL radiation at the same position",
        "close to the end of the undulator. However",
        "one would like to keep the HHG focus at a fixed longitudinal position",
        "such that wavelength changes will not require adjustments of the HHG focus. In this contribution",
        "we will present the optimization of these conflicting requirements by opening undulator gaps at wavelength dependent positions",
        "keeping both the seeding point and the source point for users fixed."
      ],
      "institutions": [],
      "abstract": "* The Free-Electron Laser in Hamburg",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd11.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD11",
      "page_number": "249",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD12",
      "title": "Extension of Self-seeding to Hard X-rays > 10 keV as a Way to Increase User Access at the European XFEL",
      "authors": [
        "XFEL. EU",
        "Hamburg",
        "Germany",
        "V. Kocharyan",
        "E. Saldin",
        "DESY",
        "Hamburg",
        "Germany",
        "We propose to use a self-seeding scheme with single crystal monochromator at the European X-ray FEL to produce monochromatic",
        "high-power radiation at 16 keV. The FEL power of the transform-limited pulses can reach about 100 GW by exploiting tapering in the tunable-gap baseline undulator. The combination of high photon energy",
        "high peak power",
        "and very narrow bandwidth opens a new range of applications",
        "and allows to increase the user capacity and exploit the high repetition rate of the European XFEL. Dealing with monochromatic hard X-ray radiation one may use crystals as deflectors with minimum beam loss. To this end",
        "a photon beam distribution system based on the use of crystals in the Bragg reflection geometry is proposed for future study and possible extension of the baseline facility. They can be repeated a number of times to form an almost complete (one meter scale) ring with an angle of 20 degrees between two neighboring lines. The reflectivity of crystal deflectors can be switched fast enough by flipping the crystals with piezo-electric devices. It is then possible to distribute monochromatic hard X-rays among 10 independent instruments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd12.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD12",
      "page_number": "253",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD13",
      "title": "Progress Towards HGHG and EEHG at FLASH",
      "authors": [
        "K.E. Hacker",
        "C. Behrens",
        "H. Schlarb",
        "DESY",
        "Hamburg",
        "Germany",
        "G. Angelova Hamberg",
        "V.G. Ziemann",
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "A. Azima",
        "J. Bödewadt",
        "Uni HH",
        "Hamburg",
        "Germany",
        "S. Khan",
        "R. Molo",
        "DELTA",
        "Dortmund",
        "Germany",
        "P. Salén",
        "P. van der Meulen",
        "FYSIKUM",
        "AlbaNova",
        "Stockholm University",
        "Stockholm",
        "Sweden",
        "New infrastructure was built at FLASH to enable 30-100 fs long",
        "milliJoule pulses of 270 nm light to seed the electron beam with HGHG and EEHG techniques",
        "targeting wavelengths in the range from 10 nm to 40 nm. HGHG",
        "or High Gain Harmonic Generation",
        "and EEHG",
        "or Echo-Enabled Harmonic Generation",
        "utilize an external laser together with chicanes and undulators in order to generate a bunched beam which will radiate in a subsequent undulator. In the case of HGHG",
        "the beam is bunched at the seed laser wavelength",
        "radiating harmonics thereof in the radiator. In the case of EEHG",
        "the beam is bunched at a harmonic of the seed wavelength",
        "radiating that same harmonic in the radiator. The properties of the setup",
        "commissioning difficulties and the inital attempts at HGHG seeding at 38.5 nm will be described."
      ],
      "institutions": [
        "Funding: BMBF 05K10PE1 and DESY"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd13.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD13",
      "page_number": "257",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD14",
      "title": "Optical Replica Synthesizer to be Recommissioned with 270 nm Seed at FLASH",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "G. Angelova Hamberg",
        "V.G. Ziemann",
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "S. Khan",
        "R. Molo",
        "DELTA",
        "Dortmund",
        "Germany",
        "P. Salén",
        "P. van der Meulen",
        "FYSIKUM",
        "AlbaNova",
        "Stockholm University",
        "Stockholm",
        "Sweden"
      ],
      "institutions": [
        "Funding: BMBF 05K010PE1, grant 621-2009-2926 and DESY"
      ],
      "abstract": "The Optical Replica Synthesizer at FLASH was first commissioned in 2008 with an 800 nm seed. This wavelength proved to be problematic due to the fact that the COTR resulting from a microbunching instability at that wavelength was often as strong or stronger than the radiation from the seeded and bunched beam. It has since been observed that the microbunches which are responsible for the unwanted COTR can be smeared out in the dogleg if they are shorter than 600 nm. This opens the possibility to try the same experiment with a shorter wavelength and avoid the problems with the unwanted background signal from the microbunching instability. This is the motivation behind a new experimental design involving a new 270 nm seed laser and a new pulse length detection device to replace the old 800 nm seed and pulse length detection device. Details about the experiment design and commissioning plans will be described.",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd14.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD14",
      "page_number": "261",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD15",
      "title": "Seeded Coherent Harmonic Generation with in-line Gas Target",
      "authors": [
        "F. Curbis",
        "N. Čutić",
        "O. Karlberg",
        "F. Lindau",
        "E. Mansten",
        "S. Thorin",
        "S. Werin",
        "MAX-lab",
        "Lund",
        "Sweden",
        "F. Brizuela",
        "B. Kim",
        "D. Kroon",
        "A. L'Huillier",
        "Lund University",
        "Division of Atomic Physics",
        "Lund",
        "Sweden",
        "SLF",
        "Lund",
        "Sweden",
        "The test-FEL at MAX-lab already demonstrated seeded coherent harmonic generation down to 40 nm*. As next step in the development of seeding techniques we plan to use a gas target to generate harmonics of the drive laser and seed the electron beam with them. In order to optimize the injection process",
        "our aim is to place the gas target for harmonic generation as close as possible to the first undulator. In order to minimize the losses the transport of the drive laser is done with a minimal number of mirrors and there are neither focusing nor filtering elements between the harmonic chamber and the first undulator. This will be the first experiment that will imprint energy modulation to the electron beam by harmonics generated in gas. The wavelength range of the harmonics that will be used as seed is around 100 nm and we plan to detect the coherent harmonic signal of the second harmonic generated in the radiator. The flexibility of the set-up will allow to drive the HG process with the fundamental wavelength or the second harmonic or the combination of them. Adding the second harmonic will lead to the generation of even harmonics",
        "thus increasing the range of seeding wavelength.",
        "N. Cutic",
        "et al.",
        "\"Vacuum ultraviolet circularly polarized coherent femtosecond pulses from laser seeded relativistic electrons\"",
        "Phys. Rev. Spec. Top. Accel. Beams 14",
        "030706 (2011)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd15.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD15",
      "page_number": "265",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD17",
      "title": "Seeding of SPARC-FEL with a Tunable Fibre-based Source",
      "authors": [
        "University of Erlangen-Nuremberg",
        "Erlangen-Nuremberg",
        "Germany",
        "PhLAM/CERCLA",
        "Villeneuve d'Ascq Cedex",
        "France",
        "W. Chang",
        "P. Hölzer",
        "K. Mak",
        "P.St.J. Russell",
        "F. Tani",
        "J.C. Travers",
        "Max Planck Institute for the Science of Light",
        "Erlangen",
        "Germany",
        "F. Ciocci",
        "L. Giannessi",
        "A. Petralia",
        "M. Quattromini",
        "ENEA C.R. Frascati",
        "Frascati (Roma)",
        "Italy",
        "M.-E. Couprie",
        "M. Labat",
        "T. Tanikawa",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "G. De Ninno",
        "B. Mahieu",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "Istituto Nazionale di Fisica Nucleare",
        "Milano",
        "Italy",
        "ISM-CNR",
        "Rome",
        "Italy",
        "Instead of seeding a free electron laser in the UV-VUV with a frequency doubled or tripled laser or high order harmonics",
        "here we investigate and present the first results on seeding SPARC-FEL with a fiber-based tunable ultraviolet source. The seed generation system consists of a kagomé hollow-core photonic crystal fiber filled with noble gas. Diffraction-limited DUV pulses of >50 nJ and fs-duration which are continuously tunable from below 200 nm to above 300 nm are generated. The process is based on soliton-effect self-compression of the pump pulse down to a few optical cycles",
        "accompanied by the emission of a resonant dispersive wave in the DUV spectral region. The quality of the compression highly depends on the pump pulse duration",
        "and ideally",
        "pulses <60 fs should be used. Our experimental set-up and associated GENESIS simulations enable us to study the utility of the seed tunability",
        "and the influence of the seed quality",
        "on the performance of the SPARC-FEL in the 200-300 nm range."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd17.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD17",
      "page_number": "269",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD19",
      "title": "The Radiator-first HGHG Multi-MHz X-ray FEL Concept",
      "authors": [
        "M.W. Reinsch",
        "G. Penn",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "P.R. Gandhi",
        "J.S. Wurtele",
        "UCB",
        "Berkeley",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "A novel configuration for a high repetition rate X-ray FEL is investigated. In this scheme longitudinally coherent FEL pulses are obtained using a high gain harmonic generation (HGHG) system in which the seed power is generated in an FEL oscillator downstream of the HGHG section. The oscillator is powered by the spent beams that leave the HGHG radiator. Radiation from the oscillator is sent to the modulator of the HGHG section. The dynamics and stability of the radiator-first scheme is explored analytically and numerically. A single-pass map is derived using a semi-analytic model for FEL gain and saturation. Iteration of the map is shown to be in good agreement with simulations. A numerical example is presented for a soft X-ray FEL in which the oscillator operates at 13.4 nm and HGHG radiation is generated at 1.34 nm. This radiator-first configuration potentially solves (i) the challenge of finding sources to seed future FELs driven by multi-MHz superconducting RF linacs and (ii) the difficulty of producing X-ray radiation with a bunch that exits an oscillator in the more \"natural\" configuration in which the oscillator precedes the radiator.",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd19.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD19",
      "page_number": "273",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD20",
      "title": "Soft X-ray SASE and Self-seeding Studies for a Next-generation Light Source",
      "authors": [
        "G. Penn",
        "P. Emma",
        "D. Prosnitz",
        "J. Qiang",
        "M.W. Reinsch",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "In the self-seeding scheme",
        "the longitudinal coherence and spectral density of an unseeded FEL can be improved [*] by placing a monochromator at a location before the radiation reaches saturation levels",
        "followed by a second stage of amplification. The final output pulse properties are determined by a complex combination of the monochromator properties",
        "undulator settings",
        "variations in the electron beam",
        "and wakefields. We perform simulations for the output of SASE and self-seeded configurations for a soft x-ray FEL using both idealized beams and realistic beams from start-to-end simulations. These studies include cross-planar undulators dedicated to polarization control [**].",
        "[*] J. Feldhaus",
        "E.L. Saldin",
        "J.R. Schneider",
        "E.A. Schneidmiller",
        "and  M.V. Yurkov",
        "Optics Commun. 140 (1997) 341-352.  [**] K.-J. Kim",
        "Nucl. Instrum. Methods A 445 (2000) 329-332."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd20.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD20",
      "page_number": "277",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD21",
      "title": "Self-Seeding Design for SwissFEL",
      "authors": [
        "E. Prat",
        "S. Reiche",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The SwissFEL facility",
        "planned at the Paul Scherrer Institute",
        "is based on the SASE operation of a hard (1-7 Å) and soft (7-70 Å) X-ray FEL beamline. In addition",
        "seeding is foreseen for the soft X-ray beamline (down to a wavelength of 10 Å)",
        "and it is currently also under consideration for the hard X-ray beamline. We have investigated two methods",
        "Echo-Enabled Harmonic Generation (EEHG) and self-seeding for each of the two FEL beamlines. Presently we consider self-seeding the most robust and lowest risk strategy for both lines. The paper discusses our considerations and presents the design of self-seeding implementation for the soft and the hard X-ray beamlines including the layout and simulation results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd21.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD21",
      "page_number": "281",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD22",
      "title": "Generating Multiple Superradiance Pulses in a Slippage-dominant Free-electron Laser Amplifier",
      "authors": [
        "X. Yang",
        "Y. Shen",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "We report the first numerical demonstration of the generation of multiple superradiance pulses in a slippage-dominant free-electron laser amplifier. In this simulation",
        "the 1st and 2nd multiple radiation-pulses are created from the deformation of the longitudinal phase space. Our simulation confirmed controllability over the temporal profile of these pulses",
        "and paves the way for applying this technique",
        "such as generating multiple pulses for slippage-dominant laser-seeded FELs."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd22.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD22",
      "page_number": "285",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD26",
      "title": "Fast Beam-Based BPM Calibration",
      "authors": [
        "K.J. Bertsche",
        "H. Loos",
        "H.-D. Nuhn",
        "F. Peters",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The Alignment Diagnostic System (ADS) of the LCLS undulator system indicates that the 33 undulator quadrupoles have an extremely high position stability over many weeks. However",
        "beam trajectory straightness and lasing efficiency degrade more quickly than this. A lengthy Beam Based Alignment (BBA) procedure must be executed every two to four weeks to re-optimize the X-ray beam parameters. The undulator system includes RF cavity Beam Position Monitors (RFBPMs)",
        "several of which are utilized by an automatic feedback system to align the incoming electron-beam trajectory to the undulator axis. The beam trajectory straightness degradation has been traced to electronic drifts of the gain and offset of the BPMs used in the beam feedback system. To quickly recover the trajectory straightness",
        "we have developed a fast beam-based procedure to recalibrate the BPMs. This procedure takes advantage of the high-precision monitoring capability of the ADS",
        "which allows highly repeatable positioning of undulator quadrupoles. This report describes the ADS",
        "the position stability of the LCLS undulator quadrupoles",
        "and some results of the new recovery procedure."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd26.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD26",
      "page_number": "289",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD27",
      "title": "Beam-based Alignment of an X-FEL Undulator Section Utilizing Corrector Pattern",
      "authors": [
        "M. Aiba",
        "M. Böge",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Beam based alignment of the undulator section is one of the delicate issues in beam commissioning and regular beam tuning of X-FEL facilities since the tolerance on the electron beam orbit straightness is tight",
        "typically a few micro-meters rms. A new approach based on the dipole corrector strengths is under investigation for the PSI future X-FEL facility",
        "SwissFEL. The idea is to minimize the deviation of corrector strengths",
        "required to steer the electron beam to the beam position monitor (BPM) centres",
        "by varying BPM positions. The beam trajectory",
        "if there is no dipolar error",
        "must be fully straight with no corrector excitation",
        "where the deviation is zero",
        "i.e. minimized. Under dipolar errors",
        "e.g. undulator imperfections",
        "the minimization is performed w.r.t. their average value. The procedure requires precise BBA of quadrupoles to adjacent BPM beforehand and an orbit feedback in operation. Although these preparation works require some efforts",
        "the method is rather simple and robust. The methodology together with expected performance from analytical estimation and simulations applied to the undulator section of SwissFEL is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd27.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD27",
      "page_number": "293",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD28",
      "title": "Bunch Compression Layout and Longitudinal Operation Modes for the SwissFEL Aramis Line",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The SwissFEL Aramis Undulator line will produce SASE photon pulses covering a wavelength range from 0.07 nm to 0.7 nm. The facility will consists of an S-band RF-gun and booster",
        "an X-band lineariser",
        "and a C-band main linac",
        "which accelerates the beam up to 5.8 GeV. Two compression chicanes at about 330 MeV and 2.1 GeV will provide a nominal peak current up to 3 kA. It is foreseen to deliver electron pulses between 3 and 19 fs length to the undulator. This is done by adjusting the charge between 10 and 200 pC. Longitudinal wakes in the C-band linac are used to remove the chirp to deliver small bandwidth radiation. A special mode uses these wakes to increase the energy chirp to deliver a photon bandwidth an the percent level for special applications like single shot spectroscopy. In addition a fully compressed 10 pC beam is used as a source of sub femto-second pulses. An iterative semi-analytic procedure was used to setup and optimise the setup efficiently. In this paper these optimised operation modes are presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd28.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD28",
      "page_number": "297",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD32",
      "title": "Simultaneous Operation of a Multi Beamline FEL Facility",
      "authors": [
        "B. Faatz",
        "S. Ackermann",
        "V. Ayvazyan",
        "W. Decking",
        "C. Grün",
        "K. Klose",
        "F. Obier",
        "S. Pfeiffer",
        "M. Scholz",
        "J. Wortmann",
        "DESY",
        "Hamburg",
        "Germany",
        "Uni HH",
        "Hamburg",
        "Germany",
        "The FLASH II project will add an undulator beamline and a new experimental Hall to the existing FLASH Facility. In addition to improving the radiation properties of the FEL by using seeding",
        "one of the main goals is to double the beamtime of the facility for users. At the moment",
        "we deliver photon pulses in 10 Hz bursts with up to 800 bunches within each RF pulse. In order not to limit parameter ranges",
        "we will have to give those same tuning possibilities within an RF pulse for each of the users independently. For this purpose",
        "several tests have been performed to determine the limits of the difference in beam parameters which can be delivered. We will show to what extend we can switch fast between two beamlines",
        "how we can change photon pulse length by allowing different charges",
        "have different energy in the two beamlines simultaneously to allow for wavelength scans for the fixed-gap undulator presently built in FLASH",
        "while not interfering with user operation of the new beamline."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd32.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD32",
      "page_number": "301",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD33",
      "title": "Extraction Arc for FLASH II",
      "authors": [
        "M. Scholz",
        "W. Decking",
        "B. Faatz",
        "T. Limberg",
        "DESY",
        "Hamburg",
        "Germany",
        "FLASH II is an extension of FLASH",
        "an FEL user facility at DESY",
        "Hamburg. It uses the same linear accelerator. A fast kicker and a septum will be installed behind the last superconducting acceleration module at the FLASH linac",
        "providing the possibility to distribute beam to the FLASH undulator beamline and through the new extraction arc into the beamline"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd33.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD33",
      "page_number": "305",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD34",
      "title": "Beam Optics Design for PAL-XFEL",
      "authors": [
        "H.-S. Kang",
        "J.H. Han",
        "T.-H. Kang",
        "I.S. Ko",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "The PAL XFEL lattice is a three bunch compressor lattice (3-BC lattice) with a hard x-ray FEL line at the end of 10-GeV linac and a switch line at 3-GeV point for soft X-ray FEL line. The 3-BC lattice is chosen to minimize emittance growth due to CSR. Robustness of beam optics is verified with initial conditions far from ideal like asymmetric current profile",
        "optics mismatch",
        "nonlinear energy chirp."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd34.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD34",
      "page_number": "309",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD35",
      "title": "Femtosecond Level Synchronization of a Linac based Super-radiant THz Facility",
      "authors": [
        "M. Kuntzsch",
        "M. Gensch",
        "U. Lehnert",
        "F. Röser",
        "HZDR",
        "Dresden",
        "Germany",
        "M. Bousonville",
        "H. Schlarb",
        "N. Stojanovic",
        "S. Vilcins",
        "DESY",
        "Hamburg",
        "Germany",
        "The superconducting radiofrequency (SRF) electron accelerator ELBE at Helmholtz-Zentrum Dresden-Rossendorf (HZDR) is currently upgraded with an SRF Gun and a femtosecond (fs) electron beamline to enable continuous wave operation with bunch charges of up to 1 nC and bunch durations down to 100 fs (RMS). The new femtosecond electron beamline will be used to drive two coherent THz sources and one X-ray source based on Thomson scattering. The two different THz sources",
        "one narrow bandwidth undulator source and one broad bandwidth coherent transition/diffraction source",
        "are guided into a dedicated THz Laboratory where they can be combined with various fs-laser systems. For the planned THz pump laser probe experiments",
        "synchronization of the external pump-probe lasers on the fs- level is essential. Our approach is based on an optical synchronization system",
        "adapted from a similar system installed at FLASH [*]. That system will be installed in collaboration between DESY and HZDR. In this contribution we will discuss the layout of the synchronization scheme and first ideas for measurements of the arrival time jitter of the THz pulses to evaluate the achieved degree of timing stability.",
        "* F.Loehl",
        "H.Schlarb et. al.\"Sub-10 femtosecond stabilization of a fiber-link using a balanced optical cross-correlator\"",
        "proceedings of PAC2007",
        "Albuquerque",
        "USA",
        "JUN 25-29 2007",
        "FR0AC04."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd35.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD35",
      "page_number": "313",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD36",
      "title": "Variation of Beam Arrival Timing at SACLA",
      "authors": [
        "T. Ohshima",
        "S. Matsubara",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "H. Maesaka",
        "Y. Otake",
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "The user operation of SACLA was started on March 2012. In this machine",
        "it is a key issue to deliver stable timing signals (better than 30 fs) to the beam monitor units and apparatus of XFEL users. Since the arrival timing change of the X-ray at an experimental station depends on that of the electron beam",
        "we measured the arrival timing of the electron beam by comparing an rf reference signal and a beam induced signal from an rf beam position monitor (rf bpm). A standard deviation of the arrival timing of the bpm was around 70 fs averaged in 100 beam-shots. The timing signal also changes by a drift of the rf reference signal",
        "and this change leads to the measurement error. To evaluate this contribution",
        "we measured difference of the arrival timings between two bpms located at the entrance and the exit of a beamline which has 18 ID units having the rf bpm",
        "each. The difference corresponding to the reference time drift was less than 100 fs p-p in a day. We can measure the arrival timing of the X-ray with a resolution of less than 100 fs which is acceptable level in the current stage."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd36.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD36",
      "page_number": "317",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD37",
      "title": "Upgrade of a Precise Temperature Regulation System for the Injector at SACLA",
      "authors": [
        "T. Hasegawa",
        "T. Asaka",
        "T. Inagaki",
        "H. Maesaka",
        "Y. Otake",
        "K. Togawa",
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "T. Fukui",
        "S. Takahashi",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "A precise temperature regulation system for the injector at SACLA is being upgraded. To make stable operation of the SACLA",
        "it is indispensable to achieve extremely high stability of the accelerator's components. At the beam commissioning",
        "it has become clear that even a tiny fluctuation in the cooling water temperature",
        "such as 0.1 K",
        "for RF cavities of the injector can significantly influence on lasing stability. Although the existing temperature control system has been able to keep temperature stability of the cavity less than 0.08 K by using an ON-OFF alternatively heating method with a pulse width modulation",
        "a laser power fluctuation has been observed",
        "which has a strong correlation with the cavity temperature. An improvement in temperature stability for this system is expected by replacing a PLC module to a temperature controller with an extremely high temperature resolution of 0.001 K. We will be applying continuous level control of a heater with the DC power supply. This system will dramatically improve our lasing stability. This paper describes the temperature control scheme and its performance in detail."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd37_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd37.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd37_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD37",
      "page_number": "321",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD38",
      "title": "Stability Improvements of SACLA",
      "authors": [
        "H. Maesaka",
        "T. Asaka",
        "T. Hara",
        "T. Hasegawa",
        "T. Inagaki",
        "T. Ohshima",
        "Y. Otake",
        "H. Tanaka",
        "K. Togawa",
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "T. Hasegawa",
        "Y. Kano",
        "T. Morinaga",
        "Y. Tajiri",
        "S. Tanaka",
        "R. Yamamoto",
        "SES",
        "Hyogo-pref.",
        "Japan",
        "JASRI/SPring-8",
        "Hyogo",
        "Japan",
        "The XFEL facility",
        "SACLA",
        "achieved first x-ray lasing in June 2011 and started public user operation in March 2012. In the early days after the first x-ray lasing",
        "large drift of FEL intensity was observed and the period of FEL lasing condition to keep within acceptable intensity variation was only about an hour. We found that this short period mainly came from drifts of the rf phases and amplitudes of sub-harmonic buncher cavities and accelerator cavities in an injector section (238",
        "476",
        "1428",
        "5712 MHz). These rf drifts caused drifts of a peak current",
        "a beam energy and a beam trajectory. As a result",
        "the FEL gain was significantly degraded. Since the rf field in the cavity had a strong correlation with the cavity temperature",
        "we improved a cavity temperature regulation system by a factor of 2 or 3 and the temperature stability was reduced to be 0.08 K peak-to-peak. In addition",
        "we introduced an energy feedback loop for a C-band main accelerator and an orbit feedback loop for an undulator beamline. After these improvements",
        "the FEL intensity was maintained within 10% for longer than a day."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd38_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd38.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd38_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD38",
      "page_number": "325",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD39",
      "title": "Effect of Active Fibre Stabilization on Group and Phase Delay",
      "authors": [
        "T.T. Thakker",
        "S.P. Jamison",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "An optical clock distribution system is being developed on the ALICE accelerator at Daresbury Laboratory. The system is based on a MLL fibre stabilization scheme* which delivers the clock signal with ultrashort optical pulses over an actively stabilized optical fibre. While these schemes stabilize the pulse transit time through fibre",
        "they do not necessarily control the optical carrier. The ability to stabilize both the carrier and envelope phase in these systems could give higher resolution current envelope stabilized systems while continuing to deliver ultrashort pulses for use at delivery sites. We report here on a carrier phase detector to investigate the carrier-envelope phase walk-off in fibre distribution systems and how it is affected by active stabilization of the fibre. The phase monitor uses polarisation rotation associated with sub-wavelength delays in the fibre to detect changes in the carrier phase of ultrashort pulses. We present here studies of the carrier phase stability in an actively stabilized fibre link and its implications on the feasibility of stabilizing both carrier and envelope phase in pulsed synchronisation systems.",
        "* S. Schulz et. al.",
        "Progress towards a permanent optical synchronization infrastructure at FLASH",
        "Proc. of FEL 2009",
        "Liverpool",
        "UK"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd39_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd39.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd39_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD39",
      "page_number": "329",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPD41",
      "title": "Practical Design of Resonance Frequency Tuning System for Coaxial RF Cavity for Thermionic Triode RF Gun",
      "authors": [
        "T. Konstantin",
        "Y.W. Choi",
        "H. Imon",
        "T. Kii",
        "R. Kinjo",
        "K. Masuda",
        "K. Nagasaki",
        "H. Negm",
        "H. Ohgaki",
        "K. Okumura",
        "M. Omer",
        "S. Shibata",
        "K. Shimahashi",
        "M. Takasaki",
        "K. Yoshida",
        "H. Zen",
        "Kyoto University",
        "Institute for Advanced Energy",
        "Kyoto",
        "Japan",
        "The FEL radiation production requires temporal stability of electron beam energy. The latter depends directly on the quality of electron gun. The KUFEL(Kyoto University- FEL) facility uses a thermionic 4.5 cell S-band RF gun for electron beam generation. The main disadvantage of using a thermionic RF gun is the effect of backstreaming electrons",
        "which heats up the cathode material during operation and causes energy drop. An additional cavity",
        "triode cavity",
        "for RF gun was designed and fabricated in order to control the electron injection and to mitigate the amount of backstreaming electrons(*). The quality factor and the coupling coefficient of the triode cavity with the RF feed coaxial cable were designed to ensure the induction of the required cavity voltage and a wide frequency acceptance(***). The corresponded simulations show the power reduction of back streaming electrons for 80% as well as peak current enhancement without emittance degradation(**",
        "***). However the fabricated prototype didn't match the designed parameters as tested at low power(****). In this work we report the strategies for correction of deviation from simulated and tested parameters of triode cavity.",
        "* K.Masuda et al. Prc. FEL 2009",
        "Liverpool  ** K.Masuda et al. Prc. FEL 2006",
        "Berlin   *** T. Shiiyama et al. Prc. FEL 2007",
        "Novosibirsk  **** M.Takasaki et al. Prc. FEL 2010",
        "Malmö"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tupd41_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tupd41.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tupd41_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUPD41",
      "page_number": "333",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 27,
  "scrape_time": "2025-10-10 17:34:33"
}