{
  "session_info": {
    "id": "FRCOXBS",
    "name": "FRCOXBS - WG2: ERL beam dynamics and instrumentation",
    "url": "https://proceedings.jacow.org/erl2019/html/frcoxbs.htm"
  },
  "papers": [
    {
      "paper_id": "FRCOXBS01",
      "title": "Electronic Modulation of the FEL-Oscillator Radiation Power Driven by ERL",
      "authors": [
        "O.A. Shevchenko",
        "E.V. Bykov",
        "Ya.V. Getmanov",
        "S.S. Serednyakov",
        "S.V. Tararyshkin",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "M.V. Fedin",
        "S.L. Veber",
        "International Tomography Center",
        "SB RAS",
        "Novosibirsk",
        "Russia",
        "Ya.V. Getmanov",
        "S.S. Serednyakov",
        "NSU",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "FEL oscillators usually operate in CW mode and produce periodic train of radiation pulses but some user experiments require modulation of radiation power. Conventional way to obtain this modulation is using of mechanical shutters however it cannot provide very short switching time and may lead to decreasing of the radiation beam quality. Another way could be based on the electron beam current modulation but it cannot be used in the ERL. We propose a simple way of fast control of the FEL lasing which is based on periodic phase shift of electron bunches with respect to radiation stored in optical cavity. The phase shift required to suppress lasing is relatively small and it does not change significantly repetition rate. This approach has been realized at NovoFEL facility. It allows to generate radiation macropulses of desirable length down to several microseconds (limited by quality factor of optical cavity and FEL gain) which can be synchronized with external trigger. We present detailed description of electronic power modulation scheme and discuss the results of experiments.",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/frcoxbs01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/frcoxbs01.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/frcoxbs01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-FRCOXBS01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FRCOXBS03",
      "title": "Beam Dynamics Simulations for the Twofold ERL Mode at the S-DALINAC*",
      "authors": [
        "F. Schließmann",
        "M. Arnold",
        "M. Dutine",
        "J. Pforr",
        "N. Pietralla",
        "M. Steinhorst",
        "TU Darmstadt",
        "Darmstadt",
        "Germany"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/frcoxbs03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/frcoxbs03.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/frcoxbs03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-FRCOXBS03",
      "page_number": "155",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCOXBS04",
      "title": "Status of the Control System for the Energy Recovery Linac BERLinPro at HZB",
      "authors": [
        "T. Birke",
        "P. Echevarria",
        "D. Eichel",
        "R. Fleischhauer",
        "J.G. Hwang",
        "G. Klemz",
        "R. Müller",
        "C. Schröder",
        "E. Suljoti",
        "A. Ushakov",
        "HZB",
        "Berlin",
        "Germany",
        "BERLinPro is an energy recovery linac (ERL) demonstrator project built at HZB. It features CW SRF technology for the low emittance",
        "high brightness gun",
        "the booster module and the recovery linac. Construction and civil engineering are mostly completed. Synchronized with the device integration the EPICS based control system is being set-up for testing",
        "commissioning and finally operation. In the warm part of the accelerator technology is used that is already operational at BESSY and MLS (e.g. CAN-bus and PLC/OPCUA). New implementations like the machine protection system and novel major subsystems (e.g. LLRF",
        "Cryo-Controls",
        "photo cathode laser) need to be integrated. The first RF transmitters have been tested and commissioned. Around the time of this workshop the first segment of the accelerator is scheduled to become online. For commissioning and operation of the facility the standard set of EPICS tools form the back-bone. A set of generic python applications already developed at BESSY/MLS will be adapted to the specifics of BERLinPro. Scope and current project status are described in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/frcoxbs04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/frcoxbs04.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/frcoxbs04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-FRCOXBS04",
      "page_number": "159",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCOXBS05",
      "title": "Adjusting BERLinPro Optics to Commissioning Needs",
      "authors": [
        "B.C. Kuske",
        "M. McAteer",
        "HZB",
        "Berlin",
        "Germany",
        "BERLinPro is an Energy Recovery Linac (ERL) project currently being set up at HZB",
        "Berlin. During the turn of the project",
        "many adaptations of the optics to changing hardware realities were necessary. To name only one",
        "commissioning of the recirculator will now be realized with the superconducting linac module fabricated for the Mainz ERL project MESA",
        "as the BERLinPro linac is delayed. The Mainz linac will supply roughly 60% of the energy planned for the BERLinPro linac module and will be limited by higher order modes in the cavities to few mA of current. While the adapted optics shows similar parameters as the original 50MeV optics",
        "studies of longitudinal space charge and coherent synchrotron radiation show that the energy leads to large emittance blow up due toμbunching. Furthermore",
        "preparations for commissioning with gun fields much lower than the original 30MV/m in the 1.4 cell SRF gun are introduced and according optics are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/frcoxbs05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/frcoxbs05.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/frcoxbs05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-FRCOXBS05",
      "page_number": "165",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:04:41"
}