{
  "session_info": {
    "id": "FRCDE",
    "name": "FRCDE - Closing Session",
    "url": "https://proceedings.jacow.org/napac2022/html/frcde.htm"
  },
  "papers": [
    {
      "paper_id": "FRCDE1",
      "title": "Accelerator Searches for Axions and Dark Matter",
      "authors": [
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "This talk will give an overview of the theory and the accelerator and detector techniques used for dark sector searches. As an example",
        "the talk will then focus on a recent and local experiment",
        "the Coherent CAPTAIN-Mills (CCM)",
        "which has begun running at the LANSCE Lujan center. In a three year run CCM will search for sub-GeV dark matter with sensitivities that probe early Universe relic density limits. It will also probe for Axion Like Particles (ALP’s) parameter space un-tested by previous experiments and cosmological constraints",
        "and test new interpretation of the legendary LSND and MiniBooNE excesses. CCM will operate at the Lujan Center at LANSCE which is a 100-kW neutron and stopped pion source that delivers an 800-MeV proton beam onto a tungsten target at 20 Hz with a pulse width of 290 ns. The 10 ton liquid argon CCM detector is placed 23 m from the target and is instrumented with 200 fast nano-second 8\" PMT’s that can detect scattering events in time with the beam from as low as 10 keV thresholds up to 200 MeV. Initial data results will be shown demonstrating the power of the new experiment."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/frcde1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/frcde1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/frcde1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-FRCDE1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FRCDE2",
      "title": "Accelerator Production of Medical Radionuclides",
      "authors": [
        "C.S. Cutler",
        "D. Kim",
        "D. Medvedev",
        "BNL",
        "Upton",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "Since 1931 major advances have enabled the production of small compact cyclotrons to be installed at hospitals and pharmacies enabling the supply of short-lived radionuclides around the world. This and the development of the generator allowed for remote access to radionuclides and the expansion of nuclear medicine. In the 1970’s and 80’s major accelerator facilities operating at 100 MeV and higher were installed in many of the national labs and used for production of radionuclides at energies and currents not available on the small compact machines. These high energy accelerators have played an important role in supplying Radionuclides such as Sr-82 used in Sr/Rb generators for cardiac imaging and Ac-225 for cancer therapy. They continue to be advanced to further production yields by installing beam rastering systems that have allowed higher intensities and thus higher production yields. As well as adding mass separation techniques that enable novel radionuclides to be produced in quality suitable for use. These enhanced accelerator capabilities and the production of these novel radionuclides will be presented.",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/frcde2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/frcde2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/frcde2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-FRCDE2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FRCDE3",
      "title": "Radiation Effects in Microelectronics - Why We Need Particle Accelerators",
      "authors": [
        "NASA Goddard Space Flight Center",
        "Greenbelt",
        "USA",
        "We have seen anomalies due to radiation effects in electronic devices since the mid-1970s. We group radiation effects into different categories: one of which is single-event effects (SEE). SEE are any measurable or observable change in state or performance of a microelectronic device",
        "component",
        "subsystem",
        "or system resulting from a single energetic-particle strike. Today",
        "SEE dominate radiation risks for many ground- and space-based systems. Engineers require knowledge of SEE susceptibility for devices and systems since it impacts both availability and reliability. Design teams frequently use particle accelerators to simulate ionizing radiation environments. The rapid growth of systems operating in harsh radiation environments has pushed accelerator facility access constraints to the breaking point. Investments in new radiation effects testing infrastructure have begun. Meanwhile",
        "there remain unanswered questions about accelerator facility workforce and potential business model impacts on existing ecosystems. We must maintain existing facility access as while building out new capabilities",
        "or risk unacceptable impacts to product development and space system operations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/frcde3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/frcde3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/frcde3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-FRCDE3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-11 00:32:47"
}