{
  "session_info": {
    "id": "TUWPLS",
    "name": "TUWPLS - Invited Oral: Beam Dynamics and EM Fields",
    "url": "https://proceedings.jacow.org/ipac2019/html/tuwpls.htm"
  },
  "papers": [
    {
      "paper_id": "TUWPLS1",
      "title": "Beam Shaping Via 6D Phase-Space Manipulation",
      "authors": [
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "An electron beam obtained directly out of an injector does not always have the phase-space properties required for its optimum use. Phase-space manipulation is often necessary to achieve certain beam distributions in the transverse and longitudinal dimensions. There are many ways to accomplish the control of transverse beam profile such as using focusing magnets or shaping masks",
        "and re-partition of the transverse phase-spaces. In comparison",
        "less resources are available to arbitrarily shape the longitudinal distribution directly. However",
        "owing to the transverse-to-longitudinal emittance exchange technique first demonstrated at the Fermilab A0 Photo-injector",
        "the longitudinal beam profiles can be obtained by first shaping the beam transversely",
        "followed by mapping the transverse distribution into longitudinal. Longitudinal beam profile manipulation via EEX has been greatly advanced at the Argonne Wakefield Accelerator and precise tailoring for various longitudinal beam profiles has been achieved. In this talk we will present the progress on beam shaping via 6D phase-space manipulation and discuss future research in the area."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/tuwpls1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/tuwpls1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/tuwpls1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-TUWPLS1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 19:08:22"
}