{
  "session_info": {
    "id": "WEIDLH2",
    "name": "WEIDLH2 - WG4 ERL and SRF / WG3 ERL Beam Instrumentation Control",
    "url": "https://proceedings.jacow.org/ERL2015/html/weidlh2.htm"
  },
  "papers": [
    {
      "paper_id": "WEIDLH2066",
      "title": "Performance of the Digital LLRF Systems at KEK cERL",
      "authors": [
        "F. Qiu",
        "D.A. Arakawa",
        "Y. Honda",
        "H. Katagiri",
        "T. Matsumoto",
        "S. Michizono",
        "T. Miura",
        "T. Obina",
        "H. Sakai",
        "KEK",
        "Ibaraki",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "A compact energy recovery linac (cERL)",
        "which is a test machine for the next generation synchrotron light source 3-GeV ERL",
        "was constructed at KEK. In the cERL",
        "a normal conducting (NC) buncher cavity and three superconducting (SC) two-cell cavities were installed for the injector",
        "and two nine-cell SC cavities were installed for the main linac (ML). The radio-frequency (RF) fluctuations for each cavity are required to be maintained at less than 0.1% rms in amplitude and 0.1° in phase. These requirements are fulfilled by applying digital low-level radio-frequency (LLRF) systems. During the beam-commissioning",
        "the LLRF systems were evaluated and validated. A measured beam momentum jitter of 0.006% shows that the target of the LLRF systems is achieved. To further improve the system performance",
        "an adaptive feedforward (FF) control-based approach was proposed and demonstrated in the beam-commissioning. The current status of LLRF system and the adaptive FF approach for LLRF control in the cERL are presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ERL2015/talks/weidlh2066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ERL2015/papers/weidlh2066.pdf",
      "poster_url": "https://proceedings.jacow.org/ERL2015/posters/weidlh2066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2015-WEIDLH2066",
      "page_number": "84",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEIDLH2067",
      "title": "Resonance Control for Narrow-Bandwidth, Superconducting Accelerator Applications",
      "authors": [
        "J.P. Holzbauer",
        "Y.M. Pischalnikov",
        "W. Schappert",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Several of the large accelerator complexes currently being either proposed or actively designed require quite narrow bandwidth RF cavities. Additional constraints on RF amplifier overhead budget mean that these machines will require significantly tighter resonance control than existing accelerators. Additionally",
        "these projects each impose a diverse array of additional challenges",
        "including CW vs. pulsed duty cycle and a variety of cavity geometries",
        "each with its own pressure and Lorentz force sensitivites and mechanical tuner designs. At FNAL",
        "work is ongoing to meet these challenges in the direct context of LCLS-II and PIP-II. This paper will present the status of the ongoing efforts by the Resonance Control Group to develop active compensation techniques for both projects."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ERL2015/talks/weidlh2067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ERL2015/papers/weidlh2067.pdf",
      "poster_url": "https://proceedings.jacow.org/ERL2015/posters/weidlh2067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2015-WEIDLH2067",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEIDLH2068",
      "title": "Using a 1.3 GHz 20 kW Solid State Amplifier as RF Power Supply for DC-SRF Photo-injector",
      "authors": [
        "F. Wang",
        "L.W. Feng",
        "J.K. Hao",
        "L. Lin",
        "K.X. Liu",
        "S.W. Quan",
        "B.C. Zhang",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "R&D of a 1.3GHz 20kW cw solid state amplifier，which consists of 88 elementary modules with individual power supplies",
        "has been carried out under the cooperation between BBEF (Beijing) and Peking University for the DC-SRF photo-injector. It has been installed and applied to the experiments of the DC-SRF photo-injector at Peking University since 2012. The structure",
        "test with full power and full reflection",
        "improvements and performance for long-term operation of this 20 kW solid state RF amplifier will be described in this presentation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ERL2015/talks/weidlh2068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ERL2015/papers/weidlh2068.pdf",
      "poster_url": "https://proceedings.jacow.org/ERL2015/posters/weidlh2068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2015-WEIDLH2068",
      "page_number": "88",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:07:22"
}