{
  "session_info": {
    "id": "THCB",
    "name": "THCB - Contributed Oral: GUI Technologies",
    "url": "https://proceedings.jacow.org/pcapac2018/html/thcb.htm"
  },
  "papers": [
    {
      "paper_id": "THCB1",
      "title": "ACOP. NET : Not Just Another GUI Builder",
      "authors": [
        "J. Szczesny",
        "P. Duval",
        "M. Lomperski",
        "H. Wu",
        "DESY",
        "Hamburg",
        "Germany",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "KEK",
        "Ibaraki",
        "Japan",
        "ACOP (Advanced Component Oriented Programming) tools have been useful in control system GUI application development for some time",
        "originally as an ActiveX component offering a transport layer and a multi-faceted chart * and then later as a suite of components in the Java world **. We now present a set of ACOP components for development in .NET. And where the emphasis in the past has been primarily on rapid application development of rich clients",
        "this new palette of components is designed both for fully featured rich-client development in any of the .NET supported languages (C#",
        "C++",
        "VB",
        "F#) as well as for fully configurable clients (with design-time browsing)",
        "where no programming on the part of the developer is necessary",
        "and of course for any combination between these extremes. This is an important point",
        "which will become clear when we contrast application development with ACOP. NET with other control system GUI builders such as Control System Studio and jddd. Although Visual Studio is the GUI builder of choice",
        "we will present other available options",
        "for example on Linux. Examples using transport plugs for TINE and STARS will be given.",
        "* I. Deloose",
        "et al.",
        "\"The Use of ACOP Tools in Writing Control System Software\"",
        "ICALEPCS 1997.  ** J.Bobnar",
        "et al.",
        "\"The ACOP Family of Beans: A Framework Independent Approach\"",
        "ICALEPCS 2007."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB1",
      "page_number": "139",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCB2",
      "title": "Development of ACOP .NET STARS Transport Layer",
      "authors": [
        "T. Kosuge",
        "H. Ishii",
        "Y. Nagatani",
        "H. Nitani",
        "KEK",
        "Ibaraki",
        "Japan",
        "P. Duval",
        "J. Szczesny",
        "DESY",
        "Hamburg",
        "Germany",
        "STARS is an extremely simple and very flexible control software for small scale control systems with TCP/IP sockets",
        "which is used as the beamline control system and so on at the KEK Photon Factory (KEK-PF). STARS works on various operating system and the STARS client developer can choose his or her favorite programing language. Choosing .NET is very common to develop GUI applications of beamline control at the KEK-PF. ACOP (Advanced Component Oriented Programming) is very useful for GUI development",
        "which is developed by DESY and a .NET version of ACOP was recently developed. ACOP has a transport layer and communicate with various system through this layer. Now",
        "we have started development of STARS transport layer of ACOP .NET and succeeded in adding very primitive functionality. The development of ACOP .NET STARS transport layer is still ongoing."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb2.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB2",
      "page_number": "144",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCB3",
      "title": "Improving Web2cHMI Gesture Recognition Using Machine Learning",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "Web2cHMI is multi-modal human-machine interface which seamlessly incorporates actions based on various interface modalities in a single API",
        "including finger",
        "hand and head gestures as well as spoken commands. The set of native gestures provided by off-the-shelf 2D- or 3D-interface devices such as the Myo gesture control armband can be enriched or extended by additional custom gestures. This paper discusses a particular method and its implementation in recognizing different finger",
        "hand and head movements using supervised machine learning algorithms including a non-linear regression for feature extraction of the movement and a k-nearest neighbor method for movement classification using memorized training data. The method is capable of distinguishing between fast and slow",
        "short and long",
        "up and down",
        "or right and left linear as well as clockwise and counterclockwise circular movements",
        "which can then be associated with specific user interactions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb3.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB3",
      "page_number": "148",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCB4",
      "title": "Leveraging Internet of Things Developments for Rapid Prototyping of Synoptic Displays",
      "authors": [
        "L.T. Stant",
        "T.M. Cobb",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Recently the technology industry has been laying foundations for the eponymous Internet of Things (IoT): efficient publish-subscribe protocols; process control schemas for household items; and improved low-power radio communications. Accelerator controls and IoT have several aspects in common - small payloads",
        "low latency",
        "dashboard/synoptic data presentation format are some examples. The IoT now provides several open-source projects which can provide a partial implementation of one or more accelerator controls software features. Because development is typically a lower priority for accelerator controls groups",
        "there is a valid case to try and utilise the free efforts of others for the benefit of accelerator controls. In this paper",
        "the authors present examples of the use of IoT frameworks for synoptic display/GUI development. The work in this paper enables other developers to access this resource and experiment with their own systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb4.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB4",
      "page_number": "151",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCB5",
      "title": "Intelligent Controls and Modeling for Particle Accelerators and Other Research and Industrial Infrastructures",
      "authors": [
        "S. Biedron",
        "S.V. Milton",
        "Element Aero",
        "Chicago",
        "USA",
        "CSU",
        "Fort Collins",
        "Colorado",
        "USA"
      ],
      "institutions": [],
      "abstract": "We give some perspective on the present state of intelligent control for particle accelerators. This is based on our experience over the past 14 years in developing artificial-intelligence-based tools specifically to address modeling and control challenges found in particle accelerator systems. [1] E. Meier et al., NIM A: 632. 1 (2011): 1-6; [2] S. G. Biedron et al., \"Advanced Controls for RF and Directed Energy Systems,\" 18th Annual Directed Energy Symposium, 2016. [3] A. L. Edelen et al., IEEE Trans. on Nuclear Science 63(2), 878-897., [4] A. Edelen et al., in Proc. IPAC’18, Vancouver, Canada, 2018. doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb5.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB5",
      "page_number": "156",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-11 02:02:28"
}