{
  "session_info": {
    "id": "TUPP",
    "name": "TUPP - Tuesday Poster Session",
    "url": "https://proceedings.jacow.org/ECRIS2012/html/tupp.htm"
  },
  "papers": [
    {
      "paper_id": "TUPP01",
      "title": "Quantitative Determination of 146Sm/147Sm Ratios by Accelerator Mass Spectrometry with an ECR Ion Source and Linear Acceleration for 146Sm Half-Life Measurement",
      "authors": [
        "UTTAC",
        "Tsukuba",
        "Ibaraki",
        "Japan",
        "P. Collon",
        "Y. Kashiv",
        "D. Robertson",
        "C.J. Schmitt",
        "X.D. Tang",
        "University of Notre Dame",
        "Indiana",
        "USA",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "C. Deibel",
        "B. DiGiovine",
        "J.P. Greene",
        "D. Henderson",
        "C.L. Jiang",
        "S.T. Marley",
        "R.C. Pardo",
        "E. Rehm",
        "R.H. Scott",
        "R.C. Vondrasek",
        "ANL",
        "Argonne",
        "USA",
        "T. Nakanishi",
        "A. Yokoyama",
        "Kanazawa University",
        "Kanazawa",
        "Japan",
        "The Hebrew University of Jerusalem",
        "The Racah Institute of Physics",
        "Jerusalem",
        "Israel",
        "The alpha-decaying 146Sm nuclide is used for chronology of the Solar System and silicate mantle differentiation in planets. We performed a new determination of 146Sm half-life by measuring 146Sm/147Sm alpha activity and atom ratios in 147Sm activated via (g",
        "n)",
        "(n",
        "2n) and (p",
        "2n) reactions and obtained a value (68 Myr)",
        "smaller than that adopted so far (103 Myr)",
        "with important geochemical implications*. The experiment required determination of 146Sm/147Sm ratios by high-energy (6 MeV/u) accelerator mass spectrometry to discriminate 146Sm from isobaric 146Nd contaminant. Activated Sm targets were dissolved",
        "chemically purified and reconverted to metallic Sm. Sputter cathodes",
        "made by pressing the Sm metal into high-purity Al holders",
        "were used to feed the Argonne ECR ion source. 146Sm22+",
        "147Sm22+ ions were alternately injected and accelerated with the ATLAS linac by proper scaling of ion source and accelerator components. A tightly-fitted quartz cylindrical liner was inserted in the ECR plasma chamber to reduce contamination from the walls. 146Sm ions were eventually counted in a gas-filled magnet and 147Sm ions either measured as charge current or counted after proper attenuation.",
        "* N. Kinoshita et al.",
        "Science 334",
        "1614 (2012)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP01",
      "page_number": "43",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP03",
      "title": "Integration of a Third Ion Source for Heavy Ion Radiotherapy at HIT",
      "authors": [
        "T.W. Winkelmann",
        "A.B. Büchel",
        "R. Cee",
        "A. Gaffron",
        "Th. Haberer",
        "J.M. Mosthaf",
        "B. Naas",
        "A. Peters",
        "J. Schreiner",
        "HIT",
        "Heidelberg",
        "Germany",
        "HIT is the first European hospital based facility for scanned proton and heavy ion radiotherapy. In 2009 the clinical operation started",
        "since then more than 800 patients were treated in the facility. In a 24/7 operation scheme two 14.5 GHz electron cyclotron resonance ion sources are routinely used to produce protons and carbon ions. In the near future a helium beam for regular patient treatment is requested. The modification of the low energy beam transport line (LEBT) for the integration of a third ion source into the production facility was done in winter 2011. For beam quality improvement with a smaller emittance at the same current we designed and tested a new extraction system at the testbench and equipped the source for protons and helium with this optimized system. This paper will present results of the LEBT modification and gives an outlook to further enhancements at the HIT ion source testbench."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP03",
      "page_number": "46",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP04",
      "title": "Design of a Compact ECR Ion Source for Various Ion Production",
      "authors": [
        "M. Muramatsu",
        "S. Hojo",
        "Y. Iwata",
        "K. Katagiri",
        "A. Kitagawa",
        "Y. Sakamoto",
        "S. Sato",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "KVI",
        "Groningen",
        "The Netherlands",
        "National Institute of Radiological Sciences",
        "Chiba",
        "Japan",
        "Compact ECR ion source with all permanent magnets",
        "so called Kei2",
        "was developed for high energy carbon ion therapy facility at National Institute of Radiological Sciences. Kei2 source was design for production of only carbon ion for medical treatment. A copy of Kei2",
        "so called KeiGM is used for Gunma University. Kei series are optimized for carbon ion production. In order to produce various ion beams for research",
        "we design a new compact ECR ion source",
        "so called Kei3. Kei3 is designed based on previous Kei series. In addition",
        "there are three important points: 1) Movable beam extraction system for various extraction current densities",
        "2) An evaporator and MIVOC method for production of ions from solid materials and metal",
        "and 3) Biased disk method and double frequency heating method for heavier ions. Same permanent magnets and microwave system will be used for easy maintenance and the cost effectiveness. Design of the Kei3 source will be described in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP04",
      "page_number": "49",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP05",
      "title": "Charge-breeding at the Texas A&M University Cyclotron Institute",
      "authors": [
        "Texas A&M University Cyclotron Institute",
        "College Station",
        "Texas",
        "USA",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "Texas A&M University",
        "Cyclotron Institute",
        "College Station",
        "USA",
        "The Cyclotron Institute of Texas A&M University is currently involved in an upgrade that is intended to produce beams of radioactive ions suitable for injection into the K500 superconducting cyclotron. As an integral part of this upgrade an electron-cyclotron-resonance ion source (CB-ECRIS) has been specially constructed by Scientific Solutions of San Diego",
        "California for charge-breeding. This CB-ECRIS operates at 14.5 GHz and incorporates a hexapole of the Halbach style. Since radial injection of microwave power is ruled out",
        "this presents special problems for the axial injection of low-charge-state ions for charge-breeding. Efforts at charge-breeding with stable ions will be presented as well as plans for the injection of low-charge-state",
        "radioactive ions from cyclotron-driven ion guides",
        "one for light radioactive ions and one for heavy radioactive ions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp05.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP05",
      "page_number": "51",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP08",
      "title": "Design Report of the AISHA Ion Source for Hadron Therapy Facilities",
      "authors": [
        "G. Ciavola",
        "L. Andò",
        "L. Celona",
        "S. Gammino",
        "D. Mascali",
        "INFN/LNS",
        "Catania",
        "Italy",
        "CNAO Foundation",
        "Milan",
        "Italy",
        "CSFNSM",
        "Catania",
        "Italy",
        "Different facilities for hadrontherapy have been built or designed in the recent past and Italy is present in the field either with synchrotron-based and with cyclotron-based facilities. For both types of accelerators the availability of high brightness multiply charged ion beams is essential and R&D efforts in this subject are increasing. In particular at the CNAO",
        "proton and carbon ion beams will be accelerated up to 400 AMeV by a synchrotron and the beam injection is guaranteed by two identical ECR sources of the SUPERNANOGAN family modified according to the specifications we set. Optimisation of beam emittance and intensity is of primary importance to obtain the necessary current in the RFQ-LINAC and future facilities may require much better performances in terms of beam brightness than the ones provided by such commercial ECRIS. A hadron therapy center is going to be built in Catania and the R&D related to the injector has already started within the frame of a collaboration between the Regional Authority and INFN. The results of the research carried out at INFN-LNS will be presented along with the design of a relatively compact ECR ion source operating at 18 GHz",
        "named AISHA."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp08.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP08",
      "page_number": "54",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP10",
      "title": "Operational Experience with the GTS-LHC Ion Source and Future Developments of the CERN Ion Injector",
      "authors": [
        "D. Küchler",
        "G. Bellodi",
        "A.M. Lombardi",
        "M. O'Neil",
        "R. Scrivens",
        "J.T. Stafford-Haworth",
        "CERN",
        "Geneva",
        "Switzerland",
        "iThemba LABS",
        "Somerset West",
        "South Africa"
      ],
      "institutions": [],
      "abstract": "Since 2010 the GTS-LHC source delivers lead ions for heavy ion physics at the LHC. Several modifications allowed improving the source reliability and the beam stability. The attempts to improve the beam intensity were less successful. The different modifications and actual performance figures will be presented in this paper. In addition to the heavy ion physics program of the LHC new ion species will be requested for different experiments in the future. The fixed target experiment NA61 requires primary Argon and Xenon beams. And a future radio-medical facility asks for light ions in the range Helium to Neon. Approaches to prepare these beams and to modify the ion injector towards a light ion front end are presented.",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp10.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP10",
      "page_number": "57",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP12",
      "title": "Design of Web-based Interface to RIKEN 28 GHz Super-conducting ECR Ion Source and the Future Plan",
      "authors": [
        "Sokendai",
        "Ibaraki",
        "Japan",
        "KEK",
        "Ibaraki",
        "Japan",
        "Y. Higurashi",
        "M. Komiyama",
        "T. Nakagawa",
        "K. Ozeki",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "A new RIKEN 28 GHz superconducting ECR ion source (28 GHz-ECRIS) was constructed in 2009 in order to increase the intensity of Uranium ion beam for RIKEN RI beam factory project(RIBF). For effective and stable operation of the 28 GHz-ECRIS",
        "its client system should have an user-friendly man-machine interface. The ECRIS control system was constructed with the Experimental Physics and Industrial Control System (EPICS) as well as RIBF control system. As a result",
        "it was successful to provide the useful clients",
        "such as the operation GUI panels",
        "the XY chart application",
        "and the data acquisition system in EPICS-based system. On the other hand",
        "to keep beam quality from 28 GHz-ECRIS for a long beam service term",
        "it should be possible to operate the ECRIS by members of ion source team at any time. In order to relieve concern in the overseas business trip of members of ion source team",
        "we designed a real-time web-based client system using WebSocket*",
        "which is a new protocol presented by Internet Engineering Task Force (IETF). In this paper",
        "we report the system and development status in detail.",
        "* I. Fette and A. Melnikov. The WebSocket Protocol",
        "IETF HyBi Working Group. 2011."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp12.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP12",
      "page_number": "61",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP13",
      "title": "Development of Intense Proton ECR Ion Sources at IMP",
      "authors": [
        "Z.M. Zhang",
        "Z.W. Liu",
        "H.Y. Ma",
        "L.T. Sun",
        "Q. Wu",
        "Y. Yang",
        "W.H. Zhang",
        "X.Z. Zhang",
        "H.W. Zhao",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "Since 1997",
        "there have been two ECR ion sources for producing intense proton beam developed at Institute of Modern Physics (IMP). In 1999",
        "a high current 2.45 GHz ECR proton source for Lanzhou university neutron generator",
        "was constructed and tested at IMP. A mixed ion (H1+ + H2+ + H3+) beam current of 110 mA with CW mode was delivered from a single aperture of 6mm diameter with microwave power of 600 W at the extraction voltage of 22 kV. Recently a new pulsed proton source has been designed and built at IMP for the CPHS (Compact Pulse Hadron Source) facility in Tsinghua University. Now this source is under commissioning for 60 mA proton beam with 50 keV energy. The long time running stability and beam emittance have been tested and the results are well up to the requirements of CPHS. In this paper",
        "after a short review of the proton ion source for Lanzhou University",
        "the design and test results of the CPHS proton source as well as the LEBT will be presented. The design of the proton ion source and the LEBT for the Chinese ADS project will also be discussed in the contents."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp13.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP13",
      "page_number": "64",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP14",
      "title": "Beam Experiments with the Grenoble Test Electron Cyclotron Resonance Ion Source at iThemba LABS",
      "authors": [
        "R.W. Thomae",
        "J.L. Conradie",
        "D.T. Fourie",
        "iThemba LABS",
        "Somerset West",
        "South Africa",
        "CERN",
        "Geneva",
        "Switzerland",
        "At iThemba Laboratory for Accelerator Based Sciences a copy of the so-called Grenoble Test Source (GTS) for the production of highly charged ions is installed. The source in combination with the K-200 cyclotron delivers high energy",
        "high intensity beams for nuclear physics experiments. In this paper we present beam experiments with the GTS at iThemba LABS",
        "in which the results of CW",
        "pulsed and afterglow operation for different bias disc voltages and positions are compared."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp14.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP14",
      "page_number": "68",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP17",
      "title": "Installation and Operation of a 28 GHz Gyrotron for the RIKEN Superconducting ECR Ion Source",
      "authors": [
        "J. Ohnishi",
        "Y. Higurashi",
        "T. Nakagawa",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "The RIKEN 28-GHz ECRIS uses a gyrotron microwave source fabricated by Mitsubishi Electric Corporation. The maximum output power is 10 kW. The gyrotron produces TE02-mode microwaves",
        "which are converted into the TE01 mode by a mode converter. In the first test on the gyrotron performed using a dummy load",
        "we observed the 50-300 Hz ripples of ~500 W in the output power of 1-7 kW",
        "and it was difficult to make a stable operation in the low-power. These ripples were reduced to one-tenth by stabilizing the cathode voltage and then the gyrotron could produce microwaves from < 0.5 kW stably. The operation of the ion source with the 28 GHz gyrotron was started in 2011 and the ion source supplied U and Xe beams to the RIBF for two months. The power of the microwaves fluctuated slowly in the range of 870-1250 W",
        "which influenced the beam current from the ion source. This fluctuation was caused by a slight change of the current of the solenoid of the gyrotron depending on the room temperature. We replaced the power supply with new one which has a current stability of 10ppm per day",
        "and stabilized the microwave power in the range of 5% in the operation of 2 kW successfully."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp17.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP17",
      "page_number": "71",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP18",
      "title": "DECRIS-5 Ion Source for DC-110 Cyclotron Complex Results of the First Tests",
      "authors": [
        "A.A. Efremov",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "Yu.K. Kostyukhov",
        "N. Lebedev",
        "V.N. Loginov",
        "Yu. Yazvitsky",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "KVI",
        "Groningen",
        "The Netherlands",
        "The project of the DC-110 cyclotron facility to provide applied research in the nanotechnologies (track pore membranes",
        "surface modification of materials",
        "etc.) has been designed by the Flerov Laboratory of Nuclear Reactions of the Joint Institute for Nuclear Research (Dubna). The facility includes the isochronous cyclotron DC-110 for accelerating the intense Ar",
        "Kr",
        "Xe ion beams with 2.5 MeV/nucleon fixed energy. The cyclotron is equipped with system of axial injection and ECR ion source DECRIS-5",
        "operating at the frequency of 18 GHz. The main parameters of DECRIS-5 ion source and results of the first tests are presented in this report."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp18.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP18",
      "page_number": "74",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 11,
  "scrape_time": "2025-10-10 17:29:16"
}