{
  "session_info": {
    "id": "TUOAA",
    "name": "TUOAA - Contributed Oral Presentations, Hadron Accelerators",
    "url": "https://proceedings.jacow.org/IPAC2014/html/tuoaa.htm"
  },
  "papers": [
    {
      "paper_id": "TUOAA01",
      "title": "Progress Towards Doubling the Beam Power at Fermilab's Accelerator Complex",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "After a 16 month shutdown to reconfigure the Fermilab Accelerators for high power operations",
        "the Fermilab Accelerator Complex is again providing beams for numerous Physics Experiments. By using the Recycler to slip stack protons while the Main Injector is ramping",
        "the beam power at 120 GeV can reach 700 KW",
        "a factor of 2 increase. The progress towards doubling the Fermilab's Accelerator complex beam power will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/tuoaa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/tuoaa01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/tuoaa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-TUOAA01",
      "page_number": "904",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOAA02",
      "title": "Design of the LBNE Beamline",
      "authors": [
        "V. Papadimitriou",
        "R. Andrews",
        "J. Hylen",
        "T.R. Kobilarcik",
        "A. Marchionni",
        "C.D. Moore",
        "P. Schlabach",
        "S. Tariq",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Long Baseline Neutrino Experiment (LBNE) will utilize a beamline facility located at Fermilab to carry out a compelling research program in neutrino physics. The facility will aim a wide band beam of neutrinos toward a detector placed at the Sanford Underground Research Facility in South Dakota",
        "about 1",
        "300 km away. The main elements of the facility are a primary proton beamline and a neutrino beamline. The primary proton beam (60-120 GeV) will be extracted from the MI-10 section of Fermilab’s Main Injector. Neutrinos are produced after the protons hit a solid target and produce mesons which are subsequently focused by a set of magnetic horns into a 204 m long decay pipe where they decay into muons and neutrinos. The parameters of the facility were determined taking into account the physics goals",
        "spacial and radiological constraints and the experience gained by operating the NuMI facility at Fermilab. The initial beam power is expected to be ~1.2 MW",
        "however the facility is designed to be upgradeable for 2.3 MW operation. We discuss here the status of the design and the associated challenges."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/tuoaa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/tuoaa02.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/tuoaa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-TUOAA02",
      "page_number": "907",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOAA03",
      "title": "Extra Low ENergy Antiproton ring ELENA: From the Conception to the Implementation Phase",
      "authors": [
        "C. Carli",
        "W. Bartmann",
        "P. Belochitskii",
        "H. Breuker",
        "F. Butin",
        "T. Eriksson",
        "S. Maury",
        "S. Pasinelli",
        "G. Tranquille",
        "CERN",
        "Geneva",
        "Switzerland",
        "Johannes Gutenberg University Mainz",
        "Institut für Physik",
        "Mainz",
        "Germany"
      ],
      "institutions": [
        "The Extra Low Energy Antiproton ring (ELENA) is a CERN project aiming at constructing a small 30 m circumference synchrotron to further decelerate antiprotons from the Antiproton Decelerator AD from 5.3 MeV to 100 keV. Controlled deceleration in a synchrotron equipped with an electron cooler to reduce emittances in all three planes will allow the existing AD experiments to increase substantially their antiproton capture efficiencies and render new experiments possible. The ELENA design is now well advanced and the project is moving to the implementation phase. Component design and construction are taking place at present for installation foreseen during the second half of 2015 and beginning of 2016 followed by ring commissioning until the end of 2016. New electrostatic transfer lines to the experiments will be installed and commissioned during the first half of 2017 followed by the first physics operation with ELENA. Basic limitations like Intra Beam Scattering limiting the emittances obtained under electron cooling and direct space charge effects will be reviewed and the status of the project will be reported."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/tuoaa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/tuoaa03.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/tuoaa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-TUOAA03",
      "page_number": "910",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 20:40:13"
}