{
  "session_info": {
    "id": "WEPTEV",
    "name": "WEPTEV - Wednesday Poster SRF Technologies",
    "url": "https://proceedings.jacow.org/srf2021/html/weptev.htm"
  },
  "papers": [
    {
      "paper_id": "WEPTEV002",
      "title": "High Power Coupler Devepment for EIC",
      "authors": [
        "W. Xu",
        "Z.A. Conway",
        "J.M. Fite",
        "D. Holmes",
        "K.S. Smith",
        "A. Zaltsman",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "The future EIC Electron storage ring at BNL needs to compensate up to 10 MW synchrotron loss with RF systems. The RF system relies on 34 fundamental power couplers to deliver RF power from power sources at room temperature to 17 SRF cavities at 2 K. Each power coupler will operate with 400 kW forward power",
        "with full reflection for ~10% of time. We are developing two 1 MW coaxial FPCs at BNL",
        "one with a BeO window and the other with an Al2O3 window. This paper will briefly summarize test results of high power test on the BeO window FPC",
        "and then describe the development status of the Al2O3 window FPC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/weptev002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/weptev002.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/weptev002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPTEV002",
      "page_number": "632",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPTEV003",
      "title": "A Superconducting Magnetic Shield for SRF Modules with Strong Magnetic Field Sources",
      "authors": [
        "J. Völker",
        "A. Frahm",
        "S. Keckert",
        "J. Knobloch",
        "A.N. Matveenko",
        "A. Neumann",
        "H. Plötz",
        "Y. Tamashevich",
        "HZB",
        "Berlin",
        "Germany",
        "University of Siegen",
        "Siegen",
        "Germany",
        "Frequently SRF modules require strong focusing magnets close to SRF cavities. The shielding of those magnetic fields to avoid flux trapping",
        "for example during a quench",
        "is a challenge. At HZB",
        "the bERLinPro photo-injector module includes a 1.4 cell SRF cavity placed in close proximity to a superconducting (SC) focusing solenoid. At full solenoid operation",
        "parts of the double mu-metal shield are expected to saturate. To prevent saturation",
        "we developed a new superconducting Meissner-Shield. Several tests of different designs were performed both in the injector module and in the HoBiCaT test facility. The measured results of the final design show a significant shielding that are in good agreement with calculations. Based on these results",
        "a reduction of the magnetic flux density in the mu-metal shields of almost one order of magnitude is expected The design has now been incorporated in the injector module. In this paper we will present the design",
        "the setup and results of the final testing of the superconducting shield."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/weptev003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/weptev003.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/weptev003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPTEV003",
      "page_number": "637",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPTEV007",
      "title": "Review of the Application Piezoelectric Actuators  for SRF Cavity Tuners",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Large SRF Linacs and HEP experiments require accurate frequency control",
        "which is achieved using cavity tuners typically actuated by the piezoelectric ceramic stacks. The piezoelectric ceramic stacks became ’standard’ components of the SRF cavity tuner and",
        "depending on the application",
        "could be operated in the different environment: in air",
        "at cryogenic temperature",
        "in vacuum",
        "and submerged in liquid helium. Different applications place different requirements on the piezo actuators",
        "but the important parameters",
        "common to all applications",
        "are the lifetime and reliability of the actuators. Several R&D programs targeting the development of reliable piezo actuators are reviewed in this contribution."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/weptev007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/weptev007.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/weptev007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPTEV007",
      "page_number": "642",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPTEV008",
      "title": "VSR Demo Cold String: Recent Developments and Manufacturing Status",
      "authors": [
        "N. Wunderer",
        "V. Dürr",
        "A. Frahm",
        "H.-W. Glock",
        "F. Glöckner",
        "J. Knobloch",
        "E. Sharples-Milne",
        "A.V. Tsakanian",
        "A. Veléz",
        "HZB",
        "Berlin",
        "Germany",
        "M. Bonezzi",
        "A. D’Ambros",
        "R. Paparella",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "J. Guo",
        "J. Henry",
        "R.A. Rimmer",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "University of Siegen",
        "Siegen",
        "Germany",
        "Technical University Dortmund",
        "Dortmund",
        "Germany",
        "The BESSY VSR project aims to demonstrate the possibility to simultaneously run both long (15ps) and short bunches (1.7ps) within BESSY II storage ring. To achieve this",
        "a new SRF cavity system with higher harmonic cavities (3 and 3.5 harm.) needs to be installed. The combined cavity SRF beating allows for stable bunch shortening for half of the buckets while standard lengths remaining for the other half. These SRF cavities will be equipped with waveguide-connected HOM absorbers and will be controlled with a blade tuner plus piezos. To demonstrate the feasibility of this complex system the VSR DEMO cold string consists of two 1.5 GHz cavities",
        "each featuring five waveguides and a higher power coupler",
        "plus all interconnecting elements coupled to the beam vacuum. For most of these components the fundamental development work is completed and has been reported in the past. This paper summarizes recent enhancements",
        "component detailing and manufacturing status. The key cold string components such as cavities",
        "higher power couplers and blade tuners have already entered the manufacturing phase. All other cold string components will be ready for purchase at the latest beginning of 2022."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/weptev008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/weptev008.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/weptev008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPTEV008",
      "page_number": "647",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPTEV009",
      "title": "The 1.5 GHz Coupler for VSR DEMO: Final Design Studies, Fabrication Status and Initial Testing Plans",
      "authors": [
        "E. Sharples-Milne",
        "V. Dürr",
        "J. Knobloch",
        "S. Schendler",
        "A. Veléz",
        "N. Wunderer",
        "HZB",
        "Berlin",
        "Germany",
        "University of Siegen",
        "Siegen",
        "Germany",
        "Technical University Dortmund",
        "Dortmund",
        "Germany",
        "The variable pulse length storage ring demo (VSR DEMO) is a research and development project at the Helmholtz Zentrum Berlin (HZB) to develop and validate a 1.5 GHz SRF system capable of accelerating high CW currents (up to 300 mA) at high accelerating fields (20 MV/m) for application in electron storage rings. Such a system can be employed to tailor the bunch length in synchrotron light source such as BESSY II. VSR DEMO requires a module equipped with two 1.5 GHz 4-cell SRF cavities and all ancillary components required for accelerator operations. This includes one 1.5 GHz fundamental power coupler (FPC) per cavity",
        "designed to handle 16 kW peak and 1.5 kW average power. The final design studies",
        "fabrication status and initial testing plans for these FPCs will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/weptev009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/weptev009.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/weptev009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPTEV009",
      "page_number": "652",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPTEV011",
      "title": "Development of In-Situ Plasma Cleaning for the FRIB SRF Linac",
      "authors": [
        "C. Zhang",
        "W. Chang",
        "K. Elliott",
        "W. Hartung",
        "S.H. Kim",
        "J.T. Popielarski",
        "K. Saito",
        "T. Xu",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Development of techniques for in-situ plasma cleaning of quarter-wave and half-wave resonator cryomodules is underway at the Facility for Rare Isotope Beams (FRIB) at Michigan State University. If SRF cavity performance degradation is seen during future FRIB linac operation",
        "in-situ plasma cleaning may help to restore performance without disassembly of the cavities from the cryomodules for off-line cleaning. A plasma cleaning feasibility study for FRIB cryomodules indicates that plasma cleaning can be done on-line without modifications to the RF couplers or cryomodules. Initial bench measurements have been performed on a FRIB half-wave resonator using noble gases (Ne",
        "Ar)",
        "with and without added oxygen gas. The plasma ignition threshold has been measured as a function of gas pressure and composition. Studies of plasma cleaning efficacy are underway. Results will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/weptev011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/weptev011.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/weptev011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPTEV011",
      "page_number": "657",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPTEV012",
      "title": "Characterization of Atomic-Layer-Deposited NbTiN and NbTiN/AlN Films for SIS Multilayer Structures",
      "authors": [
        "Z. Sun",
        "M. Liepe",
        "T.E. Oseroff",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "University of Virginia",
        "Charlottesville",
        "Virginia",
        "USA",
        "SIS (superconductor-insulator-superconductor) mul-tilayer structures are proposed designs to repel early flux penetration and ease the impact of defects in SRF cavities. The demonstration of such device physics is strongly affected by the film qualities ’ material struc-ture and composition. Here",
        "we characterized 100 nm NbTiN / 2 nm AlN / bulk Nb SIS structures and investigated the effect of the presence of the AlN layer on the NbTiN film properties. We find that the hcp-structured AlN layer results in a Nb composition gra-dient as a function of film depth",
        "whereas the Nb con-centration remains constant in the NbTiN/Nb samples",
        "which suggests that interface mismatch could induce significant change in NbTiN composition. The surface composition variation further leads to different oxide structures",
        "which might impact the superconducting performance. Our observations indicate that the choice of the insulating layer in SIS structures is critical",
        "and that interface mismatch together with internal strain could deteriorate the superconducting film."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/weptev012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/weptev012.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/weptev012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPTEV012",
      "page_number": "662",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPTEV013",
      "title": "New Frequency-Tuning System and Digital LLRF for Stable and Reliable Operation of SRILAC",
      "authors": [
        "K. Suda",
        "O. Kamigaito",
        "K. Ozeki",
        "N. Sakamoto",
        "K. Yamada",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "H. Hara",
        "A. Miyamoto",
        "K. Sennyu",
        "T. Yanagisawa",
        "MHI-MS",
        "Kobe",
        "Japan",
        "E. Kako",
        "H. Nakai",
        "H. Sakai",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "The superconducting booster linac at RIKEN (SRILAC) has ten 73-MHz quarter-wavelength resonators (QWRs) that are contained in three cryomodules. The beam commissioning of SRILAC was successfully performed in January 2020. Frequency tuning during cold operation is performed by compressing the beam port of the cavity with stainless wires and decreasing the length of each beam gap",
        "similar to the method adopted at ANL and FRIB. However",
        "each tuner is driven by a motor connected to gears",
        "instead of using gas pressure. Since the intervals of the QWRs are small due to the beam dynamics",
        "a compact design for the tuner was adopted. Each cavity was tuned to the design frequency",
        "which required frequency changes of 3 kHz to 7 kHz depending on the cavity. Although no piezoelectric actuator is mounted on the tuning system",
        "phase noise caused by microphonics can be sufficiently reduced by a phase-locked loop using a newly developed digital LLRF. The details of the tuning system as well as the digital LLRF will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/weptev013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/weptev013.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/weptev013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPTEV013",
      "page_number": "666",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPTEV015",
      "title": "Design of the 650 MHz High Beta Prototype Cryomodule for PIP-II at Fermilab",
      "authors": [
        "V. Roger",
        "S.K. Chandrasekaran",
        "S. Cheban",
        "M. Chen",
        "J. Helsperpresenter",
        "J.P. Holzbauer",
        "Y.M. Orlov",
        "V. Poloubotko",
        "B. Squires",
        "N. Tanovic",
        "G. Wu",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "N. Bazin",
        "O. Napoly",
        "C. Simon",
        "CEA-DRF-IRFU",
        "France",
        "R. Cubizolles",
        "M. Lacroix",
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "RRCAT",
        "Indore (M.P.)",
        "India",
        "The Proton Improvement Plan II (PIP-II) is the first U.S. accelerator project that will have significant contributions from international partners. The prototype High Beta 650 MHz cryomodule (pHB650 CM) is designed by an integrated design team",
        "consisting of Fermilab (USA)",
        "CEA (France)",
        "UKRI-STFC (UK)",
        "and RRCAT (India). The manufacturing & assembly of this prototype cryomodule will be done at Fermilab",
        "whereas the production cryomodules will be manufactured and/or assembled by UKRI-STFC",
        "RRCAT",
        "or Fermilab. Similar to the prototype Single Spoke Resonator 1 cryomodule (pSSR1 CM)",
        "this cryomodule is based on a strong-back at room temperature supporting the coldmass. The pSSR1 CM led to significant lessons being learnt on the design",
        "procurement",
        "and assembly processes. These lessons were incorporated into the design and processes for the pHB650 CM. Amongst many challenges faced",
        "the main challenges of the pHB650 CM design were to make the cryomodule compatible to overseas transportation and to design components that can be procured in USA",
        "Europe",
        "and India."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/weptev015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/weptev015.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/weptev015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPTEV015",
      "page_number": "671",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPTEV016",
      "title": "Field Emission Studies During ESS Cryomodule Tests at CEA Saclay",
      "authors": [
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "M. Baudrier",
        "G. Devanz",
        "L. Maurice",
        "O. Piquet",
        "CEA-DRF-IRFU",
        "France",
        "For the development of efficient superconducting cavi-ties",
        "field emission is an important parasitic phenomena to monitor. A diagnostic system composed of Geiger-Mueller (G-M) probes",
        "NaI(Tl) scintillators are placed in the cryomodule test stand. Collected data is analysed and confronted to particle tracking simulation and electro magnetic shower code. With such systematic analysis we aim to identify the most probable field emission location and hence help to improve clean procedures during as-sembly and operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/weptev016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/weptev016.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/weptev016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPTEV016",
      "page_number": "677",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPTEV017",
      "title": "Transportation Analysis of the Fermilab High-Beta 650 MHz Cryomodule",
      "authors": [
        "J. Helsper",
        "S. Chebanpresenter",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Northern Illinois University",
        "DeKalb",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/weptev017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/weptev017.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/weptev017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPTEV017",
      "page_number": "682",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 11,
  "scrape_time": "2025-10-11 03:07:10"
}