{
  "session_info": {
    "id": "THXA",
    "name": "THXA - Cavity II",
    "url": "https://proceedings.jacow.org/srf2017/html/thxa.htm"
  },
  "papers": [
    {
      "paper_id": "THXA01",
      "title": "Conditioning and Operation of Superconducting Half-wave Resonators  for C-ADS Injector",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "HWR010 and HWR015 are used in China ADS at Institute of Modern Physics. There are two CM with HWR010s and one CM with HWR015s will accelerate proton from 2.1 MeV to above 17MeV. The coupler",
        "cavity conditioning and operation will present in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thxa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thxa01.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thxa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THXA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THXA02",
      "title": "Fabrication and Testing of Balloon Single Spoke Resonator",
      "authors": [
        "Z.Y. Yao",
        "R.E. Laxdal",
        "B. Matheson",
        "B.S. Waraich",
        "V. Zvyagintsev",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "A balloon variant of the single spoke resonator (SSR) has been designed",
        "fabricated and tested. The cavity is the SSR1 prototype for the RISP project in Korea. The cavity is specifically designed to reduce the likelhood of multipacting barriers near the operating point. The basic design",
        "fabrication experience and first cold test results will be reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thxa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thxa02.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thxa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THXA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THXA03",
      "title": "Crab Cavities for the High-luminosity LHC",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "As a first step towards the realization of crab crossing for HL-LHC",
        "two superconducting crab cavities are foreseen to be tested with proton beams for the first time in the SPS. The progress on the cavity fabrication",
        "RF test results",
        "cryomodule development and integration into the SPS are presented. Some aspects of the beam tests with crab cavities in the SPS are outlined."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thxa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thxa03.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thxa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THXA03",
      "page_number": "695",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXA04",
      "title": "Fabrication, Treatment and Test of Large Grain Cavities",
      "authors": [
        "J.K. Hao",
        "J.E. Chen",
        "L.W. Feng",
        "L. Lin",
        "K.X. Liu",
        "S.W. Quan",
        "F. Wang",
        "H.M. Xie",
        "F. Zhu",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Development of SRF technology has been included in the project of Soft X-ray FEL (SXFEL) for a hard X-ray FEL plan in China which would be operated in CW mode. Six 9-cell TESLA type cavities as well as several single-cell cavities made of Ningxia large grain niobium material have been fabricated by Peking University for achieving high gradient and high intrinsic quality factor Q0. The measurements of gradient and Q0 have been carried out with a new vertical test system at PKU. The process of fabrication",
        "surface treatment and test results of these large grain cavities will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thxa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thxa04.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thxa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THXA04",
      "page_number": "700",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXA05",
      "title": "Thermal Mapping for SRF with Transition Edge Sensors",
      "authors": [
        "H. Furci",
        "T. Koettig",
        "G. Vandoni",
        "CERN",
        "Geneva",
        "Switzerland",
        "Amongst the second sound detectors",
        "Oscillating Superleak Transducers (OST) have been widely used in the field of thermal mapping for SRF cavities. Less commonly used",
        "Transition Edge Sensors (TES) present the advantage over the OSTs of providing a better spatial resolution and an intensity response linear with the heat flux from the hot spot. The TES is a thin-film thermal sensor",
        "whose electric resistance varies steeply only within the superconducting-to-normal transition. Range is limited to the transition edge (around 200 mK)",
        "which can be tuned in temperature by a bias current. The temperature variations associated with second-sound in superfluid helium are then visible as proportional changes of the voltage drop across the film strip. Dedicated TES for operation in superfluid helium have been developed in collaboration with CMi-EPFL Lausanne and characterized at CERN. The paper will illustrate this recent development",
        "the application of TES to quench detection from bulk Nb cavities in comparison with OSTs and their use to construct a contactless 3D thermal mapping array operating in superfluid helium."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thxa05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thxa05.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thxa05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THXA05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THXA06",
      "title": "Advanced OST System for the Second-sound Test of Fully Dressed Cavities",
      "authors": [
        "HZB",
        "Berlin",
        "Germany",
        "University of Hamburg",
        "Hamburg",
        "Germany",
        "Cavities which exhibit a low field quench are normally discarded from usage in accelerator projects. However",
        "they can be repaired if the exact location of the quench is known. Optical inspection alone cannot reliably locate the source of a quench. Methods that directly measure the quench",
        "such as thermometry or second sound detection",
        "could so far only be performed at undressed cavities. A new",
        "specially designed",
        "second-sound system for the first time allows the localization of the quench in multicell cavities equipped with a helium vessel. It can be easily installed in the helium pipe of the cavity. Information on the quench location can be acquired during a standard rf test. A new algorithm localizes the quench based on the real path of the second-sound wave around the cavity surface",
        "rather than using simple triangulation. The implemented pathfinding method leads to a high precision and high accuracy of the quench location. This was verified by testing standard dressed 9-cell XFEL cavities. The system can be easily applied to other cavity shapes and sizes."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thxa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thxa06.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thxa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THXA06",
      "page_number": "703",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXA07",
      "title": "Progress with Bipolar HF-free EP and other VEP of Niobium Cavities",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "In collaboration with Faraday Technologies and KEK",
        "JLab has been developing HF-free EP of Nb cavities via pulse-reversed electropolishing using several different HF-free electrolytes. Bench-scale process analytics have yielded a systematic way of characterizing the processes",
        "identifying effective polishing parameters",
        "and are guiding application to single and multi-cell cavities. JLab has developed a low-cost pulse control technique and implemented it in a vertical EP processing tool integrated into the JLab cleanroom suite. The polishing process dynamics for different electrolytes",
        "the implementation in the JLab tool",
        "and the effectiveness in application to single cell and multi-cell cavities will be reviewed. VEP development work at Cornell includes both HF-free EP and the HF-based electrolyte using novel cathode and stirring configuration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thxa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thxa07.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thxa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THXA07",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THXA08",
      "title": "Review of Heat Treatments for Low Beta Cavities : What's So Different from Elliptical Cavities",
      "authors": [
        "IPN",
        "Orsay",
        "France",
        "Heat treatments done for low beta (low frequency) cavities are usually",
        "due to the lack of feedback",
        "inspired from elliptical (high frequency) cavity results. Is that still relevant now that experimental data are available thanks to the florishing business of low beta structures (Spiral2",
        "ESS",
        "FRIB",
        "C-ADS",
        "MYRRHA",
        "PROJECTX",
        "…). These 2 families are moreover not usually operating in the same resistance regime (BCS and residual). The paper will review procedures applied and results obtained on different type of cavities (Quarter-Wave resonator",
        "Half-Wave resonator and Spoke) and different temperature treatments (low temperature baking",
        "hydrogen degassing",
        "nitrogen doping",
        "…) and compare these to elliptical cavities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thxa08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thxa08.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thxa08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THXA08",
      "page_number": "708",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXA09",
      "title": "Results and New Insights from Vertical Testing of LCLS-II Production Cavities",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA"
      ],
      "institutions": [
        "Production of 9-cell cavities for LCLS-II is now well underway. 280 cavities will be produced by the conclusion of the project and will be tested by Fermilab and Jefferson Lab prior to cryomodule string assembly. The cavities have been manufactured by Research Instruments GmbH and Ettore Zanon S.p.a. and represent the first industrially produced nitrogen-doped cavities. Here the results from the vertical tests of the cavities received so far are presented. First results show that nitrogen-doping leads to the highest Q0 values achieved in SRF cavities produced for a large-scale project. This has been not without challenges however, and we discuss new findings with regards to flux expulsion, intrinsic residual resistance, and cavity preparation techniques that limited cavity performance in the beginning of production. These new findings and material studies are important for future accelerators so that high Q0 performance can be reliably achieved for large projects."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thxa09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thxa09.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thxa09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THXA09",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 9,
  "scrape_time": "2025-10-11 03:43:36"
}