{
  "session_info": {
    "id": "MOPFDV",
    "name": "MOPFDV - Monday Poster Fundamental Development and Research",
    "url": "https://proceedings.jacow.org/srf2021/html/mopfdv.htm"
  },
  "papers": [
    {
      "paper_id": "MOPFDV001",
      "title": "Investigation of an Alternative Path for SRF Cavity Fabrication and Surface Processing",
      "authors": [
        "O. Hryhorenko",
        "D. Longuevergne",
        "Université Paris-Saclay",
        "CNRS/IN2P3",
        "IJCLab",
        "Orsay",
        "France",
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "ICMMO",
        "Orsay",
        "France",
        "KEK",
        "Ibaraki",
        "Japan",
        "The preparation of SRF cavities includes a lengthy",
        "costly",
        "and safety issued electrochemical polishing (EP or BCP) step to remove the damaged layer coming from the cavity fabrication. We have shown that most of the damage layer is originated from the rolling process during the preparation of the sheet material",
        "while subsequent deep drawing tends to leave only µm thick damage layer. We propose a 2-steps mechanical process that allows us to easily get rid of the thick damage layer on the sheets before cavity forming. The process has been established on samples and extended to large disks ready for 1.3 GHz half-cell forming. The polished sheets will be then sent to KEK for half-cell forming and subsequent surface and material analysis before proceeding to half-cell welding. Former studies on the sample demonstrated that damages induced by forming can successfully be removed by recrystallization and less than 10 µm final chemistry."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopfdv001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopfdv001.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopfdv001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPFDV001",
      "page_number": "319",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPFDV002",
      "title": "High Density Mapping Sytems for SRF Cavities",
      "authors": [
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "KEK",
        "Ibaraki",
        "Japan",
        "Y. Iwashita",
        "Y. Kuriyama",
        "Kyoto University",
        "Research Reactor Institute",
        "Osaka",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "High density mapping systems for superconducting cavities are prepared. They include sX-map",
        "XT-map and B-map. Each strip of the sX-map system has 32 X-ray sensors approximately 10 mm apart",
        "which can be installed under the stiffener rings to show uniform higher sensitivities. This is suitable to get X-ray distribution around iris areas. The XT-map system enables temperature distribution mapping of cavity cells with high spatial resolution at approximately 10 mm intervals in both azimuth and latitude. It also gives X-ray distribution on cells",
        "as well. Magnetic field distributions can be obtained by B-map system using AMR sensors. Since all these systems are based on the technology of multiplexing at cryogenic side",
        "less number of wires can carry the huge number of signals. The systems are described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopfdv002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopfdv002.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopfdv002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPFDV002",
      "page_number": "323",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFDV003",
      "title": "Measuring Flux Trapping Using Flat Samples",
      "authors": [
        "F. Kramer",
        "S. Keckert",
        "J. Knobloch",
        "O. Kugeler",
        "HZB",
        "Berlin",
        "Germany",
        "University of Siegen",
        "Siegen",
        "Germany",
        "With modern superconducting cavities flux trapping is a limiting factor for the achievable quality factor. Flux trapping is influenced by various parameters such as geometry",
        "material",
        "and cooldown dynamics. At SRF2019 we presented data showing the magnetic field surrounding a cavity. We now present supplemental simulations for this data focusing on geometric effects. As these simulations are inconclusive",
        "we have designed a new setup to measure trapped flux in superconducting samples which is presented as well. The advantages compared to a cavity test are the simpler sample geometry",
        "and quicker sample production",
        "as well as shorter measurement times. With this setup we hope to identify fundamental mechanisms of flux trapping",
        "including geometry effects",
        "different materials",
        "and different treatments. First results are presented along with the setup itself."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopfdv003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopfdv003.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopfdv003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPFDV003",
      "page_number": "326",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFDV008",
      "title": "SRF Levitation and Trapping of Nanoparticles",
      "authors": [
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "P. Dhakal",
        "B.J. Kross",
        "F. Marhauser",
        "J.E. McKisson",
        "J. Musson",
        "H. Wang",
        "A. Weisenberger",
        "W.Z. Xi",
        "JLab",
        "Newport News",
        "Virginia",
        "USA"
      ],
      "institutions": [],
      "abstract": "A proposal has been conceived to levitate and trap mesoscopic particles using radio frequency (RF) fields in a superconducting RF(SRF) cavity. Exploiting the intrinsic characteristics of an SRF cavity, this proposal aims at overcoming a major limit faced by state-of-the-art laser trapping techniques. The goal of the proposal is to establish a foundation to enable observation of quantum phenomena of an isolated mechanical oscillator interacting with microwave fields. An experiment supported by LDRD funding at JLab has started to address R&D issues relevant to these new research directions using existing SRF facilities at JLab. The success of this experiment would establish its groundbreaking relevance to quantum information science and technology, which may lead to applications in precision force measurement sensors, quantum memories, and alternative quantum computing implementations with promises for superior coherence characteristics and scalability well beyond the start-of-the-art. In this contribution, we will introduce the proposal and basic consideration of the experiment.",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopfdv008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopfdv008.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopfdv008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPFDV008",
      "page_number": "331",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPFDV009",
      "title": "On the Nature of Surface Defects Found in 2/0 N-Doped 9-Cell Cavities",
      "authors": [
        "A. Cano",
        "D. Bafia",
        "A. Grassellino",
        "J. Lee",
        "M. Martinello",
        "A.S. Romanenko",
        "T. Spina",
        "Z-H. Sung",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "In this contribution",
        "we present a systematic study on the microstructure of 1.3 GHz 9-cell TESLA type SRF cavity",
        "processed with 2/0 Nitrogen-doping surface treatment",
        "to explain the premature quench phenomena commonly observed in N-doping treated cavities. The microstructure characterization was carried out using Secondary electron images",
        "advanced metallurgical techniques such as EBSD in parallel with chemical information obtained from spectroscopic techniques. The most remarkable difference is observed in the ends-cavities (1 and 9)",
        "which showed roughening of the surface",
        "revealing a series of morphologies associated with Nb cubic phase. The cell-to-cell analysis also showed standard features such as pits with different geometry and distribution",
        "located in grains and grain boundaries. The defects found in this system suggest that the standard electropolishing chemical etching was insufficient to eliminate history defects produced during the manufacture of the cavity",
        "without discarding the role of the impurities",
        "N and O",
        "that could have induced the growth of these morphologies.",
        "H. Padamsee",
        "RF superconductivity (Wiley-VCH Verlag GmbH and Co.",
        "KGaA",
        "Weinheim",
        "2009)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopfdv009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopfdv009.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopfdv009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPFDV009",
      "page_number": "336",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPFDV010",
      "title": "Microstructure Changes Observed in the Near-Surface Region of SRF Nb Cavities Cutouts upon Cooling/Heating Cycles Using GI-Synchrotron XRD",
      "authors": [
        "A. Cano",
        "D. Bafia",
        "A. Grassellino",
        "J. Lee",
        "M. Martinello",
        "A.S. Romanenko",
        "T. Spina",
        "Z-H. Sung",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "We have mapped microstructural changes in the near-surface region of Nb from SRF cavity-cutouts upon thermal cycles in the range from 300 to 30 K using grazing incidence synchrotron X-Ray diffraction (GIXRD). Segregation of secondary phases was observed after the thermal cycle",
        "and their nature has been clarified and discussed in view of previous studies on hydrides formation in SRF bulk Nb cavities. The temperature dependence of the relative population of these formed phases was obtained from GIXRD patterns profile fitting. Both",
        "Nb bulk matrix and the new phases formed after cool-down show specific structural features as thermal contraction/expansion",
        "structural transitions",
        "and Nb lattice variation due to the induced strain by precipitates formation. The information derived from this structural study can explain some phenomena as the dissipation at high accelerating field (i.e. High Field Q Slope",
        "HFQS) in the Nb SRF performance as well as new mechanisms never addressed in previous studies.",
        "A Romanenko",
        "F Barkov",
        "LD Cooley",
        "A Grassellino",
        "Proximity breakdown of hydrides in superconducting niobium cavities",
        "Superconductor Science and Technology",
        "2013"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopfdv010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopfdv010.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopfdv010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPFDV010",
      "page_number": "339",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 03:03:08"
}