{
  "session_info": {
    "id": "WEIXSP",
    "name": "WEIXSP - Invited Orals: Novel Particle Sources and Acceleration Techniques",
    "url": "https://proceedings.jacow.org/ipac2022/html/weixsp.htm"
  },
  "papers": [
    {
      "paper_id": "WEIXSP1",
      "title": "Towards High-Repetition Rate Petawatt Laser Experiments with Cryogenic Jets Using a Mechanical Chopper System",
      "authors": [
        "M. Rehwald",
        "S. Assenbaum",
        "C. Bernert",
        "U. Schramm",
        "K. Zeilpresenter",
        "HZDR",
        "Dresden",
        "Germany",
        "C.B. Curry",
        "M. Gauthier",
        "S.H. Glenzer",
        "C. Schoenwaelder",
        "F. Treffert",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "EuXFEL",
        "Schenefeld",
        "Germany",
        "Laser-plasma based ion accelerators require suitable high-repetition rate target systems that enable systematic studies at controlled plasma conditions and application-relevant particle flux. Self-refreshing",
        "micrometer-sized cryogenic jets have proven to be an ideal target platform. Yet",
        "operation of such systems in the harsh environmental conditions of high power laser induced plasma experiments have turned out to be challenging. Here we report on recent experiments deploying a cryogenic hydrogen jet as a source of pure proton beams generated with the PW-class ultrashort pulse laser DRACO. Damage to the jet target system during application of full energy laser shots was prevented by implementation of a mechanical chopper system interrupting the direct line of sight between the laser plasma interaction zone and the jet source."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/weixsp1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/weixsp1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/weixsp1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-WEIXSP1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:39:29"
}