{
  "session_info": {
    "id": "TUOBNO",
    "name": "TUOBNO - Technology III",
    "url": "https://proceedings.jacow.org/FEL2013/html/tuobno.htm"
  },
  "papers": [
    {
      "paper_id": "TUOBNO01",
      "title": "Beam Diagnostics for Coherent Optical Radiation Induced by the Microbunching Instability",
      "authors": [
        "Fermilab",
        "Batavia",
        "USA",
        "The generation of the ultrabright beams required by modern free-electron lasers (FELs) has generally relied on chicane-based bunch compressions that often result in the microbunching instability. Following compression",
        "spectral enhancements can extend even into the visible wavelengths through the longitudinal space charge impedances. Optical transition radiation (OTR) screens have been extensively used for transverse electron beam size measurements for the bright beams",
        "but the presence of longitudinal microstructures (microbunching) in the electron beam or the leading edge spikes can result in strong",
        "localized coherent enhancements (COTR) that mask the actual beam profile. We now have evidence for the effects in both rf photocathode-gun injected linacs* and thermionic-cathode-gun injected linacs**. Since the first observations",
        "significant efforts have been made to characterize",
        "model",
        "and mitigate COTR effects on beam diagnostics. An update on the state-of-the-art for diagnosing these effects will be given as illustrated by examples at APS",
        "LCLS",
        "SCSS",
        "SACLA",
        "and NLCTA.",
        "*A.H. Lumpkin et al.",
        "Phys. Rev. ST Accel. Beams 12",
        "040704 (2009). **H. Tanaka",
        "\"Commissioning of the Japanese XFEL at Spring8",
        "Proceedings of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tuobno01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tuobno01.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tuobno01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUOBNO01",
      "page_number": "169",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOBNO02",
      "title": "Optical-EUV Pump and Probe Experiments With Variable Polarization on the Newly Open LDM Beamline of FERMI@Elettra",
      "authors": [
        "P. Finetti",
        "R. Borghes",
        "C. Callegari",
        "P. Cinquegrana",
        "M.B. Danailov",
        "A.A. Demidovich",
        "C. Fava",
        "S. Gerusina",
        "C. Grazioli",
        "R. Ivanov",
        "G. Kurdi",
        "M. Lonza",
        "N. Mahne",
        "I. Nikolov",
        "L. Pivetta",
        "O. Plekan",
        "L. Raimondi",
        "P. Sigalotti",
        "C. Svetina",
        "D. Zangrando",
        "M. Zangrando",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "L. Avaldi",
        "P. Bolognesi",
        "M. Coreno",
        "P. O’Keeffe",
        "CNR - IMIP",
        "Trieste",
        "Italy",
        "University of Nova Gorica",
        "Nova Gorica",
        "Slovenia",
        "Università degli Studi di Trieste",
        "Trieste",
        "Italy",
        "M. Ilchen",
        "T. Mazza",
        "M. Meyer",
        "A.J. Rafipoor",
        "XFEL. EU",
        "Hamburg",
        "Germany",
        "Tohoku University",
        "Institute of Multidisciplinary Research for Advanced Materials",
        "Sendai",
        "Japan",
        "Two color experiments are now available to users at the low-density matter beamline (LDM) operating at the Free Electron Laser (FEL) source FERMI@Elettra [1]. The seeded FEL method used at FERMI allows generation of high power",
        "coherent pulses in the femtosecond regime",
        "with a high level of shot-to-shot stability. Variable polarization is also available. LDM is dedicated to atomic",
        "molecular and cluster physics. The LDM end-station",
        "equipped with a velocity map imaging and a time-of-flight detector [2]",
        "is an ideal tool to characterize fast multiphoton processes. LDM was open to users in December 2012 and in February 2013 performed its first pump and probe experiment on photoionization of atomic He and generation of spectral sidebands. The FERMI FEL-1 source",
        "delivered EUV photons with several tens of microjoule per pulse (about 100 fs wide) in a tunable wavelength range from 65 to 20 nm",
        "while the 780 nm",
        "optical pulses were from the same Ti:sapphire laser used to form the FEL seed pulse. This paper gives details about the pump and probe experimental setup and shows the straightforward use of the pump and probe data to measure the FEL pulse width.",
        "[1] E. Allaria et al.",
        "Nature Photonics",
        "6",
        "699 (2012).  [2] V. Lyamayev et al.",
        "J. Phys B: At. Mol. Opt. Phys.-B/466820/SPE/12380"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tuobno02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tuobno02.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tuobno02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUOBNO02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUOBNO03",
      "title": "An RF Deflecting Cavity Based Spreader System for Next Generation Light Sources",
      "authors": [
        "C. Sun",
        "L.R. Doolittle",
        "P. Emma",
        "J.-Y. Jung",
        "M. Placidi",
        "A. Ratti",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Lawrence Berkeley National Laboratory (LBNL) is developing design concepts for a multi-beamline (up to 10 lines) soft x-ray FEL array powered by a superconducting linear accelerator with a high bunch repetition rate of approximately one MHz. The FEL array requires a beam spreader system which can distribute individual electron bunches from the linac to each independently configurable beamline. We propose a new spreader system using RF deflecting cavities to deflect electron bunches as an alternative design to the fast kicker scheme. This RF approach offers more stable deflection amplitude while removing the limitations on the bunch repetition rate characteristic of the kicker approach. In this work",
        "we describes the design concept of this RF based spreader system",
        "including technical choices",
        "design parameters and beamline optics.",
        "[1] M. Placidi et al.",
        "Proceedings of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tuobno03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tuobno03.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tuobno03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUOBNO03",
      "page_number": "173",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOBNO04",
      "title": "Femtosecond Electron and X-ray Beam Temporal Diagnostics Using an X-band Transverse Deflector at LCLS",
      "authors": [
        "Y. Ding",
        "C. Behrens",
        "J.C. Frisch",
        "Z. Huang",
        "P. Krejcik",
        "H. Loos",
        "T.J. Maxwell",
        "J.W. Wang",
        "M.-H. Wang",
        "J.J. Welch",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "DESY",
        "Hamburg",
        "Germany",
        "X-ray free-electron lasers provide ultrashort x-ray pulses for multidisciplinary users. Temporal characterization of these ultrashort pulses with a femtosecond precision remains a challenging topic. At the Linac Coherent Light Source (LCLS)",
        "an X-band radio-frequency transverse deflector proposed in 2011 [*] has just been installed and commissioning of the RF system has started. By measuring the electron beam longitudinal phase space between lasing and non-lasing conditions",
        "both the e-beam and x-ray temporal profiles can be reconstructed. We report the latest progress of the commissioning of the deflector and the measurements on the e-beam and x-ray pulse length with this deflector at LCLS. The resolution",
        "stability and operational performance will also be discussed.",
        "[*] Y. Ding et al.",
        "Phys. Rev. ST Accel. Beams 14",
        "120701 (2011)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tuobno04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tuobno04.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tuobno04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUOBNO04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:31:02"
}