{
  "session_info": {
    "id": "TUZB",
    "name": "TUZB - Invited Oral Presentations, Circular and Linear Colliders",
    "url": "https://proceedings.jacow.org/ipac2017/html/tuzb.htm"
  },
  "papers": [
    {
      "paper_id": "TUZB1",
      "title": "Final Results From the Clic Test Facility (CTF3)",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "The unique CLIC TEST Facility (CTF3) has been built more than a decade ago to demonstrate the feasibility of the CLIC two beam acceleration scheme. The emphasis was one the high current drive beam generation using a fully loaded highly efficient linac and a complex combination scheme to increase beam current and bunch repetition frequency. This drive beam has been used for deceleration experiments and two beam acceleration. A wealth of relevant results for accelerator physics even beyond CLIC has been obtained and will be presented. The rf to beam efficiency of the linac exceeds 95%",
        "after combination the 28 A drive beam with 12 GHz bunch repetition rate has been used to extract more than 50% of its energy producing 1.3 GW of 12 GHz power as well as performing two beam acceleration at 12 GHz with gradients up to 150 MV/m."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/tuzb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/tuzb1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/tuzb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-TUZB1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZB2",
      "title": "Commissioning Status of High Luminosity Collider Rings for SuperKEKB",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "SuperKEKB project aims to obtain the world's highest luminosity of 8x1035/cm/s",
        "in order to discover new particle physics beyond the Standard Model. Key technologies for the high luminosity are nano-beam scheme at the collision point and high positron and electron stored current with low emittance",
        "which require the significant upgrade of both the injector and the collider rings. Recently commissioning of the renewal collider rings has been performed without final focus magnets and the Belle II detector (Phase 1). This talk gives results of the Phase 1 commissioning and construction status toward the first beam collisions (Phase 2)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/tuzb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/tuzb2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/tuzb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-TUZB2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 19:47:09"
}