{
  "session_info": {
    "id": "MOPMA",
    "name": "MOPMA - Poster Session",
    "url": "https://proceedings.jacow.org/PAC2013/html/mopma.htm"
  },
  "papers": [
    {
      "paper_id": "MOPMA03",
      "title": "Studies on Short-Bunch Extraction at CSNS RCS",
      "authors": [
        "Y. Zou",
        "J.F. Chen",
        "J.Y. Tang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "White neutron application requires short pulse length to obtain high time resolution for nuclear data measurements. Back-streaming neutrons at the CSNS spallation target are to be employed as a white neutron source. The available high RF voltage in the high intensity rapid cycling synchrotron (RCS) of CSNS makes it possible to extract very short bunches by using the bunch rotation method. A special desynchrotronization method is designed to avoid the slow acceleration during the bunch rotation when magentic field is still ramping. Different extraction scenarios together with the changes in the injection have been studies for the purpose. Together with the calculations",
        "multiple simulations have been carried out to show the effectiveness of the method. With a sacrifice of about two-third beam power",
        "the rms bunch length of the extracted beam can be reduced to about one tenth of the one in the nominal operation mode. Other scenarios also show the improvement in the bunch length. Space charge effects and beam loading effect have been taken into account in designing the schemes."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma03.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA03",
      "page_number": "297",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA04",
      "title": "Design Considerations for the ESS Accelerator-to-Target Region",
      "authors": [
        "T.J. Shea",
        "K.H. Andersen",
        "P. Bentley",
        "P.F. Henry",
        "E.J. Pitcher",
        "P. Sabbagh",
        "A. Takibayev",
        "ESS",
        "Lund",
        "Sweden",
        "A.I.S. Holm",
        "S.P. Møller",
        "H.D. Thomsen",
        "ISA",
        "Aarhus",
        "Denmark",
        "When the European Spallation Source (ESS) is completed in Lund",
        "Sweden",
        "a superconducting linac will deliver a 5 MW proton beam to a rotating tungsten target. Moderated neutrons from this target will be delivered to a suite of 22 neutron instruments. In the accelerator-to-target region",
        "design choices must balance the demands of the accelerator",
        "the target",
        "and the neutron instruments. For example",
        "the transport line upstream of the target station expands and shapes the small",
        "low emittance linac beam into a large beam that is safe for the target components. It must do this with low loss in order to reduce activation of the beam line and minimize a potential source of background in the neutron instruments. To meet availability goals",
        "beam-induced damage to critical components must be avoided by instrumenting beamline components",
        "deploying a suite of beam instrumentation within the target monolith",
        "and interfacing some of these devices to the machine protection system. This paper will describe recent design changes in this region",
        "highlighting considerations that are applicable to most high power facilities and also those that are unique to a long-pulse source like the ESS."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma04.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA04",
      "page_number": "300",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA05",
      "title": "Thermal Design of the FETS Chopper Beam Dump",
      "authors": [
        "P. Savage",
        "M. Aslaninejad",
        "P.A. Posocco",
        "J.K. Pozimski",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "A.P. Letchford",
        "J.K. Pozimski",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Imperial College of Science and Technology",
        "London",
        "United Kingdom",
        "The Front End Test Stand Project (FETS) at RAL is being built to demonstrate fast beam chopping. This is required to create precisely defined gaps in the bunched H− beam which is essential in order to minimise beam losses in a synchrotron during injection. The gaps are created in the Medium Energy Beam Transport (MEBT) section of the FETS beam-line using a ‘fast-slow’ chopping scheme. This scheme uses two choppers",
        "one fast and one slow",
        "each kicks a portion of beam into its corresponding downstream beam dump. The challenge for the beam dump design is that it must occupy a limited longitudinal space to ensure that the beam transport is preserved and must absorb a beam power that is close to the sustainable stress limit of common engineering materials. This paper will describe the simulations made to study the cooling scheme required to absorb the power deposited in the dump plates for the fast and slow choppers."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma05.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA05",
      "page_number": "303",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA06",
      "title": "Proposal for Simultaneous Acceleration of Stable and Unstable Ions in ATLAS",
      "authors": [
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "B. Mustapha",
        "P.N. Ostroumov",
        "A. Perry",
        "ANL",
        "Argonne",
        "USA",
        "Soreq NRC",
        "Yavne",
        "Israel",
        "The Argonne Tandem Linac Accelerator System (ATLAS) is the only national user facility for low-energy stable heavy ion beams. With the recent commissioning of the Californium Rare Isotope Breeder Upgrade (CARIBU)",
        "ATLAS will also be used to accelerate radioactive beams. We here propose to convert ATLAS into a multi-user facility by simultaneously accelerating stable beams from the ECR ion source and radioactive beams from an Electron Beam Ion Source (EBIS) charge breeder under development for CARIBU. Radioactive beams produced from EBIS will contain several charge states of the same isotope",
        "and could be injected into ATLAS in short (~10 μs) pulses. We propose modifications of the existing ATLAS low energy beam transport line that will enable the simultaneous injection and acceleration of one or more charge states from EBIS and a stable ion beam from the ECR. Beam dynamics simulations using the code TRACK confirmed the feasibility of these modifications. The realization of this concept will increase the available beam time",
        "the intensity of radioactive beams and improve the quality of the delivered beams as well."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma06.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA06",
      "page_number": "306",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA07",
      "title": "The D-Line Project at Michigan State University",
      "authors": [
        "J.A. Rodriguez",
        "S. Chouhan",
        "W. Wittmer",
        "FRIB",
        "East Lansing",
        "USA",
        "S. Chouhan",
        "A. Lapierre",
        "D. Leitner",
        "G. Perdikakis",
        "M. Portillo",
        "S. Schwarz",
        "M. Steiner",
        "C. Sumithrarachchi",
        "S.J. Williams",
        "X. Wu",
        "NSCL",
        "East Lansing",
        "Michigan",
        "USA",
        "The Coupled Cyclotron Facility (CCF) at Michigan State University (MSU) has been used to produce rare isotope beams for more than a decade. Ions produced by an ECR source are accelerated using two superconducting cyclotrons in tandem with a stripper foil in between to boost their charge state. After the second cyclotron",
        "a target and a fragment separator produce and select the rare isotope beam that is sent to the different experimental vaults. A gas stopper can be used to thermalize the beam before sending it to a low energy experimental area or to a charge breeder before the ReA re-accelerator. The D-line project includes a mass separator after the gas stopper and several beam transfer lines that connect it to the low energy experiments and to the charge breeder. In this paper",
        "we will describe the project and give an update of its status including the results of the commissioning."
      ],
      "institutions": [
        "Funding: Work supported by Michigan State University (MSU) and the National Science Foundation (NSF)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma07.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA07",
      "page_number": "309",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA08",
      "title": "Systems Engineering and Integration on the FRIB Project",
      "authors": [
        "D. Stout",
        "T. Borden",
        "N.K. Bultman",
        "R. Frazee",
        "M. Leitner",
        "P. Nguyen",
        "T. Russo",
        "E. Tanke",
        "C. Thronson",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The Facility for Rare Isotope Beams (FRIB) will be a world-leading",
        "DOE Office of Science national user facility for the study of nuclear structure",
        "reactions",
        "and astrophysics on the campus of Michigan State University (MSU). A superconducting driver linac will be used to provide stable heavy-ion beams of >200 MeV/u at beam powers up to 400 kW to a production target. The stable beams will be used to produce rare isotopes by in flight fragment separation. The MSU-led design and construction effort is supported by collaborations with many National Laboratories and other scientific institutions. Systems Engineering and Integration has been implemented at the outset to ensure that a requirements-driven design process is followed",
        "and to ensure intra and inter-system compatibility. Top-level requirements have been allocated",
        "and subsequently elaborated",
        "between the Accelerator Systems",
        "Experimental Systems",
        "and Conventional Facilities. FRIB has developed a number of methods and tools to track requirements",
        "establish interfaces",
        "monitor design progress",
        "and ensure overall system integration. These will be described in the paper."
      ],
      "institutions": [
        "Funding: This is based upon work supported by the U.S. Department of Energy Office of Science under Cooperative Agreement DE-SC0000661, by Michigan State University and by the State of Michigan."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma08.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA08",
      "page_number": "312",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA09",
      "title": "Status and Opportunities at Project X: A Multi-MW Facility for Intensity Frontier Research",
      "authors": [
        "S.D. Holmes",
        "M. Kaducak",
        "R.D. Kephart",
        "I. Kourbanis",
        "V.A. Lebedev",
        "C.S. Mishra",
        "S. Nagaitsev",
        "N. Solyak",
        "R.S. Tschirhart",
        "Fermilab",
        "Batavia",
        "USA",
        "Project X is a high intensity proton facility that will support a world-leading U.S. program in Intensity Frontier physics over the next several decades. Project X is currently under development by Fermilab in collaboration with national and international partners. Project X will be unique in its ability to deliver",
        "simultaneously",
        "up to 6 MW of site-wide beam power to multiple experiments",
        "at energies ranging from 235 MeV to 120 GeV",
        "and with flexible and independently controlled beam time patterns. Project X will support a wide range of experiments utilizing neutrino",
        "muon",
        "kaon",
        "nucleon",
        "and atomic probes [1",
        "2]. In addition",
        "Project X will lay the foundation for the long-term development of a Neutrino Factory and/or Muon Collider."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma09.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA09",
      "page_number": "315",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA10",
      "title": "Studies of Fault Scenarios in SC CW Project-X Linac",
      "authors": [
        "A. Saini",
        "J.-F. Ostiguy",
        "N. Solyak",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "USA",
        "The success of Project-X accelerator facility crucially depends on reliable operation of 1 GeV superconducting (SC) continuous wave (CW) linac at first stage. Operation at high intensity in CW mode puts stringent tolerances on beamline elements. Any fault scenario that affects nominal operation of beamline elements results in beam mismatch with subsequent sections. This in turn leads to emittance growth",
        "and ultimately triggers beam losses. In worst case",
        "it could affect the reliability of the machine and long downtime may be needed to replace the faulty elements. In order to reduce beam interruptions",
        "a robust lattice design is required which can allow local retuning to make the machine operable in such scenarios. This paper presents studies performed to understand the consequences of failure of various beamline elements and discusses outcome of local retuning for different fault scenarios at critical locations in linac."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma10.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA10",
      "page_number": "318",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA12",
      "title": "Design Issues of High Intensity SC CW Ion Linac for Project-X facility",
      "authors": [
        "A. Saini",
        "N. Solyak",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "USA",
        "Project-X is a high intensity proton facility which is primarily based on superconducting (SC) continuous wave (CW) linac. One of the most challenging tasks of Project-X facility is to have robust design of SC CW linac which can provide high quality beam to several experiments and subsequent pulsed linac simultaneously. Among the various technical problems associated with the SC CW linac",
        "halo formation",
        "beam mismatch",
        "uncontrolled emittance growth and beam losses are the most crucial as they can limit overall performance and reliability. Scope of this paper is to address these issues for reference design of Project-X SC CW linac."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma12.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA12",
      "page_number": "321",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA13",
      "title": "Layout of Project-X Facility: A Reference Design",
      "authors": [
        "A. Saini",
        "J.-P. Carneiro",
        "D.E. Johnson",
        "J.-F. Ostiguy",
        "N. Solyak",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "USA",
        "Project-X is a proposed high intensity proton facility to be built at Fermilab. It will be a multi-user facility which can support several experiments simultaneously. In the current scenario",
        "Project-X facility would be built in three stages. Each stage is associated with compelling scientific programs and in synergy with Fermilab infrastructure. This paper will present reference design of Project-X accelerator facility and discuss main motivations and requirements resulting in this layout and beam optics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma13.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA13",
      "page_number": "324",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA14",
      "title": "Status of the LANSCE Front-End Upgrade",
      "authors": [
        "R.W. Garnett",
        "Y.K. Batygin",
        "I. Draganić",
        "C.M. Fortgang",
        "S.S. Kurennoy",
        "R.C. McCrady",
        "J.F. O'Hara",
        "R.J. Roybal",
        "L. Rybarcyk",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Kress GmbH",
        "Biebergemuend",
        "Germany",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "Initial acceleration of the beams in the LANSCE linear accelerator at Los Alamos National Laboratory is still presently accomplished through the use of two 750-keV Cockcroft-Walton (CW) based injectors. To reduce long-term operational risks and to realize future beam performance goals",
        "plans are underway to replace the existing H+ CW injector with a modern replacement",
        "4-rod Radio-Frequency Quadrupole (RFQ) based front end. Significant technical progress has been made since we last reported on this project. Status and progress of the design and fabrication of the RFQ",
        "the RF system",
        "beam transports",
        "and integrated accelerator test stand will be discussed."
      ],
      "institutions": [
        "Funding: Work supported by the United States Department of Energy, National Nuclear Security Agency, under contract DE-AC52-06NA25396"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma14.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA14",
      "page_number": "327",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA15",
      "title": "Experimental Results from a \"Diagnostic\" Pulse for Single-Particle-Like Beam Position Measurements during Accumulation/Production Mode in the Los Alamos Proton Storage Ring",
      "authors": [
        "J.S. Kolski",
        "E. Björklund",
        "M.J. Hall",
        "M.P. Martinez",
        "F.E. Shelley",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Beam position monitors (BPMs) are the diagnostic most used in setting up and documenting the Los Alamos Proton Storage Ring (PSR). One-turn injection can be approximated as single-particle injection with initial betatron position and angle (x0 and x0’). The turn-by-turn beam position data from single-turn injection allows measurement of the betatron tune",
        "closed orbit (CO)",
        "and injection offset (x0 and x0’ at the injection point). In accumulation mode",
        "many turns are injected into the ring",
        "the transverse phase space is quickly filled",
        "and there is no coherent betatron motion. The injection offset",
        "which determines the accumulated beam size and is very sensitive to steering upstream of the ring",
        "is not measurable during accumulation. We review our approach for measuring the injection offset during accumulation",
        "focus discussion on recent experimental results",
        "and compare measurements of the betatron tune",
        "CO",
        "and injection offset in single-turn injection mode and in a “diagnostic pulse” mode."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma15.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA15",
      "page_number": "330",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA16",
      "title": "Design Analysis of the New LANL 4-Rod RFQ",
      "authors": [
        "S.S. Kurennoy",
        "E.R. Olivas",
        "L. Rybarcyk",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "An upgraded front end of the LANSCE linac will include a 4-rod RFQ replacing the aging Cockcroft-Walton injector",
        "initially only for protons. We performed a detailed analysis of the proposed RFQ design using 3D modeling with the CST Studio Suite. The CAD-based RFQ model takes all design details into account. The electromagnetic analysis with MicroWave Studio (MWS) is followed by beam dynamics modeling with Particle Studio (PS) using the MWS-calculated fields. In addition",
        "a thermal and stress analysis is performed with ANSYS",
        "based on the power flux from MWS computations. Simulation results are used for design iterations aimed to satisfy special requirements imposed by an existing common transfer line for different beams injected into the 201.25-MHz drift-tube linac."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma16.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA16",
      "page_number": "333",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA17",
      "title": "Design Requirements and Expected Performance of the New LANSCE H+ RFQ",
      "authors": [
        "L. Rybarcyk",
        "Y.K. Batygin",
        "I. Draganić",
        "C.M. Fortgang",
        "R.W. Garnett",
        "S.S. Kurennoy",
        "R.C. McCrady",
        "T.P. Wangler",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Kress GmbH",
        "Biebergemuend",
        "Germany",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "LANSCE provides H− and H+ beams to several user facilities for fundamental and applied research",
        "including a 100-MeV",
        "250-μA proton beam to the Isotope Production facility (IPF). Each beam species is initially accelerated to 750 keV in separate Cockcroft-Walton (C-W) accelerators. Due to the age and possible failure modes of the C-W’s and the potential impact of a C-W failure to the IPF program",
        "we have begun the process of replacing the aging H+ C-W with a modern Radio Frequency Quadrupole (RFQ) accelerator-based system. In addition",
        "the complexity of combined species operations imposes further restrictions on the beam performance and configuration that must be incorporated into the design process. This paper will cover the physics design requirements of this new RFQ and the expected performance based upon the results of PARMTEQM simulations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma17.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA17",
      "page_number": "336",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA18",
      "title": "GPU Accelerated Online Multi-Particle Beam Dynamics Simulator for the LANSCE Linac",
      "authors": [
        "X. Pang",
        "S.A. Baily",
        "L. Rybarcyk",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "An online multi-particle beam dynamics simulator is being developed for use in the LANSCE linac operation. The goal is to provide new insights on the beam distribution inside the linac and to help understand the impact of set point adjustments on it. The simulator utilizes the well established beam dynamics algorithms of the PARMILA code. By employing Graphics Processing Unit (GPU) technology",
        "the performance of the simulator has been significantly increased over that of a single CPU and is therefore viable as an online tool in the demanding accelerator operations environment. The combination of a high-level scripting language (Python) and low-level compiled language (C++ and CUDA C) was adopted to streamline application development and to enable efficient execution. Once connected to the EPICS control system",
        "the simulator can track in pseudo real time machine parameter changes",
        "convert control set points to model quantities and rapidly update the simulation results. Details regarding the code structure design",
        "GPU programming and performance",
        "code validation and applications will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma18.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA18",
      "page_number": "339",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA20",
      "title": "Phase Stability of the RF Reference Line for the FRIB Linac",
      "authors": [
        "Q. Zhao",
        "J.F. Brandon",
        "NSCL",
        "East Lansing",
        "Michigan",
        "USA",
        "D. Morris",
        "Y. Yamazaki",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The phase stability of rf reference line is usually quite restricted in a high energy linac (very long linac",
        "very high frequency). Due to the change of the ambience temperature in the linac tunnel",
        "the electrical length of reference rf cables may change significantly",
        "which results in unacceptable phase changes in cavities. So",
        "sometimes the reference line is very expensive",
        "for example",
        "made of optical fiber housed in a lengthy thermostatic chamber. The frequencies of FRIB linac cavities are 80.5 and 322 MHz (not very high). We also take advantage of the double-folded linac geometry and feed the reference line in the center of the linac to effectively reduced the reference line by 6 times. Our studies show that the FRIB linac can tolerate up to 12ps phase stability of the rf reference line. Therefore",
        "no special treatment is needed for the reference line."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma20.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA20",
      "page_number": "342",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPMA21",
      "title": "An Optimization Study of the Target Subsystem for the New g-2 Experiment",
      "authors": [
        "C.Y. Yoshikawa",
        "C.M. Ankenbrandt",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "A.F. Leveling",
        "N.V. Mokhov",
        "J.P. Morgan",
        "D.V. Neuffer",
        "S.I. Striganov",
        "Fermilab",
        "Batavia",
        "USA",
        "A precision measurement of the muon anomalous magnetic moment",
        "aμ = (g-2)/2",
        "was previously performed at BNL with a result of 2.2 - 2.7 standard deviations above the Standard Model (SM) theoretical calculations. The same experimental apparatus is being planned to run in the new Muon Campus at Fermilab",
        "where the muon beam is expected to have less pion contamination and the extended dataset may provide a possible 7.5σ deviation from the SM",
        "creating a sensitive and complementary benchmark for proposed SM extensions. We report here on a study performed on the target subsystem utilizing a new optimization technique that overcomes complexities of asymmetric particle production and depth of focus of a Li lens. This new technique is applied to an apparatus that is optimized for pions that have favourable phase space to create polarized daughter muons around the magic momentum of 3.094 GeV/c",
        "which is needed by the downstream g 2 muon ring."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopma21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopma21.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopma21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPMA21",
      "page_number": "345",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 17,
  "scrape_time": "2025-10-11 01:33:04"
}