{
  "session_info": {
    "id": "TUWZO",
    "name": "TUWZO - Tuesday Oral Before First Break",
    "url": "https://proceedings.jacow.org/ecris2020/html/tuwzo.htm"
  },
  "papers": [
    {
      "paper_id": "TUWZO01",
      "title": "Measurements of Plasma Parameters Near Resonance Zones and Peripheral Regions in ECRIS",
      "authors": [
        "W. Kubo",
        "S. Harisaki",
        "Y. Kato",
        "I. Owada",
        "K. Sato",
        "K. Tsuda",
        "Osaka University",
        "Graduate School of Engineering",
        "Osaka",
        "Japan",
        "We have investigated how to produce multicharged ions efficiently. Recently",
        "we have focused on waves propagations in plasma and conducted the Upper-hybrid Resonance (UHR) experiments. [1] We have also conducted experiments heating by the coaxial semi-dipole antenna to enhance the right-hand polarization wave",
        "which contributes to ECR. [2] Multicharged ion beams have been improved using various means",
        "e.g.",
        "the increase of the magnetic field and the microwave frequency",
        "the DC biased plate-tuner",
        "mixing low z gases",
        "and the multiplex frequencies heating. However",
        "the microwave launching position has been empirically determined on conventional ECRIS’s. There is still some room for improvement with the respect to more efficient excitation of the wave propagation. In this research",
        "we estimate the wave propagation near the ECR zone",
        "and in the opposite peripheral region beyond it. We measure plasma parameters in those regions by two Langmuir probes inserted into each location at the same time. In near future",
        "we optimize the microwave-launching in the case of the fundamental frequency for ECR and the second frequency for UHR in order to enhance their incidence to the vacuum chamber.",
        "[1]Y. Kato et al",
        "AIP Conf. Proc. 2011",
        "020005 (2018). [2]W. Kubo",
        "et al",
        "RSI",
        "2020",
        "91",
        "023317 (2020)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuwzo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuwzo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuwzo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUWZO01",
      "page_number": "60",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUWZO02",
      "title": "Tentative Solution to Plasma Chamber Cooling for High Power ECR Ion Source Operation",
      "authors": [
        "J.W. Guo",
        "Y.C. Feng",
        "D. Hitz",
        "W. Huang",
        "J.B. Li",
        "L.B. Li",
        "L.X. Li",
        "W. Lu",
        "J.D. Ma",
        "L.T. Sun",
        "Y.Y. Yang",
        "W.H. Zhang",
        "X.Z. Zhang",
        "H.W. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "W. Huang",
        "L.T. Sun",
        "UCAS",
        "Beijing",
        "People’s Republic of China",
        "High charge state electron cyclotron resonance ion source (ECRIS) is characterized by a so-called min-B magnetic field configuration",
        "which provokes the localized plasma over-heating to plasma chamber especially for the 3rd generation ECRISs at high power operation condition. With the increase of rf power",
        "more plasma energy will be dumped to tiny areas and result in a very high localized power density",
        "which is estimated to be up to 1 kW/cm2. Few existing ECR plasma chamber cooling designs can withstand such high heat fluxes. In this paper",
        "we report a new plasma chamber cooling design with so-called Micro-channel cooling technology",
        "which can not only realize efficient heat transfer",
        "but also retains a small radial thickness that is beneficial for the radial magnetic field. In order to evaluate the performance of the cooling structure with micro-channel design",
        "experimental cooling loop for high heat flux has been designed and built at IMP. Initial experiments demonstrate that optimized configuration can achieve high heat flux cooling in the range of 1 kW/cm2 and beyond. Based on these results",
        "a plasma chamber with micro-channel design for SECRAL has been designed and tested."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuwzo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuwzo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuwzo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUWZO02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUWZO03",
      "title": "Production of Metallic Ion Beams with Inductive Heating Oven at Institute of Modern Physics",
      "authors": [
        "W. Lu",
        "Y.C. Feng",
        "J.W. Guo",
        "W. Huang",
        "L.B. Li",
        "L.X. Li",
        "H.Y. Ma",
        "J.D. Ma",
        "C. Qian",
        "L.T. Sun",
        "W.H. Zhang",
        "X.Z. Zhang",
        "H.W. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "W. Huang",
        "L.T. Sun",
        "UCAS",
        "Beijing",
        "People’s Republic of China",
        "University of Chinese Academy of Sciences",
        "Beijing",
        "People’s Republic of China",
        "A High-Temperature Oven (HTO) with inductive heating technology has been developed successfully in 2019 at Institute of Modern Physics. This oven features durable operation temperature of >2000’ inside the tantalum susceptor. By careful design the oven structure",
        "material compatibility and thermal stress issues at high temperature has been successfully handled",
        "which enables the production of >400 e’A U33+ with SECRAL-II*. With necessary refinement",
        "this type of oven could also be available with room temperature ECR ion sources",
        "like"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuwzo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuwzo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuwzo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUWZO03",
      "page_number": "65",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUWZO04",
      "title": "Influences of Magnetic Field Parameters to ECRIS Plasma Characteristics",
      "authors": [
        "J.B. Li",
        "J.W. Guo",
        "D. Hitz",
        "L.B. Li",
        "L.X. Li",
        "W. Lu",
        "L.T. Sun",
        "X.Z. Zhang",
        "H.W. Zhao",
        "H. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "B.S. Bhaskar",
        "T. Thuillier",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "B.S. Bhaskar",
        "H.A. Koivisto",
        "O.A. Tarvainen",
        "V. Toivanen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "To investigate the hot electron population and the appearance of kinetic instabilities in ECRIS plasma",
        "the axially emitted bremsstrahlung spectra and microwave bursts emitted from ECRIS plasma were synchronously measured on SECRAL-II ion source with various magnetic field configurations. The experimental results show that when Bmin/Becr is less than ~0.8",
        "the spectral temperature Ts increases linearly with the Bmin/Becr-ratio when the injection",
        "extraction and radial mirror fields are kept constant. Above this threshold Ts saturates and the electron cyclotron instability appears simultaneously. This study has also demonstrated that Ts decreases linearly with the increase of the average gradient over the ECR surface when the on-axis gradient and hexapole field strengths are constant. In addition",
        "it is found that Ts decreases with the increase of the gradient at the resonance zone at relatively low mirror ratio and is insensitive to the gradient at high mirror ratio when Bmin is constant. Compared to a recent study taken on a fully superconducting ECRIS",
        "this study shows different results discussing the mechanisms behind the correlation of magnetic field parameters to Ts."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuwzo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuwzo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuwzo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUWZO04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:26:25"
}