{
  "session_info": {
    "id": "WEPIK",
    "name": "WEPIK - Posters Wednesday 2",
    "url": "https://proceedings.jacow.org/ipac2017/html/wepik.htm"
  },
  "papers": [
    {
      "paper_id": "WEPIK001",
      "title": "Advanced Beam Dump for FCC-ee",
      "authors": [
        "ANSL",
        "Yerevan",
        "Armenia",
        "B. Goddard",
        "F. Zimmermannpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "KEK",
        "Ibaraki",
        "Japan",
        "A modified beam dump for the future electron positron circular collider FCC-ee is discussed. The extraction line with a dilution kicker system distributes bunches at different transverse locations on the face of the beam dump. For a standard absorber the maximum energy deposition of all bunches occurs at the same longitudinal position inside the beam dump. This region experiences an enormous temperature rise compared with the surrounding parts of the beam dump. We propose a novel type of beam dump which spreads out the deposited energy over its whole volume quasi-uniformly",
        "thereby reducing the maximum temperature rise. Results of Monte-Carlo simulations for a multi-material mosaic beam dump and for absorbers with distorted shapes are shown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik001.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK002",
      "title": "Experimental Activities on High Intensity Positron Sources Using Channeling",
      "authors": [
        "I. Chaikovska",
        "R. Chehab",
        "H. Guler",
        "V. Kubytskyi",
        "LAL",
        "Orsay",
        "France",
        "IN2P3 IPNL",
        "Villeurbanne",
        "France",
        "K. Furukawa",
        "T. Kamitani",
        "F. Miyahara",
        "M. Satoh",
        "Y. Seimiya",
        "T. Suwada",
        "KEK",
        "Ibaraki",
        "Japan",
        "National Taras Shevchenko University of Kyiv",
        "The Faculty of Physics",
        "Kyiv",
        "Ukraine",
        "CERN",
        "Geneva",
        "Switzerland",
        "The positron source under investigation is using channeling radiation of multi-GeV electrons in a tungsten crystal. The radiated photons are impinging on the amorphous targets creating e+e− pairs. A dipole magnet between the crystal-radiator and the amorphous-converter allows the charged particles to be swept off and only emitted photons to generate e+e− pairs in the converter. Granular targets of different thicknesses",
        "made of small tungsten spheres",
        "have been recently investigated as a target-converter. This paper is describing the experimental studies conducted at the KEKB linac with such device. After the description of the experimental set-up and beam parameters",
        "the measurement methods and preliminary results are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK004",
      "title": "Luminosity- and Beam- Induced Backgrounds for the FCC-ee Interaction Region Design",
      "authors": [
        "G.G. Voutsinas",
        "P. Janot",
        "A.M. Kolano",
        "E. Perez",
        "N.A. Tehrani",
        "CERN",
        "Geneva",
        "Switzerland",
        "INFN- Sez. di Padova",
        "Padova",
        "Italy",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "SLAC",
        "Menlo Park",
        "California",
        "USA"
      ],
      "institutions": [
        "A preliminary study on machine induced backgrounds has been performed for the proposed FCC-ee interaction region (IR) and proto-detector. Synchrotron radiation has the strongest impact on the present design of the IR and both radiation from dipoles and quadrupoles have been taken into account. The effect of luminosity backgrounds like gamma gamma to hadrons and pair production have also been studied. The impact of background particles on the detector occupancy has also been studied in full simulation."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik004.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK006",
      "title": "Cancellation of the Leak Field from Lambertson Septum for the Beam Abort System in the SuperKEKB",
      "authors": [
        "N. Iida",
        "M. Kikuchi",
        "K. Kodama",
        "T. Mimashi",
        "T. Mori",
        "Y. Ohnishi",
        "K. Oide",
        "H. Sugimoto",
        "M. Tawada",
        "KEK",
        "Ibaraki",
        "Japan",
        "The first commissioning of SuperKEKB",
        "Phase 1",
        "was performed from February 2016 for five months. A Lambertson septum magnet is utilized to vertically extract the aborted beam",
        "kicked by the horizontal abort kickers upstream into a beam dump. This magnet creates unexpected leak field with a non-negligible skew quadrupole component to the stored beam. Two kinds of skew quadrupole magnets are installed on both sides of the Lambertson septum. One is additional skew windings on the sextupole magnet",
        "and the other is a skew quadrupole magnet with permanent magnets. This paper will report that the cancellations of the leak fields was successful and useful for optics correction."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik006.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK007",
      "title": "Optics Design and Observation for the Beam Abort System in SuperKEKB HER",
      "authors": [
        "N. Iida",
        "K. Egawa",
        "Y. Enomoto",
        "Y. Funakoshi",
        "M. Kikuchi",
        "T. Mimashi",
        "Y. Ohnishi",
        "K. Oide",
        "Y. Suetsugu",
        "KEK",
        "Ibaraki",
        "Japan",
        "In the first commissioning of SuperKEKB",
        "which is 'Phase 1'",
        "the new abort system is tested in the High Energy Ring (HER). There is a risk that aborted beams with low emittance and high current may destroy the window for extraction from beam pipe. In order to enlarge the aborted beam at the window",
        "quadrupole field is applied only for the aborted beam. In the Low Energy Ring (LER)",
        "quadrupole pulsed magnets will be installed to enlarge the aborted beam",
        "and in the HER",
        "a pair of identical sextupole magnets is installed between the abort kickers and the extraction window. These sextrupole magnets are connected by I or 'I transformation to cancel the geometrical nonlinearity for the stored beam in the ring. This paper will report the optics design for the abort system of the HER as well as the observation of the aborted beam."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik007.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK008",
      "title": "Problems in SuperKEKB Vacuum System During the Phase-1 Commissioning and Their Mitigation Measures",
      "authors": [
        "Y. Suetsugu",
        "H. Hisamatsu",
        "T. Ishibashipresenter",
        "K. Kanazawa",
        "K. Shibata",
        "M. Shirai",
        "S. Terui",
        "KEK",
        "Ibaraki",
        "Japan",
        "The first (Phase-1) commissioning of the SuperKEKB",
        "an energy-asymmetric electron-positron collider in KEK",
        "Japan",
        "started in February and ended in June",
        "2016. The vacuum system of the main ring worked well through the commissioning period as a whole",
        "but experienced several problems",
        "such as the electron cloud effect (ECE) in the positron ring",
        "the pressure bursts accompanying beam losses due to dust particles in the beam pipe",
        "an air leak at a connection flange due to the direct hitting of synchrotron radiation (SR)",
        "and so on. Towards the next (Phase-2) commissioning",
        "countermeasures to these problems are taken during the shutdown period. For example",
        "permanent magnets generating axial magnetic fields are attached to beam pipes at drift spaces for the suppression of the ECE. Knockers",
        "which can artificially drop dust particles attached to the top surface in beam pipes by continuous impacts",
        "are prepared to the beam pipes at which the pressure bursts had been frequently observed. Bellows chambers with masks are installed to protect the leaked flange from SR. The problems and their mitigation measures will be summarized in the presentation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik008.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK009",
      "title": "Collimators for SuperKEKB Main Ring",
      "authors": [
        "T. Ishibashi",
        "Y. Suetsugu",
        "S. Terui",
        "KEK",
        "Ibaraki",
        "Japan",
        "SuperKEKB",
        "which is an upgrade project of KEKB",
        "is an electron-positron collider with extremely high luminosity. Collimators (movable masks) for SuperKEKB have been designed to fit an antechamber scheme of the vacuum system and will be operated to improve backgrounds in the particle detector named Belle II. We are developing two types of collimators; a horizontal and vertical collimator. The collimator has a pair of horizontally or vertically opposed movable jaws with RF fingers. Each jaw travels independently through 5-25 mm horizontally or 2-12 mm vertically in a distance between the beam axis and the tip of the jaw. SuperKEKB will operate with high currents of short bunch lengths",
        "therefore it is important to estimate and decrease the impedance of the collimators. Two horizontal collimators were already installed in the positron ring and operated during Phase-1 commissioning for approximately 5 months",
        "from February to June 2016. In this presentation",
        "the latest design",
        "and the results in the Phase-1 commissioning are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik009.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK010",
      "title": "Commissioning Status of SuperKEKB Main Ring Magnet System",
      "authors": [
        "M. Masuzawa",
        "T. Adachi",
        "K. Egawa",
        "T. Kawamoto",
        "S. Nakamura",
        "Y. Ohsawa",
        "T. Okipresenter",
        "R. Sugahara",
        "R. Ueki",
        "KEK",
        "Ibaraki",
        "Japan",
        "SuperKEKB is an electron-positron collider",
        "which aims for the very high peak luminosity of 8x1035 cm-2s-1",
        "40 times higher than that of KEKB. The SuperKEKB Main Ring (MR) system is very large",
        "consisting of more than 1700 water-cooled normal-conducting magnets and about 900 air-cooled normal-conducting magnets. More than 400 magnets and power supplies were newly fabricated",
        "tested and installed for SuperKEKB Phase I beam operation. The MR magnet system worked well",
        "which contributed greatly to the smooth start-up of the MR. Commissioning status of the MR magnet system during SuperKEKB Phase I operation will be reported. Some problems resulting in beam abort will also be reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK011",
      "title": "Ceramic Chamber Used in SuperKEKB High Energy Ring Beam Abort System",
      "authors": [
        "T. Mimashi",
        "N. Iida",
        "M. Kikuchi",
        "K. Kodama",
        "T. Mori",
        "KEK",
        "Ibaraki",
        "Japan",
        "Hitachi Power Semiconductor Device",
        "Ltd.",
        "Hitachishi",
        "Ibaraki",
        "Japan",
        "The water-cooled type ceramic chambers were used for Super-KEKB high energy ring beam abort system. Since the horizontal abort kicker magnets are required to have very fast rise time and large current",
        "the gap of kicker magnet must be as small as possible. The thin and compact ceramic chamber were developed. The chamber has racetrack type chamber whose inner diameter is 60mm in horizontal and 40 mm in vertical. And the gap of horizontal kicker magnet is 70mm. The thickness of the ceramic chamber is 30 % reduced from that of KEKB. The 500mm long hollow type ceramic",
        "which includes cooling water path inside",
        "is fabricated. It makes the structure of ceramic chamber simple and compact. The new copper electroforming is applied to deposit the 100μmeter thickness Cu conducting layer on the inner wall of Kovar. The Cu conducting layer reduces the heat generated by image beam current on the Kovar brazering. They are installed in the Super-KEKB electron ring beam abort system",
        "and used in the phase 1 operation. The paper describes the performance of the water-cooled ceramic chamber under phase 1 operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik011.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK012",
      "title": "Performance of SuperKEKB High Energy Ring Beam Abort System",
      "authors": [
        "T. Mimashi",
        "Y. Enomoto",
        "N. Iida",
        "M. Kikuchi",
        "K. Kodama",
        "T. Mori",
        "Y. Suetsugu",
        "KEK",
        "Ibaraki",
        "Japan",
        "Hitachi Power Semiconductor Device",
        "Ltd.",
        "Hitachishi",
        "Ibaraki",
        "Japan",
        "K. Kise",
        "A. Tokuchi",
        "Pulsed Power Japan Laboratory Ltd.",
        "Kusatsu-shi Shiga",
        "Japan",
        "New Beam abort system was installed at the Super-KEKB High Energy Ring. It was designed to enlarge the horizontal beam size at the beam extraction window to protect the extraction window",
        "and it also makes the beam abort gap shorter. It consists of four horizontal kicker magnets",
        "one vertical kicker to sweep the beam position in vertical direction",
        "sextupole magnet to enlarge the horizontal beam size",
        "one lambertson magnet",
        "Ti extraction window and beam dump. Four horizontal kicker magnets and one vertical kicker magnet connects to the one power supply. The ceramic chambers cooled by the water are inserted in each kicker coils. The Abort system had been used during SuperKEKB phase 1 operation. This paper describes the performance of the abort system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik012.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK013",
      "title": "Electron Beam Injection Septum",
      "authors": [
        "T. Mori",
        "N. Iida",
        "M. Kikuchi",
        "T. Mimashipresenter",
        "Y. Sakamoto",
        "S. Takasaki",
        "M. Tawada",
        "KEK",
        "Ibaraki",
        "Japan",
        "The SuperKEKB project is in progress toward the initial physics run in autumn 2018. It assumes the nano-beam scheme",
        "in which the emittance of the colliding beams is 4.6 nm. To achieve such a low emittance",
        "it is vitally important to preserve the emittance during the transport of the beam from the linac to the main ring. One of the most difficult sections is the injection system. Since the dynamic aperture is small for the low emittance",
        "the allowed distances between the stored beam and the injected beam at the injection point are 7.8 mm for the betatron injection and 7.2 mm for the synchrotron injection. The new septum magnets has been constructed and installed in the beam line after the measurement of magnetic flux density and aging test. It has been also checked the septum magnets are capable of design orbit. The initial beam injection succeeded on schedule and they had been operated without any big troubles in the first beam run of Phase-1."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik013.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK014",
      "title": "Coupled Bunch Instability and Its Cure at J-PARC RCS",
      "authors": [
        "Y. Shobuda",
        "H. Harada",
        "H. Hotchipresenter",
        "P.K. Saha",
        "T. Takayanagi",
        "F. Tamura",
        "N. Tani",
        "T. Togashi",
        "Y. Watanabe",
        "K. Yamamoto",
        "M. Yamamoto",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "Y.H. Chin",
        "Y. Irie",
        "T. Toyama",
        "KEK",
        "Ibaraki",
        "Japan",
        "The RCS at J-PARC is a kicker-impedance dominant machine",
        "which violates the impedance budget from a classical viewpoint. Nevertheless",
        "we have recently succeeded to accelerate a 1-MW equivalent beam by making maximum use of the space charge effect on the beam instabilities. In this report",
        "we explain the manipulation to suppress the beam instability",
        "at first. Then",
        "we discuss some issues to suppress the beam instabilities for beams with much smaller transverse emittance",
        "as well as the present status of our efforts to reduce the kicker impedance toward the realization of the higher beam power at the RCS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik014.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK015",
      "title": "Optimized Monochromatization for Direct Higgs Production in Future Circular e+e− Colliders",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "DCI-UG",
        "León",
        "Mexico"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik015.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK016",
      "title": "CEPC-SppC Towards CDR",
      "authors": [
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "In this paper we will give an introduction to Circular Electron Positron Collider (CEPC). The scientific background",
        "physics goal",
        "the collider design requirements and the conceptual design principle of CEPC are described. On CEPC accelerator",
        "the optimization of parameter designs for CEPC with different energies",
        "machine lengthes",
        "single ring and crab-waist collision partial double ring",
        "advanced partial double partial ring and fully partial double ring options",
        "etc. have been discussed systematically",
        "and compared. CEPC accelerator baseline and alternative designs have been proposed based on the luminosity potential in relation with the design goals. The sub-systems of CEPC",
        "such as collider main ring",
        "booster",
        "electron positron injector",
        "etc. ave also been introduced. The detector and MDI design have been briefly mentioned. Finally",
        "the optimization design of Super Proton-Proton Collider (SppC)",
        "its energy and luminosity potentials",
        "in the same tunnel of CEPC are also discussed. The CEPC-SppC Progress Report (2015-2016) has been published."
      ],
      "institutions": [
        "Funding: supported by National Key Programme for S&T Research and Development (2016YFA0400400), National Natural Science Foundation of China (11575218, 11605211, 11605210, 11505198), Key Research Program of Frontier Sciences, CAS, (QYZDJ-SSW-SLH004) and CAS Center for Excellence in Particle Physics (CCEPP)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik016.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK017",
      "title": "km CEPC Parameters and Lattice Design",
      "authors": [
        "D. Wang",
        "T.J. Bian",
        "X. Cui",
        "J. Gao",
        "H. Geng",
        "Q. Qin",
        "B. Sha",
        "N. Wang",
        "Y. Wang",
        "C.H. Yu",
        "J.Y. Zhai",
        "C. Zhang",
        "Y. Zhang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Institute of High Energy Physics (IHEP)",
        "People's Republic of China",
        "The 100km double ring configuration with shared su-perconducting RF system has been defined as baseline by the circular electron positron collider (CEPC) steering committee. Based on this new scheme",
        "we will get higher luminosity for Higgs (+170%) keeping the beam power in preliminary conceptual design report (Pre-CDR) or to reduce the beam power (19 MW) while keeping same luminosity. CEPC will be compatible with W and Z ex-periment. The luminosity for Z is designed at the level of 1035 cm-2s−1. The requirement for the energy acceptance of Higgs has been reduced to 1.5% by enlarging the ring to 100 km. The optics of arc and final focus system (FFS) with crab sextupoles has been designed",
        "and also some primary dynamic aperture (DA) results were introduced."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik017.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK018",
      "title": "Optics Design for Cepc Double Ring Scheme",
      "authors": [
        "Y. Wang",
        "T.J. Bian",
        "J. Gao",
        "H. Geng",
        "B. Sha",
        "D. Wang",
        "C.H. Yu",
        "Y. Zhang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Institute of High Energy Physics (IHEP)",
        "People's Republic of China"
      ],
      "institutions": [],
      "abstract": "CEPC is a future Circular Electron and Positron Collider proposed by China to mainly study the Higgs boson. Its baseline scheme is double ring scheme and alternative scheme is partial double ring scheme. This paper will present the optics design for the main ring of double ring scheme. CEPC will also work as W and Z factories. Compatible optics design for W and Z mode will be presented as well. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik018.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK021",
      "title": "MDI Issues in CEPC Double Ring",
      "authors": [
        "B. Sha",
        "J. Gao",
        "Y. Wang",
        "C.H. Yu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "With the discovery of the higgs boson at around 125GeV",
        "a circular higgs factory design with high luminosity (L ~ 1034 cm-2 s-1) is becoming more popular in the accelerator world. The CEPC project in China is one of them. Machine Detector Interface (MDI) is the key research area in electron-positron colliders",
        "especially in CEPC",
        "it is one of the criteria to measure the accelerator and detector design performance. Because of the limitation from the existing tunnel",
        "many equipment including magnets",
        "beam diagnostic instruments",
        "masks",
        "vacuum pumps",
        "and components of the detector must coexist in a very small region. In this paper",
        "some important MDI issues will be reported for the Interaction Region (IR) design",
        "e.g. the final doublet quadrupoles physics design parameters",
        "beam-stay-clear region and beam pipe",
        "synchrotron radiation power and critical energy are also calculated."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik021.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK022",
      "title": "CEPC Booster Lattice Design",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik022.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK023",
      "title": "Sawtooth Effect in CEPC",
      "authors": [
        "H. Geng",
        "J. Gao",
        "B. Sha",
        "D. Wang",
        "Y. Wang",
        "C.H. Yu",
        "Y. Zhang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "CEPC is a circular electron and positron machine designed to study the property of the Higgs boson. The beam energy for CEPC is thus chosen to be 120GeV. At such a high energy",
        "synchrotron radiation has pronounced effect on the beam behavior. In this paper",
        "we will show the synchrotron radiation effect in the CEPC single ring design",
        "namely",
        "the closed orbit",
        "linear optics and dynamic aperture. Analytical analysis will be given trying to explain the phenomenon."
      ],
      "institutions": [
        "Funding: This work was supported by National Natural Science Foundation of China, under contract NO. 11405188."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik023.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK024",
      "title": "HTS-Coated Beam Screen for SPPC Bending Magnets",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik024.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK025",
      "title": "Spectral Diagnostics of Argon Plasma in a 10mm Aperture Plasma Window",
      "authors": [
        "P.P. Gan",
        "S. Huang",
        "Y.R. Lu",
        "S.Z. Wang",
        "Z.X. Yuan",
        "K. Zhu",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "A 10 mm diameter 60 mm long plasma window has been designed and managed to generate arc discharge with argon gas experimentally in Peking University. Based on the previous experiments and simulations",
        "we have measured the electron temperature and density of the plasma via argon spectral diagnostics",
        "and analyzed the conditions to satisfy the criterion of local thermal equilibrium (L.T.E). The electron temperature is in the range of 12000 K to 16000 K. The electron density is in the range of 2.2×1016 cm-3 to 3.2×1016 cm-3",
        "increasing with discharge current and gas flow rate. The results indicate that our argon plasma is in the L.T.E status. The sealing pressure characteristics of the plasma window is mentioned as well."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik025.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK026",
      "title": "VEPP-5 Injection Complex: Two Colliders Operation Experience",
      "authors": [
        "D.E. Berkaev",
        "A.V. Andrianov",
        "K.V. Astrelina",
        "V.V. Balakin",
        "A.M. Batrakov",
        "O.V. Belikov",
        "M.F. Blinov",
        "D. Bolkhovityanov",
        "A. Butakov",
        "E.V. Bykov",
        "N.S. Dikansky",
        "F.A. Emanov",
        "A.R. Frolov",
        "V.V. Gambaryan",
        "K. Gorchakov",
        "Ye.A. Gusev",
        "S.E. Karnaev",
        "G.V. Karpov",
        "A.S. Kasaev",
        "E. Kenzhebulatov",
        "V.A. Kiselev",
        "S. Kluschev",
        "A.A. Kondakov",
        "I. Koop",
        "I.E. Korenev",
        "N.Kh. Kot",
        "V.R. Kozak",
        "A.A. Krasnov",
        "S.A. Krutikhin",
        "I.V. Kuptsov",
        "G.Y. Kurkin",
        "N.N. Lebedev",
        "A.E. Levichev",
        "P.V. Logatchov",
        "Yu. Maltseva",
        "A.A. Murasev",
        "V. Muslivets",
        "D.A. Nikiforov",
        "An.A. Novikov",
        "A.V. Ottmar",
        "A.V. Pavlenko",
        "I.L. Pivovarov",
        "V.V. Rashchenko",
        "Yu. A. Rogovsky",
        "S.L. Samoylov",
        "N. Sazonov",
        "A.V. Semenov",
        "S.V. Shiyankov",
        "D.B. Shwartz",
        "A.N. Skrinsky",
        "A.A. Starostenko",
        "D.A. Starostenko",
        "A.G. Tribendis",
        "A.S. Tsyganov",
        "S.S. Vasichev",
        "S.V. Vasiliev",
        "V.D. Yudin",
        "I.M. Zemlyansky",
        "A.N. Zhuravlev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "A.V. Andrianov",
        "V.V. Balakin",
        "F.A. Emanov",
        "I. Koop",
        "A.A. Krasnov",
        "A.E. Levichev",
        "D.A. Nikiforov",
        "A.V. Pavlenko",
        "Yu. A. Rogovsky",
        "D.B. Shwartz",
        "A.A. Starostenko",
        "NSU",
        "Novosibirsk",
        "Russia",
        "Budker INP & NSU",
        "Novosibirsk",
        "Russia",
        "NSTU",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Two BINP colliders VEPP-4M and VEPP-2000 e+e− colliders are under operation with the beams feeding from VEPP-5 Injection Complex via newly constructed K-500 beam transfer line. Upgraded injection chain demonstrated ability to provide designed luminosity both to VEPP-4M and VEPP-2000 and techniques of reliable operation are under development now. The design and operation experience of Injection Complex and transfer lines are presented. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik026.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK028",
      "title": "Status of the Electron-Positron Collider VEPP-4",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The next phase of the e+e− collider VEPP-4 (Budker INP",
        "Novosibirsk) is focused on experiments in the energy range from 4 to 10 GeV (c.m.). To recover the lack of positrons at high energy a new positron source was connected to the collider. The paper discusses the facility performance with new injection and other aspects of experimental study at high energy including laser polarimeter for precise energy calibration."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik028.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK029",
      "title": "High Luminosity at VEPP-2000 Collider With New Injector",
      "authors": [
        "P.Yu. Shatunov",
        "O.V. Belikov",
        "D.E. Berkaev",
        "K. Gorchakov",
        "A.S. Kasaev",
        "A.N. Kirpotin",
        "I. Koop",
        "A.A. Krasnov",
        "A.P. Lysenko",
        "S.V. Motygin",
        "E. Perevedentsev",
        "V.P. Prosvetov",
        "D.V. Rabusov",
        "Yu. A. Rogovsky",
        "A.M. Semenov",
        "A.I. Senchenko",
        "Y.M. Shatunov",
        "D.B. Shwartz",
        "M.V. Timoshenko",
        "I.M. Zemlyansky",
        "Yu.M. Zharinov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "E. Perevedentsev",
        "Yu. A. Rogovsky",
        "A.I. Senchenko",
        "D.B. Shwartz",
        "NSU",
        "Novosibirsk",
        "Russia",
        "VEPP-2000 e+e− collider at BINP was commissioned and started data taking with two detectors in 2010 with old injection chain. In the middle energy range",
        "where the luminosity was limited by beam-beam effects",
        "the world record values of beam-beam parameter were achieved",
        "ksi=0.12/IP. At the same time the design luminosity value of L = 1032 cm-2s−1 at top energy (E = 1 GeV per beam) remained unreachable due to limited e+ production rate. The injection chain was significantly upgraded in 2013-2016. The experience of upgraded VEPP-2000 complex operation at top energies with Round Colliding Beams will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik029.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK030",
      "title": "Experimental Validation of the Achromatic Telescopic Squeezing Scheme at the LHC",
      "authors": [
        "S.D. Fartoukh",
        "R. Bruce",
        "F.S. Carlier",
        "J.M. Coello de Portugal",
        "A. Garcia-Tabares",
        "E.H. Maclean",
        "L. Malina",
        "A. Mereghetti",
        "D. Mirarchi",
        "T. Persson",
        "M. Pojer",
        "L. Ponce",
        "S. Redaelli",
        "B. Salvachua",
        "P.K. Skowroński",
        "M. Solfaroli",
        "R. Tomás",
        "D. Valuch",
        "A. Wegscheider",
        "J. Wenninger",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Achromatic Telescopic Squeezing (ATS) [1] scheme offers new techniques to deliver unprecedentedly small beam spot size at the interaction points of the ATLAS and CMS experiments of the LHC",
        "while perfectly controlling the chromatic properties of the corresponding optics (linear and non-linear chromaticities",
        "off-momentum beta-beating",
        "spurious dispersion induced by the crossing bumps). The first series of beam tests with ATS optics were achieved during the LHC Run I (2011/2012) for a first validation of the basics of the scheme at small intensity. In 2016",
        "a new generation of more performing ATS optics was developed and more extensively tested in the machine",
        "still with probe beams for optics measurement and correction at β*=10 cm",
        "but also with a few nominal bunches to establish first collisions at nominal β* (40 cm) and beyond (33 cm)",
        "and to analysis the robustness of these optics in terms of collimation and machine protection. The paper will highlight the most relevant and conclusive results which were obtained during this second series of ATS tests.",
        "[1] S. Fartoukh",
        "Phys. Rev. ST Accel. Beams 16",
        "111002"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik030.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK031",
      "title": "Challenges and Status of the Rapid Cycling Top-Up Booster for FCC-ee",
      "authors": [
        "B. Härer",
        "S. Aumonpresenter",
        "B.J. Holzer",
        "Y. Papaphilippou",
        "T. Tydecks",
        "CERN",
        "Geneva",
        "Switzerland",
        "KEK",
        "Ibaraki",
        "Japan",
        "FCC-ee is a 100 km e+ e− collider",
        "which is being designed within the Future Circular Collider Study (FCC) for precision studies and rare decay observations in the range of 90 to 350 GeV center-of- mass energy. The beam lifetime will be limited to less than one hour",
        "because of radiative Bhaba scattering and beamstrahlung. In order to keep the luminosity on the high level of 1035 cm-2s-1 continuous top-up injection is required. Therefore",
        "besides the collider",
        "that will operate at constant energy",
        "a fast cycling booster synchrotron will be installed in the tunnel. The injection energy to the booster synchrotron will be around 6-20 GeV. Such a small energy together with the large bending radius not only creates an ultra-small beam emittance",
        "but also requires very low magnetic fields close to the limit of technical feasibility. This paper will focus on the challenges and requirements for the top-up booster design arising from low magnetic fields and collective instabilities and present the status of the lattice design."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik031.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK033",
      "title": "LHC Beam Dump Performance in View of the High Luminosity Upgrade",
      "authors": [
        "C. Wiesner",
        "W. Bartmann",
        "C. Bracco",
        "E. Carlier",
        "L. Ducimetière",
        "M.I. Frankl",
        "M.A. Fraserpresenter",
        "B. Goddard",
        "T. Kramer",
        "A. Lechner",
        "N. Magnin",
        "S. Mazzoni",
        "M. Meddahi",
        "V. Senaj",
        "CERN",
        "Geneva",
        "Switzerland",
        "The High Luminosity Large Hadron Collider (HL-LHC) project will increase the total beam intensity in the LHC by nearly a factor of two. Analysis and follow-up of recent operational issues as well as dedicated studies of the LHC Beam Dump System (LBDS) have been carried out to ensure the safe operation with HL-LHC parameters and to decide on possible hardware upgrades to meet the HL-LHC requirements. The fail-safe design must ensure the LBDS performance also for abnormal operation such as asynchronous beam dumps or failing dilution kickers. In this paper",
        "we report on newly observed failure scenarios as the erratic firing of more than one dilution kicker",
        "and discuss their consequences as well as possible mitigation measures in view of the high luminosity upgrade."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik033.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK034",
      "title": "Progress in the FCC-ee Interaction Region Magnet Design",
      "authors": [
        "M. Koratzinos",
        "A.P. Blondel",
        "DPNC",
        "Genève",
        "Switzerland",
        "M. Benedikt",
        "F. Zimmermann",
        "CERN",
        "Geneva",
        "Switzerland",
        "University of Illinois at Urbana-Champaign",
        "Illinois",
        "USA",
        "A.V. Bogomyagkov",
        "S.V. Sinyatkin",
        "P. Vobly",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "NBI",
        "København",
        "Denmark",
        "KEK",
        "Ibaraki",
        "Japan",
        "The design of the region close to the interaction point of the FCC-ee experiments is especially challenging. The beams collide at an angle (±15mrad) in a region where the detector solenoid magnetic field is large. Moreover",
        "the very low vertical β* of the machine necessitates that the final focusing quadrupoles are also inside this high field region. The beams should be screened from the effect of the detector solenoid field",
        "and the emittance blow-up due to vertical dispersion in the interaction region should be minimized while leaving enough space for detector components. Crosstalk between the two final focus quadrupoles",
        "only about 6 cm apart at the tip",
        "should also be minimized. We present an update on the subject."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik034.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK035",
      "title": "Adapting the JLEIC Electron Ring for Ion Acceleration",
      "authors": [
        "B. Mustapha",
        "Z.A. Conway",
        "J.L. Martinez Marin",
        "P.N. Ostroumov",
        "ANL",
        "Argonne",
        "USA",
        "Y.S. Derbenev",
        "F. Lin",
        "V.S. Morozov",
        "Y. Zhang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "A key component of the recently proposed alternative design approach for the JLab-EIC (JLEIC) ion complex is to consolidate the electron storage ring (e-ring) as a large booster for the ions*. A preliminary parameter study showed that it is possible to do so for different design options of the e-ring. In this paper we will report on the adaptation of the e-ring lattice to accelerate ions. After studying the beam dynamics at the injection and extraction energies",
        "we will determine the RF requirements for ion acceleration",
        "in particular the number of required accelerating sections and their locations. The effect of this potential lattice change on the electron beam will be investigated. In a second stage",
        "we will focus on the spin manipulation and determine if the spin rotators and flippers available for the electron could be used for the ions.",
        "* An Alternative Approach for the JLEIC Ion Accelerator Complex",
        "B. Mustapha et al",
        "Proceedings of NAPAC-2016",
        "October 9-14",
        "Chicago",
        "IL."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik035.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK036",
      "title": "ERL Cryomodule Testing and Beam Capabilities",
      "authors": [
        "F. Furuta",
        "N. Banerjee",
        "J. Dobbins",
        "R.G. Eichhorn",
        "M. Ge",
        "D.L. Hallpresenter",
        "G.H. Hoffstaetter",
        "M. Liepe",
        "R.D. Porter",
        "P. Quigley",
        "D.M. Sabol",
        "J. Sears",
        "E.N. Smith",
        "V. Veshcherevich",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The main linac cryomodule (MLC) prototype is a key component for the Cornell-BNL ERL Test Accelerator (CBETA) project",
        "which is a 4-turn FFAG ERL under construction at Cornell University. This novel cryomodule is the first SRF module ever to be fully optimized simul-taneously for high efficient SRF cavity operation and for supporting very high CW beam currents. Initial MLC testing has demonstrated that cavity performance and HOMs damping meet specification values. Recent",
        "addi-tional tests have focused on RF field stability",
        "and cavity microphonics. In this paper",
        "we summarize the perfor-mance of this novel ERL cryomodule and evaluate its beam capabilities based on the measured performance."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik036.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK038",
      "title": "Acceleration of Polarized Protons and Deuterons in the Ion Collider Ring of JLEIC",
      "authors": [
        "V.S. Morozov",
        "Y.S. Derbenev",
        "F. Lin",
        "Y. Zhangpresenter",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "MIPT",
        "Dolgoprudniy",
        "Moscow Region",
        "Russia",
        "A.M. Kondratenko",
        "M.A. Kondratenko",
        "Science and Technique Laboratory Zaryad",
        "Novosibirsk",
        "Russia",
        "The figure-8-shaped ion collider ring of Jefferson Lab Electron-Ion Collider (JLEIC) is transparent to the spin. It allows one to preserve proton and deuteron polarizations using weak stabilizing solenoids when accelerating the beam up to 100 GeV/c. When the stabilizing solenoids are introduced into the collider's lattice",
        "the particle spins precess about a spin field",
        "which consists of the field induced by the stabilizing solenoids and the zero-integer spin resonance strength. During acceleration of the beam",
        "the induced spin field is maintained constant while the resonance strength experiences significant changes in the regions of interference peaks. The beam polarization depends on the field ramp rate of the arc magnets. Its component along the spin field is preserved if acceleration is adiabatic. We present the results of our theoretical analysis and numerical modeling of the spin dynamics during acceleration of protons and deuterons in the JLEIC ion collider ring. We demonstrate high stabil-ity of the deuteron polarization in figure-8 accelerators. We analyze a change in the beam polarization when crossing the transition energy."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik038.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK041",
      "title": "Update on the JLEIC Electron Collider Ring Design",
      "authors": [
        "Y.M. Nosochkov",
        "Y. Cai",
        "M.K. Sullivan",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Y.S. Derbenev",
        "F. Lin",
        "V.S. Morozov",
        "F.C. Pilat",
        "G.H. Wei",
        "Y. Zhangpresenter",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Self Employment",
        "Private address",
        "USA",
        "We present an update on the lattice design of the electron ring of the Jefferson Lab Electron-Ion Collider (JLEIC). The electron and ion collider rings feature a unique figure-8 layout providing optimal conditions for preservation of beam polarization. The rings include two arcs and two intersecting long straight sections containing a low-beta interaction region (IR) with special optics for detector polarimetry",
        "electron beam spin rotator sections",
        "ion beam cooling sections",
        "and RF-cavity sections. Recent development of the electron ring lattice has been focused on minimizing the beam emittance while providing an efficient non-linear chromaticity correction and large dynamic aperture. We describe and compare three lattice designs",
        "from which we determine the best option."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik041.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK043",
      "title": "Modeling Local Crabbing Dynamics in the JLEIC Ion Collider Ring",
      "authors": [
        "S.I. Sosa Guitron",
        "J.R. Delayenpresenter",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The Jefferson Lab Electron-Ion Collider (JLEIC) design considers a 50 mrad crossing angle at the Interaction Point. Without appropriate compensation",
        "this could geometrically reduce the luminosity by an order of magnitude. A local crabbing scheme is implemented to avoid the luminosity loss: crab cavities are placed at both sides of the interaction region to restore a head-on collision scenario. In this contribution",
        "we report on the implementation of a local crabbing scheme in the JLEIC ion ring. The effects of this correction scheme on the stability of proton bunches are analyzed using the particle tracking software elegant."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik043.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK044",
      "title": "Effects of Crab Cavitiy Multipoles on JLEIC Ion Ring Dynamic Aperture",
      "authors": [
        "S.I. Sosa Guitron",
        "S.U. De Silva",
        "J.R. Delayenpresenter",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "We study the effects of crab cavity multipole fields on the beam dynamic aperture of the Jefferson Lab Electron-Ion Collider (JLEIC) ion ring. Crab cavities are needed to compensate for luminosity loss due to a 50 mrad crossing angle at the interaction point. New compact crab cavity designs are interesting as they do not require considerable space in the ring but their non-linear field needs to be well understood. In this contribution",
        "we study the impact of field multipoles on the beam dynamic aperture and report tolerance values for crab cavity multipoles."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik044.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK047",
      "title": "Frequency Choice Studies of eRHIC Crab Cavity",
      "authors": [
        "Y. Hao",
        "Y. Luo",
        "V. Ptitsyn",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Crab crossing scheme is essential collision scheme to achieve high luminosity for the future electron-ion collider (EIC). Since the ion beam is long when cooling is not present",
        "the nonlinear dependence of the crabbing kick may present a challenge to the beam dynamics of the ion beam",
        "hence a impact to the luminosity lifetime. In this paper",
        "we present the initial result of the weak-strong and strong-strong beam-beam tracking with the crab crossing scheme. The result provides beam dynamics guidance in choosing the proper frequency the crab cavity for the future EIC."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik047.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK048",
      "title": "Evaluation and Mitigation of Synchrotron Radiation Background in the eRHIC Ring-Ring Interaction Region",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Synchrotron radiation is a potential source of background in the detector of any future electron-ion collider. In the case of the eRHIC ring-ring design",
        "a 22mrad crossing angle eliminates the need for a separator dipole",
        "which would otherwise be a major source of synchrotron radiation. However",
        "electrons in the transverse tails experience strong magnetic fields in the low-beta quadrupoles near the interaction point. Despite the low electron density in the tails the resulting hard radiation generated in these strong fields is a major concern",
        "and a set of masks needs to be in place to shield the detector from these photons. We present simulation studies and a first design of a synchrotron radiation masking scheme."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik048.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK049",
      "title": "Overview of the eRHIC Ring-Ring Design",
      "authors": [
        "C. Montag",
        "G. Bassi",
        "J. Beebe-Wang",
        "J.S. Berg",
        "M. Blaskiewicz",
        "J.M. Brennan",
        "A.V. Fedotov",
        "W. Fischer",
        "W. Guo",
        "Y. Hao",
        "A. Hershcovitch",
        "Y. Luo",
        "F. Méot",
        "R.B. Palmer",
        "B. Parker",
        "S. Peggs",
        "V. Ptitsyn",
        "V.H. Ranjbar",
        "S. Seletskiy",
        "T.V. Shaftan",
        "V.V. Smaluk",
        "S. Tepikian",
        "D. Trbojevic",
        "E. Wang",
        "F.J. Willeke",
        "H. Witte",
        "Q. Wu",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The ring-ring electron-ion collider eRHIC aims at an electron-ion luminosity in the range from 1032 to 1033cm-2sec-1 over a center-of-mass energy range from 20 to 140GeV. To minimize the technical risk the design is based on existing technologies and beam parameters that have already been achieved routinely in hadron-hadron collisions at RHIC",
        "and in electron-positron collisions elsewhere. This design has evolved considerably over the last two years",
        "and a high level of maturity has been achieved. We will present the latest design status and give an overview of studies towards evaluating the feasibility."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik049.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK050",
      "title": "Parameters for eRHIC",
      "authors": [
        "R.B. Palmer",
        "C. Montagpresenter",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Requirements for the proposed BNL eRHIC Ring-Ring Electron Ion Collider (EIC) are discussed",
        "together with the dependence of luminosity with the beam divergence and forward proton acceptance. Parameters are given for four cases. The first two use no cooling and could represent a first phase of operation. The next two use strong cooling and increased beam currents. In each case parameters are given that 1) meets the requirement for forward proton acceptance",
        "and 2) has somewhat higher divergences giving somewhat higher luminosity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik050.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK052",
      "title": "Energy Acceptance and on Momentum Aperture Optimization for the Sirius Project",
      "authors": [
        "P.S. Dester",
        "L. Liupresenter",
        "F.H. de Sá",
        "LNLS",
        "Campinas",
        "Brazil",
        "A fast objective function to calculate Touschek lifetime and on momentum aperture is essential to explore the vast search space of strength of quadrupole and sextupole families in Sirius. Touschek lifetime is estimated by using the energy aperture (dynamic and physical)",
        "rf system parameters and driving terms. Non-linear induced betatron oscillations are considered to determine the energy aperture. On momentum aperture is estimated by using a chaos indicator and resonance crossing considerations. Touschek lifetime and on momentum aperture constitute the objective function",
        "which was used in a multi-objective genetic algorithm to perform an optimization for Sirius."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik052.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK053",
      "title": "Studies of Delta-Type Undulators for Sirius",
      "authors": [
        "L.N.P. Vilela",
        "L. Liupresenter",
        "X.R. Resende",
        "F.H. de Sá",
        "LNLS",
        "Campinas",
        "Brazil",
        "In this work we present the studies of the effects of Delta-type undulators in the storage ring beam dynamics of Sirius. The undulators were included in the ring model as kick maps and their effects on tune shift",
        "dynamic aperture and beam lifetime were evaluated."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik053.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK054",
      "title": "Evaluation and Attenuation of Sirius Components Impedance",
      "authors": [
        "H.O.C. Duarte",
        "L. Liupresenter",
        "S.R. Marques",
        "LNLS",
        "Campinas",
        "Brazil",
        "The Sirius in-vacuum components have their design improvements",
        "possibilities and choices presented",
        "where wake heating",
        "single-bunch and multi-bunch effects and mechanical aspects were taken into account. The results were finally evaluated and added to the Sirius impedance budget."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik054.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK055",
      "title": "Analysis and Countermeasures of Wakefield Heat Losses for Sirius",
      "authors": [
        "H.O.C. Duarte",
        "L. Liupresenter",
        "S.R. Marques",
        "T.M. da Rocha",
        "F.H. de Sá",
        "LNLS",
        "Campinas",
        "Brazil",
        "Design evaluation and possible solutions for several in-vacuum components of Sirius are presented",
        "having their impedance analysis focused on mitigating the wake heating impact. Thermal and/or structural simulation of the models are carried out by considering the heat load directly obtained from wakefield simulations with resistive wall boundary conditions."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik055.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK056",
      "title": "Compensation of Transient Beam Loading with Detuned Cavities at BESSY II",
      "authors": [
        "M. Ruprecht",
        "P. Goslawski",
        "F. Kramerpresenter",
        "M. Ries",
        "HZB",
        "Berlin",
        "Germany",
        "This paper presents operational experience and use cases of cavity operation in the synchrotron light source BESSY II",
        "where an active or passive cavity is detuned by a small fraction of the harmonic number. If the detuning is an integer multiple of the fundamental RF harmonic",
        "the distortion of the longitudinal phase space is periodic with the revolution",
        "which allows for the compensation of fill pattern induced transients. Measurements at BESSY II are presented",
        "where a fundamental cavity is detuned to decrease the effects of transient beam loading. Thus",
        "reducing the phase transient and increasing the beam life time. Calculations depicting the application of this scheme for the future project BESSY VSR[*] are presented.",
        "* A. Jankowiak",
        "J. Knobloch",
        "P. Goslawski",
        "and N. Neumann",
        "eds.",
        "BESSY VSR - Technical Design Study",
        "Helmholtz-Zentrum Berlin für Materialien und Energie GmbH",
        "2015."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik056.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK057",
      "title": "Transverse Resonance Island Buckets as Bunch Separation Scheme",
      "authors": [
        "P. Goslawski",
        "A. Jankowiak",
        "F. Kramerpresenter",
        "M. Ries",
        "M. Ruprecht",
        "G. Wüstefeld",
        "HZB",
        "Berlin",
        "Germany",
        "Beam storage close to a tune resonance (Qx = 1/3",
        "1/4) can generate transverse resonance island buckets in the x",
        "x' phase space providing a second stable island orbit winding around the standard orbit. The two orbits are well separated",
        "with good life time and stability. Successful user experiments have been conducted at BESSY II and the Metrology Light Source (MLS) *",
        "** with such an operation mode. We discuss the required beam optics setup",
        "the TopUp injection process and present successful measurements taken at photon beamlines at BESSY II."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik057.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK058",
      "title": "Preliminary Longitudinal Impedance Model for the ESRF-EBS",
      "authors": [
        "ESRF",
        "Grenoble",
        "France",
        "In light sources",
        "longitudinal beam coupling impedance can deteriorate performance through bunch lengthening or increased longitudinal emittance due to the microwave instability. Simulation estimates are therefore required to devise the appropriate counter-measures if necessary. The main contributors to the longitudinal impedance model of the new ESRF-EBS storage ring were simulated. A preliminary longitudinal impedance model is presented and preliminary tracking simulations are shown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik058.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK061",
      "title": "Lattice Tuning and Error Setting in Accelerator Toolbox",
      "authors": [
        "S.M. Liuzzo",
        "N. Carmignani",
        "L. Farvacque",
        "B. Nashpresenter",
        "ESRF",
        "Grenoble",
        "France",
        "New lattice designs need to be studied in the presence of magnetic and alignment errors and appropriate lattice tuning procedures. For this reason a set of tools to perform a commissioning-like sequence has been developed for the ESRF-EBS* ** upgrade in Accelerator Toolbox (AT)*** and is now generalized to be used for other accelerators lattice design. The functions presented here allow to correct first turn trajectory",
        "orbit",
        "tune",
        "chromaticity",
        "optics and coupling",
        "in any order. A set of functions to define errors is introduced to address",
        "among others",
        "the issues of: misalignment of magnets modeled by several slices",
        "multiple errors setting on the same magnet and spatially recursive errors along the lattice.",
        "* J.C. Biasci et al.",
        "A low emittance lattice for the ESRF",
        "Synchrotron Radiation News",
        "vol. 27",
        "Iss.6",
        "2014.  ** ESRF upgrade programme phase II",
        "ESRF",
        "December 2014. *** Nash",
        "B. et al.. New functionality for beam dynamics in Accelerator Toolbox (AT) IPAC'15."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik061.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK062",
      "title": "UNDUMAG - A New Computer Code to Calculate the Magnetic Properties of Undulators",
      "authors": [
        "HZB",
        "Berlin",
        "Germany",
        "A new code for the magnetic design of undulators is under development at the Helmholtz-Zentrum Berlin (BESSY). The program reads in the geometry and material properties of the undulator magnets and iron poles. Magnetic fields",
        "forces and torques",
        "as well as trajectories and synchrotron radiation can be calculated. The code is a stand-alone FORTRAN program",
        "thus",
        "only a FORTRAN compiler is needed to install it. Build-in graphic routines allows to write postscript files to visualize the geometry and the fields. Other results like 3D field maps",
        "field integrals etc. are written to ASCII files for later use. The code will be published under the GNU general public license. First results and comparison to other codes are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik062.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK064",
      "title": "Eigenvalue Calculations Based on the Finite Element Method With Physically Motivated Field Smoothing Using the Kirchhoff Integral",
      "authors": [
        "W. Ackermann",
        "H. De Gersempresenter",
        "T. Weiland",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "In current linear particle accelerators",
        "the actual acceleration of the charged particles is realized with the help of the electric field strength within driven radio frequency resonators. The characterization and optimization of the applied resonating structures can be reliably performed based on numerical simulation techniques. Efficient numerical methods have been introduced in the last decades to determine the electromagnetic fields while special care has been put in the correct description of the geometry and the material distribution of the structures. Although the resonators are operated in a driven setup",
        "one of the advantageous numerical strategies here is given by an eigendecomposition of the fields which is realized by the application of accurate eigenmode calculations together with suitable postprocessing steps. In particular",
        "the extraction of representative field maps used for particle tracking for example requires an accurate numerical modeling of the field at any position inside the structure. In order to avoid numerically motivated discontinuities of the fields a proper smoothing algorithm based on the vector equivalents of the Kirchhoff integral is proposed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik064.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK064",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK065",
      "title": "Research Activities Towards a Conversion of PETRA III Into a Diffraction Limited Synchrotron Light Source",
      "authors": [
        "R. Wanzenberg",
        "I.V. Agapov",
        "K. Balewski",
        "M. Bieler",
        "W. Brefeld",
        "R. Brinkmann",
        "M. Dohlus",
        "H. Ehrlichmann",
        "X.N. Gavaldà",
        "J. Keilpresenter",
        "M. Körfer",
        "G.K. Sahoo",
        "C.G. Schroer",
        "E. Weckert",
        "DESY",
        "Hamburg",
        "Germany",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "At DESY the Synchrotron Light Source PETRA III offers scientists outstanding opportunities for experiments with hard X-rays of exceptionally high brilliance since 2009. Research activities have been started towards a future upgrade scenario of PETRA III which envisions the conversion of the PETRA ring into a ultra-low emittance hard X-ray radiation source: PETRA IV. The lattice design is aiming for a horizontal emittance in the range between 10 pm rad and 30 pm rad at a beam energy of 6 GeV. Two different approaches have been considered for the lattice design: a design based on a hybrid multibend achromat with an interleaved sextupole configuration based on the ESRF design",
        "and a lattice with a non-interleaved sextupole configuration with a special phase space exchange configuration. We are reporting the current status of the design activities including studies related to the injector."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik065.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK066",
      "title": "Calculation of Wakefields and Higher Order Modes for the Vacuum Chamber of the CMS, ATLAS, ALICE and LHCb Experiments for the HL-LHC",
      "authors": [
        "R. Wanzenberg",
        "O. Zagorodnova",
        "DESY",
        "Hamburg",
        "Germany",
        "E. Métralpresenter",
        "B. Salvant",
        "CERN",
        "Geneva",
        "Switzerland",
        "The High Luminosity Large Hadron Collider (HL-LHC) project was started with the goal to extend the discovery potential of the Large Hadron Collider (LHC). The HL-LHC study implies also upgraded dimensions of the experimental beam pipes of the CMS",
        "ATLAS",
        "ALICE and LHCb experiments. The trapped monopole and dipole Higher Order Modes (HOMs) and the short range wakefields for the new design of the vacuum chambers were calculated with help of the computer codes MAFIA and"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik066.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK067",
      "title": "Beam-Dynamics Simulation Studies for the HESR",
      "authors": [
        "J.H. Hetzel",
        "U. Bechstedt",
        "J. Böker",
        "A. Lehrach",
        "B. Lorentz",
        "S. Quilitzsch",
        "H. Soltnerpresenter",
        "R. Tölle",
        "FZJ",
        "Jülich",
        "Germany",
        "RWTH",
        "Aachen",
        "Germany",
        "The High Energy Storage Ring (HESR) is part of the future Facility for Antiproton and Ion Research (FAIR) placed in Darmstadt (Germany). The HESR is designed for antiprotons with a momentum range from 1.5 GeV/c to 15 GeV/c",
        "but will as well be suitable to provide heavy ion beams with a momentum range from approximately 0.6 GeV/c to 5.8 GeV/c. To guarantee smooth operation it is crucial to verify and to optimize the design with beam-dynamics simulations. Within recent studies* calculations based on a variant of the Lyapunov exponent were carried out to estimate the dynamic aperture. The studies could reproduce expected influences as reduced aperture due to tune resonances and tune shifts due to coupling. Thus they can be extended to investigate the dynamic behaviour of the beam and identify the main restrictions to the dynamic aperture near the chosen betatron tune. Furthermore ongoing measurements of the magnetic fields of the already produced bending dipoles and quadrupoles deliver a more precise insight to the harmonic content of these elements. Thus the existing simulations could now be updated by including the new measurement results.",
        "*J. Hetzel",
        "A. Lehrach",
        "U. Bechstedt",
        "J. Böker",
        "B. Lorentz",
        "R. Tölle: Towards Beam-Dynamics Simulations Including More Realistic Field Descriptions for the HESR",
        "IPAC'16"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik067.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK068",
      "title": "Non-Linear Beam Dynamics Studies of the CLIC Damping Wiggler Prototype",
      "authors": [
        "J. Gethmann",
        "A. Bernhard",
        "E. Blomley",
        "E. Huttel",
        "A.-S. Müller",
        "A.I. Papash",
        "M. Schedler",
        "KIT",
        "Karlsruhe",
        "Germany",
        "Y. Papaphilippou",
        "P. Zisopoulos",
        "CERN",
        "Geneva",
        "Switzerland",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "First beam dynamics studies of a damping wiggler prototype for the CLIC damping rings have been carried out at the KIT storage ring. Effects of the 2.9 T superconducting wiggler on the electron beam in the 2.5 GeV standard operation mode have been measured and compared with theoretical predictions. Higher order multipole components were investigated using local orbit bump measurements. Based on these findings the simulation models for the storage ring optic have been adjusted. The refined optics model has been applied to the 1.3 GeV",
        "low-operation case. This case will be used to experimentally benchmark beam dynamics simulations involving strong wiggler fields and dominant collective effects. We present these measurements",
        "comparisons and the findings of the simulations with the updated low-mode optics model."
      ],
      "institutions": [
        "Funding: Julian Gethmann acknowledges the support by the DFG-funded Doctoral School Karlsruhe School of Elementary and Astroparticle Physics: Science and Technology"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik068.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK070",
      "title": "Nonlinear Lattice Optimization for the SPring-8 Upgrade",
      "authors": [
        "K. Soutome",
        "H. Tanaka",
        "RIKEN SPring-8 Center",
        "Hyogo",
        "Japan",
        "Y. Shimosaki",
        "M. Takao",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "The SPring-8 upgrade project has adopted the hybrid MBA lattice to achieve the emittance of about 100 pmrad at 6 GeV with damping effects by insertion devices. This optics has two dispersion bumps in one unit cell where chromaticity-correcting sextupoles locate. The horizontal and vertical betatron phases between these bumps are tuned to be 3PI and PI",
        "respectively",
        "to cancel the low order contributions of nonlinear kicks due to sextupoles. However",
        "it is not easy to obtain a sufficiently large dynamic aperture (DA) since (i) the cancellation is incomplete due to a nested arrangement",
        "(ii) sextupoles are very strong",
        "and (iii) the number of tuning knobs is limited. The DA is quite small due to the leakage of nonlinear kicks by nested sextupoles. We hence proposed to install additional weak sextupoles between the dispersion bumps to suppress the leakage kick further. Simulations show that this simple scheme is very effective for suppressing ADTS and for enlarging DA. We present details of this scheme and some numerical examples together with a newly developed fourth-order formula of ADTS for describing and controlling the lattice nonlinearity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik070.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK070",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK071",
      "title": "Resistive-Wall Impedance Effects for the New KEK Light Source",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "KEK Light Source (KEK-LS) is a 3-GeV storage ring of 20-cell HMBA (Hybrid Multi-Bend Achromat) lattice*",
        "which is planned to be constructed as a successor of the two existing Photon Factory storage rings (PF ring and PF-AR) in the KEK Tsukuba Campus. In this ring",
        "a lot of in-vacuum undulators with a small magnetic gap (4 mm at minimum) will be installed and the vacuum pipe of a small aperture (25 mm in diameter) will be used. In addition",
        "NEG coating",
        "having a low electric conductivity",
        "will be utilized for the vacuum pipe to ensure a sufficient beam lifetime early in the machine commissioning. In this paper",
        "the heating power due to the longitudinal RW impedance and the growth rate of coupled-bunch instability caused by the transverse RW impedance are calculated and the effects of the RW impedance on KEK-LS are presented.",
        "* K. Harada et al.",
        "Proc. of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik071_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik071.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik071_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK071",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK073",
      "title": "Three Dimensional Wake Field for an Electron Moving in Undulator",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan"
      ],
      "institutions": [],
      "abstract": "Electro-magnetic field for given trajectory of an electron is calculated by Lienard-Wiechert potential. The field near the electron moving in an undulator is presented. The field is regarded as a wake field in the undulator. Motion of a bunch is studied in the wake field. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik073.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK073",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK074",
      "title": "Twiss Parameter Measurement and Application to Space Charge Dynamics",
      "authors": [
        "K. Ohmi",
        "S. Igarashi",
        "T. Toyamapresenter",
        "KEK",
        "Ibaraki",
        "Japan",
        "H. Harada",
        "S. Hatakeyama",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "UTTAC",
        "Tsukuba",
        "Ibaraki",
        "Japan",
        "J-PARC",
        "KEK & JAEA",
        "Ibaraki-ken",
        "Japan",
        "R. Tomás",
        "A. Wegscheider",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [],
      "abstract": "We are looking for feasible and quantitative method to evaluate space charge induced beam loss in J-PARC MR. One possible way is space charge simulation and theory based on measured Twiss parameter. Twiss parameter measurement using turn-by-turn monitors is presented. Resonance strengths of lattice magnets and space charge force are estimated by the measured Twiss parameters. Emittance growth and beam loss under the resonance strengths are discussed. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik074.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK074",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK075",
      "title": "Electron Cloud Instability in SuperKEKB Phase I Commissioning",
      "authors": [
        "K. Ohmi",
        "J.W. Flanagan",
        "H. Fukuma",
        "H. Ikeda",
        "E. Mulyani",
        "K. Shibata",
        "Y. Suetsugu",
        "M. Tobiyama",
        "KEK",
        "Ibaraki",
        "Japan",
        "Beam size blow-up due to electron cloud has been observed in Phase I commissioning of SuperKEKB. Vacuum chambers in LER (low energy positron ring) were cured by antechamber and TiN coating for electron cloud. Some parts",
        "bellows",
        "were not cured by the coating. In the early stage of Phase I commissioning",
        "beam size blow up has been observed above a threshold current. The blow up was suppressed by weak permanent magnets generating longitudinal field",
        "which cover the bellows. Electron cloud current have been monitored during the commissioning. The thresholds for the electron cloud induced fast head-tail instability have been simulated in the operating beam conditions. Coupled bunch instability caused by electron cloud has been measured in the operating beam conditions and installation of the permanent magnets. The measurement and simulation results are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik075.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK075",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK077",
      "title": "Shielding of Beam Pipe on Rapidly Varying Magnetic Field",
      "authors": [
        "N. Wang",
        "J. Chen",
        "S.K. Chen",
        "P. He",
        "G. Xu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "In low emittance rings",
        "beam is quite sensitive to orbit oscillations. Fast correctors will be used to correct the beam orbit. The fast varying magnetic field will generate eddy current on the beam pipe",
        "which will in turn change the phase and the amplitude of the magnetic field. The shielding effect of the beam pipe on a fast varying magnetic field is simulated for different frequencies. The results are also benchmarked with the measurements in the lab."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik077.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK077",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK078",
      "title": "Development of the Impedance Model in HEPS",
      "authors": [
        "N. Wang",
        "Z. Duan",
        "X.Y. Li",
        "H. Shi",
        "S.K. Tian",
        "G. Xu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The High Energy Photon Source (HEPS) is a new designed photon source at beam energy of 6 GeV. Due to the small beam pipe aperture and a large number of insertion devices in the machine",
        "the impedance can drive collective instabilities and limit the machine performance. Therefore",
        "a thorough estimation of the coupling impedance is necessary in controlling the total impedance of the whole machine. A primary impedance model is obtained for the storage ring."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik078.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK078",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK080",
      "title": "Preliminary Study of Beam Dynamics Compensation for the Elliptically Polarized Undulator at the HLS-II",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik080.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK080",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK081",
      "title": "The Logitudinal Broadband Impedance and Energy Spread Measurements at the VEPP-4M Electron-Positron Collider",
      "authors": [
        "V.M. Borin",
        "V.A. Kiselev",
        "G.Y. Kurkin",
        "S.A. Nikitin",
        "P.A. Piminov",
        "S.V. Sinyatkin",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "V.L. Dorokhov",
        "O.I. Meshkov",
        "BINP",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The paper presents measurements of the longitudinal broadband impedance and beam energy spread of the beam at the VEPP-4M electron-positron collider in an energy range of 1.0 - 3.5 GeV. In order to measure the longitudinal bunch size at various beam currents we used PS-1/S1 streak camera with picosecond temporal resolution. The dependence of bunch length from the bunch current at different energies demonstrates a microwave instability threshold. The bunch lengthening was caused by potential well distortion as well. Potential well distortion lengthening was used to estimate a value of the reactive part of the longitudinal impedance of the vacuum chamber of the collider Observed microwave instability thresholds was used to measure the value of the broadband impedance. The impact of the Touschek effect in the beam energy spread is discussed. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik081_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik081.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik081_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK081",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK084",
      "title": "Approximating Nonlinear Forces with Phase-Space Decoupling",
      "authors": [
        "B.T. Folsom",
        "E. Laface",
        "ESS",
        "Lund",
        "Sweden",
        "Beam tracking software for accelerators typically falls into two categories: fast envelope simulations limited to linear beam optics",
        "and slower multiparticle simulations that can model nonlinear effects. To find a middle ground between these approaches",
        "we introduce virtual coordinates in position and momentum which have a cross-dependency (i.e. p*=f(x) where x is an initial position and p* is a virtual projection of momentum onto the position axis).This technique approximates multiparticle simulations with a significant reduction in calculation cost."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik084_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik084.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik084_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK084",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK085",
      "title": "Beam Shaping with 4N-order Multipole Magnets",
      "authors": [
        "B.T. Folsom",
        "E. Laface",
        "ESS",
        "Lund",
        "Sweden",
        "A uniformly irradiating beam is beneficial in spallation for preventing irregular wear on the target. For octupoles (n = 4) and higher-order (n = 4N) magnets",
        "passing charged-particle bunches undergo symmetric shaping effects along the x and y axes. Using a Lie-mapping formalism",
        "we illustrate how well Gaussian distributions can be flattened symmetrically in 2D with single",
        "dual-pulse",
        "and RF magnets of 4N order. Incidental shaping effects are also discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik085_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik085.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik085_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK085",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK086",
      "title": "Wave Propagation in a Fractal Wave Guide",
      "authors": [
        "V.G. Ziemann",
        "A.K. Bhattacharyyapresenter",
        "M. Holz",
        "J. Ögren",
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "We analyze the propagation of electro-magnetic waves in a wave guide that has the shape of Koch's snowflake",
        "a well-known fractal."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik086_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik086.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik086_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK086",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK087",
      "title": "Measurement and Characterization of Cable Losses for High Voltage Coaxial Cables Used in Kicker Systems",
      "authors": [
        "A. Ferrero Colomo",
        "L. Ducimetière",
        "T. Kramerpresenter",
        "L. Sermeus",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the framework of CERN's LHC Injector Upgrade",
        "simulation models for kicker pulse generators have been improved. A key element in the conventional pulse generators",
        "among many others",
        "are the high voltage coaxial cables. Since they can have significant impact on the waveform characteristics",
        "an accurate cable model for simulation is crucial for reliable results during development. For this purpose",
        "precise measurements of scatter parameters have been carried out in order to improve existing simulation models. Specialized high voltage cables",
        "sometimes SF6 gas filled",
        "used in various CERN kicker systems are usually large",
        "heavy",
        "not very flexible and often only one end is easy accessible. In addition",
        "the impedance of these cables is rarely of 50 Ohms",
        "which presents an extra difficulty. This paper describes the methods that have been defined and used to measure any kind of coaxial structures relying on S11 parameters exclusively. Measurements for various specialized cable types are presented and compared with their improved models. The implications for overall kicker system performance are briefly discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik087_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik087.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik087_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK087",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK088",
      "title": "Analysis of Performance Fluctuations for the CERN Proton Synchrotron Multi-Turn Extraction",
      "authors": [
        "M. Giovannozzi",
        "A. Huschauerpresenter",
        "O. Michels",
        "A. Nicoletti",
        "G. Sterbini",
        "CERN",
        "Geneva",
        "Switzerland",
        "After the successful beam commissioning and tests in 2015",
        "the Multi-Turn Extraction (MTE) has been put in operation in 2016. In this paper",
        "the remaining issues related with fluctuation of the MTE performance are evaluated and correlation studies are presented in view of estimating the impact of planned improvements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik088_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik088.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik088_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK088",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK089",
      "title": "Characterization of Resonant Impedances of CERN-SPS Gate Valves",
      "authors": [
        "T. Kaltenbacher",
        "J. Repond",
        "C. Vollinger",
        "CERN",
        "Geneva",
        "Switzerland",
        "For the CERN High Luminosity LHC project",
        "a doubling of bunch intensity is foreseen. However",
        "this intensity increase is currently limited by the LHC injector chain",
        "in part due to longitudinal multi-bunch instabilities in the SPS. Therefore",
        "the implementation of an accurate SPS impedance model was started some time ago in order to obtain a better understanding of instability sources and develop mitigation measures. In this paper",
        "we present the electromagnetic characterization of commonly used all-metal gate valves with respect to their contribution to the SPS longitudinal impedance. The valve impedance was evaluated with commercially available EM-field simulation programs and verified with RF-bench measurements. Using this input",
        "it was possible to obtain in particle simulations the dependence of the multi-bunch stability threshold on the number of these valves. A practical means of mitigation is to use a commercially available impedance shielded version of these gate valves. We also present the associated reduction in beam coupling impedance and the expected gain in beam stability if all existing unshielded valves are replaced by shielded valves."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik089_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik089.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik089_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK089",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK090",
      "title": "Characterization of Shielding for the CERN-SPS Vacuum Flanges With Respect to Beam Coupling Impedance",
      "authors": [
        "T. Kaltenbacher",
        "C. Vollinger",
        "CERN",
        "Geneva",
        "Switzerland",
        "Longitudinal multi-bunch instabilities in the CERN-SPS pose a serious limitation for future beam intensities required for high luminosity LHC. Hence",
        "an impedance model for the SPS accelerator was developed from which one group of vacuum flanges could be identified as being a major culprit for these instabilities. These flanges support high impedance modes and their impact on beam stability was traced to a longitudinal mode at about 1.4GHz. For improvement of multi-bunch stability threshold",
        "this group of flanges will be shielded as part of an impedance reduction campaign. We describe the evaluation of different impedance shielding designs proposed to reduce the longitudinal beam coupling impedance of this group of vacuum flanges in the SPS. EM-field simulations were performed to identify remaining resonances in these vacuum flanges with impedance shield prototypes installed",
        "and the simulation models were benchmarked with RF-measurements. Depending on the performance and other parameters",
        "the most suitable shield design will be selected",
        "built and installed. As a first step",
        "the installation of one shielding design in some positions in the SPS is planned for the beginning of 2017."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik090_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik090.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik090_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK090",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK091",
      "title": "Amplitude Dependent Closest Tune Approach Generated by Normal and Skew Octupoles",
      "authors": [
        "E.H. Maclean",
        "T. Persson",
        "R. Tomás",
        "CERN",
        "Geneva",
        "Switzerland",
        "Amplitude dependent closest tune approach",
        "an action dependent analogue of the DQmin generated by linear coupling",
        "was observed in the LHC during Run1. It restricts the accessible resonance free area of the tune diagram and by altering tune spread has the potential to impact upon Landau damping. A theoretical description of such behaviour",
        "generated by normal octupoles and linear coupling has recently been validated in the LHC",
        "however simulation has established that amp-dependent closest approach may also be generated by a combination of normal and skew octupoles. This paper summarizes these simulation based observations."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik091_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik091.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik091_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK091",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK092",
      "title": "Effect of Linear Coupling on Nonlinear Observables at the LHC",
      "authors": [
        "E.H. Maclean",
        "F.S. Carlier",
        "M. Giovannozzi",
        "T. Persson",
        "R. Tomás",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [],
      "abstract": "Simulation work during LHC Run 1 established that linear coupling had a large impact on nonlinear observables such amplitude detuning and dynamic aperture. It is generally taken to be the largest single source of uncertainty in the modelling of the LHC's nonlinear single particle dynamics. Measurements in 2016 sought to confirm this impact of linear coupling with beam. This paper summarizes the observed influence of linear coupling on various nonlinear observables in the LHC. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik092_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik092.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik092_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK092",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK093",
      "title": "New Methods for Measurement of Nonlinear Errors in LHC Experimental IRs and Their Application in the HL-LHC",
      "authors": [
        "E.H. Maclean",
        "F.S. Carlier",
        "J.M. Coello de Portugal",
        "A. Garcia-Tabares",
        "M. Giovannozzi",
        "L. Malina",
        "T. Persson",
        "P.K. Skowroński",
        "R. Tomás",
        "CERN",
        "Geneva",
        "Switzerland",
        "Studies of nonlinear errors in LHC experimental insertions (IRs) during Run 1 were based upon feed-down to tune and coupling from the crossing angle orbit bumps. Useful for validating the magnetic model",
        "this method alone is of limited use to understand discrepancies between magnetic and beam-based measurement. Feed-down from high-order multipoles is also difficult to observe. During Run 2 several alternative methods were tested in the LHC. This paper summarizes the results of these tests",
        "and comments on their potential application to the High-Luminosity LHC upgrade."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik093_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik093.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik093_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK093",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK094",
      "title": "LEIR Impedance Model and Coherent Beam Instability Observations",
      "authors": [
        "N. Biancacci",
        "H. Bartosik",
        "A. Huschauer",
        "E. Métralpresenter",
        "T.L. Rijoff",
        "B. Salvant",
        "R. Scrivens",
        "CERN",
        "Geneva",
        "Switzerland",
        "University of Rome La Sapienza",
        "Rome",
        "Italy",
        "The LEIR machine is the first synchrotron in the ion acceleration chain at CERN and it is responsible to deliver high intensity ion beams to the LHC. Following the recent progress in the understanding of the intensity limitations",
        "detailed studies of the machine impedance started. In this work we describe the present LEIR impedance model",
        "detailing the contribution to the total longitudinal and transverse impedance of several machine element. We then compare the machine tune shift versus intensity predictions against measurements at injection energy and summarize the coherent instability observations in absence of transverse damper feedback."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik094_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik094.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik094_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK094",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK095",
      "title": "Evaluation of Longitudinal Beam Impedance in the Beam Gas Ionization Monitor of the CERN-PS Accelerator",
      "authors": [
        "N. Nasr Esfahani",
        "T. Kaltenbacher",
        "J.W. Storey",
        "C. Vollinger",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [
        "The recently observed beam induced heating issues in the BGI monitors of the LHC which could have been occurred due to a strong coupling between the beam and the localized modes at the sensor location showed the general importance of a thorough evaluation of the beam coupling impedance and the corresponding heat deposit in beam monitoring equipments. This paper is devoted to the examination of the beam coupling impedance and beam induced heating for a currently under development beam gas ionization (BGI) monitor which is intended to be a part of the CERN Proton Synchrotron (PS) beam monitoring equipment. Details of the EM and wake field simulations for this BGI monitor together with the RF measurement results and power loss calculations will be presented."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik095_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik095.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik095_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK095",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK096",
      "title": "Assessment of Beam Impedance for the CERN-PS Booster Wire Scanner",
      "authors": [
        "T. Kaltenbacher",
        "N. Nasr Esfahanipresenter",
        "C. Vollinger",
        "CERN",
        "Geneva",
        "Switzerland",
        "It is well known that performance of accelerators critically depends on the interaction of high intensity beams with the surrounding structures. As a result of these beam interactions",
        "it is required at CERN to characterize the beam coupling impedance of each new machine element that is to be installed in the accelerator ring. In the framework of the LIU (LHC Injectors Upgrade) project",
        "a new design of rotational wire scanner to be used in the PS Booster is currently under development. As an intermediate step",
        "the prototype of this wire scanner was evaluated with respect to its longitudinal beam coupling impedance. Depending on the performance of this machine element",
        "it is planned to replace existing wire scanners in other machines at CERN (e.g. PS-Booster",
        "PS and SPS) with very similar designs. This paper presents the simulations and describes the measurement methods used for benchmarking electromagnetic simulations performed for the impedance evaluation of the LIU wire scanner for the PS-Booster. Additionally",
        "the device was fitted with an RF feed-through in order to monitor and attenuate certain undesired modes supported by this structure."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik096_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik096.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik096_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK096",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK097",
      "title": "An Optimization Tool to Design a Coreless Non-Linear Injection Kicker Magnet",
      "authors": [
        "ETH",
        "Zurich",
        "Switzerland",
        "B. MacDonald-de Neeve",
        "M. Paralievpresenter",
        "Á. Saá Hernández",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Top-up injection into low emittance light sources is challenging due to their inherent small dynamic apertures (DA). The use of a multipole-magnet injection kicker prevents disturbing the circulating beam. However",
        "the injected bunch will be mismatched due to unwanted focusing (linear field profile) or even filamented (nonlinear field profile). Coreless nonlinear kicker magnets",
        "using different configurations of straight conductors",
        "can produce transverse step-like magnetic field distribution which prevent the mismatch. We explored an 8-conductor configuration and a multi-conductor approach like unipolar massless septum design. Maximizing the spatial derivative of the transverse field step function is crucial in order to kick the injected bunch inside the DA. Comparing the results of different designs a particular dependence between the smallest clear aperture and the maximum transverse field spatial derivative was observed. We have developed an optimization tool to generate arbitrary 2D magnetic fields and determine the associated current distribution. With it we obtained new design solutions for possible injection magnets that go beyond the limitations of the standard designs."
      ],
      "institutions": [],
      "abstract": "B. MacDonald-de Neeve reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik097_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik097.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik097_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK097",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK098",
      "title": "Resonant Kicker System With Sub-part-per-million Amplitude Stability",
      "authors": [
        "M. Paraliev",
        "C.H. Gough",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "High stability resonant kicker magnet systems have been developed as part of the fast electron beam switching system of Swiss Free Electron Laser (SwissFEL). They are designed to separate two closely spaced electron bunches (28 ns apart) accelerated in one RF macro-pulse and to send them to two separate undulator lines. High shot-to-shot amplitude stability is required to minimize the disturbance of the electron beam trajectories and to ensure stable X-ray lasing. The stability and speed was unlikely to be achieved by standard pulsed systems and a novel 18 MHz",
        "lumped-element resonator deflector with high Q was developed. It is driven into resonance by a specialized pulsed RF driver. At resonance",
        "the circulating currents can approach 300 A and the resulting magnetic field gives the required deflection to the electron bunches. The advanced DC offset measurement system is also described in this paper. The measured stability reached less than 1 ppm (10e-6) rms",
        "well within the project requirements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik098_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik098.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik098_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK098",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK099",
      "title": "Beam Lifetime Studies for SPS Storage Ring",
      "authors": [
        "P. Sudmuang",
        "N. Juntong",
        "P. Klysubun",
        "T. Pulampong",
        "N. Suradet",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "Limitation of beam lifetime was systematically investigated and studied for Siam Photon Source (SPS) storage ring. The objective was to identify the main cause of the observed reduction of beam lifetime. The simulations of momentum acceptance and Touschek lifetime were performed",
        "incorporating non-linear effects generated by the installed high-field insertion devices. The Touschek lifetime was measured as a function of RF voltage and compared with the values obtained from simulation. The measurements were performed for a variety of different operation conditions of the insertion devices and different chromaticities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik099_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik099.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik099_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK099",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK100",
      "title": "The Applicability of NEG Coated Undulator Vessels for the CLARA FEL Test Facility",
      "authors": [
        "O.B. Malyshev",
        "K.B. Marinov",
        "K.J. Middleman",
        "N. Thompson",
        "R. Valizadeh",
        "P.H. Williams",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "O.B. Malyshev",
        "K.J. Middleman",
        "N. Thompson",
        "R. Valizadeh",
        "P.H. Williams",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "CLARA is a FEL test facility at Daresbury Laboratory (DL)",
        "UK. The undulator vacuum chamber is 20 m long with inner diameter 6 mm and its vacuum performance can benefit from a NEG coating. The thickness of the coating layer must be carefully optimised. A layer ~ 1 um would help the vacuum but a thinner layer would be partially transparent for the EM field reducing the resistive wall wakefields due to the NEG. A very thin layer",
        "however",
        "may not yield the necessary vacuum performance. Two types of NEG coatings produced at DL - dense and columnar - were considered. Their bulk conductivities were measured in a separate study. The resistive wall wakefield impedance was calculated following the standard approach for multilayer vessels. A 250 fs rms electron bunch was generated in ASTRA and its wakefield was obtained from the vessel impedance. The FEL performance was then studied through GENESIS simulations and the result compared to the case with no wakefields. It was found that NEG layers thicker than 100 nm give an unacceptable reduction of the FEL power and the vacuum performance of such thin coatings is unknown. Possible solutions to this problem are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik100_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik100.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik100_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK100",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK101",
      "title": "Novel Implementation of Quadrupole and Higher Order Fringe Fields to Accelerator Design",
      "authors": [
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Until recently",
        "in the initial design phase of any accelerator project",
        "it was not possible to have an adequate description of quadrupole and higher order multipole fringe fields. We report on the latest developments in analytical fringe fields for multipoles",
        "particularly for quadrupoles and sextupoles. We show how they can be used to improve accelerator codes and make them both faster and more precise. We also show how the analytical formulae for the fringe fields yield expressions for both the scalar and vector potentials in electromagnetism. We conclude by discussing the application of both potentials to the design of multipole magnets as well as the implementation of symplectic kick approximations for fringe fields in thin lens models that could be used in accelerator codes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik101.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK101",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK102",
      "title": "Measurement of RF Resonances and Measured Impact on Transverse Multibunch Instabilities from In-vacuum Insertions Devices",
      "authors": [
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Diamond Light Source has currently 15 in-vacuum insertion devices (ID) installed",
        "mostly built in-house. Their measured impact on multi-bunch mode damping as a result of varying magnet gap was shown before",
        "now we augment these with measurements of broadband frequency spectra with stored beam obtained using an antenna placed in the ID vacuum. Finally",
        "we present off-line measurements of resonances in the ID vessel acquired using a vector network analyser and two antennae installed in-vacuum."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik102.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK102",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK106",
      "title": "Impedance and Collective Effects for the Advanced Light Source Upgrade at LBNL",
      "authors": [
        "S. Persichelli",
        "J.M. Byrdpresenter",
        "S. De Santis",
        "D. Li",
        "T.H. Luo",
        "C. Steier",
        "M. Venturini",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The upgrade of the Advanced Light Source (ALS-U) consists of a multiband achromat ultralow emittance lattice for the production of diffraction-limited soft x-rays. A very important issue for ALS-U is represented by instabilities induced by wakefields",
        "that may limit the peak current of individual bunches and the total beam current. In addition",
        "vacuum chamber apertures of few millimeters",
        "that are a key feature of low-emittance machines",
        "can result in a significant increase in the Resistive Wall (RW) impedance. In this paper we present progress on establishing short range wakefield model for ALS-U and evaluating the impact on the longitudinal and transverse single-bunch dynamics."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik106_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik106.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik106_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK106",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK107",
      "title": "Comparison Studies of Graphene Sey Results in NSRL and DL",
      "authors": [
        "J. Wang",
        "Y. Wang",
        "B. Zhang",
        "Y.X. Zhang",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "B.S. Sian",
        "R. Valizadeh",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "R. Valizadeh",
        "G.X. Xia",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "University of Manchester",
        "Manchester",
        "United Kingdom"
      ],
      "institutions": [
        "Graphene has many excellent properties, such as high electron carrier mobility, good thermal conductivity and transparency etc. The secondary electron yield (SEY) of graphene with copper substrate had been studied in National Synchrotron Radiation Laboratory (NSRL) of China. The results show that the maximum SEY ('max) of 6~8 layers graphene film with copper substrates is about 1.25. Further studies indicate that many factors can affect the SEY test results. The recent SEY tests of graphene films with copper substrates in Daresbury Laboratory (DL) of UK gave the maximum SEY of as-received copper, graphene samples with copper substrates are 1.89, 1.83, and 1.68, respectively, under the incident charge per unit surface (Q) of 7.6×10-8 C 'mm-2. Meanwhile, the SEY test parameters and measurement results of graphene in both laboratories are compared and analysed. The effect of defects on the SEY results of graphene films with copper substrate is also discussed."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik107_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik107.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik107_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK107",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK109",
      "title": "Experimental Study of Vertical-Longitudinal Coupling Induced by Wakefields at CesrTA",
      "authors": [
        "S. Wang",
        "J.D. Perrin",
        "S. Poprocki",
        "D. L. Rubin",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Transverse vertical wakefields can cause vertical beam size growth in accelerators. Here we report recent measurements and simulations of wakefields from movable scrapers at the CesrTA. The charge dependent vertical beam size growth was observed while a single scraper was inserted through the top of the chamber. No change in the beam size was observed with top and bottom scrapers inserted symmetrically. The apparent growth in the vertical beam size was due in large part to the y-z coupling (vertical crabbing) induced by the monopole wake of the asymmetric scraper configuration. We explored this y-z coupling by varying vertical betatron phase advance between the vertical beam size monitor and the scrapers. In addition",
        "we found that existing residual",
        "current independent y-z coupling could be compensated by the scraper wake. Predictions of a tracking simulation are in good agreement with the measurements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik109_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik109.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik109_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK109",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK110",
      "title": "Resistive Wall Instability and Impedance Studies of Narrow Undulator Chamber in CHESS-U",
      "authors": [
        "S. Wang",
        "M.G. Billing",
        "S. Poprocki",
        "D. L. Rubin",
        "D. Sagan",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "In a major upgrade of the Cornell Electron Storage Ring (CESR) one sextant of ring will be replaced with double bend achromats (DBAs) and undulator straights for x-ray users. The resistive wall impedance from the narrow gap (4.5 mm) undulator chambers (5 m per straight) may limit total beam. Here we report recent results of modelling and calculation of multibunch instabilities due to the impedance of chamber walls and transition tapers. The short range wakefields and resistive wall impedance are modelled and incorporated in a tracking simulation. The coupled-bunch growth rate found with the tracking study is in good agreement with the analytic approximation. We find that the resistive wall instability can be readily damped by our existing bunch-by-bunch feedback system. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik110_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik110.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik110_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK110",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK111",
      "title": "Derivation of a Finite Element Formulation From a Lagrangian for the Electromagnetic Potentials",
      "authors": [
        "A.R. Vrielink",
        "M.H. Nasrpresenter",
        "S.G. Tantawi",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Conventional electromagnetic finite element solvers typically solve a weak formulation of the Helmholtz wave equation. While mathematically this approach is correct",
        "it does not fully reflect the fundamental physics involved. We offer an alternative variational formulation which is not derived from the Helmholtz wave equation but is more fundamentally tied to the physics of the system: a Lagrangian for the electromagnetic potentials. Solving for the potentials directly allows for a natural accounting of the beam wave interaction. It could also potentially avoid the issue of deleterious spurious modes inherent when selecting the Coulomb gauge and enforcing the subsequent divergence free condition",
        "eliminating the need for vector basis functions. Herein we present the theory and the resulting formulation including a discussion on gauge fixing. We conclude with some numerical results demonstrating the potential of this formulation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik111_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik111.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik111_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK111",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK112",
      "title": "A 2D Finite Element Solver for Electromagnetic Fields with m-fold Azimuthal Symmetry",
      "authors": [
        "A.R. Vrielink",
        "M.H. Nasrpresenter",
        "S.G. Tantawi",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Radiofrequency (RF) cavities for use in accelerators",
        "from RF sources to accelerating and transverse cavities",
        "often exhibit m-fold azimuthal symmetry. For cases where m>0",
        "commercially available finite element codes used to simulate the beam-wave interaction typically require a full 3D simulation. We have derived a finite element formulation which accounts for the known azimuthal dependence of the electromagnetic fields",
        "allowing us to solve for these problems on a 2D mesh and reducing simulation times significantly. The theory",
        "including the construction of the local finite element matrices and the selection of appropriate basis functions",
        "will be presented in addition to numerical results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik112_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik112.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik112_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK112",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK113",
      "title": "Entrance and Exit CSR Impedance for Non-Ultrarelativistic Beam",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Virginia Polytechnic Institute and State University",
        "Blacksburg",
        "Virginia",
        "USA",
        "For a high-brightness electron beam being transported through beamlines involving bending systems",
        "the coherent synchrotron radiation (CSR) and longitudinal space charge (LSC) interaction could often cause microbunching instability. The semi-analytical Vlasov solver for microbunching gain* depends on the impedances for the relevant collective effects. The existing results for CSR impedances are usually obtained for the ultrarelativistic limit. To extend the microbunching analysis to cases of low energies",
        "such as the case of an ERL merger",
        "or to density modulations at extremely small wavelength",
        "it is necessary to extend the impedance analysis to the non-ultrarelativistic regime. In this study",
        "we present the impedance analysis for the transient CSR interaction in the non-ultrarelativistic regime",
        "for transients including both entrance to and exit from a magnetic dipole. These impedance results will be compared to their ultra-relativistic counterparts**",
        "and the corresponding wakefield obtained from the impedance for low-energy beams will be compared with the existing results of transient CSR wakefield for general beam energies***.",
        "* C.-Y. Tsai et al.",
        "Proc. of IPAC'15",
        "596 (2015).  ** C. Mitchell et al .",
        "Proc. of IPAC'13",
        "1832 (2014).  *** E. L. Saldin et al .",
        "Nucl. Instrum. Meth. A 398",
        "373 (1997)."
      ],
      "institutions": [
        "Funding: Work supported by the Department of Energy, Laboratory Directed Research and Development Funding, under Contract No. DE-AC05-06OR23177"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik113_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik113.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik113_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK113",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK114",
      "title": "Study of Electron Polarization Dynamics in the JLEIC at JLab",
      "authors": [
        "F. Lin",
        "Y.S. Derbenev",
        "V.S. Morozov",
        "Y. Zhang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "DESY",
        "Hamburg",
        "Germany",
        "The design of an electron polarization scheme in the Jefferson Lab Electron-Ion Collider (JLEIC) aims to attain a high longitudinal electron polarization (over 70%) at collision points as required by the nuclear physics program. Comprehensive strategies for achieving this goal have been considered and developed including injection of highly polarized electrons from CEBAF",
        "mechanisms for manipulation and preservation of the polarization in the JLEIC collider ring and measurement of the electron polarization. In particular",
        "maintaining a sufficiently long polarization lifetime is crucial for accumulation of adequate experimental statistics. The chosen electron polarization configuration",
        "based on the unique figure-8 geometry of the ring",
        "removes the electron spin-tune energy dependence. This significantly simplifies the control of the electron polarization and suppresses the synchrotron sideband resonances. This paper reports recent studies and simulations of the electron polarization dynamics in the JLEIC electron collider ring."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik114_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik114.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik114_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK114",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK116",
      "title": "Aberration Compensation in a Skew Parametric-Resonance Ionization Cooling Channel",
      "authors": [
        "A.V. Sy",
        "Y.S. Derbenev",
        "V.S. Morozov",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "GWU",
        "Washington",
        "USA",
        "UCR",
        "Riverside",
        "California",
        "USA",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "Skew Parametric-resonance Ionization Cooling (Skew PIC) represents a novel method for focusing of highly divergent particle beams",
        "as in the final 6D cooling stage of a high-luminosity muon collider. In the muon collider concept",
        "the resultant equilibrium transverse emittances from cooling with Skew PIC are an order of magnitude smaller than in conventional ionization cooling. The concept makes use of coupling of the transverse dynamic behavior",
        "and the linear dynamics are well-behaved with good agreement between analytic solutions and simulation results. Compared to the uncoupled system",
        "coupling of the transverse dynamic behavior purports to reduce the number of multipoles required for aberration compensation while also avoiding unwanted resonances. Aberration compensation is more complicated in the coupled case",
        "especially in the high-luminosity muon collider application where equilibrium angular spreads in the cooling channel are on the order of 200 mrad. We present recent progress on aberration compensation for control of highly divergent muon beams in the coupled correlated optics channel",
        "and a simple cooling model to test the transverse acceptance of the channel."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik116_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik116.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik116_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK116",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK117",
      "title": "A Comprehensive Study of the Microwave Instability",
      "authors": [
        "A. Blednykh",
        "B. Bacha",
        "G. Bassipresenter",
        "O.V. Chubar",
        "M.S. Rakitin",
        "V.V. Smaluk",
        "M. Zhernenkov",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "Several instability thresholds and special waveform beam pattern have been observed during measurements of the horizontal beam size change vs single bunch current by the synchrotron light monitor (SLM) camera installed in a low dispersion area of the NSLS-II storage ring. The electron beam energy spread from In-Vacuum Undulator (IVU) of the Soft Matter Interfaces (SMI) beam line confirmed the microwave beam pattern behavior as a current dependent effect. The numerically obtained total longitudinal wakepotential by the GdfidL code allowed us to compare the measured results with particle tracking simulations using the SPACE code. The instability thresholds behavior at different RF voltages are in some sort of overarching agreement. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik117_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik117.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik117_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK117",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK118",
      "title": "Synchronous Phase Shift from Beam Loading Analysis",
      "authors": [
        "G. Bassi",
        "A. Blednykh",
        "J. Rose",
        "V.V. Smaluk",
        "J. Tagger",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "We discuss measurements",
        "performed in the NSLS-II storage ring",
        "of the synchronous phase shift as a function of single bunch current from beam loading parameters. The synchronous phase is calculated from the forward and reflected power measured in the RF cavities. The comparison with direct synchronous phase measurements shows good agreement."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik118_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik118.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik118_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK118",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK119",
      "title": "Lost Muon Study for the Muon g-2 Experiment at Fermilab",
      "authors": [
        "J.D. Crnkovic",
        "W. Morse",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "University of Illinois at Urbana-Champaign",
        "Urbana",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Fermilab Muon g-2 Experiment has a goal of measuring the muon anomalous magnetic moment to a precision of 140 ppb - a fourfold improvement over the 540 ppb precision obtained by the BNL Muon g-2 Experiment. Some muons in the storage ring will interact with material and undergo bremsstrahlung",
        "emitting radiation and loosing energy. These so called lost muons will curl in towards the center of the ring and be lost",
        "but some of them will be detected by the calorimeters. A systematic error will arise if the lost muons have a different average spin phase than the stored muons. Algorithms are being developed to estimate the relative number of lost muons",
        "so as to optimize the stored muon beam. This study presents initial testing of algorithms that can be used to estimate the lost muons by using either double or triple detection coincidences in the calorimeters."
      ],
      "institutions": [],
      "abstract": "D. Stratakispresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik119_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik119.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik119_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK119",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK120",
      "title": "Simulated performance of the Production Target for the Muon g-2 Experiment at Fermilab",
      "authors": [
        "D. Stratakis",
        "M.E. Convery",
        "J.P. Morgan",
        "D.A. Still",
        "M.J. Syphers",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The Muon g-2 Experiment plans to use the Fermilab Recycler Ring for forming the proton bunches that hit its production target. The proposed scheme uses one RF system",
        "80 kV of 2.5 MHz RF. In order to avoid bunch rotations in a mismatched bucket",
        "the 2.5 MHz is ramped adiabatically from 3 to 80 kV in 90 ms. In this study",
        "the interaction of the primary proton beam with the production target for the Muon g-2 Experiment is numerically examined."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik120_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik120.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik120_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK120",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK121",
      "title": "Computation of Synchrotron Radiation on Arbitrary Geometries in 3D with Modern GPU, Multi-Core, and Grid Computing",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Open Source Code for Advanced Radiation Simulation (OSCARS*) is an open source project being developed at Brookhaven National Laboratory for the computation of synchrotron radiation from arbitrary particle beams in arbitrary magnetic (and electric) fields on arbitrary geometries in 3D. OSCARS was designed with considerations for modern large scale computing infrastructure. These include the ability to use GPUs for computations",
        "multi-threaded computations",
        "and utilities for grid (or cloud) computing. Primary applications include",
        "but are not limited to",
        "the computation of spectra",
        "photon flux densities",
        "and notably",
        "power density distributions on arbitrary geometries in 3D which is of interest in accelerator component study and design. This modern approach and several complex geometries will be highlighted and elaborated on."
      ],
      "institutions": [],
      "abstract": "* http://oscars.bnl.gov reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik121_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik121.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik121_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK121",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPIK122",
      "title": "Applying Square Matrix to Optimize Storage Ring Nonlinear Lattice",
      "authors": [
        "Y. Li",
        "L. Yu",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A new method of using linear algebra technique to analyze periodical nonlinear beam dynamics is presented. For a given dynamical system",
        "a square upper triangular transfer matrix is constructed out of a one turn Taylor transfer map. First we separate the matrix into different low dimensional invariant subspaces according to their eigenvalues. Then a stable Jordan transformation can be obtained on each subspace. The transformation provides an excellent action-angle approximation to the solution of the nonlinear dynamics. And the deviation of the new action from constancy provides a measure of the nonlinearity of the motions",
        "which provides a novel method to optimize the nonlinear dynamic system. We applied this method to optimize various rings",
        "such as NSLS-II"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/wepik122_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/wepik122.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/wepik122_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEPIK122",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 95,
  "scrape_time": "2025-10-10 19:54:21"
}