{
  "session_info": {
    "id": "THIYSP",
    "name": "THIYSP - Invited Orals: Accelerator Technology",
    "url": "https://proceedings.jacow.org/ipac2022/html/thiysp.htm"
  },
  "papers": [
    {
      "paper_id": "THIYSP1",
      "title": "Development of Advanced Magnets for Modern and Future Synchrotron Light Sources",
      "authors": [
        "BNL",
        "Upton",
        "New York",
        "USA",
        "X-ray brightness is one of major figures of merit of ongoing and planned light source projects",
        "together with beamline capacity and reliability of operations. These requirements drive more and more compact configurations of the synchrotron magnets with precise dipole fields tailored to the lattice functions",
        "high gradients with tight field tolerances. In the past few years new configurations of Permanent Magnet element designs have emerged featuring small apertures required for high field strengths. In collaboration with the accelerator community we have been investigating new lattice designs for a future low-emittance upgrade of the NSLS-II storage ring. These new designs require small aperture magnets of demanding specifications in terms of field and gradient strengths",
        "field quality",
        "vacuum chamber integration and x-ray extraction. In this presentation we describe designs of the magnets for new generation of light sources and our ongoing R&D to verify the magnet performance",
        "field quality",
        "methods of extraction of synchrotron radiation fan",
        "long-term radiation resistance of the PM materials",
        "designs of vacuum chamber and specialized alignment techniques."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thiysp1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thiysp1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thiysp1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THIYSP1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:42:36"
}