{
  "session_info": {
    "id": "WEIB",
    "name": "WEIB - Invited Oral Presentations, Session on Engagement with Industry",
    "url": "https://proceedings.jacow.org/ipac2016/html/weib.htm"
  },
  "papers": [
    {
      "paper_id": "WEIB01",
      "title": "Collaboration with Industry in Korea for Medical Accelerators",
      "authors": [
        "KIRAMS/KHIMA",
        "Seoul",
        "Republic of Korea",
        "Activities related to medical accelerator development in Korea have been very active recently. Industrial collaboration in this respect has also been highly active. The current main medical accelerator project in Korea is the Korean Heavy Ion Medical Accelerator (KHIMA) project",
        "which is an heavy ion therapy facility mainly with carbon ions. The collaboration covers wide technical areas such as RF structures",
        "magnets",
        "vacuum components",
        "diagnostics",
        "etc. In this talk",
        "such industrial collaboration aspects in Korea will be presented and further collaboration areas will be proposed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/weib01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/weib01.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/weib01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEIB01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEIB02",
      "title": "Strategy of Collaboration with Industry for HiLumi LHC",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "The HiLumi LHC project aims at a significant increase of the attainable luminosity at LHC. The goal is to improve the statistics of measurements at LHC by an order of magnitude as compared to today's situation. The upgrade project involves the development and installation of several new components and facilities. New cryogenic facilities are needed",
        "a new type of superconducting crab cavities",
        "high field (11T) dipole magnets",
        "new quadrupoles for the interaction regions",
        "beam collimators that utilize advanced materials and also significant civil construction measures are required. The talk reviews potential collaboration with industry in all areas of the HiLumi LHC project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/weib02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/weib02.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/weib02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEIB02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEIB03",
      "title": "Technology Transfer and Research Projects",
      "authors": [
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada"
      ],
      "institutions": [],
      "abstract": "The funding scenario seems to improve based on the capability of a laboratory to generate technology that can be transferred to industry, in particular if the technology is of public interest. New research projects may benefit if the technology transfer is considered as an integral part of the project itself. The drawback could be that revenue generated by a successful technology transfer may give the impression that research projects only provide societal benefit by direct transfer through closed protocols. This paper provides an overview of different technology transfer projects worldwide and how different laboratories are dealing with the issue.",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/weib03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/weib03.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/weib03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEIB03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEIB04",
      "title": "How to Cope with Requirements or Requests from Accelerator Projects in the Case of Klystrons",
      "authors": [
        "Toshiba Electron Tubes & Devices Co.",
        "Ltd",
        "Tokyo",
        "Japan",
        "Electron tubes such as klystrons are very important components of accelerators and almost all of these tubes are made by industry. Requirements from accelerator projects as to the klystrons are very much diverse in terms of frequency",
        "RF power",
        "modes of operation (CW or pulse)",
        "number of tubes to be made",
        "delivery time",
        "etc. Frequently",
        "in order to cope with the requirements",
        "intensive R&D becomes mandatory. This talk covers how industry has been trying to cope with requirements and requests from accelerator projects in the case of klystrons."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/weib04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/weib04.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/weib04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEIB04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEIB05",
      "title": "Technology Transfer to Industry at PSI's SwissFEL Project and a Joint PSI/Industry Initiative Beyond",
      "authors": [
        "H.-U. Klein",
        "W. Diete",
        "Advanced Accelerator Technologies AG",
        "Villigen",
        "Switzerland",
        "H. Fitze",
        "M. Frei-Hardt",
        "T. Schmidt",
        "G. Travaglini",
        "A.F. Wrulich",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "For PSI's SwissFEL project several technical solutions were developed in close collaboration with industry employing technology Transfer (TT) from PSI. These involve",
        "e.g.",
        "specific C-Band accelerator structures with high gradients and sophisticated manufacturing technology. Enhanced high Q RF pulse compressors allow the efficient utilization of RF power. Strong",
        "small gap undulators allow to reach the desired 1A wavelength at a moderate electron beam energy of 5.8 GeV. Following these achievments PSI has developed and launched - together with specialized equipment companies - a joint initiative for a broader commercialization of PSI's accelerator and instrumentation technologies. Within the framework of the newly founded company Advanced Accelerator Technologies AG (AAT)",
        "located in the new PARK innovAARE next to PSI",
        "business development and operation on the basis of licensed PSI IP is undertaken to serve the scientific and industrial markets worldwide. This talk will cover TT examples",
        "the cooperation between PSI and industry",
        "and the perspective for such advanced accelerator technology to be industrialized and to be used for other accelerator projects & industrial applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/weib05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/weib05.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/weib05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEIB05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEIB06",
      "title": "Industry Role for Advanced Accelerator R&D",
      "authors": [
        "Muons",
        "Inc",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "Besides large research institutes which typically focus on fundamental research, industrial companies can also contribute to the development of advanced applications of accelerators as well as to fundamental accelerator technology. The funding of advanced or fundamental R&D, which is usually high-risk but potentially high-reward, is difficult to obtain for any organization, especially smaller industrial companies. As an example of one funding approach, I discuss the role of industrial companies in the field of accelerators and present several examples from my own experience of advanced R&D performed by industry under the United States Department of Energy Small Business Innovation and Small Business Technology Transfer Research (SBIR-STTR) Grant programs.",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/weib06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/weib06.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/weib06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEIB06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-10 20:10:21"
}