{
  "session_info": {
    "id": "THXMH",
    "name": "THXMH - Synchrotron radiation sources and free electron laser",
    "url": "https://proceedings.jacow.org/rupac2018/html/thxmh.htm"
  },
  "papers": [
    {
      "paper_id": "THXMH01",
      "title": "Status of Development of Superconducting Insertion Devices for Generation of Synchrotron Radiation at Budker INP",
      "authors": [
        "V.A. Shkaruba",
        "A.V. Bragin",
        "S.V. Khrushchev",
        "V.K. Lev",
        "N.A. Mezentsev",
        "V.M. Syrovatin",
        "O.A. Tarasenko",
        "V.M. Tsukanov",
        "A.A. Volkov",
        "A.V. Zorin",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The installation of superconducting insertion device on storage ring gives an opportunity to increase the photon flux in the required range of synchrotron radiation spectrum and shift the photon spectrum to hard X-ray region. During more than 30 years BINP developed the superconducting insertion devices for generation of synchrotron radiation. More than 20 superconducting wigglers which were produced by BINP are used on many storage rings around the world. Each of them was optimized for the individual requirements of the experiments and taking into account the characteristics of the storage rings. However all the device can be conditionally divided into several groups with similar features: high field wigglers (up to 7.5 T) with long period (140-200 mm)",
        "middle field (2.5-4.2 T) with middle period (46-64 mm) and low field (2-2.1 T) with short period (30-34 mm). The superconducting wiggler cryostats which are developed in BINP are operated not only with zero liquid helium consumption but even with a lower relative to the atmosphere pressure despite of additional heat load from the electron beam and from the current of ~1000 A for supplying of superconducting magnet. This allows not only to avoid a helium loss but also to increase the level of the magnetic field due to the shifting of the critical parameters of superconducting wire. The features of magnetic and cryogenics systems of the superconducting wigglers produced in BINP are presented in this report."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/thxmh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/thxmh01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/thxmh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-THXMH01",
      "page_number": "94",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-11 02:22:05"
}