{
  "session_info": {
    "id": "THXB",
    "name": "THXB - Invited Oral Presentation, Applications of Accelerators",
    "url": "https://proceedings.jacow.org/IPAC2014/html/thxb.htm"
  },
  "papers": [
    {
      "paper_id": "THXB01",
      "title": "Accelerators for Medical Application: what is so special?",
      "authors": [
        "J.M. Schippers",
        "M. Seidel",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The specific requirements of accelerators for radiation therapy will be discussed. The focus will be on accelerator and beam transport design",
        "but also on operational and formal aspects. We will discuss the special requirements to reach a high reliability for patient treatments as well as an accurate delivery of the dose at the correct position in the patient using modern techniques like pencil beam scanning. The requirements of the beam are quite different from those in a nuclear physics laboratory",
        "such as a special matching of the emittance of the accelerated beam",
        "requirements on beam intensity and stability and prevention of activation. The way of operating a medical device requires not only operators",
        "but also the possibility to have a safe machine operation by non accelerator specialists at different operating sites. Size",
        "weight and price are important for a in a hospital based facility. This is encouraging the application of new developments in superconductivity and has stimulated novel accelerator types and beam sharing schemes. Since certification and legal aspects play an important role in a medical device",
        "these topics will also be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/thxb01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/thxb01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/thxb01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-THXB01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 20:48:15"
}