{
  "session_info": {
    "id": "THOCI",
    "name": "THOCI - FEL Technology -3-",
    "url": "https://proceedings.jacow.org/FEL2012/html/thoci.htm"
  },
  "papers": [
    {
      "paper_id": "THOCI01",
      "title": "X-ray Based Undulator Commissioning in SACLA",
      "authors": [
        "T. Tanaka",
        "T. Hara",
        "T. Hatsui",
        "H. Tanaka",
        "K. Togawa",
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "RIKEN/SPring-8",
        "Hyogo",
        "Japan",
        "SACLA",
        "the SPring-8 Angstrom Compact free electron LAser",
        "achieved first lasing in June 2011 at the wavelength of 0.12 nm",
        "which soon got down to 0.08 nm. After further beam tuning aiming at higher laser power and more stable operation",
        "the user operation started in March 2012. In SACLA",
        "18 segments of in-vacuum undulator have been installed to achieve FEL saturation in an x-ray region. Each segment is 5-m long and placed with a 1.15-m long interval for installation of diagnostics and magnetic components. Because of such a segmented structure",
        "we have many error sources that can lead to gain reduction. For example",
        "the undulator K value can fluctuate from segment to segment",
        "the electron beam can be kicked by the misalignment of quadrupole magnets",
        "and so on. In order to eliminate all these errors",
        "we have to optimize many parameters related to undulator operation. Such an optimization process is referred to as undulator commissioning. In SACLA",
        "the undulator commissioning has been carried out based on the characterization of x rays both in spontaneous radiation and FEL radiation. In this paper",
        "the details of the commissioning procedure and the achieved results are reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/thoci01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/thoci01.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/thoci01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-THOCI01",
      "page_number": "543",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:35:40"
}