{
  "session_info": {
    "id": "TUXA",
    "name": "TUXA - Invited Oral Presentations, Photon Sources and Electron Accelerators",
    "url": "https://proceedings.jacow.org/ipac2017/html/tuxa.htm"
  },
  "papers": [
    {
      "paper_id": "TUXA1",
      "title": "Towards Diffraction Limited Storage Ring Based Light Sources",
      "authors": [
        "L. Liu",
        "H. Westfahl Jr.",
        "LNLS",
        "Campinas",
        "Brazil",
        "Experimental x-ray techniques that benefit from the great increase in brightness and coherent flux provided by the fourth generation of synchrotron light sources",
        "based on recent advances in accelerator design and technology",
        "are widely expanding nowadays. The basic ingredient to higher brightness is a further reduction of the electron beam emittance in storage rings dedicated to light sources. However",
        "to fully explore the potential of these new sources",
        "it is necessary to optimize other variables as well",
        "such as the proper matching of electrons and photons phase-space and the possibility of using new kinds of insertion devices. Equally important is to try new ways to improve the integration between the light source capabilities and the experiment needs. In this work",
        "recent progress of low emittance rings will be reviewed and the efforts to improve transverse coherent flux and source-to-beamline integration at the Brazilian Sirius project will be described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/tuxa1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/tuxa1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/tuxa1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-TUXA1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 19:46:43"
}