{
  "session_info": {
    "id": "WEPJE",
    "name": "WEPJE - Wednesday Posters (Jefferson)",
    "url": "https://proceedings.jacow.org/IPAC2015/html/wepje.htm"
  },
  "papers": [
    {
      "paper_id": "WEPJE001",
      "title": "Optimal Positron-Beam Excited Plasma Wakefields in Hollow and Ion-Wake Channels",
      "authors": [
        "A. A. Sahai",
        "T.C. Katsouleas",
        "Duke ECE",
        "Durham",
        "North Carolina",
        "USA",
        "A positron-beam interacting with the plasma electrons drives radial suck-in",
        "in contrast to an electron-beam driven blow-out in the over-dense regime",
        "nb>n0. In a homogeneous plasma",
        "the electrons are radially sucked-in from all the different radii. The electrons collapsing from different radii do not simultaneously compress on-axis driving weak fields. A hollow-channel allows electrons from its channel-radius to collapse simultaneously exciting coherent fields *. We analyze the optimal channel radius. Additionally",
        "the low ion density in the hollow allows a larger region with focusing phase. We have shown the formation of an ion-wake channel behind a blow-out electron bubble-wake. Here we explore positron acceleration in the over-dense regime comparing an optimal hollow-plasma channel to the ion-wake channel **. The condition for optimal hollow-channel radius is also compared. We also address the effects of a non-ideal ion-wake channel on positron-beam excited fields.",
        "* S Lee",
        "T Katsouleas",
        "Phys. Rev. E",
        "vol 64",
        "045501(R) (2001) ** A A Sahai",
        "T Katsouleas",
        "Non-linear ion-wake excitation by ultra relativistic electron wakefields",
        "in review (http://arxiv.org/pdf/1504.03735v1.pdf)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje001.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE002",
      "title": "Photoinjector Improvement and Control by Surface Acoustic Waves",
      "authors": [
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "A. Afanasevpresenter",
        "C.E. Korman",
        "GWU",
        "Washington",
        "USA",
        "A new technique is being developed to enhance the efficiency of photocathodes used for electron sources to improve emission capabilities of electron sources",
        "such as bunch charge and average current. The proposed technique is based on the use of surface acoustical waves (SAW) generated on the piezoelectric surface of a GaAs photocathode. The generation of SAW on piezoelectric substrates is known to produce strong piezoelectric fields that propagate on the surface of the material. These fields can significantly suppress recombination effects and result in enhanced quantum efficiency of photoemission. Experimental measurements of photoemission quantum efficiency will be done on semiconductors used as photocathode materials (e.g.",
        "GaAs) in presence of SAW with varied parameters. The experimental results will be used as input for physics modeling that will provide a basis for design of operational SAW-enhanced photocathodes. While the improved quantum efficiency and parameter control expected from the use of SAW will be useful for many research devices and accelerators",
        "the commercialization of such a widespread field as electron microscopy is compelling."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje002.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE006",
      "title": "Dielectric Wakefield Accelerator Experiments at ATF",
      "authors": [
        "D.Y. Shchegolkov",
        "E.I. Simakov",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Dielectric wakefield acceleration (DWA) presents us with means to achieve the accelerating gradient high above the limits of conventional accelerators. In a typical DWA scheme a higher energy lower charge main bunch is accelerated in the wakefield produced by a preceding lower energy higher charge drive bunch inside of a hollow metal-encapsulated dielectric tube. To make use of as much energy of the drive bunch as possible",
        "it is highly important that all parts of it decelerate uniformly. Close to uniform drive bunch deceleration can be achieved if its current is properly shaped.* At Accelerator Test Facility (ATF) at BNL we shaped the current of a chirped electron beam with an adjustable mask placed inside of the highly dispersive region in the magnetic dogleg. We passed the shaped beam current through a quartz tube and observed the beam particles’ energy modulation at the tube’s output with a spectrometer. By tuning the mask we were able to control the beam energy modulation and thus the wakefield profile in the tube.",
        "* B. Jiang",
        "C. Jing",
        "P. Schoessow",
        "J. Power",
        "and W. Gai",
        "PRSTAB 15",
        "011301 (2012)."
      ],
      "institutions": [
        "Funding: This work is supported by the U.S. Department of Energy through the Laboratory Directed Research and Development (LDRD) program at Los Alamos National Laboratory."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje006.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE007",
      "title": "Simulation Studies of BBU Suppression Methods and Acceptable Tolerances in Dielectric Wakefield Accelerators",
      "authors": [
        "D.Y. Shchegolkov",
        "E.I. Simakov",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The advantage of dielectric wakefield accelerators (DWAs) is the ability to achieve accelerating gradients well above the limits of conventional accelerators. However DWAs will also produce high transverse wakefields if the beam propagates off-center",
        "which grow even faster than the accelerating gradient when the width of the beam channel is decreased.* It is highly important to suppress single beam breakup (BBU) instability in order for the beam to propagate long enough so that a reasonable amount of energy (e.g.",
        "80%) from the drive bunch is extracted. In addition bending of the dielectric channel has a similar effect to off-center steering of the beam with the required tolerances on the channel straightness typically in a few micron range. For both rectangular and circular dielectric lined waveguides we use a FODO lattice with a tapered strength for suppression of BBU. We impose initial energy chirp on the drive beam to make use of the BNS damping. We change rectangular waveguide orientation by 90 degrees with a small step to make use of the quadrupole wakefield focusing. These and other techniques and tolerance requirements are discussed and simulation results are presented in this presentation.",
        "* C. Li",
        "W. Gai",
        "C. Jing",
        "J.G. Power",
        "C.X. Tang",
        "and A. Zholents",
        "High gradient limits due to single bunch beam breakup in a collinear dielectric wakefield accelerator",
        "PRSTAB 17",
        "091302 (2014)."
      ],
      "institutions": [
        "Funding: This work is supported by the U.S. Department of Energy through the Laboratory Directed Research and Development (LDRD) program at Los Alamos National Laboratory."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje007.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE008",
      "title": "Experimental Study of Wakefields in an X-band Photonic Band Gap Accelerating Structure",
      "authors": [
        "E.I. Simakov",
        "S. Arsenyev",
        "C.E. Buechler",
        "R.L. Edwards",
        "W.P. Romero",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "M.E. Conde",
        "G. Ha",
        "C.-J. Jing",
        "J.G. Power",
        "E.E. Wisniewski",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "We designed an experiment to conduct a detailed investigation of higher order mode spectrum in a room-temperature traveling-wave photonic band gap (PBG) accelerating structure at 11.7 GHz. It has been long recognized that PBG structures have great potential in reducing long-range wakefields in accelerators. The first ever demonstration of acceleration in room-temperature PBG structures was conducted at MIT in 2005. Since then",
        "the importance of that device has been recognized by many research institutions. However",
        "the full experimental characterization of the wakefield spectrum in a beam test has not been performed to date. The Argonne Wakefield Accelerator (AWA) test facility at the Argonne National Laboratory represents a perfect site where this evaluation could be conducted with a single high charge electron bunch and with a train of bunches. Here we describe fabrication and tuning of PBG cells",
        "the final cold-test of the traveling-wave accelerating structure",
        "and the results of the beam testing at AWA."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje008.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE010",
      "title": "Particle Production of a Graphite Target System for the Intensity Frontier",
      "authors": [
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "PU",
        "Princeton",
        "New Jersey",
        "USA"
      ],
      "institutions": [],
      "abstract": "A solid graphite target system is considered for an intense muon and/or neutrino source in support of physics at the intensity frontier. We previously optimized the geometric parameters of the beam and target to maximize particle production at low energies by incoming protons with kinetic energy of 6.75 GeV and an rms geometric emittance of 5 mm-mrad using the",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje010.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE011",
      "title": "High Reliability, Long Lifetime, Continuous Wave H− Ion Source",
      "authors": [
        "P. Barrows",
        "G.E. Becerra",
        "PNL",
        "Madison",
        "Wisconsin",
        "USA",
        "Phoenix Nuclear Labs (PNL) is developing a high-current",
        "long-lifetime negative hydrogen (H−) ion source in partnership with Fermilab as part of an ion beam injector for future Intensity Frontier particle accelerators. In this application",
        "continuous output with long lifetime and high reliability and efficiency are critical. Existing ion sources at Fermilab rely on plasma-facing electrodes and are limited to lifetimes of a few hundred hours",
        "while requiring relatively high gas loads on downstream components. PNL's H− ion source uses an electrodeless microwave plasma generator which has been extensively developed in PNL's positive ion source systems",
        "demonstrating 1000+ hours of operation and >99% continuous uptime. A magnetic filter preferentially blocks energetic electrons produced in the plasma",
        "while allowing cold electrons and fast neutrals through toward a cesiated surface converter to produce the desired H− ions",
        "which are extracted into a low energy beam using electrostatic lenses. The design specifications are 5-10 mA of continuous H− current at 30 keV with <0.2 pi-mm-mrad beam emittance. Construction and testing of the H− ion source is underway at PNL."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje011.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE012",
      "title": "Design and Optimisation of Dielectric Laser Deflecting Structures",
      "authors": [
        "K.P. Wootton",
        "R.J. England",
        "I.V. Makasyuk",
        "Z. Wu",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "R.L. Byer",
        "E.A. Peralta",
        "Stanford University",
        "Stanford",
        "California",
        "USA",
        "Friedrich-Alexander Universität Erlangen-Nuernberg",
        "University Erlangen-Nuernberg LFTE",
        "Erlangen",
        "Germany",
        "Recent experimental demonstrations of dielectric laser-driven accelerator structures offer a path to the miniaturisation of accelerators. In order to accelerate particles to higher energies using a staged sequence of accelerating structures",
        "integrating compatible micrometre-scale transverse deflecting structures into these accelerators is necessary. Using simulations",
        "the present work outlines the design and optimisation of a fused-silica laser-driven grating deflecting structure for relativistic electron beams. Implications for device fabrication and experiments are outlined."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje012.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE013",
      "title": "A New Accelerating Mode in a Silicon Woodpile Structure and Its High-efficiency Power Coupler Design",
      "authors": [
        "Z. Wu",
        "R.J. England",
        "C. Lee",
        "C.-K. Ng",
        "K.P. Wootton",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Silicon woodpile photonic crystals provide a base structure that can be used to build a three-dimensional dielectric waveguide system for high-gradient laser-driven acceleration. A new woodpile waveguide design that hosts a phase synchronous",
        "centrally confined accelerating mode with ideal Gaussian transverse profile is proposed. Comparing with previously discovered silicon woodpile accelerating modes",
        "this mode shows advantages in better beam loading and higher achievable acceleration gradient. Several travelling-wave coupler design schemes developed for multi-cell RF cavity accelerators are adapted to the woodpile accelerator coupler design based on this new accelerating mode. A forward-wave-coupled",
        "highly efficient silicon woodpile accelerator is achieved. Simulation shows high efficiency of over 70% of the drive laser power coupled to this fundamental woodpile accelerating mode",
        "with less than 15% backward wave excitation. The estimated acceleration gradient",
        "when the coupler structure is driven at the damage threshold fluence of silicon at its operating 1.506 um wavelength",
        "can reach roughly 185 MV/m."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE015",
      "title": "Muon Tracking Studies in a Skew Parametric Resonance Ionization Cooling Channel",
      "authors": [
        "A.V. Sy",
        "Y.S. Derbenev",
        "V.S. Morozov",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "GWU",
        "Washington",
        "USA",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "Skew Parametric-resonance Ionization Cooling (SPIC) is an extension of the Parametric-resonance Ionization Cooling (PIC) framework that has previously been explored as the final 6D cooling stage of a high-luminosity muon collider. The addition of skew quadrupoles to the PIC magnetic focusing channel induces coupled dynamic behavior of the beam that is radially periodic. The periodicity of the radial motion allows for the avoidance of unwanted resonances in the horizontal and vertical transverse planes",
        "while still providing periodic locations at which ionization cooling components can be implemented. A first practical implementation of the magnetic field components required in the SPIC channel is modeled in MADX. Dynamic features of the coupled correlated optics with and without induced parametric resonance are presented and discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje015.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE016",
      "title": "INTENSE MUON BEAMS FROM THE CSNS SPALLATION TARGET",
      "authors": [
        "Y. Bao",
        "G.G. Hanson",
        "UCR",
        "Riverside",
        "California",
        "USA",
        "Intense muon beams are useful for a wide range of physics experiments. Currently most of the muon beams are produced by protons hitting thin targets sitting upstream of spallation neutron targets. The intensity of the muons is greatly limited by the small thickness of the muon targets",
        "which are intended to have minimum impact on the proton beams. When the majority of the proton beam hits the spallation target",
        "a large number of pions/muons are produced. After being captured in a solenoidal magnetic field",
        "a high intensity muon beam can be produced. In this paper we take the Chinese Spallation Neutron Source (CSNS) target as an example and investigate the production of high intensity muon beams. Two possibilities are presented in this paper: an upstream collection of surface muons and a downstream collection of pions which is followed by a decay and compress channel to obtain a high intensity muon beam. Simulations show both methods can reach high intensities which could significantly increase the statistics of many experiments."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje016.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE019",
      "title": "Simulations of Field-Emission Electron Beams from CNT Cathodes in RF Photoinjectors",
      "authors": [
        "D. Mihalcea",
        "H. Panuganti",
        "P. Piot",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "RadiaBeam",
        "Santa Monica",
        "California",
        "USA",
        "P. Piot",
        "J.C.T. Thangaraj",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "Average field emission currents of up to 700 mA were produced by Carbon Nano Tube (CNT) cathodes in a 1.3 GHz RF gun at Fermilab High Brightness Electron Source Lab. (HBESL). The CNT cathodes were manufactured at Xintek and tested under DC conditions at RadiaBeam. The electron beam intensity as well as the other beam properties are directly related to the time-dependent electric field at the cathode and the geometry of the RF gun. This report focuses on simulations of the electron beam generated through field-emission and the results are compared with experimental measurements. These simulations were performed with the time-dependent Particle In Cell (PIC) code WARP. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje019.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE020",
      "title": "The Two Beam Acceleration Staging Experiment at Argonne Wakefield Accelerator Facility",
      "authors": [
        "C.-J. Jing",
        "S.P. Antipov",
        "A. Kanareykin",
        "J.Q. Qiu",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "M.E. Conde",
        "D.S. Doran",
        "W. Gai",
        "G. Ha",
        "W. Liu",
        "J.G. Power",
        "J.H. Shao",
        "D. Wang",
        "E.E. Wisniewski",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "Staging",
        "defined as the accelerated bunch in a wakefield accelerator continues to gain energy from sequential drive bunches",
        "is one of the most critical technologies",
        "yet be demonstrated",
        "required to achieve high energy. Using the Two Beam Acceleration (TBA) beamline at Argonne Wakefield Accelerator facility",
        "we will perform a staging experiment using two X-band TBA units. The experiment is planned to conduct in steps. We report on the most recent progress."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje020.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE021",
      "title": "Fabrication and Demonstration of a Silicon Buried Grating Accelerator",
      "authors": [
        "A.C. Ceballos",
        "R.L. Byer",
        "K.J. Leedle",
        "E.A. Peralta",
        "O. Solgaard",
        "K. Soong",
        "Stanford University",
        "Stanford",
        "California",
        "USA",
        "R.J. England",
        "I.V. Makasyuk",
        "K.P. Wootton",
        "Z. Wu",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Technion",
        "Haifa",
        "Israel",
        "Friedrich-Alexander Universität Erlangen-Nuernberg",
        "University Erlangen-Nuernberg LFTE",
        "Erlangen",
        "Germany",
        "Using optical electromagnetic fields in dielectric microstructures",
        "we can realize higher-energy accelerator systems in a more compact",
        "low-cost form than the current state-of-the-art. Dielectric",
        "laser-driven accelerators (DLA) have recently been demonstrated using fused silica structures to achieve about an order-of-magnitude increase in accelerating gradient over conventional RF structures.* We leverage higher damage thresholds of silicon over metals and extensive micromachining capability to fabricate structures capable of electron acceleration. Our monolithic structure",
        "the buried grating",
        "consists of a grating formed on either side of a long channel via a deep reactive ion etch (DRIE).** The grating imposes a phase profile on an incoming laser pulse such that an electron experiences a net change in energy over the course of each optical cycle. This results in acceleration (or deceleration) as electrons travel down the channel. We have designed and fabricated such structures and begun testing at the SLAC National Accelerator Laboratory. We report on the progress toward demonstration of acceleration in these structures driven at 2um wavelength.",
        "* E.A. Peralta et al.",
        "Nature 503 (2013) ** C.M. Chang and O. Solgaard",
        "Appl. Phys. Lett. 104 (2014)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje021.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE023",
      "title": "Cathode Performance during Two Beam Operation of the High Current High Polarization Electron Gun for eRHIC",
      "authors": [
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "M.A. Ackeret",
        "J.R. Pietz",
        "Transfer Engineering and Manufacturing",
        "Inc",
        "Fremont",
        "California",
        "USA",
        "I. Ben-Zvi",
        "C. Degen",
        "D.M. Gassner",
        "R.F. Lambiase",
        "A.I. Pikin",
        "T. Rao",
        "B. Sheehy",
        "J. Skaritka",
        "E. Wang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "E. Dobrin",
        "R.C. Miller",
        "K.A. Thompson",
        "C. Yeckel",
        "Stangenes Industries",
        "Palo Alto",
        "California",
        "USA",
        "Two electron beams from two activated bulk GaAs photocathodes were successfully combined during the recent beam test of the High Current High Polarization Electron gun for eRHIC. The beam test took place at Stangenes Industries in Palo Alto",
        "CA",
        "where the cathodes were placed in radially opposite locations inside the high voltage shroud. No significant cross talking between the cathodes were found for the pertinent vacuum and low average current operation",
        "which is very promising towards combining multiple beams for higher average current. This paper describes the cathode preparation",
        "transport and cathode performance in the gun for the combining test",
        "including the QE and lifetimes of the photocathodes at various steps of the experiment."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE024",
      "title": "Progress on the Study of Direct Laser Electron Acceleration in Density-Modulated Plasma Waveguides",
      "authors": [
        "M.W. Lin",
        "B.W. Morgan",
        "The Pennsylvania State University",
        "University Park",
        "Pennsylvania",
        "USA",
        "S.-H. Chen",
        "C.-Y. Hsieh",
        "Y.-L. Liu",
        "NCU",
        "Chung Li",
        "Taiwan",
        "Penn State University",
        "University Park",
        "Pennsylvania",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje024.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE025",
      "title": "Phase Space Density as a Measure of Cooling Performance for the International Muon Ionization Cooling Experiment",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The International Muon Ionization Cooling Experiment (MICE)* is an experiment to demonstrate ionization cooling of a muon beam in a beamline that shares characteristics with one that might be used for a muon collider or neutrino factory. I describe a way to quantify cooling performance by examining the phase space density of muons",
        "and determining how much that density increases. This contrasts with the more common methods that rely on the covariance matrix and compute emittances from that. I discuss why a direct measure of phase space density might be preferable to a covariance matrix method. I apply this technique to an early proposal for the MICE final step beamline. I discuss how matching impacts the measured performance.",
        "* http://mice.iit.edu/ I am not a MICE collaboration member",
        "and nothing herein should be construed as representing the work or views of the collaboration."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje025.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE026",
      "title": "Conceptual Design of a Quadrupole Magnet for eRHIC",
      "authors": [
        "H. Witte",
        "J.S. Bergpresenter",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "eRHIC is a proposed upgrade to the existing Relativistic Heavy Ion Collider (RHIC) hadron facility at Brookhaven National Laboratory",
        "which would allow collisions of up to 21 GeV polarized electrons with a variety of species from the existing RHIC accelerator. eRHIC employs an Energy Recovery Linac (ERL) and an FFAG lattice for the arcs. The arcs require open-midplane quadrupole magnets of up to 30 T/m gradient of good field quality. In this paper we explore initial quadrupole magnet design concepts based on permanent magnetic material which allow to modify the gradient during operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje026.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE027",
      "title": "Partial Return Yoke for MICE Step IV and Final Step",
      "authors": [
        "H. Witte",
        "J.S. Bergpresenter",
        "S.R. Plate",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "This paper reports on the progress of the design and construction of a retro-fitted return yoke for the international Muon Ionization Cooling Experiment (MICE). MICE is a proof-of-principle experiment aiming to demonstrate ionization cooling experimentally. In earlier studies we outlined how a partial return yoke can be used to mitigate stray magnetic field in the experimental hall; we report on the progress of the construction of the partial return yoke for MICE Step IV. We also discuss an extension of the Partial Return Yoke for the final step of MICE; we show simulation results of the expected performance. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje027.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPJE033",
      "title": "The Progress of Funnelling Gun High Voltage Condition and Beam Test",
      "authors": [
        "E. Wang",
        "I. Ben-Zvi",
        "D.M. Gassner",
        "R.F. Lambiase",
        "W. Meng",
        "A.I. Pikin",
        "T. Rao",
        "B. Sheehy",
        "J. Skaritka",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "M.A. Ackeret",
        "J.R. Pietz",
        "Transfer Engineering and Manufacturing",
        "Inc",
        "Fremont",
        "California",
        "USA",
        "E. Dobrin",
        "R.C. Miller",
        "K.A. Thompson",
        "C. Yeckel",
        "Stangenes Industries",
        "Palo Alto",
        "California",
        "USA",
        "Stony Brook University",
        "Stony Brook",
        "USA"
      ],
      "institutions": [
        "A prototype of a high average current polarized electron funneling gun as an eRHIC injector has been built at BNL. The gun was assembled and tested at Stangenes Incorporated. Two beams were generated from GaAs photocathodes and combined by a switched combiner field. We observed the combined beams on a YAG crystal and measured the photocurrent by a Faraday cup. The gun has been shipped to Stony Brook University and is being tested there. In this paper we will describe the major components of the gun and recent beam test results. High voltage conditioning is discussed as well."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepje033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepje033.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepje033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPJE033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 20,
  "scrape_time": "2025-10-10 20:29:41"
}