{
  "session_info": {
    "id": "TUBH",
    "name": "TUBH - Oral Session 6",
    "url": "https://proceedings.jacow.org/sap2017/html/tubh.htm"
  },
  "papers": [
    {
      "paper_id": "TUBH1",
      "title": "Beam Commissioning of the China Spallation Neutron Source",
      "authors": [
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "China Spallation Neutron Source (CSNS)) is a high intensity proton accelerator based facility for delivering spallation neutrons to users. It consists of an 80-MeV H− DTL linac, and a 1.6-GeV Rapid Cycling Synchrotron and a neutron production target. The accelerators will provide 100kW proton beam for neutron target. The beam commissioning has been doing. Now, the first three tank of DTL have been successfully commissioned. The RCS was commissioned with 60MeV injection beam, and have been successfully accumulated, accelerated to 1.6GeV and extracted to beam dump. In this presentation, the methods, procedures and results of beam commissioning will be given."
      ],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tubh1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tubh1.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tubh1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUBH1",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUBH2",
      "title": "PIC Simulation of the High Current Beam for the LIA",
      "authors": [
        "TUB",
        "Beijing",
        "People's Republic of China"
      ],
      "institutions": [],
      "abstract": "High current beams emitting and transport of LIA injector are simulated by EGUN. Then beams transport and accelerated with space charge from injector exit to the LIA end are simulated by a PIC simulation code and the relationship between the beam parameters and the magnetic fields is also presented in this paper reference for this paper ※ https://doi.org/10.18429/JACoW-SAP2017-",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tubh2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tubh2.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tubh2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUBH2",
      "page_number": "124",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBH3",
      "title": "Dynamic simulation of Laser Cooling at the Heavy Ion Storage Ring",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Laser cooling of relativistic heavy ion beams of Li-like C3+ and O4+ is being in preparation at the experimental Cooler Storage Ring (CSRe). In order to study the laser cooling process",
        "a multi-particle tracking method was developed to simulate the detailed longitudinal dynamics of laser-cooled ion beams at the CSRe. The simulations of laser cooling of the 12C3+ ion beams by scanning the frequency of RF-buncher or laser wavelength were performed. The simulation results indicated that a large momentum spread ion beams could be laser-cooled by the combination of only one laser and the RF-buncher. The optimized parameters for scanning the RF-buncher frequency or laser frequency were obtained. Moreover",
        "the Schottky noise spectra of longitudinally modulated and laser-cooled ion beams was simulated to fully explain and anticipate the experimental results. The combination of Schottky spectra from the highly sensitive resonant Schottky pick-up and the simulation methods developed in this paper will be helpful to investigate the longitudinal dynamics of RF-bunched and ultra-cold ion beams in the upcoming laser cooling experiments at the CSRe.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tubh3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tubh3.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tubh3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUBH3",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUBH4",
      "title": "Central Region Design of the HUST SCC250 Superconducting Cyclotron",
      "authors": [
        "Z.J. Zeng",
        "K. Fan",
        "HUST",
        "Wuhan",
        "People's Republic of China",
        "A superconducting cyclotron based proton therapy system is being developed at Huazhong University of Science and Technology (HUST). The compactness of superconducting cyclotron imposes a challenge to the central region design. This paper describes beam dynamic studies in the central region. Beam performance at the initial 4 or so turns is crucial that determines the beam emittance",
        "energy divergence and extraction efficiency. Therefore",
        "considerable efforts have been made to the central region design and optimization. The electric and magnetic field distribution are numerically calculated by the program OPERA. Particle trajectories are simulated by means of the computer code Z3CYCLONE and the track command in OPERA. Finally",
        "an optimum central region configuration is obtained which meets the stringent requirements and further studies is carried out about the beam radial and axial motion based on the designed central region."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SAP2017-",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tubh4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tubh4.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tubh4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUBH4",
      "page_number": "127",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-11 02:56:04"
}