{
  "session_info": {
    "id": "FRBL",
    "name": "FRBL - Data Analytics",
    "url": "https://proceedings.jacow.org/icalepcs2021/html/frbl.htm"
  },
  "papers": [
    {
      "paper_id": "FRBL01",
      "title": "Machine Learning for Anomaly Detection in Continuous Signals",
      "authors": [
        "A.A. Saoulis",
        "K.R.L. Baker",
        "R.A. Burridge",
        "S. Lilley",
        "M. Romanovschi",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "High availability at accelerators such as the ISIS Neutron and Muon Source is a key operational goal",
        "requiring rapid detection and response to anomalies within the accelerator’s subsystems. While monitoring systems are in place for this purpose",
        "they often require human expertise and intervention to operate effectively or are limited to predefined classes of anomaly. Machine learning (ML) has emerged as a valuable tool for automated anomaly detection in time series signal data. An ML pipeline suitable for anomaly detection in continuous signals is described",
        "from labeling data for supervised ML algorithms to model selection and evaluation. These techniques are applied to detecting periods of temperature instability in the liquid methane moderator on ISIS Target Station 1. We demonstrate how this ML pipeline can be used to improve the speed and accuracy of detection of these anomalies."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/frbl01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/frbl01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/frbl01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRBL01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRBL03",
      "title": "A Literature Review on the Efforts Made for Employing Machine Learning in Synchrotrons",
      "authors": [
        "A. Khaleghi",
        "Z. Aghaei",
        "H. Haedar",
        "I. Iman",
        "K. Mahmoudi",
        "IKIU",
        "Qazvin",
        "Iran",
        "F. Ahmad Mehrabi",
        "M. Akbari",
        "M. Jafarzadeh",
        "A. Khaleghi",
        "P. Navidpour",
        "ILSF",
        "Tehran",
        "Iran",
        "Using machine learning (ML) in various contexts is in-creasing due to advantages such as automation for every-thing",
        "trends and pattern identification",
        "highly error-prone",
        "and continuous improvement. Even non-computer experts are trying to learn simple programming languages like Python to implement ML models on their data. De-spite the growing trend towards ML",
        "no study has re-viewed the efforts made on using ML in synchrotrons to our knowledge. Therefore",
        "we are examining the efforts made to use ML in synchrotrons to achieve benefits like stabilizing the photon beam without the need for manual calibrations of measures that can be achieved by reducing unwanted fluctuations in the widths of the electron beams that prevent experimental noises obscured measurements. Also",
        "the challenges of using ML in synchrotrons and a short synthesis of the reviewed articles were provided. The paper can help related experts have a general famil-iarization regarding ML applications in synchrotrons and encourage the use of ML in various synchrotron practices. In future research",
        "the aim will be to provide a more com-prehensive synthesis with more details on how to use the ML in synchrotrons."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/frbl03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/frbl03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/frbl03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRBL03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRBL04",
      "title": "Real-Time Azimuthal Integration of X-Ray Scattering Data on FPGAs",
      "authors": [
        "Z. Matej",
        "A. Barczyk",
        "A. Salnikov",
        "K. Skovhede",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "C. Johnsen",
        "K. Skovhede",
        "B. Vinter",
        "NBI",
        "København",
        "Denmark",
        "Max Planck Institute for the Physics of Complex Systems",
        "Dresden",
        "Germany",
        "Azimuthal integration (AZINT) is a procedure for reducing 2D-detector image into a 1D-histogram. AZINT is used extensively in photon science experiments",
        "in particular in small angle scattering and powder diffraction. It improves signal to noise ratio and data volumes are reduced by a factor of 1000. The underlaying procedure i.e. bin-counting has other applications. The potential of FPGAs for data analysis originates from recent progress in FPGA software design with complexity matching the scientific requirements. We implemented AZINT on FPGAs using OpenCL and synchronous message exchange (SME). It is demonstrated AZINT can process 600 Gb/s streams",
        "i.e. about 20’40 Gpixels/s",
        "on a single FPGA. FPGAs are usually more energy-efficient than GPUs",
        "they are flexible so they can fit a specific problem and outperform GPUs in relevant applications",
        "in particular AZINT here. Beside high throughput FPGAs allow data processing with well-defined and low latencies for real-time experiments. Radiation tolerance of FPGAs brings more synergies. It makes them ideal components for extra-terrestrial scientific instruments (e.g. Mars rovers) or detectors at spaceflights and satellites."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/frbl04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/frbl04.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/frbl04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRBL04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FRBL05",
      "title": "RemoteVis: An Efficient Library for Remote Visualization of Large Volumes Using NVIDIA Index",
      "authors": [
        "T.V. Spina",
        "D. Alnajjar",
        "M.L. Bernardi",
        "F.S. Furusato",
        "E.X. Miqueles",
        "A.Z. Peixinhopresenter",
        "LNLS",
        "Campinas",
        "Brazil",
        "A. Kuhn",
        "M. Nienhaus",
        "NVIDIA",
        "Santa Clara",
        "USA",
        "Advancements in X-ray detector technology are increasing the amount of volumetric data available for material analysis in synchrotron light sources. Such developments are driving the creation of novel solutions to visualize large datasets both during and after image acquisition. Towards this end",
        "we have devised a library called RemoteVis to visualize large volumes remotely in HPC nodes",
        "using NVIDIA IndeX as the rendering backend. RemoteVis relies on RDMA-based data transfer to move large volumes from local HPC servers",
        "possibly connected to X-ray detectors",
        "to remote dedicated nodes containing multiple GPUs for distributed volume rendering. RemoteVis then injects the transferred data into IndeX for rendering. IndeX is a scalable software capable of using multiple nodes and GPUs to render large volumes in full resolution. As such",
        "we have coupled RemoteVis with slurm to dynamically schedule one or multiple HPC nodes to render any given dataset. RemoteVis was written in C/C++ and Python",
        "providing an efficient API that requires only two functions to 1) start remote IndeX instances and 2) render regular volumes and point-cloud (diffraction) data on the web browser/Jupyter client.",
        "*NVIDIA IndeX",
        "https://developer.nvidia.com/nvidia-index"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/frbl05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/frbl05.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/frbl05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRBL05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 18:07:45"
}