{
  "session_info": {
    "id": "THYAA",
    "name": "THYAA - Applications",
    "url": "https://proceedings.jacow.org/hiat2018/html/thyaa.htm"
  },
  "papers": [
    {
      "paper_id": "THYAA01",
      "title": "Novel Methods for the Production of Radionuclides of Medical Interest With Accelerators",
      "authors": [
        "S. Corradetti",
        "A. Andrighetto",
        "M. Ballan",
        "F. Borgna",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "UNIFE",
        "Ferrara",
        "Italy",
        "V. Di Marco",
        "G. Marzaro",
        "N. Realdon",
        "Università degli Studi di Padova",
        "Padova",
        "Italy",
        "Radionuclides for radiopharmaceuticals preparation are currently produced in cyclotrons",
        "generators or nuclear reactors. However",
        "none of these modes is free from serious issues",
        "like: high costs of targets",
        "production of undesired radionuclide contaminants",
        "long and expensive separation methods and formation of long-lived radioactive wastes. For this purpose",
        "novel methods are being developed for the production of highly pure radionuclides. The ISOL (Isotope Separation On-Line) method can be applied to produce high purity radionuclides of medium and heavy masses. ISOL is nowadays established as a major method for the production of high intensity and high quality radioactive ion beams for nuclear physics studies. The SPES-ISOLPHARM project at INFN-LNL (Istituto Nazionale di Fisica Nucleare ’ Laboratori Nazionali di Legnaro) aims to provide a feasibility study for an innovative technology for the production of high specific activity radionuclides based on the ISOL method. The ongoing experimental activities on primary and secondary (ion collectors) targets production",
        "construction and testing of the selection and transport apparatus will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hiat2018/talks/thyaa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hiat2018/papers/thyaa01.pdf",
      "poster_url": "https://proceedings.jacow.org/hiat2018/posters/thyaa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2018-THYAA01",
      "page_number": "175",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:37:37"
}