{
  "session_info": {
    "id": "TUPMK",
    "name": "TUPMK - MC5 Poster Session",
    "url": "https://proceedings.jacow.org/ipac2018/html/tupmk.htm"
  },
  "papers": [
    {
      "paper_id": "TUPMK001",
      "title": "Removal of RF-Fingers at the Edges of the Injection Kickers",
      "authors": [
        "T.F.G. Günzel",
        "N. Ayala",
        "F.F.B. Fernández",
        "U. Iriso",
        "M. Pont",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "The ALBA storage ring injection kickers are equipped with RF-fingers to close a 2.5 mm gap between the ceramic tube and the metallic flange. After two distortion incidents that required the replacement of the fingers",
        "their removal was decided. The decision could be supported by the observation that most of the additional impedance is created above the cut-off frequency of the beam pipe. This was later confirmed by a temperature decrease in that zone after the removal. Furthermore it was checked that the thresholds of the longitudinal coupled bunch instabilities of modes trapped around the resulting open gap are above the maximal applied beam current of 400 mA."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk001.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK002",
      "title": "First Tests of the Apple II Undulator for the LOREA Insertion Device and Front End",
      "authors": [
        "J. Campmany",
        "L.G.O. Garcia-Orta",
        "J. Marcospresenter",
        "Z. Martí",
        "V. Massana",
        "M. Quispe",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "ALBA synchrotron is currently installing the new beamline LOREA (Low-Energy Ultra-High-Resolution Angular Photoemission for Complex Materials at ALBA). It operates in the range of 10 - 1500 eV with polarized light. To produce the light for the beamline",
        "an Apple II undulator with a period of 125 mm has been chosen. It can operate as an undulator at low energies and as a wiggler at high energies",
        "providing a wide energy range. The device was built by KYMA",
        "delivered on February 2017 and installed in August 2017. We present the magnetic measurements made during SAT as well as the simulations of the influence of the ID in the electron beam dynamics and the first measurements with beam. On the other hand",
        "the high demanding characteristics of the beamline lead to a device providing high power and wide beam in some working modes. This situation has been a challenge for the Front End (FE) thermal load. It has been built by the companies RMP and TVP",
        "and the FE modules have been installed in the tunnel along autumn 2017. We present the Site Acceptance Tests results as well as the technical solutions adopted",
        "especially in terms of mechanical design and used materials."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK003",
      "title": "Advances in the Sirius Delta-Type Undulator Project",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk003.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK004",
      "title": "Using Decoherence to Prevent Damage to the Swap-Out Dump for the APS Upgrade",
      "authors": [
        "M. Borland",
        "J.C. Doolingpresenter",
        "R.R. Lindberg",
        "V. Sajaev",
        "A. Xiao",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The Advanced Photon Source (APS) is pursuing an upgrade of the storage ring to a hybrid seven-bend-achromat* design",
        "which will operate in swap-out mode. The ultra-low emittance (about 30 pm in both planes) combined with the desire to provide high charge (15 nC) in individual bunches",
        "entails very high energy density in the beam. Simple estimates",
        "confirmed by simulation",
        "indicate that interaction of such a bunch with the dump material will result in localized melting. Over time",
        "it is possible that the beam would drill through the dump and vent the ring vacuum. This would seem to prevent extraction and dumping of bunches as part of swap out",
        "and also suggests that transferring of bunches out of the ring carries significant risk. We devised an idea for using a pre-kicker to cause decoherence of the target bunch emittances",
        "making it safe to extract. Simulations show that the concept works very well.",
        "*L. Farvacque et al."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk004.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK005",
      "title": "CSR Shielding Effect in Dogleg and EEX Beamlines",
      "authors": [
        "G. Ha",
        "M.E. Condepresenter",
        "J.G. Power",
        "E.E. Wisniewski",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "CSR shielding is a well-known CSR suppression scheme which works by cutting off the low frequency CSR radiation. Although the shielding scheme is well known",
        "its effects on the beam has been rarely studied. We investigate the CSR effect on the beam emittance when passing through a dogleg and a double dogleg type EEX beamline. An experimental study is planned at the Argonne Wakefield Accelerator facility where we can generate a 0.1-100 nC electron beam with an energy of 50 MeV and have a double dogleg EEX beamline. Tunable shielding plates are installed at the dipole magnet chambers of the EEX beamline to vary the shielding condition. Transverse and longitudinal phase space measurement systems are prepared to characterize the beam-CSR interaction",
        "and bolometer and interferometry are prepared to characterize CSR. We present simulation results and preliminary experimental results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk005.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK006",
      "title": "Sub-fs Electron Bunch Generation Using Emittance Exchange Compressor",
      "authors": [
        "J.M. Seok",
        "M. Chung",
        "UNIST",
        "Ulsan",
        "Republic of Korea",
        "M.E. Condepresenter",
        "J.G. Power",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "PAL",
        "Pohang",
        "Republic of Korea",
        "Sub-fs electron bunch has been pursued in the last decade using several different methods. These methods rely on one of the velocity difference or path length difference to compress a long bunch to sub-fs bunch. Here",
        "we introduce a new method to generate the compression. Emittance Exchange (EEX) beamline makes transverse-to-longitudinal exchange of phase space. In this beamline",
        "a transverse focusing at the upstream introduces a longitudinal compression at the downstream due to the exchange. Since this exchange scheme does not rely on the velocity or the path length differences",
        "it does not require any longitudinal manipulation (e.g. chirp)",
        "and it could generate a short bunch with well-controlled nonlinear effects using nonlinear magnets. We present preliminary simulation results of EEX based bunch compression and sub-fs bunch generation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk006.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK008",
      "title": "Highly-stable, High-power Picosecond Laser Optically Synchronized to a UV Photocathode Laser for an ICS Hard X-ray Generation",
      "authors": [
        "MIT",
        "Cambridge",
        "Massachusetts",
        "USA",
        "D. Gadonas",
        "L.M. Hand",
        "K. Neimontas",
        "A. Senin",
        "V. Sinkevicius",
        "Light Conversion",
        "Vilnius",
        "Lithuania",
        "W.S. Graves",
        "M.R. Holl",
        "L.E. Malin",
        "C. Zhangpresenter",
        "Arizona State University",
        "Tempe",
        "USA",
        "S. Klingebiel",
        "T. Metzger",
        "K. Michel",
        "TRUMPF Scientific Lasers GmbH + Co. KG",
        "Munchen-Unterfoehring",
        "Germany",
        "Under the CXLS project at Arizona State University we are developing an inverse Compton scattering (ICS) hard X-ray source* towards a compact XFEL with electron nano-bunching. The ICS interaction is critically dependent on the quality of driver pulses such as: 1) available peak intensity",
        "2) energy/pointing stability",
        "and 3) relative timing stability to UV pulses initially triggering electron beams. Here",
        "we report on a highly stable",
        "1 kHz",
        "200 mJ",
        "1.1 ps",
        "1030 nm laser with good beam quality as an ICS driver",
        "optically synchronized to a UV photocathode laser. The ICS driver is based on a Yb:YAG thin-disk regenerative amplifier (RGA)",
        "ensuring an excellent energy stability (shot-to-shot 0.52% rms; 0.14% rms over 24 hours). The pointing stability better than 4 urad is obtained. The M2 factor is as good as ~1.5 at the full energy",
        "leading to the achievable laser intensity of >1017 W/cm2 with f/10 focusing. The photocathode laser",
        "a frequency-quadrupled Yb:KGW RGA",
        "share a common seed oscillator with the ICS driver for optical synchronization. The residual sub-ps timing drift is further reduced to 33 fs rms using an optical locking scheme based on a parametric amplifier.",
        "* W.S. Graves et al.",
        "\"Compact X-ray source based on burst mode inverse compton scattering at 100 kHz",
        "\" Phys. Rev. ST Accel. Beams",
        "Vol. 17",
        "p. 120701 (Dec. 2014)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk008.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK009",
      "title": "Electron Beam Optics for the ASU Compact XFEL",
      "authors": [
        "C. Zhang",
        "W.S. Graves",
        "M.R. Holl",
        "L.E. Malin",
        "Arizona State University",
        "Tempe",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA"
      ],
      "institutions": [
        "Funding: National Science Foundation Division of Physics (Accelerator Science) award 1632780, award 1231306. DOE grant DE-AC02-76SF00515.",
        "Arizona State University (ASU) is pursuing a new concept for a compact x-ray FEL (CXFEL) as a next phase of compact x-ray light source (CXLS). We describe the electron beam optics design for the ASU compact XFEL. In previous experiments we introduced a grating diffraction method to generate a spatially modulated beam. We plan to combine a telescope imaging system with emittance exchange (EEX) to magnify/demagnify the modulated beam and transfer it from transverse modulation into a longitudinal one to make it an ideal seed for phase-coherent XFEL. The simulation results of the beam line setup will be demonstrated. Our first goal is to successfully image the modulated beam with desired magnification then we will investigate various magnification and magnets combinations and optimize aberration correction."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk009.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK010",
      "title": "Differences in Current Dependent Tune Shifts Measured by Direct or ORM Based Methods",
      "authors": [
        "Y.E. Tan",
        "R.T. Dowd",
        "AS - ANSTO",
        "Clayton",
        "Australia",
        "The change in the tunes as a function of total beam current is a well documented effect and has been attributed to quadrupole like self induced wakefields. Theoretical models presented by others have utilised direct methods (spectrum analyser) to measure the tunes in the analysis. In this report we shall present observations that show the ORM method",
        "Linear Optics from Closed Optics (LOCO)",
        "and direct methods have significantly different tune gradients. The different tune gradients is attributed to the static (ORM) and dynamic (direct) nature of the measurements where in the static case the vacuum chamber is to be considered as a thin wall while in the dynamic case the vacuum chamber wall is to be considered as a thick wall."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK011",
      "title": "Single Ring Permanent Magnet Lens",
      "authors": [
        "K. Jayamanna",
        "R.A. Baartman",
        "Y. Bylinskii",
        "T. Planche",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "UW/Physics",
        "Waterloo",
        "Ontario",
        "Canada",
        "UBC",
        "Vancouver",
        "B.C.",
        "Canada",
        "A permanent magnet lens has been designed to be a non-powered alternative to solenoids for low energy beam transport. The lens consists of a single ring of 12 sectors",
        "each sector with poles directed inward. This forms an axial field that reverses sign at the midpoint",
        "somewhat like two opposing short solenoids. It is similar to the Iwashita lens* but consists of only one ring",
        "not two. A prototype lens optimized to decrease the magnetic material required while also reducing aberration",
        "has been built and tested for a 25 keV H-minus beam. Emittance figures measured downstream of the lens are compared with theory.",
        "* Y. Iwashita",
        "\"Axial Magnetic Field Lens with Permanent Magnet\"",
        "Proc. PAC 1993",
        "p.3154."
      ],
      "institutions": [
        "Funding: TRIUMF receives its funding from the National Research Council of Canada."
      ],
      "abstract": "R.N. Simpsonpresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk011.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK012",
      "title": "Acceleration of Charged Particles by Own Field in a Non-Stationary One-Dimensional Stream",
      "authors": [
        "Allrussian Electrotechnical Institute",
        "Moskow",
        "Russia",
        "* Mestschersky J. Astronomische Nachrichten",
        "1893",
        "T.132",
        "N3153",
        "p. 9.  ** Nestschersky ibid",
        "1902",
        "T.159",
        "N3807",
        "p. 15. *** Chikhachev A.S.",
        "Technical Phisics",
        "2014",
        "vol 59",
        "N 4",
        "pp 487-493."
      ],
      "institutions": [],
      "abstract": "The behavior of a non-stationary stream of the charged particles interacting with own field is studied. For the description the integral of the movement received in works * ** - Meshchersky's integral is used. The additional integral of the movement - interfaced to Meshchersky's integral, necessary for completely self-agreed description of a stream of the particles interacting with own field is constructed. The system of the equations reducing a problem to the solution of system of the ordinary differential equations is removed. Private decisions for potential, density of particles and density of current are provided. Earlier the problem was studied in work ***. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk012.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK014",
      "title": "Dipole Fringe Field Analysis of the NSLS-II Storage Ring",
      "authors": [
        "J. Choi",
        "Y. Hidaka",
        "T.V. Shaftan",
        "C.J. Spataro",
        "G.M. Wang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "In the NSLS-II storage ring",
        "the effect of the dipole fringe field is not negligible and was considered already at the design phase. Especially in the vertical direction",
        "the standard simulation codes are using the parameter called FINT (fringe Field INTegral) and",
        "if there is no specific information",
        "it is usually set to 0.5 which is considered as the reasonable average. With the hall-probe measurement data of the NSLS-II storage ring dipoles",
        "we evaluated measured FINTs and applied them to the beam simulation. The paper shows the resulting FINTs and their effects."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk014.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK015",
      "title": "Initial Studies into Longitudinal Ionization Cooling for the Muon g-2 Experiment",
      "authors": [
        "Edinburgh University",
        "Edinburgh",
        "United Kingdom",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "D. Stratakis",
        "M.J. Syphers",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "Fermilab's Muon g-2 experiment aims to measure the anomalous magnetic moment of the muon to an unprecedented precision of 140 ppb. It relies on large numbers of muons surviving many turns in the storage ring without colliding with the sides",
        "at least long enough for the muons to decay. Longitudinal ionization cooling is introduced with respect to Fermilab's Muon g-2 experiment in an attempt to increase storage and through this the statistics and quality of results. The ionization cooling is introduced to the beam through a material wedge",
        "an initial simulation study is made into the positioning",
        "material",
        "and geometrical parameters of this wedge using G4Beamline. Results suggest a significant increase of 20 - 30% in the number of stored muons when the optimal wedge is included in the simulation."
      ],
      "institutions": [],
      "abstract": "J.D. Crnkovicpresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk015.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK016",
      "title": "Using Time Evolution of the Bunch Structure to Extract the Muon Momentum Distribution in the Fermilab Muon g-2 Experiment",
      "authors": [
        "W. Wu",
        "B. Quinn",
        "UMiss",
        "University",
        "Mississippi",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "J.D. Crnkovicpresenter Beam dynamics plays an important role in achieving the unprecedented precision on measurement of the muon anomalous magnetic moment in the Fermilab Muon g-2 Experiment. It needs to find the muon momentum distribution in the storage ring in order to evaluate the electric field correction to muon anomalous precession frequency. We will show how to use time evolution of the beam bunch structure to extract the muon momentum distribution by applying a fast rotation analysis on the decay electron signals. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk016.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMK018",
      "title": "Round Beam Studies at NSLS-II",
      "authors": [
        "Y. Hidaka",
        "W.X. Cheng",
        "Y. Li",
        "T.V. Shaftan",
        "G.M. Wang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Instead of typical flat beam",
        "some synchrotron light us-ers prefer round beam",
        "i.e.",
        "with equal horizontal and vertical emittance",
        "for various reasons (e.g.",
        "simplified optics",
        "smaller fraction of photons getting discarded",
        "better phase space match between photon and e-beam). Several future upgrade storage rings such as APS-U",
        "ALS-U",
        "and SLS-2 currently plan to operate in round beam mode. We report our beam study results on round beam operating at NSLS-II by driving linear difference cou-pling resonance."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupmk018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupmk018.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupmk018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPMK018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 15,
  "scrape_time": "2025-10-10 19:27:50"
}