{
  "session_info": {
    "id": "SUPTEV",
    "name": "SUPTEV - Sunday Student Poster SRF Technologies",
    "url": "https://proceedings.jacow.org/srf2021/html/suptev.htm"
  },
  "papers": [
    {
      "paper_id": "SUPTEV001",
      "title": "Magnetic Field Penetration Technique to Study High Field Shielding of Multilayered Superconductors",
      "authors": [
        "I.H. Senevirathne",
        "J.R. Delayen",
        "A.V. Gurevich",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "J.R. Delayen",
        "A-M. Valente-Feliciano",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The SIS structure which consists of alternative thin layers of superconductors and insulators on a bulk niobium has been proposed to shield niobium cavity surface from high magnetic field and hence increase the accelerating gradient. The study of the behavior of multilayer super-conductors in an external magnetic field is essential to optimize their SRF performance. In this work we report the development of a simple and efficient technique to measure penetration of magnetic field into bulk",
        "thin film and multilayer superconductors. Experimental setup contains a small superconducting solenoid which can produce a parallel surface magnetic field up to 0.5 T and Hall probes to detect penetrated magnetic field across the superconducting sample. This system was calibrated and used to study the effect of niobium sample thickness on the field of full magnetic flux penetration. We determined the optimum thickness of the niobium substrate to fabricate the multilayer structure for the measurements in our setup. This technique was used to measure penetration fields of Nb3Sn thin films and Nb3Sn/Al2O3 multi-layers deposited on Al2O3 wafers."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev001.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV001",
      "page_number": "112",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPTEV002",
      "title": "Application of Plasma Electrolytic Polishing onto SRF Substrates",
      "authors": [
        "E. Chyhyrynets",
        "O. Azzolini",
        "R. Caforio",
        "V.A. Garcia Diaz",
        "G. Keppel",
        "C. Pira",
        "F. Stivanello",
        "M. Zanierato",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "A new promising approach of SRF substrates surface treatment has been studied - Plasma Electrolytic Polishing (PEP). The possible application of PEP can be used not only on conventional elliptical resonators",
        "but also on other components of SRF such as",
        "for example",
        "couplers or Quadrupole resonators (QPRs). However",
        "SRF application of PEP represents a challenge since it requires a different approach to treat the inner surface of elliptical cavities respect to electropolishing. In this work",
        "the main problematics and possible solutions",
        "the equipment",
        "and the polishing system requirements will be shown. A proposed polishing system for 6 GHz elliptical cavities and QPRs will be shown and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev002.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV002",
      "page_number": "116",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "SUPTEV003",
      "title": "Cu/Nb QPR Surface Preparation Protocol in the Framework of ARIES Project",
      "authors": [
        "E. Chyhyrynets",
        "O. Azzolini",
        "R. Caforio",
        "V.A. Garcia Diaz",
        "G. Keppel",
        "C. Pira",
        "F. Stivanello",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "The Quadrupole Resonator is a powerful tool for SRF R&D on thin films. It allows to perform Q vs E measurements on flat sample rather than a curved surface of a cavity. For the investigation of SC coatings on copper substrates",
        "e-beam welded Cu/Nb samples have been prepared for the QPR. However",
        "the presence of two metals",
        "in particular at the interface makes proper polishing of both surfaces challenging due the different chemical behaviour of both components. In this work we present the protocol developed for surface preparation of the coexisting Cu and Nb phases and the results obtained for 5 different samples. The work was performed in the framework of the ARIES project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev003.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV003",
      "page_number": "121",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "SUPTEV006",
      "title": "Commissioning of a Calibration Device for Second Sound Quench Detection",
      "authors": [
        "L. Ebeling",
        "D. Reschke",
        "L. Steder",
        "DESY",
        "Hamburg",
        "Germany",
        "University of Hamburg",
        "Institut für Experimentalphysik",
        "Hamburg",
        "Germany",
        "An important part of research and development in the field of superconducting radio frequency technology is the quench detection since these breakdowns of superconductivity often limit the cavity performance. Although the second sound based quench detection is widely used",
        "only few studies dealing with its systematic uncertainties exist. Hence",
        "the vertical test stands at the cavity test facility of DESY were extended by calibration device prototypes in order to estimate the accuracy of this method. For the first time at DESY",
        "artificial signals have been generated and reconstructed by heating power film resistors. These second sound signals are determined using noise canceling algorithms and the existing reconstruction software. To evaluate the reconstructed positions",
        "the absolute distance between reconstructed and true coordinates is calculated. Thus",
        "a first uncertainty map of the cavity surface is created to quantify the reconstruction results of actual cavity quenches including systematic effects of the quench positioning like the varying sensor coverage around the cavity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev006.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV006",
      "page_number": "124",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPTEV007",
      "title": "Development of a System for Coating SRF Cavities Using Remote Plasma CVD",
      "authors": [
        "G. Gaitan",
        "P. Bishop",
        "A.T. Holic",
        "G. Kulina",
        "M. Liepe",
        "J. Sears",
        "Z. Sun",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Next-generation",
        "thin-film surfaces employing Nb3Sn",
        "NbN",
        "NbTiN",
        "and other compound superconductors are destined to allow reaching superior RF performance levels in SRF cavities. Optimized",
        "advanced deposition processes are required to enable high-quality films of such materials on large and complex-shaped cavities. For this purpose",
        "Cornell University is developing a remote plasma-enhanced chemical vapor deposition (CVD) system that facilitates coating on complicated geometries with a high deposition rate. This system is based on a high-temperature tube furnace with a clean vacuum and furnace loading system. The use of plasma alongside reacting precursors will significantly reduce the required processing temperature and promote precursor decomposition. A vacuum quality monitor (VQM) is used to characterize the residual gases before coating. The CVD system has been designed and is currently under assembly and commissioning."
      ],
      "institutions": [
        "Funding: This work was supported by the National Science Foundation under Grant No. PHY-1549132."
      ],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev007.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV007",
      "page_number": "129",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPTEV008",
      "title": "CW Operation of Conduction-Cooled Nb₃Sn SRF Cavity",
      "authors": [
        "N.A. Stilin",
        "A.T. Holic",
        "M. Liepe",
        "R.D. Porter",
        "J. Sears",
        "Z. Sun",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Significant progress in the performance of SRF cavities coated with Nb3Sn films during the last few years has provided an energy efficient alternative to traditional Nb cavities",
        "thereby initiating a fundamental shift in SRF technology. These Nb3Sn cavities can operate at significantly higher temperatures than Nb cavities while simultaneously requiring less cooling power. This allows for the use of new cryogenic cooling schemes based on conduction cooling with robust",
        "commercialized turn-key style cryocoolers. Cornell University has developed and tested a 2.6 GHz Nb3Sn cavity assembly which utilizes such cooling methods. These tests have demonstrated stable RF operation at 10 MV/m with measured thermal dynamics which match numerical simulations. These results also serve as a foundation for designing a new standalone SRF cryomodule which will use a pair of cryocoolers to cool a 1.3 GHz Nb3Sn cavity with an input coupler capable of supporting high beam current operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev008.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV008",
      "page_number": "133",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPTEV009",
      "title": "Development of a New B-Mapping System for SRF Cavity Vertical Tests",
      "authors": [
        "J.C. Wolff",
        "A. Gössel",
        "C. Müller",
        "D. Reschke",
        "L. Steder",
        "D. Tischhauser",
        "DESY",
        "Hamburg",
        "Germany",
        "W. Hillert",
        "J.C. Wolff",
        "University of Hamburg",
        "Institut für Experimentalphysik",
        "Hamburg",
        "Germany",
        "Magnetic flux trapped in the Niobium bulk material of superconducting radio frequency (SRF) cavities degrades their quality factor and the accelerating gradient. The sensitivity of the cavity to trapped magnetic flux is mainly determined by the treatment",
        "the geometry and the Niobium grain size and orientation. To potentially improve the flux expulsion characteristics of SRF cavities and hence the efficiency of future accelerator facilities",
        "further studies of the trapping behavior are essential. For this purpose a so-called B-mapping system to monitor the magnetic flux along the outer cavity surface of 1.3 GHz TESLA-Type single-cell SRF cavities is currently under development at DESY. Contrary to former approaches",
        "this system digitizes the sensor signals already inside of the cryostat to extensively reduce the number of required cable feedthroughs. Furthermore",
        "the signal-to-noise ratio (SNR) and consequently the measuring sensitivity can be enhanced by shorter analog signal lines",
        "less thermal noise and the Mu-metal shielding of the cryostat. In this contribution the design",
        "the development process as well as first performance test results of the B-mapping system are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev009.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV009",
      "page_number": "137",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPTEV010",
      "title": "Electrical and Thermal Properties of Cold-Sprayed Bulk Copper and Copper-Tungsten Samples at Cryogenic Temperatures",
      "authors": [
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "G. Ciovati",
        "P. Dhakal",
        "J.K. Spradlin",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "C.-J. Jing",
        "A. Kanareykin",
        "Euclid TechLabs",
        "Solon",
        "Ohio",
        "USA",
        "The development of high thermal conductivity coatings with pure copper or copper-tungsten alloy could be beneficial to improve the heat transfer of bulk Nb cavities for conduction cooling applications and to increase the stiffness of bulk Nb cavities cooled by liquid helium. Cold-spray is an additive manufacturing technique suitable to grow thick coatings of either Cu or CuW on a Nb substrate. Bulk (~5 mm thick) coatings of Cu and CuW were deposited on standard 3 mm thick",
        "high-purity Nb samples and smaller samples with 2 mm x 2 mm cross section were cut for measuring the thermal conductivity and the residual resistivity ratio. The samples were subjected to annealing at different temperatures and a maximum RRR of ~130 and ~40 were measured for the Cu samples and CuW samples",
        "respectively."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev010.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV010",
      "page_number": "142",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPTEV011",
      "title": "Nb₃Sn Coating of Twin Axis Cavity for SRF Applications",
      "authors": [
        "J.K. Tiskumara",
        "J.R. Delayen",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "U. Pudasaini",
        "C.E. Reece",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The twin axis cavity with two identical accelerating beams has been proposed for energy recovery linac (ERL) applications. Nb3Sn is a superconducting material with a higher critical temperature and a higher critical field as compared to Nb",
        "which promises a lower operating cost due to higher quality factors. Two niobium twin axis cavities were fabricated at JLab and were proposed to be coated with Nb3Sn. Due to their more complex geometry",
        "the typical coating process used for basic elliptical cavi-ties needs to be improved to coat these cavities. This development advances the current coating system at JLab for coating complex cavities. Two twin axis cavities were coated recently for the first time. This contribution dis-cusses initial results from coating of twin axis cavities",
        "RF testing and witness sample analysis with an overview of the current challenges towards high performance Nb3Sn coated twin axis cavities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev011.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV011",
      "page_number": "146",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPTEV013",
      "title": "Validation of the 650 MHz SRF Cavity Tuner for PIP-II at 2 K",
      "authors": [
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "S.K. Chandrasekaran",
        "S. Cheban",
        "G.V. Eremeev",
        "F. Furuta",
        "T.N. Khabiboulline",
        "Y.M. Pischalnikov",
        "O.V. Prokofiev",
        "A.I. Sukhanov",
        "J.C. Yun",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "C. Contreras-Martinez The PIP-II linac will include thirty-six β=0.61 and twenty-four β=0.92 650 MHz 5 cell elliptical SRF cavities. Each cavity will be equipped with a tuning system consisting of a double lever slow tuner for coarse frequency tuning and a piezoelectric actuator for fine frequency tuning. One dressed cavity equipped with an SRF tuner has been tested in the horizontal test stand at Fermilab. Results of testing the cavity-tuner system will be presented.",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev013.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV013",
      "page_number": "151",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "SUPTEV014",
      "title": "SRF Cavity Tuners for 3.9 GHz Cryomodules for LCLS-II Project",
      "authors": [
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "T.T. Arkan",
        "T.N. Khabiboulline",
        "Y.M. Pischalnikov",
        "G.V. Romanov",
        "R.P. Stanek",
        "J.C. Yun",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Fermilab conducted testing of three 3.9 GHz cryomodules for the LCLS-II project that will operate in continuous wave mode. A fast/fine tuning component was added to the LCLS-II 3.9 GHz tuner design due to the cavity bandwidth of 130 Hz which consists of two encapsulated piezos. Several cavities faced problems with fast-tuner operations after cooldown to 2 K and tuning the cavities to 3.9 GHz in cryomodule 2. All the piezo actuators were in working conditions but the slow tuner ranges required to stretch some of the cavities to the operational 3.9 GHz frequency were too small to deliver the required preload on the piezos. This behavior can be attributed to several factors: setting the initial warm cavity frequency during production too high",
        "pressure tests of the warm cryomodule could have changed cavity frequency; and the small bending and twisting of the cavity-tuner system during the cooldown and warmup of the cavities. A decision was made to inelastically retune the warm cavities to decrease the unrestrained frequency by 200-300 kHz",
        "this was done via the slow tuner. The results for this retuning method of three 3.9GHz cryomodules will be discussed."
      ],
      "institutions": [],
      "abstract": "C. Contreras-Martinez",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev014.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV014",
      "page_number": "155",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "SUPTEV015",
      "title": "Mitigation of Dielectric Heating of Piezoelectric Actuators at Cryogenic Temperatures",
      "authors": [
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Y.M. Pischalnikov",
        "J.C. Yun",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The new generation of low beam intensity superconducting linacs will require high accelerating gradients for new scientific discoveries. The high accelerating gradient cavities in pulsed SRF linacs will experience large (~1000’s of Hz) detuning caused by Lorentz force detuning (LFD). The piezo actuators that will be used to compensate large LFD must operate at a nominal voltage of 120V to 150V to deliver the required stroke to the cavity. In this high voltage range",
        "the piezo is expected to warm up drastically due to its location in an insulating vacuum environment. Overheating of the piezo will significantly decrease the longevity of the actuator. A collaboration between FNAL and Physik Instrumente (PI) developed a novel piezo actuator design that mitigates piezo overheating. The design consists of using a metal foam in contact with the piezoelectric ceramic stack for heat removal. The second solution used lithium niobite as an alternative material. A comparison of the temperature stability will be presented and discussed. This study characterizes the dielectric properties for both materials. The results obtained are in the temperature range of 10 K to 300 K."
      ],
      "institutions": [],
      "abstract": "C. Contreras-Martinez",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev015.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV015",
      "page_number": "159",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "SUPTEV016",
      "title": "Samples for 3rd Harmonic Magnetometry Assessment of NbTiN-Based SIS Structures",
      "authors": [
        "D.R. Beverstock",
        "J.R. Delayen",
        "I.H. Senevirathne",
        "J.K. Spradlin",
        "A-M. Valente-Feliciano",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "J.R. Delayen",
        "I.H. Senevirathne",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "The College of William and Mary",
        "Williamsburg",
        "Virginia",
        "USA",
        "In the quest for alternative superconducting materials to bring accelerator cavity performance beyond the bulk niobium (Nb) intrinsic limits",
        "a promising concept uses superconductor-insulator-superconductor (SIS) thin film structures that allows magnetic flux shielding in accelerator cavities to higher fields [1]. Candidate materials for such structures are NbTiN as the superconductor and AlN as the insulator. We have demonstrated high quality NbTiN and AlN deposited by reactive DC magnetron sputtering (DCMS)",
        "both for individual layers and multilayers. Interface quality has been assessed for bilayer stacks with 250 nm NbTiN layers and AlN thicknesses from 30 nm down to1 nm. These SIS structures show continued sharp interfaces with total average roughness under 2 nm. The Hfp enhancement of the films will be examined with a 3rd harmonic magnetometry. The system is being designed and built in a continuing collaboration with CEA Saclay. It can measure 25 to 50 mm samples on a temperature controlled stage. This contribution presents an overview of the design of the 3rd harmonic magnetometer and the material properties assessment of standalone films and multilayer nanostructures.",
        "[1] A. Gurevich",
        "Applied Physics Letters",
        "vol. 88",
        "p. 012511",
        "2006."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/suptev016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/suptev016.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/suptev016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-SUPTEV016",
      "page_number": "164",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 13,
  "scrape_time": "2025-10-11 02:59:55"
}