{
  "session_info": {
    "id": "FRIOB",
    "name": "FRIOB - New cavity Design: Accelerating structures I",
    "url": "https://proceedings.jacow.org/SRF2013/html/friob.htm"
  },
  "papers": [
    {
      "paper_id": "FRIOB01",
      "title": "SRF Cavities for Future Ion Linacs",
      "authors": [
        "Z.A. Conway",
        "G.L. Cherry",
        "S.M. Gerbick",
        "M. Kedzie",
        "M.P. Kelly",
        "S.H. Kim",
        "S.V. Kutsaev",
        "R.C. Murphy",
        "B. Mustapha",
        "P.N. Ostroumov",
        "T. Reid",
        "ANL",
        "Argonne",
        "USA",
        "There is considerable interest worldwide in the applications of high-intensity (>5 mA) high-energy (>200 MeV) ion accelerators and the research which could be done with these machines. This presentation will present results of the three year ANL study funded specifically to make possible substantial reductions in the size and cost for future ion linacs in the region beta < 0.5. Applications include basic research",
        "medical isotope production",
        "and accelerator driven systems. High-performance low-beta resonators are key components of all of these machines. Recent 72.75 MHz",
        "β = 0.077",
        "quarter-wave resonator cold test results",
        "designs and their impact on next generation ion accelerators are discussed. Peak fields in excess of 166 mT and 117 MV/m have been achieved and future work to improve upon this will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/friob01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/friob01.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/friob01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-FRIOB01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRIOB02",
      "title": "Development and Performance of 325 MHz Single Spoke Resonators for Project X",
      "authors": [
        "L. Ristori",
        "M.H. Awida",
        "P. Berrutti",
        "C.M. Ginsburg",
        "I.V. Gonin",
        "T.N. Khabiboulline",
        "M. Merio",
        "T.H. Nicol",
        "D. Passarelli",
        "A.M. Rowe",
        "D.A. Sergatskov",
        "A.I. Sukhanov",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "USA",
        "Two types of single spoke resonators will be utilized for beam-acceleration in the low energy part of the Project X linac. SSR1 and SSR2 operate at 325 MHz and at an optimal beta of 0.22 and 0.51 respectively. After the initial phase of prototyping",
        "a production run of 10 SSR1 resonators was recently completed in US industry. The qualification of this group of resonators in the Fermilab VTS is proceeding successfully and nearly complete. The first qualified resonator has been outfitted with a Stainless Steel helium vessel. Preliminary test results for the first jacketed SSR1 are presented. The first RF power couplers were ordered",
        "the design of the double-lever tuning mechanism is almost complete."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/friob02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/friob02.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/friob02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-FRIOB02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRIOB03",
      "title": "Development of 650 MHz Cavities for the GeV Proton Accelerator in Project X",
      "authors": [
        "S.S. Som",
        "P. Bhattacharyya",
        "A. Dutta Gupta",
        "S. Ghosh",
        "A. Mandal",
        "S. Seth",
        "VECC",
        "Kolkata",
        "India",
        "Project X is a GeV range high intensity proton linear accelerator being developed at Fermilab",
        "USA in collaboration with various American and Indian laboratories as well. In stage-1 of the project",
        "the CW linac structures with different velocity factor (beta) accelerate proton up to 3 GeV at an average beam current of 1 mA. For acceleration from 180 to 480 MeV",
        "the development of 650 MHz",
        "beta 0.61",
        "5-cell elliptical SRF cavities has been taken up by VECC. The EM design and analysis of this cavity",
        "carried out using 2D and 3D codes",
        "will be discussed along with its structural and mechanical modal analysis. This design has been compared with the designs made by JLab and Fermilab. The presence of higher order modes (HOMs)for the said cavity has been thoroughly examined. The multipacting analysis will be presented using 2D code and also 3D CST Particle Studio code with due consideration of Furman model for secondary electron emission comprising of true",
        "elastic and rediffused secondary electrons. The prototype development and low power testing of this cavity will be discussed here. The talk will be concluded with the probable SRF challenges to be faced in the development of the cavity."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/friob03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/friob03.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/friob03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-FRIOB03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRIOB04",
      "title": "CERN Developments for 704 MHz Superconducting Cavities",
      "authors": [
        "O. Capatina",
        "G. Arnau-Izquierdo",
        "S. Atieh",
        "I. Aviles Santillana",
        "R. Bonomi",
        "S. Calatroni",
        "J.K. Chambrillon",
        "R. Garoby",
        "F. Gerigk",
        "M. Guinchard",
        "T. Junginger",
        "M. Malabaila",
        "L. Marques Antunes Ferreira",
        "S. Mikulas",
        "V. Parma",
        "T. Renaglia",
        "K.M. Schirm",
        "T. Tardy",
        "M. Therasse",
        "A. Vacca",
        "N. Valverde Alonso",
        "A. Vande Craen",
        "CERN",
        "Geneva",
        "Switzerland",
        "Kraftanlagen Nukleartechnik GmbH",
        "Heidelberg",
        "Germany",
        "The Superconducting Proton Linac (SPL) is an R&D effort coordinated by CERN in partnership with other international laboratories. It is aiming at developing key technologies for the construction of a multi-megawatt proton linac based on state-of-the-art RF superconducting technology",
        "which would serve as a driver in new physics facilities for neutrinos and/or Radioactive Ion Beam (RIB). Amongst the main objectives of this R&D effort",
        "is the development of 704 MHz bulk niobium β=1 elliptical cavities",
        "operating at 2 K with a maximum accelerating gradient of 25 MV/m",
        "and the testing of a string of cavities integrated in a machine-type cryomodule. The cavity together with its helium tank had to be carefully designed in coherence with the innovative design of the cryomodule. New fabrication methods have also been explored. Five such niobium cavities and two copper cavities are in fabrication. The key design aspects are discussed",
        "the results of the alternative fabrication methods presented and the status of the cavity manufacturing and surface preparation is detailed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/friob04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/friob04.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/friob04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-FRIOB04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-11 04:20:09"
}