{
  "session_info": {
    "id": "WEICNO",
    "name": "WEICNO - FEL Theory",
    "url": "https://proceedings.jacow.org/FEL2013/html/weicno.htm"
  },
  "papers": [
    {
      "paper_id": "WEICNO01",
      "title": "Harmonic Lasing in X-Ray FELs",
      "authors": [
        "E. Schneidmiller",
        "M.V. Yurkov",
        "DESY",
        "Hamburg",
        "Germany",
        "Contrary to nonlinear harmonic generation",
        "harmonic lasing in a high-gain FEL can provide much more intense",
        "stable",
        "and narrow-band FEL beam which is easier to handle if the fundamental is suppressed. We perform a parametrization of the solution of eigenvalue equation for lasing at odd harmonics",
        "and present explicit expression for FEL gain length",
        "taking into account all essential effects. We propose and discuss methods for suppression of the fundamental. We also suggest a combined use of harmonic lasing and lasing at the retuned fundamental wavelength in order to reduce bandwidth and to increase brilliance of X-ray beam. We discover that in a part of the parameter space",
        "corresponding to the operating range of soft X-ray beamlines of X-ray FEL facilities",
        "harmonics can grow faster than the fundamental. We suggest that harmonic lasing can be widely used in the existing or planned X-ray FEL facilities. LCLS after a minor modification can lase at the 3rd harmonic up to the photon energy of 25-30 keV providing multi-gigawatt power level. At the European XFEL the harmonic lasing would allow to extend operating range up to 100 keV",
        "to reduce bandwidth and increase brilliance",
        "etc.",
        "Phys. Rev. ST-AB 15",
        "080702 (2012)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/weicno01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/weicno01.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/weicno01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-WEICNO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:32:09"
}