{
  "conference_info": {
    "name": "2012",
    "code": "ECRIS2012",
    "url": "https://proceedings.jacow.org/ECRIS2012/",
    "status": "pending"
  },
  "sessions": [
    {
      "session_info": {
        "id": "TUXO",
        "name": "TUXO - Plasma Physics & Applications",
        "url": "https://proceedings.jacow.org/ECRIS2012/html/tuxo.htm"
      },
      "papers": [
        {
          "paper_id": "TUXO01",
          "title": "Coupling Microwave Power into ECR Ion Source Plasmas at Frequencies above 20 GHz",
          "authors": [
            "C.M. Lyneis",
            "J.Y. Benitez",
            "M.M. Strohmeier",
            "D.S. Todd",
            "LBNL",
            "Berkeley",
            "California",
            "USA"
          ],
          "institutions": [],
          "abstract": "Electron Cyclotron Resonance (ECR) ion sources have been built to operate at frequencies from 5 GHz to 28 GHz and typically use a plasma chamber that serves as a multi-mode cavity. For small sources operating at 6 to 14 GHz cavity mode-like behavior has been reported. In these cavities the vacuum mode density is low enough that it may be that the RF power distribution can be understood in terms of excitation of a few modes. The large superconducting ECR ion sources, such as VENUS, operating at higher frequencies have a much greater mode density and very strong damping from plasma microwave adsorption. In this type of source, how the RF is launched into the plasma chamber will strongly affect the microwave coupling and the chamber walls will be less important. The VENUS source uses round over-moded TE01 mode waveguide to couple to the plasma, while most modern fusion devices use quasi-gaussian HE11 waves for injection into plasmas. In this paper we will describe the potential advantages of applying this technology to superconducting ECR ion sources as well as designs for doing so with VENUS.",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuxo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuxo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuxo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUXO01",
          "page_number": "1",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUXO02",
          "title": "An Experimental Study of ECRIS Plasma Stability and Oscillation of Beam Current",
          "authors": [
            "O.A. Tarvainen",
            "T. Kalvas",
            "H. A. Koivisto",
            "J.P.O. Komppula",
            "V. Toivanen",
            "JYFL",
            "Jyväskylä",
            "Finland",
            "C.M. Lyneis",
            "M.M. Strohmeier",
            "LBNL",
            "Berkeley",
            "California",
            "USA",
            "The stability of oxygen ion beams extracted from ECR ion sources has been studied with the superconducting ion source VENUS at LBNL and with the A-ECR type 14 GHz ECRIS at JYFL. Discrete Fourier transform has been used for characterizing beam current oscillations in kHz range exhibited by both ion sources. The effect of source parameters on the frequency and amplitude of the oscillations is discussed. It was found that double frequency heating affects the oscillation frequency",
            "biased disc can be used to mitigate the amplitude of beam current fluctuations",
            "increasing B-minimum results to pronounced instabilities and operating the ion source with significantly higher mirror ratio than suggested by ECRIS scaling laws yields the most stable ion beams. It is argued that the observed beam current fluctuations are correlated with plasma instabilities. A 'roadmap' for identifying the plasma instability mechanisms responsible for beam current fluctuations is presented."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuxo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuxo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuxo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUXO02",
          "page_number": "5",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUXO03",
          "title": "Two-frequency Heating Technique for Stable ECR Plasma",
          "authors": [
            "A. Kitagawa",
            "M. Muramatsu",
            "NIRS",
            "Chiba-shi",
            "Japan",
            "S. Biri",
            "R. Rácz",
            "ATOMKI",
            "Debrecen",
            "Hungary",
            "National Institute of Radiological Sciences",
            "Chiba",
            "Japan",
            "Osaka University",
            "Graduate School of Engineering",
            "Osaka",
            "Japan",
            "N. Sasaki",
            "W. Takasugi",
            "AEC",
            "Chiba",
            "Japan",
            "As a method to improve highly charged ion production",
            "a technique to feed multiple microwaves with different frequencies is well-known. However the reason is not made sufficiently clear. Our group studied with two frequencies close together with a power of 600 W over by 18 GHz NIRS-HEC ECR ion source installed in the Heavy Ion Medical Accelerator in Chiba (HIMAC) at the National Institute of Radiological Sciences (NIRS). As a result",
            "it was revealed that the improvement of output beam current depends on the total power. In this case it seems that the two-frequency heating technique carries the advantage that the plasma instability at high microwave power is relieved. The effectiveness of an additional microwave depends on its frequency. It is necessary to optimize an additional frequency precisely; several tens MHz step against 18 GHz. The optimized frequency is directly influenced by the magnetic configuration. The necessary requirements for an additional microwave and the procedure of optimization in order to obtain a large advantage will be discussed."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuxo03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuxo03.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuxo03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUXO03",
          "page_number": "10",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 3,
      "scrape_time": "2025-10-10 17:28:59"
    },
    {
      "session_info": {
        "id": "TUYO",
        "name": "TUYO - Plasma Physics & Techniques",
        "url": "https://proceedings.jacow.org/ECRIS2012/html/tuyo.htm"
      },
      "papers": [
        {
          "paper_id": "TUYO01",
          "title": "Experimental Study of Temperature and Density Evolution During Breakdown in a 2.45 GHz ECR Plasma",
          "authors": [
            "O.D. Cortázar",
            "A. Megía-Macías",
            "A. Vizcaíno-de-Julián",
            "ESS Bilbao",
            "LEIOA",
            "Spain",
            "An experimental study of temperature and density evolution during breakdown in off-resonance ECR hydrogen plasma by time resolved Langmuir probe diagnostic is presented. Under square 2.45 GHz microwave excitation pulses with a frequency of 50 Hz and relative high microwave power",
            "unexpected transient temperature peaks that reach 18 eV during 20 μs are reported at very beginning of plasma breakdown. Decays of such peaks reach final stable temperatures of 5 eV at flat top microwave excitation pulse. Evidence of interplay between incoming power and duty cycle giving different kind of plasma parameters evolutions engaged to microwave coupling times is observed. Under relative high power conditions where short microwave coupling times are recorded",
            "high temperature peaks are measured. However",
            "for lower incoming powers and longer coupling times",
            "temperature evolves gradually to a higher final temperature without peaking. On the other hand",
            "the early instant where temperature peaks are observed also suggest a possible connection with preglow and superadiabatic processes during breakdown in ECR plasmas."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuyo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuyo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuyo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUYO01",
          "page_number": "13",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUYO02",
          "title": "Control of the Plasma Transversal Losses, Caused by MHD Instabilities, in Open Mirror Magnetic Trap of the ECRIS: Recent Experiments on SMIS 37 Setup",
          "authors": [
            "V. Sidorov",
            "I. Izotov",
            "S. Razin",
            "V. Skalyga",
            "V. Zorin",
            "IAP/RAS",
            "Nizhny Novgorod",
            "Russia",
            "This work is a continuation of the experiments described in [1",
            "2] and aimed at the investigation of the new conceptions of MHD stabilization of plasma in open axisymmetric traps",
            "specifically",
            "it is aimed at the investigation of the shear flow influence on the transport control in open mirror traps. As in previous experiments",
            "shear flow was created by limiter-electrode with bias potential according to the vacuum chamber. Plasma density structure in radial and azimuthal directions was studied. Mode structure of the perturbations was investigated. Substantial sharp shift of the plasma density maximum to the system axis with bias potential growth was demonstrated. It was shown",
            "that the value of the bias potential that corresponds to the plasma density profile shift grows with the magnetic field growth that can be interpreted as the electron temperature growth. Some theoretical estimations of the influence of the transversal losses decrease on plasma parameters were made.",
            "[1] A.Sidorov",
            "P.Bagryansky",
            "A.Beklemishev et al. Trans. Fusion Sci. and Technology",
            "59",
            "112",
            "(2011).  [2] I.Izotov",
            "S.Razin",
            "A.Sidorov et al. Rev. Sci. Instrum.",
            "83",
            "02A318 (2012)."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuyo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuyo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuyo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUYO02",
          "page_number": "18",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUYO03",
          "title": "Secondary-electron-enhanced Plasma as an Alternative to Double/Variable-frequency Heating in ECRIS",
          "authors": [
            "IKF",
            "Frankfurt-am-Main",
            "Germany",
            "S. Dobrescu",
            "L. Schächter",
            "IFIN",
            "Magurele- Bucuresti",
            "Romania",
            "As \"double frequency heating\" (DFH) now has become the method of choice to optimize the output from the newest generation ECRIS",
            "it was a challenge to compare this method with the comparatively cheap method of \"metal dielectric\" (MD) structures introduced into the plasma chamber",
            "which has also proven to strongly enrich the plasma with electrons that are effectively trapped and heated. Two RF-systems have been launched to the 14 GHz ECRIS",
            "however",
            "not allowing RF-differences as large as 1.5 GHz as demanded for DFH. Therefore the source was operated in a \"frequency tuning\" mode (FT) by optimizing the frequency difference by the output of Ar14+ ions. The data without and with MD-configuration are compared and related to data for the DFH. On the basis of Bremsstrahlung radiation spectroscopy and charge state analysis",
            "it turned out that the FT-mode does not change the source performance substantially. The measured effects are in the order of 20% to 30% as reported elsewhere. In contrast to this",
            "the enhancement gained by the MD method is much higher. The measured enhancement ratios even surpass those reported for real double frequency heating."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuyo03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuyo03.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuyo03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUYO03",
          "page_number": "22",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUYO04",
          "title": "Neutral Gas Temperature Measurements of a Radio Frequency Micro-thruster",
          "authors": [
            "A.D. Greig",
            "R.W. Boswell",
            "C. Charles",
            "R.P. Hawkins",
            "SP3",
            "Canberra",
            "Australia",
            "M.D. Bowden",
            "Y.C. Sutton",
            "The Open University",
            "Milton Keynes",
            "United Kingdom",
            "A radio frequency (13.56 MHz) capacitively coupled cylindrical argon plasma discharge was analysed using optical emission spectroscopy (OES) for various powers and pressures in the ranges 10 W to 40 W and 0.5 Torr to 5 Torr. Trace amounts of nitrogen were added to the discharge to estimate the temperature of the neutrals using rovibrational band matching of the 2nd positive system of nitrogen and the 1st negative system of nitrogen ions. Comparing simulated computer generated spectra of these bands to experimentally measured spectra determined the rotational and vibrational temperatures of the nitrogen",
            "from which the temperature of the neutrals was inferred by assuming the rotational temperature was the same as the neutral gas temperature."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuyo04_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuyo04.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuyo04_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUYO04",
          "page_number": "25",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 4,
      "scrape_time": "2025-10-10 17:29:03"
    },
    {
      "session_info": {
        "id": "TUZO",
        "name": "TUZO - Ion Beam Extraction & Optics",
        "url": "https://proceedings.jacow.org/ECRIS2012/html/tuzo.htm"
      },
      "papers": [
        {
          "paper_id": "TUZO01",
          "title": "Beam Extraction Results with KAERI 14.5 GHz ECR Ion Source",
          "authors": [
            "B.H. Oh",
            "D.S. Chang",
            "C.K. Hwang",
            "S.R. In",
            "S.H. Jeong",
            "J.-T. Jin",
            "T.S. Kim",
            "C.H. Lee",
            "K.W. Lee",
            "KAERI",
            "Daejon",
            "Republic of Korea",
            "E.-S. Kim",
            "C.S. Seo",
            "IBS",
            "Daejeon",
            "Republic of Korea",
            "A 14.5 GHz electron cyclotron resonance ion source has been designed and fabricated at KAERI (Korea Atomic Energy Research Institute) to produce multi-charged ion beams (particularly C6+ ion beams) for medical applications. During the first beam extraction experiments with the developed ion source",
            "it was found that C4+ beam of 15 eμA and Ar15+ beam of 1 eμA were the optimized beam current. A big current loss was made along the beam transport path from the ion source to the entrance port of an analyzing magnet because of long beam line and small acceptance of the magnet. A new Einzel lens is added in the beam line to minimize the beam loss",
            "and the second beam extraction experiments have been made. In this paper the beam experimental results with the KAERI ion source",
            "including the hard X-ray spectrum from the ECR plasma and the emittance measurement results of carbon beam",
            "will be discussed."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuzo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuzo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuzo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUZO01",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "TUZO02",
          "title": "Detailed Investigation of the 4D Phase-Space of an Ion Beam",
          "authors": [
            "H.R. Kremers",
            "J.P.M. Beijers",
            "S. Brandenburg",
            "V. Mironov",
            "S. Saminathan",
            "KVI",
            "Groningen",
            "The Netherlands",
            "A second order transfer matrix is calculated",
            "which is used in the calculation of a 4D phase-space distribution of a 24.6 keV He1+ beam. The calculated distribution matches a 4D phase-space distribution measured with the KVI pepper pot emittance meter. The pepper pot emittance meter is installed in the image plane of a dipole magnet acting as a charge-state analyser directly downstream the KVI AECR ion source. From the second order transfer matrix simple analytical equations are derived by retaining the terms for angular coefficients. These simple equations describe the main features of the phase-space correlations in the image plane. The equations show also that the subset of the 4D phase-space distribution",
            "selected by one pepper pot aperture",
            "results in multiple beam-lets. Due to this successful matrix modelling we conclude that the 4D phase-space distribution measured is fully determined by the ionoptical properties of the magnet."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuzo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuzo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuzo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUZO02",
          "page_number": "30",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUZO03",
          "title": "New Extraction Design for the JYFL 14 GHz ECRIS",
          "authors": [
            "V. Toivanen",
            "T. Kalvas",
            "H. A. Koivisto",
            "J.P.O. Komppula",
            "O.A. Tarvainen",
            "JYFL",
            "Jyväskylä",
            "Finland",
            "A new extraction system has been designed and constructed for the JYFL 14 GHz ECRIS at the Department of Physics",
            "University of Jyväskylä (JYFL). The goal of the new design is to improve the performance of the ion source and increase the transmission efficiency of the low energy beam transport and the accelerator. The new extraction system is designed to be able to handle higher beam currents",
            "yield better beam quality and offer more tuning flexibility. The design was made with the aid of simulations performed with the IBSimu code. The suitability of the code for this task was verified by simulating the old extraction system and good agreement between simulations and measurements was achieved. The new extraction system has been constructed",
            "installed and tested. The new design",
            "simulations and the first measurement results will be presented."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuzo03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuzo03.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuzo03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUZO03",
          "page_number": "34",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUZO04",
          "title": "Space Charge Compensation Measurements of Multicharged Ion Beams Extracted from an ECR Ion Source",
          "authors": [
            "LBNL",
            "Berkeley",
            "California",
            "USA",
            "D.G. Cole",
            "D. Leitner",
            "G. Machicoane",
            "F. Marti",
            "L. Tobos",
            "NSCL",
            "East Lansing",
            "Michigan",
            "USA",
            "Space charge compensation* due to the interaction of the beam with residual gas molecules is a well-known phenomenon for high current injector beam lines. For beam lines using mostly magnetic focusing elements and for pressure above 10-6 mbar",
            "full neutralization has been observed. However",
            "due to the low pressure required for the efficient transport of high charge state ions",
            "beams in ECR injector lines are typically only partly neutralized. With the performance increase of the next generation ECR ion sources it is possible to extract tens of mA of beam current. In this high current regime",
            "non-linear focusing effects due to the space-charge potential of the beam become more and more important. In order to develop a realistic simulation model for low energy beam transport lines",
            "it is important to estimate the degree of space charge compensation. In this contribution we report on measurements of the beam potential (and neutralization)",
            "performed after the extraction region of the ECR ion source",
            "in dependence of the base pressure in the beam line and other source parameters using a Retarding Field Analyzer (RFA). Results are discussed and compared to simulations.",
            "* When the beam interacts with the residual gas",
            "electrons are separated from gas molecules and accumulate inside the beam envelope",
            "thereby compensating the space-charge (aka neutralization)"
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuzo04_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuzo04.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuzo04_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUZO04",
          "page_number": "38",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 4,
      "scrape_time": "2025-10-10 17:29:07"
    },
    {
      "session_info": {
        "id": "TUPP",
        "name": "TUPP - Tuesday Poster Session",
        "url": "https://proceedings.jacow.org/ECRIS2012/html/tupp.htm"
      },
      "papers": [
        {
          "paper_id": "TUPP01",
          "title": "Quantitative Determination of 146Sm/147Sm Ratios by Accelerator Mass Spectrometry with an ECR Ion Source and Linear Acceleration for 146Sm Half-Life Measurement",
          "authors": [
            "UTTAC",
            "Tsukuba",
            "Ibaraki",
            "Japan",
            "P. Collon",
            "Y. Kashiv",
            "D. Robertson",
            "C.J. Schmitt",
            "X.D. Tang",
            "University of Notre Dame",
            "Indiana",
            "USA",
            "MSU",
            "East Lansing",
            "Michigan",
            "USA",
            "C. Deibel",
            "B. DiGiovine",
            "J.P. Greene",
            "D. Henderson",
            "C.L. Jiang",
            "S.T. Marley",
            "R.C. Pardo",
            "E. Rehm",
            "R.H. Scott",
            "R.C. Vondrasek",
            "ANL",
            "Argonne",
            "USA",
            "T. Nakanishi",
            "A. Yokoyama",
            "Kanazawa University",
            "Kanazawa",
            "Japan",
            "The Hebrew University of Jerusalem",
            "The Racah Institute of Physics",
            "Jerusalem",
            "Israel",
            "The alpha-decaying 146Sm nuclide is used for chronology of the Solar System and silicate mantle differentiation in planets. We performed a new determination of 146Sm half-life by measuring 146Sm/147Sm alpha activity and atom ratios in 147Sm activated via (g",
            "n)",
            "(n",
            "2n) and (p",
            "2n) reactions and obtained a value (68 Myr)",
            "smaller than that adopted so far (103 Myr)",
            "with important geochemical implications*. The experiment required determination of 146Sm/147Sm ratios by high-energy (6 MeV/u) accelerator mass spectrometry to discriminate 146Sm from isobaric 146Nd contaminant. Activated Sm targets were dissolved",
            "chemically purified and reconverted to metallic Sm. Sputter cathodes",
            "made by pressing the Sm metal into high-purity Al holders",
            "were used to feed the Argonne ECR ion source. 146Sm22+",
            "147Sm22+ ions were alternately injected and accelerated with the ATLAS linac by proper scaling of ion source and accelerator components. A tightly-fitted quartz cylindrical liner was inserted in the ECR plasma chamber to reduce contamination from the walls. 146Sm ions were eventually counted in a gas-filled magnet and 147Sm ions either measured as charge current or counted after proper attenuation.",
            "* N. Kinoshita et al.",
            "Science 334",
            "1614 (2012)"
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp01.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP01",
          "page_number": "43",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPP03",
          "title": "Integration of a Third Ion Source for Heavy Ion Radiotherapy at HIT",
          "authors": [
            "T.W. Winkelmann",
            "A.B. Büchel",
            "R. Cee",
            "A. Gaffron",
            "Th. Haberer",
            "J.M. Mosthaf",
            "B. Naas",
            "A. Peters",
            "J. Schreiner",
            "HIT",
            "Heidelberg",
            "Germany",
            "HIT is the first European hospital based facility for scanned proton and heavy ion radiotherapy. In 2009 the clinical operation started",
            "since then more than 800 patients were treated in the facility. In a 24/7 operation scheme two 14.5 GHz electron cyclotron resonance ion sources are routinely used to produce protons and carbon ions. In the near future a helium beam for regular patient treatment is requested. The modification of the low energy beam transport line (LEBT) for the integration of a third ion source into the production facility was done in winter 2011. For beam quality improvement with a smaller emittance at the same current we designed and tested a new extraction system at the testbench and equipped the source for protons and helium with this optimized system. This paper will present results of the LEBT modification and gives an outlook to further enhancements at the HIT ion source testbench."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp03.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP03",
          "page_number": "46",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPP04",
          "title": "Design of a Compact ECR Ion Source for Various Ion Production",
          "authors": [
            "M. Muramatsu",
            "S. Hojo",
            "Y. Iwata",
            "K. Katagiri",
            "A. Kitagawa",
            "Y. Sakamoto",
            "S. Sato",
            "NIRS",
            "Chiba-shi",
            "Japan",
            "KVI",
            "Groningen",
            "The Netherlands",
            "National Institute of Radiological Sciences",
            "Chiba",
            "Japan",
            "Compact ECR ion source with all permanent magnets",
            "so called Kei2",
            "was developed for high energy carbon ion therapy facility at National Institute of Radiological Sciences. Kei2 source was design for production of only carbon ion for medical treatment. A copy of Kei2",
            "so called KeiGM is used for Gunma University. Kei series are optimized for carbon ion production. In order to produce various ion beams for research",
            "we design a new compact ECR ion source",
            "so called Kei3. Kei3 is designed based on previous Kei series. In addition",
            "there are three important points: 1) Movable beam extraction system for various extraction current densities",
            "2) An evaporator and MIVOC method for production of ions from solid materials and metal",
            "and 3) Biased disk method and double frequency heating method for heavier ions. Same permanent magnets and microwave system will be used for easy maintenance and the cost effectiveness. Design of the Kei3 source will be described in this paper."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp04_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp04.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp04_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP04",
          "page_number": "49",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPP05",
          "title": "Charge-breeding at the Texas A&M University Cyclotron Institute",
          "authors": [
            "Texas A&M University Cyclotron Institute",
            "College Station",
            "Texas",
            "USA",
            "JYFL",
            "Jyväskylä",
            "Finland",
            "Texas A&M University",
            "Cyclotron Institute",
            "College Station",
            "USA",
            "The Cyclotron Institute of Texas A&M University is currently involved in an upgrade that is intended to produce beams of radioactive ions suitable for injection into the K500 superconducting cyclotron. As an integral part of this upgrade an electron-cyclotron-resonance ion source (CB-ECRIS) has been specially constructed by Scientific Solutions of San Diego",
            "California for charge-breeding. This CB-ECRIS operates at 14.5 GHz and incorporates a hexapole of the Halbach style. Since radial injection of microwave power is ruled out",
            "this presents special problems for the axial injection of low-charge-state ions for charge-breeding. Efforts at charge-breeding with stable ions will be presented as well as plans for the injection of low-charge-state",
            "radioactive ions from cyclotron-driven ion guides",
            "one for light radioactive ions and one for heavy radioactive ions."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp05_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp05.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp05_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP05",
          "page_number": "51",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPP08",
          "title": "Design Report of the AISHA Ion Source for Hadron Therapy Facilities",
          "authors": [
            "G. Ciavola",
            "L. Andò",
            "L. Celona",
            "S. Gammino",
            "D. Mascali",
            "INFN/LNS",
            "Catania",
            "Italy",
            "CNAO Foundation",
            "Milan",
            "Italy",
            "CSFNSM",
            "Catania",
            "Italy",
            "Different facilities for hadrontherapy have been built or designed in the recent past and Italy is present in the field either with synchrotron-based and with cyclotron-based facilities. For both types of accelerators the availability of high brightness multiply charged ion beams is essential and R&D efforts in this subject are increasing. In particular at the CNAO",
            "proton and carbon ion beams will be accelerated up to 400 AMeV by a synchrotron and the beam injection is guaranteed by two identical ECR sources of the SUPERNANOGAN family modified according to the specifications we set. Optimisation of beam emittance and intensity is of primary importance to obtain the necessary current in the RFQ-LINAC and future facilities may require much better performances in terms of beam brightness than the ones provided by such commercial ECRIS. A hadron therapy center is going to be built in Catania and the R&D related to the injector has already started within the frame of a collaboration between the Regional Authority and INFN. The results of the research carried out at INFN-LNS will be presented along with the design of a relatively compact ECR ion source operating at 18 GHz",
            "named AISHA."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp08_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp08.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp08_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP08",
          "page_number": "54",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPP10",
          "title": "Operational Experience with the GTS-LHC Ion Source and Future Developments of the CERN Ion Injector",
          "authors": [
            "D. Küchler",
            "G. Bellodi",
            "A.M. Lombardi",
            "M. O'Neil",
            "R. Scrivens",
            "J.T. Stafford-Haworth",
            "CERN",
            "Geneva",
            "Switzerland",
            "iThemba LABS",
            "Somerset West",
            "South Africa"
          ],
          "institutions": [],
          "abstract": "Since 2010 the GTS-LHC source delivers lead ions for heavy ion physics at the LHC. Several modifications allowed improving the source reliability and the beam stability. The attempts to improve the beam intensity were less successful. The different modifications and actual performance figures will be presented in this paper. In addition to the heavy ion physics program of the LHC new ion species will be requested for different experiments in the future. The fixed target experiment NA61 requires primary Argon and Xenon beams. And a future radio-medical facility asks for light ions in the range Helium to Neon. Approaches to prepare these beams and to modify the ion injector towards a light ion front end are presented.",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp10_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp10.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp10_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP10",
          "page_number": "57",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": true
        },
        {
          "paper_id": "TUPP12",
          "title": "Design of Web-based Interface to RIKEN 28 GHz Super-conducting ECR Ion Source and the Future Plan",
          "authors": [
            "Sokendai",
            "Ibaraki",
            "Japan",
            "KEK",
            "Ibaraki",
            "Japan",
            "Y. Higurashi",
            "M. Komiyama",
            "T. Nakagawa",
            "K. Ozeki",
            "RIKEN Nishina Center",
            "Wako",
            "Japan",
            "A new RIKEN 28 GHz superconducting ECR ion source (28 GHz-ECRIS) was constructed in 2009 in order to increase the intensity of Uranium ion beam for RIKEN RI beam factory project(RIBF). For effective and stable operation of the 28 GHz-ECRIS",
            "its client system should have an user-friendly man-machine interface. The ECRIS control system was constructed with the Experimental Physics and Industrial Control System (EPICS) as well as RIBF control system. As a result",
            "it was successful to provide the useful clients",
            "such as the operation GUI panels",
            "the XY chart application",
            "and the data acquisition system in EPICS-based system. On the other hand",
            "to keep beam quality from 28 GHz-ECRIS for a long beam service term",
            "it should be possible to operate the ECRIS by members of ion source team at any time. In order to relieve concern in the overseas business trip of members of ion source team",
            "we designed a real-time web-based client system using WebSocket*",
            "which is a new protocol presented by Internet Engineering Task Force (IETF). In this paper",
            "we report the system and development status in detail.",
            "* I. Fette and A. Melnikov. The WebSocket Protocol",
            "IETF HyBi Working Group. 2011."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp12_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp12.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp12_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP12",
          "page_number": "61",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPP13",
          "title": "Development of Intense Proton ECR Ion Sources at IMP",
          "authors": [
            "Z.M. Zhang",
            "Z.W. Liu",
            "H.Y. Ma",
            "L.T. Sun",
            "Q. Wu",
            "Y. Yang",
            "W.H. Zhang",
            "X.Z. Zhang",
            "H.W. Zhao",
            "IMP",
            "Lanzhou",
            "People's Republic of China",
            "Since 1997",
            "there have been two ECR ion sources for producing intense proton beam developed at Institute of Modern Physics (IMP). In 1999",
            "a high current 2.45 GHz ECR proton source for Lanzhou university neutron generator",
            "was constructed and tested at IMP. A mixed ion (H1+ + H2+ + H3+) beam current of 110 mA with CW mode was delivered from a single aperture of 6mm diameter with microwave power of 600 W at the extraction voltage of 22 kV. Recently a new pulsed proton source has been designed and built at IMP for the CPHS (Compact Pulse Hadron Source) facility in Tsinghua University. Now this source is under commissioning for 60 mA proton beam with 50 keV energy. The long time running stability and beam emittance have been tested and the results are well up to the requirements of CPHS. In this paper",
            "after a short review of the proton ion source for Lanzhou University",
            "the design and test results of the CPHS proton source as well as the LEBT will be presented. The design of the proton ion source and the LEBT for the Chinese ADS project will also be discussed in the contents."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp13_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp13.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp13_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP13",
          "page_number": "64",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPP14",
          "title": "Beam Experiments with the Grenoble Test Electron Cyclotron Resonance Ion Source at iThemba LABS",
          "authors": [
            "R.W. Thomae",
            "J.L. Conradie",
            "D.T. Fourie",
            "iThemba LABS",
            "Somerset West",
            "South Africa",
            "CERN",
            "Geneva",
            "Switzerland",
            "At iThemba Laboratory for Accelerator Based Sciences a copy of the so-called Grenoble Test Source (GTS) for the production of highly charged ions is installed. The source in combination with the K-200 cyclotron delivers high energy",
            "high intensity beams for nuclear physics experiments. In this paper we present beam experiments with the GTS at iThemba LABS",
            "in which the results of CW",
            "pulsed and afterglow operation for different bias disc voltages and positions are compared."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp14_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp14.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp14_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP14",
          "page_number": "68",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": true
        },
        {
          "paper_id": "TUPP17",
          "title": "Installation and Operation of a 28 GHz Gyrotron for the RIKEN Superconducting ECR Ion Source",
          "authors": [
            "J. Ohnishi",
            "Y. Higurashi",
            "T. Nakagawa",
            "RIKEN Nishina Center",
            "Wako",
            "Japan",
            "The RIKEN 28-GHz ECRIS uses a gyrotron microwave source fabricated by Mitsubishi Electric Corporation. The maximum output power is 10 kW. The gyrotron produces TE02-mode microwaves",
            "which are converted into the TE01 mode by a mode converter. In the first test on the gyrotron performed using a dummy load",
            "we observed the 50-300 Hz ripples of ~500 W in the output power of 1-7 kW",
            "and it was difficult to make a stable operation in the low-power. These ripples were reduced to one-tenth by stabilizing the cathode voltage and then the gyrotron could produce microwaves from < 0.5 kW stably. The operation of the ion source with the 28 GHz gyrotron was started in 2011 and the ion source supplied U and Xe beams to the RIBF for two months. The power of the microwaves fluctuated slowly in the range of 870-1250 W",
            "which influenced the beam current from the ion source. This fluctuation was caused by a slight change of the current of the solenoid of the gyrotron depending on the room temperature. We replaced the power supply with new one which has a current stability of 10ppm per day",
            "and stabilized the microwave power in the range of 5% in the operation of 2 kW successfully."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp17_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp17.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp17_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP17",
          "page_number": "71",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPP18",
          "title": "DECRIS-5 Ion Source for DC-110 Cyclotron Complex Results of the First Tests",
          "authors": [
            "A.A. Efremov",
            "V. Bekhterev",
            "S.L. Bogomolov",
            "Yu.K. Kostyukhov",
            "N. Lebedev",
            "V.N. Loginov",
            "Yu. Yazvitsky",
            "JINR",
            "Dubna",
            "Moscow Region",
            "Russia",
            "KVI",
            "Groningen",
            "The Netherlands",
            "The project of the DC-110 cyclotron facility to provide applied research in the nanotechnologies (track pore membranes",
            "surface modification of materials",
            "etc.) has been designed by the Flerov Laboratory of Nuclear Reactions of the Joint Institute for Nuclear Research (Dubna). The facility includes the isochronous cyclotron DC-110 for accelerating the intense Ar",
            "Kr",
            "Xe ion beams with 2.5 MeV/nucleon fixed energy. The cyclotron is equipped with system of axial injection and ECR ion source DECRIS-5",
            "operating at the frequency of 18 GHz. The main parameters of DECRIS-5 ion source and results of the first tests are presented in this report."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp18_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp18.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp18_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP18",
          "page_number": "74",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 11,
      "scrape_time": "2025-10-10 17:29:16"
    },
    {
      "session_info": {
        "id": "WEXO",
        "name": "WEXO - Ion Production & Modelling",
        "url": "https://proceedings.jacow.org/ECRIS2012/html/wexo.htm"
      },
      "papers": [
        {
          "paper_id": "WEXO01",
          "title": "Ion Beam Formation in Expanding Plasmas and its  Application to Plasma Thrusters",
          "authors": [
            "SP3",
            "Canberra",
            "Australia",
            "For the past few decades",
            "Direct Current (DC)",
            "radiofrequency (RF) and microwave plasma sources have been used for materials processing",
            "materials diagnostics and electric propulsion in space. When terminated by a series of biased grids on one side",
            "these sources can produce accelerated ion beams (which need to be neutralized) and thrust as shown by successful space missions (e.g. DC Kaufman thruster",
            "RF Artemis thruster and microwave Hayabusa thruster). When open to vacuum or space on one side (no grid or electrode)",
            "plasma expansion occurs. The geometric and/or magnetic expansion leads to ion acceleration with sufficient electrons to provide quasi-neutrality. Applying a divergent magnetic field may lead to the spontaneous formation of an electric double layer",
            "a sudden drop of potential within a plasma. In the laboratory",
            "low energy large area ion beams accelerated by current-free double layers produced by RF plasma sources have been created using a variety of gases (Ar",
            "O2",
            "H2",
            "CO2",
            "Xe",
            "Kr",
            "CH4",
            "NH3",
            "N2O) and used in the production of surfaces with a variable degree of hydrophobicity and as a source of thrust in the development of new space engines."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wexo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wexo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wexo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEXO01",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "WEXO02",
          "title": "Recent Developments and Electron Density Simulations at the ATOMKI 14.5 GHz ECRIS",
          "authors": [
            "S. Biri",
            "R. Rácz",
            "ATOMKI",
            "Debrecen",
            "Hungary",
            "University Debrecen",
            "Debrecen",
            "Hungary",
            "The 14.5 GHz ECR ion source of ATOMKI is a standard room-temperature ECRIS devoted for plasma diagnostic studies",
            "for atomic physics research and also serves as a particle source with wide range of elements for surface treatments. From the beginning lots of technical modifications and developments have been carried out on the ion source. The changes aimed the increasing of the beams charge",
            "intensity and the widening of the ion choice. Other modifications were done to develop special",
            "non-standard operation modes or to produce peculiar plasmas or beams. Recently the original NdFeB hexapole was exchanged by a new one and new iron plugs were calculated",
            "designed and installed at the injection side of the source. The resulted stronger magnetic trap has shown significant effect on the beam intensity and on the charge states distribution. The new magnetic configuration was re-calculated by the TrapCAD code developed by our group. The spatial movement and energy evolution of a high number of electrons were followed in the calculation. A post-calculation energy filtering carried out for the lost and non-lost electrons reveals numerous interesting and important information in 3D."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wexo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wexo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wexo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEXO02",
          "page_number": "77",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEXO03",
          "title": "Numerical Modeling of Ion Production in ECRIS by using the Particle-in-Cell Method",
          "authors": [
            "V. Mironov",
            "J.P.M. Beijers",
            "KVI",
            "Groningen",
            "The Netherlands",
            "To better understand the physical processes in ECRIS plasmas",
            "we developed a Particle-in-Cell code that follows the ionization and diffusion dynamics. The basic features of the numerical model are given elsewhere*. An electron temperature of about 1 keV is needed to reproduce the experimentally observed performance of our 14 GHz ECR source. We assume that a pre-sheath is located outside the ECR zone",
            "where the ion acceleration toward the walls occurs. Electric field inside the ECR zone is supposed to be zero. The ion production is modeled assuming the ion confinement by a ponderomotive barrier formed at the boundary of the ECR zone. The barrier height is defined by the RF radiation density at the electron resonance layer and is taken as an adjustable parameter; when the plasma becomes overdense",
            "we set the barrier value to zero. With these assumptions",
            "we are able to reproduce the main features of ECRIS performance",
            "such as the saturation and decrease of highest charge state currents with increasing gas pressure",
            "as well as response to an increase of injected RF power. Afterglow and frequency-tuning effects can be explained by introducing the ponderomotive barrier.",
            "* V. Mironov and J. P. M. Beijers",
            "\"Three-dimensional simulations of ion dynamics in the plasma of an electron cyclotron resonance ion source\"",
            "Phys. Rev. ST Accel. Beams 12",
            "073501 (2009)."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wexo03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wexo03.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wexo03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEXO03",
          "page_number": "82",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEXO04",
          "title": "Proton Beams Formation from Dense Plasma of ECR Discharge sustained by  37.5 GHz Gyrotron Radiation",
          "authors": [
            "V. Skalyga",
            "I. Izotov",
            "S. Razin",
            "V. Sidorov",
            "V. Zorin",
            "IAP/RAS",
            "Nizhny Novgorod",
            "Russia",
            "T. Kalvas",
            "H. A. Koivisto",
            "O.A. Tarvainen",
            "JYFL",
            "Jyväskylä",
            "Finland",
            "Operation of modern high power accelerators often requires production of intense beams of hydrogen ions. Newer facilities aiming at outperforming the previous generation accelerators are usually designed for higher beam currents. Meeting the demand for hydrogen ion beams with higher intensity and low transverse emittance is",
            "therefore",
            "becoming increasingly difficult problem. Present work is devoted to experimental investigation of proton beams production from dense plasma (Ne>1013 cm-3) of ECR discharge sustained by 37.5 GHz",
            "100 kW gyrotron radiation at SMIS 37 facility at IAP RAS. Different extraction system configurations were used. It was demonstrated that ultra bright proton beam with 4.5 mA current and 0.1 π·mm·mrad normalized emittance (brightness=45 A/(π·mm·mrad)2) can be formed with 1-hole (1 mm in diameter) extraction. For production of high current beams a 13-hole extractor was used. 200 mA and 1.1 π·mm·mrad normalized emittance proton beam was obtained. A possibility of further beam parameters enhancement by developing of extraction system and its power supply is discussed. It was shown that in generated proton beams H2+ component was less than 6%."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wexo04_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wexo04.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wexo04_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEXO04",
          "page_number": "85",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEXO05",
          "title": "Effect of  Source Tuning Parameters on the Plasma Potential of Heavy Ions  and its Influence on the Longitudinal Optics of the High Current Injector",
          "authors": [
            "G.O. Rodrigues",
            "D. Kanjilal",
            "P.S. Lakshmy",
            "A. Mandal",
            "Y. Mathur",
            "A. Roy",
            "IUAC",
            "New Delhi",
            "India",
            "IGCAR",
            "Channai",
            "India",
            "Plasma potentials for various heavy ions have been measured using the retarding field technique in the 18 GHz High Temperature Superconducting ECR ion source",
            "PKDELIS. The influence of various source parameters viz.",
            "RF power",
            "gas pressure",
            "magnetic field",
            "negative DC bias and gas mixing on the plasma potential is studied. It is observed that the plasma potentials are decreasing for increasing charge states and a mass effect is clearly observed for the ions with similar operating gas pressures. In the case of gas mixing",
            "it is observed that the plasma potential minimises at an optimum value of the gas pressure of the mixing gas and the mean charge state maximises at this value. The energy spread arising from the plasma potential influences the longitudinal optics of the high current injector in terms of increased phase spread which deteriorates the transmission through the RFQ. Details of the measurements carried out as a function of various source parameters and its impact on the longitudinal optics are presented."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wexo05_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wexo05.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wexo05_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEXO05",
          "page_number": "90",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 5,
      "scrape_time": "2025-10-10 17:29:21"
    },
    {
      "session_info": {
        "id": "WEYO",
        "name": "WEYO - Ion Beam Extraction & Optics",
        "url": "https://proceedings.jacow.org/ECRIS2012/html/weyo.htm"
      },
      "papers": [
        {
          "paper_id": "WEYO01",
          "title": "The Einzel Lens Longitudinal Chopper",
          "authors": [
            "K. Takayama",
            "T. Adachi",
            "KEK",
            "Ibaraki",
            "Japan",
            "T. Adachi",
            "K.W. Leo",
            "Sokendai",
            "Ibaraki",
            "Japan",
            "The Einzel lens longitudinal chopper [1] placed just after the ECRIS has been developed for the KEK digital accelerator [2] and is being operated without trouble over more than 1 year. Propagation of a msec-long ion pulse extracted with the ECRIS extraction voltage V1",
            "is fully controlled by superimposing a rectangular-shape pulse voltage V2 (<0) on the fixed Einzel lens voltage V3 (V3 > V1). For most of time region (~msec)",
            "beam propagation is blocked",
            "meanwhile for a time region (~5 μs)",
            "where V2 is on and V2 + V3 < V1",
            "the beam can propagate downstream under the optimized transverse matching condition. Namely",
            "the superimposed voltage V2 + V3 works as a gate voltage. This negative pulse voltage is produced by the solid-state switch driven Marx Generator",
            "promising a fast rising/falling feature in the pulse profile. This chopper enjoys a lot of figure of merits originated from the fact that the beam can be handled at its minimum energy region:  low electron emission",
            "low voltage",
            "low energy X-ray",
            "and  low cost. This type chopper should be expected in a wide variety of ion beam applications. Comparison with other type choppers will be discussed.",
            "[1] T. Adachi",
            "K.W. Leo et al.",
            "\"A Solid-state Marx Generator driven Einzel Lens Chopper\"",
            "Rev. Sci. Inst. 82",
            "083305 (2011). [2] T.Iwashita et al.",
            "\"KEK Digital Accelerator\"",
            "Phys. Rev. ST-AB 14",
            "071301 (2011)."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/weyo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/weyo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/weyo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEYO01",
          "page_number": "95",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEYO02",
          "title": "Experimental Results: Charge-state and Current-density Distribution at the Plasma Electrode of an ECR Ion Source",
          "authors": [
            "L. Panitzsch",
            "T. Peleikis",
            "M. Stalder",
            "R.F. Wimmer-Schweingruber",
            "IEAP",
            "Kiel",
            "Germany",
            "We have measured the current-density in very close vicinity (15 mm downstream) of the plasma electrode of our hexapole-geometry electron-cyclotron-resonance ion source (ECRIS). For this",
            "we equipped our 3D-movable puller electrode with a customized Faraday Cup (FC) inside. To achieve high spatial resolution we reduced the aperture of the puller electrode to only 0.5 mm. Thus",
            "the source-region of the extracted ion beam is limited to a very small area of the plasma electrode's hole (d = 4 mm). The information about the charge-state distribution and the current density in the plane of the plasma electrode is conserved in the ion beam and was scanned by remotely moving the small-aperture puller electrode (incl. FC) across the aperture of the plasma electrode. From additional m/q- measurements for the different positions we can deduce that different ion charge-states are grouped into bloated triangles of different sizes but with the same orientation in the plane of the plasma electrode with the current density peaking at the centre. This confirms simulations by various groups as well as some emittance measurements",
            "but adds spatial resolution for the different charge-states."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/weyo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/weyo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/weyo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEYO02",
          "page_number": "101",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEYO03",
          "title": "Ion Beam Extraction from Magnetized Plasma",
          "authors": [
            "P. Spädtke",
            "R. Lang",
            "J. Mäder",
            "F. Maimone",
            "J. Roßbach",
            "K. Tinschert",
            "GSI",
            "Darmstadt",
            "Germany",
            "With increasing the total extracted current for any ion source",
            "the optimisation of the extraction system becomes more important",
            "because of the space charge effect. Several attempts have been made in the past to simulate the extraction from an Electron Cyclotron Resonance Ion Source (ECRIS) in a correct way. Most of these attempts failed",
            "because they were not able to reproduce the experimental results. The best model up to now is given by the following procedure: tracing the magnetic field lines through the extraction aperture",
            "looking where these field lines are coming from; using these coordinates of the magnetic field line as starting points for ions to be extracted; the initial current of each trajectory is determined by theoretical assumptions about the plasma or by a plasma simulation; Child's law is applicable locally only in direction of the magnetic field",
            "if no emission limited flow is present."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/weyo03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/weyo03.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/weyo03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEYO03",
          "page_number": "106",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 3,
      "scrape_time": "2025-10-10 17:29:24"
    },
    {
      "session_info": {
        "id": "WEZO",
        "name": "WEZO - New Developments & Next Generation Sources",
        "url": "https://proceedings.jacow.org/ECRIS2012/html/wezo.htm"
      },
      "papers": [
        {
          "paper_id": "WEZO01",
          "title": "Status of the SEISM Experiment",
          "authors": [
            "M. Marie-Jeanne",
            "J. Angot",
            "P. Balint",
            "C. Fourel",
            "J. Giraud",
            "J. Jacob",
            "T. Lamy",
            "L. Latrasse",
            "P. Sortais",
            "T. Thuillier",
            "LPSC",
            "Grenoble Cedex",
            "France",
            "C. Daversin",
            "F. Debray",
            "C. Trophime",
            "S. Veys",
            "GHMFL",
            "Grenoble",
            "France",
            "I. Izotov",
            "V. Skalyga",
            "V. Zorin",
            "IAP/RAS",
            "Nizhny Novgorod",
            "Russia",
            "LPSC and LNCMI (Laboratoire National des Champs Magnétiques Intenses) of Grenoble have developed the first and unique magnetic confinement structure in the world that allows a closed 60 GHz ECR zone",
            "using high field magnet technologies. The magnetic structure has been validated for 28 GHz resonance and a closed 1 T iso-B surface was measured. Calculated and measured field maps were carefully compared in order to determine an operation range for 28 GHz plasma tests. A whole test bench",
            "including high pressure water for helix cooling",
            "intense currents (up to 15 kA) for helix powering and a beam line with mass separation is under construction at LNCMI. This contribution presents the status of the experiment",
            "hopefully including the results of the first beam tests scheduled in September. The 350 kW - 60 GHz gyrotron has been built at IAP",
            "the status of its operation will be shown."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wezo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wezo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wezo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEZO01",
          "page_number": "111",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEZO02",
          "title": "Design of new 18 GHz ECR for RIKEN RIBF",
          "authors": [
            "K. Ozeki",
            "Y. Higurashi",
            "T. Nakagawa",
            "J. Ohnishi",
            "RIKEN Nishina Center",
            "Wako",
            "Japan",
            "In RIKEN RIBF",
            "we plan to install a new 18 GHz ECR ion source",
            "which supply the intense beam of highly charged heavy ion beam into the linear accelerator RILAC. By equipping two ion sources",
            "it is expected to be able to develop new beams while we produce the beam for the experiment of RIBF. Based on the structure of 18 GHz ECR ion source which have been developed in RIKEN",
            "this ion source has additional features as follows: Owing to three solenoid coils",
            "Bext can be adjusted while Bmin is fixed to an optimum value.  We adopt the variable frequency (17.2-18.4 GHz) RF power source. Therefore",
            "further enhancement of the beam intensity is expected because the frequency band suited to a size of plasma chamber is selectable",
            "In order to simplify the maintenance work",
            "we improved a structure of the chamber. In this contribution",
            "we report the design of new ion source in detail."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wezo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wezo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wezo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEZO02",
          "page_number": "114",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEZO03",
          "title": "Recent Results of PHOENIX V2 and New Prospects  with PHOENIX V3",
          "authors": [
            "T. Thuillier",
            "J. Angot",
            "T. Lamy",
            "M. Marie-Jeanne",
            "LPSC",
            "Grenoble Cedex",
            "France",
            "C. Barue",
            "C. Canet",
            "M. Dupuis",
            "P. Lehérissier",
            "F. Lemagnen",
            "L. Maunoury",
            "O. Osmond",
            "GANIL",
            "Caen",
            "France",
            "IN2P3 IPNL",
            "Villeurbanne",
            "France",
            "GSI",
            "Darmstadt",
            "Germany"
          ],
          "institutions": [],
          "abstract": "The 18 GHz PHOENIX V2 ECRIS is running since 2010 on the heavy ions low energy beam transport line (LEBT) of",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wezo03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wezo03.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wezo03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEZO03",
          "page_number": "117",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 3,
      "scrape_time": "2025-10-10 17:29:28"
    },
    {
      "session_info": {
        "id": "WEPP",
        "name": "WEPP - Wednesday Poster Session",
        "url": "https://proceedings.jacow.org/ECRIS2012/html/wepp.htm"
      },
      "papers": [
        {
          "paper_id": "WEPP02",
          "title": "Relationship of Performance and RF Resonance Modes",
          "authors": [
            "T. Hattori",
            "A. Kitagawa",
            "M. Muramatsu",
            "NIRS",
            "Chiba-shi",
            "Japan",
            "RLNR",
            "Tokyo",
            "Japan",
            "The performance of Electron Cyclotron Resonance (ECR) ion source depends on the operation frequency",
            "the magnetic mirror field",
            "the maltipole field",
            "the mirror ratio",
            "the ECR zone and others. We studied the relationship of performance and operation frequency in ECR ion source (HiECR-3). The performance (beam intensity of Ar9+ ion) was measured according to change of frequency from 9.7 to 11.7 GHz in fixed magnetic field of HiECR ion source. We measured resonant frequencies of plasma chamber of HiECR ion source in condition of no plasma (current of mirror coils is zero). The data of intensity of Ar9+ related to measured resonant frequencies. Their resonant modes were checked with a 3D electromagnetic simulator (High Frequency Structure Simulator). As a result",
            "it became clear that the performance of the ion source depends on electric-field distribution of the RF resonant mode."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp02.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP02",
          "page_number": "121",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP03",
          "title": "Plasma Instability in the Afterglow of ECR Discharge Sustained in a Mirror Trap",
          "authors": [
            "I. Izotov",
            "A. Mansfeld",
            "V. Skalyga",
            "V. Zorin",
            "IAP/RAS",
            "Nizhny Novgorod",
            "Russia",
            "T. Grahn",
            "T. Kalvas",
            "H. A. Koivisto",
            "J.P.O. Komppula",
            "P. Peura",
            "O.A. Tarvainen",
            "V. Toivanen",
            "JYFL",
            "Jyväskylä",
            "Finland",
            "A number of studies have been devoted to the investigations of plasma decay in ECR heated discharges confined in a mirror magnetic trap. The motivation of this work is to study plasma instabilities causing perturbations of ion current during the plasma decay. Present work is devoted to time-resolved diagnostics of non-linear effects observed during the afterglow plasma decay of an 14 GHz Electron Cyclotron Resonance Ion Source (ECRIS) at JYFL operated in pulsed mode. Plasma instabilities causing perturbations of extracted ion current during the decay were observed and studied. It is shown that these perturbations are associated with precipitation of high energy electrons along the magnetic field lines and strong bursts of bremsstrahlung emission. The effect of ion source settings on the onset of the observed instabilities was investigated. Based on the experimental data and estimated plasma properties it is assumed that the instabilities are of cyclotron type. The conclusion is supported by a comparison to other type of plasma devices (SMIS 37",
            "IAP RAS) exhibiting similar characteristics but operating in a different plasma confinement regime."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp03.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP03",
          "page_number": "125",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP08",
          "title": "Emittance Measurements for U Ion Beams Produced from RIKEN 28 GHz SC-ECRIS",
          "authors": [
            "K. Ozeki",
            "Y. Higurashi",
            "T. Nakagawa",
            "J. Ohnishi",
            "RIKEN Nishina Center",
            "Wako",
            "Japan",
            "In order to investigate the ion optical parameters of the beam line of RIKEN 28 GHz SC-ECR ion source into the new heavy ion linac (RILAC II)",
            "we measured the emittance of the heavy ion beams form RIKEN 28 GHz SC-ECR ion source. In the test experiments",
            "we observed that the emittance of the U35+ beam was ~100 π·mm·mrad (4 rms emittance)",
            "which is smaller than the acceptance of the accelerator (~160 π·mm·mrad). The emittance with 28 GHz was almost same as that with 18 GHz and independent on the injected RF power (1~2 kW). The size of emittance increased with decreasing the charge state. We also measured the emittance of U and oxygen ions under the same condition. In this experiment we observed that the emittance of oxygen ions was always larger than the U ion beam for same M/q. In this contribution",
            "we report the experimental results for emittance measurement of highly charged U",
            "Xe and O ions from RIKEN 28 GHz SC-ECR ion source in detail."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp08_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp08.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp08_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP08",
          "page_number": "130",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP13",
          "title": "Development Update of the",
          "authors": [],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp13_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp13.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp13_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP13",
          "page_number": "",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP14",
          "title": "An Advanced Injection System of Light Ions (AISLI) for Dielectric Wall Accelerator",
          "authors": [
            "S.X. Peng",
            "J. Chen",
            "J.E. Chen",
            "Z.Y. Guo",
            "P.N. Lu",
            "H.T. Ren",
            "Y. Xu",
            "J. Zhao",
            "PKU",
            "Beijing",
            "People's Republic of China",
            "The dielectric wall accelerator (DWA) is a kind of acceleration system that has the ability to accelerate any charge to mass ratio particle with high electric field gradients up to 400 MV/m and very compact dimension",
            "for example d 30 mm x 50 mm. To demonstrate the high gradient tiny acceleration system",
            "a comparable 50 mA/40 keV pulsed H+ converge beam injector is required. Based on the experimental results obtained on the test bench",
            "a six electrodes injector was developed at Peking University (PKU). In this paper we will describe the preliminary experimental results as well as the details of the new compact injector which named as An Advanced Injector System of Light Ions (AISLI)."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp14_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp14.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp14_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP14",
          "page_number": "136",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": true
        },
        {
          "paper_id": "WEPP15",
          "title": "Metal Ion Beam Production with Improved Evaporation Ovens",
          "authors": [
            "K. Tinschert",
            "R. Lang",
            "J. Mäder",
            "F. Maimone",
            "J. Roßbach",
            "GSI",
            "Darmstadt",
            "Germany",
            "Most of the ion beams delivered by the ECR ion sources at the GSI accelerator facilities are produced from materials in the solid state",
            "which must be transformed into the gaseous state to feed the plasma. The well established method of thermal evaporation has been used by means of two types of resistively heated ovens for metals and solid compounds. The main goal of development is to improve their versatility in terms of lifetime",
            "durability",
            "efficiency",
            "and extended temperature range. Recent investigations and developments include the use of alternative materials for oven components. The main focus has been on the further development of the high temperature oven. A modular construction with improved mechanical dimensional accuracy for more precise and easier mounting has been established. Its optimization for stable long time operation has been continued leading to a lifetime of 6 days for evaporation of Ti at 1750°C. Furthermore the temperature limit could be extended to 2300°C. In addition to the improvements in evaporation technology the technique of microwave frequency tuning could be successfully applied for metal ion operation leading to enhanced ion beam intensities."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp15_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp15.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp15_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP15",
          "page_number": "140",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP16",
          "title": "Experimental Studies on the ALISES Ion Source at CEA Saclay",
          "authors": [
            "O. Tuske",
            "O. Delferrière",
            "Y. Gauthier",
            "R. Gobin",
            "F. Harrault",
            "J.L. Jannin",
            "CEA/DSM/IRFU",
            "France",
            "CEA/IRFU",
            "Gif-sur-Yvette",
            "France",
            "The ALISES ion source was originally designed to reduce beam emittance at RFQ entrance by shortened the length of the LEBT. A wide opened magnetic coil at ground potential produces the fringe field needed for the ECR heating at 2.45 GHz frequency. The first part describes the commissioning of the source: Penning discharges inside the accelerating column make the high voltage power supply collapse. Experimental tests with kapton films while discharges occur",
            "and simulations with OPERA-3D code have shown great similarities to detect the location of those discharges and allow us to make the ion source work. The second part of this paper will present the result of low intensity light ion beam production versus the plasma chamber length and radius. Those very preliminary tests give us indications to reduce the ion source dimensions."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp16_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp16.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp16_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP16",
          "page_number": "143",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": true
        },
        {
          "paper_id": "WEPP17",
          "title": "A Multi-Sample Changer Coupled to an ECR Source for AMS Experiments",
          "authors": [
            "R.C. Vondrasek",
            "T. Palchan",
            "R.C. Pardo",
            "C.E. Peters",
            "M.A. Power",
            "R.H. Scott",
            "ANL",
            "Argonne",
            "USA"
          ],
          "institutions": [
            "A project using Accelerator Mass Spectrometry (AMS) at the ATLAS facility to measure neutron capture rates on a wide range of actinides in a reactor environment is underway. This project will require the measurement of a large number of samples previously irradiated in the Advanced Test Reactor at Idaho National Laboratory. The AMS technique at ATLAS is based on production of highly-charged positive ions in an electron cyclotron resonance ion source (ECRIS) followed by acceleration in the ATLAS linac. The sample material is introduced into the plasma via laser ablation. This should limit the dependency of material feed rates upon the source material composition as well as minimize cross-talk between samples. A new multi-sample changer has been constructed allowing rapid changes between samples. The sample changer has 20 positions and is capable of moving from one sample to the next in one minute. Details of the sample changer design and operation will be presented."
          ],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp17_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp17.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp17_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP17",
          "page_number": "146",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 8,
      "scrape_time": "2025-10-10 17:29:35"
    },
    {
      "session_info": {
        "id": "THXO",
        "name": "THXO - Superconducting Sources",
        "url": "https://proceedings.jacow.org/ECRIS2012/html/thxo.htm"
      },
      "papers": [
        {
          "paper_id": "THXO01",
          "title": "Optimization of the New SC Magnetic Structure Design with a Hybrid Magnet",
          "authors": [
            "D. Xie",
            "W. Lu",
            "L.Z. Ma",
            "L.T. Sun",
            "X.Z. Zhang",
            "H.W. Zhao",
            "L. Zhu",
            "IMP",
            "Lanzhou",
            "People's Republic of China",
            "In the development of the next generation ECRISs",
            "so far either a set of full NbTi or full Nb3Sn magnets has been proposed to construct the magnet system. However",
            "the single set of magnets may not be the optimum in terms of the field strength and configuration. An optimization of the new SC magnetic structure with a set of hybrid magnets (NbTi and Nb3Sn) is being investigated. With the hybrid magnet the optimized new magnetic system is capable of producing field maxima of 9.0 T on axis and 4.0 T at the plasma wall",
            "which are 30 and 10% higher than the previously proposed magnetic structure to be built with a set of full NbTi magnets. In addition",
            "the axial length of the optimized magnetic structure has been slightly shrunk resulting in a more compact system. This new magnetic field profile is high enough for operation frequency up to 56 GHz. The design features and the preliminary force/stress analyses of the optimized new SC magnetic structure will be presented and discussed."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thxo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thxo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thxo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THXO01",
          "page_number": "149",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THXO02",
          "title": "Current Developments of the VENUS Ion Source in Research and Operations",
          "authors": [
            "J.Y. Benitez",
            "K.Y. Franzen",
            "C.M. Lyneis",
            "L. Phair",
            "M.M. Strohmeier",
            "LBNL",
            "Berkeley",
            "California",
            "USA",
            "FRIB",
            "East Lansing",
            "Michigan",
            "USA",
            "IMP",
            "Lanzhou",
            "People's Republic of China",
            "The VENUS ion source functions as a research and development tool in the ECR community as well as an injector for LBNL's 88-Inch cyclotron. In order to meet the needs of both the ECR community and users at the 88-Inch cyclotron",
            "technology such as ovens and a sputter probe have been developed for introducing metals into the plasma. Using a modified high temperature oven",
            "VENUS has produced 450 eμA of 238U33+ and 400 eμA of 238U34+",
            "twice the required Uranium beam current needed for FRIB. In addition",
            "after upgrading its high voltage capabilities VENUS produced 11emA of 4He2+",
            "a capability that remains unparalleled by other ECR ion sources. In addition to its recent record high intensities VENUS is also being developed to deliver low intensity",
            "ultra high charge state ions for the cocktails beams",
            "where many species are produced simultaneously for use by the BASE Facility. 124Xe43+ is now in regular production for the 16 MeV/u cocktail",
            "and development of 209Bi56+ for the 10 MeV/u cocktail is in progress and has been accelerated through the 88-Inch cyclotron. This paper presents the latest work towards integrating the VENUS ion source into our research and operational goals."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thxo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thxo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thxo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THXO02",
          "page_number": "153",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THXO03",
          "title": "Recent RIKEN 28 GHz SC-ECRIS Results",
          "authors": [
            "Y. Higurashi",
            "M. Fujimaki",
            "H. Haba",
            "O. Kamigaito",
            "M. Kidera",
            "M. Komiyama",
            "J. Ohnishi",
            "K. Ozeki",
            "RIKEN Nishina Center",
            "Wako",
            "Japan",
            "T. Aihara",
            "M. Tamura",
            "A. Uchiyama",
            "SHI Accelerator Service Ltd.",
            "Tokyo",
            "Japan",
            "For increasing the beam intensity of highly charged heavy ions at RIKEN RIBF",
            "we constructed new SC-ECR ion source. In the spring of 2011",
            "we injected 28GHz microwave into the ion source and obtained first beam. Since then",
            "we made several test experiments for increasing the beam intensity of highly charged Xe and U ion beam",
            "and produced ~60 eμA of U35+",
            "~90 eμA of U33+ at the injected RF power of ~2 kW using sputtering method. In case of Xe25+",
            "250 euA was obtained at RF power of 1.7 kW. Using sputtering method",
            "we produced U35+ ion beam longer than one month for the RIBF experiment without break. In the beginning of 2012",
            "we installed additional GM-JT refrigerator to increase the cooling power at 4.2 K",
            "then the total cooling power became higher than 9 W. Using it",
            "we can use higher than 8 W of cooling power for heat load due to the absorbed X-rays. In this summer",
            "we will install the new plasma chamber made of Al for increasing the cooling power. We will also use high temperature oven to increase the U vapor. In this contribution",
            "we report the recent modification of the ion source and test experiments for production of U and Xe ion beam."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thxo03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thxo03.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thxo03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THXO03",
          "page_number": "159",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THXO04",
          "title": "SECRAL status and future challenge",
          "authors": [
            "H.W. Zhao",
            "W. Lu",
            "L.T. Sun",
            "D. Xie",
            "X.Z. Zhang",
            "IMP",
            "Lanzhou",
            "People's Republic of China",
            "SECRAL",
            "the superconducting ECR ion source at IMP",
            "has been in routine operation for the HIRFL accelerator complex since May 2007. The total operation beam time provided by SECRAL has so far exceeded 9500 hours. In most cases SECRAL has been operating at 18 GHz for the accelerator complex",
            "and only operating at 24 GHz for the very high charge states and very heavy ion beams such as Bi and U beams. Uranium beam was tested at 24 GHz with ion sputtering in which 160 eμA of 238U33+ was produced",
            "and 238U32+ beam was delivered to the accelerator continuously for almost one month. Beam long-term stability and emittance at high rf power of 24 GHz were studied. The operation status and the latest performance of SECRAL ion source will be presented. A new heavy ion accelerator facility HIAF has been proposed at IMP. HIAF requests an ion source capable of producing a pulse beam of 2.0 emA of 238U34+. A next generation superconducting ECR ion source with operating frequency up to 50-60 GHz is under consideration in which a few options for the superconducting magnet configuration are being studied. Technical challenges for the next generation ECR ion source will be reviewed."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thxo04_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thxo04.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thxo04_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THXO04",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 4,
      "scrape_time": "2025-10-10 17:29:39"
    },
    {
      "session_info": {
        "id": "THYO",
        "name": "THYO - Charge Breeding & Radioactive Ion Beams",
        "url": "https://proceedings.jacow.org/ECRIS2012/html/thyo.htm"
      },
      "papers": [
        {
          "paper_id": "THYO01",
          "title": "Operation of an ECRIS Charge State Breeder at TRIUMF",
          "authors": [
            "F. Ames",
            "R.A. Baartman",
            "P.G. Bricault",
            "K. Jayamanna",
            "A. Mjøs",
            "TRIUMF",
            "Canada's National Laboratory for Particle and Nuclear Physics",
            "Vancouver",
            "Canada",
            "After initial commissioning of the charge state breeder for radioactive ions at the TRIUMF/ISAC facility further tests on the performance of the system have been performed. One of the major problems found was the high background of stable ions from the ECR source",
            "mainly C",
            "N",
            "O",
            "Ar",
            "Fe",
            "Ni",
            "C and Cr. The main source of those is the residual gas and sputtered material from the plasma chamber wall and from the surrounding electrodes. Although their intensity is small it can be orders of magnitude more than the intensity from the radioactive ions. Therefore",
            "the original stainless steel plasma chamber of the Pantechnik PHOENIX ECR source has been exchanged to aluminium with an ultra pure aluminium coating",
            "all electrodes for injection and extraction of the ions have been replaced with aluminium and the iron joke at the extraction side",
            "which is part of the vacuum system in the PHOENIX source has been coated as well. This combined effect has reduced the amount of background ions substantially. Detailed results on the performance of the source after those changes will be presented."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thyo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thyo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thyo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THYO01",
          "page_number": "163",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THYO02",
          "title": "LPSC PHOENIX ECR Charge Breeder Beam Optics and Efficiencies",
          "authors": [
            "J. Angot",
            "T. Lamy",
            "M. Marie-Jeanne",
            "P. Sortais",
            "T. Thuillier",
            "LPSC",
            "Grenoble Cedex",
            "France",
            "The PHOENIX ECR charge breeder characteristics (efficiency and charge breeding time) were measured at CERN-ISOLDE and LPSC",
            "they were considered as sufficient to allow its setup on various facilities (TRIUMF-Canada/GANIL-"
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thyo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thyo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thyo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THYO02",
          "page_number": "167",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THYO03",
          "title": "Design Status of ECR Ion Sources and LEBT for FRIB",
          "authors": [
            "G. Machicoane",
            "N.K. Bultman",
            "G. Morgan",
            "E. Pozdeyev",
            "X. Rao",
            "FRIB",
            "East Lansing",
            "Michigan",
            "USA",
            "J.Y. Benitez",
            "C.M. Lyneis",
            "LBNL",
            "Berkeley",
            "California",
            "USA",
            "IMP",
            "Lanzhou",
            "People's Republic of China",
            "The Facility for Rare Isotope Beams at Michigan State University is currently being designed and will provide intense beams of rare isotopes for research in nuclear physics",
            "nuclear astrophysics and study of fundamental interactions. The FRIB driver linac will accelerate all stable isotopes from Oxygen to Uranium to energies beyond 200 MeV/u at beam powers up to 400 kW. In the case of Uranium about 13.3 pμA of U33+ are required from the ion source to reach the maximum beam power on the target. Such current is at the limit of what an ECR ion source can produce and led us to design the FRIB driver linac to accelerate concurrently two charges. The ECR ion source for FRIB will be based on the VENUS ion source developed at Lawrence Berkeley National Laboratory (LBNL). Recent beam measurements done with VENUS have demonstrated that the ion source can actually produce close to 13pμA of U33+ and therefore could possibly meet the current required for FRIB in one charge state. This paper reviews the status of the FRIB ECR ion source and the modifications that have been made to the VENUS ion source design. The Low energy beam line transport (LEBT) will also be presented and discussed."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thyo03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thyo03.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thyo03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THYO03",
          "page_number": "172",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THYO04",
          "title": "Performance of the ANL ECR Charge Breeder with Low Mass Beams",
          "authors": [
            "R.C. Vondrasek",
            "S.V. Kutsaev",
            "R.C. Pardo",
            "R.H. Scott",
            "ANL",
            "Argonne",
            "USA",
            "P. Delahaye",
            "L. Maunoury",
            "GANIL",
            "Caen",
            "France",
            "The Californium Rare Ion Breeder Upgrade (CARIBU) of the ATLAS superconducting linac facility aims at providing low-energy and reaccelerated neutron-rich radioactive beams to address key nuclear physics and astrophysics questions. These beams are obtained from fission fragments of a Cf-252 source",
            "thermalized and collected into a low-energy particle beam by a helium gas catcher",
            "mass analyzed by an isobar separator",
            "and charge bred with an ECR ion source for acceleration in ATLAS. The charge breeding program had focused on optimizing beams in the mid-mass range",
            "achieving high charge breeding efficiencies of both gaseous and solid species including 14.7% for the radioactive species 143Ba27+. In an effort to better understand the charge breeding mechanism",
            "we recently focused on the low-mass species sodium and potassium which up to present have been difficult to charge breed efficiently. Charge breeding efficiencies of 10.1% for 23Na7+ and 17.9% for 39K10+ were obtained injecting stable Na+ and K+ beams from a surface ionization source. Details of these studies will be presented as well as simulations detailing the injection of the low charge state beams into the charge breeder."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thyo04_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thyo04.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thyo04_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THYO04",
          "page_number": "177",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 4,
      "scrape_time": "2025-10-10 17:29:43"
    },
    {
      "session_info": {
        "id": "FRXA",
        "name": "FRXA - New Developments & Status Reports",
        "url": "https://proceedings.jacow.org/ECRIS2012/html/frxa.htm"
      },
      "papers": [
        {
          "paper_id": "FRXA01",
          "title": "High Intensity Beam Production at CEA/Saclay for the IFMIF Project",
          "authors": [
            "R. Gobin",
            "G. Adroit",
            "D. Bogard",
            "N. Chauvin",
            "O. Delferrière",
            "Y. Gauthier",
            "P. Girardot",
            "F. Harrault",
            "J.L. Jannin",
            "D. Loiseau",
            "P. Mattei",
            "A. Roger",
            "F. Senée",
            "O. Tuske",
            "CEA/DSM/IRFU",
            "France",
            "At CEA/Saclay",
            "IRFU institute is in charge of the design",
            "construction and characterization of the 140 mA continuous deuteron Injector for the IFMIF project. This injector includes the source and the low energy beam line (LEBT) with its own diagnostics. The Electron Cyclotron Resonance (ECR) ion source operates at 2.45 GHz and the 2 m long LEBT is based on 2 solenoids. Krypton gas injection in the beam line is foreseen in order to reach a high level of space charge compensation for the beam matching at the RFQ entrance. During the last months hydrogen beam has been produced in pulsed and continuous mode and the beam diagnostics have been installed and commissioned. Recently a 125 mA-100 keV pulsed deuteron beam has been produced with a 1% duty cycle. In this article",
            "the high intensity proton and deuteron beam characterization will be presented."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/frxa01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/frxa01.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/frxa01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-FRXA01",
          "page_number": "182",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "FRXA02",
          "title": "All Permanent Magnet ECR Ion Source Development and Operation Status at IMP",
          "authors": [
            "L.T. Sun",
            "Y. Cao",
            "J.Q. Li",
            "J.Y. Li",
            "B.H. Ma",
            "H. Wang",
            "J.W. Xia",
            "D. Xie",
            "W.H. Zhang",
            "X.Z. Zhang",
            "H.W. Zhao",
            "IMP",
            "Lanzhou",
            "People's Republic of China",
            "All permanent magnet ECR ion sources have many advantages over traditional ECR ion sources composed of several axial room temperature solenoids and one permanent magnet hexapole magnet",
            "which make them the first choice for many heavy ion facilities and platforms. At IMP",
            "three types of all permanent magnet ECR ion sources have been built for different applications",
            "i.e. the very compact ECR ion source"
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/frxa02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/frxa02.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/frxa02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-FRXA02",
          "page_number": "185",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "FRXA03",
          "title": "Laser Ablation of Actinides into an Electron Cyclotron Resonance Ion Sources for Accelerator Mass Spectroscopy",
          "authors": [
            "T. Palchan",
            "F.G. Kondev",
            "S.A. Kondrashev",
            "C. Nair",
            "R.C. Pardo",
            "R.H. Scott",
            "R.C. Vondrasek",
            "ANL",
            "Argonne",
            "USA",
            "W. Bauder",
            "P. Collon",
            "University of Notre Dame",
            "Indiana",
            "USA",
            "J.F. Berg",
            "T. Maddock",
            "G. Palmotti",
            "M. Salvatores",
            "G. Youinou",
            "INL",
            "Idaho Falls",
            "Idaho",
            "USA",
            "ISU",
            "Pocatello",
            "Idaho",
            "USA",
            "The Hebrew University of Jerusalem",
            "The Racah Institute of Physics",
            "Jerusalem",
            "Israel",
            "CEA Cadarache",
            "Saint Paul Lez Durance",
            "France"
          ],
          "institutions": [],
          "abstract": "A project using accelerator mass spectrometry (AMS) is underway at the ATLAS facility to measure the atom densities of transmutation products present in samples irradiated in the Advanced Test Reactor at INL. These atom densities will be used to infer effective actinide neutron capture cross-sections ranging from Thorium to Califorium isotopes in different neutron spectra relevant to advanced fuel cycles. This project will require the measurement of many samples with high precision and accuracy. The AMS technique at ATLAS is based on production of highly-charged positive ions in an ECRIS followed by injection into a linear accelerator. We use a picosecond laser to ablate the actinide material into the ion source. We expect that the laser ablation technique will have higher efficiency and lower chamber contamination than sputtering or oven evaporation thus reducing 'cross talk' between samples. The results of off-line ablation tests and first results of an accelerate beam generated by the laser coupled to the ECR will be discussed as well as the overall project schedule.",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/frxa03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/frxa03.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/frxa03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-FRXA03",
          "page_number": "190",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 3,
      "scrape_time": "2025-10-10 17:29:47"
    },
    {
      "session_info": {
        "id": "FRYA",
        "name": "FRYA - Status Reports",
        "url": "https://proceedings.jacow.org/ECRIS2012/html/frya.htm"
      },
      "papers": [
        {
          "paper_id": "FRYA01",
          "title": "ECRISs at GANIL Today and Tomorrow",
          "authors": [
            "P. Jardin",
            "O. Bajeat",
            "C. Barue",
            "C. Canet",
            "P. Delahaye",
            "M. Dubois",
            "M. Dupuis",
            "J.L. Flambard",
            "R. Frigot",
            "C. Leboucher",
            "P. Lehérissier",
            "F. Lemagnen",
            "L. Maunoury",
            "O. Osmond",
            "J. Piot",
            "E.K. Traykov",
            "GANIL",
            "Caen",
            "France",
            "IPHC",
            "Strasbourg Cedex 2",
            "France",
            "IN2P3 IPNL",
            "Villeurbanne",
            "France",
            "J. Rubert",
            "T. Thuillier",
            "LPSC",
            "Grenoble Cedex",
            "France",
            "CEA/DSM/IRFU",
            "France",
            "GANIL (Grand accélérateur National d'Ions Lourds) uses ECRIS for producing stable and radioactive ions since more than 20 years. 2 ECR4 type IS deliver intense multi-charged stable ion beams of gaseous and metallic elements to cyclotrons for post acceleration to energies up to 100 A·MeV. A full permanent magnet ECRIS is also used for producing multi-charged radioactive ion beams in the frame of SPIRAL 1 (Système de Production d'Ions radioactifs Accélérés en Ligne",
            "part 1). For atomic physic experiment",
            "a high performance ECRIS named GTS developed at CENG/ Grenoble (France) is currently used to deliver high intensity",
            "high charge state and low energy ion beams. To extend the range of radioactive ion beams available at GANIL",
            "two ISOL (Isotope Separator On Line) projects are underway ("
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/frya01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/frya01.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/frya01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-FRYA01",
          "page_number": "195",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "FRYA02",
          "title": "Status of ECR Ion Sources for Carbon-ion Radiotherapy in Japan",
          "authors": [
            "A. Kitagawa",
            "M. Muramatsu",
            "NIRS",
            "Chiba-shi",
            "Japan",
            "KVI",
            "Groningen",
            "The Netherlands",
            "National Institute of Radiological Sciences",
            "Chiba",
            "Japan",
            "SAGA HIMAT",
            "Saga",
            "Japan",
            "N. Sasaki",
            "W. Takasugi",
            "AEC",
            "Chiba",
            "Japan",
            "E. Takeshita",
            "S. Yamada",
            "Gunma University",
            "Heavy-Ion Medical Research Center",
            "Maebashi-Gunma",
            "Japan",
            "Heavy-ion radiotherapy is successfully carried out at the Heavy Ion Medical Accelerator in Chiba (HIMAC) at the National Institute of Radiological Sciences (NIRS) since 1994. Now three facilities are in operation and two are under construction in Japan. Over 8000 cancer patients have already been treated. 140-400 MeV/u carbon beams were selected for the first clinical trials at HIMAC because carbon is one of the best candidates which gives good localized biological dose distribution for the typical conditions",
            "a depth of 10 - 25 cm and a thickness of several cm. Based on the clinical results",
            "all the patients have been treated by carbon beams at present. The ion source needs to realize a stable carbon beam with the same conditions for daily operation. Since operators are usually not specialists of the ion source",
            "the source should not require complicated manual tuning. In addition",
            "shorter maintenance time and cycle are better for a hospital. ECR ion sources are utilized for such requirements in each facility. We report the recent status of the ECR ion sources at heavy-ion radiotherapy facilities in Japan."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/frya02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/frya02.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/frya02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-FRYA02",
          "page_number": "200",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "FRYA03",
          "title": "ECRIS Related Research and Development Work at JYFL and Some Future Prospects",
          "authors": [
            "H. A. Koivisto",
            "J.E. Ärje",
            "T. Kalvas",
            "J.P.O. Komppula",
            "R.J. Kronholm",
            "J.P. Laulainen",
            "O.A. Tarvainen",
            "V. Toivanen",
            "JYFL",
            "Jyväskylä",
            "Finland",
            "Since the last ECR workshop the JYFL ion source group has focused on the plasma research",
            "work on the ion beam formation and transport and development of metal ion beams. The plasma research can be divided into plasma breakdown processes",
            "plasma and ion beam instabilities and afterglow processes. The afterglow and instability experiments will be presented elsewhere in these proceedings [1]. In addition",
            "studies involving in the photoelectric induced electron emission and charge exchange reactions will be briefly discussed and the experiments concerning the resonance properties of empty and plasma loaded cavity will be presented. An improvement in ion beam transport of the JYFL K130 cyclotron facility was achieved as a result of the work performed on ion beam formation. This work will be described in more detailed elsewhere in these proceedings [2]. The MIVOC method and sputtering technique were further studied in order to produce intensive titanium ion beams. As a result",
            "an intensive {50}Ti ion beam was successfully produced with the MIVOC method and interesting behavior regarding the sputtering was noticed."
          ],
          "institutions": [],
          "abstract": "[1] V. Skalyga et al. and O. Tarvainen et al. [2] V. Toivanen et al.",
          "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/frya03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/frya03.pdf",
          "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/frya03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-FRYA03",
          "page_number": "203",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 3,
      "scrape_time": "2025-10-10 17:29:50"
    }
  ],
  "all_papers": [
    {
      "paper_id": "TUXO01",
      "title": "Coupling Microwave Power into ECR Ion Source Plasmas at Frequencies above 20 GHz",
      "authors": [
        "C.M. Lyneis",
        "J.Y. Benitez",
        "M.M. Strohmeier",
        "D.S. Todd",
        "LBNL",
        "Berkeley",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "Electron Cyclotron Resonance (ECR) ion sources have been built to operate at frequencies from 5 GHz to 28 GHz and typically use a plasma chamber that serves as a multi-mode cavity. For small sources operating at 6 to 14 GHz cavity mode-like behavior has been reported. In these cavities the vacuum mode density is low enough that it may be that the RF power distribution can be understood in terms of excitation of a few modes. The large superconducting ECR ion sources, such as VENUS, operating at higher frequencies have a much greater mode density and very strong damping from plasma microwave adsorption. In this type of source, how the RF is launched into the plasma chamber will strongly affect the microwave coupling and the chamber walls will be less important. The VENUS source uses round over-moded TE01 mode waveguide to couple to the plasma, while most modern fusion devices use quasi-gaussian HE11 waves for injection into plasmas. In this paper we will describe the potential advantages of applying this technology to superconducting ECR ion sources as well as designs for doing so with VENUS.",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuxo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuxo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuxo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUXO01",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXO02",
      "title": "An Experimental Study of ECRIS Plasma Stability and Oscillation of Beam Current",
      "authors": [
        "O.A. Tarvainen",
        "T. Kalvas",
        "H. A. Koivisto",
        "J.P.O. Komppula",
        "V. Toivanen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "C.M. Lyneis",
        "M.M. Strohmeier",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The stability of oxygen ion beams extracted from ECR ion sources has been studied with the superconducting ion source VENUS at LBNL and with the A-ECR type 14 GHz ECRIS at JYFL. Discrete Fourier transform has been used for characterizing beam current oscillations in kHz range exhibited by both ion sources. The effect of source parameters on the frequency and amplitude of the oscillations is discussed. It was found that double frequency heating affects the oscillation frequency",
        "biased disc can be used to mitigate the amplitude of beam current fluctuations",
        "increasing B-minimum results to pronounced instabilities and operating the ion source with significantly higher mirror ratio than suggested by ECRIS scaling laws yields the most stable ion beams. It is argued that the observed beam current fluctuations are correlated with plasma instabilities. A 'roadmap' for identifying the plasma instability mechanisms responsible for beam current fluctuations is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuxo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuxo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuxo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUXO02",
      "page_number": "5",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXO03",
      "title": "Two-frequency Heating Technique for Stable ECR Plasma",
      "authors": [
        "A. Kitagawa",
        "M. Muramatsu",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "S. Biri",
        "R. Rácz",
        "ATOMKI",
        "Debrecen",
        "Hungary",
        "National Institute of Radiological Sciences",
        "Chiba",
        "Japan",
        "Osaka University",
        "Graduate School of Engineering",
        "Osaka",
        "Japan",
        "N. Sasaki",
        "W. Takasugi",
        "AEC",
        "Chiba",
        "Japan",
        "As a method to improve highly charged ion production",
        "a technique to feed multiple microwaves with different frequencies is well-known. However the reason is not made sufficiently clear. Our group studied with two frequencies close together with a power of 600 W over by 18 GHz NIRS-HEC ECR ion source installed in the Heavy Ion Medical Accelerator in Chiba (HIMAC) at the National Institute of Radiological Sciences (NIRS). As a result",
        "it was revealed that the improvement of output beam current depends on the total power. In this case it seems that the two-frequency heating technique carries the advantage that the plasma instability at high microwave power is relieved. The effectiveness of an additional microwave depends on its frequency. It is necessary to optimize an additional frequency precisely; several tens MHz step against 18 GHz. The optimized frequency is directly influenced by the magnetic configuration. The necessary requirements for an additional microwave and the procedure of optimization in order to obtain a large advantage will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuxo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuxo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuxo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUXO03",
      "page_number": "10",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYO01",
      "title": "Experimental Study of Temperature and Density Evolution During Breakdown in a 2.45 GHz ECR Plasma",
      "authors": [
        "O.D. Cortázar",
        "A. Megía-Macías",
        "A. Vizcaíno-de-Julián",
        "ESS Bilbao",
        "LEIOA",
        "Spain",
        "An experimental study of temperature and density evolution during breakdown in off-resonance ECR hydrogen plasma by time resolved Langmuir probe diagnostic is presented. Under square 2.45 GHz microwave excitation pulses with a frequency of 50 Hz and relative high microwave power",
        "unexpected transient temperature peaks that reach 18 eV during 20 μs are reported at very beginning of plasma breakdown. Decays of such peaks reach final stable temperatures of 5 eV at flat top microwave excitation pulse. Evidence of interplay between incoming power and duty cycle giving different kind of plasma parameters evolutions engaged to microwave coupling times is observed. Under relative high power conditions where short microwave coupling times are recorded",
        "high temperature peaks are measured. However",
        "for lower incoming powers and longer coupling times",
        "temperature evolves gradually to a higher final temperature without peaking. On the other hand",
        "the early instant where temperature peaks are observed also suggest a possible connection with preglow and superadiabatic processes during breakdown in ECR plasmas."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuyo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuyo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuyo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUYO01",
      "page_number": "13",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYO02",
      "title": "Control of the Plasma Transversal Losses, Caused by MHD Instabilities, in Open Mirror Magnetic Trap of the ECRIS: Recent Experiments on SMIS 37 Setup",
      "authors": [
        "V. Sidorov",
        "I. Izotov",
        "S. Razin",
        "V. Skalyga",
        "V. Zorin",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "This work is a continuation of the experiments described in [1",
        "2] and aimed at the investigation of the new conceptions of MHD stabilization of plasma in open axisymmetric traps",
        "specifically",
        "it is aimed at the investigation of the shear flow influence on the transport control in open mirror traps. As in previous experiments",
        "shear flow was created by limiter-electrode with bias potential according to the vacuum chamber. Plasma density structure in radial and azimuthal directions was studied. Mode structure of the perturbations was investigated. Substantial sharp shift of the plasma density maximum to the system axis with bias potential growth was demonstrated. It was shown",
        "that the value of the bias potential that corresponds to the plasma density profile shift grows with the magnetic field growth that can be interpreted as the electron temperature growth. Some theoretical estimations of the influence of the transversal losses decrease on plasma parameters were made.",
        "[1] A.Sidorov",
        "P.Bagryansky",
        "A.Beklemishev et al. Trans. Fusion Sci. and Technology",
        "59",
        "112",
        "(2011).  [2] I.Izotov",
        "S.Razin",
        "A.Sidorov et al. Rev. Sci. Instrum.",
        "83",
        "02A318 (2012)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuyo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuyo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuyo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUYO02",
      "page_number": "18",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYO03",
      "title": "Secondary-electron-enhanced Plasma as an Alternative to Double/Variable-frequency Heating in ECRIS",
      "authors": [
        "IKF",
        "Frankfurt-am-Main",
        "Germany",
        "S. Dobrescu",
        "L. Schächter",
        "IFIN",
        "Magurele- Bucuresti",
        "Romania",
        "As \"double frequency heating\" (DFH) now has become the method of choice to optimize the output from the newest generation ECRIS",
        "it was a challenge to compare this method with the comparatively cheap method of \"metal dielectric\" (MD) structures introduced into the plasma chamber",
        "which has also proven to strongly enrich the plasma with electrons that are effectively trapped and heated. Two RF-systems have been launched to the 14 GHz ECRIS",
        "however",
        "not allowing RF-differences as large as 1.5 GHz as demanded for DFH. Therefore the source was operated in a \"frequency tuning\" mode (FT) by optimizing the frequency difference by the output of Ar14+ ions. The data without and with MD-configuration are compared and related to data for the DFH. On the basis of Bremsstrahlung radiation spectroscopy and charge state analysis",
        "it turned out that the FT-mode does not change the source performance substantially. The measured effects are in the order of 20% to 30% as reported elsewhere. In contrast to this",
        "the enhancement gained by the MD method is much higher. The measured enhancement ratios even surpass those reported for real double frequency heating."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuyo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuyo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuyo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUYO03",
      "page_number": "22",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYO04",
      "title": "Neutral Gas Temperature Measurements of a Radio Frequency Micro-thruster",
      "authors": [
        "A.D. Greig",
        "R.W. Boswell",
        "C. Charles",
        "R.P. Hawkins",
        "SP3",
        "Canberra",
        "Australia",
        "M.D. Bowden",
        "Y.C. Sutton",
        "The Open University",
        "Milton Keynes",
        "United Kingdom",
        "A radio frequency (13.56 MHz) capacitively coupled cylindrical argon plasma discharge was analysed using optical emission spectroscopy (OES) for various powers and pressures in the ranges 10 W to 40 W and 0.5 Torr to 5 Torr. Trace amounts of nitrogen were added to the discharge to estimate the temperature of the neutrals using rovibrational band matching of the 2nd positive system of nitrogen and the 1st negative system of nitrogen ions. Comparing simulated computer generated spectra of these bands to experimentally measured spectra determined the rotational and vibrational temperatures of the nitrogen",
        "from which the temperature of the neutrals was inferred by assuming the rotational temperature was the same as the neutral gas temperature."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuyo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuyo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuyo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUYO04",
      "page_number": "25",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZO01",
      "title": "Beam Extraction Results with KAERI 14.5 GHz ECR Ion Source",
      "authors": [
        "B.H. Oh",
        "D.S. Chang",
        "C.K. Hwang",
        "S.R. In",
        "S.H. Jeong",
        "J.-T. Jin",
        "T.S. Kim",
        "C.H. Lee",
        "K.W. Lee",
        "KAERI",
        "Daejon",
        "Republic of Korea",
        "E.-S. Kim",
        "C.S. Seo",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "A 14.5 GHz electron cyclotron resonance ion source has been designed and fabricated at KAERI (Korea Atomic Energy Research Institute) to produce multi-charged ion beams (particularly C6+ ion beams) for medical applications. During the first beam extraction experiments with the developed ion source",
        "it was found that C4+ beam of 15 eμA and Ar15+ beam of 1 eμA were the optimized beam current. A big current loss was made along the beam transport path from the ion source to the entrance port of an analyzing magnet because of long beam line and small acceptance of the magnet. A new Einzel lens is added in the beam line to minimize the beam loss",
        "and the second beam extraction experiments have been made. In this paper the beam experimental results with the KAERI ion source",
        "including the hard X-ray spectrum from the ECR plasma and the emittance measurement results of carbon beam",
        "will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuzo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuzo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuzo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUZO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUZO02",
      "title": "Detailed Investigation of the 4D Phase-Space of an Ion Beam",
      "authors": [
        "H.R. Kremers",
        "J.P.M. Beijers",
        "S. Brandenburg",
        "V. Mironov",
        "S. Saminathan",
        "KVI",
        "Groningen",
        "The Netherlands",
        "A second order transfer matrix is calculated",
        "which is used in the calculation of a 4D phase-space distribution of a 24.6 keV He1+ beam. The calculated distribution matches a 4D phase-space distribution measured with the KVI pepper pot emittance meter. The pepper pot emittance meter is installed in the image plane of a dipole magnet acting as a charge-state analyser directly downstream the KVI AECR ion source. From the second order transfer matrix simple analytical equations are derived by retaining the terms for angular coefficients. These simple equations describe the main features of the phase-space correlations in the image plane. The equations show also that the subset of the 4D phase-space distribution",
        "selected by one pepper pot aperture",
        "results in multiple beam-lets. Due to this successful matrix modelling we conclude that the 4D phase-space distribution measured is fully determined by the ionoptical properties of the magnet."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuzo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuzo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuzo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUZO02",
      "page_number": "30",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZO03",
      "title": "New Extraction Design for the JYFL 14 GHz ECRIS",
      "authors": [
        "V. Toivanen",
        "T. Kalvas",
        "H. A. Koivisto",
        "J.P.O. Komppula",
        "O.A. Tarvainen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "A new extraction system has been designed and constructed for the JYFL 14 GHz ECRIS at the Department of Physics",
        "University of Jyväskylä (JYFL). The goal of the new design is to improve the performance of the ion source and increase the transmission efficiency of the low energy beam transport and the accelerator. The new extraction system is designed to be able to handle higher beam currents",
        "yield better beam quality and offer more tuning flexibility. The design was made with the aid of simulations performed with the IBSimu code. The suitability of the code for this task was verified by simulating the old extraction system and good agreement between simulations and measurements was achieved. The new extraction system has been constructed",
        "installed and tested. The new design",
        "simulations and the first measurement results will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuzo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuzo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuzo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUZO03",
      "page_number": "34",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZO04",
      "title": "Space Charge Compensation Measurements of Multicharged Ion Beams Extracted from an ECR Ion Source",
      "authors": [
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "D.G. Cole",
        "D. Leitner",
        "G. Machicoane",
        "F. Marti",
        "L. Tobos",
        "NSCL",
        "East Lansing",
        "Michigan",
        "USA",
        "Space charge compensation* due to the interaction of the beam with residual gas molecules is a well-known phenomenon for high current injector beam lines. For beam lines using mostly magnetic focusing elements and for pressure above 10-6 mbar",
        "full neutralization has been observed. However",
        "due to the low pressure required for the efficient transport of high charge state ions",
        "beams in ECR injector lines are typically only partly neutralized. With the performance increase of the next generation ECR ion sources it is possible to extract tens of mA of beam current. In this high current regime",
        "non-linear focusing effects due to the space-charge potential of the beam become more and more important. In order to develop a realistic simulation model for low energy beam transport lines",
        "it is important to estimate the degree of space charge compensation. In this contribution we report on measurements of the beam potential (and neutralization)",
        "performed after the extraction region of the ECR ion source",
        "in dependence of the base pressure in the beam line and other source parameters using a Retarding Field Analyzer (RFA). Results are discussed and compared to simulations.",
        "* When the beam interacts with the residual gas",
        "electrons are separated from gas molecules and accumulate inside the beam envelope",
        "thereby compensating the space-charge (aka neutralization)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuzo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuzo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuzo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUZO04",
      "page_number": "38",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP01",
      "title": "Quantitative Determination of 146Sm/147Sm Ratios by Accelerator Mass Spectrometry with an ECR Ion Source and Linear Acceleration for 146Sm Half-Life Measurement",
      "authors": [
        "UTTAC",
        "Tsukuba",
        "Ibaraki",
        "Japan",
        "P. Collon",
        "Y. Kashiv",
        "D. Robertson",
        "C.J. Schmitt",
        "X.D. Tang",
        "University of Notre Dame",
        "Indiana",
        "USA",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "C. Deibel",
        "B. DiGiovine",
        "J.P. Greene",
        "D. Henderson",
        "C.L. Jiang",
        "S.T. Marley",
        "R.C. Pardo",
        "E. Rehm",
        "R.H. Scott",
        "R.C. Vondrasek",
        "ANL",
        "Argonne",
        "USA",
        "T. Nakanishi",
        "A. Yokoyama",
        "Kanazawa University",
        "Kanazawa",
        "Japan",
        "The Hebrew University of Jerusalem",
        "The Racah Institute of Physics",
        "Jerusalem",
        "Israel",
        "The alpha-decaying 146Sm nuclide is used for chronology of the Solar System and silicate mantle differentiation in planets. We performed a new determination of 146Sm half-life by measuring 146Sm/147Sm alpha activity and atom ratios in 147Sm activated via (g",
        "n)",
        "(n",
        "2n) and (p",
        "2n) reactions and obtained a value (68 Myr)",
        "smaller than that adopted so far (103 Myr)",
        "with important geochemical implications*. The experiment required determination of 146Sm/147Sm ratios by high-energy (6 MeV/u) accelerator mass spectrometry to discriminate 146Sm from isobaric 146Nd contaminant. Activated Sm targets were dissolved",
        "chemically purified and reconverted to metallic Sm. Sputter cathodes",
        "made by pressing the Sm metal into high-purity Al holders",
        "were used to feed the Argonne ECR ion source. 146Sm22+",
        "147Sm22+ ions were alternately injected and accelerated with the ATLAS linac by proper scaling of ion source and accelerator components. A tightly-fitted quartz cylindrical liner was inserted in the ECR plasma chamber to reduce contamination from the walls. 146Sm ions were eventually counted in a gas-filled magnet and 147Sm ions either measured as charge current or counted after proper attenuation.",
        "* N. Kinoshita et al.",
        "Science 334",
        "1614 (2012)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP01",
      "page_number": "43",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP03",
      "title": "Integration of a Third Ion Source for Heavy Ion Radiotherapy at HIT",
      "authors": [
        "T.W. Winkelmann",
        "A.B. Büchel",
        "R. Cee",
        "A. Gaffron",
        "Th. Haberer",
        "J.M. Mosthaf",
        "B. Naas",
        "A. Peters",
        "J. Schreiner",
        "HIT",
        "Heidelberg",
        "Germany",
        "HIT is the first European hospital based facility for scanned proton and heavy ion radiotherapy. In 2009 the clinical operation started",
        "since then more than 800 patients were treated in the facility. In a 24/7 operation scheme two 14.5 GHz electron cyclotron resonance ion sources are routinely used to produce protons and carbon ions. In the near future a helium beam for regular patient treatment is requested. The modification of the low energy beam transport line (LEBT) for the integration of a third ion source into the production facility was done in winter 2011. For beam quality improvement with a smaller emittance at the same current we designed and tested a new extraction system at the testbench and equipped the source for protons and helium with this optimized system. This paper will present results of the LEBT modification and gives an outlook to further enhancements at the HIT ion source testbench."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP03",
      "page_number": "46",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP04",
      "title": "Design of a Compact ECR Ion Source for Various Ion Production",
      "authors": [
        "M. Muramatsu",
        "S. Hojo",
        "Y. Iwata",
        "K. Katagiri",
        "A. Kitagawa",
        "Y. Sakamoto",
        "S. Sato",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "KVI",
        "Groningen",
        "The Netherlands",
        "National Institute of Radiological Sciences",
        "Chiba",
        "Japan",
        "Compact ECR ion source with all permanent magnets",
        "so called Kei2",
        "was developed for high energy carbon ion therapy facility at National Institute of Radiological Sciences. Kei2 source was design for production of only carbon ion for medical treatment. A copy of Kei2",
        "so called KeiGM is used for Gunma University. Kei series are optimized for carbon ion production. In order to produce various ion beams for research",
        "we design a new compact ECR ion source",
        "so called Kei3. Kei3 is designed based on previous Kei series. In addition",
        "there are three important points: 1) Movable beam extraction system for various extraction current densities",
        "2) An evaporator and MIVOC method for production of ions from solid materials and metal",
        "and 3) Biased disk method and double frequency heating method for heavier ions. Same permanent magnets and microwave system will be used for easy maintenance and the cost effectiveness. Design of the Kei3 source will be described in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP04",
      "page_number": "49",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP05",
      "title": "Charge-breeding at the Texas A&M University Cyclotron Institute",
      "authors": [
        "Texas A&M University Cyclotron Institute",
        "College Station",
        "Texas",
        "USA",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "Texas A&M University",
        "Cyclotron Institute",
        "College Station",
        "USA",
        "The Cyclotron Institute of Texas A&M University is currently involved in an upgrade that is intended to produce beams of radioactive ions suitable for injection into the K500 superconducting cyclotron. As an integral part of this upgrade an electron-cyclotron-resonance ion source (CB-ECRIS) has been specially constructed by Scientific Solutions of San Diego",
        "California for charge-breeding. This CB-ECRIS operates at 14.5 GHz and incorporates a hexapole of the Halbach style. Since radial injection of microwave power is ruled out",
        "this presents special problems for the axial injection of low-charge-state ions for charge-breeding. Efforts at charge-breeding with stable ions will be presented as well as plans for the injection of low-charge-state",
        "radioactive ions from cyclotron-driven ion guides",
        "one for light radioactive ions and one for heavy radioactive ions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp05.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP05",
      "page_number": "51",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP08",
      "title": "Design Report of the AISHA Ion Source for Hadron Therapy Facilities",
      "authors": [
        "G. Ciavola",
        "L. Andò",
        "L. Celona",
        "S. Gammino",
        "D. Mascali",
        "INFN/LNS",
        "Catania",
        "Italy",
        "CNAO Foundation",
        "Milan",
        "Italy",
        "CSFNSM",
        "Catania",
        "Italy",
        "Different facilities for hadrontherapy have been built or designed in the recent past and Italy is present in the field either with synchrotron-based and with cyclotron-based facilities. For both types of accelerators the availability of high brightness multiply charged ion beams is essential and R&D efforts in this subject are increasing. In particular at the CNAO",
        "proton and carbon ion beams will be accelerated up to 400 AMeV by a synchrotron and the beam injection is guaranteed by two identical ECR sources of the SUPERNANOGAN family modified according to the specifications we set. Optimisation of beam emittance and intensity is of primary importance to obtain the necessary current in the RFQ-LINAC and future facilities may require much better performances in terms of beam brightness than the ones provided by such commercial ECRIS. A hadron therapy center is going to be built in Catania and the R&D related to the injector has already started within the frame of a collaboration between the Regional Authority and INFN. The results of the research carried out at INFN-LNS will be presented along with the design of a relatively compact ECR ion source operating at 18 GHz",
        "named AISHA."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp08.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP08",
      "page_number": "54",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP10",
      "title": "Operational Experience with the GTS-LHC Ion Source and Future Developments of the CERN Ion Injector",
      "authors": [
        "D. Küchler",
        "G. Bellodi",
        "A.M. Lombardi",
        "M. O'Neil",
        "R. Scrivens",
        "J.T. Stafford-Haworth",
        "CERN",
        "Geneva",
        "Switzerland",
        "iThemba LABS",
        "Somerset West",
        "South Africa"
      ],
      "institutions": [],
      "abstract": "Since 2010 the GTS-LHC source delivers lead ions for heavy ion physics at the LHC. Several modifications allowed improving the source reliability and the beam stability. The attempts to improve the beam intensity were less successful. The different modifications and actual performance figures will be presented in this paper. In addition to the heavy ion physics program of the LHC new ion species will be requested for different experiments in the future. The fixed target experiment NA61 requires primary Argon and Xenon beams. And a future radio-medical facility asks for light ions in the range Helium to Neon. Approaches to prepare these beams and to modify the ion injector towards a light ion front end are presented.",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp10.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP10",
      "page_number": "57",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP12",
      "title": "Design of Web-based Interface to RIKEN 28 GHz Super-conducting ECR Ion Source and the Future Plan",
      "authors": [
        "Sokendai",
        "Ibaraki",
        "Japan",
        "KEK",
        "Ibaraki",
        "Japan",
        "Y. Higurashi",
        "M. Komiyama",
        "T. Nakagawa",
        "K. Ozeki",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "A new RIKEN 28 GHz superconducting ECR ion source (28 GHz-ECRIS) was constructed in 2009 in order to increase the intensity of Uranium ion beam for RIKEN RI beam factory project(RIBF). For effective and stable operation of the 28 GHz-ECRIS",
        "its client system should have an user-friendly man-machine interface. The ECRIS control system was constructed with the Experimental Physics and Industrial Control System (EPICS) as well as RIBF control system. As a result",
        "it was successful to provide the useful clients",
        "such as the operation GUI panels",
        "the XY chart application",
        "and the data acquisition system in EPICS-based system. On the other hand",
        "to keep beam quality from 28 GHz-ECRIS for a long beam service term",
        "it should be possible to operate the ECRIS by members of ion source team at any time. In order to relieve concern in the overseas business trip of members of ion source team",
        "we designed a real-time web-based client system using WebSocket*",
        "which is a new protocol presented by Internet Engineering Task Force (IETF). In this paper",
        "we report the system and development status in detail.",
        "* I. Fette and A. Melnikov. The WebSocket Protocol",
        "IETF HyBi Working Group. 2011."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp12.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP12",
      "page_number": "61",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP13",
      "title": "Development of Intense Proton ECR Ion Sources at IMP",
      "authors": [
        "Z.M. Zhang",
        "Z.W. Liu",
        "H.Y. Ma",
        "L.T. Sun",
        "Q. Wu",
        "Y. Yang",
        "W.H. Zhang",
        "X.Z. Zhang",
        "H.W. Zhao",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "Since 1997",
        "there have been two ECR ion sources for producing intense proton beam developed at Institute of Modern Physics (IMP). In 1999",
        "a high current 2.45 GHz ECR proton source for Lanzhou university neutron generator",
        "was constructed and tested at IMP. A mixed ion (H1+ + H2+ + H3+) beam current of 110 mA with CW mode was delivered from a single aperture of 6mm diameter with microwave power of 600 W at the extraction voltage of 22 kV. Recently a new pulsed proton source has been designed and built at IMP for the CPHS (Compact Pulse Hadron Source) facility in Tsinghua University. Now this source is under commissioning for 60 mA proton beam with 50 keV energy. The long time running stability and beam emittance have been tested and the results are well up to the requirements of CPHS. In this paper",
        "after a short review of the proton ion source for Lanzhou University",
        "the design and test results of the CPHS proton source as well as the LEBT will be presented. The design of the proton ion source and the LEBT for the Chinese ADS project will also be discussed in the contents."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp13.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP13",
      "page_number": "64",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP14",
      "title": "Beam Experiments with the Grenoble Test Electron Cyclotron Resonance Ion Source at iThemba LABS",
      "authors": [
        "R.W. Thomae",
        "J.L. Conradie",
        "D.T. Fourie",
        "iThemba LABS",
        "Somerset West",
        "South Africa",
        "CERN",
        "Geneva",
        "Switzerland",
        "At iThemba Laboratory for Accelerator Based Sciences a copy of the so-called Grenoble Test Source (GTS) for the production of highly charged ions is installed. The source in combination with the K-200 cyclotron delivers high energy",
        "high intensity beams for nuclear physics experiments. In this paper we present beam experiments with the GTS at iThemba LABS",
        "in which the results of CW",
        "pulsed and afterglow operation for different bias disc voltages and positions are compared."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp14.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP14",
      "page_number": "68",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP17",
      "title": "Installation and Operation of a 28 GHz Gyrotron for the RIKEN Superconducting ECR Ion Source",
      "authors": [
        "J. Ohnishi",
        "Y. Higurashi",
        "T. Nakagawa",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "The RIKEN 28-GHz ECRIS uses a gyrotron microwave source fabricated by Mitsubishi Electric Corporation. The maximum output power is 10 kW. The gyrotron produces TE02-mode microwaves",
        "which are converted into the TE01 mode by a mode converter. In the first test on the gyrotron performed using a dummy load",
        "we observed the 50-300 Hz ripples of ~500 W in the output power of 1-7 kW",
        "and it was difficult to make a stable operation in the low-power. These ripples were reduced to one-tenth by stabilizing the cathode voltage and then the gyrotron could produce microwaves from < 0.5 kW stably. The operation of the ion source with the 28 GHz gyrotron was started in 2011 and the ion source supplied U and Xe beams to the RIBF for two months. The power of the microwaves fluctuated slowly in the range of 870-1250 W",
        "which influenced the beam current from the ion source. This fluctuation was caused by a slight change of the current of the solenoid of the gyrotron depending on the room temperature. We replaced the power supply with new one which has a current stability of 10ppm per day",
        "and stabilized the microwave power in the range of 5% in the operation of 2 kW successfully."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp17.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP17",
      "page_number": "71",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPP18",
      "title": "DECRIS-5 Ion Source for DC-110 Cyclotron Complex Results of the First Tests",
      "authors": [
        "A.A. Efremov",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "Yu.K. Kostyukhov",
        "N. Lebedev",
        "V.N. Loginov",
        "Yu. Yazvitsky",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "KVI",
        "Groningen",
        "The Netherlands",
        "The project of the DC-110 cyclotron facility to provide applied research in the nanotechnologies (track pore membranes",
        "surface modification of materials",
        "etc.) has been designed by the Flerov Laboratory of Nuclear Reactions of the Joint Institute for Nuclear Research (Dubna). The facility includes the isochronous cyclotron DC-110 for accelerating the intense Ar",
        "Kr",
        "Xe ion beams with 2.5 MeV/nucleon fixed energy. The cyclotron is equipped with system of axial injection and ECR ion source DECRIS-5",
        "operating at the frequency of 18 GHz. The main parameters of DECRIS-5 ion source and results of the first tests are presented in this report."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tupp18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tupp18.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tupp18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUPP18",
      "page_number": "74",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXO01",
      "title": "Ion Beam Formation in Expanding Plasmas and its  Application to Plasma Thrusters",
      "authors": [
        "SP3",
        "Canberra",
        "Australia",
        "For the past few decades",
        "Direct Current (DC)",
        "radiofrequency (RF) and microwave plasma sources have been used for materials processing",
        "materials diagnostics and electric propulsion in space. When terminated by a series of biased grids on one side",
        "these sources can produce accelerated ion beams (which need to be neutralized) and thrust as shown by successful space missions (e.g. DC Kaufman thruster",
        "RF Artemis thruster and microwave Hayabusa thruster). When open to vacuum or space on one side (no grid or electrode)",
        "plasma expansion occurs. The geometric and/or magnetic expansion leads to ion acceleration with sufficient electrons to provide quasi-neutrality. Applying a divergent magnetic field may lead to the spontaneous formation of an electric double layer",
        "a sudden drop of potential within a plasma. In the laboratory",
        "low energy large area ion beams accelerated by current-free double layers produced by RF plasma sources have been created using a variety of gases (Ar",
        "O2",
        "H2",
        "CO2",
        "Xe",
        "Kr",
        "CH4",
        "NH3",
        "N2O) and used in the production of surfaces with a variable degree of hydrophobicity and as a source of thrust in the development of new space engines."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wexo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wexo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wexo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEXO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXO02",
      "title": "Recent Developments and Electron Density Simulations at the ATOMKI 14.5 GHz ECRIS",
      "authors": [
        "S. Biri",
        "R. Rácz",
        "ATOMKI",
        "Debrecen",
        "Hungary",
        "University Debrecen",
        "Debrecen",
        "Hungary",
        "The 14.5 GHz ECR ion source of ATOMKI is a standard room-temperature ECRIS devoted for plasma diagnostic studies",
        "for atomic physics research and also serves as a particle source with wide range of elements for surface treatments. From the beginning lots of technical modifications and developments have been carried out on the ion source. The changes aimed the increasing of the beams charge",
        "intensity and the widening of the ion choice. Other modifications were done to develop special",
        "non-standard operation modes or to produce peculiar plasmas or beams. Recently the original NdFeB hexapole was exchanged by a new one and new iron plugs were calculated",
        "designed and installed at the injection side of the source. The resulted stronger magnetic trap has shown significant effect on the beam intensity and on the charge states distribution. The new magnetic configuration was re-calculated by the TrapCAD code developed by our group. The spatial movement and energy evolution of a high number of electrons were followed in the calculation. A post-calculation energy filtering carried out for the lost and non-lost electrons reveals numerous interesting and important information in 3D."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wexo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wexo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wexo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEXO02",
      "page_number": "77",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXO03",
      "title": "Numerical Modeling of Ion Production in ECRIS by using the Particle-in-Cell Method",
      "authors": [
        "V. Mironov",
        "J.P.M. Beijers",
        "KVI",
        "Groningen",
        "The Netherlands",
        "To better understand the physical processes in ECRIS plasmas",
        "we developed a Particle-in-Cell code that follows the ionization and diffusion dynamics. The basic features of the numerical model are given elsewhere*. An electron temperature of about 1 keV is needed to reproduce the experimentally observed performance of our 14 GHz ECR source. We assume that a pre-sheath is located outside the ECR zone",
        "where the ion acceleration toward the walls occurs. Electric field inside the ECR zone is supposed to be zero. The ion production is modeled assuming the ion confinement by a ponderomotive barrier formed at the boundary of the ECR zone. The barrier height is defined by the RF radiation density at the electron resonance layer and is taken as an adjustable parameter; when the plasma becomes overdense",
        "we set the barrier value to zero. With these assumptions",
        "we are able to reproduce the main features of ECRIS performance",
        "such as the saturation and decrease of highest charge state currents with increasing gas pressure",
        "as well as response to an increase of injected RF power. Afterglow and frequency-tuning effects can be explained by introducing the ponderomotive barrier.",
        "* V. Mironov and J. P. M. Beijers",
        "\"Three-dimensional simulations of ion dynamics in the plasma of an electron cyclotron resonance ion source\"",
        "Phys. Rev. ST Accel. Beams 12",
        "073501 (2009)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wexo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wexo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wexo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEXO03",
      "page_number": "82",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXO04",
      "title": "Proton Beams Formation from Dense Plasma of ECR Discharge sustained by  37.5 GHz Gyrotron Radiation",
      "authors": [
        "V. Skalyga",
        "I. Izotov",
        "S. Razin",
        "V. Sidorov",
        "V. Zorin",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "T. Kalvas",
        "H. A. Koivisto",
        "O.A. Tarvainen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "Operation of modern high power accelerators often requires production of intense beams of hydrogen ions. Newer facilities aiming at outperforming the previous generation accelerators are usually designed for higher beam currents. Meeting the demand for hydrogen ion beams with higher intensity and low transverse emittance is",
        "therefore",
        "becoming increasingly difficult problem. Present work is devoted to experimental investigation of proton beams production from dense plasma (Ne>1013 cm-3) of ECR discharge sustained by 37.5 GHz",
        "100 kW gyrotron radiation at SMIS 37 facility at IAP RAS. Different extraction system configurations were used. It was demonstrated that ultra bright proton beam with 4.5 mA current and 0.1 π·mm·mrad normalized emittance (brightness=45 A/(π·mm·mrad)2) can be formed with 1-hole (1 mm in diameter) extraction. For production of high current beams a 13-hole extractor was used. 200 mA and 1.1 π·mm·mrad normalized emittance proton beam was obtained. A possibility of further beam parameters enhancement by developing of extraction system and its power supply is discussed. It was shown that in generated proton beams H2+ component was less than 6%."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wexo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wexo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wexo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEXO04",
      "page_number": "85",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXO05",
      "title": "Effect of  Source Tuning Parameters on the Plasma Potential of Heavy Ions  and its Influence on the Longitudinal Optics of the High Current Injector",
      "authors": [
        "G.O. Rodrigues",
        "D. Kanjilal",
        "P.S. Lakshmy",
        "A. Mandal",
        "Y. Mathur",
        "A. Roy",
        "IUAC",
        "New Delhi",
        "India",
        "IGCAR",
        "Channai",
        "India",
        "Plasma potentials for various heavy ions have been measured using the retarding field technique in the 18 GHz High Temperature Superconducting ECR ion source",
        "PKDELIS. The influence of various source parameters viz.",
        "RF power",
        "gas pressure",
        "magnetic field",
        "negative DC bias and gas mixing on the plasma potential is studied. It is observed that the plasma potentials are decreasing for increasing charge states and a mass effect is clearly observed for the ions with similar operating gas pressures. In the case of gas mixing",
        "it is observed that the plasma potential minimises at an optimum value of the gas pressure of the mixing gas and the mean charge state maximises at this value. The energy spread arising from the plasma potential influences the longitudinal optics of the high current injector in terms of increased phase spread which deteriorates the transmission through the RFQ. Details of the measurements carried out as a function of various source parameters and its impact on the longitudinal optics are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wexo05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wexo05.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wexo05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEXO05",
      "page_number": "90",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYO01",
      "title": "The Einzel Lens Longitudinal Chopper",
      "authors": [
        "K. Takayama",
        "T. Adachi",
        "KEK",
        "Ibaraki",
        "Japan",
        "T. Adachi",
        "K.W. Leo",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "The Einzel lens longitudinal chopper [1] placed just after the ECRIS has been developed for the KEK digital accelerator [2] and is being operated without trouble over more than 1 year. Propagation of a msec-long ion pulse extracted with the ECRIS extraction voltage V1",
        "is fully controlled by superimposing a rectangular-shape pulse voltage V2 (<0) on the fixed Einzel lens voltage V3 (V3 > V1). For most of time region (~msec)",
        "beam propagation is blocked",
        "meanwhile for a time region (~5 μs)",
        "where V2 is on and V2 + V3 < V1",
        "the beam can propagate downstream under the optimized transverse matching condition. Namely",
        "the superimposed voltage V2 + V3 works as a gate voltage. This negative pulse voltage is produced by the solid-state switch driven Marx Generator",
        "promising a fast rising/falling feature in the pulse profile. This chopper enjoys a lot of figure of merits originated from the fact that the beam can be handled at its minimum energy region:  low electron emission",
        "low voltage",
        "low energy X-ray",
        "and  low cost. This type chopper should be expected in a wide variety of ion beam applications. Comparison with other type choppers will be discussed.",
        "[1] T. Adachi",
        "K.W. Leo et al.",
        "\"A Solid-state Marx Generator driven Einzel Lens Chopper\"",
        "Rev. Sci. Inst. 82",
        "083305 (2011). [2] T.Iwashita et al.",
        "\"KEK Digital Accelerator\"",
        "Phys. Rev. ST-AB 14",
        "071301 (2011)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/weyo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/weyo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/weyo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEYO01",
      "page_number": "95",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYO02",
      "title": "Experimental Results: Charge-state and Current-density Distribution at the Plasma Electrode of an ECR Ion Source",
      "authors": [
        "L. Panitzsch",
        "T. Peleikis",
        "M. Stalder",
        "R.F. Wimmer-Schweingruber",
        "IEAP",
        "Kiel",
        "Germany",
        "We have measured the current-density in very close vicinity (15 mm downstream) of the plasma electrode of our hexapole-geometry electron-cyclotron-resonance ion source (ECRIS). For this",
        "we equipped our 3D-movable puller electrode with a customized Faraday Cup (FC) inside. To achieve high spatial resolution we reduced the aperture of the puller electrode to only 0.5 mm. Thus",
        "the source-region of the extracted ion beam is limited to a very small area of the plasma electrode's hole (d = 4 mm). The information about the charge-state distribution and the current density in the plane of the plasma electrode is conserved in the ion beam and was scanned by remotely moving the small-aperture puller electrode (incl. FC) across the aperture of the plasma electrode. From additional m/q- measurements for the different positions we can deduce that different ion charge-states are grouped into bloated triangles of different sizes but with the same orientation in the plane of the plasma electrode with the current density peaking at the centre. This confirms simulations by various groups as well as some emittance measurements",
        "but adds spatial resolution for the different charge-states."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/weyo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/weyo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/weyo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEYO02",
      "page_number": "101",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYO03",
      "title": "Ion Beam Extraction from Magnetized Plasma",
      "authors": [
        "P. Spädtke",
        "R. Lang",
        "J. Mäder",
        "F. Maimone",
        "J. Roßbach",
        "K. Tinschert",
        "GSI",
        "Darmstadt",
        "Germany",
        "With increasing the total extracted current for any ion source",
        "the optimisation of the extraction system becomes more important",
        "because of the space charge effect. Several attempts have been made in the past to simulate the extraction from an Electron Cyclotron Resonance Ion Source (ECRIS) in a correct way. Most of these attempts failed",
        "because they were not able to reproduce the experimental results. The best model up to now is given by the following procedure: tracing the magnetic field lines through the extraction aperture",
        "looking where these field lines are coming from; using these coordinates of the magnetic field line as starting points for ions to be extracted; the initial current of each trajectory is determined by theoretical assumptions about the plasma or by a plasma simulation; Child's law is applicable locally only in direction of the magnetic field",
        "if no emission limited flow is present."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/weyo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/weyo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/weyo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEYO03",
      "page_number": "106",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZO01",
      "title": "Status of the SEISM Experiment",
      "authors": [
        "M. Marie-Jeanne",
        "J. Angot",
        "P. Balint",
        "C. Fourel",
        "J. Giraud",
        "J. Jacob",
        "T. Lamy",
        "L. Latrasse",
        "P. Sortais",
        "T. Thuillier",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "C. Daversin",
        "F. Debray",
        "C. Trophime",
        "S. Veys",
        "GHMFL",
        "Grenoble",
        "France",
        "I. Izotov",
        "V. Skalyga",
        "V. Zorin",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "LPSC and LNCMI (Laboratoire National des Champs Magnétiques Intenses) of Grenoble have developed the first and unique magnetic confinement structure in the world that allows a closed 60 GHz ECR zone",
        "using high field magnet technologies. The magnetic structure has been validated for 28 GHz resonance and a closed 1 T iso-B surface was measured. Calculated and measured field maps were carefully compared in order to determine an operation range for 28 GHz plasma tests. A whole test bench",
        "including high pressure water for helix cooling",
        "intense currents (up to 15 kA) for helix powering and a beam line with mass separation is under construction at LNCMI. This contribution presents the status of the experiment",
        "hopefully including the results of the first beam tests scheduled in September. The 350 kW - 60 GHz gyrotron has been built at IAP",
        "the status of its operation will be shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wezo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wezo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wezo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEZO01",
      "page_number": "111",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZO02",
      "title": "Design of new 18 GHz ECR for RIKEN RIBF",
      "authors": [
        "K. Ozeki",
        "Y. Higurashi",
        "T. Nakagawa",
        "J. Ohnishi",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "In RIKEN RIBF",
        "we plan to install a new 18 GHz ECR ion source",
        "which supply the intense beam of highly charged heavy ion beam into the linear accelerator RILAC. By equipping two ion sources",
        "it is expected to be able to develop new beams while we produce the beam for the experiment of RIBF. Based on the structure of 18 GHz ECR ion source which have been developed in RIKEN",
        "this ion source has additional features as follows: Owing to three solenoid coils",
        "Bext can be adjusted while Bmin is fixed to an optimum value.  We adopt the variable frequency (17.2-18.4 GHz) RF power source. Therefore",
        "further enhancement of the beam intensity is expected because the frequency band suited to a size of plasma chamber is selectable",
        "In order to simplify the maintenance work",
        "we improved a structure of the chamber. In this contribution",
        "we report the design of new ion source in detail."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wezo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wezo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wezo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEZO02",
      "page_number": "114",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZO03",
      "title": "Recent Results of PHOENIX V2 and New Prospects  with PHOENIX V3",
      "authors": [
        "T. Thuillier",
        "J. Angot",
        "T. Lamy",
        "M. Marie-Jeanne",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "C. Barue",
        "C. Canet",
        "M. Dupuis",
        "P. Lehérissier",
        "F. Lemagnen",
        "L. Maunoury",
        "O. Osmond",
        "GANIL",
        "Caen",
        "France",
        "IN2P3 IPNL",
        "Villeurbanne",
        "France",
        "GSI",
        "Darmstadt",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The 18 GHz PHOENIX V2 ECRIS is running since 2010 on the heavy ions low energy beam transport line (LEBT) of",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wezo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wezo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wezo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEZO03",
      "page_number": "117",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP02",
      "title": "Relationship of Performance and RF Resonance Modes",
      "authors": [
        "T. Hattori",
        "A. Kitagawa",
        "M. Muramatsu",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "RLNR",
        "Tokyo",
        "Japan",
        "The performance of Electron Cyclotron Resonance (ECR) ion source depends on the operation frequency",
        "the magnetic mirror field",
        "the maltipole field",
        "the mirror ratio",
        "the ECR zone and others. We studied the relationship of performance and operation frequency in ECR ion source (HiECR-3). The performance (beam intensity of Ar9+ ion) was measured according to change of frequency from 9.7 to 11.7 GHz in fixed magnetic field of HiECR ion source. We measured resonant frequencies of plasma chamber of HiECR ion source in condition of no plasma (current of mirror coils is zero). The data of intensity of Ar9+ related to measured resonant frequencies. Their resonant modes were checked with a 3D electromagnetic simulator (High Frequency Structure Simulator). As a result",
        "it became clear that the performance of the ion source depends on electric-field distribution of the RF resonant mode."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP02",
      "page_number": "121",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP03",
      "title": "Plasma Instability in the Afterglow of ECR Discharge Sustained in a Mirror Trap",
      "authors": [
        "I. Izotov",
        "A. Mansfeld",
        "V. Skalyga",
        "V. Zorin",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "T. Grahn",
        "T. Kalvas",
        "H. A. Koivisto",
        "J.P.O. Komppula",
        "P. Peura",
        "O.A. Tarvainen",
        "V. Toivanen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "A number of studies have been devoted to the investigations of plasma decay in ECR heated discharges confined in a mirror magnetic trap. The motivation of this work is to study plasma instabilities causing perturbations of ion current during the plasma decay. Present work is devoted to time-resolved diagnostics of non-linear effects observed during the afterglow plasma decay of an 14 GHz Electron Cyclotron Resonance Ion Source (ECRIS) at JYFL operated in pulsed mode. Plasma instabilities causing perturbations of extracted ion current during the decay were observed and studied. It is shown that these perturbations are associated with precipitation of high energy electrons along the magnetic field lines and strong bursts of bremsstrahlung emission. The effect of ion source settings on the onset of the observed instabilities was investigated. Based on the experimental data and estimated plasma properties it is assumed that the instabilities are of cyclotron type. The conclusion is supported by a comparison to other type of plasma devices (SMIS 37",
        "IAP RAS) exhibiting similar characteristics but operating in a different plasma confinement regime."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP03",
      "page_number": "125",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP08",
      "title": "Emittance Measurements for U Ion Beams Produced from RIKEN 28 GHz SC-ECRIS",
      "authors": [
        "K. Ozeki",
        "Y. Higurashi",
        "T. Nakagawa",
        "J. Ohnishi",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "In order to investigate the ion optical parameters of the beam line of RIKEN 28 GHz SC-ECR ion source into the new heavy ion linac (RILAC II)",
        "we measured the emittance of the heavy ion beams form RIKEN 28 GHz SC-ECR ion source. In the test experiments",
        "we observed that the emittance of the U35+ beam was ~100 π·mm·mrad (4 rms emittance)",
        "which is smaller than the acceptance of the accelerator (~160 π·mm·mrad). The emittance with 28 GHz was almost same as that with 18 GHz and independent on the injected RF power (1~2 kW). The size of emittance increased with decreasing the charge state. We also measured the emittance of U and oxygen ions under the same condition. In this experiment we observed that the emittance of oxygen ions was always larger than the U ion beam for same M/q. In this contribution",
        "we report the experimental results for emittance measurement of highly charged U",
        "Xe and O ions from RIKEN 28 GHz SC-ECR ion source in detail."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp08.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP08",
      "page_number": "130",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP13",
      "title": "Development Update of the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp13.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP13",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP14",
      "title": "An Advanced Injection System of Light Ions (AISLI) for Dielectric Wall Accelerator",
      "authors": [
        "S.X. Peng",
        "J. Chen",
        "J.E. Chen",
        "Z.Y. Guo",
        "P.N. Lu",
        "H.T. Ren",
        "Y. Xu",
        "J. Zhao",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "The dielectric wall accelerator (DWA) is a kind of acceleration system that has the ability to accelerate any charge to mass ratio particle with high electric field gradients up to 400 MV/m and very compact dimension",
        "for example d 30 mm x 50 mm. To demonstrate the high gradient tiny acceleration system",
        "a comparable 50 mA/40 keV pulsed H+ converge beam injector is required. Based on the experimental results obtained on the test bench",
        "a six electrodes injector was developed at Peking University (PKU). In this paper we will describe the preliminary experimental results as well as the details of the new compact injector which named as An Advanced Injector System of Light Ions (AISLI)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp14.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP14",
      "page_number": "136",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP15",
      "title": "Metal Ion Beam Production with Improved Evaporation Ovens",
      "authors": [
        "K. Tinschert",
        "R. Lang",
        "J. Mäder",
        "F. Maimone",
        "J. Roßbach",
        "GSI",
        "Darmstadt",
        "Germany",
        "Most of the ion beams delivered by the ECR ion sources at the GSI accelerator facilities are produced from materials in the solid state",
        "which must be transformed into the gaseous state to feed the plasma. The well established method of thermal evaporation has been used by means of two types of resistively heated ovens for metals and solid compounds. The main goal of development is to improve their versatility in terms of lifetime",
        "durability",
        "efficiency",
        "and extended temperature range. Recent investigations and developments include the use of alternative materials for oven components. The main focus has been on the further development of the high temperature oven. A modular construction with improved mechanical dimensional accuracy for more precise and easier mounting has been established. Its optimization for stable long time operation has been continued leading to a lifetime of 6 days for evaporation of Ti at 1750°C. Furthermore the temperature limit could be extended to 2300°C. In addition to the improvements in evaporation technology the technique of microwave frequency tuning could be successfully applied for metal ion operation leading to enhanced ion beam intensities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp15.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP15",
      "page_number": "140",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP16",
      "title": "Experimental Studies on the ALISES Ion Source at CEA Saclay",
      "authors": [
        "O. Tuske",
        "O. Delferrière",
        "Y. Gauthier",
        "R. Gobin",
        "F. Harrault",
        "J.L. Jannin",
        "CEA/DSM/IRFU",
        "France",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "The ALISES ion source was originally designed to reduce beam emittance at RFQ entrance by shortened the length of the LEBT. A wide opened magnetic coil at ground potential produces the fringe field needed for the ECR heating at 2.45 GHz frequency. The first part describes the commissioning of the source: Penning discharges inside the accelerating column make the high voltage power supply collapse. Experimental tests with kapton films while discharges occur",
        "and simulations with OPERA-3D code have shown great similarities to detect the location of those discharges and allow us to make the ion source work. The second part of this paper will present the result of low intensity light ion beam production versus the plasma chamber length and radius. Those very preliminary tests give us indications to reduce the ion source dimensions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp16.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP16",
      "page_number": "143",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP17",
      "title": "A Multi-Sample Changer Coupled to an ECR Source for AMS Experiments",
      "authors": [
        "R.C. Vondrasek",
        "T. Palchan",
        "R.C. Pardo",
        "C.E. Peters",
        "M.A. Power",
        "R.H. Scott",
        "ANL",
        "Argonne",
        "USA"
      ],
      "institutions": [
        "A project using Accelerator Mass Spectrometry (AMS) at the ATLAS facility to measure neutron capture rates on a wide range of actinides in a reactor environment is underway. This project will require the measurement of a large number of samples previously irradiated in the Advanced Test Reactor at Idaho National Laboratory. The AMS technique at ATLAS is based on production of highly-charged positive ions in an electron cyclotron resonance ion source (ECRIS) followed by acceleration in the ATLAS linac. The sample material is introduced into the plasma via laser ablation. This should limit the dependency of material feed rates upon the source material composition as well as minimize cross-talk between samples. A new multi-sample changer has been constructed allowing rapid changes between samples. The sample changer has 20 positions and is capable of moving from one sample to the next in one minute. Details of the sample changer design and operation will be presented."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp17.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP17",
      "page_number": "146",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXO01",
      "title": "Optimization of the New SC Magnetic Structure Design with a Hybrid Magnet",
      "authors": [
        "D. Xie",
        "W. Lu",
        "L.Z. Ma",
        "L.T. Sun",
        "X.Z. Zhang",
        "H.W. Zhao",
        "L. Zhu",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "In the development of the next generation ECRISs",
        "so far either a set of full NbTi or full Nb3Sn magnets has been proposed to construct the magnet system. However",
        "the single set of magnets may not be the optimum in terms of the field strength and configuration. An optimization of the new SC magnetic structure with a set of hybrid magnets (NbTi and Nb3Sn) is being investigated. With the hybrid magnet the optimized new magnetic system is capable of producing field maxima of 9.0 T on axis and 4.0 T at the plasma wall",
        "which are 30 and 10% higher than the previously proposed magnetic structure to be built with a set of full NbTi magnets. In addition",
        "the axial length of the optimized magnetic structure has been slightly shrunk resulting in a more compact system. This new magnetic field profile is high enough for operation frequency up to 56 GHz. The design features and the preliminary force/stress analyses of the optimized new SC magnetic structure will be presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thxo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thxo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thxo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THXO01",
      "page_number": "149",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXO02",
      "title": "Current Developments of the VENUS Ion Source in Research and Operations",
      "authors": [
        "J.Y. Benitez",
        "K.Y. Franzen",
        "C.M. Lyneis",
        "L. Phair",
        "M.M. Strohmeier",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "The VENUS ion source functions as a research and development tool in the ECR community as well as an injector for LBNL's 88-Inch cyclotron. In order to meet the needs of both the ECR community and users at the 88-Inch cyclotron",
        "technology such as ovens and a sputter probe have been developed for introducing metals into the plasma. Using a modified high temperature oven",
        "VENUS has produced 450 eμA of 238U33+ and 400 eμA of 238U34+",
        "twice the required Uranium beam current needed for FRIB. In addition",
        "after upgrading its high voltage capabilities VENUS produced 11emA of 4He2+",
        "a capability that remains unparalleled by other ECR ion sources. In addition to its recent record high intensities VENUS is also being developed to deliver low intensity",
        "ultra high charge state ions for the cocktails beams",
        "where many species are produced simultaneously for use by the BASE Facility. 124Xe43+ is now in regular production for the 16 MeV/u cocktail",
        "and development of 209Bi56+ for the 10 MeV/u cocktail is in progress and has been accelerated through the 88-Inch cyclotron. This paper presents the latest work towards integrating the VENUS ion source into our research and operational goals."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thxo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thxo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thxo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THXO02",
      "page_number": "153",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXO03",
      "title": "Recent RIKEN 28 GHz SC-ECRIS Results",
      "authors": [
        "Y. Higurashi",
        "M. Fujimaki",
        "H. Haba",
        "O. Kamigaito",
        "M. Kidera",
        "M. Komiyama",
        "J. Ohnishi",
        "K. Ozeki",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "T. Aihara",
        "M. Tamura",
        "A. Uchiyama",
        "SHI Accelerator Service Ltd.",
        "Tokyo",
        "Japan",
        "For increasing the beam intensity of highly charged heavy ions at RIKEN RIBF",
        "we constructed new SC-ECR ion source. In the spring of 2011",
        "we injected 28GHz microwave into the ion source and obtained first beam. Since then",
        "we made several test experiments for increasing the beam intensity of highly charged Xe and U ion beam",
        "and produced ~60 eμA of U35+",
        "~90 eμA of U33+ at the injected RF power of ~2 kW using sputtering method. In case of Xe25+",
        "250 euA was obtained at RF power of 1.7 kW. Using sputtering method",
        "we produced U35+ ion beam longer than one month for the RIBF experiment without break. In the beginning of 2012",
        "we installed additional GM-JT refrigerator to increase the cooling power at 4.2 K",
        "then the total cooling power became higher than 9 W. Using it",
        "we can use higher than 8 W of cooling power for heat load due to the absorbed X-rays. In this summer",
        "we will install the new plasma chamber made of Al for increasing the cooling power. We will also use high temperature oven to increase the U vapor. In this contribution",
        "we report the recent modification of the ion source and test experiments for production of U and Xe ion beam."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thxo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thxo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thxo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THXO03",
      "page_number": "159",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXO04",
      "title": "SECRAL status and future challenge",
      "authors": [
        "H.W. Zhao",
        "W. Lu",
        "L.T. Sun",
        "D. Xie",
        "X.Z. Zhang",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "SECRAL",
        "the superconducting ECR ion source at IMP",
        "has been in routine operation for the HIRFL accelerator complex since May 2007. The total operation beam time provided by SECRAL has so far exceeded 9500 hours. In most cases SECRAL has been operating at 18 GHz for the accelerator complex",
        "and only operating at 24 GHz for the very high charge states and very heavy ion beams such as Bi and U beams. Uranium beam was tested at 24 GHz with ion sputtering in which 160 eμA of 238U33+ was produced",
        "and 238U32+ beam was delivered to the accelerator continuously for almost one month. Beam long-term stability and emittance at high rf power of 24 GHz were studied. The operation status and the latest performance of SECRAL ion source will be presented. A new heavy ion accelerator facility HIAF has been proposed at IMP. HIAF requests an ion source capable of producing a pulse beam of 2.0 emA of 238U34+. A next generation superconducting ECR ion source with operating frequency up to 50-60 GHz is under consideration in which a few options for the superconducting magnet configuration are being studied. Technical challenges for the next generation ECR ion source will be reviewed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thxo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thxo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thxo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THXO04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THYO01",
      "title": "Operation of an ECRIS Charge State Breeder at TRIUMF",
      "authors": [
        "F. Ames",
        "R.A. Baartman",
        "P.G. Bricault",
        "K. Jayamanna",
        "A. Mjøs",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "After initial commissioning of the charge state breeder for radioactive ions at the TRIUMF/ISAC facility further tests on the performance of the system have been performed. One of the major problems found was the high background of stable ions from the ECR source",
        "mainly C",
        "N",
        "O",
        "Ar",
        "Fe",
        "Ni",
        "C and Cr. The main source of those is the residual gas and sputtered material from the plasma chamber wall and from the surrounding electrodes. Although their intensity is small it can be orders of magnitude more than the intensity from the radioactive ions. Therefore",
        "the original stainless steel plasma chamber of the Pantechnik PHOENIX ECR source has been exchanged to aluminium with an ultra pure aluminium coating",
        "all electrodes for injection and extraction of the ions have been replaced with aluminium and the iron joke at the extraction side",
        "which is part of the vacuum system in the PHOENIX source has been coated as well. This combined effect has reduced the amount of background ions substantially. Detailed results on the performance of the source after those changes will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thyo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thyo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thyo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THYO01",
      "page_number": "163",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THYO02",
      "title": "LPSC PHOENIX ECR Charge Breeder Beam Optics and Efficiencies",
      "authors": [
        "J. Angot",
        "T. Lamy",
        "M. Marie-Jeanne",
        "P. Sortais",
        "T. Thuillier",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "The PHOENIX ECR charge breeder characteristics (efficiency and charge breeding time) were measured at CERN-ISOLDE and LPSC",
        "they were considered as sufficient to allow its setup on various facilities (TRIUMF-Canada/GANIL-"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thyo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thyo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thyo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THYO02",
      "page_number": "167",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THYO03",
      "title": "Design Status of ECR Ion Sources and LEBT for FRIB",
      "authors": [
        "G. Machicoane",
        "N.K. Bultman",
        "G. Morgan",
        "E. Pozdeyev",
        "X. Rao",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "J.Y. Benitez",
        "C.M. Lyneis",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "The Facility for Rare Isotope Beams at Michigan State University is currently being designed and will provide intense beams of rare isotopes for research in nuclear physics",
        "nuclear astrophysics and study of fundamental interactions. The FRIB driver linac will accelerate all stable isotopes from Oxygen to Uranium to energies beyond 200 MeV/u at beam powers up to 400 kW. In the case of Uranium about 13.3 pμA of U33+ are required from the ion source to reach the maximum beam power on the target. Such current is at the limit of what an ECR ion source can produce and led us to design the FRIB driver linac to accelerate concurrently two charges. The ECR ion source for FRIB will be based on the VENUS ion source developed at Lawrence Berkeley National Laboratory (LBNL). Recent beam measurements done with VENUS have demonstrated that the ion source can actually produce close to 13pμA of U33+ and therefore could possibly meet the current required for FRIB in one charge state. This paper reviews the status of the FRIB ECR ion source and the modifications that have been made to the VENUS ion source design. The Low energy beam line transport (LEBT) will also be presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thyo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thyo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thyo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THYO03",
      "page_number": "172",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THYO04",
      "title": "Performance of the ANL ECR Charge Breeder with Low Mass Beams",
      "authors": [
        "R.C. Vondrasek",
        "S.V. Kutsaev",
        "R.C. Pardo",
        "R.H. Scott",
        "ANL",
        "Argonne",
        "USA",
        "P. Delahaye",
        "L. Maunoury",
        "GANIL",
        "Caen",
        "France",
        "The Californium Rare Ion Breeder Upgrade (CARIBU) of the ATLAS superconducting linac facility aims at providing low-energy and reaccelerated neutron-rich radioactive beams to address key nuclear physics and astrophysics questions. These beams are obtained from fission fragments of a Cf-252 source",
        "thermalized and collected into a low-energy particle beam by a helium gas catcher",
        "mass analyzed by an isobar separator",
        "and charge bred with an ECR ion source for acceleration in ATLAS. The charge breeding program had focused on optimizing beams in the mid-mass range",
        "achieving high charge breeding efficiencies of both gaseous and solid species including 14.7% for the radioactive species 143Ba27+. In an effort to better understand the charge breeding mechanism",
        "we recently focused on the low-mass species sodium and potassium which up to present have been difficult to charge breed efficiently. Charge breeding efficiencies of 10.1% for 23Na7+ and 17.9% for 39K10+ were obtained injecting stable Na+ and K+ beams from a surface ionization source. Details of these studies will be presented as well as simulations detailing the injection of the low charge state beams into the charge breeder."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/thyo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/thyo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/thyo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-THYO04",
      "page_number": "177",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRXA01",
      "title": "High Intensity Beam Production at CEA/Saclay for the IFMIF Project",
      "authors": [
        "R. Gobin",
        "G. Adroit",
        "D. Bogard",
        "N. Chauvin",
        "O. Delferrière",
        "Y. Gauthier",
        "P. Girardot",
        "F. Harrault",
        "J.L. Jannin",
        "D. Loiseau",
        "P. Mattei",
        "A. Roger",
        "F. Senée",
        "O. Tuske",
        "CEA/DSM/IRFU",
        "France",
        "At CEA/Saclay",
        "IRFU institute is in charge of the design",
        "construction and characterization of the 140 mA continuous deuteron Injector for the IFMIF project. This injector includes the source and the low energy beam line (LEBT) with its own diagnostics. The Electron Cyclotron Resonance (ECR) ion source operates at 2.45 GHz and the 2 m long LEBT is based on 2 solenoids. Krypton gas injection in the beam line is foreseen in order to reach a high level of space charge compensation for the beam matching at the RFQ entrance. During the last months hydrogen beam has been produced in pulsed and continuous mode and the beam diagnostics have been installed and commissioned. Recently a 125 mA-100 keV pulsed deuteron beam has been produced with a 1% duty cycle. In this article",
        "the high intensity proton and deuteron beam characterization will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/frxa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/frxa01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/frxa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-FRXA01",
      "page_number": "182",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRXA02",
      "title": "All Permanent Magnet ECR Ion Source Development and Operation Status at IMP",
      "authors": [
        "L.T. Sun",
        "Y. Cao",
        "J.Q. Li",
        "J.Y. Li",
        "B.H. Ma",
        "H. Wang",
        "J.W. Xia",
        "D. Xie",
        "W.H. Zhang",
        "X.Z. Zhang",
        "H.W. Zhao",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "All permanent magnet ECR ion sources have many advantages over traditional ECR ion sources composed of several axial room temperature solenoids and one permanent magnet hexapole magnet",
        "which make them the first choice for many heavy ion facilities and platforms. At IMP",
        "three types of all permanent magnet ECR ion sources have been built for different applications",
        "i.e. the very compact ECR ion source"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/frxa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/frxa02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/frxa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-FRXA02",
      "page_number": "185",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRXA03",
      "title": "Laser Ablation of Actinides into an Electron Cyclotron Resonance Ion Sources for Accelerator Mass Spectroscopy",
      "authors": [
        "T. Palchan",
        "F.G. Kondev",
        "S.A. Kondrashev",
        "C. Nair",
        "R.C. Pardo",
        "R.H. Scott",
        "R.C. Vondrasek",
        "ANL",
        "Argonne",
        "USA",
        "W. Bauder",
        "P. Collon",
        "University of Notre Dame",
        "Indiana",
        "USA",
        "J.F. Berg",
        "T. Maddock",
        "G. Palmotti",
        "M. Salvatores",
        "G. Youinou",
        "INL",
        "Idaho Falls",
        "Idaho",
        "USA",
        "ISU",
        "Pocatello",
        "Idaho",
        "USA",
        "The Hebrew University of Jerusalem",
        "The Racah Institute of Physics",
        "Jerusalem",
        "Israel",
        "CEA Cadarache",
        "Saint Paul Lez Durance",
        "France"
      ],
      "institutions": [],
      "abstract": "A project using accelerator mass spectrometry (AMS) is underway at the ATLAS facility to measure the atom densities of transmutation products present in samples irradiated in the Advanced Test Reactor at INL. These atom densities will be used to infer effective actinide neutron capture cross-sections ranging from Thorium to Califorium isotopes in different neutron spectra relevant to advanced fuel cycles. This project will require the measurement of many samples with high precision and accuracy. The AMS technique at ATLAS is based on production of highly-charged positive ions in an ECRIS followed by injection into a linear accelerator. We use a picosecond laser to ablate the actinide material into the ion source. We expect that the laser ablation technique will have higher efficiency and lower chamber contamination than sputtering or oven evaporation thus reducing 'cross talk' between samples. The results of off-line ablation tests and first results of an accelerate beam generated by the laser coupled to the ECR will be discussed as well as the overall project schedule.",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/frxa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/frxa03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/frxa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-FRXA03",
      "page_number": "190",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRYA01",
      "title": "ECRISs at GANIL Today and Tomorrow",
      "authors": [
        "P. Jardin",
        "O. Bajeat",
        "C. Barue",
        "C. Canet",
        "P. Delahaye",
        "M. Dubois",
        "M. Dupuis",
        "J.L. Flambard",
        "R. Frigot",
        "C. Leboucher",
        "P. Lehérissier",
        "F. Lemagnen",
        "L. Maunoury",
        "O. Osmond",
        "J. Piot",
        "E.K. Traykov",
        "GANIL",
        "Caen",
        "France",
        "IPHC",
        "Strasbourg Cedex 2",
        "France",
        "IN2P3 IPNL",
        "Villeurbanne",
        "France",
        "J. Rubert",
        "T. Thuillier",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "CEA/DSM/IRFU",
        "France",
        "GANIL (Grand accélérateur National d'Ions Lourds) uses ECRIS for producing stable and radioactive ions since more than 20 years. 2 ECR4 type IS deliver intense multi-charged stable ion beams of gaseous and metallic elements to cyclotrons for post acceleration to energies up to 100 A·MeV. A full permanent magnet ECRIS is also used for producing multi-charged radioactive ion beams in the frame of SPIRAL 1 (Système de Production d'Ions radioactifs Accélérés en Ligne",
        "part 1). For atomic physic experiment",
        "a high performance ECRIS named GTS developed at CENG/ Grenoble (France) is currently used to deliver high intensity",
        "high charge state and low energy ion beams. To extend the range of radioactive ion beams available at GANIL",
        "two ISOL (Isotope Separator On Line) projects are underway ("
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/frya01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/frya01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/frya01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-FRYA01",
      "page_number": "195",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRYA02",
      "title": "Status of ECR Ion Sources for Carbon-ion Radiotherapy in Japan",
      "authors": [
        "A. Kitagawa",
        "M. Muramatsu",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "KVI",
        "Groningen",
        "The Netherlands",
        "National Institute of Radiological Sciences",
        "Chiba",
        "Japan",
        "SAGA HIMAT",
        "Saga",
        "Japan",
        "N. Sasaki",
        "W. Takasugi",
        "AEC",
        "Chiba",
        "Japan",
        "E. Takeshita",
        "S. Yamada",
        "Gunma University",
        "Heavy-Ion Medical Research Center",
        "Maebashi-Gunma",
        "Japan",
        "Heavy-ion radiotherapy is successfully carried out at the Heavy Ion Medical Accelerator in Chiba (HIMAC) at the National Institute of Radiological Sciences (NIRS) since 1994. Now three facilities are in operation and two are under construction in Japan. Over 8000 cancer patients have already been treated. 140-400 MeV/u carbon beams were selected for the first clinical trials at HIMAC because carbon is one of the best candidates which gives good localized biological dose distribution for the typical conditions",
        "a depth of 10 - 25 cm and a thickness of several cm. Based on the clinical results",
        "all the patients have been treated by carbon beams at present. The ion source needs to realize a stable carbon beam with the same conditions for daily operation. Since operators are usually not specialists of the ion source",
        "the source should not require complicated manual tuning. In addition",
        "shorter maintenance time and cycle are better for a hospital. ECR ion sources are utilized for such requirements in each facility. We report the recent status of the ECR ion sources at heavy-ion radiotherapy facilities in Japan."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/frya02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/frya02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/frya02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-FRYA02",
      "page_number": "200",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRYA03",
      "title": "ECRIS Related Research and Development Work at JYFL and Some Future Prospects",
      "authors": [
        "H. A. Koivisto",
        "J.E. Ärje",
        "T. Kalvas",
        "J.P.O. Komppula",
        "R.J. Kronholm",
        "J.P. Laulainen",
        "O.A. Tarvainen",
        "V. Toivanen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "Since the last ECR workshop the JYFL ion source group has focused on the plasma research",
        "work on the ion beam formation and transport and development of metal ion beams. The plasma research can be divided into plasma breakdown processes",
        "plasma and ion beam instabilities and afterglow processes. The afterglow and instability experiments will be presented elsewhere in these proceedings [1]. In addition",
        "studies involving in the photoelectric induced electron emission and charge exchange reactions will be briefly discussed and the experiments concerning the resonance properties of empty and plasma loaded cavity will be presented. An improvement in ion beam transport of the JYFL K130 cyclotron facility was achieved as a result of the work performed on ion beam formation. This work will be described in more detailed elsewhere in these proceedings [2]. The MIVOC method and sputtering technique were further studied in order to produce intensive titanium ion beams. As a result",
        "an intensive {50}Ti ion beam was successfully produced with the MIVOC method and interesting behavior regarding the sputtering was noticed."
      ],
      "institutions": [],
      "abstract": "[1] V. Skalyga et al. and O. Tarvainen et al. [2] V. Toivanen et al.",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/frya03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/frya03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/frya03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-FRYA03",
      "page_number": "203",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "stats": {
    "total_sessions": 12,
    "total_papers": 55,
    "scrape_time": "2025-10-10 17:29:51"
  }
}