{
  "session_info": {
    "id": "TUICCC",
    "name": "TUICCC - WG4.2 SRF: Cavity Performance",
    "url": "https://proceedings.jacow.org/erl2017/html/tuiccc.htm"
  },
  "papers": [
    {
      "paper_id": "TUICCC001",
      "title": "High-Q R&D at FNAL",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Modern projects of accelerators for High Energy Physics and FEL accelerators (PIP II",
        "LCLS II",
        "etc.) demand operation of the SRF cavities in CW regime. In this situation",
        "low cryogenic losses are essential. Decrease of the losses or",
        "thus",
        "increase of the cavity unloaded quality factor Q0 allows great savings in capital and operational cost. The new N-doping technique for the SRF cavity processing in order to achieve high Q0 is described",
        "which is now a ready-to-use technology for SRF accelerators. The current implementation of this technique for the LCLS-II cavity production",
        "allow us to present how ultra-high Q-factors can be maintained from the vertical to the horizontal test. In particular",
        "efficient cooling and optimization of shielding design will be discussed to address potential Q degradation from the remnant magnetic fields in the cryomodule. The talk will go through the physics and fundamental studies performed at FNAL that allowed us a) to define the best nitrogen doping treatment which minimizes the Q sensitivity to trapped magnetic field",
        "b) to maximize magnetic flux expulsion based on cavity treatment."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuiccc001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuiccc001.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuiccc001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUICCC001",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUICCC002",
      "title": "Twin-Axis Elliptical Cavity",
      "authors": [
        "F. Marhauser",
        "A. Hutton",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "S.U. De Silva",
        "J.R. Delayen",
        "H. Park",
        "L. Sweat",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA"
      ],
      "institutions": [],
      "abstract": "Energy Recovery Linacs (ERLs) use superconducting RF cavities to accelerate the primary electron beam while the spent electron beam is decelerated in the same cavities to recover the energy. Using separate beam pipes for the accelerated and decelerated beams allows for independent focusing and better merging of the beam from the injector into the ERL. In the frame of a DoE accelerator stewardship program we have designed and built a prototype 1.5 GHz twin-axis single-cell cavity as a proof of principle. Experiences on fabrication techniques and lessons learned will be reported prior to the vertical RF testing.",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuiccc002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuiccc002.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuiccc002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUICCC002",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUICCC003",
      "title": "Cornell ERL CM Performance",
      "authors": [
        "F. Furuta",
        "J. Dobbins",
        "R.G. Eichhorn",
        "M. Ge",
        "G.H. Hoffstaetter",
        "M. Liepe",
        "T.I. O'Connell",
        "P. Quigley",
        "D.M. Sabol",
        "J. Sears",
        "E.N. Smith",
        "V. Veshcherevich",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The main linac prototype cryomodule (MLC) is a key component for the Cornell-BNL ERL Test Accelerator (CBETA) project",
        "which is a 4-turn FFAG ERL under construction at Cornell University. This novel cryomodule is the first SRF module ever to be fully optimized simultaneously for high efficient SRF cavity operation and for supporting very high CW beam currents. After the success of the initial MLC testing",
        "the MLC had been moved into the final location for the first MLC beam test. Cornell ERL high voltage DC gun and Injector Cryomodule were connected to MLC via the entry beam line; the beam stop assembly was also installed as the exit line. In this paper",
        "we summarize the performance of this novel ERL cryomodule including the results of the first beam test and the additional tests focused on RF field stability and cavity microphonics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuiccc003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuiccc003.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuiccc003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUICCC003",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUICCC004",
      "title": "The Potential of Nb/Cu Technology for High Beam Current Applications",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [],
      "abstract": "Particle accelerators with high beam current require not only robust fundamental power couplers that can deliver high power to the accelerating cavities but also thorough handling of losses due to higher order modes induced by the particle beam. Both favour low frequency superconducting RF cavities with big apertures. We present the advantages and limitations of niobium coated copper cavities in comparison to the well-established bulk niobium technology and its potential for high beam current applications such as energy recovery linacs.",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuiccc004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuiccc004.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuiccc004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUICCC004",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:05:27"
}