{
  "session_info": {
    "id": "MOAPP",
    "name": "MOAPP - Project Status Reports 1",
    "url": "https://proceedings.jacow.org/icalepcs2019/html/moapp.htm"
  },
  "papers": [
    {
      "paper_id": "MOAPP01",
      "title": "Control System of SuperKEKB",
      "authors": [
        "H. Kaji",
        "A. Akiyama",
        "T. Naito",
        "T.T. Nakamura",
        "J.-I. Odagiri",
        "S. Sasaki",
        "H. Sugimura",
        "KEK",
        "Ibaraki",
        "Japan",
        "T. Aoyama",
        "M. Fujita",
        "Y. Kuroda",
        "T. Nakamura",
        "K. Yoshii",
        "Mitsubishi Electric System & Service Co.",
        "Ltd",
        "Tsukuba",
        "Japan",
        "K. Asano",
        "M. Hirose",
        "KIS",
        "Ibaraki",
        "Japan",
        "Y. Iitsuka",
        "N. Yoshifuji",
        "EJIT",
        "Hitachi",
        "Ibaraki",
        "Japan",
        "We introduce the control system of the SuperKEKB collider which is based on EPICS. We standardize the CPU module so that we easily maintain our huge control system. Most Input/Output Controllers (IOCs) installed along the 3 km beamline at SuperKEKB are developed with only two kinds of CPU module. In addition to providing standard IOC for individual hardware",
        "we develop some beam operation system which promotes the beam commissioning. The alarm monitoring system",
        "abort trigger system",
        "and Beam Gate system are developed by the control group. The sophisticated Beam Gate system for positron beam controls operation of both damping ring and main ring. It obviously promotes the beam commissioning at those rings. The other highlight is the precisely synchronized control system. It is necessary to realize the highly complicated control of beam injection process. We configure the dedicated network with the Event Timing System and the distributed shared memory. The distant hardware components are synchronously operated with this network. The beam commissioning of SuperKEKB has been started in 2016. The control system supports its fruitful beam operation without serious problem."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/moapp01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/moapp01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/moapp01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOAPP01",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOAPP02",
      "title": "The",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/moapp02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/moapp02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/moapp02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOAPP02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOAPP03",
      "title": "Control System Plans for SNS Upgrade Projects",
      "authors": [
        "S.M. Hartman",
        "K.S. Whitepresenter",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "The Spallation Neutron Source at Oak Ridge National Laboratory is planning two major upgrades to the facility. The Proton Power Upgrade project",
        "currently underway",
        "will double the machine power from 1.4 to 2.8 MW by adding seven additional cryomodules and associated equipment. The Second Target Station project",
        "currently in conceptual design",
        "will construct a new target station effectively doubling the potential scientific output of the facility. This paper discusses the control system upgrades required to integrate these projects into the existing EPICS based control systems used for the machine and neutron instrument beamlines. While much of the control system can be replicated from existing solutions",
        "some systems require new hardware and software. Operating two target stations simultaneously will require a new run permit system to safely manage beam delivery."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/moapp03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/moapp03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/moapp03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOAPP03",
      "page_number": "12",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOAPP04",
      "title": "Status of the National Ignition Facility (NIF) Integrated Computer Control and Information Systems",
      "authors": [
        "G.K. Brunton",
        "A.I. Barnes",
        "J.R. Castro Morales",
        "M.J. Christensen",
        "J. Dixon",
        "M. Fedorov",
        "M.S. Flegel",
        "R. Lacuata",
        "D.W. Larson",
        "A.P. Ludwigsen",
        "D.G. Mathisen",
        "V.J. Miller Kamm",
        "M. Paul",
        "S.L. Townsend",
        "B.M. Van Wonterghem",
        "S. Weaver",
        "E.F. Wilson",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "The National Ignition Facility (NIF) is the world’s most energetic laser experimental facility with 192 beams capable of delivering 2.1 MJ of 500 TW ultraviolet laser light to a target. NIF experiments facilitate the study of extreme physical conditions at temperatures exceeding 100 million K and 100 billion times atmospheric pressure allowing scientists the ability to generate conditions similar to the center of the sun and explore the physics of planetary interiors",
        "supernovae and thermonuclear burn. This year concludes a series of optimizations and enhancements to the control & information systems to sustain the quantity of experimental target shots while developing an enhanced precision diagnostic system to optimize and increase the power and energy capabilities of the facility. In addition",
        "many new system control and diagnostic capabilities have been commissioned to increase the understanding of target performance. This year also concludes a multi-year sustainability project to migrate the control system software to Java. This talk will report on the current status of each of these areas in support of the wide variety of experiments being conducted."
      ],
      "institutions": [
        "Funding: This work performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/moapp04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/moapp04.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/moapp04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOAPP04",
      "page_number": "15",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 18:08:08"
}