{
  "session_info": {
    "id": "TUOZA",
    "name": "TUOZA - Accelerator System and Components",
    "url": "https://proceedings.jacow.org/hiat2018/html/tuoza.htm"
  },
  "papers": [
    {
      "paper_id": "TUOZA01",
      "title": "New Method to Design Magnetic Channels with 2D Optimization tools and Using  Permendur Vanadium",
      "authors": [
        "L. Neri",
        "L. Calabrettapresenter",
        "D. Rifuggiato",
        "INFN/LNS",
        "Catania",
        "Italy",
        "JINR/DLNP",
        "Dubna",
        "Moscow region",
        "Russia",
        "Magnetic channels are used in many cyclotrons to focus the beam radially through crossing of the coils and yoke region. These magnetic channel are generally iron made and use three iron bars to reduce the radial gradient of the cyclotron magnetic field. The current sheet approximation (CSA) was generally used to evaluate their performance. For the new magnetic channel to be used in the upgrading of the k800 cyclotron of the LNS-INFN",
        "we investigate the use of permendur vanadium in alternative to the usual iron to reduce the volume of the bar and mainly the magnetic force. Moreover",
        "using the computer code COMSOL (and CST) the 2D model of the magnetic channels have been optimized using a genetic algorithm and complex geometric configuration. High magnetic gradients with high uniformity and reduced magnetic force were achieved. The preliminary results of our work are presented and discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/hiat2018/talks/tuoza01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hiat2018/papers/tuoza01.pdf",
      "poster_url": "https://proceedings.jacow.org/hiat2018/posters/tuoza01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2018-TUOZA01",
      "page_number": "92",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOZA02",
      "title": "Electromagnetic Force Correction and Their Application in High Energy Physics",
      "authors": [
        "Dalian University",
        "Liaoning Province",
        "People’s Republic of China",
        "As fields’ interaction",
        "electromagnetic force between a charged particle’s boundary intrinsic electrical field (BIEF) and external EM field occurs in their overlapped volume. Upon EM fields nature’s description of both BIEF and external E or B field",
        "and new measurable data on modern facility",
        "the conventional formulas of electrical and Lorentz force",
        "upon the ’point charge’ model and crudity on very limited observation a century ago",
        "are confront to be corrected for agreeing to the integrity of new evidence on both EM fields’ nature and interactive mechanism. Corrected formulas include an effective contributed factor of the external EM field",
        "manifest themselves being related to BIEF’s center-charge velocity but the center-mass’. We made a table to contrast all aspects of the twoes",
        "particularly on applicable capacity in accelerator with no hypotheses involved for matching data. The demonstration strongly suggests the conventional formulas",
        "as crude approximations ones resulted in a misinterpretation on Kaufmann Experiment and fictitious concepts (EM mass & angular momentum etc.) by accumulating the hypothesis",
        "should be replaced by alternatives.",
        "Ji Luo",
        "School of Physics Science and Technology",
        "Dalian University",
        "Dalian",
        "Liaoning Province",
        "P.R.China",
        "116622",
        "logicjiluo@sina.com.cn  Phone:13252992560  Topic: Electromagnetic Dynamics",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hiat2018/talks/tuoza02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hiat2018/papers/tuoza02.pdf",
      "poster_url": "https://proceedings.jacow.org/hiat2018/posters/tuoza02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2018-TUOZA02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 17:37:03"
}