{
  "session_info": {
    "id": "WEOB",
    "name": "WEOB - Beam loss monitors and machine protection",
    "url": "https://proceedings.jacow.org/ibic2018/html/weob.htm"
  },
  "papers": [
    {
      "paper_id": "WEOB01",
      "title": "New Beam Loss Detector System for EBS-ESRF",
      "authors": [
        "L. Torino",
        "K.B. Scheidt",
        "ESRF",
        "Grenoble",
        "France",
        "In view of the construction and the commissioning of the new Extremely Brilliant Source (EBS) ring",
        "a new Beam Loss Detector (BLDs) system has been developed",
        "installed and tested in the present European Synchrotron Radiation Facility (ESRF) storage ring. The new BLD system is composed of 128 compact PMT-scintillator based BLDs",
        "distributed evenly and symmetrically at 4 BLDs per cell",
        "controlled and read out by 32 Libera Beam Loss Monitors (BLMs). The detectors fast response and the versatility of the read-out electronics allow to measure fast losses with an almost bunch-by-bunch resolution",
        "as well as integrated losses useful during the machine operation. In this paper the different acquisition modes will be explained and results obtained during injection and normal operation will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/weob01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/weob01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/weob01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEOB01",
      "page_number": "346",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOB02",
      "title": "RadFET Dose Monitor System for SOLEIL",
      "authors": [
        "N. Hubert",
        "F. Dohou",
        "M. El Ajjouri",
        "D. Pédeau",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France"
      ],
      "institutions": [],
      "abstract": "Soleil is currently testing new dose monitors based on RadFET transistors. This new detector at SOLEIL will provide a measurement of the dose received by equipment that are damaged by the radiations in the storage ring, and to anticipate their replacement. This monitor should be very compact to be placed in tiny areas, sensitive to all kind of radiation and low cost to install many of them around the ring. A readout electronic module is being developed in-house, and a first prototype has been build and installed on the machine. Description of the system and first results recorded on the machine are presented.",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/weob02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/weob02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/weob02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEOB02",
      "page_number": "353",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOB03",
      "title": "The European XFEL Beam Loss Monitor System",
      "authors": [
        "T. Wamsat",
        "T. Lensch",
        "DESY",
        "Hamburg",
        "Germany",
        "The European XFEL MTCA based Beam Loss Monitor System (BLM) is composed of about 470 monitors",
        "which are part of the Machine Protection System (MPS). The BLMs detect losses of the electron beam",
        "in order to protect accelerator components from damage and excessive activation",
        "in particular the undulators",
        "since they are made of permanent magnets. Also each cold accelerating module is equipped with a BLM to measure the sudden onset of field emission (dark current) in cavities. In addition some BLMs are used as detectors for wire- scanners. Experience from the already running BLM system in"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/weob03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/weob03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/weob03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEOB03",
      "page_number": "357",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOB04",
      "title": "Beam Loss Monitoring of ADS and HIRFL",
      "authors": [
        "L. Jing",
        "Z. Du",
        "K. Gu",
        "X.J. Hu",
        "W. Wei",
        "J.X. Wu",
        "H.M. Xie",
        "J. Yan",
        "Y. Zhang",
        "G. Zhu",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "In a real accelerator",
        "the transmission from the source to the target is never 100 %. The fraction of beam particles lost has to be controlled carefully to achieve optimal transmission. The lost beam particles cause some activation of the accelerator components by nuclear reactions. Moreover",
        "the surrounding material can be destroyed by the radiation",
        "as well as by the heating due to the particles’ energy loss. The Beam loss monitor (BLM) is designed to detect secondary reaction products",
        "which be mounted outside of the vacuum pipe at crucial locations. A large variety of beam loss monitors (such as diamond",
        "silicon",
        "plastic scintillator and ionization chamber) were tested at the ADS and HIRFL of IMP (Lanzhou",
        "China). The beam loss processes being made by adjusting the scraper and the kicker are described briefly."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/weob04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/weob04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/weob04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEOB04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:47:23"
}