{
  "session_info": {
    "id": "FRCOBAB",
    "name": "FRCOBAB - Feedback Systems",
    "url": "https://proceedings.jacow.org/ICALEPCS2013/html/frcobab.htm"
  },
  "papers": [
    {
      "paper_id": "FRCOBAB01",
      "title": "Feedback and Feed-Forward Systems Improve the Reliability and Performance of the Heidelberg Ion Beam Therapy Center",
      "authors": [
        "Th. Haberer",
        "S. Brons",
        "E. Feldmeier",
        "J. Naumann",
        "R.E. Panse",
        "A. Peters",
        "C. Schömers",
        "HIT",
        "Heidelberg",
        "Germany",
        "The linac-synchrotron-system of the Heidelberg Ion Beam Therapy Centre (HIT) routinely delivers pencil beams to the dose delivering rasterscanning devices at 3 treatment rooms",
        "including the worldwide first scanning ion gantry and 1 experimental cave. At HIT the quality-assured library of pencil beam parameters covers roughly 100.000 combinations of the ion",
        "energy",
        "intensity and beam size. In addition",
        "the world-wide first scanning ion gantry allows for 0.1 degree entrance angle selection. Each patient-specific treatment plan defines a subset of these pencil beams being subsequently requested during the dose delivery. Aiming at shortened irradiation times",
        "improved reliability and optimum dose-delivery precision an upgrade program making heavy use of feed-forward as well as feed-back mechanisms is under way. Driven by patient-specific data out of the scanning beam dose delivery process central synchrotron and beam transfer line components are coupled to the therapy control system in order to tailor the beam characteristics in real-time to the clinical requirements. The paper will discuss the functional upgrades and report about the impact on the medical application at HIT."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcobab01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcobab01.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcobab01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOBAB01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FRCOBAB02",
      "title": "Ultra-fast Longitudinal Feedbacks for the European XFEL",
      "authors": [
        "H. Schlarb",
        "S. Pfeiffer",
        "Ch. Schmidt",
        "DESY",
        "Hamburg",
        "Germany",
        "Free Electron Lasers",
        "like the European XFEL",
        "a 3.5 km long accelerator complex under construction in Hamburg",
        "put stringent demands on the stabilization and the control of the electron beam properties. The pulsed superconducting RF accelerator of the European XFEL can provide more than thirty thousand Angstrom wavelength laser pulses per second to various types of X-ray user experiments. Ideally",
        "these laser pulses have constant properties from shot-to-shot",
        "such as central wavelength",
        "duration",
        "arrival-time and intensity. However",
        "to meet these goals",
        "multiple slow- and fast-feedback loops acting on the RF system have to operate in concert. In this paper",
        "the new MTCA.4 based hardware architecture",
        "MIMO FPGA feedback algorithm",
        "and the cascaded feedback architecture based on RF-signals and beam based measurements relative to a femtosecond synchronization system is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcobab02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcobab02.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcobab02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOBAB02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FRCOBAB03",
      "title": "The New Multicore Real-time Control System of the RFX-mod Experiment",
      "authors": [
        "G. Manduchi",
        "A. Luchetta",
        "C. Taliercio",
        "Consorzio RFX",
        "Associazione Euratom-ENEA sulla Fusione",
        "Padova",
        "Italy",
        "The real-time control system of RFX-mod nuclear fusion experiment has been in operation since 2004 and has been used to control the plasma position and the MagnetoHydroDinamic (MHD) modes. Over time new and more computing demanding control algorithm shave been developed and the system has been pushed to its limits. Therefore a complete re-design has been carried out in 2012. The new system adopts radically different solutions in Hardware",
        "Operating System and Software management. The VME PowerPc CPUs communicating over Ethernet used in the former system have been replaced by a single multicore server. The VxWorks Operating System",
        "previously used in the VME CPUs has now been replaced by Linux MRG",
        "that proved to behave very well in real-time applications. The previous framework for control and communication has been replaced by MARTe",
        "a modern framework for real-time control gaining interest in the fusion community. Thanks to the MARTe organization",
        "a rapid development of the control system has been possible. In particular",
        "its intrinsic simulation ability of the framework gave us the possibility of carrying out most debugging in simulation",
        "without affecting machine operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcobab03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcobab03.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcobab03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOBAB03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCOBAB04",
      "title": "Beam Feedback System Challenges at SuperKEKB Injector Linac",
      "authors": [
        "K. Furukawa",
        "R. Ichimiya",
        "M. Iwasaki",
        "H. Kaji",
        "F. Miyahara",
        "T.T. Nakamura",
        "M. Satoh",
        "T. Suwada",
        "KEK",
        "Ibaraki",
        "Japan",
        "SuperKEKB electron/positron asymmetric collider is under construction in order to elucidate new physics beyond the standard model of elementary particle physics. This will be only possible by a precise measurement with 40-times higher luminosity compared with that of KEKB. The injector linac should be upgraded to enable a 20-times smaller beam size of 50 nm at the collision point and twice-larger stored beam current with short lifetime of 10 minutes. At the same time two light source rings",
        "PF and PF-AR",
        "should be filled in top-up injection mode. To this end the linac should be operated with precise beam controls. Dual-layer controls with EPICS and MRF event systems are being enhanced to support precise pulse-to-pulse beam modulation (PPM) at 50Hz. A virtual accelerator (VA) concept is introduced to enable a single linac behaving as four VAs switched by PPM",
        "where each VA corresponds to one of four top-up injections into storage rings. Each VA should be accompanied with independent beam orbit and energy feedback loops to maintain the required beam qualities. The requirements from SuperKEKB HER and LER for beam emittance",
        "energy-spread",
        "and charge are especially challenging."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcobab04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcobab04.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcobab04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOBAB04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCOBAB05",
      "title": "Distributed Feedback Loop Implementation in the RHIC Low Level RF Platform",
      "authors": [
        "F. Severino",
        "M. Harvey",
        "T. Hayes",
        "G. Narayan",
        "K.S. Smith",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/frcobab05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/frcobab05.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/frcobab05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-FRCOBAB05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-10 18:29:59"
}