{
  "session_info": {
    "id": "MOPAG",
    "name": "MOPAG - Monday Parallel Grand Ballroom",
    "url": "https://proceedings.jacow.org/icap2018/html/mopag.htm"
  },
  "papers": [
    {
      "paper_id": "MOPAG01",
      "title": "Plasma Wakefield Start to End Acceleration Simulations From Photocathode to FEL With Simulated Density Profiles",
      "authors": [
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "Plasma Wakefield acceleration is a promising new acceleration technique that profit by a charged bunch",
        "e.g. an electron bunch",
        "to break the neutrality of a plasma channel to produce a wake where a trailing bunch is eventually accelerated. The quest to achieve extreme gradient conserving high brightness has prompted to a variety of new approaches and techniques. Most of the proposed schemes are however limited to the only plasma channel",
        "assuming in the vast majority of cases",
        "ideal scenarios (e.g. ideal bi-gaussian bunches and uniform density plasma channels). Realistic start-to-end simulations from the photocathode to a FEL via a plasma accelerating section are a fundamental step to further investigate realistic scheme possibilities",
        "the underlying physics and future applications. To remove ideal simplifications",
        "the SPARC_LAB simulation team is simulating bunches from the photo-cathode and tracking them all the way to the plasma. Similarly",
        "the density profiles",
        "where bunches evolve and accelerate",
        "are calculated with a magneto-hydrodynamic code. The density profile is imported into the particle in cell codes used to calculate the particle evolution within the plasma section. The use of a multitude of codes",
        "involving different architectures",
        "physical units and programming languages",
        "made necessary the definition of code interfacing and pipe-processes to ensure a proper pipeline of tools that are traditionally used in different fields are do not often come across. By combining the different numerical codes (particle tracker",
        "particle in cell",
        "magneto-hydrodynamics and FEL codes) we could propose a first realistic start-to-end simulation from the photo-cathode to a FEL lasering for a possible upcoming Italian PWFA-FEL facility. Such a work is conducted with a great focus on code reliability and data reproducibility. The Italian PWFA experimental team uses a capillary to control and tailor the plasma density profile",
        "we could perform preliminary code comparison and"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/mopag01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/mopag01.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/mopag01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-MOPAG01",
      "page_number": "154",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPAG02",
      "title": "Efficient Modeling of Laser Wakefield Acceleration Through the PIC Code Smilei in CILEX Project",
      "authors": [
        "F. Massimo",
        "A. Beck",
        "A. Specka",
        "I. Zemzemi",
        "LLR",
        "Palaiseau",
        "France",
        "Maison de la Simulation",
        "CEA",
        "Gif-sur-Yvette",
        "France",
        "M. Grech",
        "F. Pérez",
        "LULI",
        "Palaiseau",
        "France",
        "The design of plasma acceleration facilities requires considerable simulation effort for each part of the machine",
        "from the plasma injector and/or accelerator stage(s)",
        "to the beam transport stage",
        "from which the accelerated beams will be brought to the users or possibly to another plasma stage. The urgent issues and challenges in simulation of multi-stage acceleration with the Apollon laser of CILEX facility will be addressed. To simulate the beam injection in the second plasma stage",
        "additional physical models have been introduced and tested in the open source Particle in Cell collaborative code Smilei. The efficient initialisation of arbitrary relativistic particle beam distributions through a Python interface allowing code coupling and the self consistent initialisation of their electromagnetic fields will be presented. The comparison between a full PIC simulation and a simulation with a recently developed envelope model",
        "which allows to drastically reduce the computational time",
        "will be also shown for a test case of laser wakefield acceleration of an externally injected electron beam."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/mopag02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/mopag02.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/mopag02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-MOPAG02",
      "page_number": "160",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPAG03",
      "title": "Exploring the Validity of the Paraxial Approximation for Coherent Synchrotron Radiation Wake Fields",
      "authors": [
        "D. A. Bizzozero",
        "H. De Gersem",
        "E. Gjonaj",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "Coherent synchrotron radiation (CSR) is an essential consideration in modern accelerators",
        "yet is often computationally difficult to accurately model. A common approach used in simulating CSR effects uses the paraxial",
        "or slowly-varying envelope approximation with a simple constant cross-section approximation of the geometry. While these approximations are often valid for the simulation of many accelerator components",
        "we aim to more closely analyze the errors introduced by such approximations by comparing them with wake field solutions obtained by full-wave electromagnetic field simulations. The simulations are performed with CSRDG (Coherent Synchrotron Radiation with Discontinuous Galerkin)",
        "our GPU-enabled MATLAB code. Extended from earlier work [Coherent Synchrotron Radiation and Wake Fields With Discontinuous Galerkin Time Domain Methods",
        "Proceedings of IPAC 2017",
        "Copenhagen",
        "Denmark]",
        "CSRDG evolves Maxwell’s equations the time domain after a curvilinear coordinate transformation and a Fourier series decomposition in a transverse direction."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/mopag03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/mopag03.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/mopag03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-MOPAG03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 18:30:57"
}