{
  "session_info": {
    "id": "MOOPLGD",
    "name": "MOOPLGD - Opening Plenary",
    "url": "https://proceedings.jacow.org/ipac2022/html/mooplgd.htm"
  },
  "papers": [
    {
      "paper_id": "MOOPLGD1",
      "title": "Growing Expectations for New Physics",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Interesting results have been obtained from neutrino oscillation experiments and precision measurements of muons in recent years. Indication of CP violations in neutrinos was reported and the order of the neutrino mass hierarchy was almost determined. A possibility of a sterile neutrino was also suggested. For muons",
        "the anomalous magnetic moment",
        "g-2",
        "has been precisely measured and the result shows a significant deviation from the prediction calculated by the standard model (SM). These results have attracted many discussions about new physics beyond the SM",
        "such as a suggestion of a new massive particle",
        "a candidate of the dark matter",
        "and a solution to the asymmetry between matter and anti-matter. They can be restrictions on the directions of energy-frontier collider experiments. To consolidate the new physics",
        "many new experimental projects using high-energy and high-intensity accelerators are proposed and conducted. This talk presents the recent results from neutrino oscillation experiments and muon g-2 measurements",
        "possible new physical models beyond the SM",
        "and future prospects of new experiments including the synergy with energy frontier."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/mooplgd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/mooplgd1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/mooplgd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-MOOPLGD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOOPLGD2",
      "title": "SPS-II: A 4th Generation Synchrotron Light Source in Southeast Asia",
      "authors": [
        "P. Klysubun",
        "S. Boonsuya",
        "T. Chanwattana",
        "S. Jummunt",
        "N. Juntong",
        "A. Kwankasem",
        "T. Phimsen",
        "P. Photongkam",
        "S. Prawanta",
        "T. Pulampong",
        "K. Sittisard",
        "S. Srichan",
        "P. Sudmuang",
        "P. Sunwongpresenter",
        "O. Utke",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "Upon its completion",
        "Siam Photon Source II (SPS-II) will be the first 4th generation synchrotron light source in Southeast Asia. The 3.0 GeV",
        "327.5 m storage ring based on the Double-Triple Bend Achromat lattice will have the natural emittance of 0.97 nm·rad. The storage ring includes 14 long and 14 short straight sections for insertion devices and machine subsys-tems. The beam injection will be performed by a 150 MeV linear accelerator and a full-energy concentric booster synchrotron sharing the same tunnel with the storage ring. In the first phase",
        "there will be 7 insertion devices and 7 associated beamlines with the end sta-tions for different techniques utilizing synchrotron radiation from 80 eV to 60 keV. High-energy and high-brightness radiation generated by the new light source will serve as one of the most powerful analytical tools in the region for advanced science and technology research."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/mooplgd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/mooplgd2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/mooplgd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-MOOPLGD2",
      "page_number": "764",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 18:36:21"
}