{
  "session_info": {
    "id": "TUKAB",
    "name": "TUKAB - Keynote Ed Moses",
    "url": "https://proceedings.jacow.org/ICALEPCS2013/html/tukab.htm"
  },
  "papers": [
    {
      "paper_id": "TUKAB01",
      "title": "The NIF: an International User Facility for High Energy Density and Inertial Fusion Science",
      "authors": [
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "The National Ignition Facility (NIF)",
        "operational since March 2009",
        "is transitioning to an international user facility for high-energy-density science (HEDS) and inertial confinement fusion (ICF) research. The NIF",
        "the world’s largest and most energetic laser facility consists of 192 Nd-glass lasers",
        "a control room and a target chamber. NIF is the first laser system built to demonstrate thermonuclear burn of deuterium-tritium–filled ICF capsules. NIF’s high-powered",
        "high-energy lasers can compress and heat material to produce unique states of matter and radiation environments in the laboratory–conditions of interest to HEDS supporting national security and fundamental science. Achieving ignition on NIF will also demonstrate the target physics basis of ICF for energy production. The NIF laser’s unprecedented power",
        "precision",
        "and reproducibility",
        "coupled with sophisticated target and diagnostic capabilities",
        "are enabling leading edge experiments in the study of matter at extreme temperatures and pressures–conditions that exists in planetary interiors. This paper describes NIF’s unprecedented current and future capabilities and the experimental results achieved so far."
      ],
      "institutions": [
        "Funding: * This work performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344. #LLNL-ABS-628852"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tukab01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tukab01.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tukab01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUKAB01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:26:02"
}