{
  "session_info": {
    "id": "TUAA",
    "name": "TUAA - Conference Welcome & Precision Mechanics",
    "url": "https://proceedings.jacow.org/medsi2016/html/tuaa.htm"
  },
  "papers": [
    {
      "paper_id": "TUAA00",
      "title": "Welcome and Overview",
      "authors": [
        "C. Colldelram",
        "D. Lopez Nonell",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "In this talk a briefing of the scientific program is presented. This is the first time that MEDSI uses JACoW and it is shown a preliminary evaluation of how the publisher has worked with some figures about the abstract submission",
        "the status of the paper submission as well as the how it works the papers edition. Then a revision of the conference topics is explained as have been organized jointly with the International Organizing Committee and how this topic are organized in the conference program for the Contributed Orals as well as posters. Finally a list of interesting statistics and figures about the conference are presented. This is one of the most successful MEDSI’s in all point of views",
        "number of delegates",
        "abstract submission",
        "as well as sponsors and a final review of the delegates per facility. And last the formal conference opening is announced."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tuaa00_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tuaa00.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tuaa00_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUAA00",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUAA01",
      "title": "Precision Mechanical Design of a Miniature Dynamic Mirror Bender for the SSRF Beamline Upgrade Project",
      "authors": [
        "D. Shu",
        "J.W.J. Anton",
        "S.P. Kearney",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "University of Illinois at Chicago",
        "Chicago",
        "USA",
        "A. Li",
        "C. Mao",
        "Y. Pan",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "Dynamic mirror benders which enable high precision figuring of planar substrates for x-ray focusing are widely used as conventional optical equipment in various synchrotron radiation beamlines. Especially",
        "in cases for x-ray focusing optics coated with multilayers in a Kirkpatrick-Baez configuration as the final focusing elements immediately upstream of the sample",
        "the dynamic mirror benders provide high precision figuring to allow the mirror figure to be tuned to optimize the focusing at different incidence angles to cover a wide energy range *. Recently",
        "collaboration between Argonne National Laboratory and Shanghai Institute of Applied Physics (SINAP) has produced designs of a new miniature dynamic mirror bender with Argonne’s laminar nanopositioning flexure technique ** for beamline upgrade project at the Shanghai Synchrotron Radiation Facility (SSRF). The mechanical design and finite element analyses of the miniature dynamic mirror bender",
        "as well as its initial mechanical test results with laser interferometer are described in this paper.",
        "* R. Barrett",
        "J. Härtwig",
        "C. Morawe et al",
        "Synchrotron Radiation News",
        "23",
        "No.1",
        "36-42(2010)  ** U.S. Patent granted No. 6",
        "984",
        "335",
        "D. Shu",
        "T. S. Toellner",
        "and E. E. Alp",
        "2006."
      ],
      "institutions": [
        "Funding: Work supported by the U.S. Department of Energy, Office of Science, under Contract No. DE-AC02-06CH11357 and Argonne SPP project 85·1077. Work at SINAP supported by NNSF of China No. U1332120."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tuaa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tuaa01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tuaa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUAA01",
      "page_number": "108",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUAA02",
      "title": "Earth, Wind, and Fire: The New Fast Scanning Velociprobe",
      "authors": [
        "C.A. Preissner",
        "J. Deng",
        "C. Jacobsen",
        "B. Lai",
        "F.S. Marin",
        "J. Maser",
        "S.T. Mashrafi",
        "C. Roehrig",
        "S. Sullivan",
        "S. Vogt",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The Advanced Photon Source Upgrade (APS-U) project will include a suite of new beam-lines. In preparation for this",
        "a team at the APS is developing an X-ray microscope with a novel granite (Earth)",
        "air bearing (Wind) supported stage to take advantage of the two orders of magnitude increased coherent flux (Fire) that will be available with the APS-U. The instrument will be able to operate as a scanning probe for fluorescence microscopy and as a ptychoprobe for the ultimate in spatial resolution. Both are combined with tomography. The goals for the instrument while operating at the current APS are to demonstrate fast scanning of large samples at high resolution and ptychography at the highest resolution (speed and resolution limited by available flux). This presentation will discuss the unique mechanics",
        "interferometry scheme",
        "the advanced scanning control",
        "and instrument integration."
      ],
      "institutions": [
        "Funding: Argonne is managed by UChicago Argonne, LLC, for the U.S. Department of Energy under contract DE-AC02-06CH11357."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/tuaa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/tuaa02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/tuaa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-TUAA02",
      "page_number": "112",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 23:54:14"
}