{
  "session_info": {
    "id": "THOYGD",
    "name": "THOYGD - Contributed Orals: Beam Instrumentation, Controls, Feedback and Op. Aspects",
    "url": "https://proceedings.jacow.org/ipac2022/html/thoygd.htm"
  },
  "papers": [
    {
      "paper_id": "THOYGD1",
      "title": "Experimental Verification of Several Theoretical Models for ChDR Description",
      "authors": [
        "Jagiellonian University",
        "Kraków",
        "Poland",
        "The University of Manchester",
        "Manchester",
        "United Kingdom",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "T. Lefèvre",
        "S. Mazzoni",
        "E. Senes",
        "CERN",
        "Meyrin",
        "Switzerland",
        "Oxford University",
        "Physics Department",
        "Oxford",
        "Oxon",
        "United Kingdom",
        "TU Vienna",
        "Wien",
        "Austria",
        "In recent years the potential of using Cherenkov Diffraction Radiation (ChDR) as a tool for non-invasive beam diagnostics has been thoroughly investigated. Although several theoretical models of ChDR have been developed",
        "differences in their assumptions result in inconsistent predictions. The experimental verification is therefore needed in order to fully understand ranges of validity of available models. In this contribution we present a detailed theoretical study of the radiation yield as a function of the beam-radiator distance. Following identification of beam parameters and frequency range for which differences between the model predictions are most prominent",
        "we compare theoretical estimates with the results of a dedicated experiment."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thoygd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thoygd1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thoygd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THOYGD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THOYGD2",
      "title": "Experimental Slice Emittance Reduction at PITZ Using Laser Pulse Shaping",
      "authors": [
        "R. Niemczyk",
        "Z. Aboulbanine",
        "G.D. Adhikari",
        "N. Aftab",
        "P. Boonpornprasert",
        "G.Z. Georgiev",
        "J. Good",
        "M. Groß",
        "C. Koschitzki",
        "X.-K. Li",
        "O. Lishilin",
        "D. Melkumyan",
        "S.K. Mohanty",
        "A. Oppelt",
        "H.J. Qian",
        "H. Shaker",
        "G. Shu",
        "F. Stephan",
        "T. Weilbach",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "M.E. Castro Carballo",
        "M. Krasilnikov",
        "G. Vashchenko",
        "DESY",
        "Hamburg",
        "Germany",
        "University of Hamburg",
        "Institut für Experimentalphysik",
        "Hamburg",
        "Germany",
        "Free-electron lasers in the X-ray regime require a high-brightness electron beam",
        "i.e. an electron beam with high current and low transverse emittance. At the Photo Injector Test facility at DESY in Zeuthen (PITZ) high-brightness electron sources are optimized for the use at FLASH and European XFEL. A low transverse emittance of the electron beam’s central part",
        "which is assumed to be the lasing slices",
        "is of particular interest for the efficient FEL operation. Over the past years a slice emittance measurement scheme has been developed at PITZ which employs an rf deflector and additional quadrupole magnets along the beamline to the standard measurement procedure for the projected emittance (single-slit scan). It allows measuring the slice emittance in a high-brightness photo injector. Transversely flat-top shaped laser pulses of different temporal distributions (Gaussian and flat-top) have been used to emit electrons",
        "as well as transversely-truncated Gaussian laser pulses with temporal Gaussian shape. The paper shows that the lowest slice emittance in the injector is reached with a temporal flattop shape",
        "or when using a transversely-truncated Gaussian shape."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thoygd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thoygd2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thoygd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THOYGD2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THOYGD3",
      "title": "Online Measurement of Bunch Lengths and Fill-pattern in the PLS-II Storage Ring Using a Fast Photodiode",
      "authors": [
        "POSTECH",
        "Pohang",
        "Republic of Korea",
        "T. Ha",
        "G. Hahn",
        "Y.D. Joo",
        "D. Kim",
        "Y.S. Lee",
        "S. Shin",
        "PAL",
        "Pohang",
        "Republic of Korea",
        "HZB",
        "Berlin",
        "Germany",
        "Providing bunch lengths and a filling pattern of the bunch train in real-time is one of the important challenges in beam instrumentation of the 3rd generation light source. In particular",
        "the time length and intensity information of the synchrotron light is useful to beamlines and their users who perform time-resolved experiments. We developed an online monitoring system that can measure bunch lengths and a filling pattern simultaneously by directly observing the synchrotron radiation with a picosecond-resolution photodiode and high input analog bandwidth digitizer. We adopted the Gaussian deconvolution method to restore the original waveform of synchrotron radiation using the system impulse response function of 29 ps in RMS which was obtained from a 100 fs length laser pulse experiment. In this paper",
        "we present the experimental setup and signal processing method in detail as well as the online measurement results of the bunch length and filling pattern using the fast photodiode in the PLS-II."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thoygd3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thoygd3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thoygd3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THOYGD3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 18:42:34"
}