{
  "session_info": {
    "id": "FRXGBD",
    "name": "FRXGBD - MC6 Orals",
    "url": "https://proceedings.jacow.org/ipac2018/html/frxgbd.htm"
  },
  "papers": [
    {
      "paper_id": "FRXGBD1",
      "title": "Reliability and Availability of Particle Accelerators: Concepts, Lessons, Strategy",
      "authors": [
        "A. Apollonio",
        "L. Ponce",
        "O. Rey Orozko",
        "R. Schmidt",
        "A.P. Siemko",
        "B. Todd",
        "J.A. Uythoven",
        "A.P. Verweij",
        "D. Wollmann",
        "M. Zerlauth",
        "CERN",
        "Geneva",
        "Switzerland",
        "This paper will present the results and latest status of an extensive effort to analyse and improve the reliability and availability of the LHC. After the introduction of basic concepts and definitions",
        "the paper reviews the performance of the LHC in 2015-2017. A direct comparison of the luminosity production years 2016 and 2017 is presented",
        "with a focus on the main differences in the observed failure modes. Based on the lessons learnt in this time window",
        "expectations for the performance during future LHC runs are discussed. In particular",
        "the thought process for the evaluation of the possible full energy exploitation of the LHC is described",
        "considering relevant factors such as the expected availability loss and the risk associated to magnet training."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/frxgbd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/frxgbd1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/frxgbd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-FRXGBD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRXGBD2",
      "title": "Fast Kicker for High Current Beam Manipulation: Experimental Facility",
      "authors": [
        "V.V. Gambaryan",
        "A.A. Starostenko",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "NSU",
        "Novosibirsk",
        "Russia",
        "The pulsed deflecting magnet (kicker) project was worked out in Budker Institute of Nuclear Physics. The kicker design parameters are: impulsive force",
        "1 mT*m; pulse edge",
        "5 ns; impulse duration",
        "200 ns. The unconventional approach is that the plates must be replaced by a set of cylinders. The obtained magnet construction enables the field homogeneity to be controlled by changing current magnitudes in cylinders. Furthermore",
        "we demonstrated the method of field optimization. In addition",
        "measurement technique for the harmonic components was considered and the possibility of control harmonic components value was demonstrated. The results with electron beam on actual facility was considered."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/frxgbd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/frxgbd2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/frxgbd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-FRXGBD2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRXGBD3",
      "title": "Application of Carbon Nanotube Wire for Beam Profile Measurement of Negative Hydrogen Ion Beam",
      "authors": [
        "A. Miura",
        "K. Moriya",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "KEK",
        "Ibaraki",
        "Japan",
        "A wire scanner monitor using metallic wire is reliably employed for the beam profile measurement in the J-PARC linac. Because the loading of negative hydrogen (H−) ion beam on a wire increases under high-current beam operation",
        "we focus on using a high-durability beam profile monitors by attaching another wire material. Carbon nanotubes (CNT) are made of graphite in a cylindrical shape and have a tensile strength not less than 100 times that of steel. The electric conductivity has higher than that of metals",
        "and hardness is endured thermally around 3000°C in a vacuum circumstance. We applied the CNT wires to WSM and measured transverse profiles with a 3-MeV and 191-MeV H− beam. As a result",
        "we obtained the equivalent signal levels taken by carbon wire made of polyacrylonitrile without any damage. In this paper",
        "the signal response when the CNT is irradiated with an H− beam and the result of beam profile measurement. In addition",
        "the surface of CNT after 3-MeV beam operation was observed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/frxgbd3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/frxgbd3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/frxgbd3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-FRXGBD3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRXGBD4",
      "title": "Observation of Saw-Tooth Effect Orbit in the VEPP-4 M Collider",
      "authors": [
        "Leshenok D. Leshenok",
        "E.A. Bekhtenev",
        "NSU",
        "Novosibirsk",
        "Russia",
        "E.A. Bekhtenev",
        "G.V. Karpov",
        "S.A. Nikitin",
        "O.A. Plotnikova",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "We study the relative position of the electron and posi-tron closed orbits in the VEPP-4M single storage ring collider in experiments on orbit precision monitoring. A difference in the orbits can affect the accuracy of several fundamental experiments",
        "e.g. precise comparison of the electron and positron spin frequencies (the CPT invari-ance test) [1]. In this case",
        "the spin precession frequencies of particles should be compared within at least 5·10-9. The distinction of frequencies depends on the features of the radial orbits. Ideally",
        "the difference in the electron and positron orbits is set only by distributed radiation losses of particle energy. The corresponding contribution to the total orbit distortions is called the Saw-Tooth effect orbit. Another example of possible precision experiment at VEPP-4M is search for the light speed anisotropy (LSA). In this case",
        "it is necessary to ensure a stability of the difference in the radial orbits of electrons and positrons at a level of 1μm."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/frxgbd4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/frxgbd4.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/frxgbd4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-FRXGBD4",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 19:40:38"
}