{
  "session_info": {
    "id": "WECA",
    "name": "WECA - Contributed Talk in Wednesday-A",
    "url": "https://proceedings.jacow.org/IBIC2012/html/weca.htm"
  },
  "papers": [
    {
      "paper_id": "WECA01",
      "title": "Theoretical and Experimental Investigation on Resolution of Optical Transition Radiation Transverse Beam Profile Monitor",
      "authors": [
        "A.S. Aryshev",
        "N. Terunuma",
        "J. Urakawa",
        "KEK",
        "Ibaraki",
        "Japan",
        "B. Bolzon",
        "E. Bravin",
        "T. Lefèvre",
        "CERN",
        "Geneva",
        "Switzerland",
        "S.T. Boogert",
        "V. Karataev",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "Oxford University",
        "Physics Department",
        "Oxford",
        "Oxon",
        "United Kingdom",
        "Optical Transition Radiation (OTR) appearing when a charged particle crosses an interface between two media with different dielectric constants has widely been used as a tool for transverse profile measurements of charged particle beams in numerous facilities worldwide. The basic tuning methods and operation of conventional OTR monitors are well established for transverse beam sizes not smaller than 3-5 um. Since the Point Spread Function (PSF) dimension defines the resolution of the conventional monitors",
        "for small electron beam dimensions the PSF form significantly depends on a presence of OTR tails diffraction and aberrations in the optical system. In our experiment we have managed to squeeze the electron beam such that we can practically measure PSF distribution in one direction. The revealed PSF structure is such that the visibility depends on the transverse beam size on micron scale. We developed an empirical calibration technique and successfully overcame the resolution limit of the common OTR monitor reaching sub-micron level. Here we represent the recent developments and upgrades in both setup and data analysis of a sub-micrometer electron beam profile monitor."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/weca01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/weca01.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/weca01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-WECA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:03:41"
}