{
  "session_info": {
    "id": "THAM2HA",
    "name": "THAM2HA - Beam Dynamics & New Ideas",
    "url": "https://proceedings.jacow.org/COOL2013/html/tham2ha.htm"
  },
  "papers": [
    {
      "paper_id": "THAM2HA01",
      "title": "Beam Accumulation and Bunching with Cooling",
      "authors": [
        "T. Katayama",
        "M. Steck",
        "GSI",
        "Darmstadt",
        "Germany",
        "Nagaoka University of Technology",
        "Nagaoka",
        "Niigata",
        "Japan",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "FZJ",
        "Jülich",
        "Germany",
        "The accumulation of anti-proton beam in the storage ring was performed at CERN and FNAL with use of a stochastic stacking system. In the original version of the FAIR such a concept was envisaged at the accumulator ring named RESR. However in the modularized start version of FAIR",
        "the RESR was postponed and the new concept of anti-proton accumulation in the High Energy Storage Ring (HESR) was strongly demanded. The barrier bucket system with stochastic cooling was found with simulation work to have enough capabilities to accumulate the pre-cooled 3 GeV anti-proton beam in the HESR. The Proof Of Principle (POP) experiment was performed at the GSI storage ring ESR with the use of Ar and Xe ion beam employing both stochastic and electron cooling. The experimental results were well in agreement with the prediction of the simulation study. The concept of BB accumulation could be applied to the planned Collider of the NICA project at JINR. In the present paper the concept of BB accumulation and the short bunch formation including the space charge effects are presented as well as the analysis of POP experiment."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/COOL2013/talks/tham2ha01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/COOL2013/papers/tham2ha01.pdf",
      "poster_url": "https://proceedings.jacow.org/COOL2013/posters/tham2ha01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2013-THAM2HA01",
      "page_number": "170",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAM2HA02",
      "title": "Advances in Coherent Electron Cooling",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "This talk will be focused on advances and challenges in cooling of high-energy hadron – and potentially heavy lepton-beams. Such techniques are required to improve quality of hadron beams and for increasing the luminosity in hadron and electron-hadron colliders. The focus of the talk will be on the Coherent Electron Cooling technique",
        "which combines aspects of both stochastic and electron cooling. Coherent Electron Cooling shares with the first the need for a broad bandwidth and with the second an electrostatic-form of interaction between the hadrons and the electrons. I will discuss the physics principles of the Coherent Electron Cooling and progress made in its theory in last five years. I will also discuss its advantages and limitations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/COOL2013/talks/tham2ha02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/COOL2013/papers/tham2ha02.pdf",
      "poster_url": "https://proceedings.jacow.org/COOL2013/posters/tham2ha02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2013-THAM2HA02",
      "page_number": "175",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAM2HA03",
      "title": "Noise Suppression in Relativistic Electron Beams",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "A. Sessler",
        "M.S. Zolotorev",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Understanding and controlling the noise effects in relativistic beams is becoming increasingly important with new applications for ultra-bright particle sources such as x-ray free electron lasers (FELs). In free electron lasers",
        "shot noise provides the startup radiation for Self-Amplified Spontaneous Emission (SASE)",
        "but also drives hazardous instabilities that might impede coherent processes. Several approaches to the noise suppression at sub-micron wavelengths have been studied in recent years both theoretically and experimentally. In this paper we review the proposed approaches to noise suppression and compare their suppressing capabilities at short wavelengths. We then develop a general approach for study of noise suppressors that use an interaction region in combination with a dispersion section. We apply this method for the case when undulators are used in the interaction region",
        "and show its promise for short-wavelengths FEL."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/COOL2013/talks/tham2ha03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/COOL2013/papers/tham2ha03.pdf",
      "poster_url": "https://proceedings.jacow.org/COOL2013/posters/tham2ha03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2013-THAM2HA03",
      "page_number": "184",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:22:28"
}