{
  "session_info": {
    "id": "WEALA",
    "name": "WEALA - Tutorial 2",
    "url": "https://proceedings.jacow.org/IBIC2015/html/weala.htm"
  },
  "papers": [
    {
      "paper_id": "WEALA01",
      "title": "Radiation Damage Considerations in Accelerator Beam Environments",
      "authors": [
        "ARPANSA",
        "Yallambie",
        "Australia",
        "The impact of radiation upon equipment used on accelerator beam lines is a continuing concern. Materials",
        "cabling and instrumentation will experience aging and degradation and even failure depending on the nature of the radiation and the intensity of the fields. This discussion will review the fundamentals of radiation interactions and look at possible mechanisms for damage. In the case of electron accelerators producing photon beams",
        "ionization effects will tend to dominate but if the energies are high enough",
        "secondary charged particles and neutrons are created that can cause atomic displacements and even impurity production. We can also distinguish between cumulative effects and single event effects. For instrumentation",
        "the topic of radiation damage can be divided into electromagnetic and bulk damage components. Hadrons can also produce bulk damage. Strategies to minimise or delay the effects of radiation damage need to take these issues into account. Some examples will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2015/talks/weala01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2015/papers/weala01.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2015/posters/weala01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2015-WEALA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEALA02",
      "title": "First LHC Emittance Measurements at 6.5 TeV",
      "authors": [
        "M. Kuhn",
        "F. Antoniou",
        "E. Bravin",
        "B. Dehning",
        "J. Emery",
        "V. Kain",
        "A. Langner",
        "Y. Papaphilippou",
        "E. Piselli",
        "G. Trad",
        "CERN",
        "Geneva",
        "Switzerland",
        "During LHC Run 1 significant transverse emittance growth through the LHC cycle was observed. Measurements indicated most of the blow-up to occur during the injection plateau and the ramp. Intra beam scattering was one of the main drivers of emittance growth. However",
        "finding a good wire scanner working point was difficult. Photomultiplier saturation added uncertainty on all measurements. A large discrepancy between emittances from wire scanners and luminosity was discovered but not solved. During Long Shutdown 1 the wire scanner system was upgraded with new photomultipliers. In April 2015 the LHC re-started with collision energy of 6.5 TeV per beam. This paper presents the first transverse emittance measurements through the LHC Run 2 cycle with low beam intensity. Comparisons with data from the synchrotron light monitors and the LHC experiments will be discussed and results summarized. In addition",
        "a thorough study of wire scanner photomultiplier saturation will be presented. Finally",
        "the emittance growth results will be compared to intra beam scattering simulations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2015/talks/weala02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2015/papers/weala02.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2015/posters/weala02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2015-WEALA02",
      "page_number": "562",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 17:55:14"
}