{
  "session_info": {
    "id": "FRPLYGD",
    "name": "FRPLYGD - Plenary Invited Orals",
    "url": "https://proceedings.jacow.org/ipac2022/html/frplygd.htm"
  },
  "papers": [
    {
      "paper_id": "FRPLYGD1",
      "title": "Towards Efficient Particle Accelerators - A Review",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Sustainability has become an important aspect of all human activities",
        "and also for accelerator driven research infrastructures. For new facilities it is mandatory to optimize power consumption and overall sustainability. This presentation will give an overview of the power efficiency of accelerator concepts and relevant technologies. Conceptual aspects will be discussed for proton driver accelerators",
        "light sources and particle colliders. Several accelerator technologies are particularly relevant for power efficiency. These are utilized across the various facility concepts and include superconducting RF and cryogenic systems",
        "RF sources",
        "energy efficient magnets",
        "conventional cooling and heat recovery. Power efficiency has been a topic in the European programs EUCARD-2",
        "ARIES and the ongoing I.FAST project and the documentation of these programs is a related source of information."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/frplygd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/frplygd1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/frplygd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-FRPLYGD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRPLYGD2",
      "title": "Access to Effective Cancer Care in Low- Middle Income Countries Requires Sophisticated Linear Accelerator Based Radiotherapy",
      "authors": [
        "CERN",
        "Meyrin",
        "Switzerland",
        "There are substantial and growing gaps in cancer care for millions of people in Low- Middle- Income countries (LMICs) and for geographically remote settings in High-income countries (HICs)",
        "often indigenous populations. Assessing the cancer care shortfall led to understanding the essential gap",
        "that of a radiation therapy machine that can reliably and effectively provide the appropriate first-rate cancer treatments within the challenging environments. More than 10",
        "000 electron linear accelerators (linacs) are currently used worldwide to treat patients. However only 10% of patients in low-income and 40% in middle-income countries who need radiotherapy have access to it. The idea to address the need for a novel medical linac for challenging environments has led to the creation of the STELLA project (Smart Technology to Extend Lives with Linear Accelerators) project. STELLA is multidisciplinary international collaborative effort to design and develop an affordable and robust yet technically sophisticated linear accelerator-based radiation therapy treatment (RTT) in LMICs. Here we describe Project STELLA."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/frplygd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/frplygd2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/frplygd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-FRPLYGD2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 18:45:19"
}