{
  "session_info": {
    "id": "THBA",
    "name": "THBA - Technology",
    "url": "https://proceedings.jacow.org/SRF2015/html/thba.htm"
  },
  "papers": [
    {
      "paper_id": "THBA01",
      "title": "Plasma Processing to Improve SRF Accelerating Gradient",
      "authors": [
        "M. Doleans",
        "R. Afanador",
        "J.A. Ball",
        "D.L. Barnhart",
        "W. Blokland",
        "M.T. Crofford",
        "B. DeGraff",
        "B.S. Hannah",
        "M.P. Howell",
        "S.-H. Kim",
        "S.W. Lee",
        "J.D. Mammosser",
        "C.J. McMahan",
        "T.S. Neustadt",
        "J. Saunders",
        "S.E. Stewart",
        "W.H. Strong",
        "P.V. Tyagi",
        "D.M. Vandygriff",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "A new In-situ plasma processing technique is being developed at the SNS (Spallation Neutron Source) to improve the performance of the cavities in operation. The technique utilizes a reactive low-density room-temperature plasma to remove top-surface hydrocarbons. This increases the work function of the cavity surface and reduces the overall amount of electron activity; In particular it increases the field-emission onset",
        "which enables to operate a cavity at higher accelerating gradient. Development of the basic plasma processing parameters and effect on the Niobium surface can be found elsewhere *",
        "**. Details on the results for in-situ plasma processing of dressed cavities in the SNS HTA (horizontal test apparatus) will be reported here.",
        "* M. Doleans et al. “Plasma processing R&D for the SNS superconducting linac RF cavities” SRF2013 Proceedings ** P. V. Tyagi",
        "et al. “Surface Studies of Plasma Processed Nb samples” These proceedings"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/thba01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/thba01.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/thba01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-THBA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THBA02",
      "title": "Recent Development in Vertical Electropolishing",
      "authors": [
        "V. Chouhan",
        "Y.I. Ida",
        "K.N. Nii",
        "T.Y. Yamaguchi",
        "MGH",
        "Hyogo-ken",
        "Japan",
        "H. Hayano",
        "S. Kato",
        "H. Monjushiro",
        "T. Saeki",
        "M. Sawabe",
        "KEK",
        "Ibaraki",
        "Japan",
        "MGI",
        "Chiba",
        "Japan",
        "Horizontal electropolishing (HEP) is being used for final surface treatment of niobium SRF cavities. However a HEP system is equipped with complicated mechanism that makes it expensive and enhances cost of surface treatment of cavities especially when mass production is considered. Vertical electropolishing (VEP) has been introduced by other labs and the research is being carried out to establish the VEP technique. The VEP system requires simple mechanism and has advantages over HEP setup. Positive results have been obtained from the VEPed cavities also as shown by other labs. However further improvement in a VEP setup",
        "cathode and VEP parameters is required. Marui Galvanizing Co.",
        "Ltd in collaboration with KEK has been working for development of VEP system",
        "optimization of cathode and VEP parameters to obtain uniform Nb removal with a smooth surface of a cavity. Here we report our recent development of VEP system",
        "unique Ninja cathode and parameter optimization with a 1-cell coupon cavity containing 6 Nb disk coupons at the beam pipes",
        "irises and equator. The coupon surfaces were analyzed to obtain detail of the cavity surface."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/thba02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/thba02.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/thba02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-THBA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THBA03",
      "title": "Overview of Recent Advances in Coupler Technology, Fabrication and Conditioning",
      "authors": [
        "LAL",
        "Orsay",
        "France",
        "The talk will provide an overview on the latest advances (since SRF2013) of Power Coupler development",
        "production and preparation for SRF applications. The speaker is asked to emphasize issues of design",
        "fabrication and conditioning. Examples from other labs (FRIB",
        "SPIRAL-II",
        "ESS",
        "LCLS-II) should be given that help explain the issues and resolutions including the multipacting free coupler at FRIB and the copper free coupler at FNAL. Details of the speaker's own work with the large scale production of power couplers for XFEL are expected but should occupy <=50% of the talk."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/thba03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/thba03.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/thba03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-THBA03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THBA04",
      "title": "Overview of Recent HOM Coupler Development",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "HOM damping is important for SRF applications",
        "especially for high intensity machines. A good HOM damping design will help to reduce power load to the cryogenic system and to reduce the risk of beam breakup. The design of HOM damping",
        "including antenna/loop HOM couplers",
        "beam pipe HOM absorbers and waveguide HOM couplers",
        "is to solve a multi-physics problem that involves RF",
        "thermal",
        "mechanical",
        "and beam-cavity interaction issues. In this talk",
        "the author provides an overview on the latest advances of the HOM couplers for high intensity SRF applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/thba04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/thba04.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/thba04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-THBA04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THBA05",
      "title": "Higher Order Mode Absorbers for High Current SRF Applications",
      "authors": [
        "R.G. Eichhorn",
        "J.V. Conway",
        "T. Gruber",
        "Y. He",
        "G.H. Hoffstaetter",
        "Y. Li",
        "M. Liepe",
        "T.I. O'Connell",
        "P. Quigley",
        "J. Sears",
        "V.D. Shemelin",
        "E.N. Smith",
        "M. Tigner",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Efficient damping of the higher-order modes (HOMs) of the superconducting cavities is essential for any high current operation. The talk will provide an overview on the latest advances of HOM absorber development for high intensity SRF applications. As the ideal absorber does not exist",
        "the different conceptual approaches will be presented and the associated issues are outlined. Design examples from various labs will be given that help explain the issues and resolutions. Some focus will be given to the Cornell HOM beamline absorber that was design for high current",
        "short bunch operation with up to 400 W heating. The design will be reviewed and testing results will be reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/thba05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/thba05.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/thba05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-THBA05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THBA06",
      "title": "Overview on Magnetic Field Management and Shielding in High Q Modules",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Maintaining very high cavity Q0 in linac applications creates new challenges for cryomodule design. Magnetic shielding from both external fields and internal fields is required and its importance to thermal gradients during Tc transition is now emerging. This presentation will describe the design challenges and possible mitigation strategies with examples from various applications or laboratories including FRIB",
        "LCLS-II",
        "PIP-II",
        "Cornell University and KEK."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2015/talks/thba06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2015/papers/thba06.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2015/posters/thba06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2015-THBA06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 04:03:33"
}