{
  "session_info": {
    "id": "WEZD",
    "name": "WEZD - Accelerator Technology",
    "url": "https://proceedings.jacow.org/napac2022/html/wezd.htm"
  },
  "papers": [
    {
      "paper_id": "WEZD1",
      "title": "ARDAP’s Perspective on Accelerator Technology R&D in the U.S.",
      "authors": [
        "B.E. Carlsten",
        "E.R. Colby",
        "R.A. Marsh",
        "M. White",
        "ARDAP",
        "Washington",
        "USA",
        "DOE operates several particle accelerator facilities and is planning several new forward-leaning accelerator facilities over the next decade or two. These new facilities will focus on discovery science research and fulfilling other core DOE missions. Near and mid-term examples include PIP-II and FACET-II (for High Energy Physics); LCLS-II",
        "SNS-PPU",
        "APS-U",
        "and ALS-U (for Basic Energy Sciences); FRIB (for Nuclear Physics); NSTX-U and MPEX (for Fusion Energy Sciences); and Scorpius (for NNSA). Longer-term examples may include future colliders",
        "the SNS-STS",
        "LCLS-II HE",
        "and EIC. In addition to domestic facilities",
        "DOE’s Office of Science (SC) also contributes to several international efforts. Together",
        "these new facilities constitute a multibillion-dollar construction and operations investment. To be successful",
        "they will require advances in state-of-the-art accelerator technologies. They will also require the National Laboratories to procure a variety of accelerator components. This paper summarizes how DOE is working to address these upcoming R&D and accelerator component production needs through its new office of Accelerator R&D and Production (ARDAP)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/wezd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/wezd1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/wezd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEZD1",
      "page_number": "592",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZD2",
      "title": "Solid State Active Reset Induction Technology to Accelerate kA Electron Beam",
      "authors": [
        "LLNL",
        "Livermore",
        "USA"
      ],
      "institutions": [],
      "abstract": "We will discuss Solid State Active reset technology and how it can be applied to kA electron beams.",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/wezd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/wezd2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/wezd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEZD2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEZD3",
      "title": "Magnetron R&D Progress for High Efficiency CW RF Sources of Industrial Accelerators",
      "authors": [
        "H. Wang",
        "K. Jordan",
        "R.M. Nelson",
        "S.A. Overstreet",
        "R.A. Rimmer",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "VCU",
        "Richmond",
        "Virginia",
        "USA",
        "B.R.L. Coriton",
        "C.P. Moeller",
        "K.A. Thackston",
        "GA",
        "San Diego",
        "California",
        "USA",
        "The College of William and Mary",
        "Williamsburg",
        "Virginia",
        "USA",
        "UKY",
        "Kentucky",
        "USA",
        "After the demonstration of using high efficiency magnetron power to combine and aim to drive a radio frequency accelerator at 2450MHz in CW mode [1]",
        "we have used trim coils adding to a water-cooled magnetron and three amplitude modulation methods in an open-loop control to further suppress the 120Hz side-band noise to -46.7dBc level. We have also successfully demonstrated the phase-locking to an industrial grade cooking magnetron transmitter at 915MHz with a 75kW CW power delivered to a water load by using a -26.6dBc injection signal. The sideband noise at 360Hz from the 3-Phase SCRs DC power supply can be reduced to -16.2dBc level. Their power combing scheme and higher power application to industrial accelerators are foreseeing.",
        "[1] H. Wang",
        "et al",
        "Magnetron R&D for High Efficiency CW RF Sources for Industrial Accelerators"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/wezd3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/wezd3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/wezd3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEZD3",
      "page_number": "597",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZD4",
      "title": "Using Off-Axis Undulator Radiation as a Longitudinal Electron-Beam Diagnostic",
      "authors": [
        "Q.R. Marksteiner",
        "H.L. Andrews",
        "J.E. Coleman",
        "W.P. Romero",
        "N.A. Yampolsky",
        "M.R.A. Zuboraj",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "S.K. Barber",
        "R.D. Ryne",
        "J. van Tilborg",
        "LBNL",
        "Berkeley",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "University of Chicago",
        "Chicago",
        "Illinois",
        "USA",
        "A novel diagnostic has been developed that uses off-axis undulator radiation to characterize the longitudinal bunch profile of an electron beam. The diagnostic uses a small",
        "~0.1-m long undulator with mirrors that focus the undulator radiation onto an array of pyrometers. The mirrors both focus the radiation onto the pyrometer and remove the chirping effect that comes from the finite length of the undulator. Numerical and analytical models have been developed to calculate the radiation for a given bunch length",
        "and a phase retrieval algorithm has been developed to extract the bunch profile from measured data. The diagnostic has been installed at the BELLA laser-plasma wakefield accelerator",
        "and will be used to characterize the bunch length there. The concept and relevant results will be presented."
      ],
      "institutions": [
        "Funding: This project was supported by funding from the Los Alamos National Laboratory Laboratory Research and Development program."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/wezd4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/wezd4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/wezd4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEZD4",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEZD5",
      "title": "Micro-Electromechanical Systems Based Multi-Beam Ion Accelerators",
      "authors": [
        "Q. Ji",
        "A. Amsellem",
        "A. Persaud",
        "Z. Qin",
        "T. Schenkel",
        "P.A. Seidl",
        "N. Valverde",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "K. Afridi",
        "V. Gund",
        "Y. Hou",
        "A. Lal",
        "D. Ni",
        "Cornell University",
        "Ithaca",
        "New York",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "We report on the development of multi-beam radio frequency (RF) linear ion accelerators that are formed from stacks of low-cost printed circuit boards. An array of 112 beamlets is formed using MEMS techniques in 4\" wafers. The peak argon ion current accelerated in the 112-beamlet column to date is 0.5 mA [1]. We have accelerated ions in stacks of 32 wafers to an energy of 100 keV. The measured energy gain in each RF gap reached 6.5 keV on average",
        "resulting in an effective acceleration gradient of 0.4 MV/m. We will describe how this approach to multi-beam RF ion acceleration can scale to high beam power for applications in material processing and nuclear materials development."
      ],
      "institutions": [
        "Funding: This work was funded by ARPA-E. Work at LBNL was conducted under DOE Contract DE-AC0205CH11231. Device fabrication at the Cornell Nano Fabrication facility is supported by NSF Grant No. ECCS-1542081."
      ],
      "abstract": "[1] Qing Ji, et al., \"Beam power scale-up in micro-electromechanical systems based multi-beam ion accelerators\", Rev. Sci. Instr. 92, 103301 (2021); https://doi.org/10.1063/5.0058175",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/wezd5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/wezd5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/wezd5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEZD5",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEZD6",
      "title": "Manufacturing the Harmonic Kicker Cavity Prototype for the Electron-Ion Collider",
      "authors": [
        "S.A. Overstreet",
        "M.W. Bruker",
        "G.A. Grose",
        "J. Guo",
        "J. Henry",
        "G.-T. Park",
        "R.A. Rimmer",
        "H. Wang",
        "R.S. Williams",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "High-bunch-frequency beam-separation schemes",
        "such as the injection scheme proposed for the Rapid Cycling Synchrotron at the Electron-Ion Collider",
        "demand rise and fall times an order of magnitude below what can realistically be accomplished with a stripline kicker. Nanosecond-time-scale kick waveforms can instead be obtained by Fourier synthesis in a harmonically resonant quarter-wave radio-frequency cavity which is optimized for high shunt impedance. Originally developed for the Jefferson Lab Electron-Ion Collider (JLEIC) Circulator Cooler Ring",
        "a hypothetical 11-pass ring driven by an energy-recovery linac at Jefferson Lab",
        "our high-power prototype of such a harmonic kicker cavity",
        "which operates at five modes at the same time",
        "will demonstrate the viability of this concept with a beam test at Jefferson Lab. As the geometry of the cavity",
        "tight mechanical tolerances",
        "and number of ports complicate the design and manufacturing process",
        "special care must be given to the order of the manufacturing steps. We present our experiences with the manufacturability of the present design",
        "lessons learned",
        "and first RF test results from the prototype."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/wezd6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/wezd6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/wezd6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEZD6",
      "page_number": "601",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:23:10"
}