{
  "session_info": {
    "id": "THPFI",
    "name": "THPFI - Poster Session",
    "url": "https://proceedings.jacow.org/IPAC2013/html/thpfi.htm"
  },
  "papers": [
    {
      "paper_id": "THPFI002",
      "title": "Construction and Initial Tests of the Electrostatic Septa for MedAustron",
      "authors": [
        "J. Borburgh",
        "R.A. Barlow",
        "C. Boucly",
        "A. Prost",
        "CERN",
        "Geneva",
        "Switzerland",
        "U. Dorda",
        "T. Kramer",
        "T. Stadlbauer",
        "EBG MedAustron",
        "Wr. Neustadt",
        "Austria",
        "For the MedAustron facility under construction in Wiener Neustadt/Austria",
        "two electrostatic septa are built in collaboration with CERN. These septa will be used for the multi-turn injection of protons and ions",
        "as well as for the slow extraction from the synchrotron. The power supplies are designed to combine the required precision with the capability to cycle sufficiently fast to keep up with the machine cycle. The septa are being assembled at CERN. Initial tests have been done on the remote displacement system to validate its precision and communication protocol with the MedAustron control system. Subsequently the septa are tested for vacuum performance and then HV conditioned. The construction of the septa",
        "the requirements of the power supplies and the high voltage circuit will be described. Results of the initial laboratory tests",
        "prior to installation in the accelerator",
        "will be given."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi002.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI003",
      "title": "Vacuum Study of the Cavity String for the IFMIF - LIPAc Cryomodule",
      "authors": [
        "N. Bazin",
        "G. Devanz",
        "F. Orsini",
        "CEA/DSM/IRFU",
        "France",
        "In the framework of the International Fusion Materials Irradiation Facility (IFMIF)",
        "a superconducting option has been chosen for the 5 MeV RF Linac of the first phase of the project (EVEDA)",
        "based on a cryomodule composed of 8 HWRs",
        "8 RF couplers and 8 Solenoid packages. This paper will focus on the beam vacuum of the cryomodule. The cryomodule beam line is made of the pattern solenoid package / cavity-coupler",
        "and a valve on each side of the cryomodule. During the installation of the cryomodule on the accelerator system",
        "the cavity string has to be pumped down with the beam valves closed. Thereby a manifold is connected to the cavities during the assembly of the beam line components in the clean room. In previous conferences",
        "the cryomodule was presented with a vacuum manifold connected to each cavity. A study realized on this complex vacuum configuration with Molflow",
        "a test-particle Monte-Carlo simulator for ultra-high vacuum",
        "permitted to reduce the number of cavities connected to the manifold and by consequence to reduce the risk of pollution during the clean room assembly."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi003.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI004",
      "title": "Progress on the SRF Linac Developments for the IFMIF-LIPAC Project",
      "authors": [
        "CEA/DSM/IRFU",
        "France",
        "P. Abramian",
        "J. Calero",
        "J.C. Calvo",
        "J.L. Gutiérrez",
        "T. Martínez de Alvaro",
        "J. Munilla",
        "I. Podadera",
        "F. Toral",
        "CIEMAT",
        "Madrid",
        "Spain",
        "N. Bazin",
        "P. Brédy",
        "P. Carbonnier",
        "G. Devanz",
        "G. Disset",
        "N. Grouas",
        "P. Hardy",
        "V.M. Hennion",
        "H. Jenhani",
        "J. Migne",
        "A. Mohamed",
        "J. Neyret",
        "J. Relland",
        "B. Renard",
        "D. Roudier",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "In the framework of the International Fusion Materials Irradiation Facility (IFMIF)",
        "which consists of two high power accelerator drivers",
        "each delivering a 125 mA deuteron beam at 40 MeV in CW",
        "an accelerator prototype is presently under design and realization for the first phase of the project. This accelerator includes a SRF Linac",
        "which is designed for the transportation and focalization of the deuteron beam up to 9 MeV. This SRF Linac is a large cryomodule of ~6 m long",
        "working at 4.4 K and at the frequency of 175 MHz in continuous wave. It is mainly composed of 8 low-beta HWRs",
        "8 Solenoid Packages and 8 RF Power Couplers. This paper focuses on the recent developments and changes made on the SRF Linac design: following the abandon of the HWR frequency tuning system",
        "initially based on a plunger located inside the central region of the resonator",
        "a new external tuning system has been designed",
        "implying a complete redesign of the resonator and consequently impacting the cryomodule lattice. The recent changes in the design are presented in this paper. In addition",
        "cold tests were performed on a HWR prototype and cold tests results of the magnets prototypes are also presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi004.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI005",
      "title": "Simulations for Mechanical Design of Nozzle for Extrude of Windowless Solid Hydrogen Cryogenic Target",
      "authors": [
        "H. Gassot",
        "C. Commeaux",
        "IPN",
        "Orsay",
        "France",
        "The hydrogen (H2 and D2) target is the determining element of unstable nucleus spectroscopy. This target is proposed for heavy ions beam of several MeV/nucleon in SPIRAL and SPIRAL 2 projects. Without window",
        "the carbone contamination of the hydrogen target could be avoided. Within the project of CHyMENE (Cible d’Hydrogène Mince pour l’Etude des Noyaux Exotiques)",
        "the development of hydrogen target is supported by ANR (Agence National de la Recherche) which federates differents French research institutes such as CNRS and CEA. The IPN Orsay is involved on the conception and simulations of a nozzle which can deliver a solid ribbon of 50 micron thickness; it is a very challenging program since the knowledge about hydrogen solid at 12 K is rare",
        "especially in terms of experimental characterizations. The important work consists at first to propose models of simulations in order to study mechanical behaviours of solid hydrogen at cryogenic temperature under pressure and optimize the geometry parameters as well as rheology properties of nozzle. The mechanical non linear modelling including contact behaviours are presented. The first simulations results are summarized."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi005.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI006",
      "title": "A New External Beamline for Detector Tests",
      "authors": [
        "N. Heurich",
        "F. Frommberger",
        "P. Hänisch",
        "W. Hillert",
        "S. Patzelt",
        "ELSA",
        "Bonn",
        "Germany",
        "At the electron accelerator ELSA",
        "a new external beamline is under construction",
        "whose task is to provide a primary electron beam for detector tests. In the future",
        "the accelerator facility will not only be offering an electron beam to the currently installed double polarization experiments for baryon spectroscopy",
        "but to the new \"Research and Technology Center Detector Physics\" as well. This institution will be established near the accelerator in Bonn and is charged with the development of detectors for particle and astroparticle physics. The requirement for the new beamline is to be able to vary the beam parameters such as beam current and width over a wide range. With the resonance extraction method",
        "it is possible to extract electrons with a maximum energy of 3.2 GeV slowly to the test area. A quasi-continuous external beam current of 1 fA to 100 pA can be offered. A further reduction of the beam current can be realized by utilizing the single-pulse operation mode at ELSA. The beam width can be changed in both transverse directions from 1 mm to 8 mm."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi006.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI007",
      "title": "Increasing the Stability of the Electron Beam of the S-DALINAC",
      "authors": [
        "F. Hug",
        "T. Bahlo",
        "C. Burandt",
        "J. Conrad",
        "L.E. Jürgensen",
        "M. Kleinmann",
        "M. Konrad",
        "T. Kürzeder",
        "N. Pietralla",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "The S-DALINAC is a superconducting recirculating electron accelerator with a final energy of 130 MeV. It operates in cw at 3 GHz. It accelerates beams of either unpolarized or polarized electrons and is used as a source for nuclear- and astrophysical experiments at the university of Darmstadt since 1987. We will report on two future upgrade plans for increasing the operation stability of the accelerator: A high energy scraper system for collimating the beam before it is delivered to the experiments and a rf feedback system to fix the rf phase of the beam leaving the injector linac by measurements on a rf monitor.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi007.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI008",
      "title": "Experience and Benefits from PLM-based Parts Management at European XFEL",
      "authors": [
        "L. Hagge",
        "J.A. Dammann",
        "S. Eucker",
        "A. Frank",
        "J. Kreutzkamp",
        "D. Käfer",
        "D. Szepielak",
        "N. Welle",
        "DESY",
        "Hamburg",
        "Germany",
        "DESY has developed a parts management solution",
        "which is used in the series fabrication of accelerator components for the European XFEL. The parts management solution stores assembly instructions and drawings for each component",
        "and it tracks the assembly progress of each individual component. It offers procedures for quality inspections",
        "for handling non-conformities and for managing changes",
        "and it tracks the current whereabouts and the entire history of each part. The solution is based on DESY's Product Lifecycle Management (PLM) System and integrates several laboratories and suppliers. The poster shows how parts management is used at the European XFEL in the production of the super-conducting rf cavities",
        "in the assembly of the cryomodules and in the assembly of the undulators",
        "and discusses experience and benefits."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi008.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI010",
      "title": "High Energy RF Deflectors for the FERMI@Elettra project",
      "authors": [
        "M. Dal Forno",
        "S. Biedron",
        "D. Castronovo",
        "P. Craievich",
        "S. Di Mitri",
        "D. La Civita",
        "G. Penco",
        "M. Petronio",
        "F. Pradal",
        "L. Rumiz",
        "L. Sturari",
        "D. Wang",
        "D. Zangrando",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "M. Dal Forno",
        "M. Petronio",
        "R. Vescovo",
        "University of Trieste",
        "Trieste",
        "Italy",
        "PMB-ALCEN",
        "PEYNIER",
        "France",
        "Measuring and controlling the longitudinal phase space and the time-slice emittance of the electron bunch at 1.2 GeV entering in the undulator beam-lines",
        "is crucial to obtain high FEL performances. In the FERMI@Elettra machine",
        "two RF deflecting cavities have been installed at the end of the linac",
        "in order to stretch the electron bunch horizontally and vertically",
        "respectively. The two cavities are individually powered by the same klystron and a switch system is used to choose the deflection plane. This paper reports the RF measurements carried out during the acceptance test",
        "the RF conditioning including the breakdown rate measurements. Finally",
        "the commissioning with electron beam of the deflecting structure and a comparison of the measured electron bunch length evaluated by using the two deflectors are also reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi010.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI011",
      "title": "Thermal Simulations of Charge-exchange Stripper Foils for High-melting-point Materials",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Charge-exchange stripper foils can be very quickly broken by high-current beams. Hence",
        "a long-lived foil that can withstand prolonged beam irradiation is eagerly awaited. It is well known that the maximum temperature of the foil plays an important role in the foil lifetime. Therefore",
        "the temperature distribution map and the maximum temperature of the foils were investigated in detail by using simulation software of the finite element method and applications with ANSYS. Moreover",
        "the heating properties of several kinds of high-melting-point materials were researched. According to the results",
        "stripper foils of the same effective thickness showed drastically different maximum temperatures",
        "differing by up to about 200 K. From these results",
        "we show that the emissivity and specific heat of the foil considerably influences its maximum temperature."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi011.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI012",
      "title": "Design of the cERL Vacuum System",
      "authors": [
        "Y. Tanimoto",
        "S. Asaoka",
        "T. Honda",
        "T. Nogami",
        "T. Obina",
        "R. Takai",
        "KEK",
        "Ibaraki",
        "Japan",
        "The compact Energy Recovery Linac (cERL) is being constructed as a test accelerator for the ERL-based future light source at KEK. In the design of the cERL",
        "electron beams with low normalized emittance (0.1 mm·mrad) and high average current (10 mA) are generated at a 500-kV gun",
        "and accelerated up to 125 MeV at superconducting (SC) cavities that make energy recovery. The vacuum system should accommodate such high intensity",
        "ultrashort bunch (0.1 ~ 3 ps) electron beams",
        "and be designed so as to minimize its loss factor. Therefore",
        "low impedance vacuum components",
        "such as zero-gap flanges and rf-shielded screen monitors",
        "have been developed. Extra high and clean vacuum is required in the vicinity of the SC cavities to maintain their high gradient operation",
        "and those beam tubes are coated by Non-Evaporable Getter (NEG) films. Because of the low beam energy",
        "photon absorbers are not necessary and the beam tubes can be made of stainless steel. However",
        "the photon scrubbing effect is so limited that the beam tubes should be ready for in-situ bakeout and are wrapped with thin Kapton heaters",
        "which are also useful for the NEG-coating activation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi012.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI013",
      "title": "Development of Cylindrical-type 1.2 MW High Power Water-load for Super KEKB",
      "authors": [
        "K. Watanabe",
        "K. Ebihara",
        "A. Kabe",
        "K. Marutsuka",
        "M. Nishiwaki",
        "KEK",
        "Ibaraki",
        "Japan",
        "Y. Kawane",
        "A. Miura",
        "Nihon Koshuha Co. Ltd",
        "Yokohama",
        "Japan",
        "We have developed and manufactured CW 1.2 MW high power water-load for the use of the Super KEKB",
        "an electron – positron double-ring collider at KEK. The tank and rf window of the water-load is the circular and cylindrical-type. The material to absorb the rf power is a tap water. This load is equipped on the 3rd port of the circulators to safe the 1.2 MW CW klystrons to drive the ARES cavities in main ring. The operational frequency is 508.9 MHz. A proto-type model of this water-load was fabricated at Sep 2012",
        "and tested using by high power klystron (1 MW) at Oct 2012 at KEK D2-ET station. The result of high power test will be reported in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI014",
      "title": "Bellows with a New RF Shield Made of Metal Braid for High Intensity Proton Accelerators",
      "authors": [
        "N. Ogiwara",
        "J. Kamiya",
        "M. Kinsho",
        "Y. Shobuda",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "Sun-Tech limited",
        "Kobe",
        "Japan",
        "In the 3 GeV-RCS (Rapid cycling Synchrotron) in J-PARC (Japan Accelerator Research Complex) project",
        "large-scale hydro-formed bellows were developed to adjust the gap between the ceramic ducts and/or between the ceramic ducts and the transport ducts. They have been equipped with a newly developed RF shield",
        "because the usual beryllium-copper spring finger contacts were found to be very hard (roughly 1000 N/mm) owing to the large size. This contact is made of Ti braid",
        "which consists of wires with a diameter of 0.3 mm. This RF contact is a kind of basket (with two ports) made with the braids. Because of the spring effect",
        "the contact can change shape easily. In addition",
        "the contact can easily connect the different cross sections in a smooth fashion. Furthermore",
        "this structure is almost free from the dust generation",
        "which is one of the most troublesome problems for the usual spring finger contacts. This time",
        "we have constructed reserve bellows with the RF shield made of SUS 316L wires to improve the reliability of user operation. The outline of the bellows will be presented",
        "especially laying emphasis on the mechanical function of the RF shield."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi014.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI015",
      "title": "In-situ Degassing of the Ferrite Cores in the Extraction Kicker Magnets of the J-PARC 3-GeV RCS",
      "authors": [
        "J. Kamiya",
        "Y. Hikichi",
        "M. Kinsho",
        "M. Nishikawa",
        "N. Ogiwara",
        "K. Suganuma",
        "T. Yanagibashi",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "Kicker magnets extract the accelerated beam to the beam transport lines in the RCS of the J-PARC. The kicker magnets mainly consist of Ni-Zn ferrite cores and Al alloy plates",
        "and are installed in a vacuum to prevent discharge because a high voltage is applied for a short period. It is important to reduce the outgassing of water vapor from the ferrite cores. Although the kicker magnets have been working well",
        "recently the vacuum quality became a little poor. Thus",
        "we developed the in-situ degassing method for the ferrite cores. This is achieved by directing the heat from the heat source to the kicker magnet and not to the chamber wall. With the test stand we succeeded to flow almost all the heat toward the kicker magnet and to bake out the ferrite cores about 150°C",
        "maintaining the temperature of the chamber wall less than 50°C. As the previous work with TDS measurements revealed that the absorbed water molecules can be easily removed by the bake-out at 100-150°C in a vacuum",
        "the outgassing from the ferrite cores was successfully reduced. The details of the in-situ degassing method will be reported",
        "including the practical method to reduce the outgassing of the working kickers."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi015.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI016",
      "title": "DESIGN CONSIDERATION OF BEAM DUCTS FOR QUADRUPOLE CORRECTORS IN J-PARC RCS",
      "authors": [
        "J. Kamiya",
        "N. Hayashi",
        "H. Hotchi",
        "M. Kinsho",
        "N. Ogiwara",
        "N. Tani",
        "Y. Watanabe",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "which rapidly correct the tunes",
        "are planned to be installed during the summer shutdown in 2013. The characteristic of the excitation pattern of such quadrupoles (quadrupole corrector) is their fast change of magnetic field",
        "which are more than 200T/s at the fastest point. In this report",
        "we describe a deliberation flow about the design of a vacuum chamber",
        "which is installed in the quadrupole corrector. The effect of eddy current was calculated in the case of the current titanium vacuum chamber. The results showed that the temperature rise was too much (up to ~350oC) and the magnetic field in the vacuum chamber is largely distorted by the eddy current. Therefore we decided to employ an alumina ceramics vacuum chamber",
        "for which we have a past achievement in RCS*. We estimated the displacement and stress",
        "which is caused by the atmospheric pressure",
        "for the alumina ceramics vacuum chamber and vacuum component around it by making the calculation model for the finite element method. It was found that there was no large displacement and stress by installing the alumina ceramics vacuum chamber.",
        "*M. Kinsho",
        "et al. Vacuum 81 (2007) 808."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi016.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI017",
      "title": "Development of Harmonic Field Measurement System with Higher Resolution ADC",
      "authors": [
        "R. Kitahara",
        "Y. Fuwa",
        "Y. Iwashita",
        "Y. Nasu",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "Quadrupole magnets for ILC final focus should be enough strong with the limitation on the external radius",
        "while the vibration of the magnetic center has to be highly avoided to keep the nm sized beam focusing stable at the interaction point a few m downstream from the lens. Gluckstern's 5-ring PMQ singlet seems a good candidate for the purpose",
        "which is under investigation. The precise magnetic harmonic field measurement system is also under development for adjusting each magnet ring and evaluation of the assembled singlet. A rotating magnet system and a rotating coil system are prepared for the former and the latter purposes",
        "respectively. Both systems have 24-bit ADC's for higher resolution. For the rotation coil",
        "a flexible print circuit sheet",
        "where a pair of one turn coils is printed on",
        "is glued on a quartz rod. The two coils located on the quarts rod with the angle difference of 180 degree can separate the odd and even harmonics components by recording both the signals simultaneously to get their sum and difference. The two digitized signals are integrated digitally."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi017.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI018",
      "title": "The Design and Construction of Stripping Probe System for CYCIAE-100",
      "authors": [
        "Shizhong. An",
        "F.P. Guan",
        "P.Z. Li",
        "L.P. Wen",
        "H.D. Xie",
        "Z.G. Yin",
        "T.J. Zhang",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "A 100 MeV H− compact cyclotron is being constructed in China Institute of Atomic Energy (CYCIAE-100). 75 MeV - 100 MeV proton beams with 200 μA beam intensity will be extracted in dual opposite directions by charge exchange stripping devices. Two stripping probes with carbon foils are inserted radially in the opposite direction from the main magnet pole and the obtained two proton beams after stripping foil are transported into the crossing point in a combination magnet center separately under the fixed main magnetic field. Because of the large energy range of the extracted beam",
        "the stripping probe system is the most critical and complicated device in the dual extraction. In order to save the foil changing time",
        "the structure of the foil changing system in the vacuum is adopted. The foil automatic changing machine is outside the magnetism yoke and 12 pieces foil can be changed in one time. The design and fabrication of the probe system has been finished and it is going to the progress of installation and adjusting. The experimental verification on probe rod driving and foil changing system has been finished in 2010. The whole stripping extraction system will be installed in 2013."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi018.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI019",
      "title": "Main Magnet Installation for CYCIAE-100",
      "authors": [
        "Y.L. Lu",
        "W. Jing",
        "Z.H. Wang",
        "T.J. Zhang",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "The CYCIAE-100 proton cyclotron being constructed in CIAE is designed to extract the proton beam of 100MeV and 200uA. The main magnet is the importantest part of the cyclotron. The diameter of the CYCIAE-100 main magnet is 6160mm. Its height is 3860mm. Its total weight is about 416 tons",
        "and the largest part is about 170 tons. The beamline of CYCIAE-100 will be connected to the HI-13 tandem accelerator at CIAE. So",
        "the CYCIAE-100 main magnet should be installed accurately. The vertical tolerance of the CYCIAE-100 main magnet is 0.20mm",
        "and the horizontal tolerance is 0.50mm. The CYCIAE-100 main magnet is located in an underground building which level is -4m. There is a horizontal hole on the west wall of the accelerator building. All parts of the main magnet had been transported through this horizontal hole. The CYCIAE-100 main magnet had been installed in November 2012 at CIAE. In fact the error of installation is: the vertical 0.10mm",
        "the horizontal 0.20mm. The installation process will be shown in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi019.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI020",
      "title": "Radiation Shielding Design for Medical Cyclotrons",
      "authors": [
        "F. Wang",
        "T. Cui",
        "X.L. Jia",
        "Z.G. Li",
        "T.J. Zhang",
        "X.Z. Zhang",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "With the increasing applications of cyclotrons in health care",
        "a number of cyclotrons ranging from several MeVs to hundreds MeVs have used for radio diagnostic and radiation therapy. A 14 MeV PET cyclotron",
        "CYCIAE-14",
        "has been installed in a shielding building for tests at CIAE that can be used for FDG production and boron neutron capture therapy (BNCT). In the mean time",
        "the development of a 235MeV cyclotron",
        "CYCIAE-235",
        "which can be used for proton therapy",
        "is in progress at the same laboratory. In terms of the cyclotron application in factories and hospitals",
        "an appropriate radiation shielding design is of critical importance. In the case of CYCIAE-14 and CYCIAE-235",
        "the neutron source of different cyclotrons has been estimated to define the thickness of the total shielding",
        "and the concrete is selected as the main shielding material. For CYCIAE-14 specifically",
        "local shielding has been implemented. This paper will give an introduction to the radiation shielding design for CYCIAE-14 and CYCIAE-235 respectively. The typical layout for the application of the two machines is presented in this paper which can be applied in factories and hospitals as well."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi020.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI022",
      "title": "The M-C Application in Designing Tailored Cryopump Used in Cyciae-100 Cyclotron",
      "authors": [
        "S.P. Zhang",
        "Z.G. Li",
        "G.F. Pan",
        "J.S. Xing",
        "F. Yang",
        "T.J. Zhang",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "A compact high intensity cyclotron CYCIAE-100 was selected as the driver for the Beijing Radioactive Ion Facility (BRIF). A pressure of 5×10-8 mbar is required to achieve acceptable beam losses in the CYCIAE-100 cyclotron. As the existing ports on the cyclotron valley are insufficient to provide enough pumping speed using commercially available pumps",
        "two tailored cryopanels with a pumping speed of 60000 l/s for each are designed. Based on the Monte-Carlo method",
        "a mathematical model of molecular movement and collision between the panels and their shield was developed. The ratio of molecular reflected to the baffle to molecular passing through the baffle is the sticking probability on the panels. When taking the transmission probability of the chevron baffle",
        "capture coefficient of cryopanel can be calculated. It could provide a reference to design the cryopanel shape and its condensation area."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi022.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI023",
      "title": "A Newly Developed High Directivity X-band Waveguide Directional Coupler",
      "authors": [
        "X. He",
        "X. Wang",
        "F. Zhao",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "A new X-band waveguide directional coupler working at 11.9924 GHZ is designed. Four holes symmetrical to the structure is drilled along the central line of the narrow-wall",
        "which is used to couple the electromagnetic power from the main-waveguide to the sub-waveguide. The final prototype has got a measurement result of 32.2 dB Directivity (-47.0 dB Coupling Degree) together with a very low VSWR (1.067) and Insertion Loss (-0.11 dB) at 11.9924 GHz. The vacuum performance is also qualified."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI024",
      "title": "Application of Electropolishing in CSNS/RCS Primary Collimator Scrapers",
      "authors": [
        "L. Kang",
        "Z.X. He",
        "H. Qu",
        "J.B. Yu",
        "Y.Q. Zou",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "According to the requirements for the beam collimation system physical design of the rapid cycling synchrotron (RCS) of China Spallation Neutron Source (CSNS)",
        "the primary collimator scrapers are made of 0.17±0.005mm thickness tungsten sheets. The machining of the tungsten sheet is very difficult because of high hardness and characteristics of the intrinsic brittleness of tungsten. In this paper",
        "electropolishing processing methods is used for tungsten sheets processing. A special electropolishing device is designed according to the principle and process of electropolishing. The processing of tungsten sheets are finally completed after a series of experiments. And the rules of electropolishing for tungsten sheet processing are obtained according to the experimental results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi024.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI025",
      "title": "Design and Experimental Results of an Electro-static Pre-chopper for CSNS LEBT",
      "authors": [
        "H.C. Liu",
        "S. Fu",
        "K.Y. Gong",
        "H.F. Ouyang",
        "J. Peng",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The China Spallation Neutron Source (CSNS) front end incorporates a pre-chopper in the Low Energy Beam Transport line (LEBT) that will remove a 530ns section of beam at approximately 1MHz rate",
        "which is the RF frequency of the ring at injection. It’s one of the most critical devices for properly controlling the injecting beam loss. Physical designing of the pre-chopper is carried out",
        "and the RFQ itself was used as the beam dump of the chopper system. In order to examine the reliability of the pre-chopper design",
        "the beam study of a similar chopper system was successfully performed. Results of physical design and experiments will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi025.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI026",
      "title": "DESIGN OF CSNS R DUMP WINDOW",
      "authors": [
        "L. Liu",
        "L. Kang",
        "X.J. Nie",
        "H. Qu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The China Spallation Neutron Source (CSNS) accelerator systems will provide a 1.6 Gev proton beam to a target for neutron production. The extraction dump is used to incept the waste beam in the Ring-Target transport line. At the end of the beam pipe",
        "we adopt a thin window to ensure the accelerator vacuum. When beam gets across the window",
        "temperature of the window will be elevator because of the energy deposit. So",
        "the study on structure and thermal stress analysis is necessary. This article expatiates the way on calculating the energy deposit and thermal stress analyses."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi026.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI027",
      "title": "STUDY ON STRUCTURE AND THERMAL ANALYSIS OF CSNS R BEAM DUMP",
      "authors": [
        "L. Liu",
        "L. Kang",
        "X.J. Nie",
        "H. Qu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The China Spallation Neutron Source (CSNS) accelerator systems will provide a 1.6 Gev proton beam to a target for neutron production. Beam dump system is an important part of CSNS",
        "and it is used to incept the waste beam. The beam dump system is composed with vacuum part and shielding part. For the design of shielding part",
        "the material is steel at the centre and concrete outside",
        "we must control the temperature of steel and concrete not too high",
        "and it will be a serious problem that the concrete crazes because of the high temperature. So the thermal analyses must be done to ensure safety. Taking CSNS R dump for example",
        "we use software to make model and analyze the thermal",
        "then optimizing the result. According to the result",
        "we control the work time and dimension of the beam to control the temperature of the iron and concrete. This article expatiate the study on the structure design and thermal analyses."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi027.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI028",
      "title": "Anti-earthquake Structural Design for CSNS Beam Dump",
      "authors": [
        "X.J. Nie",
        "L. Kang",
        "L. Liu",
        "H. Qu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "To ensure the beam dump shield iron can resist the damage of earthquake and maintain the normal protective capability",
        "anti-earthquake design was carried out in this paper. The parts for seismic resistance were designed according to the feature of foundation building. The force model was reached through the analysis of seismic load. The structure dimension was decided on the basis of the theory of strength. A pre-buried plate with hooks was achieved and the force model was simplified as fixed end. The minimal diameter of hook showed 30mm. The fixing device with plate decreases the precision requirement of foundation building and can be used to fix the shield iron to resist the earthquake."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi028.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI029",
      "title": "The Structure Design and Analysis of Proton Beam Window for CSNS",
      "authors": [
        "H.J. Wang",
        "L. Kang",
        "R.H. Liu",
        "H. Qu",
        "D.H. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The proton beam window (PBW) is one of the key devices of China Spallation Neutron Source (CSNS). In this paper",
        "a new designed PBW structure called single-double layer structure is discussed. The new structure will be used in CSNS",
        "and it is designed based on the beam characteristic of CSNS",
        "which power is 100 kW. The structure design and thermal-analysis are presented",
        "and the convective coefficient of cooling water is calculated. Besides",
        "the radiation damage is discussed to assure there is no danger of radiation lifetime of PBW."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi029.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI031",
      "title": "Development of Beam Collimators for the 1.6 GeV Rapid Cycling Synchrotron of CSNS",
      "authors": [
        "J.B. Yu",
        "pf.He. He",
        "L. Kang",
        "H. Qu",
        "Y.Q. Zou",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "In order to reduce the uncontrolled losses in the localized station",
        "the beam collimation system has been performed for the 1.6GeV synchrotron of CSNS. The CSNS/RCS transverse collimation system is designed to be a two-stage system which consists of one primary collimator and four secondary collimators. Much work about machinery design and manufacture of the collimation system has been done till now. This paper will show the exterior frame of collimation system by considering the physical demands and spatial position. Then the progress which contains design and machining of collimators will also be introduced. Finally some problems which are mainly about the design of secondary collimators will be mentioned."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi031.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI032",
      "title": "The Design and Analysis of Proton Beam Window for CSNSIII",
      "authors": [
        "H.J. Wang",
        "L. Kang",
        "R.H. Liu",
        "H. Qu",
        "D.H. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The proton beam window (PBW) is one of the key devices of China Spallation Neutron Source (CSNS). When the beam power of CSNS upgrades from 100kw to 500kw (CSNSIII)",
        "the present single-double layer structure of PBW cannot meet the demands. The PBW will be changed to other structure. This paper discusses sandwiched structure and multiple pipe structure",
        "and the later one is chosen as the PBW of CSNSIII. An appropriate convective coefficient of cooling water is chosen",
        "based on which the detailed thermal-stress analysis is presented. Besides",
        "the lifetime is estimated. All these analyses show the designed PBW can work well in CSNSIII."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi032.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI035",
      "title": "Design of A 4-cavities Collinear Load Coated with FeSiAl Alloy for 14 MeV LINAC",
      "authors": [
        "F. Zhang",
        "L.G. Shen",
        "USTC/PMPI",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Collinear load is a substitute for waveguide load to miniaturize linear accelerator and make the beam quality better. Coating with a kind of high efficient microwave-absorbing material FeSiAl alloy",
        "a collinear load section composed of 4 cavities (at 2 /3 mode) with different coating dimensions is designed to absorb 4kW remnant power. Cavity dimensions are adjusted to compensate the frequency shift from 2856 MHz respectively. Simulation shows the loss material FeSiAl only need to be coated on the inner surface of the ring. This makes the design and construction of the cooling system for the load segment easier. Coming with a specific water cooling system can makes the working frequency of the accelerator and the collinear load more close to the supposed. Eventually",
        "based on optimized uniform power absorption principle concluded from the simulation of temperature field",
        "a four-cavity collinear load is designed with one-way attenuation of 76.1 dB",
        "while the largest shift from operation frequency is 35 kHz."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi035.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI040",
      "title": "DEVELOPMENT OF A TARGET SYSTEM FOR RARE ISOTOPE BEAM PRODUCTION WITH HIGH-POWER HEAVY-ION BEAMS*",
      "authors": [
        "J.-W. Kim",
        "S. Hong",
        "J.H. Kim",
        "M. Kim",
        "J. Song",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "To produce rare isotope beams",
        "in-flight fragmentation method utilizing a thin target and heavy-ion primary beam can be used. The existing facilities provide the maximum primary beam power of a few kW",
        "while the next generation facility is planned to use hundreds of kW of 238U beam. We are designing a rare-isotope beam facility",
        "which can provide U beam with the maximal power of 400 kW at the energy of 200 MeV/u. The high-power target studied is made of multi-slice rotating graphite to enhance radiation cooling. The total target thickness is roughly 2 mm with more than 10 slices. The resultant power density inside the target reaches above 50 MV/cm3. Numerical simulation for thermo-mechanical analysis has been performed using PHITS and ANSYS for single and multi-slice targets. Also",
        "empirical test was made using 70-keV electron beam for a single-slice rotation target with the thickness of 0.2 mm. The results of simulation and e-beam tests will be presented.",
        "* Work supported by Rare Isotope Science Program (RISP) through the National Research Foundation of Korea (NRF) funded by Ministry of Science",
        "ICT and Future Planning (MSIP) (2011-0032011)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi040.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI041",
      "title": "Installation and Operation of the Beamlines for the 100-MeV Proton Linac",
      "authors": [
        "B.-S. Park",
        "Y.-S. Cho",
        "J.-H. Jang",
        "D.I. Kim",
        "H.S. Kim",
        "H.-J. Kwon",
        "J.Y. Ryu",
        "K.T. Seol",
        "Y.-G. Song",
        "S.P. Yun",
        "KAERI",
        "Daejon",
        "Republic of Korea",
        "Beamlines and 100-MeV proton linac have been developed for 1st phase of KOMAC(Korea Multi-purpose Accelerator Complex) at the Gyeong-ju site. The linac supply either 20-MeV or 100-MeV proton beams for beam applications. Each proton beam can be transported to 2 beamlines for industrial purpose and 3 beamlines for various researches. At the first phase",
        "2 beamlines were installed and under test. A detailed description of the installation and the preliminary test results will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi041.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI042",
      "title": "Design Considerations for Phase Reference Distribution System at ESS",
      "authors": [
        "ESS",
        "Lund",
        "Sweden",
        "Lund University",
        "Lund",
        "Sweden",
        "PRDS (Phase Reference Distribution System) will be serving as the phase alignment line for all cavities with high phase stability. With the current design of individually RF source powering for most cavities at ESS",
        "phase reference distribution system should provide the reference signals for totally 34 LLRF systems at 100 meters long low-frequency section (for all 352.21MHz cavities",
        "including RFQ",
        "DTL",
        "bunching cavities and spokes)",
        "and for totally 180 LLRF systems at 342 meters long high-frequency section (for all 704.42MHz cavities",
        "including medium beta and high beta elliptical cavities). Coaxial cable based solution and optical fibre based solution are discussed in this note for PRDS (Phase reference distribution system) at ESS. Some possible schemes in each of these two distribution solutions are introduced and comparisons among these schemes are made. Some effort is made as well to find out a reasonable design for PRDS at ESS."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi042.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI043",
      "title": "The Status of the Vacuum System of the MAX IV Laboratory",
      "authors": [
        "E. Al-Dmour",
        "J. Ahlbäck",
        "D. Einfeld",
        "M.J. Grabski",
        "P.F. Tavares",
        "MAX-lab",
        "Lund",
        "Sweden",
        "Solaris",
        "Kraków",
        "Poland",
        "All the vacuum chambers of the 3 GeV storage ring of MAX IV laboratory are under production. NEG coating R&D has been done to validate technical solutions for the coating process. The standard vacuum chambers for the 1.5 GeV ring of MAX IV and Solaris are designed and they are in the procurement process. We present an update in the technical design of the vacuum chambers following the interaction with the manufacture",
        "the implications on the production due to NEG coating and the design of the vacuum chambers of the 1.5 GeV storage ring."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi043.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI044",
      "title": "NEG Thin Film Coating Development for the MAX IV Vacuum System",
      "authors": [
        "M.J. Grabski",
        "J. Ahlbäck",
        "E. Al-Dmour",
        "P.F. Tavares",
        "MAX-lab",
        "Lund",
        "Sweden",
        "S. Calatroni",
        "P. Chiggiato",
        "P. Costa Pinto",
        "M. Taborelli",
        "CERN",
        "Geneva",
        "Switzerland",
        "The new synchrotron radiation facility of the MAX IV laboratories is under construction and expected to deliver the first light beam in 2016. To cope with the small aperture",
        "the intense photon bombardment and the low-pressure requirement",
        "most of the beam pipes for the 3-GeV ring are going to be coated with Ti-Zr-V non-evaporable getter (NEG) thin films. To take advantage from the experience acquired during the construction of the Large Hadron Collider (LHC)",
        "collaboration between CERN and MAX IV Laboratories has been set up. The choice of the extruded Cu tubes",
        "the preliminary surface treatments",
        "the coating configuration",
        "and the performance validation of the small-diameter vacuum chambers have been addressed. In parallel",
        "an intense development has been tackled at CERN for the coating of vacuum chambers where photon and electron beams circulate in separate pipes. The most important results of the collaboration are presented and future perspectives pointed out."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi044.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI045",
      "title": "Reliability Approach for Machine Protection Design in Particle Accelerators",
      "authors": [
        "A. Apollonio",
        "J.-B. Lallement",
        "B. Mikulec",
        "B. Puccio",
        "J.L. Sanchez Alvarez",
        "R. Schmidt",
        "S. Wagner",
        "CERN",
        "Geneva",
        "Switzerland",
        "Particle accelerators require Machine Protection Systems (MPS) to prevent beam induced damage of equipment in case of failures. This becomes increasingly important for proton colliders with large energy stored in the beam such as LHC",
        "for high power accelerators with a beam power of up to 10 MW",
        "such as the European Spallation Source (ESS)",
        "and for linear colliders with high beam power and very small beam size. The reliability of Machine Protection Systems is crucial for safe machine operation; all possible sources of risk need to be taken into account in the early design stage. This paper presents a systematic approach to classify failures and to assess the associated risk",
        "and discusses the impact of such considerations on the design of Machine Protection Systems. The application of this approach will be illustrated using the new design of the MPS for LINAC 4",
        "a linear accelerator under construction at CERN."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI046",
      "title": "First Results of an Experiment on Advanced Collimator Materials at CERN HiRadMat Facility",
      "authors": [
        "A. Bertarelli",
        "O. Aberle",
        "R.W. Aßmann",
        "E. Berthomé",
        "V. Boccone",
        "M. Calderón Cueva",
        "F. Carra",
        "F. Cerutti",
        "N. Charitonidis",
        "C. Charrondière",
        "A. Dallocchio",
        "M. Donzé",
        "P. Francon",
        "M. Garlaschè",
        "L. Gentini",
        "M. Guinchard",
        "N. Mariani",
        "A. Masi",
        "P. Moyret",
        "S. Redaelli",
        "A. Rossi",
        "S.D.M. dos Santos",
        "CERN",
        "Geneva",
        "Switzerland",
        "Universidad San Francisco de Quito",
        "Cumbayá",
        "Colombia",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "L. Peroni",
        "M. Scapin",
        "Politecnico di Torino",
        "Torino",
        "Italy",
        "A comprehensive",
        "first-of-its-kind experiment (HRMT-14) has been recently carried out at CERN HiRadMat facility on six different materials of interest for Beam Intercepting Devices (collimators",
        "targets",
        "dumps). Both traditional materials (Mo",
        "W and Cu alloys) as well as advanced metal/diamond and metal/graphite composites were tested under extreme conditions as to pressure",
        "density and temperature",
        "leading to the development of highly dynamic phenomena as shock-waves",
        "spallation",
        "explosions. Experimental data were acquired",
        "mostly in real time",
        "relying on extensive embarked instrumentation (strain gauges",
        "temperature and vacuum sensors) and on remote acquisition devices (laser Doppler vibrometer and high speed camera). The experiment was a success under all points of view in spite of the technological challenges and harsh environment. First measurements are in good agreement with results of complex simulations",
        "confirming the effectiveness of the acquisition system and the reliability of advanced numerical methods when material constitutive models are completely available. Interesting information has been collected as to thermal shock robustness of tested materials."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI047",
      "title": "Design Guidelines for Ferrite Absorbers Submitted to RF-induced Heating",
      "authors": [
        "A. Bertarelli",
        "M. Garlaschè",
        "CERN",
        "Geneva",
        "Switzerland",
        "The use of ferrite absorbers is one of the most effective means of damping potentially harmful high order RF modes",
        "which may lead to beam instabilities and excessive power losses in accelerator devices. However",
        "the power deposited on ferrite absorbers themselves may lead to ferrite exceeding its Curie temperature",
        "losing its damping properties. An evaluation of the ferrite capability to dissipate deposited heat is hence of paramount importance for the safe design of particle accelerator devices. In this paper",
        "figures of merit are proposed to assess the maximum specific power allowed on a generic ferrite tile",
        "before it reaches its Curie temperature. Due to its inherent brittleness",
        "sufficient contact pressure between ferrite and its housing",
        "allowing heat transmission by conduction",
        "can hardly be applied. A semi-analytical study is thus performed",
        "assuming that ferrite is evacuating heat solely through radiation. The described method is then exemplified in the case of the BPM-embedded tertiary collimator (TCTP) designed in the framework of the LHC collimation upgrade."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi047.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI049",
      "title": "Evaluation of the NEG Coating Saturation Level after 3 Years of LHC Beam Operation",
      "authors": [
        "G. Bregliozzi",
        "V. Baglin",
        "J.M. Jimenez",
        "G. Lanza",
        "T. Porcelli",
        "CERN",
        "Geneva",
        "Switzerland",
        "The room temperature vacuum system of the Large Hadron Collider (LHC) at CERN system has been designed to ensure vacuum stability and beam lifetime of 100 h with nominal current of 0.56 A per beam at 7 TeV of energy. During last two years the LHC operated with proton beams at a maximum energy of 4 TeV",
        "coasting for several hours each time",
        "inducing high pressure due to different effects: synchrotron radiation",
        "electron cloud and localized temperature increase. All these phenomena generated an important gas load from the vacuum chamber walls",
        "which led in some cases to a partial or a total saturation of the NEG coating. To keep the design vacuum performances and to schedule technical interventions for NEG vacuum reactivation",
        "it is necessary to take into account all these aspects and to regularly evaluate the saturation level of the NEG coating. This study analyses the saturation level of the NEG coated beam pipes in the LHC accelerator. Pressure reading variation without proton beams circulating are analysed and combined with laboratory studies of the NEG saturation behaviour and with Vacuum Stability Code (VASCO) simulations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi049.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI050",
      "title": "Some Ideas Towards Energy Optimization at CERN",
      "authors": [
        "H.J. Burckhart",
        "J.-P. Burnet",
        "F. Caspers",
        "V. Doré",
        "L. Gatignon",
        "C. Martel",
        "M. Nonis",
        "D. Tommasini",
        "CERN",
        "Geneva",
        "Switzerland",
        "The paper presents the efforts of CERN to optimize its energy usage. Work is proceeding in 3 areas: accelerators",
        "campus and infrastructure",
        "and re-use of thermal “waste” energy. The accelerator chain has the potential to further reduce the energy consumption by dynamic suppression of cycles when they are temporarily not needed and by operating magnets in pulsed mode. R&D for future accelerators includes the recuperation of the RF energy",
        "which is not used for acceleration of the beams. Concerning the CERN campus more than half of the buildings are older than 40 years. Hence there is a big need for renovation",
        "which includes energy aspects. New buildings use renewable energy whenever possible. As an example a building is under construction",
        "which will use a 250 m2 solar field together with an absorption refrigerator for cooling purposes. Finally",
        "about 80% of the electric energy gets dissipated in air cooling towers. Part of this energy can be re-used for heating buildings."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi050.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI051",
      "title": "Radio-Frequency Multipacting as Quality Control of Coatings for e-Cloud Suppression",
      "authors": [
        "P. Costa Pinto",
        "J. Bauche",
        "S. Calatroni",
        "F. Caspers",
        "P. Edwards",
        "M. Holz",
        "M. Taborelli",
        "CERN",
        "Geneva",
        "Switzerland",
        "To mitigate electron clouds in particle accelerators",
        "a carbon coating with low SEY has been developed. In the case of the SPS (Super Proton Synchrotron)",
        "which belongs to the LHC injector chain",
        "testing the performance of coated beam pipes directly in the accelerator must cope with the schedule of the regular machine operation. For this reason an alternative instrument based on RF induced multipacting in a coaxial configuration has been designed for ex-situ characterization of the main bending dipoles of the SPS. In this contribution we report the results obtained before and after coating for two 6.4 meter dipoles with different cross sections of the vacuum chambers. The multipacting is monitored by measuring the pressure rise and the RF reflected power. After coating",
        "the power threshold to induce multipacting is strongly reduced indicating a lower propensity for electron cloud. The impact of the RF coupling on the sensitivity of the technique is discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi051.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI052",
      "title": "Application of Atmospheric Plasma-sprayed Ferrite Layers for Particle Accelerators",
      "authors": [
        "F. Caspers",
        "M. Betz",
        "S. Federmann",
        "M. Taborelli",
        "CERN",
        "Geneva",
        "Switzerland",
        "K. K.",
        "C.A.M. Schulz",
        "Surface Engineering Institute",
        "RWTH Aachen University",
        "Aachen",
        "Germany",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "A common problem in all kind of cavity like structures in particle accelerators is the occurrence of RF-resonances. Typically",
        "ferrite plates attached to the walls of such structures like diagnostic devices",
        "kickers or collimators",
        "are used to dampen those undesired modes. However the heat transfer rate from these plates to the walls is rather limited. Brazing ferrite plates to the walls is not possible in most cases due to the different thermal expansion coefficients. To overcome those limitations",
        "atmospheric plasma spraying techniques have been investigated. Ferrite layers with a thickness from 50 micron to about 300 micron can be deposited on metallic surfaces like stainless steel exhibiting good thermal contact and still reasonable absorption properties. In this paper the technological aspects of plasma deposition are discussed and results of specifically developed RF loss measurement procedures for such thin magnetically lossy layers on metal are presented. This kind of layers can also be applied for the production of high temperature RF power loads and related examples will be shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi052.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI053",
      "title": "A Feasibility Experiment of a W-powder Target in the HiRadMat Facility of CERN",
      "authors": [
        "N. Charitonidis",
        "I. Efthymiopoulos",
        "A. Fabich",
        "CERN",
        "Geneva",
        "Switzerland",
        "O. Caretta",
        "T.R. Davenne",
        "C.J. Densham",
        "M.D. Fitton",
        "P. Loveridge",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "Granular solid targets made of fluidized tungsten powder or static pebble bed of tungsten spheres",
        "have been long proposed and are being studied as an alternative configurations towards high-power (>1MW of beam power) target systems",
        "suitable for a future Super Beam or Neutrino Factory. Serving the lack of experimental data on this field",
        "a feasibility experiment was performed in HiRadMat facility of CERN/SPS that tried in a pulse-by-pulse basis to address the effect of the impact of the SPS beam (440GeV/c) on a static tungsten powder target. Online instrumentation such as high-speed photography and Laser - Doppler Vibrometry was employed. Preliminary results show a powder disruption speed of less than 0.5 m/s while the disruption height appears to be scaling proportionally with the beam intensity. Other analysis results will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi053.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI054",
      "title": "Preliminary Comparison of the Response of LHC Tertiary Collimators to Proton and Ion Beam Impacts",
      "authors": [
        "M. Cauchi",
        "R.W. Aßmann",
        "A. Bertarelli",
        "F. Carra",
        "F. Cerutti",
        "L. Lari",
        "CERN",
        "Geneva",
        "Switzerland",
        "M. Cauchi",
        "P. Mollicone",
        "UoM",
        "Msida",
        "Malta",
        "IFIC",
        "Valencia",
        "Spain",
        "University of Malta",
        "Information and Communication Technology",
        "Msida",
        "Malta",
        "The CERN Large Hadron Collider is designed to bring into collision protons as well as heavy ions. Accidents involving impacts on collimators can happen for both species. The interaction of lead ions with matter differs to that of protons",
        "thus making this scenario a new interesting case to study as it can result in different damage aspects on the collimator. This paper will present a preliminary comparison of the response of collimators to proton and ion beam impacts."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi054.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI055",
      "title": "First Year of Operations in the HiRadMat Irradiation Facility at CERN",
      "authors": [
        "A. Fabich",
        "N. Charitonidis",
        "N. Conan",
        "K. Cornelis",
        "D. DePaoli",
        "I. Efthymiopoulos",
        "S. Evrard",
        "H. Gaillard",
        "J.L. Grenard",
        "M. Lazzaroni",
        "A. Pardons",
        "Y.D.R. Seraphin",
        "C. Theis",
        "K. Weiss",
        "CERN",
        "Geneva",
        "Switzerland",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "HiRadMat (High Irradiation to Materials) is a new facility at CERN constructed in 2011",
        "designed to provide high-intensity pulsed beams to an irradiation area where material samples as well as accelerator component assemblies can be tested. The facility uses a 440 GeV proton beam extracted from the CERN SPS with a pulse length of 7.2 μs",
        "to maximum pulse energy of 3.4MJ. For 2012",
        "the first year of operations of the facility",
        "nine experiments were scheduled and completed data-taking successfully. The experience gained in operating this unique facility",
        "along with highlights of the experiments and the instrumentation developed for online measurements are reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi055.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI056",
      "title": "Design Study for a Future LAGUNA-LBNO Long-baseline Neutrino Facility at CERN",
      "authors": [
        "I. Efthymiopoulos",
        "J. Alabau-Gonzalvo",
        "A. Alekou",
        "F. Antoniou",
        "M. Benedikt",
        "M. Calviani",
        "A. Ferrari",
        "R. Garoby",
        "F. Gerigk",
        "S.S. Gilardoni",
        "B. Goddard",
        "A. Kosmicki",
        "C. Lazaridis",
        "J.A. Osborne",
        "Y. Papaphilippou",
        "A.S. Parfenova",
        "E.N. Shaposhnikova",
        "R. Steerenberg",
        "P. Velten",
        "H. Vincke",
        "CERN",
        "Geneva",
        "Switzerland",
        "A design study for a long baseline neutrino oscillation experiment (LBNO) with a new conventional neutrino beamline facility (CN2PY) at CERN was initiated in September 2011",
        "supported by EU/FP7 funds. The beam will be aimed at a next generation deep-underground neutrino observatory located at the Pyhasalmi (Finland) mine at a distance of 2300 km. In an initial phase the CN2PY facility will use a 400 GeV beam extracted from SPS up to a maximum power of 750 kW",
        "and in a second phase a 2 MW beam of about 50 GeV produced by a new High-Power Proton Synchrotron accelerator using the LP-SPL as injector also under design. The paper will focus on the design challenges of this MW-class facility and on the optimization studies of the secondary beam elements (target and horns) to produce a neutrino beam spectrum that matches best the experimental requirements for neutrino flavor oscillations and CP-violation tests. The challenges and bottlenecks in the existing CERN accelerator complex to produce the high-intensity beams foreseen for this facility at the initial phase are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi056.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI057",
      "title": "Development of Vacuum Chamber in Low Z Material",
      "authors": [
        "C. Garion",
        "P. Costa Pinto",
        "M.A. Gallilee",
        "J. Perez Espinos",
        "CERN",
        "Geneva",
        "Switzerland",
        "Highly transparent vacuum chambers are more and more required in high energy particle physics. In particular",
        "vacuum chambers in the experiments should be as transparent as possible to minimize the background to the detectors while reducing also the material activation. Beryllium is",
        "so far",
        "the most performing material for this application",
        "but it presents some drawbacks such as brittleness",
        "manufacturing issues",
        "toxic hazard",
        "high cost and low availability. A development work to obtain alternative material to the beryllium with similar performance is being carried out at CERN. Three categories have been defined and considered: raw bulk material",
        "material and structural composites. Main requirements are the vacuum compatibility: leak tightness",
        "low outgassing rate",
        "temperature resistance (in the range 200-230 °C)",
        "transparency",
        "and mechanical stiffness and strength. Carbon is the element with the lowest atomic number after beryllium and that is appropriate for this application. Therefore carbon based materials have been considered in a variety of options. In this paper",
        "several technologies are presented and discussed. Results of preliminary tests on samples are also shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi057.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI058",
      "title": "Qualification of a Glassy Carbon Blade for a LHC Fast Vacuum Valve",
      "authors": [
        "C. Garion",
        "P. Coly",
        "CERN",
        "Geneva",
        "Switzerland",
        "To protect sensitive LHC machine systems against an unexpected gas inrush",
        "a fast vacuum valve system is under development at CERN. The design of the shutter has to be compatible with dynamic loads occurring during the fast closure",
        "namely in the 20 ms range. The material has to fulfil all main requirements such as transparency",
        "high melting temperature",
        "dust free and adequate leak tightness. A development of a blade in vitreous carbon material has been carried out at CERN. The blade has been successfully integrated in a commercial pendulum fast valve. In this paper",
        "the vacuum and mechanical qualification tests are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi058.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI059",
      "title": "Robustness Test of a Silicon Strip Crystal for Crystal-assisted Collimation Studies in the LHC",
      "authors": [
        "A. Lechner",
        "J. Blanco Sancho",
        "F. Burkart",
        "M. Calviani",
        "M. Di Castro",
        "Y. Gavrikov",
        "J. Lendaro",
        "F. Loprete",
        "R. Losito",
        "C. Maglioni",
        "A. Masi",
        "S. Montesano",
        "A. Perillo-Marcone",
        "P.S. Roguet",
        "W. Scandale",
        "D. Wollmann",
        "CERN",
        "Geneva",
        "Switzerland",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "PNPI",
        "Gatchina",
        "Leningrad District",
        "Russia",
        "V. Guidi",
        "A. Mazzolari",
        "INFN-Ferrara",
        "Ferrara",
        "Italy",
        "V. Guidi",
        "A. Mazzolari",
        "UNIFE",
        "Ferrara",
        "Italy",
        "LAL",
        "Orsay",
        "France",
        "Over the past years",
        "the UA9 experiment has successfully demonstrated the viability of enhancing the collimation efficiency of proton and ion beams in the SPS by means of bent crystals. An extension of UA9 to the LHC has been recently approved. The conditions imposed by the LHC operational environment",
        "in particular the tremendous energy density of the beam",
        "require a reliable understanding of the crystal integrity in view of potential accident scenarios such as an asynchronous beam dump. For this purpose",
        "irradiation tests have been performed at the CERN-HiRadMat facility to examine the mechanical strength of a silicon strip crystal in case of direct beam impact. The tests were carried out using a 440 GeV proton beam of 0.5 mm transverse size. The crystal",
        "3 mm long in beam direction",
        "was exposed to a total of 2*1014 protons",
        "with individual pulse intensities reaching up to 3*1013. First visual inspections reveal no macroscopic damage to the crystal. Complementary post-irradiation tests are foreseen to assess microscopic lattice damage as well as the degradation of the channelling efficiency."
      ],
      "institutions": [],
      "abstract": "On behalf of the UA9 Collaboration.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi059.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI060",
      "title": "Development, Validation and Application of a Novel Method for Estimating the Thermal Conductance of Critical Interfaces in the Jaws of the LHC Collimation System",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "The motivation for this project arises from the difficulty in quantifying the manufacturing quality of critical interfaces in the water cooled jaws of the TCTP and TCSP (Target Collimator Tertiary Pickup and Target Collimator Secondary Pickup) collimators. These interfaces play a decisive role in the transfer of heat deposited by the beam towards the cooling system avoiding excessive deformation of the collimator. Therefore",
        "it was necessary to develop a non-destructive method that provides an estimation of the thermal conductance during the acceptance test of the TCTP and TCSP jaws. The method is based on experimental measurements of temperature evolution and numerical simulations. By matching experimental and numerical results it is possible to estimate the thermal conductance in several sections of the jaw. A simplified experimental installation was built to validate the method",
        "then a fully automatic Test-Bench was developed and built for the future acceptance of the TCTP/TCSP jaws which will be manufactured and installed in the LHC. This novel method has shown its validity and has become a decisive tool for the development of the new generation of LHC collimators."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi060.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI061",
      "title": "Design Process of the Interlock Systems for the Compact Linear Collider",
      "authors": [
        "P. Nouvel",
        "M. Jonker",
        "B. Puccio",
        "CERN",
        "Geneva",
        "Switzerland",
        "INPT",
        "Toulouse",
        "France",
        "Interlock systems are a critical part for the machine protection of linear colliders. Their goal is to inhibit the next pulse either on failure of critical equipment and/or on low beam quality evaluation. This paper presents the on-going process to validate design choices for the Compact Linear Collider (CLIC) interlock systems. The design process starts by establishing requirements. In mission-critical system case",
        "they are mainly focused on the dependability. Moreover",
        "the new concept of fast beam quality analysis has been introduced into the CLIC interlock system and will be discussed in this paper. To support the design process",
        "experimentation on this concept has been launched. In addition",
        "a hardware demonstration of the interlock systems has been set-up. It allows validating the design in concordance with the requirements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi061.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI062",
      "title": "Design of Air-cooled Beam Dump for Extraction Line of PS Booster",
      "authors": [
        "A. Perillo-Marcone",
        "T. Antonakakis",
        "M. Battistin",
        "M.A. Czapski",
        "G.W. Mason",
        "E.M. Nowak",
        "A. Sarrió Martínez",
        "S. Sgobba",
        "V. Venturi",
        "V. Vlachoudis",
        "CERN",
        "Geneva",
        "Switzerland",
        "A new beam dump has been designed",
        "which withstands the future proton beam extracted from the PS Booster at CERN",
        "consisting of up to 1014 protons per pulse at 2 GeV after its upgrade in 2018/2019. In order to be able to efficiently release the deposited heat",
        "the new dump will be made out of a single cylindrical block of a copper alloy and be cooled by forced ventilation. In order to determine the energy density distribution deposited by the beam in the dump",
        "Monte Carlo simulations were performed using FLUKA",
        "and thermo-mechanical analyses carried out by importing the energy density into Ansys. In addition",
        "CFD simulations of the airflow were carried out in order to accurately estimate the heat transfer convection coefficient on the surface of the dump. In this paper we describe the design process and highlight the constraints of integrating a new dump for increased beam power into the existing facility."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi062.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI063",
      "title": "Development and Beam Tests of an Automatic Algorithm for Alignment of LHC Collimators with Embedded BPMs",
      "authors": [
        "University of Malta",
        "Information and Communication Technology",
        "Msida",
        "Malta",
        "DESY",
        "Hamburg",
        "Germany",
        "R. Bruce",
        "M. Gasior",
        "D. Mirarchi",
        "A.A. Nosych",
        "S. Redaelli",
        "B. Salvachua",
        "N.J. Sammut",
        "CERN",
        "Geneva",
        "Switzerland",
        "Collimators with embedded Beam Position Monitor (BPM) buttons will be installed in the LHC during the upcoming long shutdown period. During the subsequent operation",
        "the BPMs will allow the collimator jaws to be kept centered around the beam trajectory. In this manner",
        "the best possible beam cleaning efficiency and machine protection can be provided at unprecedented higher beam energies and intensities. A collimator alignment algorithm is proposed to center the jaws automatically around the beam. The algorithm is based on successive approximation",
        "as the BPM measurements are affected by non-linearities",
        "which vary with the distance between opposite buttons",
        "as well as the difference between the beam and the jaw centers. The successful test results",
        "as well as some considerations for eventual operation in the LHC are also presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi063.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI064",
      "title": "Crystal-assisted Collimation Experiment from the SPS to the LHC",
      "authors": [
        "W. Scandale",
        "D. Mirarchi",
        "S. Redaelli",
        "CERN",
        "Geneva",
        "Switzerland",
        "UA9 was operated in the CERN-SPS for more than six years in view of investigating the feasibility of the halo collimation assisted by bent crystals. Two-millimeter-long silicon crystals",
        "with bending angles of about 150 μrad",
        "are used as primary collimators. The crystal collimation process is obtained consistently through channeling with high efficiency",
        "showing a steady reduction of almost one order of magnitude of the loss rate at the onset of the channeling process. This result holds both for protons and for lead-ions. The corresponding loss map in the accelerator ring is accordingly reduced. These observations strongly support our expectation that the coherent deflection of the beam halo by a bent crystal should enhance the collimation efficiency also in LHC. After a concise description of the results collected in the SPS we propose a scenario to integrate bent crystals in the LHC collimation system for machine experiment."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi064.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI064",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI065",
      "title": "Thermo-mechanical Investigations of the SINQ \"Cannelloni\" Target",
      "authors": [
        "R. Sobbia",
        "S. Dementjevs",
        "S. Joray",
        "M. Wohlmuther",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Numerical results of three-dimensional ANSYS thermo-mechanical simulations of single components of the SINQ target system are presented. Thermal stresses are generated by energy deposition in so-called ‘‘cannelloni'' consisting of a Zircaloy-2 rod filled with Lead to 90% of its inner volume. The molten region of the inner Lead filling is calculated by thermal analysis using the energy deposition profile imported from MCNPX calculations. Induced mechanical stresses are studied for a set of predefined parameters",
        "the heat transfer coefficient and the bulk temperature of the heavy water cooling system. Critical stress regions are investigated to provide possible failure scenarios and overall system performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi065.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI066",
      "title": "Performance Enhancement of Electrical Power System at NSRRC",
      "authors": [
        "T.-S. Ueng",
        "J.-C. Chang",
        "Y.F. Chiu",
        "K.C. Kuo",
        "Y.-C. Lin",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "A lot of efforts have been devoted to improve the reliability",
        "the stability and the power quality of NSRRC electrical power system in recent years. These improvements include the power factor correction",
        "solving nuisance tripping of air circuit breakers",
        "replacing old-type capacitor banks",
        "installing automatic voltage regulators and designing multi-source backup system with automatic transfer switch. All these improvement works are to ensure the reliable operation of NSRRC power system and reduce the electrical power accidents during the normal operation. Further",
        "it can also provide the convenience for the electric power dispatching of NSRRC during the regular maintenance of power system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi066.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI067",
      "title": "The Mechanical Design, Fabrication, and Performance of the DCCT for TPS",
      "authors": [
        "C.-C. Chang",
        "C.K. Chan",
        "J.-R. Chen",
        "G.-Y. Hsiung",
        "H.P. Hsueh",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Tsing Hua University",
        "Hsinchu",
        "Taiwan",
        "This paper describes the DC current transformers (DCCT)",
        "designed and fabricated for Taiwan Photon Source (TPS); including the mechanical structure",
        "dissimilar material welding process for the DCCT chamber",
        "electronically and vacuum performance testing. In the structure",
        "a ceramic break disc is provided and jointed between to ends of the beam duct. The electrical connection path is interrupted in the beam duct adjacent to the transformer. To avoid the sensor measured the wall current and other unnecessary circulating currents. The DCCT toroid is independent installed outside of a vacuum beam duct to measure the average beam current. In order to reduce the influence of external magnetic field for the sensor",
        "two layers of Mu metal shell are installed. The performance and progress for the DCCT are described in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi067.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI068",
      "title": "Status of the Utility System Construction for the 3 GeV TPS Storage Ring",
      "authors": [
        "J.-C. Chang",
        "W.S. Chan",
        "J.-R. Chen",
        "Y.F. Chiu",
        "Y.-C. Chung",
        "C.W. Hsu",
        "K.C. Kuo",
        "Y.-C. Lin",
        "C.Y. Liu",
        "Y.-H. Liu",
        "Z.-D. Tsai",
        "T.-S. Ueng",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The construction of the utility system for the 3.0 GeV Taiwan Photon Source (TPS) was started in the end of 2009. The utility building for the TPS ring has been completed in the end of 2012. Main utility equipment has been installed inside. The whole construction of the utility system is scheduled to be completed in the mid of 2013. Total budget of this construction is about four million dollars. This utility system presented in this paper includes the electrical power",
        "cooling water",
        "air conditioning",
        "compressed air and fire control systems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi068.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI069",
      "title": "Power Saving Status in the NSRRC",
      "authors": [
        "J.-C. Chang",
        "Y.F. Chiu",
        "Y.-C. Chung",
        "C.W. Hsu",
        "Y.-C. Lin",
        "C.Y. Liu",
        "Z.-D. Tsai",
        "T.-S. Ueng",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Synchrotron Radiation Research Center (NSRRC)",
        "Taiwan will complete the construction of the civil and utility system engineering of the Taiwan Photon Source (TPS) in the mid of 2013. The power consumption of the TPS is estimated about 2.3 times of that of the existing Taiwan Light Source (TLS). To cope with increasing power requirement in the near future",
        "we have been conducting several power saving schemes",
        "which include power requirement control",
        "optimization of chillers operation",
        "air conditioning system improvement",
        "power factor improvement",
        "application of heat pump",
        "and publishing monthly power saving report. We will also connect the main pipes of TLS and TPS chilled water systems to obtain more efficient operation in 2013."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi069.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI069",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI070",
      "title": "Event Based System to Manage the Maintenance of Taiwan Photon Source",
      "authors": [
        "C.W. Hsu",
        "C.S. Chen",
        "C.Y. Liu",
        "Z.-D. Tsai",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "This paper presents a model of event based maintenance management system to provide commission condition of utility facility. The system adopts cloud servers with structured query language (SQL) database to deal with all utility facility information. The system collects all event condition",
        "including scheduled maintenance",
        "troubleshooting",
        "alert information and equipment specifications. The user can easily access all the facility information in mobile devices by scanning the quick response (QR) tag. The system can increase system reliability",
        "decrease maintenance cost",
        "minimize not programmed shutdowns and enhance system performance. Besides",
        "the system can also provide enough information to schedule maintenance order by user or preventive and optimize energy usage."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi070.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI070",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI071",
      "title": "Baking Tests and Results of A1050 Diamond Edge Gasket",
      "authors": [
        "Y.T. Huang",
        "C.-C. Chang",
        "J.-R. Chen",
        "G.-Y. Hsiung",
        "S-N. Hsu",
        "H.P. Hsueh",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Tsing Hua University",
        "Hsinchu",
        "Taiwan",
        "A1050 is a common and soft material",
        "widely used in everyday life. It is machinable and cheap",
        "which makes it a candidate for a gasket material. In the case of sealing between disparate materials",
        "treating the thermal expansion when the gasket suffers from baking is difficult. The clearance and the eccentricity between the gasket and the flange are also important; most leaks occur about 80 ~ 110 oC. The experimental apparatus comprised a vacuum chamber with six diamond-edge gaskets assembled",
        "a turbo-molecular pump and an extractor gauge. The pre-baking torque for this gasket is 70 – 80 kg cm; the rates of both heating and cooling are less than 40 oC per hour. The gaskets are baked repeatedly under the same conditions excluding the target temperature set for baking. A1050 diamond gaskets work well after baking at 120 ~ 140 oC; at temperature 170 ~ 180 oC",
        "leaks sometimes appear on cooling. This paper presents the baking results of A1050 diamond-edge gasket and explains the cause of leaking after baking above 150 oC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi071_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi071.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi071_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI071",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI072",
      "title": "Heat Transfer Analysis of a Water-cooled Channel for the TPS Front End Components",
      "authors": [
        "C.K. Kuan",
        "J.-R. Chen",
        "Y.T. Cheng",
        "J.Y. Chuang",
        "H.Y. Lin",
        "P.A. Lin",
        "Y.K. Liu",
        "I.C. Sheng",
        "T.C. Tseng",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Tsing Hua University",
        "Hsinchu",
        "Taiwan",
        "The masks",
        "absorbers and slits must withstand the extremely high power and power density in the TPS front end. The material always used is OFHC or Glidcop. One solution is to increase the cooling efficiency of the water-cooled channel in these components. With the restrictions of water pressure < 7 kg/cm2 and water flow velocity < 3 m/s",
        "the wire coil is chosen to enhance the average heat- transfer coefficient and increase not too much the loss of water pressure. With a water channel of diameter 7.5 mm and wire coil inserts of pitch 7.5 mm and wire diameter 1 mm",
        "the cooling efficiency becomes enhanced 1.4 to 2 times in the components of the TPS front end. The wire coils of varied pitches are simulated and calculated in this work. We also compare our investigated data with other experimental data of other authors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi072_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi072.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi072_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI072",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI075",
      "title": "Baking Test for an In-vacuum Undulator",
      "authors": [
        "L.H. Wu",
        "C.K. Chan",
        "J.-R. Chen",
        "G.-Y. Hsiung",
        "S-N. Hsu",
        "H.P. Hsueh",
        "J.C. Huang",
        "C.K. Yang",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Tsing Hua University",
        "Hsinchu",
        "Taiwan",
        "For Taiwan Photon Source in NSRRC",
        "the in-vacuum undulator (IU22) will be set in the straight section. The baking test took place in the NSRRC. The heating wires were welded on the outside wall of stainless chamber. The tape heaters were used for the sites without the heating wires. After acceptation test",
        "we assemble the residual gas analysis (RGA) and extractor gauge in the IU22. The pumping down curve and RGA spectrum were recorded and investigated. It was found the slope of the pumping curve near 1 h is -0.99. When the temperature gradually increases to about 185 oC",
        "the vacuum pressure arrives to about 8.7x10-5 Torr. The most gas source is from water before baking process. After baking test",
        "the major residual gas includes H2",
        "CH4",
        "H2O",
        "CO",
        "and CO2. We analyze the RGA spectrum during the baking process and discuss in the paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi075.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI075",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI077",
      "title": "Construction Status of the TPS Vacuum Systems",
      "authors": [
        "G.-Y. Hsiung",
        "C.K. Chan",
        "C.H. Chang",
        "C.-C. Chang",
        "S.W. Chang",
        "Y.P. Chang",
        "C.L. Chen",
        "J.-R. Chen",
        "Z.W. Chen",
        "C.M. Cheng",
        "Y.T. Cheng",
        "S-N. Hsu",
        "H.P. Hsueh",
        "C.S. Huang",
        "Y.T. Huang",
        "T.Y. Lee",
        "L.H. Wu",
        "Y.C. Yang",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Tsing Hua University",
        "Hsinchu",
        "Taiwan",
        "The vacuum systems for the 3 GeV Taiwan Photon Source (TPS) have been constructed since 2010. Most of the vacuum components and equipments have been manufactured and delivered. For the electron storage ring (SR)",
        "all the 24 cells of 14 m aluminum vacuum systems have been welded and assembled. The vacuum baking for the cells in the laboratory was undergoing to achieve the ultrahigh vacuum pressure below 1×10-8 Pa. The vacuum systems accommodated with the insertion devices in the long straight sections have been designed and under manufacturing. For the booster (BR)",
        "all the stainless steel chambers including the 0.7 mm elliptical chambers",
        "BPM ducts",
        "and the pumping chambers",
        "have been manufactured. The two transport lines: LTB for Linac to BR and BTS for BR to SR were manufactured. Vacuum chambers for BTS adopt the similar chambers for BR but will be baked to ultrahigh vacuum for connecting with SR without injection window. The beam ducts for LTB will be made of aluminum alloys. The construction works for TPS vacuum systems will be completed before April of 2013 while the installation of the systems in the TPS tunnel will be started immediately."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi077.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI077",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI078",
      "title": "Design and Experiment on Auto-alignment Control System of Taiwan Photon Source",
      "authors": [
        "M.H. Wu",
        "J.-R. Chen",
        "M.L. Chen",
        "P.S.D. Chuang",
        "H.C. Ho",
        "K.H. Hsu",
        "D.-G. Huang",
        "W.Y. Lai",
        "C.-S. Lin",
        "C.J. Lin",
        "H.C. Lin",
        "H.M. Luo",
        "S.Y. Perng",
        "P.L. Sung",
        "T.C. Tseng",
        "H.S. Wang",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Tsing Hua University",
        "Hsinchu",
        "Taiwan",
        "TPS (Taiwan Photon Source) is a new 3-GeV synchrotron ring to be constructed at the NSRRC (National Synchrotron Radiation Research Center)",
        "Taiwan. There were hundreds of magnets that must be aligned on the absolute position to keep the electronic beam in the desire path while orbiting. Due to the problems of manpower",
        "set up time",
        "accuracy of adjustment",
        "deformation of the floor",
        "limited workspace and frequent earthquakes in Taiwan",
        "an auto-alignment girder control system was designed to meet this requirement. The design and experiment of the auto-alignment system were tested successfully in the laboratory at NSRRC. The experiment of the auto-alignment control system would be implemented with half of the ring girders in the TPS. The detailed alignment design and status will be discussed in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi078.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI078",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI079",
      "title": "Start-up of the NESTOR Facility Vacuum System",
      "authors": [
        "A.Y. Zelinsky",
        "A.N. Gordienko",
        "V.A. Grevtsev",
        "I.I. Karnaukhov",
        "I.M. Karnaukhov",
        "N.I. Mocheshnikov",
        "A. Mytsykov",
        "V.L. Skirda",
        "NSC/KIPT",
        "Kharkov",
        "Ukraine",
        "The Kharkov X-ray generator NESTOR based on Compton backscattering is under commissioning. The vacuum system of the complex integrates a linear accelerator-injector",
        "the beam transport channel and the electron storage ring with energy range from 40 to 225 MeV. Elements of vacuum chambers",
        "pumping facilities",
        "cleaning surfaces procedures are described. Chambers are made of stainless steel (SS). After vacuum pretesting pressure 5 × 10-9 Torr in the storage chambers ring achieved."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi079_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi079.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi079_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI079",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI080",
      "title": "NSC KIPT Neutron Source on the Base of Subcritical Assembly Driven with Electron Linear Accelerator",
      "authors": [
        "A.Y. Zelinsky",
        "O. Bezditko",
        "P.O. Demchenko",
        "I.M. Karnaukhov",
        "V. Oleinik",
        "F.A. Peev",
        "I. Ushakov",
        "O.M. Vodin",
        "NSC/KIPT",
        "Kharkov",
        "Ukraine",
        "ANL",
        "Argonne",
        "USA",
        "National Science Center “Kharkov Institute of Physics and Technology” (NSC KIPT",
        "Kharkov",
        "Ukraine) together with Argonne National Laboratory (ANL",
        "USA) develops the conceptual project of a neutron source based on the sub-critical assembly driven by electron linear accelerator. The main functions of the subcritical assembly are support of the nuclear industry and medical researches. Reactor physics and material researchs will be carried out at the facility. For subcritical assembly design proven techniques and practices are used to enhance its utilization. The goal of the development is to create in Ukraine the experimental basis for neutron research based on safe intensive sources of neutrons. The main facility components are an electron linear accelerator",
        "a system for electron beam transportation from linear accelerator to the target",
        "neutron production target",
        "subcritical assembly",
        "biological shield",
        "neutron channels and auxiliary supporting systems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi080.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI080",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI082",
      "title": "Targetry Challenges at Megawatt Proton Accelerator Facilities",
      "authors": [
        "P. Hurh",
        "K. Ammigan",
        "B.D. Hartsell",
        "R.S. Tschirhart",
        "Fermilab",
        "Batavia",
        "USA",
        "High intensity",
        "multi-megawatt proton accelerator facilities",
        "such as the proposed Project X at Fermilab",
        "offer the opportunity to explore science in multiple experiments and programs simultaneously. The reliable operation of the associated target facilities is as critical to the success of the experimental program as the high intensity proton accelerator itself. The targetry requirements for the Project X experimental program range from 1 GeV",
        "1 MW",
        "CW proton beam on a high-Z target (possibly liquid metal) to 120 GeV",
        "2.3 MW",
        "pulsed proton beam on a low-Z target and include stringent",
        "experiment-specific operating environments such as high magnetic fields from super-conducting magnets and/or moderator arrays for optimal neutronic production. Meeting the challenges presented by such wide-ranging and intertwined requirements calls for coordinated and cross-cutting R&D activities. Areas of interest applicable to many of the experimental facilities includes radiation damage",
        "thermal shock",
        "radiological protection",
        "and target instrumentation. Descriptions of these challenges and Fermilab R&D activities to overcome these difficult challenges are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi082_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi082.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi082_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI082",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI083",
      "title": "Radiation Damage Study of Graphite and Carbon-carbon Composite Target Materials",
      "authors": [
        "P. Hurh",
        "K. Ammigan",
        "N.V. Mokhov",
        "Fermilab",
        "Batavia",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Use of graphite and carbon-carbon composite materials as high intensity proton targets for neutrino production is currently thought to be limited by thermal and structural material properties degraded by exposure to high energy proton beam. Identification of these limits for various irradiation and thermal environments is critical to high intensity targets for future facilities and experiments. To this end",
        "several types of amorphous graphite and one type of carbon-carbon (3D weave) composite were exposed to 180 MeV proton beam at the BNL BLIP facility. Irradiated samples were then thermally",
        "ultra-sonic",
        "and structurally tested and compared to un-irradiated samples. Results show significant changes in material properties even at very low damage levels (<0.09 DPA) and that significant interstitial annealing of these properties occurs at annealing temperatures only slightly above irradiation temperature. This points the way to optimizing target operating temperature to increase target lifetime. A description of the plan to explore radiation damage in target materials through the new RaDIATE collaboration (Radiation Damage In Accelerator Target Environments) is also presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi083_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi083.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi083_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI083",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI085",
      "title": "Status of PXIE MEBT Absorber Development",
      "authors": [
        "A.V. Shemyakin",
        "C.M. Baffes",
        "K. Carlson",
        "A.Z. Chen",
        "Y.I. Eidelman",
        "B.M. Hanna",
        "L.R. Prost",
        "J.T. Walton",
        "Fermilab",
        "Batavia",
        "USA",
        "One of the goals of the Project X Injector Experiment (PXIE) at Fermilab is to demonstrate the capability to form an arbitrary bunch pattern from an initially CW 162.5 MHz H− bunch train coming out of an RFQ. The bunch-by-bunch selection will be taking place in the 2.1 MeV Medium Energy Beam Transport (MEBT) by directing the undesired bunches onto an absorber that needs to withstand a beam power of up to 21 kW",
        "focused onto a spot with a ~2 mm rms radius. A ¼ - size prototype of the absorber is manufactured",
        "and its thermal properties are tested with an electron beam generating a peak power density similar to the one expected during normal operation of the PXIE beam line. The paper describes the absorber concept",
        "the prototype",
        "the testing procedure with the electron beam",
        "and the latest results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi085_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi085.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi085_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI085",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI087",
      "title": "Measurements of Secondary Electron Yield of Metal Surfaces and Films with Exposure to a Realistic Accelerator Environment",
      "authors": [
        "W. Hartung",
        "J.V. Conway",
        "C.A. Dennett",
        "S. Greenwald",
        "J.-S. Kim",
        "Y. Li",
        "T.P. Moore",
        "V. Omanovic",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "One of the central goals of the CESR Test Accelerator program is to understand electron cloud (EC) effects in lepton rings and how to mitigate them. To this end",
        "measurements of the secondary electron yield (SEY) of technical surfaces are being done in CESR. The CESR in-situ system",
        "in operation since 2010",
        "allows for measurements of SEY as a function of incident electron energy and angle on samples that are exposed to a realistic accelerator environment",
        "typically 5.3 GeV electrons and positrons. The system was designed for periodic measurements to observe beam conditioning of the SEY and discrimination between exposure to direct photons from synchrotron radiation versus scattered photons and cloud electrons. Measurements so far have been done on bare metal surfaces (aluminum",
        "copper",
        "stainless steel) and EC-mitigatory coatings (titanium nitride",
        "amorphous carbon",
        "diamond-like carbon). A significant decrease in SEY with exposure to beam was observed for all cases other than the amorphous C samples; for the latter",
        "the SEY remained near 1",
        "independent of beam exposure. The SEY results are being used to improve predictive models for EC build-up and EC-induced beam effects."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi087_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi087.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi087_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI087",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI088",
      "title": "Electron Cloud Diagnostic Chambers with Various EC-suppression Coatings",
      "authors": [
        "Y. Li",
        "J.V. Conway",
        "X. Liu",
        "M.A. Palmer",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "Suppression of electron cloud (EC) growth and density is critical for many high intensity accelerators of positively charged particles",
        "such as positron rings for Super KEKB and ILC’s positron damping ring. Among various suppression techniques",
        "passive coating with low secondary electron emission (SEY) coefficient is the most economic method. During CesrTA EC study program",
        "we have created two dedicated short sections in the CESR vacuum system to study effectiveness of various SEY reduction coatings. During last 4 years",
        "six one-meter-long EC study vacuum chambers were constructed",
        "and rotated through these short sections. The EC chambers were not only equipped with EC diagnostics (including a RFA and RF-shield pickups)",
        "they were also installed in CESR with vacuum instrument",
        "including a cold cathode ion gauge and a residual gas analyzer. With these EC study chambers",
        "EC-suppression effectiveness of TiN",
        "amorphous carbon and diamond-like carbon coatings were evaluated",
        "relative to bare aluminum chamber. In this report",
        "we will report vacuum properties of these coatings. In particular",
        "the photon-induced desorption and beam conditioning histories are presented."
      ],
      "institutions": [
        "Funding: Work supported by the US National Science Foundation PHY-0734867, PHY-1002467, and the U.S. Department of Energy DE-FC02-08ER41538"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi088_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi088.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi088_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI088",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI090",
      "title": "Accuracy of Measurements of ε and μ of Lossy Materials",
      "authors": [
        "V.D. Shemelin",
        "J.J. Kaufman",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "Measurements of samples of lossy ceramic and ferrites for Higher Order Mode Loads are performed routinely in our Lab. Some difference of results for different batches of materials can be explained not only by technological deviations in the material production but also by errors in the dimensions of the measured samples. Simulations with MicroWave Studio for samples in the form of coaxial washers in the frequency range from 1 to 12.4 GHz helped to define the main sources of errors and to improve accuracy of measurements.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi090_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi090.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi090_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI090",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI091",
      "title": "Simultaneous Four-hall Operation for 12 GeV CEBAF",
      "authors": [
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "The CEBAF accelerator at Jefferson lab will have a new experimental hall",
        "Hall D",
        "added to its existing three halls as a part of the ongoing 12 GeV upgrade. Under the present CEBAF design",
        "there is no option for sending beam to all four halls simultaneously. At least one hall has to stay down during the machine operation. A new pattern for interleaving the beam bunches is introduced that allows simultaneous operation of all four halls and provide opportunity for additional future experimental beams. The new configuration presents only a minimal change to the existing CEBAF extraction system. In fact all the lower pass extractions will stay as they are and only the frequency of 5th-pass horizontal RF separator will change. In order to make room for the new Hall D beam among the existing three beams",
        "the beam repetition rate is reduced only for the halls taking beam at the highest pass. This and other details of the new configuration and beam pattern will be presented and discussed. A separate paper in this conference will cover the implementation choices including changes to the beam source and extraction region.*",
        "* \"Source and Extraction for simultaneous Four-Hall beam delivery system at CEBAF\"",
        "proceedings of this conference."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi091_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi091.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi091_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI091",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI092",
      "title": "Design of the Mercury Handling System for a Muon Collider/Neutrino Factory Target",
      "authors": [
        "PU",
        "Princeton",
        "New Jersey",
        "USA",
        "J.S. Berg",
        "H.G. Kirk",
        "H. K. Sayed",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "N. Souchlas",
        "R.J. Weggel",
        "Particle Beam Lasers",
        "Inc.",
        "Northridge",
        "California",
        "USA",
        "The baseline target concept for a Muon Collider or Neutrino Factory is a free mercury jet within a 20-T magnetic field being impacted by an 8-GeV proton beam. A pool of mercury serves as a receiving reservoir for the mercury and a dump for the unexpended proton beam. Modifications to this baseline are discussed in which the field at the target is reduced from 20 to 15 T",
        "and in which the magnetic field drops from its peak value down to 1.5 T over 7 rather than 15 m."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi092_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi092.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi092_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI092",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPFI093",
      "title": "Device and Technique for In-situ Coating of the RHIC Cold Bore Vacuum Tubes with Thick OFHC",
      "authors": [
        "A. Hershcovitch",
        "M. Blaskiewicz",
        "J.M. Brennan",
        "W. Fischer",
        "C.J. Liaw",
        "W. Meng",
        "R.J. Todd",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A.X. Custer",
        "M.Y. Erickson",
        "N.Z. Jamshidi",
        "H.J. Poole",
        "PVI",
        "Oxnard",
        "USA",
        "J.M. Jimenez",
        "H. Neupert",
        "M. Taborelli",
        "C. Yin Vallgren",
        "CERN",
        "Geneva",
        "Switzerland",
        "Institute of High Current Electronics",
        "Tomsk",
        "Russia",
        "To mitigate electron clouds & unacceptable ohmic heating problems in RHIC",
        "we developed a robotic plasma deposition technique & device to in-situ coat the RHIC 316LN SS cold bore tubes based on mobile mole mounted magnetrons for OFHC deposition. Scrubbed Cu has low SEY and suppress electron cloud formation. Room temperature RF resistivity measurement of Cu coated SS RHIC tube samples indicate that 10 μm of Cu coating has conductivity close to copper tubing. A 50 cm long copper cathode magnetron",
        "mounted on a carriage with spring loaded wheels",
        "was successfully operated",
        "traversed magnet interconnect bellows and adjusted for variations in vacuum tube diameter",
        "while keeping the magnetron centered. To maximize cathode lifetime",
        "Cu cathode thickness was maximized its gap to vacuum tube minimized; movable magnet package is used. Novel cabling and vacuum-atmosphere interface system is being developed. Deposition experiments show no indentation in or damage to coating after wheels roll over coated areas; i.e. train like assembly option is a viable for in-situ RHIC coating. Details of experimental setup & coating of full-scale magnet tube sandwiched between bellows will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thpfi093_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thpfi093.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thpfi093_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPFI093",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 75,
  "scrape_time": "2025-10-10 21:42:20"
}