{
  "session_info": {
    "id": "TUYZO",
    "name": "TUYZO - Tuesday Oral Before Third Break",
    "url": "https://proceedings.jacow.org/ecris2020/html/tuyzo.htm"
  },
  "papers": [
    {
      "paper_id": "TUYZO01",
      "title": "Advancements in Self-Consistent Modeling of Time- and Space-Dependent Phenomena in ECRIS Plasma",
      "authors": [
        "A. Pidatella",
        "D. Mascali",
        "B. Mishra",
        "E. Naselli",
        "G. Torrisi",
        "INFN/LNS",
        "Catania",
        "Italy",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "Catania University",
        "Catania",
        "Italy",
        "Resonant interaction with microwave radiation in ECRIS plasma leads to a strongly anisotropic electron energy distribution function (EEDF)",
        "given as a combination of two to three electron populations",
        "with anisotropy that might trigger kinetic instabilities. At the INFN",
        "further efforts have been paid to improve and update self-consistent 3D numerical codes for plasma electrons kinetics. Progresses have opened several perspectives. It is now possible to derive a space-resolved EEDF",
        "providing local information on electron properties. Also",
        "the code has been updated to provide reaction rates of electromagnetic emissions",
        "including X-ray fluorescence. Estimates of the local ion charge state distribution is potentially possible",
        "and first evaluations are ongoing. Dealing with fast-transient mechanisms",
        "such as electromagnetic emission via the electron-cyclotron MASER instability",
        "the code is now updated for locally evaluating the EEDF anisotropy. We will present the collected results",
        "which we believe to have a relevant impact both on the ECRIS plasma physics and on the INFN’s PANDORA project that plans to use ECR plasmas for fundamental studies in Nuclear and AstroNuclear Physics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuyzo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuyzo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuyzo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUYZO01",
      "page_number": "78",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYZO02",
      "title": "A Guiding Centre Approximation Approach for Simulation Electron Trajectories in ECR and Microwave Ion Sources",
      "authors": [
        "J.A. Méndez",
        "T. Thuillier",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "CNRS LPGP Univ Paris Sud",
        "Orsay",
        "France",
        "This work presents a study on the feasibility of the implementation of the guiding centre (GC) approach in electron cyclotron resonance (ECR) ion sources",
        "with the goal of speeding up the electron’s orbit integration in certain regimes. It is shown that the GC approximation reproduces accurately the trajectory drifts and periodic behaviour of electrons in the minimum-B field. A typical electron orbit far enough from the source’s axis is well reproduced for 1 µs of propagation time",
        "with the GC time-step constrained below 100 ps",
        "giving one order of magnitude gain in computation time with respect to Boris. For an electron orbit close to the axis a disphasement of the electron’s trajectory is observed",
        "but the spatial envelope is conserved. A comparative study analyses electron trajectories in a flatter B-field",
        "that in a microwave discharge ion source",
        "where this method’s drawbacks may be avoided given a smaller magnetic field gradient and a shorter electron lifetime in the plasma chamber. In this regime electron trajectories were very well reproduced by the GC approximation. The time-step was constrained below 10 ns",
        "providing up to 30 times faster integration compared to Boris."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuyzo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuyzo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuyzo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUYZO02",
      "page_number": "84",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYZO03",
      "title": "Electromagnetic Simulation of \"plasma-shaped\" Plasma Chamber for Innovative ECRIS",
      "authors": [
        "G.S. Mauro",
        "O. Leonardi",
        "D. Mascali",
        "A. Pidatella",
        "F. Russo",
        "G. Sorbello",
        "G. Torrisi",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A. Galatà",
        "C.S. Gallo",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "UNIFE",
        "Ferrara",
        "Italy",
        "University of Catania",
        "Catania",
        "Italy",
        "The plasma chamber and injection system design play a fundamental role in ECRISs with the aim to obtain an optimized electromagnetic field configuration able to generate and sustain a plasma with a high energy content. In this work we present the numerical study and the design of an unconventionally-shaped cavity resonator* that possesses some key advantages with respect to the standard cylindrical cavities",
        "usually adopted in ion sources setups. The cavity geometry",
        "whose design has been completed on January 2020",
        "has been inspired by the typical star-shaped ECR plasma",
        "determined by the magnetic field structure. The chamber has been designed by using the commercial softwares CST and COMSOL",
        "with the aim to maximize the on-axis electric field. Moreover",
        "a radically innovative microwaves injection system",
        "consisting in side-coupled slotted waveguides",
        "has been implemented",
        "allowing a better power coupling and a more symmetric power distribution inside the cavity with respect to the standard rectangular waveguides. This new ’plasma-shaped oriented’ design could relevantly improve the performances of the ECRISs while making more compact the overall setup.",
        "*This work has been carried out within the Grant 73/IRIS project",
        "supported by INFN (Italian patent pending n. 102020000001756)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuyzo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuyzo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuyzo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUYZO03",
      "page_number": "90",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:26:32"
}