{
  "session_info": {
    "id": "TH3A",
    "name": "TH3A - Technology / Beams / Electron Accelerators and Applications",
    "url": "https://proceedings.jacow.org/linac2016/html/th3a.htm"
  },
  "papers": [
    {
      "paper_id": "TH3A01",
      "title": "Making Molecular Movie with MeV Electrons",
      "authors": [
        "X. Shen",
        "X.J. Wang",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "SLAC launched the Ultrafast Electron Diffraction and Imaging (UED&UEM) initiative with the objective of developing the world leading ultrafast electron scattering instrumentation",
        "complementary to the X-ray Free Electron Laser - Linac Coherent Light Source (LCLS). SLAC has developed a UED setup at the Accelerator Structure Test Area (ASTA)",
        "with the goal of providing MeV",
        "100-femtosecond-scale electron pulses to support an ultrafast science program [1]. The first UED ultrafast science experiment published in Nano Letters",
        "where large amplitude wrinkles of monolayer MoS2 generated by the light pulse' more than 15 percent of the layer's thickness",
        "was observed. This is the first time anyone has visualized these ultrafast atomic motions. Ultrafast MeV electrons also made it possible the direct measurement of phonon occupations as energy is transferred from electrons into the lattice in laser-heated gold (APL). The rotational wavepacket dynamics of laser-aligned nitrogen molecules were captured in gas-phase electron diffraction experiment using MeV electrons. We achieved an unprecedented combination of 100-fs (rms) temporal resolution and sub-Angstrom (0.76 Å) spatial resolution that makes it possible to resolve the position of the nuclei within the molecule(Nature Communications).",
        "[1] S. Weathersby",
        "et al.",
        "Rev. Sci. Instrum. 86",
        "073702 (2015)."
      ],
      "institutions": [],
      "abstract": "Slides TH3A01 [6.518 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/linac2016/talks/th3a01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/linac2016/papers/th3a01.pdf",
      "poster_url": "https://proceedings.jacow.org/linac2016/posters/th3a01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2016-TH3A01",
      "page_number": "725",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TH3A02",
      "title": "The Los Alamos Multi-Probe Facility for Matter-Radiation Interactions in Extremes",
      "authors": [
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "A next-generation signature facility based on multi-probe capabilities is being planned at Los Alamos. This new facility will enable the first in a new generation of game-changing scientific facilities for the materials community. The new Matter-Radiation Interactions in Extremes (MaRIE) facility will be used to discover and design the advanced materials needed to meet 21st-century national security and energy-security challenges to develop next-generation materials that will perform predictably in extreme environments. The MaRIE facility will include a new 12-GeV electron linac using a state-of-the-art electron photoinjector and superconducting accelerator technology to drive a 42-keV XFEL to generate x rays of unprecedented flux and quality",
        "coupled with the existing proton-beam capabilities of the LANSCE proton linac",
        "new experimental halls",
        "and new materials fabrication/characterization facilities. A description of this new facility",
        "its requirements",
        "and planned uses and capabilities will be presented. Status of the project will also be presented."
      ],
      "institutions": [
        "Funding: This work is supported by the United States Department of Energy, National Nuclear Security Agency, under contract DE-AC52-06NA25396."
      ],
      "abstract": "Slides TH3A02 [5.060 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/linac2016/talks/th3a02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/linac2016/papers/th3a02.pdf",
      "poster_url": "https://proceedings.jacow.org/linac2016/posters/th3a02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2016-TH3A02",
      "page_number": "729",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TH3A03",
      "title": "The VELA and CLARA Test Facilities at Daresbury Laboratory",
      "authors": [
        "P.A. McIntosh",
        "D. Angal-Kalinin",
        "J.A. Clarke",
        "L.S. Cowie",
        "B.D. Fell",
        "S.P. Jamison",
        "B.L. Militsyn",
        "Y.M. Saveliev",
        "D.J. Scott",
        "N. Thompson",
        "P.H. Williams",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A. Gleeson",
        "T.J. Jones",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The Versatile Electron Linear Accelerator (VELA) provides enabling infrastructures targeted at the development and testing of novel and compact accelerator technologies",
        "specifically through partnership with academia and industry",
        "aimed at addressing applications in medicine",
        "health",
        "security",
        "energy and industrial processing. The facility is now fully commissioned and is taking advantage of the variable electron beam parameters to demonstrate new techniques/processes or otherwise develop new technologies for future commercial realization. Examples of which include; electron diffraction and new cargo scanning processes. The Compact Linear Accelerator for Research and Applications (CLARA) will be a novel FEL test facility",
        "focused on the generation of ultra-short photon pulses with extreme levels of stability and synchronization. The principal aim is to experimentally demonstrate that sub-cooperation length pulse generation with FELs is viable",
        "and to compare the various schemes being championed. The results will translate directly to existing and future X-ray FELs",
        "enabling attosecond pulse generation. Both the VELA and CLARA facilities are co-located at Daresbury Laboratory and provide the UK with a unique platform for scientific and commercial R&D using ultra-short pulse",
        "high precision electron and photon beams."
      ],
      "institutions": [],
      "abstract": "Slides TH3A03 [11.795 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/linac2016/talks/th3a03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/linac2016/papers/th3a03.pdf",
      "poster_url": "https://proceedings.jacow.org/linac2016/posters/th3a03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2016-TH3A03",
      "page_number": "734",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 22:54:09"
}