{
  "session_info": {
    "id": "WEPSH",
    "name": "WEPSH - Poster Session: Applications - Medical",
    "url": "https://proceedings.jacow.org/CYCLOTRONS2013/html/wepsh.htm"
  },
  "papers": [
    {
      "paper_id": "WEPSH003",
      "title": "Development of New Combined System for Production of FDG and NaF Radiopharmaceuticals",
      "authors": [
        "F. Dehghan",
        "H. Afarideh",
        "S. Jaloo",
        "AUT",
        "Tehran",
        "Iran",
        "Tehran University of Medical Sciences",
        "Research Center for Nuclear Medicine",
        "Tehran",
        "Iran",
        "J.-S. Chai",
        "J.-S. Chai",
        "M. Ghergherehchi",
        "SKKU",
        "Suwon",
        "Republic of Korea",
        "In this work",
        "we present a new combined system which produces FDG and NaF in separate runs. The needed for synthesis this radiopharmaceuticals are obtained by bombardment of highly enriched water with proton. The aim is development of routine systems to use with baby cyclotrons. In this study",
        "the various chemical steps and required reagents as well as different reagent delivery methods has been investigated. This evaluation has been done with purpose of optimizing the performance of a conceptually simple device integrated into a fully automated synthesis procedure for radiosynthesis of FDG and NaF. In this system",
        "we have used AVR microcontroller to control the process and LabVIEW software for monitoring the operation of system. Furthermore",
        "Geiger Muller counters have been used to determine the activity to insure the accuracy of the systems operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/wepsh003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/wepsh003.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/wepsh003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-WEPSH003",
      "page_number": "390",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSH006",
      "title": "Zn Radioisotope Production by Cyclotron",
      "authors": [
        "M. Ghergherehchi",
        "J.-S. Chai",
        "J.-S. Chai",
        "SKKU",
        "Suwon",
        "Republic of Korea",
        "AUT",
        "Tehran",
        "Iran",
        "Natural Cu target was irradiated with proton beam in the energy range of 15 to 30 MeV at a beam current of 100 μA for 15 min. In this irradiation radioisotope of 62Zn produced as a generator and then decay to 62Cu radioisotope. The 62Cu is emitting β+ and known to PET radioisotope. Excitation function of 62Cu via natCu (p",
        "2n) 62Zn",
        "62Cu and 62Cu (d",
        "3n) 62Zn reactions were calculated using Alice and Talys codes and then were compared with the reported measurement by experimental data and ENDF-2011 data. Production yield versus target thickness were evaluated with attention to reaction cross section data obtained from Alice and Talys codes",
        "and stopping power and range of protons in target materials using SRIM code. The production yield also examined experimentally and found that the optimum irradiation yield achieved to be 5.9 mci/μAh at protons of 100 μA current and 30 MeV energy. A radiolabeling process also was performed using 62ZnCl2 and antitumor compound",
        "bleomycin (BLM) as a possible tumor imaging."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/wepsh006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/wepsh006.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/wepsh006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-WEPSH006",
      "page_number": "393",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSH007",
      "title": "Radiochromic Film as a Dosimetric Tool for Low Energy Proton Beams",
      "authors": [
        "S. Devic",
        "S. Aldelaijan",
        "F.M. Alrumayan",
        "F. Alzorkani",
        "B.M. Moftah",
        "M. Shehadeh",
        "King Faisal Specialist Hospital and Research Centre",
        "Riyadh 11211",
        "Kingdom of Saudi Arabia",
        "EBT3 and HDV2 GAFCHROMICTM films were tested for dose measurements at a 26.5 MeV and 6 mm Bragg peak proton beam. Beam output was calibrated using IAEA TRS-398 reference dosimetry protocol with calibrated chamber in water. Films were calibrated in terms of dose to water by exposing calibration film pieces within a solid water phantom at depth of 3 mm. EBT3 films were irradiated to doses of up to 10 Gy with both 4 MV photon and 26.5 MeV proton beams",
        "while pieces of the HDV2 radiochromic films were irradiated to doses of up to 128 Gy proton beam. Irradiated pieces of the EBT3 films were tested for activation using Germanium detector. Their energy spectra were measured over a period of 40 minutes. EBT3 film model response was 3 times higher for protons than photons. When irradiated in proton beam the EBT3 was 24 times more sensitive than HDV2 films. For the EBT3 film model",
        "few proton-activated processes were identified resulting in short-lived radioisotopes. EBT3 film can be used for measurements for doses of up to 10 Gy using a green color channel of the scanned images",
        "while the red color channel of the HDV2 scanned film images can be used for measurements of much higher doses."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/wepsh007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/wepsh007.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/wepsh007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-WEPSH007",
      "page_number": "397",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSH008",
      "title": "Characterization of the CS30 Cyclotron at KFSH&RC for Radiotherapy Applications",
      "authors": [
        "Belal Moftah",
        "PhD",
        "Riyadh",
        "Kingdom of Saudi Arabia",
        "S. Aldelaijan",
        "F.M. Alrumayan",
        "F. Alzorkani",
        "S. Devic",
        "M. Shehadeh",
        "King Faisal Specialist Hospital and Research Centre",
        "Riyadh 11211",
        "Kingdom of Saudi Arabia",
        "The 26.5 MeV beam of the CS30 Cyclotron at King Faisal Specialist Hospital and Research Centre (KFSH&RC) was characterized dosimetrically for the use in radiobiological experiments for pre-clinical and radiotherapy studies. Position of the beam’s Bragg peak was measured with a stack of 60 pieces of HDV2 model GAFCHROMICTM films (105 microns thick each). This film type was specifically designed for measurement of very high doses",
        "ranging up to 1",
        "000 Gy. Output of the proton beam was calibrated using IAEA TRS-398 reference dosimetry protocol with calibrated parallel plate chamber in water. The response of the film was calibrated in terms of dose to water by exposing calibration film pieces within a solid water phantom. The position of the Bragg peak was found to be at around 6 mm when 10 to 20 nA proton beam current was used. Pieces of radiochromic film were irradiated at 40",
        "70 and 100 cm from the primary collimator",
        "where the Gaussian shaped beam profiles had values of 12",
        "26",
        "45 mm FWHM respectively. Proton beam characteristics in terms of the output and beam size appear to be acceptable for pre-clinical studies."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/wepsh008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/wepsh008.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/wepsh008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-WEPSH008",
      "page_number": "400",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSH010",
      "title": "Proton Therapy at the Institut Curie – CPO: Operation of an IBA C235 Cyclotron Looking Forward Scanning Techniques",
      "authors": [
        "A. Patriarca",
        "S.J. Meyroneinc",
        "Institut Curie - Centre de Protonthérapie d'Orsay",
        "Orsay",
        "France",
        "Since 1991",
        "more than 6100 patients (mainly eye and head & neck tumours) were treated at the Institut Curie – Centre de Protonthèrapie d’Orsay using Double Scattering proton beam delivery technique. After 19 years of activity",
        "a 200 MeV synchrocyclotron has been shut down and replaced by a 230 MeV C235 IBA proton cyclotron. This delivers beam to two passive fixed treatment rooms and to one universal nozzle equipped gantry. In the past two years of operation more than 95.5% of the scheduled patients (near 500/year) were treated. We have realised",
        "according to IBA recommendations",
        "preventive maintenance (i.e. RF final amplifier) and we have improved some diagnostic tools (i.e. Main Coil monitoring) allowing us to reduce the number of downtime events from 499 in 2011 to 351 in 2012. In order to improve cancer treatment capabilities we are now involved in the transition towards scanning particle therapy",
        "requiring even more accurate quality assurance protocols. We describe here the main cyclotron issues (ion source",
        "deflector) and what is needed to perform a proper scanning technique",
        "the main goal being the enhancement of our reliability performances."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/wepsh010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/wepsh010.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/wepsh010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-WEPSH010",
      "page_number": "403",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSH043",
      "title": "Performance of IBA New Conical Shaped Niobium [18O] Water Targets",
      "authors": [
        "F.G. Devillet",
        "J. Courtyn",
        "J.-M. Geets",
        "M. Ghyoot",
        "E.K. Kral",
        "O. Michaux",
        "B. Nactergal",
        "V. Nuttens",
        "IBA",
        "Louvain-la-Neuve",
        "Belgium",
        "R. Mooij",
        "L.R. Perk",
        "BV Cyclotron VU",
        "Amsterdam",
        "The Netherlands",
        "Background: Because of an ever increasing demand for Fluoride-18 (18F-)",
        "efforts are made to increase the performance of the 18F-target systems. Moreover",
        "given the particularly high cost of 18O enriched water",
        "only a small volume of this target material is desired. Procedure: Four conical shaped targets* with different target chamber sizes (Conical 6 – 2.4ml; Conical 8 – 3.2ml; Conical 12 - 5ml; Conical 16 - 7ml) were tested using IBA Cyclone® 18 MeV cyclotrons. The targets were filled with different volumes of 18O water (enrichment >92%) and irradiated with 18 MeV protons on target with beam currents up to 145 μA for 30–150 minutes. Fluoride-18 saturation activity yields and pressure curves were completed. Radionuclidic impurities were measured",
        "even if the new target is using the same principle of Niobium body with Havar® window. Conclusions: Reliable operation in a production environment has been observed at beam currents up to 145 μA using less 18O enriched water as compared to the currently available IBA target systems without affecting the yield. The new design with less Orings and direct insertion of flow line into the niobium chamber has proven its effectiveness."
      ],
      "institutions": [],
      "abstract": "*Patent application: WO 2012/055970 A1",
      "presentation_url": "https://proceedings.jacow.org/CYCLOTRONS2013/talks/wepsh043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/CYCLOTRONS2013/papers/wepsh043.pdf",
      "poster_url": "https://proceedings.jacow.org/CYCLOTRONS2013/posters/wepsh043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-CYCLOTRONS2013-WEPSH043",
      "page_number": "406",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-10 17:24:54"
}