{
  "session_info": {
    "id": "TUCOCA",
    "name": "TUCOCA - Personnel Safety and Machine Protection",
    "url": "https://proceedings.jacow.org/ICALEPCS2013/html/tucoca.htm"
  },
  "papers": [
    {
      "paper_id": "TUCOCA01",
      "title": "XFEL Machine Protection System (MPS) Based on uTCA",
      "authors": [
        "S. Karstensen",
        "M.E. Castro Carballo",
        "J.M. Jäger",
        "M. Staack",
        "DESY",
        "Hamburg",
        "Germany",
        "The European X-Ray Free Electron Laser (XFEL) linear accelerator will provide an electron beam with energies of up to 17.5 GeV and will use it to generate extremely brilliant pulses of spatially coherent xrays. With a designated average beam power of up to 600 kW and beam spot sizes down to few micrometers",
        "the machine will hold a serious damage potential. To ensure safe operation of the accelerator it is necessary to detect dangerous situations by closely monitoring beam losses and the status of critical components. This is the task of the uTCA* based machine protection system (MPS). Many design features of the system have been influenced by experience from existing facilities",
        "particularly the Free Electron Laser in Hamburg (FLASH)",
        "which is a kind of 1:10 prototype for the XFEL. A high flexibility of the MPS is essential to guarantee a minimum downtime of the accelerator. The MPS is embedded in the DOOCS** control system."
      ],
      "institutions": [],
      "abstract": "* uTCA: Micro Telecommunications Computing Architecture ** DOOCS: Distributed Object Oriented Control System",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tucoca01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tucoca01.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tucoca01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUCOCA01",
      "page_number": "906",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCOCA02",
      "title": "The ITER Interlock System",
      "authors": [
        "A. Vergara-Fernandez",
        "J.L. Fernández-Hernando",
        "C. Fernandez-Robles",
        "A. Wallander",
        "I. Yonekawa",
        "ITER Organization",
        "St. Paul lez Durance",
        "France",
        "A. Marqueta Barbero",
        "I.P.D. Prieto Díaz",
        "IBERINCO",
        "Madrid",
        "Spain",
        "Vitrociset s.p.a",
        "Roma",
        "Italy",
        "Assystem E&OS",
        "Pertuis",
        "France",
        "ARKADIA Technology",
        "Aix en Provence",
        "France",
        "ITER is formed by systems which shall be pushed to their performance limits in order to successfully achieve the scientific goals. The scientists in charge of exploiting the tokamak will require enough operational flexibility to explore as many plasma scenarios as possible while being sure that the integrity of the machine and safety of the environment and personnel are not compromised. The I&C Systems of ITER has been divided in three separate tiers: the conventional I&C",
        "the safety system and the interlock system. This paper focuses on the latter. The design of the ITER interlocks has to take into account the intrinsic diversity of ITER systems",
        "which implies a diversity of risks to be mitigated and hence the impossibility to implement a unique solution for the whole machine. This paper presents the chosen interlock solutions based on PLC",
        "FPGA",
        "and hardwired technologies. It also describes how experience from existing tokamaks has been applied to the design of the ITER interlocks",
        "as well as the ITER particularities that have forced the designers to evaluate some technical choices which historically have been considered as non-suitable for implementing interlock functions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tucoca02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tucoca02.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tucoca02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUCOCA02",
      "page_number": "910",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCOCA03",
      "title": "Machine Protection Issues for eRHIC",
      "authors": [
        "K.A. Brown",
        "P. Chitnis",
        "C. Theisen",
        "G. Wang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The eRHIC electron beams will be damaging both directly and as a result of synchrotron radiation. The machine protection and abort systems will be designed to prevent any equipment damage from the electron beams. In this paper we will review the requirements for the machine protection systems and the plans we have put into place to better evaluate the failure probabilities",
        "beam abort systems designs",
        "and overall machine protection systems designs. The machine protection systems will include a beam permit system that has inputs from loss monitors",
        "power supplies",
        "superconducting RF monitors",
        "vacuum chamber heating monitors",
        "water temperature",
        "quench detectors",
        "access controls systems",
        "vacuum monitors",
        "and longer term beam lifetime or slow loss monitors. There are three systems associated with the machine protection and beam abort systems; the beam permit link",
        "the abort kicker systems",
        "and the beam dumps. We describe the requirements for these systems and present our current plans for how to meet the requirements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tucoca03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tucoca03.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tucoca03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUCOCA03",
      "page_number": "914",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCOCA04",
      "title": "Formal Methodology for Safety-Critical Systems Engineering at CERN",
      "authors": [
        "F. Valentini",
        "T. Hakulinen",
        "L. Hammouti",
        "T. Ladzinski",
        "P. Ninin",
        "CERN",
        "Geneva",
        "Switzerland",
        "A Safety-Critical system is a system whose failure or malfunctioning may lead to an injury or loss of human life or may have serious environmental consequences. The Safety System Engineering section of CERN is responsible for the conception of systems capable of performing",
        "in an extremely safe way",
        "a predefined set of Instrumented Functions preventing any human presence inside areas where a potential hazardous event may occur. This paper describes the formal approach followed for the engineering of the new Personnel Safety System of the PS accelerator complex at CERN. Starting from applying the generic guidelines of the safety standard IEC-61511",
        "we have defined a novel formal approach particularly useful to express the complete set of Safety Functions in a rigorous and unambiguous way. We present the main advantages offered by this formalism and",
        "in particular",
        "we will show how this has been effective in solving the problem of the Safety Functions testing",
        "leading to a major reduction of time for the test pattern generation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tucoca04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tucoca04.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tucoca04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUCOCA04",
      "page_number": "918",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCOCA05",
      "title": "EPICS-based Control System for a Radiation Therapy Machine",
      "authors": [
        "University of Washington Medical Center",
        "Seattle",
        "USA",
        "The clinical neutron therapy system (CNTS) at the University of Washington Medical Center (UWMC) has been treating patients since 1984. Its new control system retains the original safety philosophy and delegation of functions among nonprogrammable hardware",
        "PLCs",
        "microcomputers with programs in ROM",
        "and finally general-purpose computers. The latter are used only for data-intensive",
        "prescription-specific functions. For these",
        "a new EPICS-based control program replaces a locally-developed C program used since 1999. The therapy control portion uses a single soft IOC for control and a single EDM session for the operator's console. Prescriptions are retrieved from a PostgreSQL database and loaded into the IOC by a Python program; another Python program stores treatment records from the IOC back into the database. The system remains safe if the general-purpose computers or their programs crash or stop producing results. Different programs at different stages of the computation check for invalid data. Development activities including formal specifications and automated testing avoid",
        "then check for",
        "design and programming errors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tucoca05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tucoca05.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tucoca05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUCOCA05",
      "page_number": "922",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCOCA06",
      "title": "Current Status of a Carborne Survey System, KURAMA",
      "authors": [
        "M. Tanigaki",
        "Y. Kobayashi",
        "R. Okumua",
        "N. Sato",
        "K. Takamiya",
        "H. Yoshinaga",
        "H. Yoshino",
        "Kyoto University",
        "Research Reactor Institute",
        "Osaka",
        "Japan",
        "A carborne survey system named as KURAMA (Kyoto University RAdiation MApping system) has been developed as a response to the nuclear accident at TEPCO Fukushima Daiichi Nuclear Power Plant in 2011. Now the system evolved into a CompactRIO-based KURAMA-II",
        "and serves for the various types of applications. More than a hundred of KURAMA-II are deployed for the periodical drawing of the radiation map in the East Japan by Japanese government. A continuous radiation monitoring by KURAMA-II on local buses is started in Fukushima prefecture as the collaboration project among Kyoto University",
        "Fukushima prefectural government",
        "and JAEA. Extended applications such as precise radiation mappings in farmlands and parks are also on the way. The present status and future prospects of KURAMA and KURAMA-II are introduced."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tucoca06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tucoca06.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tucoca06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUCOCA06",
      "page_number": "926",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCOCA07",
      "title": "A Streamlined Architecture of LCLS-II Beam Containment System",
      "authors": [
        "E. Carrone",
        "M.D. Cyterski",
        "J.M. Murphy",
        "F. Tao",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "With the construction of LCLS-II",
        "SLAC is developing a new Beam Containment System (BCS) to replace the aging hardwired system. This system will ensure that the beam is confined to the design channel at an approved beam power to prevent unacceptable radiation levels in occupable areas. Unlike other safety systems deployed at SLAC",
        "the new BCS is distributed and has explicit response time requirements",
        "which impose design constraints on system architecture. The design process complies with IEC 61508 and the system will have systematic capability SC3. This paper discusses the BCS built on Siemens S7-300F PLC. For those events requiring faster action",
        "a hardwired shutoff path is provided in addition to peer safety functions within PLC; safety performance is enhanced",
        "and the additional diagnostic capabilities significantly relieve operational cost and burden. The new system is also more scalable and flexible",
        "featuring improved configuration control",
        "simplified EPICS interface and reduced safety assurance testing efforts. The new architecture fully leverages the safety PLC capabilities and streamlines design and commissioning through a single-processor single-programmer approach."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tucoca07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tucoca07.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tucoca07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUCOCA07",
      "page_number": "930",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCOCA08",
      "title": "Personnel and Machine Protection Systems in The National Ignition Facility (NIF)",
      "authors": [
        "R.K. Reed",
        "J.C. Bell",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "The National Ignition Facility (NIF) is the world’s largest and most energetic laser system and has the potential to generate significant levels of ionizing radiation. The NIF employs real time safety systems to monitor and mitigate the potential hazards presented by the facility. The Machine Safety System (MSS) monitors key components in the facility to allow operations while also protecting against configurations that could damage equipment. The NIF Safety Interlock System (SIS) monitors for oxygen deficiency",
        "radiological alarms",
        "and controls access to the facility preventing exposure to laser light and radiation. Together the SIS and MSS control permissives to the hazard generating equipment and annunciate hazard levels in the facility. To do this reliably and safely",
        "the SIS and MSS have been designed as fail safe systems with a proven performance record now spanning over 12 years. This presentation discusses the SIS and MSS",
        "design",
        "implementation",
        "operator interfaces",
        "validation/verification",
        "and the hazard mitigation approaches employed in the NIF. A brief discussion of common failures encountered in the design of safety systems and how to avoid them will be presented."
      ],
      "institutions": [
        "Funding: * This work performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory (LLNL) under Contract DE-AC52-07NA27344. #LLNL-ABS-633232"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tucoca08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tucoca08.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tucoca08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUCOCA08",
      "page_number": "933",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCOCA09",
      "title": "Klystron Measurement and Protection System for XFEL on the MTCA.4 Architecture",
      "authors": [
        "Ł. Butkowski",
        "H. Schlarb",
        "V. Vogel",
        "DESY",
        "Hamburg",
        "Germany",
        "The European XFEL free-electron laser is under construction at the DESY. The driving engine of the superconducting accelerator will be 27 RF station. Each of an underground RF station consist from multi beam horizontal klystron which can provide up to 10MW of power at 1.3GHz. The XFEL should work continuously over 20 years with only 1 day per month for maintenance. In order to meet so demanding requirement lifetime of the MBK should be as long as possible. In the real operation the lifetime of tube can be thoroughly reduced by service conditions. To minimize the influence of service conditions to the klystrons lifetime the special fast protection system named as Klystron Lifetime Management System (KLM) has been developed",
        "the main task of this system is to detect all events which can destroy the tube as quickly as possible",
        "and then stop input power to the tube and send signal to stop HV pulse. The tube recovery procedure should depend on the kind of events has happened. KLM is based on the standard LLRF uTCA system for XFEL with additional DC channels. This article gives an overview of implementation of measurement and protection system installed at klystron test stand."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tucoca09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tucoca09.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tucoca09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUCOCA09",
      "page_number": "937",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCOCA10",
      "title": "Improvements in the T2K Primary Beamline Control System",
      "authors": [
        "K. Nakayoshi",
        "Y. Fujii",
        "K. Sakashita",
        "KEK",
        "Tsukuba",
        "Japan",
        "T2K is a long-baseline neutrino oscillation experiment in Japan. We report recent improvements in the T2K primary beamline control system. The first improvement is a new interlock system for current fluctuations of the normal-conducting (NC) magnet power supplies. To prevent the intense beam from hitting the beamline equipment due to a current fluctuation in a magnet power supply",
        "we continuously monitor the power supply output current using digital-panel-meters. The second improvement is a new PLC-based control system for the NC magnet power supplies. We will also discuss the actual implementation of these improvements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tucoca10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tucoca10.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tucoca10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUCOCA10",
      "page_number": "940",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 10,
  "scrape_time": "2025-10-10 18:27:38"
}