{
  "session_info": {
    "id": "TUPLH",
    "name": "TUPLH - Tuesday Poster Session-Lake Huron",
    "url": "https://proceedings.jacow.org/napac2019/html/tuplh.htm"
  },
  "papers": [
    {
      "paper_id": "TUPLH01",
      "title": "Status of the Superconducting Undulator Program at the Advanced Photon Source",
      "authors": [
        "M. Kasa",
        "E.R. Anliker",
        "J.D. Fuerst",
        "E. Gluskin",
        "Q.B. Hasse",
        "Y. Ivanyushenkov",
        "W.G. Jansma",
        "I. Kesginpresenter",
        "Y. Shiroyanagi",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Since 2013 there has been at least one superconducting undulator (SCU) in operation at the Advanced Photon Source (APS)",
        "currently there are two planar SCUs and one helical SCU. The combined operational experience of SCUs at the APS is more than 11 years and counting. Through all these years",
        "APS SCUs operated with the predicted or better than predicted radiation performance and with 99% availability. With this demonstrated reliability and experimentally confirmed spectral performance",
        "the APS upgrade project is planning on leveraging the advantages of SCU technology. The present planar SCUs are comprised of ~1.1-m-long magnets",
        "each operated within a 2-m-long cryostat",
        "while the planar SCUs for the upgrade will have two ~1.8-m-long magnets operating within a 5-m-long cryostat. Progress is also being made in other areas of SCU development with work on an arbitrary polarizing SCU",
        "referred to as SCAPE",
        "and a planar SCU wound with Nb3Sn superconductor. A Nb3Sn SCU is being designed with two 1.3-m-long magnets within a 5-m-long cryostat",
        "and installation is planned for 2021. Also under development are the alignment and magnetic measurement systems for use with the 5-m-long cryostat."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh01.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH01",
      "page_number": "490",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH03",
      "title": "Double-Bend Achromat Beamline for Injection Into a High-Power Superconducting Electron Linac",
      "authors": [
        "C.H. Boulware",
        "T.L. Grimm",
        "R. Hipplepresenter",
        "Niowave",
        "Inc.",
        "Lansing",
        "Michigan",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "To take advantage of the high duty cycle operation of superconducting electron linacs",
        "commercial systems use thermionic cathode electron guns that fill every RF bucket with an electron bunch. In continuous operation",
        "the exit energy is limited when compared to pulsed systems. Bunch length and energy spread at the exit of the gun are incompatible with low losses in the superconducting cavity. A solenoid double-bend achromatic beamline is in operation at Niowave which allows energy and bunch length filtering of the beam leaving the gun before injection into the superconducting cavity. This system uses two solenoids and two dipoles to produce a round beam",
        "using the edge angles of the dipoles to balance the focusing effects in the two transverse planes. The design allows beam filtering on the symmetry plane where the dispersion is maximum. Additionally",
        "the bend angle moves the electron gun off the high-energy beam axis",
        "allowing multiple-pass operation of the superconducting booster. This contribution will discuss the beam optics design of the double-bend achromat along with the design of the magnets and beam chambers and the operational experience with the system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh03.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH03",
      "page_number": "494",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH04",
      "title": "Feasibility Study of Fast Polarization Switching Superconducting Undulator",
      "authors": [
        "I. Kesgin",
        "Y. Ivanyushenkov",
        "M. Kasa",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Polarization switching x-ray probes coupled with high-flux provide a unique tool to unraveling the nature of electronic heterogeneity and drive discovery of novel phases of electronic matter. Superconducting Arbitrary Polarization Emitter (SCAPE) is a new concept for a universal undulator",
        "which offers linear or circular polarization states in one device and is ideal for experiments that require polarization switching. Polarization switching relies on modulating the magnetic field in the undulator. This",
        "however",
        "inevitably incurs losses in superconductors",
        "which need to be mitigated. In this study",
        "feasibility of fast switching SCAPE has been investigated through fabricating and testing several short prototype magnets wound with different superconductors and new design concepts. The losses at different frequencies and field amplitudes are measured and details will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh04.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH04",
      "page_number": "497",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH07",
      "title": "High-Gradient Short Pulse Accelerating Structures",
      "authors": [
        "S.V. Kuzikov",
        "S.P. Antipov",
        "E. Gomez",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "High gradients are necessary for lots of applications of electron accelerators. As the maximum gradient is limited by effects of RF breakdown",
        "we present a development of an electron accelerating structure operating with a short multi-megawatt RF pulse. The structure exploits an idea to decrease the breakdown probability due to RF pulse length reduction. This concept requires to distribute RF power so that all accelerating cells are fed independently each other. This implies waveguide net system which allows to delay and to distribute properly RF radiation along the structure keeping synchronism of particles and waves. We have designed an X-band pi-mode structure including the RF design",
        "optimization",
        "and engineering. The structure will be tested as an RF power extractor at the Argonne Wakefield Accelerator Facility for two-beam acceleration experiments. In this regime we anticipate to obtain 10 ns",
        "gigawatt power level RF pulses generated by train consisted of eight 25-50 nC relativistic bunches."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh07.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH07",
      "page_number": "500",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPLH08",
      "title": "X-Ray and Charged Particle Detection by Detuning of a Microwave Resonator",
      "authors": [
        "S.P. Antipov",
        "P.V. Avrakhov",
        "E. Dosov",
        "E. Gomez",
        "S.V. Kuzikov",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "Charged particle detection is important for beam alignment",
        "beam loss and background control. In case of halo detection",
        "traditional wire scanner measurement utilizing carbon or tungsten wires is limited by the damage threshold of these materials. In this paper we present an electrodeless method to measure halo with a diamond scraper. This measurement utilizes a microwave resonator placed around the diamond scraper which is sensitive to charged particle-induced conductivity. Due to this transient induced conductivity in the dielectric",
        "a microwave coupling to the resonator changes. Diamond in this case is chosen as a radiation hard material with excellent thermal properties. The absence of electrodes makes the device robust under the beam. The same measurement can be done for x-ray flux monitoring which is important for measurement feedback and calibration at modern x-ray light sources. In this case x-rays passing through the diamond sensing element enable a photo-induced conductivity and that in turn detunes the cavity placed around the diamond. Diamond being a low-Z material allows for in-line x-ray flux measurement without significant beam attenuation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh08.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH08",
      "page_number": "503",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH09",
      "title": "Thermal Effects on Bragg Diffraction of XFEL Optics",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh09.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH09",
      "page_number": "506",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH10",
      "title": "Fabrication Progress of a Superconducting Helical Undulator with Superimposed Focusing Gradient for High Efficiency Tapered X-Ray FELs",
      "authors": [
        "S.M. Lynam",
        "R.B. Agustsson",
        "I.I. Gadjev",
        "A.Yu. Smirnov",
        "RadiaBeam",
        "Santa Monica",
        "California",
        "USA",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "The Advanced Gradient Undulator (AGU) represents a potentially significant advancement in x-ray conversion efficiency for x-ray FELs. This increase in efficiency would have broad implications on the capabilities of x-ray light sources. To achieve this high conversion efficiency",
        "the inner diameter of the undulator coil is a mere 7mm",
        "even with the use of superconducting coils. To accommodate the beamline at the Advanced Photon Source this yields in a chamber with a wall thickness of 0.5mm fabricated from Aluminum. With a period of 2cm and a conductor position tolerance of <100 µm over a length of >80cm at 4.2K",
        "the engineering and fabrication challenges for the undulator alone are substantial. We will discuss these fabrication challenges and present solutions to meet the tolerances required for desired performance",
        "and provide an update on current progress of the construction of a section of the AGU insertion device."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh10.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH10",
      "page_number": "509",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH12",
      "title": "Recent Developments in High Power High Brightness Double Bunch Self-Seeding at LCLS-II",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh12.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH12",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH13",
      "title": "Study of Fluctuations in Undulator Radiation in the IOTA Ring at Fermilab",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh13.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH13",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH14",
      "title": "Strongly Tapered Helical Undulator System for TESSA-266",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh14.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH14",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH15",
      "title": "High-Power Superconducting Electron Linacs for Commercial Applications",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh15.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH15",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH17",
      "title": "Design Study of Low-Level RF Control System for CW Superconducting Electron Linear Accelerator in KAERI",
      "authors": [
        "S.H. Lee",
        "J.Y. Lee",
        "Korea Atomic Energy Research Institute (KAERI)",
        "Daejeon",
        "Republic of Korea",
        "P. Buaphad",
        "I.G. Jeong",
        "Y.J. Joo",
        "H.R. Lee",
        "University of Science and Technology of Korea (UST)",
        "Daejeon",
        "Republic of Korea",
        "M.-H. Chun",
        "I.H. Yu",
        "PAL",
        "Pohang",
        "Republic of Korea",
        "KAERI",
        "Jeongeup-si",
        "Republic of Korea",
        "Korea Atomic Energy Research Institute (KAERI) has been operating a 20 MeV superconducting RF linear accelerator (SRF LINAC) to conduct research on atom/nuclear reaction using neutron Time-Of-Flight (nTOF). It can accelerate electron beams up to 20 MeV with 1 kW continuous wave (CW) operation mode. Unfortunately",
        "this machine has been aged over 15 years that brings about considerably difficulty in normal operation due to the performance degradation of sub-systems. To improve the operation condition of 20 MeV SRF LINAC",
        "we has been carrying out an upgrade project with replacement and repair of old sub-systems from 2018. This paper describes a design study of Low-Level RF (LLRF) feedback system to raise the stability and acceleration efficiency of the electric field generated in the superconducting RF cavity structure in 20 MeV SRF LINAC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh17.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH17",
      "page_number": "512",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPLH18",
      "title": "NSLS-II Inject Linac RF Control Electronics Upgrade",
      "authors": [
        "BNL",
        "Upton",
        "New York",
        "USA",
        "The electron LINAC injector of NSLS-II synchrotron light-source runs both Single-Bunch beam and long Multi-Bunch beam of up to 150 bunches. The key component for achieving this dual injector beam mode support capability is a high-speed rf modulator (or RFM) in the LINAC RF electronics front-end",
        "which performs the necessary rf control and the beam loading compensation of different injection beams. The original LINAC rf electronics front-end successfully supported the machine commissioning and meets the basic needs of the machine operation. The upgrade being pursued is focused on improving the RFM control performance through replacing the current analog implementation in the RFM with a much more capable digital implementation",
        "while still maintaining the necessary control bandwidth that is required for long and short Multi-Bunch beams. A variety of modern COTS rf transmission/reception DSP technology will be incorporated in the new design. The improvement in the reliability of network connection between the RFM’s and their host server is another focus in the upgrade",
        "and the solution includes the adoption of the COTS TCP/IP and other communication protocol offload engines."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh18.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH18",
      "page_number": "516",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH19",
      "title": "Upgrade and Operation Experience of Solid-State Switching Klystron Modulator in NSLS-II Linac",
      "authors": [
        "H. Ma",
        "J. Rose",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "The NSLS-II synchrotron light-source at BNL uses three S-band",
        "45MW klystrons in its injector LINAC. At the core of the klystron station design is the novel solid-state switching modulators (or SSM). Compared to the conventional PFN klystron modulators",
        "the main advantages of the SSM include the compact size requiring a smaller footprint in the LINAC",
        "and a very flat top in the produced klystron HV pulses. The flatness of the HV pulses is very important for NSLS-II LINAC that runs multi-bunch beams to keep the beam energy dispersion within the tolerance. The principle of the SSM is fairly simple. It uses a large number of relatively low-voltage switched charging capacitor cells (or SU’s) in parallel. A specially designed",
        "high step-up ratio",
        "pulse transformer in the oil-tank with the same number of primary windings (as SU’s) combines the power from all the SU’s",
        "and steps up to the required ~300kV klystron beam voltage. The operation experience at NSLS-II has proven the performance and reliability of the SSM’s. The BNL Model K2 SSM’s are currently being upgraded to Model K300 to run more powerful",
        "and more cost-effective Canon’s E37302A klystrons."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh19.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH19",
      "page_number": "519",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH20",
      "title": "Commissioning of the CESR Upgrade for CHESS-U",
      "authors": [
        "J.P. Shanks",
        "G.W. Codner",
        "M.J. Forster",
        "D.L. Rubin",
        "S. Wang",
        "L. Ying",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The Cornell Electron Storage Ring (CESR) was upgraded in the second half of 2018 to become a dedicated synchrotron light source",
        "CHESS-U. The upgrade is by far the largest modification to CESR in its 40-year history",
        "replacing one-sixth of the storage ring with six new double-bend achromats",
        "increasing beam energy from 5.3 GeV to 6.0 GeV",
        "and switching from two counter-rotating beams to a single on-axis positron beam. The new achromats include combined-function dipoles",
        "a first in CESR",
        "and reduce the horizontal emittance by a factor of four. Eight compact narrow-gap undulators (4.6mm vacuum chamber aperture) and one high-energy 24-pole wiggler feed a total of six new and five existing x-ray end stations from a single positron beam. Commissioning of CHESS-U took place in the first half of 2019. We report on the methods and results of beam commissioning",
        "including initial beam accumulation",
        "optics correction",
        "characterization",
        "and commissioning of compact permanent-magnet insertion devices."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh20.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH20",
      "page_number": "522",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPLH24",
      "title": "Performance of CeC PoP Accelerator",
      "authors": [
        "I. Pinayev",
        "Z. Altinbas",
        "J.C. Brutus",
        "A.J. Curcio",
        "A. Di Lieto",
        "T. Hayes",
        "R.L. Hulsart",
        "P. Inacker",
        "Y.C. Jing",
        "V. Litvinenko",
        "J. Ma",
        "G.J. Mahler",
        "M. Mapes",
        "K. Mernick",
        "K. Mihara",
        "T.A. Miller",
        "M.G. Minty",
        "G. Narayan",
        "I. Petrushinapresenter",
        "F. Severino",
        "K. Shih",
        "Z. Sorrell",
        "J.E. Tuozzolo",
        "E. Wang",
        "G. Wang",
        "A. Zaltsman",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "Coherent electron cooling experiment is aimed for demonstration of the proof-of-principle demonstration of reduction energy spread of a single hadron bunch circulating in RHIC. The electron beam should have the required parameters and its orbit and energy should be matched to the hadron beam. In this paper we present the achieved electron beam parameters including emittance",
        "energy spread",
        "and other critical indicators. The operational issues as well as future plans are also discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuplh24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuplh24.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuplh24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUPLH24",
      "page_number": "526",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 16,
  "scrape_time": "2025-10-11 00:49:51"
}