{
  "session_info": {
    "id": "FRXCA",
    "name": "FRXCA - Invited Oral Presentation, Beam Instrumentation and Feedback",
    "url": "https://proceedings.jacow.org/IPAC2014/html/frxca.htm"
  },
  "papers": [
    {
      "paper_id": "FRXCA01",
      "title": "State-of-the-art and Future Challenges for Machine Protection Systems",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "Current frontier accelerators explore regimes of increasing power and stored energy",
        "with beam energies spanning more than three orders of magnitude from the GeV to the TeV scale. In many cases the high beam power has to cohabit with superconducting equipment in the form of magnets or RF cavities requiring careful control of losses and of halos to mitigate quenches. Despite their large diversity in physics goals and operation modes",
        "all facilities depend on their “Machine Protection Systems” (MPS) for safe and efficient running. This presentation will aim to give an overview of current MPS and on how the MPS act on or control the beams. Lessons from the LHC and other accelerators show that ever tighter monitoring of accelerator equipment and of beam parameters is required in the future. Such new monitoring systems must not only be very accurate but also be extremely reliable to minimize false alarms. Novel MPS ideas and concepts for linear colliders",
        "high intensity hadron accelerators and to other high power accelerators will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/frxca01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/frxca01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/frxca01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-FRXCA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 20:57:55"
}