{
  "session_info": {
    "id": "WEPMG",
    "name": "WEPMG - MC7 Poster Session",
    "url": "https://proceedings.jacow.org/ipac2018/html/wepmg.htm"
  },
  "papers": [
    {
      "paper_id": "WEPMG001",
      "title": "Engineering Design and Prototyping of the New LIU PS Internal Beam Dumps",
      "authors": [
        "G. Romagnoli",
        "J.A. Briz Monago",
        "M.E.J. Butcher",
        "M. Calviani",
        "D.G. Cotte",
        "Y. C. Coutron",
        "J.J. Esala",
        "E. Grenier-Boley",
        "J. Hansen",
        "A. Huschauer",
        "A. Masi",
        "F.-X. Nuiry",
        "D. Steyart",
        "V. Vlachoudis",
        "CERN",
        "Geneva",
        "Switzerland",
        "For the LHC Injectors Upgrade (LIU) at CERN",
        "the two Proton Synchrotron (PS) internal dumps are redesigned and upgraded for the new high intensity/brightness beams. The dumps are installed as active elements in the lattice in straight sections between the main bending magnets. The dumps are moved into the beam when requested by operation and shave the circulating beam turn by turn stopping the beam after about 6 ms. The shaving induces a very localized beam energy deposition on the dump surface in a thickness of tens of microns. A completely new approach has been developed with FLUKA to simulate beam shaving",
        "coupled with ANSYS to define a new dump core design. This paper presents the design of the dump based on operational constraints such as cycling 200 000 times per year for 20 years",
        "limited access for maintenance or reaching the beam trajectory in 150 ms. These constraints had a major impact on the technological choices. The new dump core is made of a low-density graphite block followed by a denser copper alloy (CuCr1Zr) one. Water circuits",
        "bonded with Hot Isostatic Pressing",
        "are cooling the core in ultra-high vacuum. The core is moved by a spring-based actuation mechanism."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepmg001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepmg001.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepmg001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPMG001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPMG002",
      "title": "Beam Dump Facility Target: Design Status and Beam Tests in 2018",
      "authors": [
        "E. Lopez Sola",
        "O. Aberle",
        "P. Avigni",
        "L. Bianchi",
        "J. Busom",
        "M. Calviani",
        "M. Casolino",
        "J.P.C. Espadanal",
        "M.A. Fraser",
        "S. Girod",
        "B. Goddard",
        "D. Grenier",
        "M. Guinchard",
        "C. Heßler",
        "R. Illan Fiastre",
        "R. Jacobsson",
        "M. Lamont",
        "A. Ortega Rolo",
        "B. Riffaud",
        "G. Romagnolipresenter",
        "L. Zuccalli",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Beam Dump Facility (BDF) Project",
        "currently in its design phase",
        "is a proposed general-purpose fixed target facility at CERN",
        "dedicated to the Search for Hidden Particles (SHiP) experiment in its initial phase. At the core of the installation resides the target/dump assembly",
        "whose aim is to fully absorb the high intensity 400 GeV/c SPS beam and produce charmed mesons. In addition to high thermo-mechanical loads",
        "the most challenging aspects of the proposed installation lie in very high energy and power density deposition that are reached during operation. In order to validate the design of the BDF target",
        "a scaled prototype is going to be tested during 2018 in the North Area at CERN",
        "upstream the existing beryllium primary targets. The prototype testing under representative beam scenarios will allow having an insight of the material response in an unprecedented regime. Online monitoring and an extensive Post Irradiation Experimental (PIE) campaign are foreseen. The current contribution will detail the design and handling aspects of the innovative Target Complex as well as the design of the BDF target/dump core and the design and construction of the prototype target assembly."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepmg002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepmg002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepmg002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPMG002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPMG003",
      "title": "Analysis and Operational Feedback of the New High-Energy Beam Dump in the CERN SPS",
      "authors": [
        "A. Perillo-Marcone",
        "M. Calviani",
        "R. Illan Fiastre",
        "P. Rios Rodriguez",
        "G. Romagnolipresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN Super Proton Synchrotron (SPS) high-energy internal dump (TIDVG) is used to intercept beam dumps from 102.2 to 450 GeV. An inspection in 2013 revealed significant beam induced damage to the aluminium absorbing block",
        "resulting in operational limitations to minimize the risk of reproducing this phenomenon. Additionally",
        "in 2016 a vacuum leak was detected in the dump assembly",
        "which imposed further limitations",
        "i.e.",
        "a reduction of the beam intensity that could be dumped. In the winter stop of 2016-2017",
        "a new version of the TIDVG (featuring several design modifications) was installed. This paper analyses the performance of the dump observed during the commissioning period and subsequent operation in 2017 of the most recent installed version of the TIDVG. The temperature measurements recorded during this time were used to benchmark numerical models that allow predicting the performance of the dump under different conditions. After several iterations",
        "a good agreement between simulations and real measurements was obtained; resulting in numerical models that can produce reliable results for this and other devices with similar design."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepmg003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepmg003.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepmg003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPMG003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPMG004",
      "title": "Design of the Future High Energy Beam Dump for the CERN SPS",
      "authors": [
        "S. Pianese",
        "J.A. Briz Monago",
        "M. Calviani",
        "D. Grenier",
        "P.B. Heckmann",
        "J. Humbert",
        "R. Illan Fiastre",
        "A. Perillo-Marcone",
        "G. Romagnolipresenter",
        "S. Sgobba",
        "D. Steyart",
        "V. Vlachoudis",
        "CERN",
        "Geneva",
        "Switzerland",
        "The future CERN Super Proton Synchrotron (SPS) internal dump (Target Internal Dump Vertical Graphite",
        "known as TIDVG#5)",
        "to be installed during CERN's Long Shutdown 2 (2019-2020)",
        "will be required to intercept beam dumps from 26 to 450 GeV",
        "with increased intensity and repetition rates with respect to its predecessor (TIDVG#4). The beam power to be managed by the dump will increase by approximately a factor of four; resulting in new challenges in terms of design in order to fulfil the highly demanding specification",
        "which is based on guaranteeing a good performance of the machine with little or no limitations imposed by this device. This paper presents the proposed design",
        "including material selection",
        "manufacturing techniques and thermo-mechanical simulations under different operational scenarios expected during the lifetime of the device."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepmg004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepmg004.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepmg004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPMG004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPMG005",
      "title": "First Beam Test of Laser Engineered Surface Structures (LESS) at Cryogenic Temperature in CERN SPS Accelerator",
      "authors": [
        "R. Salemme",
        "V. Baglin",
        "S. Calatroni",
        "P. Chiggiato",
        "B. Di Girolamo",
        "E. Garcia-Tabares Valdivieso",
        "B. Jenninger",
        "L. Prever-Loiri",
        "M. Sitkopresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "A. Abdolvand",
        "S. Wackerow",
        "University of  Dundee",
        "Nethergate",
        "Dundee",
        "Scotland",
        "United Kingdom",
        "ITER Organization",
        "St. Paul lez Durance",
        "France",
        "Electron cloud mitigation is an essential requirement for accelerators of positive particles with high intensity beams to guarantee beam stability and limited heat load in cryogenic systems. Laser Engineered Surface Structures (LESS) are being considered",
        "within the High Luminosity upgrade of the LHC collider at CERN (HL-LHC)",
        "as an option to reduce the Secondary Electron Yield (SEY) of the surfaces facing the beam",
        "thus suppressing the elec-tron cloud phenomenon. As part of this study",
        "a 2.2 m long Beam Screen (BS) with LESS has been tested at cryogenic temperature in the COLD bore EXperiment (COLDEX) facility in the SPS accelerator at CERN. In this paper",
        "we describe the manufacturing procedure of the beam screen",
        "the employed laser treatment technique and discuss our first observations in COLDEX confirming electron cloud suppression."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepmg005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepmg005.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepmg005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPMG005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPMG006",
      "title": "Experimental Setup to Characterize the Radiation Hardness of Cryogenic Bypass Diodes for the HL-LHC Inner Triplet Circuits",
      "authors": [
        "A. Will",
        "G. D'Angelo",
        "R. Denz",
        "M.F. Favre",
        "D. Hagedorn",
        "G. Kirby",
        "T. Koettig",
        "A. Monteuuis",
        "F. Rodriguez-Mateos",
        "A.P. Siemko",
        "K. Stachon",
        "M. Valettepresenter",
        "A.P. Verweij",
        "D. Wollmann",
        "CERN",
        "Geneva",
        "Switzerland",
        "A. Bernhard",
        "A.-S. Müller",
        "KIT",
        "Karlsruhe",
        "Germany",
        "KEA",
        "Copenhagen",
        "Denmark",
        "For the high luminosity upgrade of the Large Hadron Collider (LHC)",
        "it is planned to replace the existing triplet quadrupole magnets with Nb3Sn quadrupole magnets",
        "which provide a comparable integrated field gradient with a significantly increased aperture. These magnets will be powered through a novel superconducting link based on MgB2 cables. One option for the powering layout of this triplet circuit is the use of cryogenic bypass diodes",
        "where the diodes are located inside an extension to the magnet cryostat and operated in superfluid helium. Hence",
        "they are exposed to radiation. For this reason the radiation hardness of existing LHC type bypass diodes and more radiation tolerant prototype diodes needs to be tested up to the radiation doses expected at their planned position during their lifetime. A first irradiation test is planned in CERN's CHARM facility starting in spring 2018. Therefore",
        "a cryo-cooler based cryostat to irradiate and test LHC type diodes in-situ has been designed and constructed. This paper will describe the properties of the sample diodes",
        "the experimental roadmap and the setup installed in CHARM. Finally",
        "the first measurement results will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepmg006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepmg006.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepmg006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPMG006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-10 19:31:54"
}