{
  "session_info": {
    "id": "FRCB",
    "name": "FRCB - Status Report of Control System",
    "url": "https://proceedings.jacow.org/pcapac2012/html/frcb.htm"
  },
  "papers": [
    {
      "paper_id": "FRCB01",
      "title": "Maintaining an Effective and Efficient Control System for the Electromagnetic Calorimeter of the Compact Muon Solenoid Experiment During Long-term CERN Large Hadron Collider Operations",
      "authors": [
        "O. Holme",
        "D.R.S. Di Calafiori",
        "G. Dissertori",
        "W. Lustermann",
        "ETH",
        "Zurich",
        "Switzerland",
        "UW-Madison/PD",
        "Madison",
        "Wisconsin",
        "USA",
        "The sub-detectors of the Compact Muon Solenoid (CMS) multi-purpose particle detector at the CERN Large Hadron Collider (LHC) have been collecting physics data from particle collisions for almost three years. During this period",
        "the Electromagnetic Calorimeter (ECAL) Detector Control System (DCS) has contributed to the high level of availability of the experiment. This paper presents the current architecture of this distributed and heterogeneous control system alongside plans and developments for future improvements. To ensure that the system can efficiently operate and adapt to changes throughout the required operation lifetime of more than a decade",
        "the potential legacy aspects of this kind of control system must be carefully managed. Such issues include evolving system requirements",
        "turnover of staff members",
        "potential benefits from new technologies and the need to follow release schedules of external software dependencies. The techniques and results of the work to continually maintain",
        "improve and streamline the control system are presented",
        "including the use of metrics to evaluate the impact of this effort."
      ],
      "institutions": [
        "Funding: Swiss National Science Foundation (SNF)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/frcb01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/frcb01.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/frcb01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-FRCB01",
      "page_number": "254",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCB02",
      "title": "Development of the Control System for PEFP 100-MeV Proton Linear Accelerator",
      "authors": [
        "Y.-G. Song",
        "Y.-S. Cho",
        "J.-H. Jang",
        "H.-J. Kwon",
        "KAERI",
        "Daejon",
        "Republic of Korea",
        "The 100MeV proton linear accelerator of the Proton Engineering Frontier Project (PEFP) has been developed and will be installed in Gyeong-ju site. After the installation",
        "the beam commissioning of the 100MeV linac will be performed. The PEFP is currently developing control systems including the machine control system and user interface for remote control and monitoring. The final goal of the PEFP control system is to construct a network attached",
        "distributed control system",
        "and a standard communication protocol among the local subsystems. In this paper",
        "we will present the details of the distributed control system development for PEFP 100-MeV proton linac."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/frcb02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/frcb02.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/frcb02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-FRCB02",
      "page_number": "257",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCB03",
      "title": "RF Control System for 400 keV RFQ",
      "authors": [
        "G. Joshi",
        "T. Ananthkrishnan",
        "S.K. Bharade",
        "P. M. Paresh",
        "C.K. Pithawa",
        "C.I. Sujo",
        "BARC",
        "Trombay",
        "Mumbai",
        "India",
        "An RF control system has been developed for the 400 keV",
        "350 MHz RFQ coming up at BARC. This single cavity system consists of the functionalities of amplitude stabilization and frequency tracking for both continuous and pulsed mode of operation. The amplitude stabilization is implemented by modulating the attenuation across a fast modulator placed in the drive path. The frequency tracking is achieved by driving the FM port of a signal generator with a signal proportional to the phase shift across the resonator. The whole system is under computer control via CAMAC hardware. The paper describes the system architecture",
        "housing & wiring of the system in a single instrumentation rack and development & testing of computer control."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/frcb03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/frcb03.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/frcb03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-FRCB03",
      "page_number": "260",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCB04",
      "title": "VEPP-2000 Collider Control System",
      "authors": [
        "A.I. Senchenko",
        "D.E. Berkaev",
        "A.S. Kasaev",
        "I. Koop",
        "V.R. Kozak",
        "A.N. Kyrpotin",
        "A.P. Lysenko",
        "Yu. A. Rogovsky",
        "A.L. Romanov",
        "P.Yu. Shatunov",
        "Y.M. Shatunov",
        "A.S. Stankevich",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Electron-positron collider VEPP-2000 has been commissioned at Budker Institute of Nuclear Physics. The first experiments on high energy physics has been started at the end of 2009. The paper presents architecture",
        "implementation and functionality of hardware and software of the collider control system. The hardware of the system consists of high current main field power supplies",
        "steering coils power supplies",
        "pulse-elements",
        "RF subsystems and some other special subsystems (such as vacuum",
        "temperature",
        "etc.). The system is based on modern industrial protocol CAN-bus and specialized electronic BINP manufactured blocks according the standard. The paper describes implementation of different subsystems based on CANbus devices",
        "and operating characteristics and their possibilities. Other standards and protocols like CAMAC",
        "VME and so on also used in the system. The software according to hardware system consists of interacting subsystems responding on different acceleration facility parts. Control system software is based on several TCP/IP connected PC platforms under operating system Linux and uses client-server techniques."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/frcb04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/frcb04.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/frcb04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-FRCB04",
      "page_number": "263",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-11 02:12:16"
}