{
  "session_info": {
    "id": "MOCOWBS",
    "name": "MOCOWBS - Workshop Opening and WG1: ERL facilities",
    "url": "https://proceedings.jacow.org/erl2019/html/mocowbs.htm"
  },
  "papers": [
    {
      "paper_id": "MOCOWBS01",
      "title": "CBETA, a 4-turn ERL Based on SRF Linacs: Construction and Commissioning",
      "authors": [
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "A DC-photo-emitter electron source",
        "a high-power SRF injector linac",
        "a high-current SRF linac for energy recovery",
        "and a permanent-magnet return loop have been assembled to the 4-turn SRF ERL. Because of it’s Fixed-Field Alternating-gradient optics",
        "the single return loop accommodates all 4 beam energies in one vacuum pipe. A collaboration between Cornell and Brookhaven National Laboratory has constructed",
        "and is currently commissioning on the Cornell campus this Cornell-BNL-ERL-Test-Accelerator (CBETA). While the electron sourse and SRF linac were prototyped at Cornell",
        "the strong Halbach-type permanent magnets for the FFA return loop were prototyped at BNL",
        "leading to a strong collaboration. The Electron Ion Collider (EIC) has been determined to be the USA’s highest priority new large accelerator for Nuclear Physics by the National Academy of Sciences. It¿s luminosity relies on electron cooling",
        "and only ERLs can provide the cooling parameters. CBETA therefore provides essential R&D for the EIC. The high-brightness beam with 150 MeV and up to 40 mA will have applications beyond EIC cooling and basic accelerator research",
        "in industry",
        "in nuclear physics",
        "and in X-ray science."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/mocowbs01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/mocowbs01.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/mocowbs01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-MOCOWBS01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOCOWBS02",
      "title": "Compact ERL (cERL), Stable 1 mA Operation with a Small Beam Emittance at KEK",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "The compact ERL (cERL) at KEK is a test accelerator to develop ERL technologies for high average beam current operation with high quality beam performance. The cERL consists of a photoinjector",
        "a main linac for energy recovery",
        "a recirculation loop and a beam dump. In order to achieve energy recovery operation with high average beam current",
        "collimator tuning to reduce un-wanted beam loss was very important. After fine beam tuning and collimator tuning",
        "we succeeded in CW operation with 0.9 mA average beam current",
        "and it was very stable in two hours in June 2018. The emittances were measured in the injector and the recirculation loop by waist scan method",
        "and they were close to the design emittance. In order to increase CW beam current to 10 mA",
        "we are preparing the improvement of instrumentations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/mocowbs02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/mocowbs02.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/mocowbs02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-MOCOWBS02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 08:38:18"
}