{
  "session_info": {
    "id": "TUPA",
    "name": "TUPA - Tuesday Poster AM Session A",
    "url": "https://proceedings.jacow.org/medsi2020/html/tupa.htm"
  },
  "papers": [
    {
      "paper_id": "TUPA01",
      "title": "Oxygen-Free Titanium Thin Film as a New Nonevaporable Getter with an Activation Temperature as Low as 185 °C",
      "authors": [
        "M. Ono",
        "I. Yoshikawa",
        "K. Yoshioka",
        "University of Tokyo",
        "Kashiwa",
        "Japan",
        "T. Kikuchi",
        "K. Masepresenter",
        "KEK",
        "Tsukuba",
        "Japan",
        "Sokendai",
        "The Graduate University for Advanced Studies",
        "Tsukuba",
        "Japan",
        "Y. Masuda",
        "Y. Nakayama",
        "Tokyo University of Science",
        "Noda",
        "Japan",
        "Yokohama National University",
        "Yokohama",
        "Japan",
        "TIT",
        "Tokyo",
        "Japan",
        "Yokohama National University",
        "Graduate School of Engineering Science",
        "Yokohama",
        "Japan",
        "Although nonevaporable getter (NEG) pumps are widely used in synchrotron radiation facilities",
        "pure metal Titanium (Ti) has not been used as a NEG because the activation temperature of a Ti thin film deposited by DC magnetron sputtering was reported to be 350-400 °C*. Recently Miyazawa et al. found that high-purity Ti deposited under ultra-high vacuum (UHV) followed by N2 introduction works as a NEG with an activation temperature of 185 °C**",
        "***. Since the concentration of impurities such as O",
        "C",
        "and N in the Ti thin film prepared by this method is 0.05% or less",
        "we named this as oxygen-free Ti. In this study",
        "we evaluated the pumping properties of oxygen-free Ti thin films after high-purity N2 introduction by total and partial pressure measurements. A vacuum vessel with oxygen-free Ti deposited on the inner walls was found to pump H2",
        "H2O",
        "O2",
        "CO and CO2 even after 30 cycles of high purity N2 introduction",
        "air exposure",
        "pumping",
        "and baking at 185 °C. Furthermore",
        "we analyzed the oxygen-free Ti thin films after high-purity N2 or air introduction by synchrotron radiation X-ray photoelectron spectroscopy. The results show that more TiN was formed when high-purity N2 was introduced after oxygen-free Ti deposition. High purity of the Ti thin film and TiN formation on the surface seem to be responsible for the reduced activation temperature as low as 185 °C.",
        "*C. Benvenuti et al.",
        "J. Vac. Sci. Technol. A 16",
        "148 (1998).  **T. Miyazawa et al.",
        "Vac. Surf. Sci. 61",
        "227 (2018). ***KEK",
        "patent pending",
        "WO2018097325 (Nov. 28",
        "2017)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA01",
      "page_number": "119",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPA02",
      "title": "Design of Remote Helium Mass Spectrometer Leak Detector",
      "authors": [
        "H.Y. He",
        "H. Song",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "DNSC",
        "Dongguan",
        "People’s Republic of China",
        "R.H. Liupresenter",
        "G.Y. Wang",
        "IHEP CSNS",
        "Guangdong Province",
        "People’s Republic of China",
        "Leak detection is the key to get a good vacuum system. For the dangerous areas",
        "or facility with complicit structure required to be detected online",
        "it is a hard mask to seek for the suspected leaks one after another. After studying the basic principle of helium mass leak detection",
        "design a remote leak detector based on the PLC",
        "as well as multi monitoring cameras",
        "which can achieve successful injection and sniffer probe leak detection in the range of 270 degree. Compared with the manual operation",
        "this device aims at accurately and reliably detecting leak rate",
        "which can greatly provide technique support of online leak detection. And it can bring the value of reducing the labor intensity and ensuring personal safety."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA02",
      "page_number": "123",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPA03",
      "title": "Design of Johann-Type Five Crystal Spectrometer Using a Single Motor Axis",
      "authors": [
        "AS - ANSTO",
        "Clayton",
        "Australia",
        "This is a design exploration of 5 crystal spherically bent Johann-type spectrometer to be used on Spectroscopy based beam-lines. Traditionally",
        "a 4-axis motorised unit is required for each crystal and a 3-axis unit is required for detector positioning",
        "making the total motorized axis greater than 23 for the spectrometer. This design is an attempt to follow the Roland circle/geometry paths using multi-bar linkage mechanisms requiring only one motorised axis for the whole system. The proposed system is comprised of 3 separate but inter-linked mechanisms driven by a one motor. Design Specification: Ø100 x 5-spherically bent crystals",
        "repeatability ±50µm",
        "SDD detector",
        "500mm Roland circle. The intent of the design is to simplify operation",
        "reduce weight",
        "reduce complexity",
        "reduce costs and reduce maintenance aspects as compared to how it is done in current commercially available systems. This design a radical re-think of the Johann-type spectrometer mechanics.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPA04",
      "title": "Investigations on Stability Performance of Beamline Optics Supports at BSRF",
      "authors": [
        "W.F. Sheng",
        "H. Liangpresenter",
        "Y.S. Lu",
        "Z. Zhang",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "The stability of beamline optics directly affects the beamline’s performances",
        "such as coherence",
        "focal size",
        "position stability of the beam and so on",
        "it has become a serious issue for a low emittance 4th generation light source. The vibration transmitting function of supports plays a big role in the stability performance of the optics. In order to find out a stable supporting structure",
        "several types of support structures were tested",
        "and the transfer ratio were described. The result shows that wedge struc-tures generally have a lower transfer ratio",
        "and point contact support structures should be avoided."
      ],
      "institutions": [
        "Funding: This research is supported by National Natural Science Foundation of China (NSFC) (No.11905243)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa04.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA04",
      "page_number": "125",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPA05",
      "title": "Research on Vibration Stability of SAPS Foundation",
      "authors": [
        "G.Y. Wang",
        "J.X. Chen",
        "C.J. Ning",
        "J.B. Yu",
        "Y.J. Yu",
        "J.S. Zhang",
        "D.H. Zhu",
        "IHEP CSNS",
        "Guangdong Province",
        "People’s Republic of China",
        "H.Y. He",
        "L. Kang",
        "L. Liu",
        "R.H. Liupresenter",
        "X.J. Nie",
        "A.X. Wang",
        "L.Q. Zhao",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "The construction of the South Advanced Light Source Platform will be completed in 2021. Among them",
        "the high-precision test hall requires that the effective value of the micro-vibration of the foundation be controlled within the vibration range of 25nm",
        "which has already met the requirements of nanometer level. Research at dongguan machinery group",
        "therefore",
        "in view of the high precision testing hall",
        "south of advanced light source is proposed to geological environment factors",
        "carry out detailed geological survey measurement",
        "focus on the advanced light source foundation vibration test",
        "resistance to vibration and vibration characteristics research foundation and anti-vibration scheme research and the advanced light source is the key equipment vibration reduction technology research",
        "through to the light source address of the proposed foundation vibration test",
        "the vibration of foundation design",
        "synchrotron radiation device key equipment comprehensive analysis and research of vibration reduction technology",
        "formed a series of foundation vibration and key equipment solution",
        "for the later construction of the southern light source to lay a solid foundation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa05.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA05",
      "page_number": "128",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPA06",
      "title": "Study the Active Vibration Control System of the Parallel 6-DOF Platform",
      "authors": [
        "R.H. Liu",
        "H.Y. He",
        "Z.Y. Ke",
        "L. Liu",
        "X.J. Nie",
        "C.J. Ning",
        "A.X. Wang",
        "Y.J. Yu",
        "D.H. Zhu",
        "IHEP CSNS",
        "Guangdong Province",
        "People’s Republic of China",
        "L. Kang",
        "J.S. Zhang",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "Institute of High Energy Physics",
        "CAS",
        "Guangdong",
        "People’s Republic of China",
        "With the development of high-energy synchrotron radiation light source with high energy",
        "high brightness",
        "low emittance and nano-scale light spot",
        "accelerators and beamline stations have higher requirements for the stability of the system",
        "and active vibration isolation technology has been paid more and more attention. It has become the key technology for the development of major scientific devices (such as high-energy synchrotron radiation light source",
        "free electron laser",
        "etc.) in the future. In this paper",
        "an active vibration control system driven by piezoelectric ceramic actuator with strong adaptability is designed. NI Compact-RIO real-time control system and Fx-LMS adaptive filter control algorithm are used for the active vibration control system.  The identification method of input and output channels and the active control module are simulated by MATLAB. And an active vibration control system based on a parallel 6-DOF platform was built for experimental verification. The experimental results show that the designed active vibration control system has a good control effect for low-frequency micro-vibration."
      ],
      "institutions": [
        "Funding: National Natural Science Foundation of China 11905231"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa06.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA06",
      "page_number": "131",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPA07",
      "title": "Ground Vibration Measurements and Analysis for the SHINE Project",
      "authors": [
        "F. Liu",
        "Z. Wang",
        "ShanghaiTech University",
        "Shanghai",
        "People’s Republic of China",
        "R. Deng",
        "N. Mao",
        "L. Zhang",
        "W. Zhu",
        "SARI-CAS",
        "Pudong",
        "Shanghai",
        "People’s Republic of China",
        "Shanghai Institute of Optics and Fine Mechanics",
        "Shanghai",
        "People’s Republic of China",
        "The Shanghai HIgh repetitioN rate XFEL and Extreme light facility (SHINE) is the first hard X ray free electron laser facility in China. The facility is located in Zhanghai HighTech Park in Shanghai",
        "with a total length of 3.1 km",
        "consisting of three tunnels which are around 29 meters underground and 5 shafts. The 1st shaft is for injection",
        "the 2nd shaft is for electron switches",
        "the 3rd shaft is for beam dumps",
        "the 4th shaft is the near experimental hall",
        "while the 5th shaft is the far experimental hall. As such a long facility",
        "the stability caused by the environmental vibrations is always a big concern. In this report",
        "several vibration sensors",
        "including accelerometers",
        "seismometers",
        "and velocity sensors were compared to find out the frequency range of the sensors. The vibration on the ground of the 1st shaft as well as underground were measured and analyzed. Furthermore",
        "the ground vibrations were also compared with SSRF and SULF. To investigate the ground vibration effect on the beam transportation",
        "the real vibration PSDs were imported into finite element analysis (FEA) model for random vibration analysis",
        "the angular vibrations of the model were analyzed and tested.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa07.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA07",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPA08",
      "title": "Performance of a Double Crystal Monochromator Prototype for HEPS under Water Cooling Condition at a Wiggler Beamline of BSRF",
      "authors": [
        "H. Liang",
        "W.F. Sheng",
        "H. Shi",
        "Y.M. Yang",
        "L.R. Zheng",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "The performance of monochromator is crucial to the performance of a beamline",
        "especially for a 4th genera-tion synchrotron light source. To find out the perfor-mance of the monochromator prototype built for the HEPS project",
        "it was tested at a wiggler beamline of BSRF with water cooling. The cooling of the crystals was measured by rocking curve broadening at different energy and cooling seems to be not enough due to indium foils. The repeatability in 1 hour was about 0.1 eV. The energy drift in 9 hours after the beam hit the beam-line was 0.4 eV at the Cu K edge. The short-term stability was tested with synchrotron beam under various cooling condition",
        "and results between 4.4 nrad to around 400 nrad were observed. In conclusion",
        "some performances are satisfying",
        "but further improvements should be carried out in the future."
      ],
      "institutions": [
        "Funding: This research is supported by National Natural Science Foundation of China (NSFC) (No.11905243)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa08.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA08",
      "page_number": "135",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPA09",
      "title": "Beamline Design Consideration on the Thermal Deformation for High Energy Photon Source",
      "authors": [
        "F.G. Yang",
        "Y.H. Dong",
        "L. Gao",
        "M. Li",
        "W.F. Sheng",
        "H.R. Wang",
        "X.W. Zhang",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "To exploit the high quality of the X-ray beam generated by the new advanced light source",
        "high precision optics instruments are necessary. However",
        "the heat-loading optics including monochromator and white beam mirror have been a big issue",
        "which introduces the wavefront distortion. In this paper",
        "we present the effect of the thermal deformation on the beamline performance",
        "and show the simulation results in our new high energy source - HEPS. Accordingly",
        "the requirement of the thermal deformation is provided for different application.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Funding: This work is supported by National Natural Science Foundation of China (Grant No. 11505212, No. 11875059); Youth Innovation Promotion Association, Chinese Academy of Sciences."
      ],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa09.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA09",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPA10",
      "title": "Design of Magnet Girder System for Siam Photon Source II",
      "authors": [
        "Synchrotron Light Research Institute (SLRI)",
        "Muang District",
        "Thailand",
        "S. Chaichuay",
        "S. Klinkhieo",
        "S. Pongampai",
        "K. Sittisard",
        "S. Srichan",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "The new Siam Photon Source II (SPS-II) storage ring is designed with a circumference of 327.502 m. It consists of 14 DTBA cell",
        "where each cell requires 6 magnet girders. For the new storage ring of SPS II we developed a magnet girder system which uses wedgemounts for the precision alignment. The girder alignment uses a 3-2-1 alignment method and requires 3 wedgemounts to control Z direction",
        "2 wedgemounts to control Y-direction and 1 wedgemount for the X-direction. The magnet alignment is based on mechanical tolerances. Therefore",
        "the girders top plate is prepared with precision surfaces with a flatness tolerance of 30 µm. During the development process of the girder system deformation and vibration FEA analysis were carried out and the results were used to improve the design regarding low deformation and high natural frequencies. In this paper FEA analysis results are presented as well as the design of the girder",
        "pedestal and its wedgemount based alignment system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa10.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA10",
      "page_number": "138",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPA12",
      "title": "The Design and Prototype Test for the Tunnel Foundation of High Energy Photon Source",
      "authors": [
        "F. Yan",
        "X.P. Jing",
        "G.P. Lin",
        "J. Qiu",
        "G. Xu",
        "N.C. Zhou",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "A.Z. Lu",
        "Y.L. Xing",
        "Z.G. Xu",
        "Y.S. Zhang",
        "CEEDI",
        "Beijing",
        "People’s Republic of China",
        "High Energy Photon Source (HEPS) is being built in China with challenging beam stability requirements. To fulfil the 25 nm ground motion restriction on the storage ring tunnel slab",
        "two prototype slabs with different design schemes were constructed on the HEPS site. The first scheme adopted a 1 m reinforced concrete with replace-ment layer of a 1 m sand & stone underneath. The second scheme employed an extra 5 m grouting layer below the previously mentioned two layers. A series of tests had been carried out. The prototype slab with grouting layer is testified to have comparable vibration level with the bare ground",
        "which is under 25 nm without traffic inside the HEPS campus",
        "while the vibration level is amplified a lot on the other prototype slab. However",
        "it is hard to make the grouting layer homogeneously under the kilo-metre-scale tunnel and besides the cost is unacceptable for 5 m grouting with such a large scale. The finalized design is fixed to be a 1 m reinforced concrete slab and 3 m replacement layer underneath using plain concrete. In this paper",
        "the details of the prototype slab test results will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa12.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA12",
      "page_number": "141",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPA13",
      "title": "Research of Bellow Shield Structure Applied to BPM",
      "authors": [
        "X.J. Nie",
        "L. Kang",
        "R.H. Liupresenter",
        "S.K. Tian",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "J.X. Chen",
        "H.Y. He",
        "L. Liu",
        "C.J. Ning",
        "A.X. Wang",
        "G.Y. Wang",
        "J.B. Yu",
        "Y.J. Yu",
        "J.S. Zhang",
        "D.H. Zhu",
        "IHEP CSNS",
        "Guangdong Province",
        "People’s Republic of China"
      ],
      "institutions": [],
      "abstract": "The design of shield structure for bellow is an im-portant content for the research of beam position monitor (BPM). The bellow shield structure consists of contact fingers and spring fingers. Several alternative schemes for bellow shield were achieved based on BPM detailed structure. The optimal scheme was achieved by the im-pedance simulation analysis with CST. The dimension of the contact finger was decided based on the length of BPM with the stress condition. The C-type string was manufactured and the spring force was measured as well. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa13.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA13",
      "page_number": "145",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPA14",
      "title": "Stability Study of HEPS Storage Ring Magnet Support",
      "authors": [
        "Z.H. Wang",
        "C.H. Li",
        "H. Wang",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "The stability of the beam is affected by the stability of the magnet girder. The High Energy Particle Source requires that the natural frequency of the storage ring magnet girder be better than 54Hz. In order to meet the stability requirement",
        "the connection stiffness of the girder and the fixed stiffness of the plinth are studied in this paper. The main contents of this paper includes: dynamic stiffness test",
        "the prototype of the plinth fixed stiffness test. According to the test results and finite element simulation method",
        "the stability of magnet girder is guaranteed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa14.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA14",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPA15",
      "title": "Processing of HEPS Low Energy Transport Line Collimator",
      "authors": [
        "J.B. Yu",
        "J.X. Chen",
        "H.Y. He",
        "L. Liu",
        "R.H. Liupresenter",
        "X.J. Nie",
        "C.J. Ning",
        "G.Y. Wang",
        "A.X. Wang",
        "Y.J. Yu",
        "J.S. Zhang",
        "D.H. Zhu",
        "IHEP CSNS",
        "Guangdong Province",
        "People’s Republic of China",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "In order to protect the equipment such as BPM at low energy transport line (LB)",
        "a momentum collimator is designed with one movable absorber. This paper will show the mechanical design and manufacturing of the collimator."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa15.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA15",
      "page_number": "148",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPA16",
      "title": "Design and Development of the Advanced Diffraction and Scattering Beamlines at the Australian Synchrotron",
      "authors": [
        "B.J. McMahon",
        "J.E. Auckett",
        "M. Fenwick",
        "R.B. Hogan",
        "J.A. Kimpton",
        "R. Lippi",
        "S. Porsa",
        "AS - ANSTO",
        "Clayton",
        "Australia",
        "The ADS beamlines are the fifth and sixth beamlines being built within the Australian Synchrotron/ANSTO BRIGHT program The two beamlines (ADS-1 and ADS-2) will operate independently with the beam generated by a powerful super-conducting multipole wiggler (SCMPW). ADS-1 will have tunable collimating optics that will combine with a fixed exit double crystal Laue monochromator (DCLM) to provide white",
        "pink and monochromatic beam (50-150 keV) to a large end-station located outside the main synchrotron building. ADS-1 will accommodate experiments using a variety of sample stages capable of positioning large and heavy samples (up to 300 kg). The second ADS beamline",
        "ADS-2",
        "will take a deflected beam from the main beam using a side-bounce monochromator (SBM) that produces three monochromatic energies from 45 keV - 90 keV. The SCMPW source for the beamline produces a beam of 45 kW at 4.5 T. The major optics of the beamline include a cryogenic SBM and a cryogenic DCLM",
        "a transfocator and multilayer VFM. The high heat load on the front end and upstream monochromator represented key challenges for the beamline design. Innovative approaches to thermal management have been developed. The high radiation environment required additional safety protocols to be implemented for beamline operation. The primary beamline endstation utilises a large gantry robot to independently position up to 4 detectors in an envelope of up to 8x3x0.3 m with a positional repeatability of ± 0.01 mm. The large motion envelope gives users access to large Q-range and allows flexibility for users to utilise large bespoke sample environments. The ADS beamlines project encompasses design",
        "procurement",
        "build/installation and commissioning phases. The beamline will commence user operations in July 2023."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa16.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA16",
      "page_number": "150",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPA17",
      "title": "Development of a Pair of Medium Energy X-Ray Absorption Spectroscopy Beamlines at Australian Synchrotron",
      "authors": [
        "AS - ANSTO",
        "Clayton",
        "Australia",
        "C. Glover",
        "B. Mountford",
        "ASCo",
        "Clayton",
        "Victoria",
        "Australia",
        "The Medium Energy X-ray absorption spectroscopy (MEX) beamlines are designed to perform routine",
        "high throughput XAS experiments in the energy range 1.7 to 13.6 keV; split over two beamlines. This energy range is often overlooked but allows access to useful absorption K-edges of Si",
        "P",
        "S",
        "Cl and Ca. Individual components of this system are relatively common",
        "however the large number of components and broad functionality makes for a difficult integration challenge. Both beamlines are supplied by a single bending magnet",
        "with the MEX2 beam being separated away by a pair of side bounce",
        "cylindrically bent mirrors. MEX1 utilises a pair of multi stripe mirrors (Si",
        "B4C and Rh) to access the desired energy range. Energy selection is performed by Double Crystal Monochromators (DCM)",
        "which are designed for both step and slew scanning. The end stations of both beamlines have Silicon Drift Detectors (SDD) and multiple ion chambers to facilitate fluorescence and transmission measurements. Sample temperatures can be controlled with any of the three helium recirculating cryostats or heaters. High Energy Resolution Fluorescence Detection (HERFD) experiments can be performed using either the single crystal spectrometer (MEX2) or the five crystal spectrometer (MEX1). MEX1 also includes a microprobe which uses a Kirkpatrick-Baez (KB) mirror to focus to a several micron spot. Given the energy range",
        "attenuation of the photons is a particular challenge. These end stations are designed to minimise beam attenuation and maximise experiment versatility by selectively allowing high vacuum or helium environments in different regions. Removable windows and custom designed interfaces between components minimises the number of windows in the beam path which would have further attenuated photons.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa17.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA17",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPA18",
      "title": "Nanoprobe Beamline Stability Optimization at the Australian Synchrotron",
      "authors": [
        "M. Semeraro",
        "N. Afshar",
        "C.M. Kewish",
        "AS - ANSTO",
        "Clayton",
        "Australia",
        "ASCo",
        "Clayton",
        "Victoria",
        "Australia",
        "ANSTO",
        "Menai",
        "New South Wales",
        "Australia",
        "The Nanoprobe beamline is one of the most technically challenging beamlines within the Australian Synchrotron ANSTO BRIGHT program. The Nanoprobe will host a suite of x-ray mapping capabilities at spatial resolutions down to 60 nanometres. This extreme resolution target requires an overall length of over 100 m entailing high stability for optical components. The first part of the beamline will be sitting on the main building floor and will include two mirrors",
        "two monochromators (DMM and DCM)",
        "a Secondary Source Aperture",
        "plus all ancillary components. The end station will be situated in a satellite building",
        "connected to the main building by a tunnel hosting the 50m UHV beam transfer pipe. The end station will host a pair of KB mirrors",
        "the sample stages",
        "multiple detectors and several beam inspection devices. There are several mechanical challenges that need to be overcome in the realisation of the beamline. Within the main building",
        "we need to ensure the mechanical stability of the mirrors",
        "the monochromators and the secondary source aperture. To reduce the vibration impact on the vertical displacement",
        "we have opted for an all-horizontally deflecting optical scheme. Separated and isolated slabs are required",
        "as well as mechanical isolation of vibration sources from the optical components. Thermal stability requirements are also challenging. Fundamental height above floor level requires thermal stability better than 0.05 C under the mirrors. Careful attention to materials selection and design is required for the end station to contain thermal drifts. Achieving these stabilities requires a careful approach as conventional HVAC systems bring vibration and air turbulence. This paper describes the design strategies adopted to optimize beamline components stability.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tupa18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tupa18.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tupa18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUPA18",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 17,
  "scrape_time": "2025-10-10 23:26:01"
}