{
  "session_info": {
    "id": "MOZPLS",
    "name": "MOZPLS - Invited Orals: Circular and Linear Colliders",
    "url": "https://proceedings.jacow.org/ipac2019/html/mozpls.htm"
  },
  "papers": [
    {
      "paper_id": "MOZPLS1",
      "title": "Particle Physics at the High Energy Frontier with the Next Electron-Positron Collider",
      "authors": [
        "University of Tokyo",
        "Tokyo",
        "Japan",
        "After discovering the Higgs boson and the recent studies at the Large Hadron Collider at CERN",
        "high precision measurements at a future electron-positron collider are proposed as the best way to further test the validity of the Standard Model. In particular",
        "the complete knowledge of the initial state and the low background environment of an electron-positron collider allows for superior event reconstruction",
        "enabling detailed measurements of the properties of the Higgs boson. These measurements will allow us to discriminate among the new physics models proposed to resolve several inconsistencies in the Standard Model",
        "thereby improving our understanding of particle physics at the most fundamental scale and paving the way for the future of the field. The physics programme of a future electron-positron collider will be presented outlining the relative merits of the linear and circular collider projects currently under consideration in the community."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/mozpls1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/mozpls1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/mozpls1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-MOZPLS1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOZPLS2",
      "title": "Ion Collider Precision Measurements With Different Species",
      "authors": [
        "G.J. Marr",
        "E.N. Beebe",
        "I. Blackler",
        "W. Christie",
        "K.A. Drees",
        "P.S. Dyer",
        "A.V. Fedotov",
        "W. Fischer",
        "C.J. Gardner",
        "H. Huang",
        "T. Kanesue",
        "N.A. Kling",
        "V. Litvinenko",
        "C. Liu",
        "Y. Luo",
        "D. Maffei",
        "B. Martin",
        "A. Marusic",
        "K. Mernick",
        "M.G. Minty",
        "C. Naylor",
        "M. Okamura",
        "I. Pinayev",
        "G. Robert-Demolaize",
        "T. Roser",
        "P. Sampson",
        "V. Schoefer",
        "T.C. Shrey",
        "D. Steski",
        "P. Thieberger",
        "J.E. Tuozzolo",
        "K. Zeno",
        "I.Y. Zhang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Precedent to electron cooling commissioning and collisions of Gold at various energies at RHIC in 2018",
        "the STAR experiment desired an exploration of the chiral magnetic effect in the quark gluon plasma (QGP) with an isobar run",
        "utilizing Ruthenium and Zirconium. Colliding Zr-96 with Zr-96 and Ru-96 with Ru-96 create the same QGP but in a different magnetic field due to the different charges of the Zr (Z=40) and Ru (Z=44) ions. Since the charge difference is only 10%",
        "the experimental program requires exacting store conditions for both ions. These systematic error concerns presented new challenges for the Collider",
        "including frequent reconfiguration of the Collider for the different ion species",
        "and maintaining level amounts of instantaneous and integrated luminosity between two species. Moreover",
        "making beams of Zr-96 and Ru-96 is challenging since the natural abundances of these isotopes are low. Creating viable enriched source material for Zr-96 required assistance processing from RIKEN",
        "while Ru-96 was provided by a new enrichment facility under commissioning at Oak Ridge National Laboratory."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/mozpls2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/mozpls2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/mozpls2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-MOZPLS2",
      "page_number": "28",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 19:04:11"
}