{
  "session_info": {
    "id": "THOYSP",
    "name": "THOYSP - Contributed Orals: Accelerator Technology",
    "url": "https://proceedings.jacow.org/ipac2022/html/thoysp.htm"
  },
  "papers": [
    {
      "paper_id": "THOYSP1",
      "title": "Construction and Measurement of a Tuneable Permanent Magnet Quadrupole for Diamond Light Source",
      "authors": [
        "A.R. Bainbridge",
        "B.J.A. Shepherd",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A.G. Hinton",
        "N. Krumpa",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "I.P.S. Martin",
        "W. Tizzano",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Permanent magnets (PMs) are becoming an attractive proposition as a green and efficient replacement for electromagnets in particle accelerators. The Zero-Power Tuneable Optics (ZEPTO) collaboration between STFC and CERN has demonstrated that traditional limitations of PM technology",
        "such as the ability to change the flux density in the magnet aperture",
        "can be overcome. Moving PM blocks relative to fixed steel structures that define the field",
        "the strength may be changed while suitable field homogeneity is maintained. A new ZEPTO variant has been developed in conjunction with Diamond Light Source (DLS) to demonstrate the technology on a real accelerator. This magnet features a number of crucial design innovations over previous generations of ZEPTO magnets that improve the convenience and versatility of PM systems and demonstrate that they can be deployed in many situations. We present the construction and measurement results of this new magnet and outline the planned data collection whilst installed on DLS. We analyse its performance relative to design and discuss the new features with focus on the real-world implications of PM technology for current and future accelerators."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thoysp1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thoysp1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thoysp1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THOYSP1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THOYSP2",
      "title": "The New Eddy Current Type Septum Magnet for Upgrading of Fast Extraction in Main Ring of J-PARC",
      "authors": [
        "T. Shibata",
        "K. Ishii",
        "S. Iwata",
        "H. Matsumoto",
        "T. Sugimoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "HUST",
        "Wuhan",
        "People’s Republic of China",
        "For our first goal of the beam power of Main Ring for Fast eXtraction (FX)",
        "750 kW",
        "we have been evaluating a new Low-Field FX Septum magnets which are induced eddy current type (Eddy-Septum) since 2014. The pending technical issues are disagreement in two current monitor systems and the long switching time of the Main-charger to Sub-charger at low charging voltage. We measured a gap field during measurement of current",
        "and found no drift in time variation of gap field. Our conclusion was that the cause of the disagreement is electric and radiative noise which make the drift in the time variation. The long-term stability of the output pulsed current depends on the switching time and charging voltage. We investigated the correlation between the keeping time of flat-top charging voltage and long-time stability with various charging voltages. In June 2021",
        "we have first conducted the 1 Hz operation and high-voltage test of the Eddy-Septum which is mounted in a vacuum chamber",
        "and we found no problem. A new pure iron duct type magnetic shield for reducing the leakage field were produced in July 2021. The new LF FX-Septum will be installed in MR in early of 2022."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thoysp2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thoysp2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thoysp2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THOYSP2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THOYSP3",
      "title": "Progress on the Nb₃Sn Superconducting Undulator Development at the Advanced Photon Source",
      "authors": [
        "I. Kesgin",
        "E. Gluskin",
        "Q.B. Hasse",
        "Y. Ivanyushenkov",
        "M. Kasa",
        "S.W.T. MacDonald",
        "Y. Shiroyanagi",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "D. Arbelaez",
        "S. Prestemon",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "E.Z. Barzi",
        "D. Turrioni",
        "A.V. Zlobin",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Nb3Sn-based superconducting undulator (SCU) is a strong candidate to outperform its well-establish counterparts",
        "such as the NbTi-based SCU and cryogenically cooled permanent magnet undulators",
        "over a wide range of undulator period lengths: 10 mm or larger. Thus",
        "the Advanced Photon Source (APS) at Argonne National Laboratory has initiated a project",
        "in collaboration with Fermilab and Berkeley Lab",
        "aiming to establish a robust technology for the fabrication of a Nb3Sn SCU and validate its operational and radiation performance on the APS storage ring. To accomplish this",
        "first",
        "modeling-driven optimizations were employed to address the magnetic and mechanical design of the undulator magnets",
        "and a series of 4.5-period prototypes subsequently confirmed the design specifications. Then",
        "these short prototypes were successfully scaled to 0.5-m-long magnets",
        "confirming the maximum design field of 1.2 T that is at least 20% higher than a NbTi version with the same gap and period length (9.5 mm and 18 mm",
        "respectively). Fabrication of the final 1.1-m-long magnets is currently underway. Further details will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thoysp3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thoysp3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thoysp3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THOYSP3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 18:42:40"
}