{
  "session_info": {
    "id": "TUYAUD",
    "name": "TUYAUD - Beam Physics and Technology I",
    "url": "https://proceedings.jacow.org/cool2015/html/tuyaud.htm"
  },
  "papers": [
    {
      "paper_id": "TUYAUD01",
      "title": "Overview of Development of High Current Electron Sources for ERL Based Bunched Beam Electron Cooling",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "New initiatives at Jefferson Lab require photoguns operating at 350 kV bias voltage. These initiatives include the construction of a test beamline to study high bunch-charge magnetized beams needed for cooling proton beams at electron-ion colliders. Worldwide",
        "a number of groups have made great progress developing photoguns operating at 350 kV and higher. This contribution describes Jefferson Lab's efforts to build such a gun",
        "but with an inverted-insulator geometry. The inverted-insulator geometry offers advantages over gun designs that employ large cylindrical insulators",
        "but it introduces at least one new challenge",
        "namely",
        "how to reliably apply voltage to the cathode electrode via a high voltage cable without breakdown",
        "which sometimes leads to puncture and catastrophic failure of the insulator. In addition",
        "this contribution describes recent studies devoted to improving our understanding of field emission",
        "and methods to eliminate it. The talk will conclude with a brief discussion of perceived advantages/disadvantages of different high current electron gun options",
        "which could serve as starting-point road map aimed at identifying necessary future R&D."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/tuyaud01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/tuyaud01.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/tuyaud01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-TUYAUD01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUYAUD02",
      "title": "High Current ERL Technology",
      "authors": [
        "D. Kayran",
        "I. Ben-Zvi",
        "A.V. Fedotov",
        "J. Kewisch",
        "V. Litvinenko",
        "V. Ptitsyn",
        "B. Sheehy",
        "E. Wang",
        "W. Xu",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "I. Ben-Zvi",
        "D. Kayran",
        "V. Litvinenko",
        "V. Ptitsyn",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "High current ERL is essential for high energy electron coolers: magnetized",
        "non-magnetized",
        "coherent and other. SRF Linac with well dumped HOMs and high current low energy electron injector are required. At BNL the R&D high-current ERL is under commissioning. The key components of this ERL are: the highly damped 5-cell superconducting RF cavity and the high-current superconducting RF gun. The gun is equipped with multi-alkaline photocathode insertion system. Gun and Linac operating RF frequency is 703.59 MHz. Current laser operates at 10 MHz. The R&D ERL is designed to generate 350 mA of average current. The unique design of merger system allows operating at low injection energy while preserves emittance. The flexible returning loop optics allowed to study different aspects of stability operation. Recently 500 pC per bunch charge and 5mA current in short pulses has been demonstrated. Some aspects of BNL R&D ERL design and beam tests results will be discussed. After ERL commissioning in BLDG 912 the ERL will be relocated to RHIC IP2 to be used for LEReC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/tuyaud02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/tuyaud02.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/tuyaud02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-TUYAUD02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUYAUD03",
      "title": "Formation of Bunched Electron Beam at the Electron Cooler of CSRm",
      "authors": [
        "X.D. Yang",
        "J. Li",
        "X.M. Ma",
        "L.J. Mao",
        "M.T. Tang",
        "T.L. Yan",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "The motivation for formation of bunched electron beam at the electron cooler of CSRm is based on the three requirements. Firstly",
        "the high energy electron cooling",
        "especially",
        "the ion beam with TeV energy",
        "the bunched electron beam for cooling would be easier than the DC operating mode. Secondly",
        "the electric field induced by the intensity modulated electron beam will be used for the suppression of instability developed in the high intensity ion beam after accumulation with the help of electron cooling",
        "Thirdly",
        "the electron beam was required to turn on and off in the different period of the atomic physics experiments. Some initial design and consideration were presented in this paper. And also the current situation and condition of CSRm electron cooler were described here. An off-line testbench will be established in the laboratory",
        "and the test and the optimization will be explored in this experimentation. The validity of this system will be verified in the near future. The procedure of the modulation on the voltage of control electrode in the electron gun of the CSRm cooler was discussed. The scheme of off-line measurement was devised according to the progress."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/tuyaud03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/tuyaud03.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/tuyaud03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-TUYAUD03",
      "page_number": "85",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYAUD04",
      "title": "Development of an Ultra Fast RF Kicker for an ERL-based Electron Cooler",
      "authors": [
        "A.V. Sy",
        "A.J. Kimber",
        "J. Musson",
        "JLab",
        "Newport News",
        "Virginia",
        "USA"
      ],
      "institutions": [
        "The staged approach to electron cooling proposed for Jefferson Lab's Medium Energy Electron-Ion Collider (MEIC) utilizes bunched beam electron cooling with a single-pass energy recovery linac (ERL) for cooling in the ion collider ring. Possible luminosity upgrades make use of an ERL and full circulator ring and will require ultra-fast kickers that are beyond current technology. A novel approach to generating the necessary ultra fast (ns-level) RF kicking pulse involves the summation of specific subharmonics of the cooling electron bunch frequency; the resultant kicking pulse is then naturally constrained to have rise and fall times equal to the electron bunch frequency. The uniformity of such a pulse and its effects on the beam dynamics of the cooling electron bunch are discussed."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/tuyaud04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/tuyaud04.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/tuyaud04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-TUYAUD04",
      "page_number": "89",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:20:42"
}