{
  "session_info": {
    "id": "WEPRI",
    "name": "WEPRI - Poster Session, Ribery Area",
    "url": "https://proceedings.jacow.org/IPAC2014/html/wepri.htm"
  },
  "papers": [
    {
      "paper_id": "WEPRI001",
      "title": "Clean Room Integration of the European XFEL Cavity Strings",
      "authors": [
        "S. Berry",
        "O. Napoly",
        "B. Visentin",
        "CEA/DSM/IRFU",
        "France",
        "F. Chastel",
        "A. Clippet",
        "M. Mbeleg",
        "P. Pluvy",
        "ALSYOM",
        "Argebteuil",
        "France",
        "C. Cloué",
        "C. Madec",
        "T. Trublet",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "The 101 cryomodules of the XFEL cold linac will be integrated at Saclay under the CEA responsability by the industrial operator ALSYOM",
        "at the production rate of cryomodule per week. Each cryomodule includes a string of 8 Niobium superconducting cavities and a BPM-quadripole unit (downstream end). To avoid particle contamination of the RF cavities",
        "the strings are assembled in an ISO4 cleanroom by following strict cleaning and high-vacuum procedures. The major technical challenge of the string integration thus lies in the capacity to realize 25 connections in two weeks while protecting the cavity and coupler RF surfaces and to check their leak-tightness up to 10-10 hPA.l/s. The partial demonstration was made by the CEA team with the first pre-series module XM-3 which achieves a total accelerating voltage of 232 MV preserving the individual performances of cavities. In this paper the status and challenges of the production line is presented",
        "including the quality management",
        "equipment and operator training aspects. The optimisation process toward a faster assembly while preserving or actually decreasing the cavity exposure to contamination sources is also described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri001.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI002",
      "title": "Status and First Results of Two High Beta Prototype Elliptical Cavities for ESS",
      "authors": [
        "F. Peauger",
        "P. Bosland",
        "P. Carbonnier",
        "G. Devanz",
        "F. Éozénou",
        "X. Hanus",
        "P. Hardy",
        "V.M. Hennion",
        "J. Plouin",
        "D. Roudier",
        "C. Servouin",
        "CEA/DSM/IRFU",
        "France",
        "C. Darve",
        "S. Molloy",
        "ESS",
        "Lund",
        "Sweden",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "IPN",
        "Orsay",
        "France"
      ],
      "institutions": [],
      "abstract": "Two prototypes of elliptical superconducting cavities have been designed and manufactured in the frame of the French-Swedish agreement for ESS. These 5-cell cavities have a beta value of 0.86 and their frequency is 704.42 MHz. The nominal accelerating gradient on the ESS accelerator is 19.9 MV/m at 2K. We present the manufacturing status of the cavities by two different vendors as well as the specific means which have been developed for the cavity treatments performed at CEA after delivery. We emphasis the activities performed on the first bare cavities recently received at CEA such as the RF measurement and tuning operations, the cleaning and chemical treatments and the clean room assembly including high pressure rinsing. Finally, first test results at 2K in vertical cryostat are reported. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri002.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI004",
      "title": "Operational Experience and Upgrades of the SOLEIL Storage Ring RF System",
      "authors": [
        "P. Marchand",
        "J.P. Baete",
        "R.C. Cuoq",
        "H.D. Dias",
        "M. Diop",
        "J.L. Labelle",
        "R. Lopes",
        "M. Louvet",
        "C.M. Monnot",
        "L.S. Nadolskipresenter",
        "S. Petit",
        "F. Ribeiro",
        "T. Ruan",
        "R. Sreedharan",
        "K. Tavakoli",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "In the SOLEIL storage ring",
        "two cryomodules provide to the electron beam an accelerating voltage of 3-4 MV and a power of 575 kW at 352 MHz. Each cryomodule contains a pair of superconducting cavities",
        "cooled with liquid Helium at 4.5 K",
        "which is supplied by a single 350 W cryogenic plant. The RF power is provided by four solid state amplifiers",
        "each delivering up to 180 kW. The parasitic impedances of the high order modes (HOM) are strongly mitigated by means of four coaxial couplers",
        "located on the central pipe connecting the two cavities. Eight years of operational experience with this system",
        "as well as its upgrades",
        "are reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri004.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI005",
      "title": "Processing and Testing of the SRF Photoinjector Cavity for BERLinPro",
      "authors": [
        "A. Burrill",
        "W. Anders",
        "A. Frahm",
        "J. Knobloch",
        "A. Neumann",
        "HZB",
        "Berlin",
        "Germany",
        "G. Ciovati",
        "W.A. Clemens",
        "P. Kneisel",
        "L. Turlington",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "FZJ",
        "Jülich",
        "Germany",
        "The BERLinPro project is a compact",
        "c.w. SRF energy recovery linac (ERL) that is being built to develop the accelerator physics and technology required to operate the next generation of high current ERLs. The machine is designed to produce a 50 MeV 100 mA beam",
        "with better than 1 mm-mrad emittance. The electron source for the ERL will be a SRF photoinjector equipped with a multi-alkali photocathode. In order to produce a SRF photoinjector to operate reliably at this beam current HZB has undertaken a 3 stage photoinjector development program to study the operation of SRF photoinjectors in detail. The 1.4 cell cavity being reported on here is the second stage of this development",
        "and represents the first cavity designed by HZB for use with a high quantum efficiency multi-alkali photocathode. This paper will describe the work done to prepare the cavity for RF testing in the vertical testing dewar at Jefferson Laboratory as well as the results of these RF tests."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri005.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI006",
      "title": "High Power RF Input Couplers and Test Stand for the BERLinPro Project",
      "authors": [
        "V.F. Khan",
        "W. Anders",
        "A. Burrill",
        "J. Knobloch",
        "A. Neumann",
        "HZB",
        "Berlin",
        "Germany",
        "The BERLinPro project",
        "under construction at HZB",
        "is a 100 mA",
        "50 MeV superconducting RF (SRF) energy recovery linac (ERL) being built to study the accelerator physics of operating a high current SRF ERL. For this high current operation",
        "coaxial RF power couplers capable of handling 130 kW of power",
        "c.w. at 1.3 GHz are required for both the SRF gun and booster cavities. In order to achieve this power level a coupler has been designed based on the high power coupler currently in use at the KEK-cERL. A key improvement that was made to the coupler was the modification of the coupler tip",
        "termed a golf-tee. This modification is incorporated so as to achieve the desired coupling",
        "Qext ~105",
        "with minimal coupler penetration into the beampipe. Herein",
        "we discuss the RF design and properties of the high-power coaxial coupler for the gun as well as booster cavity of BERLinPro",
        "along with the design of the test stand for conditioning a pair of couplers."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri006.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI007",
      "title": "Booster Cavity and Fundamental Power Coupler Design Issues for BERLinPro",
      "authors": [
        "A. Neumann",
        "M. Abo-Bakr",
        "W. Anders",
        "A. Burrill",
        "V.F. Khan",
        "J. Knobloch",
        "S. Wesch",
        "HZB",
        "Berlin",
        "Germany",
        "HZB has started building the 50MeV",
        "100mA demonstrator energy-recovery-linac (ERL) facility BERLinPro. The high power injector system needs to deliver this beam at 6.5MeV by combining the energy gain of a 1.4 cell SRF photo-injector and three Cornell style 2-cell booster cavities. One booster cavity will be operated at zero-crossing for bunch energy chirping. Thus two booster cavities have to deliver 2MV each requiring a strong coupling with a loaded Q of 105. To house the two envisaged KEK fundamental power couplers (FPC) with the cavity",
        "the geometry was slightly modified. Further",
        "to increase coupling and reduce transverse kick effects to the beam",
        "a ”golf-tee” antenna tip was designed. This paper summarizes the SRF challenges for the booster cavities",
        "the operational conditions and the modification to the KEK couplers",
        "including tracking calculations to estimate the coupler kick effect to higher order."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri007.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI008",
      "title": "First Cavity Design Studies for the BESSY-VSR Upgrade Proposal",
      "authors": [
        "A. Neumann",
        "A. Burrill",
        "P. Goslawski",
        "A. Jankowiak",
        "J. Knobloch",
        "M. Ries",
        "M. Ruprecht",
        "A.V. Vélez",
        "G. Wüstefeld",
        "HZB",
        "Berlin",
        "Germany",
        "Recently HZB proposed an upgrade of the 3rd generation synchrotron light source BESSY II allowing simultanous long and short pulse operation*. For this scheme to work superconducting higher harmonic cavities of the fundamental 500 MHz at two frequencies need to be installed in the BESSY II storage ring. Given an appropiate choice of the higher harmonics the resulting gradient leads to a beating effect of the effective longitudinal focussing voltage at the stable fix points resulting in different bunch lengths in subsequent buckets. This project places stringent requirements on the cavity performance",
        "as high accelerating fields",
        "excellent HOM damping capabilities and high reliability as they will operate in a 300 mA 24/7 user facility. In this paper we describe the requirements for the cavity design and first designs steps.",
        "* G. Wüstefeldt et al.",
        "Simultaneous Long and Short Electron Bunches in the BESSY II Storage Ring",
        "Proc. of IPAC'11",
        "San Sebástian",
        "Spain"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri008.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI009",
      "title": "Parameter Studies and Geometry Optimization on Superconducting Multicell RF Cavity Resonators",
      "authors": [
        "B.D. Isbarn",
        "B. Riemann",
        "M. Sommer",
        "T. Weis",
        "DELTA",
        "Dortmund",
        "Germany",
        "Modern accelerator concepts for high intensity electron beams often require superconducting multicell RF-cavity-resonators in circular accelerators (e.g. storage rings). Caused by strong beam-cavity interaction and due to high quality factors of superconducting RF-structures special care of lower order (LOM) and higher order (HOM) modes must be taken. Various numerical studies were performed to numerically calculate the dependence of different figures of merit (e.g. external quality factors Qext) with respect to the geometry parameters and cell number of the RF-structure",
        "focused on the propagation and damping of low and higher order modes. To ease the numerical effort an optimization routine has been developed which automatically optimizes the geometry based on goal functions. In this context it turned out that cell geometries defined by spline functions have advantages compared to the standard elliptical parametrization regularly used. The number of free parameters is substantially reduced which facilitates the search for optimum solutions."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri009.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI011",
      "title": "Progress of R&D on SRF Cavities at DESY towards the ILC Performance Goal",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "A. Prudnikava",
        "Y. Tamashevich",
        "Uni HH",
        "Hamburg",
        "Germany",
        "The R&D program of the ILC-HiGrade group at DESY aims at a solid understanding and control of the industrial mass-production process of the superconducting radio-frequency accelerating cavities that are being manufactured for the European X-ray Free Electron Laser (EXFEL). This accelerator is currently under construction at DESY. As well as the main production cavities for XFEL",
        "24 additional cavities are being constructed as part of the ILC-HiGrade program. The goal is to identify the gradient-limiting factors and further refine the cavity-treatment technique to understand how to achieve gradients above 35 MV/m at >90% production yield in an industrial context. Techniques such as 2nd sound and temperature mapping for the quench detection",
        "OBACHT optical inspections",
        "as well as Centrifugal Barrel Polishing (CBP) and Local Grinding repair are foreseen as tools. Actual status",
        "details",
        "and achievements will be reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri011.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI012",
      "title": "Euclid Modified SRF Conical Half-wave Resonator Design",
      "authors": [
        "FZJ",
        "Jülich",
        "Germany",
        "T.L. Grimm",
        "A. Rogacki",
        "Niowave",
        "Inc.",
        "Lansing",
        "Michigan",
        "USA",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The new low-beta conical Half-Wave Resonator (cHWR) is suggested for CW proton accelerators of new generation with relatively low beam loading",
        "where frequency detune caused by microphonics and helium pressure fluctuations is essential. This particular design",
        "considered in the paper",
        "has operation frequency of 162.5 MHz",
        "b=v/c=0.11",
        "and is suitable for the first section of the PIP-II superconducting accelerator which is under development at Fermilab. The main idea of the cHWR design is to provide a self-compensation cavity design together with its helium vessel to minimize the resonant frequency dependence on external loads. A unique cavity side-tuning option is also under development. Niowave",
        "Inc. proposed a series of cavity and helium vessel modifications to simplify their manufacturing. The whole set of numerical simulations has been generated to verify that the main parameters of the initial structure design were not affected by the proposed modifications. Here we present the main results of the cavity and helium vessel modified design."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri012.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI013",
      "title": "Investigation of Cryomodules for the Mainz Energy-recovering Superconducting Accelerator MESA",
      "authors": [
        "F. Schlander",
        "K. Aulenbacher",
        "R.G. Heine",
        "D. Simon",
        "IKP",
        "Mainz",
        "Germany",
        "HZDR",
        "Dresden",
        "Germany",
        "For the multiturn accelerator MESA it is planned to employ superconducting technology for the main linac",
        "which is supposed to provide an energy gain of 50 MeV per turn. As continuous wave operation is mandatory for the experiments",
        "it is important to minimise the cryogenic losses",
        "hence to find cavities and the corresponding cryomodule meeting the framework conditions for the accelerator. The findings and the current statuts will be reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI016",
      "title": "Status of the Vertical Testing of the XFEL Third Harmonic Cavity Series",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri016.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI018",
      "title": "Status of the Fabrication of the XFEL 3.9 GHz Cavity Series",
      "authors": [
        "C. Maiano",
        "M. Bertucci",
        "A. Bosotti",
        "J.F. Chen",
        "P. Michelato",
        "L. Monaco",
        "M. Moretti",
        "C. Pagani",
        "R. Paparella",
        "P. Pierini",
        "D. Sertore",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "The third harmonic system at 3.9 GHz of the European XFEL (E-XFEL) injector section will linearize the bunch RF curvature",
        "induced by first accelerating module",
        "before the first compression stage and it is a joint INFN and DESY contribution to the project. This paper presents the status of the fabrication of the 3.9 GHz cavity series in view of the XFEL injector commissioning in 2015."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri018.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI020",
      "title": "Mechanical Analysis of the XFEL 3.9 GHz Cavities in support of PED Qualification",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri020.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI022",
      "title": "In-house Production of a Large-Grain Single-Cell Cavity at Cavity Fabrication Facility and Results of Performance Tests",
      "authors": [
        "T. Kubo",
        "Y. Ajima",
        "H. Inoue",
        "K. Umemori",
        "Y. Watanabe",
        "M. Yamanaka",
        "KEK",
        "Ibaraki",
        "Japan",
        "We studied electron beam welding (EBW) conditions for large grain Nb",
        "and fabricated a single cell cavity in Cavity Fabrication Facility (CFF)",
        "KEK. Vertical-test results of the cavity made from large grain Nb are also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri022.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI023",
      "title": "Review of the Multilayer Coating Model",
      "authors": [
        "T. Kubo",
        "T. Saeki",
        "KEK",
        "Ibaraki",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "Structures of alternating layers of superconducting (Sc) and insulating films formed on a bulk Sc proposed by A. Gurevich in 2006 are actively discussed these years",
        "because of their great possibility in reducing power consumptions and in enhancing RF breakdown field of the Sc RF cavity. On Apr. 2013",
        "we submitted general formulae for the vortex penetration field of the Sc layer and the shielded magnetic field on the bulk Sc for a structure with a single Sc layer and a single insulator layer formed on a bulk Sc",
        "by which a combination of the thicknesses of Sc and insulator layers that can realize the enhanced RF breakdown field can be found for any given materials. In this contribution",
        "we will show progresses during the last year. Comparisons between the formulae and experimental results",
        "and extended formulae for more realistic models",
        "such as a model with surface defects",
        "will be shown.",
        "T. Kubo",
        "Y. Iwashita",
        "and T. Saeki",
        "Appl. Phys. Lett. 104",
        "032603 (2014); arXiv:1304.6876 [physics.acc-ph]; arXiv:1306.4823 [physics.acc-ph]; arXiv:1307.0583 [physics.acc-ph]."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI024",
      "title": "Two-Dimensional Models of the Magnetic-Field Enhancement at Pit and Bumps",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "* Proceedings of SRF2013",
        "Paris",
        "France (2013)",
        "p. 430"
      ],
      "institutions": [],
      "abstract": "Analytical models of the magnetic field enhancement at pits were presented at SRF2013 last year*. Other simple models will be addressed in this paper. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri024.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI025",
      "title": "Studies of Fabrication Procedure of 9-cell SRF Cavity for ILC Mass-production at KEK.",
      "authors": [
        "T. Saeki",
        "Y. Ajima",
        "K. Enami",
        "H. Hayano",
        "H. Inoue",
        "E. Kako",
        "S. Kato",
        "S. Koike",
        "T. Kubopresenter",
        "S. Noguchi",
        "M. Satoh",
        "M. Sawabe",
        "T. Shishido",
        "A. Terashima",
        "N. Toge",
        "K. Ueno",
        "K. Umemori",
        "K. Watanabe",
        "Y. Watanabe",
        "S. Yamaguchi",
        "A. Yamamoto",
        "Y. Yamamoto",
        "M. Yamanaka",
        "K. Yokoya",
        "KEK",
        "Ibaraki",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "N. Kawabata",
        "H. Nakamura",
        "K. Nohara",
        "M. Shinohara",
        "SPS",
        "Funabashi-shi",
        "Japan",
        "The University of Tokyo",
        "Institute of Physics",
        "Tokyo",
        "Japan",
        "We had been constructing a new facility for the fabrication of superconducting RF cavity at KEK from 2009 to 2011. In the facility",
        "we have installed a deep-drawing machine",
        "a half-cup trimming machine",
        "an electron-beam welding machine",
        "and a chemical etching room in one place. We started the studies on the fabrication of 9-cell cavity for International Linear Collier (ILC) using this facility. The studies are focusing on the cost reduction with keeping high performance of cavity",
        "and the goal is the establishment of mass-production procedure for ILC. We already finished the fabrication of two 9-cell cavities in this facility. This article reports the current status of the studies."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri025.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI026",
      "title": "Mechanical Vibration Search of Compact ERL Main Linac Superconducting Cavities in Cryomodule",
      "authors": [
        "M. Satoh",
        "K. Enami",
        "T. Furuya",
        "S. Michizono",
        "T. Miurapresenter",
        "F. Qiu",
        "H. Sakai",
        "K. Shinoe",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "JAEA",
        "Ibaraki-ken",
        "Japan",
        "In 2014",
        "we will start the beam operation in Compact ERL(cERL) by using main linac cryomodule",
        "which contained the two 9-cell cavities. In principle",
        "thanks to the mechanism of energy recovery",
        "the input power of main linac of cERL is very small even if the beam current will be higher than 100mA. Therefore",
        "the coupling is very weak. However",
        "this coupling is perfectly not matched to the unloaded Q-value of the superconducting cavity like 1x1010. The minimum input power will be restricted by the cavity detuning due to the microphonics from the cryomodule itself. We designed the lower loaded Q-valued of (1-4)x107 to reduce the effect of the michrophonics from the expected outer disturbance At present",
        "we successfully suppressed the michrophonics to meet our requirement. However we found the enhancement of the detuning angle when we did not optimize the feedback loop of LLRF. This enhancement will be expected coming from the mechanical resonance frequencies of cavity and/or cryomodule. In this paper",
        "we reported the correlation between the measured microphincs spectrum with LLRF in a beam operation and the results of the measured resonance frequencies spectrum at the test bench."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri026.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI027",
      "title": "Performance Evaluation of ERL Main Linac Tuner",
      "authors": [
        "K. Enami",
        "D.A. Arakawa",
        "T. Furuya",
        "S. Michizono",
        "T. Miurapresenter",
        "F. Qiu",
        "H. Sakai",
        "M. Satoh",
        "K. Shinoe",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "JAEA",
        "Ibaraki-ken",
        "Japan",
        "cERL project is now progressing. We are carrying on R&D for cERLmain linac consisted of 1.3GHz superconductive cavity. We evaluate slide jack tuner",
        "which is component part of cryomodule. A slide jack tuner has 2 mechanism to tune frequency. One is slide jack mechanism that tunes roughly and the other is piezo mechanism that tunes finely. We carried out basic experiment and cold experiment. We finally confirmed that slide jack tuning system can tuning to target frequency 1.3GHz."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri027.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI028",
      "title": "Operation Status of Compact ERL Main Linac Cryomodule",
      "authors": [
        "K. Umemori",
        "K. Enami",
        "T. Furuya",
        "S. Michizono",
        "T. Miurapresenter",
        "F. Qiu",
        "H. Sakai",
        "M. Satoh",
        "K. Shinoe",
        "KEK",
        "Ibaraki",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "JAEA",
        "Ibaraki-ken",
        "Japan",
        "We have developed a main linac cryomodule",
        "in which two nine-cell HOM damped SRF cavities were mounted",
        "for the Compact ERL (cERL) project in Japan. The main linac cryomodule is operated by a 2K refrigerator system",
        "whose cooling ability is 80W. RF power is fed to each cavity from an IOT or a solid state amplifier. Amplitude and phase of RF stabilization is done by using a digital LLRF system. Cavity resonant frequency is controlled by using mechanical and piezo tuners. Before beam operation",
        "performance test of the cryomodule has been carried out. Generally the cryomodule works well",
        "but heavy field emission is rather problem. After construction of cERL circulation ring",
        "we have a plan to do first beam operation with energy recovery mode",
        "in this winter. Electron beam are accelerated up to 20 MeV. Heavy heat load to 2K Helium",
        "caused by field emission",
        "restrict cavity operation voltage. We report about a series of performance tests and a first experiment from beam operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri028.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI029",
      "title": "Simulations and Measurements of Beam Pipe Modes excited in 9-cell Superconducting Cavities",
      "authors": [
        "Sokendai",
        "Ibaraki",
        "Japan",
        "DESY",
        "Hamburg",
        "Germany",
        "KEK",
        "Ibaraki",
        "Japan",
        "Higher order modes (HOM) excited in 9-cell superconducting cavities have been studied to detect cavity alignment. Dipole modes have been monitored",
        "since their magnitude is proportional to beam offsets from their electrical centers. Detection of cavity alignment is important for the ILC to confirm alignment accuracy and furthermore possible source of emittance growth. We are particularly interested in beam pipe modes because they are localized in both ends of the cavity. We measured beam-induced HOM in the STF accelerator at KEK in 2012 – 2013. From the results of the measurement",
        "we found some modes whose behaviors are like dipole mode at around 2.1 GHz instead of 2.28 GHz as calculated by R. Wanzenberg for an ideal cavity [TESLA 2001-33",
        "September 2001]. We also measured beam induced HOM in the TESLA superconducting cavities in FLASH at DESY. In order to identify beam pipe modes and to compare the measurement with the calculation",
        "we calculate beam pipe modes of 9-cell superconducting cavity by CST MICROWAVE STUDIO 2012 and HFSS 12. We will discuss about these calculations and the measurement."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri029.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI030",
      "title": "Multipactor Simulation on Superconducting Spoke Cavity for Laser Compton Scattered Photon Sources",
      "authors": [
        "Y. Iwashita",
        "H. Fujisawa",
        "H. Tongu",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "R. Hajima",
        "R. Nagai",
        "M. Sawamura",
        "JAEA",
        "Ibaraki-ken",
        "Japan",
        "KEK",
        "Ibaraki",
        "Japan",
        "Superconducting spoke cavity for laser Compton scattered (LCS) photon sources is under development. The operating frequency is 325-MHz to accelerate electron beam for the LCS sources",
        "where the size of the spoke cavity is less than a elliptical cavities with the same frequency. Because of the complicated shape of the cavity",
        "it may be suffered from a strong multipactor effect. The recent results on the multipactor analysis will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri030.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI032",
      "title": "First Cryomodule Test at AMTF Hall for The European X-ray Free Electron Laser (XFEL)",
      "authors": [
        "K. Kasprzak",
        "B. Dzieza",
        "W. Gaj",
        "D. Karolczyk",
        "L.M. Kolwicz-Chodak",
        "A. Kotarba",
        "A. Krawczyk",
        "K. Krzysik",
        "W. Maciocha",
        "A. Marendziak",
        "K. Myalski",
        "S. Myalski",
        "T. Ostrowicz",
        "B. Prochal",
        "M. Sienkiewicz",
        "M. Skiba",
        "J. Świerbleski",
        "M. Wiencek",
        "J. Zbroja",
        "P. Ziolkowski",
        "A. Zwozniak",
        "IFJ-PAN",
        "Kraków",
        "Poland",
        "The Accelerator Module Test Facility (AMTF) at DESY in Hamburg is dedicated to the tests of RF cavities and accelerating cryomodules for the European X-ray Free Electron Laser (XFEL). The AMTF hall is equipped with two vertical cryostats",
        "which are used for RF cavities testing and three test benches that will be used for tests of the accelerating cryomodules. Recently",
        "the first cryomodule teststand ("
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri032.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI034",
      "title": "Analysis of BCP Characteristics for SRF Cavities",
      "authors": [
        "Y. Jung",
        "H.J. Kimpresenter",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "H.H. Lee",
        "H.C. Yang",
        "KRICT",
        "Daejoen",
        "Republic of Korea",
        "A chemical polishing process is well-known critical process for improving superconducting cavities such as a quality factor and an acceleration electric filed with additional temperature treatment. Especially",
        "Buffered Chemical Polishing (BCP) has been widely used in SRF (Superconducting Radio Frequency) cavity processing. We performed BCP experiments with 1:1:1 and 1:1:2 of an etchant ratio (HF:HNO3:H3PO4). In fact",
        "BCP experiments were carried out by using both undeformed (as-receoved) and deformed niobium samples. We will report baseline BCP results by analyzing surface states of niobium samples such as optical photographs",
        "etch rates and AFM (Atomic Force Microscopy) depending on temperature and time."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri034.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI035",
      "title": "Stiffening Structure of the HWR at RISP",
      "authors": [
        "G.-T. Park",
        "H.J. Cha",
        "H. Kim",
        "H.J. Kimpresenter",
        "W.K. Kim",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "The HWR being developed in RISP",
        "Korea is in its final stage of the design. We consider the effects of the stiffeners in the presence of the helium vessel on the various detunings such as cool down",
        "helium pressure fluctuation",
        "Lorentz pressure. The interaction of the stiffened cavity with the helium jacket is studied via the coupled simulation by ANSYS and the optimal specification of the stiffeners are determined. In addition",
        "the expected frequency shift is predicted to establish the target frequency bfor the manufacturing. The effect of the vibrational motion is also studied."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri035.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI036",
      "title": "Fabrication Design of QWR and HWR Cryomodules",
      "authors": [
        "W.K. Kim",
        "H. Kim",
        "H.J. Kimpresenter",
        "Y. Kim",
        "M. Lee",
        "G.-T. Park",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "The superconducting linac of RAON consists of five types of cryomodules. The cryomodules host QWR",
        "HWR1",
        "HWR2",
        "SSR1",
        "and SSR2 superconducting cavities. The cryomodules will be operated at 2K in order to test the performance of the superconducting cavities. The design of the cryomodule components is based on thermal shield to prevent incoming heat",
        "two-phase pipe to supply superfluid helium",
        "vacuum vessel for the formation of the internal vacuum",
        "supporter parts for alignment and keeping structure",
        "and magnetic shield to prevent external magnetic field. The detailed fabrication design of the cryomodules will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri036.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI037",
      "title": "Comparison of High Order Modes Damping Techniques for 800 MHz Single Cell Superconducting Cavities",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri037.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI039",
      "title": "LIPAc SRF Linac Couplers Conditioning",
      "authors": [
        "D. Regidor",
        "I. Kirpitchev",
        "J. Mollá",
        "P. Méndez",
        "M. Weber",
        "C. de la Morena",
        "CIEMAT",
        "Madrid",
        "Spain",
        "S. Chel",
        "M. Desmons",
        "G. Devanz",
        "H. Jenhani",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "CEA",
        "Pontfaverger-Moronvilliers",
        "France",
        "The LIPAc SRF Linac is a cryomodule with eight superconducting HWR cavities at 175 MHz powered by RF couplers capable of transmitting up to 200 kW in CW. To prepare the couplers for operation",
        "cleaning and high power RF processing are needed. When performed",
        "the couplers will be ready for integration in the cryomodule. The Couplers Test Bench has been designed to perform the RF conditioning by pairs",
        "providing good matching",
        "low losses and the required UHV level. To preserve the cleanliness of the internal surfaces",
        "after the test bench manufacturing",
        "an ISO5 clean room has been used for the vacuum parts assembly. The size and number of particles was carefully controlled during the assembly process. The RF conditioning was performed at the IFMIF-EVEDA RF Integration Facility using the Prototype RF Module in travelling wave and standing wave modes. The process started with short pulses at low power and finished when full power CW was reached. Vacuum",
        "multipacting",
        "arcs and matching were continuously monitored to control the process avoiding damages. An overview of the process applied to the prototypes and the RF conditioning results are presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri039.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI040",
      "title": "On the Optimal Design of Elliptical Superconducting Cavities",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri040.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI041",
      "title": "Progress of HOM Couplers for CERN SPL Cavities",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri041.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI042",
      "title": "Nb Coated HIE-ISOLDE QWR Superconducting Accelerating Cavities: From Process Development to Series Production",
      "authors": [
        "A. Sublet",
        "I. Aviles Santillana",
        "B. Bártová",
        "S. Calatroni",
        "N.M. Jecklin",
        "I. Mondino",
        "M. Therasse",
        "W. Venturini Delsolaro",
        "P. Zhang",
        "CERN",
        "Geneva",
        "Switzerland",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "The new HIE-ISOLDE accelerator at CERN requires the production of 32 superconducting cavities (20 high-beta and 12 low-beta) in order to increase the energy of the rare isotope beam delivered to the experiments. The Quarter Wave Resonators (QWRs) cavities (0.3m diameter and 0.8m height) are made of OFE 3D-forged copper and are coated by DC-bias diode sputtering with a thin superconducting layer of niobium. Following a preliminary process development phase",
        "the series production of the high-beta cavities has started. An overview of the development phase is presented",
        "describing the key parameters varied to match the HIE-ISOLDE specifications (operation at 4.5 K with an accelerating field of 6 MV/m at 10W RF losses and Q0=4.5x108) and the resulting niobium film characteristics. The first series of cavities",
        "produced using the baseline coating recipe",
        "and their RF performance is reviewed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri042.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI043",
      "title": "Implementation of Carbon Thin Film Coatings in the Super Proton Synchrotron (SPS) for Electron Cloud Mitigation",
      "authors": [
        "P. Costa Pinto",
        "T.C. Basso",
        "A. Bellunato",
        "P. Edwards",
        "M. Mensi",
        "A. Subletpresenter",
        "M. Taborelli",
        "CERN",
        "Geneva",
        "Switzerland",
        "Low Secondary Electron Yield (SEY) carbon thin films get rid of electron multipacting in accelerator beam pipes. Two magnetic cells of the SPS were coated with such material and installed. In total more than forty vacuum vessels and magnet interconnections were treated. The feasibility of the coating process was validated. The performance of the carbon thin film will be tested with LHC nominal beams after the end of the long shutdown 1. Particular attention will be drawn to the long term behaviour. This paper presents the sputtering techniques used to coat the different components; their characterization (SEY measurements on coupons",
        "RF multipacting tests and pump down curves); and the technology to etch the carbon film in case of a faulty coating. The strategy to coat the entire SPS will also be exposed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri043.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI044",
      "title": "Final Structure and Design Parameters of TARLA RF System",
      "authors": [
        "Ö. Karslı",
        "A.A. Aksoy",
        "C. Kayapresenter",
        "İ.B. Koc",
        "E.Ç. Polat",
        "Ö. Yavaş",
        "Ankara University",
        "Accelerator Technologies Institute",
        "Golbasi / Ankara",
        "Turkey",
        "Dogus University",
        "Istanbul",
        "Turkey",
        "Istanbul University",
        "Istanbul",
        "Turkey",
        "Turkish Accelerator and Radiation Laboratory in Ankara (TARLA) is an oscillator mode IR-FEL facility which is under construction since 2011. ELBE licensed superconducting modules housing TESLA RF cavities have been manufacturing for one year and the first module will be delivered in 2015. He Cryogenic System has also started to be manufacturing at similar time with the accelerator structures. It will be delivered in 2014. High Power RF amplifiers are started to tender procedures and delivery time is planning as 2015. The installation of high power transmission lines have to be completed at the same time with the delivery date of HPRF amplifiers to test the cavities and amplifiers. In this study",
        "the final structural design of high power RF transmission lines and design parameters of RF amplifiers for TARLA is discussed.",
        "On behalf of TARLA Collaboration",
        "www.tarla.org.tr"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri044.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI045",
      "title": "Key Design Features of Crab-Cavity Cryomodule for HiLumi LHC",
      "authors": [
        "S.M. Pattalwar",
        "A.J. May",
        "P.A. McIntosh",
        "A.E. Wheelhousepresenter",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "G. Burt",
        "B.D.S. Hall",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "CERN",
        "Geneva",
        "Switzerland",
        "T.J. Jones",
        "N. Templeton",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "A prototype Superconducting RF (SRF) cryomodule",
        "comprising multiple compact crab cavities is foreseen to realise a local crab crossing scheme for the “Hi-Lumi LHC”",
        "a project launched by CERN to increase the luminosity performance of LHC. A cryomodule with two cavities will be initially installed and tested on the SPS drive accelerator at CERN to evaluate performance with high-intensity proton beams. STFC in collaboration with",
        "University of Lancaster",
        "CERN and FNAL has developed a concept cryomodule that has overcome most of the critical challenges imposed by a series of boundary conditions arising from; the complexity of the cavity design",
        "the requirement for multiple RF couplers",
        "the close proximity to the second LHC beam pipe and the tight space constraints in the SPS tunnel. This paper highlights some of the key design features of the cryomodule with the results of the associated mechanical and thermal analysis."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI046",
      "title": "Commissioning of the ERL Cryomodule on ALICE at Daresbury Laboratory",
      "authors": [
        "A.E. Wheelhouse",
        "R.K. Buckley",
        "S.R. Buckley",
        "P.A. Corlett",
        "L.S. Cowie",
        "P. Goudket",
        "A.R. Goulden",
        "L. Ma",
        "P.A. McIntosh",
        "A.J. Moss",
        "S.M. Pattalwar",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The ERL cryomodule with two identical 7-cell",
        "1.3 GHz cavities developed as part of a international collaborative program has been installed in the linac stage on the ALICE (Accelerators and Lasers in Combined Experiments) facility at Daresbury Laboratory replacing the existing 9-cell cryomodule. The cavities have been cooled to 2 K and commissioning of the cryomodule is underway. This paper describes the conditioning and the characterisation tests performed on the two superconducting RF cavities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI047",
      "title": "UK Industrial Development of Manufacturing Techniques for Superconducting RF Cavities",
      "authors": [
        "A.E. Wheelhouse",
        "R.K. Buckley",
        "L.S. Cowie",
        "P. Goudket",
        "A.R. Goulden",
        "P.A. McIntosh",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "J.R. Everard",
        "N. Shakespeare",
        "Shakespeare Engineering",
        "South Woodham Ferrers",
        "Essex",
        "United Kingdom"
      ],
      "institutions": [
        "An STFC Innovation Partnership Scheme (IPS) grant, funding Daresbury Laboratory and Shakespeare Engineering Ltd to develop the capability to fabricate, process and test a 9-cell 1.3 GHz superconducting RF cavity in support of enabling UK industry to address the large potential market for superconducting RF structures. At the heart of the development are the repeatability and the reproducibility of the manufacturing process in an effort to reduce the costs. Effort has been spent on developing the techniques to fabricate the niobium half cells and the beam pipes and this paper discusses the manufacturing processes and the results obtained."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri047.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI048",
      "title": "Testing and Dressed Cavity Design for the HL-LHC 4R Crab Cavity",
      "authors": [
        "B.D.S. Hall",
        "G. Burt",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "R. Calaga",
        "S. Calatroni",
        "E. Jensen",
        "A. Macpherson",
        "M. Navarro-Tapia",
        "CERN",
        "Geneva",
        "Switzerland",
        "T.J. Jones",
        "N. Templeton",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A.J. May",
        "P.A. McIntosh",
        "S.M. Pattalwar",
        "A.E. Wheelhouse",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The High luminosity upgrade to the LHC (HL-LHC) calls for crab cavities to reduce the luminosity loss due to the crossing angle and help provide luminosity levelling. The 4 Rod Crab Cavity (4RCC) is one of three proposed options under consideration. A bare cavity has been prototyped and has undergone recent vertical tests and the results are presented. The dressed cavity includes a power coupler",
        "a lower order mode coupler and two HOM couplers will be presented and discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri048.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI049",
      "title": "Optimization of Window Position on Diamond SCRF Cavities",
      "authors": [
        "S.A. Pande",
        "C. Christou",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "The Diamond storage ring uses CESR type superconducting cavities. These cavities have a fixed coupling resulting in fixed Qext which is considerably higher than the optimum. We use 3 stub tuners to match the cavities under these non-optimum conditions. Diamond Cavity-1 will soon be refurbished. This opportunity could be used to lower the Qext on the cavity. One of the options is to modify the coupling tongue geometry along with a matching section. This may require cutting off the beam tube with the coupler for rework or it may need to be newly fabricated. We investigated another option to lower the Qext of the cavity by optimising the location of the window with respect to the cavity",
        "maintaining the same coupling tongue geometry. The height of the waveguide on the vacuum side of the window differs from that of the coupling waveguide on the cavity resulting in a step. The location of window with respect to the cavity makes a significant difference to the ultimate Qext obtained after putting the window in place. In this paper we present the results of our numerical simulations comparing the present and the proposed window position under different operating conditions."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri049.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI050",
      "title": "Development and Test Results of a Quasi-waveguide Multi-cell Resonator",
      "authors": [
        "Z.A. Conway",
        "A. Barcikowski",
        "S.M. Gerbick",
        "M. Kedzie",
        "M.P. Kelly",
        "J.S. Kerby",
        "S.H. Kim",
        "S.V. Kutsaev",
        "R.C. Murphy",
        "A. Nassiri",
        "P.N. Ostroumov",
        "T. Reid",
        "T.L. Smith",
        "A. Zholents",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "This paper reports the successful fabrication and test results of a novel 2815 MHz superconducting deflecting cavity operating in a TE-mode trapped in a quasi-waveguide structure with extremely high shunt impedance. The waveguide structure of this cavity allows for the free propagation of all higher order modes (HOMs) out of the cavity via the beam ports",
        "eliminating the need for HOM dampers inside the cavity when operated with high beam current. The absence of HOM dampers greatly simplifies the cavity fabrication and operation at cryogenic temperatures. This cavity with its high shunt impedance is ideal for the spatial rotation of short bunches in a small physical space",
        "a requirement for the generation of sub-picosecond short pulse x-rays in electron storage rings or luminosity upgrades of colliders. Results characterizing the fabrication accuracy and precision",
        "the RF performance at 2 K",
        "and frequency tuning considerations will be discussed here."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri050.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI051",
      "title": "Results from RF Tests of the First US-built High-gradient Superconducting Cryomodule",
      "authors": [
        "A. Hocker",
        "C.M. Baffes",
        "K. Carlson",
        "B. Chase",
        "D.J. Crawford",
        "E. Cullerton",
        "D.R. Edstrom",
        "E.R. Harmspresenter",
        "T. Kubicki",
        "M.J. Kucera",
        "J.R. Leibfritz",
        "J.N. Makara",
        "D. McDowell",
        "O.A. Nezhevenko",
        "D.J. Nicklaus",
        "H. Pfeffer",
        "Y.M. Pischalnikov",
        "P.S. Prieto",
        "J. Reid",
        "W. Schappert",
        "P. Stabile",
        "P. Varghese",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "Fermilab has built a cryomodule comprised of eight 1.3 GHz superconducting RF cavities for use in its Advanced Superconducting Test Accelerator (ASTA) facility. This cryomodule (",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri051.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI052",
      "title": "SRF Systems for ASTA at Fermilab",
      "authors": [
        "E.R. Harms",
        "C.M. Baffes",
        "K. Carlson",
        "B. Chase",
        "D.J. Crawford",
        "E. Cullerton",
        "D.R. Edstrom",
        "M. Geynisman",
        "A. Hocker",
        "A.L. Klebaner",
        "M.J. Kucera",
        "J.R. Leibfritz",
        "J.N. Makara",
        "D. McDowell",
        "S. Nagaitsev",
        "O.A. Nezhevenko",
        "D.J. Nicklaus",
        "H. Pfeffer",
        "Y.M. Pischalnikov",
        "P.S. Prieto",
        "J. Reid",
        "W. Schappert",
        "P. Stabile",
        "P. Varghese",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Advanced Superconducting Test Accelerator (ASTA) at Fermilab now being commissioned is comprised of a number of superconducting RF systems including single-cavity cryomodules and a TESLA/ILC style 8-cavity cryomodule. Two of them",
        "'Capture Cavity 2' and 'Cryomodule 2'",
        "have been cooled to 2 Kelvin and brought into operation. We provide an overview of the unique characteristics of each of the systems",
        "commissioning experience",
        "and latest results including their respective operating characteristics."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri052.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI053",
      "title": "Phase Method of Measuring Cavity Quality Factor",
      "authors": [
        "O.S. Melnychuk",
        "R.V. Pilipenko",
        "Y.M. Pischalnikov",
        "W. Schappert",
        "D.A. Sergatskov",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Novel method for measuring intrinsic quality factor of superconducting RF (SRF) cavities using both amplitude and phase information of forward",
        "reflected",
        "and transmitted cavity signal is discussed. Advantages of the method in comparison with traditional types of cavity quality factor measurements are highlighted. Computer simulations and evaluation of uncertainties for the measurements are described. Analysis of data collected at vertical test facility for SRF cavities at Fermilab is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri053.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI054",
      "title": "Medium Field Q-Slope Studies in Low Beta Resonators",
      "authors": [
        "O.S. Melnychuk",
        "A. Grassellino",
        "A.I. Sukhanov",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Studies of the phenomenon of Medium field Q-slope (MFQS",
        "30-80 mT) have been focused predominantly on high beta superconducting cavities. Complementing research on cavity losses with the analysis of low beta cavity data can provide additional insights into the nature of MFQS. We present MFQS measurements of 325MHz β=0.2 single spoke resonators and 650MHz β=0.9 elliptical single cell resonators at vertical test facility at FNAL. We compare our findings with those obtained for high frequency 1.3GHz cavities tested both at the same facility and other laboratories."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri054.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI057",
      "title": "RF Control and DAQ Systems for the Upgraded Vertical Test Facility at Fermilab",
      "authors": [
        "Y.M. Pischalnikov",
        "R.H. Carcagno",
        "F.L. Lewis",
        "R. Nehring",
        "R.V. Pilipenko",
        "W. Schappert",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Fermilab Vertical Cavity Test Facility (VCTF) [1] is a used to test production cavities prior to their installation in cryomodules and to characterize the performance of research cavities as part of the extensive SRF cavity R&D program at FNAL. The performance of a variety of SRF cavities (325MHz",
        "650MHz",
        "1300MHz; bare and dressed) can be measured at VCTF. Recently FNAL upgraded the facility by adding two additional test stands (VTS2&3) in preparation for production of cavities for two new linear accelerators (LCLS II and PIP II). This paper provides an overview of the design features",
        "technical parameters and experience with first operation of the upgraded RF control and DAQ systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri057.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI058",
      "title": "Commissioning Status of the Advanced Superconducting Test Accelerator at Fermilab",
      "authors": [
        "J. Ruan",
        "R. Andrews",
        "C.M. Baffes",
        "D.R. Broemmelsiek",
        "K. Carlson",
        "B. Chase",
        "M.D. Church",
        "D.J. Crawford",
        "E. Cullerton",
        "J.S. Diamond",
        "N. Eddy",
        "D.R. Edstrom",
        "E.R. Harms",
        "A. Hocker",
        "A.S. Johnson",
        "A.L. Klebaner",
        "M.J. Kucera",
        "J.R. Leibfritz",
        "A.H. Lumpkin",
        "J.N. Makara",
        "S. Nagaitsev",
        "O.A. Nezhevenko",
        "D.J. Nicklaus",
        "L.E. Nobrega",
        "P.S. Prieto",
        "J. Reid",
        "J.K. Santucci",
        "G. Stancari",
        "D. Sun",
        "M. Wendt",
        "S.J. Wesseln",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "The Advanced Superconducting Test Accelerator (ASTA) is under construction at Fermilab. This accelerator will consist of a photo-electron gun",
        "injector",
        "ILC-type cryomodules",
        "and multiple downstream beam-lines. Its purpose is to be a user-based facility for Advanced Accelerator R&D. . Following the successful commissioning of the photoinjector gun",
        "a Tesla style 8-cavity cryomodule and a high gradient capture cavity have been cooled down to 2 K and powered commissioning and performance characterization has begun. We will report on the commissioning status and near-term future plans for the facility."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri058.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI059",
      "title": "Assembly and Installation of the UV Laser Delivery and Diagnostic Platform and the Photocathode Imaging System for the ASTA Front-end",
      "authors": [
        "D.J. Crawford",
        "R. Andrews",
        "T.W. Hamerla",
        "J. Ruanpresenter",
        "J.K. Santucci",
        "D. Snee",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Advanced Superconducting Test Accelerator (ASTA) is in the early stage of commissioning. The Front-End consists of a 1.5 cell normal conducting RF Gun resonating at 1.3 GHz with a gradient of up to 40 MV/m",
        "a cesium telluride cathode for photoelectron production",
        "a pulsed 264 nm ultra-violet (UV) laser delivery system",
        "and a diagnostic area for measuring the characteristics of the photoelectron beam. We report on the design",
        "construction",
        "and early experience of the ultra-violet (UV) Laser Delivery and Diagnostic Platform and the Photocathode Imaging System."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri059.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI060",
      "title": "Investigation of Thermocurrents Limiting the Performance of Superconducting Cavities",
      "authors": [
        "R.G. Eichhorn",
        "C.G. Daly",
        "F. Furuta",
        "A. Ganshin",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "As the surface resistance of superconducting cavities approach the theoretical limits parasitic effects limiting the performance came into focus of current research. One of these effects is that the quality factor of a cavity is impacted by the cooldown rate. We will present results from recent investigations on thermocurrents",
        "driven by the temperature difference between the two material interfaces between the superconducting Niobium cavity and its Titanium helium-vessel",
        "leading to the presence of a magnetic field while the cavity transits to the superconducting state."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri060.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI061",
      "title": "Cornell's Main Linac Cryomodule for the Energy Recovery Linac Project",
      "authors": [
        "R.G. Eichhorn",
        "B. Bullock",
        "J.V. Conway",
        "B. Elmore",
        "F. Furuta",
        "Y. He",
        "G.H. Hoffstaetter",
        "J.J. Kaufman",
        "M. Liepe",
        "T.I. O'Connel",
        "P. Quigley",
        "D.M. Sabol",
        "J. Sears",
        "E.N. Smith",
        "V. Veshcherevich",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Cornell University has been designing and building superconducting accelerators for various applications for more than 50 years. Currently",
        "an energy-recovery linac (ERL) based synchrotron-light facility is proposed making use of the existing CESR facility. As part of the phase 1 R&D program funded by the NSF",
        "critical challenges in the design were addressed",
        "one of them being a full linac cryo-module. It houses 6 superconducting cavities- operated at 1.8 K in continuous wave (CW) mode - with individual HOM absorbers and one magnet/ BPM section. Pushing the limits",
        "a high quality factor of the cavities (2•1010) and high beam currents (100 mA accelerated plus 100 mA decelerated) are targeted. We will present the status of the main linac cryomodule (MLC) fabrication and the findings on the cavity performance and component testing."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri061.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI062",
      "title": "The Joint High Q0 R&D Program for LCLS-II",
      "authors": [
        "M. Liepe",
        "R.G. Eichhorn",
        "F. Furuta",
        "G.M. Ge",
        "D. Gonnellapresenter",
        "G.H. Hoffstaetter",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "A.C. Crawford",
        "A. Grassellino",
        "A. Hocker",
        "O.S. Melnychuk",
        "A. Romanenko",
        "A.M. Rowe",
        "D.A. Sergatskov",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "R.L. Geng",
        "A.D. Palczewski",
        "C.E. Reece",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The superconducting RF linac for LCLS-II calls for 1.3 GHz 9-cell cavities with an average intrinsic quality factor Q0 of 2.7·1010 at 2K and 16 MV/m accelerating gradient. A collaborative effort between Cornell University",
        "FNAL",
        "and JLab has been set up with the goal of developing and demonstrating a cavity treatment protocol for the LCLS-II cavities meeting these specifications. The high Q0 treatment protocol is based on nitrogen doping of the RF surface layer during a high temperature heat treatment. This novel SRF cavity preparation was recently developed at FNAL and shown to result in SRF cavities of very high Q0 at 2K with an increase in Q0 from low to medium fields. N-doped single cell cavities at Cornell",
        "FNAL",
        "and JLab routinely exceed LCLS-II specification. 9-cell N-doped cavities at FNAL achieve an average Q0(T=2K",
        "16 MV/m) of ≈ 3.4·1010 with an average quench field of ≈ 19 MV/m",
        "meeting therefore overall with good margin the LCLS-II specification."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri062.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI063",
      "title": "Flux Trapping in Nitrogen-Doped and 120 C Baked Cavities",
      "authors": [
        "D. Gonnella",
        "M. Liepe",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "It is well known that external magnetic fields can cause higher residual resistance in superconducting RF cavities if the field is present during cooldown. However",
        "the effect of cavity preparation and surface mean free path on the resulting residual resistance from magnetic field is less well studied. In this paper",
        "we report on recent studies at Cornell in which two SRF cavities (one nitrogen-doped and one 120oC baked) were cooled through Tc in an applied uniform external magnetic field. Trapped flux and residual resistance were measured for a variety of cooldowns and applied magnetic fields. It was found that the residual resistance due to trapped flux in the nitrogen-doped cavity was three times larger than in the 120oC baked cavity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri063.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI064",
      "title": "New Insights into Heat Treatment of SRF Cavities in a Low-pressure Nitrogen Atmosphere",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri064.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI064",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI065",
      "title": "SRF Material Performance Studies using a Sample Host Cavity",
      "authors": [
        "D.L. Hall",
        "D. Gonnellapresenter",
        "M. Liepe",
        "I.S. Madjarov",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "A sample-host TE-mode cavity developed at Cornell for the purposes of studying novel superconducting materials has undergone further testing using a niobium sample plate. In initial testing the peak field achieved on the sample plate was (45 ± 4.5) mT",
        "although this was limited by the amount of input power available. New tests have been performed using both an improved RF power system and a temperature mapping system for precision measurements of surface resistance as a function of location on the sample plate. Results of the most recent test",
        "in which the cavity achieved a peak sample plate field of (81 ± 4) mT using a high-RRR niobium sample plate",
        "are presented and future work on the cavity is discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri065.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI066",
      "title": "Recent Progress in Nb3Sn SRF Cavity Development at Cornell",
      "authors": [
        "S. Posen",
        "D. Gonnellapresenter",
        "M. Liepe",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Nb3Sn coatings on niobium SRF cavities have the potential to significantly reduce cryogenic costs due to their extremely small surface resistance (Rs). In this paper",
        "we present new results showing the repeatability of Cornell's fabrication process",
        "which produces high Q0 cavities that reach medium fields with minimal Q-slope. We also show the results of attempts to smooth RF surfaces and reduce defects via material removal. However",
        "both HF rinsing and centrifugal barrel polishing resulted in strong performance degradation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri066.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI067",
      "title": "Multi-Physics Analysis of CW Superconducting Cavity for the LCLS-II using ACE3P",
      "authors": [
        "Z. Li",
        "C. Adolphsen",
        "O. Kononenko",
        "T.O. Raubenheimer",
        "C.H. Rivetta",
        "M.C. Ross",
        "L. Xiao",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The LCLS-II linac utilizes superconducting technology operating at continuous wave to accelerate the 1-MHz electron beams to 4 GeV to produce tunable FELs. The TESLA 9-cell superconducting cavity is adopted as the baseline design for the linac. The design gradient is approximately 16 MV/m. The highest operating current is 300 μA. Assuming that the RF power is matched at the highest current",
        "the optimal loaded QL of the cavity is found to be around 4·107. Because of the high QL",
        "the cavity bandwidth approaches the background microphonic detuning",
        "and the performance of the cavity is tightly coupled to the mechanical perturbations of the cavity/cryomodule system. The resulting large phase and amplitude variations in the cavity require active feedback to achieve the 0.01% amplitude and phase stability requirements. To understand the cavity RF response and feedback requirements to the microphonics and Lorentz Force detuning",
        "we have developed a simulation model of the RF-mechanical coupled system using parameters obtained with the multi-physics solver ACE3P. We will present the simulation results of the LCLS-II linac under different power feed scenarios and feedback schemes."
      ],
      "institutions": [
        "Funding: Work was supported by the U.S. DOE contract DE-AC02-76SF00515 and used the resources of NERSC at LBNL under US DOE Contract No. DE-AC03-76SF00098."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri067.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI068",
      "title": "Conceptual Design of an Ideal Variable Coupler for Superconducting Radiofrequency 1.3 GHz Cavities",
      "authors": [
        "C. Xu",
        "S.G. Tantawi",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "We present a new type of fundamental mode accelerator structure coupler. This coupler has a very simplified mechanical structure and is equipped with a novel vacuum window structure that allows the coupler to be divided into two parts. These two parts are fully thermally isolated",
        "only coupled by thermal radiation. The rf power on the other hand get coupled perfectly from one part to the other. This is truly novel approach which is quite different than the conventional approach to this problem such as chock structure. The structure in general is slightly overmoded. We show that this structure can also be adopted to change the coupling coefficient and thus be tuned for an external Q. This could be of great utility for CW operation. We show the analytical and numerical calculation for a two window variable coupler."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri068.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI069",
      "title": "Reproducibility of High-Q SRF Cavities by High Temperature Heat Treatment",
      "authors": [
        "P. Dhakal",
        "G. Ciovatipresenter",
        "P. Kneisel",
        "G.R. Myneni",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Recent work on high-temperature (> 600 °C) heat treatment of ingot Nb cavities in a customized vacuum furnace for several hours showed the possibility of achieving Q0-values of up to ~5×1010 at 2.0 K",
        "1.5 GHz and accelerating gradients of ~20 MV/m. This contribution presents results on further studies of the heat treatment process to produce cavities with high Q0 values for continuous-wave accelerator application. Single-cell cavities of different Nb purity have been processed through few cycles of heat-treatments and chemical etching. Measurements of Q0 as a function of temperature at low RF field and of Q0 as a function of the RF field at or below 2.0 K have been made after each treatment. Measurements by TOF-SIMS of the impurities’ depth profiles were made on samples heat treated with the cavities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri069.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI069",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI070",
      "title": "Mechanical Properties of Ingot Nb Cavities",
      "authors": [
        "G. Ciovati",
        "P. Dhakal",
        "P. Kneisel",
        "J.D. Mammosser",
        "J. Matalevich",
        "G.R. Myneni",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "This contribution presents the results of measurements of the resonant frequency and of strain along the contour of a single-cell cavity made of ingot Nb subjected to increasing uniform differential pressure",
        "up to 6 atm. The data were used to infer mechanical properties of this material after cavity fabrication",
        "by comparison with the results from simulation calculations done with ANSYS. The objective is to provide useful information about the mechanical properties of ingot Nb cavities which can be used in the design phase of SRF cavities intended to be built with this material."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri070.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI070",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI072",
      "title": "High Power Co-axial Couplers for SRF Cavities",
      "authors": [
        "J. Guo",
        "J. Henry",
        "R.A. Rimmer",
        "H. Wang",
        "R.S. Williams",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "A. Dudas",
        "M.L. Neubauer",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "High Power RF couplers are required in a wide range of accelerator projects using superconducting RF cavities. We have proposed a novel robust coax SRF coupler design using two pre-stressed disc windows without the need of additional matching elements. The matching frequency and the power handling capacity can be easily scaled by changing the diameter and the spacing of the windows. In this paper",
        "we will present our latest progress in the fabrication and the testing of the windows."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri072_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri072.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri072_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI072",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI073",
      "title": "High Order Modes Survey and Mitigation of the CEBAF C100 Cryomodules",
      "authors": [
        "J. Guo",
        "M. Stirbet",
        "H. Wang",
        "S. Wang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Ten new C100 cryomodules have been installed for the CEBAF 12GeV upgrade in the last few years. The high order modes (HOM) of these cryomodules need to be controlled to avoid beam breakup (BBU) instability. We surveyed the HOM for all the 80 cavities of the C100 modules in both the JLab cryomodule test facility (CMTF) and the CEBAF tunnel. Additional measures such as waveguide filters were applied to bring down out of spec modes. In this paper",
        "we will present the HOM survey setup and results. The mitigation measures and their effects will also be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri073.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI073",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI074",
      "title": "Status of SRF Facilities at SNS",
      "authors": [
        "J. Saunders",
        "R. Afanador",
        "B. DeGraff",
        "C.J. McMahan",
        "ORNL RAD",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "M.T. Crofford",
        "M. Doleans",
        "M.P. Howell",
        "S.-H. Kim",
        "S.W. Lee",
        "T.S. Neustadt",
        "S.E. Stewart",
        "W.H. Strong",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "As a part or an ongoing process to maintain and improve the performance of its Superconducting Linac (SCL) the Spallation Neutron Source (SNS) is building facilities for processing and testing Superconducting Radio Frequency (SRF) cavities. Recently both a High Pressure Rinse (HPR) tool and a Vertical Test Apparatus (VTA) have been built and commissioned. The HPR is a commercially fabricated piece of equipment which is customized for the SNS application. The VTA was specified",
        "designed and developed by the SNS. This paper will outline the design features as well as the commissioning results for both systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri074.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI074",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI075",
      "title": "A Compact Beam Spreader using RF Deflecting Cavities for the LCLS-II",
      "authors": [
        "S.U. De Silva",
        "J.R. Delayenpresenter",
        "R.G. Olave",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "L.R. Doolittle",
        "M. Placidi",
        "A. Ratti",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The LCLS-II project currently under development is designed to accelerate electron bunches up to 4 GeV and transport them to one of two FEL undulators located more than 2 km downstream of the end of the LCLS-II linac. The upgrade requires a spreader system to separate the baseline electron bunches and transport them to two undulator lines or a local dump. Fast bipolar kickers (FK) or transverse electric rf deflectors (RFD) are considered as fast-switching devices (FSD). In the RFD approach described here three design options operating at 325 MHz are studied including a superconducting rf-dipole cavity",
        "a normal conducting rf-dipole cavity",
        "and a normal conducting 4-rod cavity. Optional compact splitting schemes involving a combination of vertical and horizontal initial deflections are addressed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri075.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI075",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI076",
      "title": "Higher Order Mode Damping in Superconducting Spoke Cavities",
      "authors": [
        "C.S. Hopper",
        "J.R. Delayenpresenter",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "Parasitic higher order modes (HOMs) can be severely detrimental to the performance of superconducting cavities. For this reason",
        "the mode spectrum and beam coupling strength must be examined in detail to determine which modes must be damped. One advantage of the spoke cavity geometry is that couplers can be placed on the outer body of the cavity rather than in the beam line space. We present an overview of the HOM properties of spoke cavities and methods for suppressing the most harmful ones."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri076.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI076",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI077",
      "title": "Cryogenic Test of a 750 MHz Superconducting RF Dipole Crabbing Cavity*",
      "authors": [
        "A. Castilla",
        "J.R. Delayenpresenter",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "A. Castilla",
        "J.R. Delayenpresenter",
        "H. Park",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "DCI-UG",
        "León",
        "Mexico",
        "A superconducting rf dipole cavity has been designed to address the challenges of a high repetition rate (750 MHz)",
        "high current for both electron/ion species (0.5/3 A per bunch)",
        "and large crossing angle (50 mrad) at the interaction points (IPs) crabbing system for the Medium Energy Electron-Ion Collider (MEIC) proposed by Jefferson Lab. The cavity prototype built at Niowave",
        "Inc. has been tested at the Jefferson Lab facilities. In this work we present a detailed analysis of the prototype cavity performance at 4 K and 2 K",
        "corroborating the absence of hard multipacting barriers that could limit the desired transverse fields",
        "along with the surface resistance (Rs) temperature dependency."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri077.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI077",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI078",
      "title": "Development of a Quarter-wave Coaxial Coupler for 1.3 GHz Superconducting Cavities",
      "authors": [
        "Y. Xie",
        "A. Kanareykin",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "N. Solyak",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Superconducting ILC-type cavities have an rf coupler that is welded on. A detachable coupler will reduce conditioning time (can be conditioned separately)",
        "reduce cost and improve reliability. The problem with placing an extra flange in the superconducting cavity is creating a possible quench spot. Euclid Techlabs LLC designed a coupler and optimized its geometry that yielding an area on the surface with zero magnetic field (hence zero surface current). By placing a flange in that area we are able to avoid disturbing surface currents that typically lead to a quench. The coupler is optimized to preserve the axial symmetry of the cavity and rf field. The rf test results of this type coupler with a 1.3 GHz ILC-type single-cell cavity at Fermilab will be reported and discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri078.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI078",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI081",
      "title": "Mechanical Design of the 704 MHz 5-cell SRF Cavity Cold Mass for CeC PoP Experiment",
      "authors": [
        "J.C. Brutus",
        "S.A. Belomestnykhpresenter",
        "I. Ben-Zvi",
        "Y. Huang",
        "V. Litvinenko",
        "I. Pinayev",
        "J. Skaritka",
        "L. Snydstrup",
        "R. Than",
        "J.E. Tuozzolo",
        "W. Xu",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "T.L. Grimm",
        "R. Jecks",
        "J.A. Yancey",
        "Niowave",
        "Inc.",
        "Lansing",
        "Michigan",
        "USA",
        "A 5-cell SRF cavity operating at 704 MHz will be used for the Coherent Electron Cooling Proof of Principle (CeC PoP) system under development for the Relativistic Heavy Ion Collider (RHIC) at Brookhaven National Laboratory. The CeC PoP experiment will demonstrate the new technique of cooling proton and ion beams that may increase the beam luminosity in certain cases",
        "by as much as tenfold. The 704 MHz cavity will accelerate 2 MeV electrons from a 112 MHz SRF gun up 22 MeV. Novel mechanical designs",
        "including a super fluid heat exchanger",
        "helium vessel",
        "vacuum vessel and tuner mechanism are presented. Structural and thermal analysis",
        "using ANSYS were performed to confirm the mechanical tuning system structural stability. This paper provides an overview of the design",
        "the project status and schedule of the 704 MHz 5-cell SRF for CeC PoP experiment."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri081_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri081.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri081_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI081",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI083",
      "title": "The SIS100 Superconducting Fast Ramped Dipole Magnet",
      "authors": [
        "E.S. Fischer",
        "A. Bleile",
        "J.P. Meier",
        "A. Mierau",
        "P. Schnizer",
        "GSI",
        "Darmstadt",
        "Germany",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The first dipole magnet of the superconducting SIS100 accelerator was delivered by industry and its thermodynamic",
        "electrical and magnetic field performance was measured. We describe the build of the test facility",
        "the infrastructure and its performance",
        "outline the chosen measurement methods along with the optimisation of the magnet end required for obtaining the requested integral field quality. The measured ac loss parameters will be discussed in respect of the possible operation performance of the whole machine",
        "the relevant cooling conditions of the main dipole magnet."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri083_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri083.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri083_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI083",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI084",
      "title": "Magnetic Field Optimization of SIS100 Quadrupole Units",
      "authors": [
        "K. Sugita",
        "E.S. Fischer",
        "A. Mierau",
        "P. Schnizer",
        "GSI",
        "Darmstadt",
        "Germany",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Superconducting heavy ion synchrotron SIS100 is the central accelerator of the FAIR accelerator complex. There are more than 10 types of the quadrupole units in SIS100 due to the combination of the quadrupoles from 3 families and several types of the corrector magnets. Magnetic field optimization of the quadrupole magnet ends including evaluation of cross talk between closely attached quadrupole and corrector magnets will be reported. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri084_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri084.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri084_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI084",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI085",
      "title": "The Elettra 3.5 T Superconducting Wiggler Refurbishment",
      "authors": [
        "D. Zangrando",
        "R. Bracco",
        "D. Castronovo",
        "M. Cautero",
        "E. Karantzoulis",
        "S. Krecic",
        "G.L. Loda",
        "D. Millo",
        "L. Pivetta",
        "G. Scalamera",
        "R. Visintini",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "S.V. Khrushchev",
        "N.A. Mezentsev",
        "V.A. Shkaruba",
        "V.M. Syrovatin",
        "O.A. Tarasenko",
        "V.M. Tsukanov",
        "A.A. Volkov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [
        "A 3.5 Tesla 64 mm period superconducting wiggler (SCW) was constructed by the Russian Budker Institute of Novosibirsk (BINP) and installed in the Elettra storage ring as a photon source for the second X-ray diffraction beamline in November 2002, but never used due to the lack of the funding required for the beamline construction. About three years ago, the beamline construction was finally funded together with the refurbishment of the SCW. This upgrade, that was necessary in order to make the SCW operations compatible with the top up mode of the storage ring aimed in a drastic reduction of the liquid helium consumption by means of replacing the cryostat with a new version. At the same time the upgrade aimed as well to improve the reliability of the cryostat, to update the control system and to verify the magnetic field performance after a very long time of inactivity. In this paper we present and discuss the performances of the SCW following its refurbishment carried out by BINP team and its re-commissioning in the Elettra storage ring."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri085_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri085.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri085_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI085",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI086",
      "title": "Three Dimensional Field Analysis for Final Focus Magnet System at SuperKEKB",
      "authors": [
        "Y. Arimoto",
        "N. Ohuchipresenter",
        "M. Tawada",
        "K. Tsuchiya",
        "H. Yamaoka",
        "Z.G. Zong",
        "KEK",
        "Ibaraki",
        "Japan",
        "B. Parker",
        "P. Wanderer",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "SuperKEKB is an upgrade accelerator of KEKB with a design luminosity of 8x1035 cm-2 s-1. The design is based on a \"nano-beam scheme\"",
        "where vertical beam size is squeezed into 50 nm at an interaction point. One of key component is a final focus magnet system. The focusing system consists of 4-superconducting (SC) quadrupole doublets",
        "43 SC-correctors",
        "4 SC-compensation solenoids. They are aligned in a detector (Belle-II) solenoid which generates a longitudinal field of 1.5 T. The system are packed in a small area and also has magnetic shields. So it is expected an entire magnetic field of the system is not one which is linearly-superimposed field of each magnet. Here a study of three dimensional field analysis for the final focus magnet system will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri086_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri086.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri086_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI086",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI087",
      "title": "Magnetic Field Measurement System for the SuperKEKB Final Focus Superconducting Magnets",
      "authors": [
        "N. Ohuchi",
        "Y. Arimoto",
        "M. Iwasaki",
        "M.K. Kawai",
        "Y. Kondo",
        "Y. Makida",
        "K. Tsuchiya",
        "H. Yamaoka",
        "Z.G. Zong",
        "KEK",
        "Ibaraki",
        "Japan",
        "SuperKEKB are now being constructed with a target luminosity of 8×1035 which is 40 times higher than KEKB. This luminosity can be achieved by the \"Nano-Beam\" scheme",
        "in which both beams should be squeezed to about 50 nm at the beam interaction point",
        "IP. The beam final focusing system consists of 8 superconducting quadrupole magnets",
        "4 superconducting solenoids and 43 superconducting corrector coils. The magnetic field measurement systems with the vertical cryostats were designed and constructed for performing the acceptance test of these magnets at 4 K. The field measurements are performed by the 6 different harmonic coils and a Hall probe. The higher order multi-pole field distributions along the magnet axes are very important for the beam operation",
        "and then these distributions are measured with the 20 mm long harmonic coils. The integral fields of quadrupole magnets are measured with the 600 mm long harmonic coils. We will describe the magnetic field measurement system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri087_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri087.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri087_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI087",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI088",
      "title": "Magnetic Measurement System for the NICA Booster Magnets",
      "authors": [
        "V.V. Borisov",
        "A. Donyagin",
        "O. Golubitsky",
        "A. Golunov",
        "N. Gorbunov",
        "H.G. Khodzhibagiyan",
        "N.A. Morozov",
        "S. Rubtsun",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [
        "NICA is a new accelerator collider complex presently under construction at Joint Institute for Nuclear Research (JINR) in Dubna. More than 250 superconducting magnets need for the NICA booster and collider. These magnets will be assembled and tested at the new test facility in the Laboratory of High Energy Physics JINR. The first phase of the system for magnetic measurements was commissioned in late 2013. A method of measuring the quality of the magnetic field in the aperture of the curved dipole magnet for the booster synchrotron is described. First results of magnetic measurements are presented and discussed. Commissioning of equipment for magnetic measurements in the aperture of quadrupole magnets for the NICA booster is close to completion."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri088_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri088.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri088_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI088",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI089",
      "title": "Facility for Assembling and Serial Test of Superconducting Magnets",
      "authors": [
        "S.A. Kostromin",
        "N.N. Agapov",
        "V.V. Borisov",
        "A.R. Galimov",
        "V. Karpinsky",
        "H.G. Khodzhibagiyan",
        "V.S. Korolev",
        "D. Nikiforov",
        "N.V. Semin",
        "A.Y. Starikov",
        "G.V. Trubnikov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The NICA/MPD project has been started at the Joint Institute for Nuclear Research (JINR) in Dubna in 2007. The NICA accelerator complex will consist of two injector chains",
        "the new 600 MeV/u superconducting (SC) booster synchrotron",
        "the existing SC synchrotron Nuclotron",
        "and the new SC collider having two rings each of 503 m in circumference. The building construction of the new test facility for simultaneous cryogenic testing of the SC magnets on 6 benches is completed at the Laboratory of High Energy Physics. Premises with an area of 2600 m2 were prepared to install the equipment. The 15 kA",
        "25 V pulse power supply",
        "the helium satellite refrigerator with capacity of 100 W were commissioned first bench for magnets testing is now under assembling. First magnets cryogenic tests are planned on July. Start of the serial production of the SC magnets for the booster synchrotron is planned for the end of 2014."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri089_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri089.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri089_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI089",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI090",
      "title": "Cyclotron C235-V3 for Dimitrovgrad Hospital Center of the Proton Therapy",
      "authors": [
        "S.A. Kostromin",
        "S. Gurskiy",
        "G.A. Karamysheva",
        "M.Y. Kazarinov",
        "S.A. Korovkin",
        "S.P. Mokrenko",
        "N.A. Morozov",
        "A.G. Olshevsky",
        "V.M. Romanov",
        "E. Samsonov",
        "N.G. Shakun",
        "G. Shirkov",
        "S.G. Shirkov",
        "E. Syresin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "P. Cahay",
        "Y. Jongen",
        "Y. Paradis",
        "IBA",
        "Louvain-la-Neuve",
        "Belgium",
        "JINR-IBA C235-V3 isochronous cyclotron for 1st Russian hospital center of the proton therapy has been assembled and tested. Shimming of the magnetic field",
        "optimization of the acceleration modes and testing with the extracted proton beam were done in frame of this work. The paper presents experimental results of the beam dynamics in the accelerator. Proton transmission from radius 30cm to 103cm is 72% without beam cutting diaphragms. The extraction efficiency is 62%. This cyclotron is a substantially modified version C235-V3 of the IBA C235 serial cyclotron. C235-V3 has the improved extraction system which was constructed and tested. This system allows raise the extraction efficiency up to 77% from 50% in comparison with serial C235. Special mapping system (for Br-component) of the magnetic field was developed and constructed by JINR for the shimming of the Br-field in the middle plane of the cyclotron. Total efficiency of the machine is 45%. Further improvement of the parameters expected after final tuning of the cyclotron in Dimitrovgrad."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri090_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri090.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri090_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI090",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI091",
      "title": "Superconducting Multipole Wigglers: State of the Art",
      "authors": [
        "N.A. Mezentsev",
        "S.V. Khrushchev",
        "V.K. Lev",
        "V.A. Shkaruba",
        "V.M. Syrovatin",
        "V.M. Tsukanov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Superconducting multipole wigglers installed on synchrotron radiation sources are the powerful tools for researches in various areas of science and technics. SuperConducting Multipole Wigglers (SCMWs) represent sign-alternating sequence of magnets with lateral magnetic field. Relativistic electrons",
        "passing through such set of magnetic elements",
        "create radiation with properties of synchrotron radiations depending on maximum field its period and poles number. The first superconducting wiggler has been made and installed on the VEPP-3 electron storage ring as generator of synchrotron radiation in 1979. Nowadays tens of wigglers are successfully working in the various synchrotron radiation centers and more than 10 of them were developed and made in Budker INP. These wigglers may be divided into 3 groups: 1- Short period 3-3.5 cm with field ~2-2.5 Tesla 2- Medium period 4.8-6 cm with field ~ 3.5-4.5 Tesla 3- Long period 14.5-20 cm with field 7-7.5Tesla. The description of magnetic properties of the wigglers",
        "parameters of both cryogenic and vacuum systems and their technical decisions are presenteded in the report."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri091_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri091.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri091_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI091",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI092",
      "title": "Test and Simulation Results for Quenches Induced by Fast Losses on a LHC Quadrupole",
      "authors": [
        "C. Bracco",
        "B. Auchmann",
        "W. Bartmann",
        "M. Bednarek",
        "A. Lechner",
        "M. Sapinski",
        "R. Schmidt",
        "N.V. Shetty",
        "M. Solfaroli Camillocci",
        "A.P. Verweij",
        "CERN",
        "Geneva",
        "Switzerland",
        "A test program for beam induced quenches was started in the LHC in 2011 in order to reduce as much as possible BLM-triggered beam dumps",
        "without jeopardizing the safety of the superconducting magnets. A first measurement was performed to assess the quench level of a quadrupole located in the LHC injection region in case of fast (ns) losses. It consisted in dumping single bunches onto an injection protection collimator located right upstream of the quadrupole",
        "varying the bunch intensity up to 3·1010 protons and ramping the quadrupole current up to 2200 A. No quench was recorded at that time. The test was repeated in 2013 with increased bunch intensity (6·1010 protons); a quench occurred when powering the magnet at 2500 A. The comparison between measurements during beam induced and quench heaters induced quenches is shown. Results of FLUKA simulations on energy deposition",
        "calculations on quench behaviour using QP3 and the respective estimates of quench levels are also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri092_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri092.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri092_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI092",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI093",
      "title": "Welding and Quality Control for the Consolidation of the LHC Superconducting Magnets and Circuits",
      "authors": [
        "S. Atieh",
        "M. Bernardini",
        "F.F. Bertinelli",
        "P. Cruikshank",
        "J.M. Dalinpresenter",
        "G. Favre",
        "V. Kain",
        "D. Lombard",
        "A. Perin",
        "M. Pojer",
        "G. Rasul",
        "D. Rey",
        "R. Rizwan",
        "F. Savary",
        "J.Ph. G. L. Tock",
        "CERN",
        "Geneva",
        "Switzerland",
        "The first LHC long shutdown was driven by the need to consolidate the 13 kA splices between the superconducting magnets to safely attain its center of mass design energy of 14 TeV. Access to the splices requires the opening of welded sleeves by machining. After consolidation",
        "the sleeves are re-welded using a TIG orbital welding. The welding process has been modified from the original “as-new” installation in order to better adapt to the “as repaired” situation. The intervention has been thoroughly prepared through qualifications",
        "organisation of teams",
        "their training and follow-up. Quality control is based on the qualification of equipment",
        "process and operators; the recording of production parameters; regular process audits and production witness samples; visual inspection through an official certifying body. The paper also describes welding and quality control of special intervention cases",
        "with issues of difficult access requiring innovative solutions. This work concerns over 10 000 welds and a team of 40 engineers and technicians over a period of 18 months. The experience and lessons learnt will be applicable to similar large complex projects."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri093_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri093.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri093_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI093",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI094",
      "title": "Conceptual Design Study of the High Luminosity LHC Recombination Dipole",
      "authors": [
        "G.L. Sabbi",
        "X. Wang",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "G. Arduini",
        "M. Giovannozzipresenter",
        "E. Todesco",
        "CERN",
        "Geneva",
        "Switzerland",
        "The interaction region design of the High-Luminosity LHC requires replacing the recombination dipole magnets (D2) with new ones. The preliminary specifications include an aperture of 105 mm",
        "with 186 mm separation between the twin-aperture axes",
        "and an operating field in the range of 3.5 to 4.5 T. The main design challenge is to decouple the magnetic field in the two apertures and ensure good field quality. In this paper",
        "we present a new approach to address these issues",
        "and provide expected harmonics for geometric",
        "saturation and persistent current effects. The feasibility of an operating field at the high end of the range considered is also discussed",
        "to minimize the D2 magnet length and facilitate the space allocation for other components."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri094_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri094.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri094_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI094",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI095",
      "title": "Modelling of a Short-period Superconducting Undulator",
      "authors": [
        "B.J.A. Shepherd",
        "J.A. Clarke",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "V. Bayliss",
        "T.W. Bradshaw",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "STFC",
        "in collaboration with Diamond Light Source",
        "are designing and building a 15.5 mm period",
        "1.26 T superconducting undulator. This paper describes the modelling of the undulator",
        "using Radia and Opera. Extensive numerical modelling has been carried out to simulate the effect of manufacturing tolerances on the quality of the magnetic field",
        "in order to meet the demanding 3° rms phase error specification."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri095_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri095.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri095_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI095",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI096",
      "title": "Mu2e Magnetic Measurements",
      "authors": [
        "M. Buehler",
        "M.A. Tartaglia",
        "J.C. Tompkins",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "University of Illinois at Urbana-Champaign",
        "Illinois",
        "USA",
        "The Mu2e experiment at Fermilab is designed to explore charged lepton flavor violation by searching for muon-to-electron conversion. The magnetic field generated by a system of solenoids is crucial for Mu2e and requires accurate characterization to detect any flaws and to produce a detailed field map. Stringent physics goals are driving magnetic field specifications for the Mu2e solenoids. A field mapper is being designed",
        "which will produce detailed magnetic field maps. The uniform field region of the spectrometer volume requires the highest level of precision (1 Gauss per 1 Tesla). During commissioning",
        "multiple magnetic field maps will be generated to verify proper alignment of all magnet coils",
        "and to create the final magnetic field map. In order to design and build a precise field mapping system consisting of Hall and NRM probes",
        "tolerances and precision for such a system need to be evaluated. In this paper we present a design for the Mu2e field mapping hardware",
        "and discuss results from OPERA-3D simulations to specify parameters for Hall and NMR probes. We also present a fitting procedure for the analytical treatment of our expected magnetic measurements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri096_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri096.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri096_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI096",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI097",
      "title": "STATUS OF 11 T 2-IN-1 Nb3Sn DIPOLE DEVELOPMENT FOR LHC",
      "authors": [
        "A.V. Zlobin",
        "N. Andreev",
        "G. Apollinari",
        "E.Z. Barzi",
        "R. Bossert",
        "M. Buehler",
        "G. Chlachidzepresenter",
        "J. DiMarco",
        "A. Nobrega",
        "I. Novitski",
        "D. Turrioni",
        "G. Velev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "B. Auchmann",
        "M. Karppinen",
        "L. Rossi",
        "D. Smekens",
        "CERN",
        "Geneva",
        "Switzerland",
        "The LHC upgrade plans foresee installation of additional collimators in the LHC lattice. To provide the necessary longitudinal space for these collimators",
        "shorter and stronger Nb3Sn dipoles compatible with the LHC lattice and main systems could be used. This paper describes the design and status of the twin-aperture Nb3Sn dipole being developed by FNAL and CERN for the LHC",
        "and reports test results of two collared coils to be used in the first 1 m long twin-aperture dipole model."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri097_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri097.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri097_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI097",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI098",
      "title": "QUENCH PROTECTION STUDIES OF 11T Nb3Sn DIPOLE MODELS FOR LHC UPGRADES",
      "authors": [
        "A.V. Zlobin",
        "G. Chlachidzepresenter",
        "A. Nobrega",
        "I. Novitski",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "CERN",
        "Geneva",
        "Switzerland",
        "CERN and FNAL are developing 11 T Nb3Sn dipole magnets for the LHC collimation system upgrade. Due to the large stored energy",
        "protection of these magnets during a quench is a challenging problem. This paper reports the results of experimental studies of key quench protection parameters including longitudinal and radial quench propagation in the coil",
        "coil heating due to a quench",
        "and energy extraction and quench-back effect. The studies were performed using a 1 m long 11 T Nb3Sn dipole coil tested in a magnetic mirror configuration."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri098_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri098.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri098_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI098",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI099",
      "title": "Testing of a Single 11 T Nb3Sn Dipole Coil Using a Dipole Mirror Structure",
      "authors": [
        "A.V. Zlobin",
        "N. Andreev",
        "E.Z. Barzi",
        "G. Chlachidzepresenter",
        "V.V. Kashikhin",
        "A. Nobrega",
        "I. Novitski",
        "D. Turrioni",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "M. Karppinen",
        "D. Smekens",
        "CERN",
        "Geneva",
        "Switzerland",
        "FNAL and CERN are developing an 11 T Nb3Sn dipole suitable for installation in the LHC. To optimize coil design parameters and fabrication process and study coil performance",
        "a series of 1 m long dipole coils is being fabricated. One of the short coils has been tested using a dipole mirror structure. This paper describes the dipole mirror magnetic and mechanical designs",
        "and reports coil parameters and test results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri099_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri099.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri099_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI099",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI100",
      "title": "Magnetic Design Constraints of Helical Solenoids",
      "authors": [
        "M.L. Lopes",
        "S. Krave",
        "J.C. Tompkins",
        "K. Yonehara",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "G. Flanagan",
        "S.A. Kahn",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "Texas A&M University",
        "College Station",
        "Texas",
        "USA",
        "Helical solenoids have been proposed as an option for a Helical Cooling Channel for muons in a proposed Muon Collider. Helical solenoids can provide the required three main field components: solenoidal",
        "helical dipole",
        "and a helical gradient. In general terms",
        "the last two are a function of many geometric parameters: coil aperture",
        "coil radial and longitudinal dimensions",
        "helix period and orbit radius. In this paper",
        "we present design studies of a Helical Solenoid",
        "addressing the geometric tunability limits and auxiliary correction system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri100_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri100.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri100_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI100",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI101",
      "title": "Iron Shims outside the Helium Vessel to Adjust Field Quality at High Fields",
      "authors": [
        "R.C. Gupta",
        "M. Anerella",
        "J.P. Cozzolino",
        "A.K. Jain",
        "J.F. Muratore",
        "P. Wanderer",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "This paper describes the development and demonstration of a novel technique of adjusting measured field quality at the design field in superconducting magnets. The technique is based on placing iron shims of variable stack thicknesses",
        "variable width and/or variable length on the outer surface of the stainless steel shell at strategic locations. Since the shims are placed outside the helium vessel",
        "adjustments can be made without involving major operations such as opening the helium vessel. It is a simple and economical technique which is suitable for long magnets with a fast turn-around. This allows one to reduce field errors well beyond the normal construction errors. The technique has recently been successfully applied in two 3.8 T",
        "80 mm aperture",
        "9.45 m long dipoles. These magnets were built at Brookhaven National Laboratory (BNL) for the APUL project (Accelerator Project to Upgrade the LHC) as a part of US contribution to LHC. The paper will present the design",
        "measurement and adaptation of this technique which",
        "when used in combination with the coil shims",
        "produced near zero sextupole harmonic at high fields and small harmonics throughout the range of operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri101.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI101",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI102",
      "title": "Conceptual Magnetic Design of the Large Aperture D2 Dipole for LHC Upgrade",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "CERN has proposed the High Luminosity upgrade of the Large Hadron Collider (HL-LHC) as an upgrade to the Large Hadron Collider (LHC). As a part of this proposal",
        "the aperture of twin aperture D2 dipole is increased from the present 80 mm to 105 mm without increasing the size of cryostat. This creates a significant challenge in managing saturation induced harmonics and the leakage field",
        "particularly since the field in the two apertures is in the same direction. In addition",
        "small spacing between the two apertures creates significant cross-talk harmonics as well. The expected harmonics based on an initial design were rather large and limited the beam dynamics performance of the machine. This paper will present a series of conceptual magnetic designs which reduce the values of key harmonics by a large amount with expected field errors now comparable to those in most superconducting accelerator magnets."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri102.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI102",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI103",
      "title": "Magnet Design for a Six-dimensional Rectilinear Cooling Channel - Feasibility Study",
      "authors": [
        "H. Witte",
        "J.S. Berg",
        "R.B. Palmer",
        "D. Stratakispresenter",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "An essential part of a potential future muon collider is ionization cooling",
        "which is required to reduce the emittance of the muon beam. A new scheme has recently been proposed which in simulations shows an improved performance in terms of cooling efficiency and transmitted muons. The lattice of this cooling channel consists of 12 stages",
        "each of which requires different superconducting solenoids. The most challenging stage is the last one",
        "where the solenoids are expected to deliver 15.1T in a bore of ~4.5 cm. This paper discusses the feasibility of the solenoids for the last stage of this lattice."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri103.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI103",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI105",
      "title": "Preliminary Design of Cooling System for a PrFeB-based Cryogenic Permanent Magnet Undulator Prototype at IHEP",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri105_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri105.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri105_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI105",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI106",
      "title": "Design of Cryomoudles for RAON",
      "authors": [
        "Y. Kim",
        "C. Choi",
        "H.M. Jang",
        "Y.W. Jo",
        "H.J. Kimpresenter",
        "W.K. Kim",
        "M. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "The accelerator will be built in Korea called RAON has four kinds of superconducting cavities such as QWR",
        "HWR1",
        "SSR1 and SSR2",
        "and those cavities are operating in 2 K. The fabrication design for the SSR1 and SSR2 cryomodules are reported in this paper. The issues included in the paper are thermal and structural analysis results for the components such thermal shield",
        "support post",
        "two phase pipe",
        "and so on."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri106_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri106.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri106_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI106",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI107",
      "title": "Fundamental Thermal Analysis for Cryogenic System Design",
      "authors": [
        "H. Kim",
        "D. Jeonpresenter",
        "W.K. Kim",
        "G.-T. Park",
        "I. Shin",
        "J.H. Shin",
        "S.W. Yoon",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "Non-uniform temperature distribution",
        "surface roughness",
        "and superfluid helium level change between 2K dewar and cryomodule are most important thermal analyses in designing cryogenic system. Effective temperature for non-uniform temperature distribution is defined. Thermal radiation property from surface roughness which is related to fractional dimension is investigated. Superfluid helium level change between 2K dewar and cryomodule is shown as a function of temperature difference. Our research can be useful thermal analyses for cryogenic system design."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri107_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri107.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri107_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI107",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI108",
      "title": "Liquid Helium Technologies at Cryogenic Complex of the Heavy Ion Collider NICA",
      "authors": [
        "Iu.A. Mitrofanova",
        "N.N. Agapov",
        "N. Emelianov",
        "H.G. Khodzhibagiyan",
        "D. Nikiforov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "R. Herzog",
        "A. Kade",
        "J. Klier",
        "ILK Dresden",
        "Dresden",
        "Germany",
        "NICA (Nuclotron-based Ion Collider fAcility)",
        "presently under construction at JINR",
        "will be",
        "upon its completion",
        "among the most advanced research instruments of the physics community. The facility is aimed at providing collider experiments with heavy ions up to uranium (gold at the beginning stage) with a centre of mass energy up to 11 GeV/u and an average luminosity up to 1027 cm-2 s−1. The NICA cryogenics includes a large number of technical ideas and solutions never used before. The most significant of these solutions are the fast cycling superconducting magnets",
        "cooling by the two-phase helium flow",
        "an unusually short period of time for cool down till the operating temperature",
        "parallel connection of cooling channels of the magnets",
        "«wet» turbo expanders",
        "screw compressors with the outlet pressure of more than 25 bars and jet pumps for liquid helium. These technical solutions allow one to construct an efficient and reliable cryogenic system of the NICA complex."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri108_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri108.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri108_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI108",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI109",
      "title": "The ESS Cryogenic System",
      "authors": [
        "P. Arnold",
        "J. Fydrych",
        "W. Hees",
        "J.M. Jurns",
        "X. Wang",
        "J.G. Weisend",
        "ESS",
        "Lund",
        "Sweden",
        "Cryogenic cooling is vital for large sections at ESS. The ESS cryogenic system comprises three separate helium refrigeration/liquefaction plants and an extensive cryodistribution system. Mainly there is a 2.0 GeV proton linac using superconducting RF cavities operating at 2 K. In addition to cooling the SRF cavities",
        "cryogenics is also used for the cold hydrogen moderator surrounding the target. There is also a cryogenic installation associated with the site acceptance testing of the ESS cryomodules. ESS furthermore uses both liquid helium and liquid nitrogen in a number of the neutron instruments. The test stand cryoplant will as well provide liquid helium for neutron instrument sample environments and comprise a helium purification unit. Together with the gas management",
        "helium recovery and a considerable cold and warm storage system",
        "cryogenics form a substantial part of ESS. This paper describes the current conceptual design of the ESS cryogenic system including the expected heat loads and operating modes for the linac cryoplant. Challenges associated with the required high efficiency",
        "reliability and turn-down capability will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri109_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri109.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri109_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI109",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI110",
      "title": "The HNOSS Horizontal Cryostat and the Helium Liquefaction Plant at FREIA",
      "authors": [
        "R. Santiago Kern",
        "T.J.C. Ekelöf",
        "K.J. Gajewski",
        "L. Hermansson",
        "R.J.M.Y. Ruber",
        "V.G. Ziemann",
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "P. Bujard",
        "N.R. Chevalier",
        "T. Junquera",
        "J.P. Thermeau",
        "Accelerators and Cryogenic Systems",
        "Orsay",
        "France",
        "A horizontal cryostat to test superconducting cavities and magnets at liquid helium temperatures is installed at FREIA (Facility for REsearch Instrumentation and Accelerator development) at Uppsala University",
        "Sweden. The cryostat allows full testing of superconducting spoke and elliptical accelerating cavities without the need of a specialized cryomodule per cavity. Because horizontal cryostats are custom-built",
        "their number in the accelerator world is very limited. The FREIA horizontal cryostat is one of a kind as it has been designed to be versatile: it is able to house either two ESS double-spoke",
        "or two ESS/TESLA type elliptical cavities",
        "or superconducting magnets or a combination of these with all the ancillary equipment (power couplers",
        "tuners",
        "etc) and test them at the same time",
        "reducing installation time but requiring extra design effort and cryogens supply. In order to achieve this",
        "a helium liquefier with a capacity of 140 l/h delivers liquid helium to the horizontal cryostat while the return gases are directed towards a recovery system",
        "connected in closed loop with the liquefier."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri110_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri110.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri110_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI110",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI111",
      "title": "Investigation of Moisture Contamination in the Cryogenic System at NSRRC",
      "authors": [
        "F. Z. Hsiao",
        "S.-H. Chang",
        "W.-S. Chiou",
        "H.C. Lipresenter",
        "T.F. Lin",
        "C.P. Liu",
        "H.H. Tsai",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "In NSRRC the helium cryogenic plant began its normal operation in year 2002. Several events of moisture contamination forced the cryogenic plant to cease operation because the cooling performance degraded evidently. After long-term observation we found",
        "through internal inspection of the helium gas buffer tank",
        "maintenance of the compressor station",
        "and warming the superconductive magnet",
        "that moisture contamination occurred. This paper presents the effect of those conditions on the moisture contamination. The solution to decrease the moisture contamination is demonstrated here."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri111_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri111.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri111_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI111",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI113",
      "title": "Operation of SLRI Cryogenic System for a 6.5 T Superconducting Wavelength Shifter",
      "authors": [
        "S. Srichan",
        "Ch. Dhammatong",
        "P. Klysubun",
        "V. Sooksrimuang",
        "K. Takkrathoke",
        "A. Tong-on",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "The cryogenic plant at Synchrotron Light Research Institute was designed to be used as the main liquid helium supply for a superconducting wavelength shifter",
        "in order to generate high-energy X-rays from the relatively low-energy 1.2 GeV Siam Photon Source storage ring. The plant was installed and successfully commissioned in the year 2009. During the past three years since commissioning",
        "the cryogenic system had been in operation to perform helium liquefaction without a superconducting magnet. Since the installation of a 6.5 T SWLS in September 2013",
        "the cryogenic system has begun its operation with a full-time load. In this work",
        "the first operation of the cryogenic system with a superconducting insertion device is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri113_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri113.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri113_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI113",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI115",
      "title": "Design and Integration of the Optical Reference Module at 1.3 GHz for FLASH and the European XFEL",
      "authors": [
        "E. Janas",
        "K. Czuba",
        "P. Kownacki",
        "D. Sikora",
        "Warsaw University of Technology",
        "Institute of Electronic Systems",
        "Warsaw",
        "Poland",
        "M.K. Czwalinna",
        "M. Felber",
        "T. Lamb",
        "H. Schlarb",
        "S. Schulz",
        "C. Sydlo",
        "M. Titberidze",
        "F. Zummack",
        "DESY",
        "Hamburg",
        "Germany",
        "NCBJ",
        "Świerk/Otwock",
        "Poland",
        "In this paper we present recent progress on the integration and implementation of the optical reference module (REFM-OPT) for the free-electron lasers FLASH and European XFEL. In order to achieve high energy stability and low arrival time jitter of the electron beam",
        "the accelerator requires an accurate low-level RF (LLRF) field regulation and a sophisticated synchronization scheme for various devices along the facility. The REFM-OPT is a 19” module which is responsible for resynchronizing the 1.3 GHz reference signal for the LLRF distributed by coaxial cables to a phase-stable signal of the optical synchronization system. The module provides a 1.3 GHz output signal with low phase noise and high long-term stability. Several sub-components of the REFM-OPT designed specifically for this module are described in detail. The readout electronics of the high-precision Laser-to-RF phase detector are presented as well as the integration of this key component into the 19” module. Additionally",
        "we focus on design solutions which assure phase stability and synchronization of the 1.3 GHz signal at several high power outputs of the module."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri115_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri115.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri115_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI115",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPRI116",
      "title": "Master Oscillator for the European XFEL",
      "authors": [
        "L.Z. Zembala",
        "K. Czuba",
        "B. Gąsowski",
        "D. Sikora",
        "Warsaw University of Technology",
        "Institute of Electronic Systems",
        "Warsaw",
        "Poland",
        "J. Branlard",
        "H. Schlarb",
        "H.C. Weddig",
        "DESY",
        "Hamburg",
        "Germany",
        "The reference signal outage causes breakdown of the synchronisation in the entire accelerator",
        "which could result in a multi-day break in the operation. Therefore",
        "the Master Oscillator (MO) for the European XFEL has to be redundant",
        "in order to achieve extremely high reliability. The redundancy concept",
        "which provides no interruption in the reference signal",
        "requires phase coherence",
        "fast RF switching and sustaining the RF power with a high-Q filter. These features allow to keep possible signal transitions smooth. Furthermore",
        "the MO has to generate a 1.3 GHz signal of exceptionally good phase noise performance – jitter < 35 fs RMS integrated from 10 Hz to1 MHz. One of the problems in the way are vibrations",
        "which have to be properly isolated to avoid microphonics effects in oscillators. The proposed MO architecture and connection with the RF distribution system is described. A basic prototype is tested and results are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/wepri116_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/wepri116.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/wepri116_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEPRI116",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 97,
  "scrape_time": "2025-10-10 20:48:03"
}