{
  "conference_info": {
    "name": "2019",
    "code": "cool2019",
    "url": "https://proceedings.jacow.org/cool2019/",
    "status": "pending"
  },
  "sessions": [
    {
      "session_info": {
        "id": "TUPS",
        "name": "TUPS - Poster Session",
        "url": "https://proceedings.jacow.org/cool2019/html/tups.htm"
      },
      "papers": [
        {
          "paper_id": "TUPS01",
          "title": "Simulation of Electron Cooling and IBS at EICC",
          "authors": [
            "IMP/CAS",
            "Lanzhou",
            "People’s Republic of China",
            "Electron Cooling will be considered in the future project EICC. In this high energy region",
            "electron cooling is very different from the traditional low energy case. For get high luminosity",
            "the high intensity and long lifetime of ion beam was required with the help of electron cooling. Electron cooling and IBS were simulated in the cases of high energy and high intensity for typical ion",
            "proton and Uranium. Some initial parameters were obtained from the simulation. It will be helpful for the understanding of high energy electron cooling."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups01.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS01",
          "page_number": "77",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": true
        },
        {
          "paper_id": "TUPS02",
          "title": "Two-Energy Storage-Ring Electron Cooler",
          "authors": [
            "F. Lin",
            "Y.S. Derbenev",
            "G.A. Krafft",
            "V.S. Morozov",
            "Y. Zhang",
            "JLab",
            "Newport News",
            "Virginia",
            "USA",
            "J.R. Delayen",
            "B. Dhital",
            "ODU",
            "Norfolk",
            "Virginia",
            "USA",
            "Cooling of ion beams to achieve a significant reduction of beam emittances is crucial to deliver high luminosities over a broad center of mass energy range in a collider. An electron-beam-based cooling system is one of the most potential approaches. It allows a small transverse beam size at the interaction point",
            "and a small beta-star and crab crossing with a longitudinally short bunch length. Cooling also extends the luminosity lifetime by counteracting the intra-beam scattering (IBS) induced emittance degradation. In this paper",
            "we propose a development of a storage-ring-based electron cooler consisting of two sections with significantly different energies: the cooling and damping sections. The electron energy and other parameters in the cooling section are adjusted for optimum cooling of a stored ion beam. The beam parameters in the damping section are adjusted for optimum damping of the electron beam. The necessary energy difference is provided by an energy-recovering-superconducting RF structure. Analytical calculations and numerical simulations have been performed to demonstrate a stable longitudinal motion with acceleration and deceleration of electron beams in this two-energy cooling system.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups02.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS02",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "TUPS03",
          "title": "Vacuum Systems for the Coolers of the NICA Project",
          "authors": [
            "A.V. Bubley",
            "A. Bainazarova",
            "M.I. Bryzgunov",
            "N.S. Kremnev",
            "V.V. Parkhomchuk",
            "A.A. Putmakov",
            "V.B. Reva",
            "BINP SB RAS",
            "Novosibirsk",
            "Russia",
            "The NICA accelerator complex contains two electron coolers",
            "one sits at booster and another at NICA collider. They have requirements for the vacuum of 10-11 mbar. Despite the coolers have different design the problems of getting vacuum are similar",
            "lack of space along vacuum chambers",
            "presence of the electron beam and oxide cathode usage. The solutions for achieving such a strict requirements are discussed in the article."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups03.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS03",
          "page_number": "80",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPS04",
          "title": "Preliminary Studies of Bem-Induced Fluorescence and Status of the Beam-Current Upgrade of the Electron-Cooler Test-Bench at HIM",
          "authors": [
            "Th. Beiser",
            "K. Aulenbacher",
            "M.W. Bruker",
            "J. Dietrich",
            "HIM",
            "Mainz",
            "Germany",
            "GSI",
            "Darmstadt",
            "Germany",
            "JLab",
            "Newport News",
            "Virginia",
            "USA",
            "First wavelength-resolved studies of the beam-induced fluorescence have been made at the cooler teststand. Its upgrade to 30 kV has been completed",
            "which will allow operation at 1 Ampere beam current. Operation with the upgraded parameters is imminent and options for further experiemnts will be discussed."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups04_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups04.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups04_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS04",
          "page_number": "83",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPS05",
          "title": "The High Voltage Power Supply System for Electron Cooler for CSRe",
          "authors": [
            "D.N. Skorobogatov",
            "M.I. Bryzgunov",
            "M.N. Kondaurov",
            "A.A. Putmakov",
            "V.V. Repkov",
            "V.B. Reva",
            "BINP SB RAS",
            "Novosibirsk",
            "Russia",
            "The high-voltage power supply system for upgrade of the electron cooling system of CSRE ring in the IMP",
            "was developed at the BINP in 2014 - 2019. The main features are - maximum voltage is 300 kV",
            "stability - 10ppm",
            "with the ability of quick changing of voltage in range ±10% of nominal voltage for a time not more than 500 us. The key points of this design are presented in this article."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups05_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups05.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups05_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS05",
          "page_number": "86",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPS06",
          "title": "Electron Cooling Simulation Benchmarking",
          "authors": [
            "B. Veglia",
            "J. Resta-López",
            "C.P. Welsch",
            "Cockcroft Institute",
            "Warrington",
            "Cheshire",
            "United Kingdom",
            "N. Biancacci",
            "D. Gamba",
            "A. Latina",
            "Á. Saá Hernández",
            "CERN",
            "Meyrin",
            "Switzerland",
            "J. Resta-López",
            "C.P. Welsch",
            "The University of Liverpool",
            "Liverpool",
            "United Kingdom",
            "Electron coolers are commonly used in storage rings to reduce the phase space volume of heavy particles such as protons",
            "antiprotons and ions. Their effect depends on the Coulomb interactions between the circulating beam and the cold electrons at small relative velocities. The cooling process can be modelled through different approaches and the behaviour of the cooling force",
            "can be described by various formulas",
            "which include different parameters. The aim of the present study is to compare the accuracy of the cooling simulations performed by two distinct beam-tracking codes: Betacool and RF-Track. Being based on different models and formulas",
            "the two simulation tools require different parameters in order to realistically describe electron cooling. In this contribution",
            "the impact of these parameters is discussed",
            "and simulation predictions are compared with experimental data from LEIR (Low Energy Ion Ring) at CERN and ESR (Experimentier-Speicher-Ring) at GSI. Fur-thermore",
            "the friction force is calculated for the new antimatter storage ring ELENA (Extra Low Energy Anti-proton) at CERN."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups06_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups06.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups06_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS06",
          "page_number": "89",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPS07",
          "title": "WinSAM and WinMAG - New Program Packages for Simulation of Electron-Optical Systems",
          "authors": [
            "BINP SB RAS",
            "Novosibirsk",
            "Russia",
            "In BINP new program packages WinSAM and WinMAG have been developed. The main goal of WinSAM program is the simulation of axially symmetric electron optical systems with space charge consideration. This program is the further development of SAM code with greatly improved interface and enhanced scope of considered tasks. WinMAG is developed to solve 3D non-linear magnetostatic tasks",
            "direct integral method is used in this code. Several types of coils including user-defined coils can be entered",
            "magnetic volumes can be described by several basic volumes."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups07_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups07.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups07_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS07",
          "page_number": "93",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPS08",
          "title": "Beam Position Monitor System for High Voltage Electron Cooler for NICA Collider",
          "authors": [
            "G.V. Karpov",
            "E.A. Bekhtenevpresenter",
            "V.B. Reva",
            "BINP SB RAS",
            "Novosibirsk",
            "Russia",
            "E.A. Bekhtenevpresenter",
            "V.B. Reva",
            "NSU",
            "Novosibirsk",
            "Russia",
            "The high voltage (2.5 MV) electron cooler for NICA collider is now designing in BINP. Beam position monitor (BPM) system for orbit measurements has been developed at BINP. The system contains 16 BPMs inside the cooling sections",
            "4 BPMs inside the high voltage vessels and 22 BPMs in transport channels. Continuous electron beam is modulated with 10 MHz sinusoidal signal for capability to get signals from pickup electrodes. The beam current modulation can be varied in the range of 0.3 - 5 mA. The modulation signal may be supplied to each sector of the control electrode. So",
            "the position of one quadrant sector of the electron beam can be measured by BPM system. Comparing the positions of each sectors from BPM to BPM it is possible to analyse the shape of the electron beam in the transport channel and cooling section. The BPMs inside the cooling section can measure both electron and ion beams. It is achieved by means of switching the reference signals inside the BPM electronics. The prototypes of new BPM electronics have been fabricated and tested. The BPM electronics provides highly precise beam position measurements. Position measurement error doesn’t exceed a few micron. Design features of the BPM system",
            "its parameters and testing results are presented in this paper."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups08_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups08.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups08_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS08",
          "page_number": "96",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPS09",
          "title": "Electron Cooler Introduced Perturbations on Ion Beam",
          "authors": [
            "Y.J. Yuan",
            "P. Li",
            "IMP/CAS",
            "Lanzhou",
            "People’s Republic of China",
            "The influence of electron cooler on stored ion beams in heavy ion synchrotron has been studied for many years. Usually",
            "only the influence on lattice from the magnetic field of solenoid and toroids were considered",
            "in addition to the cooling effect from Coulomb Scatter-ing. However",
            "electron cooling experiments show that there exist limits on intensity of electron beam and the stored ion beams. Meanwhile",
            "experiments of cooling with pulsed e-beam show structure instability that should be explained. The influence of electron beam induced electromagnetic field on ion beams was studied in this paper by means of Lie Algebraic method. The combined transport matrix of solenoid and e-beam field focusing is given. Application of the matrix may help to understand the above phenomena."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups09_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups09.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups09_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS09",
          "page_number": "99",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": true
        },
        {
          "paper_id": "TUPS10",
          "title": "Power Supplies for Correctors of the 2.5 MeV Electron Cooling System for the NICA Collider",
          "authors": [
            "O.V. Belikov",
            "M.I. Bryzgunov",
            "V.R. Kozak",
            "V.V. Parkhomchuk",
            "V.B. Reva",
            "D.S. Vinnik",
            "BINP SB RAS",
            "Novosibirsk",
            "Russia"
          ],
          "institutions": [],
          "abstract": "Power supply system for corrector magnets of NICA electron cooling system includes different power supply sources. 112 bipolar power supply sources provide a maximal current 6 A and maximal voltage from 24 V to 140 V. 32 bipolar power supply sources provide maximal current 20 A and maximal voltage 50 V. Additionally the system includes 16 power supply sources with a maximal current 20 A for active correction of current in the main magnets by connecting power supplies to the magnet windings in parallel. The paper will present the description and parameters of power supply system. reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups10_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups10.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups10_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS10",
          "page_number": "102",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPS11",
          "title": "Specifications for a new Electron Cooler for the Antiproton Decelerator (AD)",
          "authors": [
            "G. Tranquille",
            "L.V. Joergensenpresenter",
            "CERN",
            "Geneva",
            "Switzerland",
            "In October 1979 the first electron cooling experiments at CERN were performed on the Initial Cooling Experiment (ICE) ring. Forty years later",
            "and after two re-incarnations",
            "the same device continues to cool beams of antiprotons on the AD",
            "improving the quality of the particle beams delivered to the different trap experiments. However",
            "with time",
            "it has become increasingly difficult to obtain spare units for this device. Many sub-systems can only be replaced by newly design parts",
            "which can be complicated to integrate in the present device. In addition",
            "some design flaws have become apparent over the last years",
            "which have seriously degraded the availability of the cooler. To ensure the best performance of the antimatter complex at CERN for the coming years",
            "we have decided to build an entirely new state-of-the-art electron cooler operating at higher energies than the present device. The specifications of this new electron cooler and the expected performance will be presented in this paper.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups11_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups11.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups11_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS11",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "TUPS12",
          "title": "Commissioning the ELENA Electron Cooler",
          "authors": [
            "G. Tranquille",
            "J. Cenede",
            "S. Deschamps",
            "A. Frassier",
            "L.V. Joergensenpresenter",
            "CERN",
            "Geneva",
            "Switzerland",
            "Electron cooling is central to the success of the Extra Low ENergy Antiproton (ELENA) ring which will increase by a factor of up to 100 the number of antiprotons available for the trap experiments. Cooling is needed to reduce or eliminate the emittance blow-up caused by the deceleration process and obtain the small emittance antiproton beams needed for further deceleration and extraction to the experiments. The device that has been installed on ELENA is designed to operate at electron energies below 350 eV in an ultrahigh vacuum environment and with minimum perturbation to the ring. We present the key stages of the commissioning of the cooler (magnetic measurements",
            "installation",
            "setting-up etc.) which culminated in the phase-space cooling of antiprotons in ELENA at energies as low as 100 keV.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups12_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups12.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups12_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS12",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "TUPS13",
          "title": "The Cascade Transformer for the High-Voltage Electron Cooling System for the NICA Collider",
          "authors": [
            "A.P. Denisov",
            "M.I. Bryzgunov",
            "A.D. Goncharov",
            "V.V. Parkhomchuk",
            "V.B. Reva",
            "D.N. Skorobogatov",
            "BINP SB RAS",
            "Novosibirsk",
            "Russia",
            "The 2.5 MeV electron cooling system for the NICA collider (JINR",
            "Dubna) will use cascade transformers for distributing the power among the sections of the high-voltage column and for transferring power to the high-voltage terminal. The design of the cascade transformer and the measurements of its prototype are described."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups13_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups13.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups13_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS13",
          "page_number": "105",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPS14",
          "title": "Electron Cooling Application for Hadron Therapy",
          "authors": [
            "V.A. Vostrikov",
            "V.V. Parkhomchuk",
            "V.B. Reva",
            "BINP SB RAS",
            "Novosibirsk",
            "Russia",
            "V.B. Reva",
            "V.A. Vostrikov",
            "NSU",
            "Novosibirsk",
            "Russia",
            "The project of synchrotron for hadron therapy with electron cooling is developing in Budker Institute of Nuclear Physics. The main goal of project is design of the effective and low cost hadron therapy facility. The electron cooling is applied for ion beam accumullation",
            "cooling and preparation for the slow extraction. The high quality cold ion beam with an extreme small emittance and energy spread allows significantly decrease the synchrotron and beam transfer lines apertures. Moreover",
            "the cooling can be applied for accumulation of short lived radioactive izotopes which can be used for online visualization of treatment."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups14_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups14.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups14_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS14",
          "page_number": "108",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPS15",
          "title": "The Magnetic System of Electron Coolers of Collider NICA",
          "authors": [
            "V.M. Panasyuk",
            "M.I. Bryzgunov",
            "A.V. Bubley",
            "V.M. Konstantinov",
            "V.Ya. Korchagin",
            "N.S. Kremnev",
            "V.V. Parkhomchuk",
            "S. Pospolita",
            "V.B. Reva",
            "S.I. Ruvinsky",
            "BINP SB RAS",
            "Novosibirsk",
            "Russia",
            "The complex of electron cooling is created in the BINP SB RAS. Complex is duplex of electron coolers. According to technical specifications total power consumption of the complex should not exceed 500 kW",
            "electron energy from 0.2 to 2.5 MeV",
            "magnetic field in solenoids of cooling up to 2kG",
            "and distance between the centers of solenoids should be 320mm. In general",
            "the layout of this complex is similar to the layout of the cooler created in BINP for COSY",
            "but its production due to the above specifications is much more complicated."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups15_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups15.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups15_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS15",
          "page_number": "112",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPS16",
          "title": "Laser Cooling of Relativistic Lithium-like 16O5+ Ion Beams at the CSRe",
          "authors": [
            "H.B. Wang",
            "B. Hai",
            "Z. Huang",
            "N. Khan",
            "J. Li",
            "X.N. Li",
            "X. Ma",
            "L.J. Mao",
            "R.S. Mao",
            "W.Q. Wen",
            "J.X. Wu",
            "J.C. Yang",
            "D.Y. Yin",
            "Y.J. Yuan",
            "D. Zhao",
            "T.C. Zhao",
            "X. Zhu",
            "IMP/CAS",
            "Lanzhou",
            "People’s Republic of China",
            "HZDR",
            "Dresden",
            "Germany",
            "D.Y. Chen",
            "D. Zhang",
            "H.Y. Zhang",
            "Xidian University",
            "Xi’an",
            "People’s Republic of China",
            "D. Kiefer",
            "S. Klammes",
            "T. Walther",
            "TU Darmstadt",
            "Darmstadt",
            "Germany",
            "S.A. Litvinov",
            "D.F.A. Winters",
            "GSI",
            "Darmstadt",
            "Germany",
            "Laser cooling of Li-like O5+ ion beams with an relativistic energy of 275.7 MeV/u was achieved for the first time at the heavy-ion storage ring CSRe in Lanzhou",
            "China [*",
            "**]. In the experiment",
            "a CW la-ser system with a wavelength of 220 nm was used to interact with the closed 2s1/2-2p1/2 optical transi-tion of O5+ ions. In order to cool the relativistic ion beams with only one counter-propagating CW laser",
            "the ion beams were bunched by applying a sinusoidal voltage to the RF-buncher system. The relative longitudinal momentum spread dp/p of laser-cooled ion beams reached 1×10-6. The O5+ ions are of the highest charge state and highest beam energy that have ever been cooled by laser cooling method. We will present the very recent experimental results on this COOL 2019 workshop. Based on this successful laser cooling experiment",
            "the precision laser spectroscopy experiment of O5+ ions is in preparation at the CSRe. A new optical detector is under design and will be installed at the CSRe to measure the forward-emitted fluorescence by the laser-excited O5+ ions [***",
            "****]. The high voltage of the electron cooler will be precisely calibrated to determine the beam energy. Precision laser spectroscopy of O5+ ions to measure the transition energy of 2s1/2-2p1/2 and 2s1/2-2p3/2 is foreseen",
            "and the relative accuracy could reach 1×10-5.",
            "*Wang H B",
            "et al.",
            "in preparation  **Wen W Q",
            "et al",
            "2019 Hyperfine Interact. 240 45  ***Hannen V",
            "et al.",
            "2013 JINST 8 09018  ****Winters D",
            "et al.",
            "2013 Phys. Scr. T156 014089",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [
            "Funding: This work is supported by the NSFC No. U1732141 and 11504388, National Postdoctoral Program for Innovative Talents No. BX201700256, the Youth Innovation Promotion Association CAS."
          ],
          "abstract": "reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups16_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups16.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups16_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS16",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "TUPS17",
          "title": "Parameter Optimization of Ring Slot Coupler Pickup and Kicker for the NICA Stochastic Cooling System",
          "authors": [
            "K.G. Osipov",
            "I.V. Gorelyshev",
            "A.O. Sidorin",
            "JINR/VBLHEP",
            "Dubna",
            "Moscow region",
            "Russia",
            "V.V. Filimonov",
            "A.O. Sidorin",
            "JINR",
            "Dubna",
            "Russia",
            "I.V. Gorelyshev",
            "A.O. Sidorin",
            "Saint Petersburg State University",
            "Saint Petersburg",
            "Russia",
            "St. Petersburg University",
            "St. Petersburg",
            "Russia"
          ],
          "institutions": [],
          "abstract": "Ring Slot Coupler structure is planned to be used as pickup and kicker for the new NICA stochastic cooling system. Design optimization for the device was provided. reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups17_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups17.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups17_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS17",
          "page_number": "116",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPS18",
          "title": "Phase Step Method for Friction Force Measurement in Filter Stochastic Cooling",
          "authors": [
            "I.V. Gorelyshev",
            "A.O. Sidorin",
            "JINR/VBLHEP",
            "Dubna",
            "Moscow region",
            "Russia",
            "V.V. Filimonov",
            "A.V. Shemchuk",
            "JINR",
            "Dubna",
            "Russia",
            "I.V. Gorelyshev",
            "A.O. Sidorin",
            "Saint Petersburg State University",
            "Saint Petersburg",
            "Russia",
            "N. Shurkhno",
            "R. Stassen",
            "FZJ",
            "Jülich",
            "Germany"
          ],
          "institutions": [],
          "abstract": "Voltage step method for friction force measurement in electron cooling is well known. The similar method for friction force measurement in longitudinal stochastic cooling with comb filter is provided. First test of the method during the run at COSY has been implemented.",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups18_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups18.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups18_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS18",
          "page_number": "119",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": true
        },
        {
          "paper_id": "TUPS19",
          "title": "Stochastic Cooling Simulation of Rare Isotope Beams on the Spectrometer Ring of the High Energy and High Intensity Accelerator Facility",
          "authors": [
            "X.J. Hu",
            "J.X. Wu",
            "Y.J. Yuan",
            "G. Zhu",
            "IMP/CAS",
            "Lanzhou",
            "People’s Republic of China",
            "Among various cooling methods",
            "stochastic cooling is an effective way of cooling low intensity beams with larger size. for the HIAF (High energy and high Intensity Accelerator Facility) project",
            "stochastic cooling will be built on the SRing (Spectrometer Ring).this paper mainly concerns on cooling effect based on different stochastic cooling methods",
            "aiming at finding the optimal cooling method and cooling parameters for different physical experiment purposes. simulation analysis will provide theoretical reference and support for the engineering construction."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups19_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups19.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups19_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS19",
          "page_number": "123",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUPS20",
          "title": "Laser Cooling at Ultrarelativistic Energies and the Gamma Factory Based on the LHC",
          "authors": [
            "CERN",
            "Meyrin",
            "Switzerland",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [
            "Partially stripped ions stored in the LHC and resonantly excited by a Doppler-boosted laser pulse can be used as an efficient converter of optical photons into gamma-rays with energies of up to 400 MeV. This process opens the possibility of developing a very intense source of gamma radiation (Gamma Factory project at CERN). The ion beam dynamics in such a facility is strongly affected by the process of laser cooling or heating as the ion emits the radiation. Beam dynamics simulations and other details of the Gamma Factory project at CERN will be presented in this talk."
          ],
          "abstract": "reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups20_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups20.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups20_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS20",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "TUPS21",
          "title": "Adjusting Unit of Longitudinal Field Coils for NICA HV Electron Cooler’s Solenoid",
          "authors": [
            "N.S. Kremnev",
            "M.I. Bryzgunov",
            "A.V. Bubley",
            "V.M. Panasyuk",
            "V.V. Parkhomchuk",
            "A.A. Putmakov",
            "V.B. Reva",
            "S.V. Shiyankov",
            "BINP SB RAS",
            "Novosibirsk",
            "Russia",
            "NSU",
            "Novosibirsk",
            "Russia",
            "Adjusting unit of longitudinal field coils is necessary element used to obtaining a rectilinear longitudinal field in cooling solenoids of electron cooling machines. Due to limited distance between cooling channels of HV electron cooler for NICA collider",
            "previously used adjusting unit for longitudinal coil couldn’t been applied. Possible orientation of adjusting unit is 90 degrees rotated and gravity force could not preload longitudinal field coil mounting to make adjusting unit working. New design of preloaded coil mounting unit",
            "made by BINP",
            "solves this problem and provides necessary adjusting range and adjusting precision of longitudinal field coils for NICA HV electron cooler’s solenoid."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups21_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups21.pdf",
          "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups21_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS21",
          "page_number": "127",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 21,
      "scrape_time": "2025-10-10 17:19:29"
    }
  ],
  "all_papers": [
    {
      "paper_id": "TUPS01",
      "title": "Simulation of Electron Cooling and IBS at EICC",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "Electron Cooling will be considered in the future project EICC. In this high energy region",
        "electron cooling is very different from the traditional low energy case. For get high luminosity",
        "the high intensity and long lifetime of ion beam was required with the help of electron cooling. Electron cooling and IBS were simulated in the cases of high energy and high intensity for typical ion",
        "proton and Uranium. Some initial parameters were obtained from the simulation. It will be helpful for the understanding of high energy electron cooling."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups01.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS01",
      "page_number": "77",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPS02",
      "title": "Two-Energy Storage-Ring Electron Cooler",
      "authors": [
        "F. Lin",
        "Y.S. Derbenev",
        "G.A. Krafft",
        "V.S. Morozov",
        "Y. Zhang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "J.R. Delayen",
        "B. Dhital",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "Cooling of ion beams to achieve a significant reduction of beam emittances is crucial to deliver high luminosities over a broad center of mass energy range in a collider. An electron-beam-based cooling system is one of the most potential approaches. It allows a small transverse beam size at the interaction point",
        "and a small beta-star and crab crossing with a longitudinally short bunch length. Cooling also extends the luminosity lifetime by counteracting the intra-beam scattering (IBS) induced emittance degradation. In this paper",
        "we propose a development of a storage-ring-based electron cooler consisting of two sections with significantly different energies: the cooling and damping sections. The electron energy and other parameters in the cooling section are adjusted for optimum cooling of a stored ion beam. The beam parameters in the damping section are adjusted for optimum damping of the electron beam. The necessary energy difference is provided by an energy-recovering-superconducting RF structure. Analytical calculations and numerical simulations have been performed to demonstrate a stable longitudinal motion with acceleration and deceleration of electron beams in this two-energy cooling system.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups02.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPS03",
      "title": "Vacuum Systems for the Coolers of the NICA Project",
      "authors": [
        "A.V. Bubley",
        "A. Bainazarova",
        "M.I. Bryzgunov",
        "N.S. Kremnev",
        "V.V. Parkhomchuk",
        "A.A. Putmakov",
        "V.B. Reva",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The NICA accelerator complex contains two electron coolers",
        "one sits at booster and another at NICA collider. They have requirements for the vacuum of 10-11 mbar. Despite the coolers have different design the problems of getting vacuum are similar",
        "lack of space along vacuum chambers",
        "presence of the electron beam and oxide cathode usage. The solutions for achieving such a strict requirements are discussed in the article."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups03.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS03",
      "page_number": "80",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPS04",
      "title": "Preliminary Studies of Bem-Induced Fluorescence and Status of the Beam-Current Upgrade of the Electron-Cooler Test-Bench at HIM",
      "authors": [
        "Th. Beiser",
        "K. Aulenbacher",
        "M.W. Bruker",
        "J. Dietrich",
        "HIM",
        "Mainz",
        "Germany",
        "GSI",
        "Darmstadt",
        "Germany",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "First wavelength-resolved studies of the beam-induced fluorescence have been made at the cooler teststand. Its upgrade to 30 kV has been completed",
        "which will allow operation at 1 Ampere beam current. Operation with the upgraded parameters is imminent and options for further experiemnts will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups04.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS04",
      "page_number": "83",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPS05",
      "title": "The High Voltage Power Supply System for Electron Cooler for CSRe",
      "authors": [
        "D.N. Skorobogatov",
        "M.I. Bryzgunov",
        "M.N. Kondaurov",
        "A.A. Putmakov",
        "V.V. Repkov",
        "V.B. Reva",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The high-voltage power supply system for upgrade of the electron cooling system of CSRE ring in the IMP",
        "was developed at the BINP in 2014 - 2019. The main features are - maximum voltage is 300 kV",
        "stability - 10ppm",
        "with the ability of quick changing of voltage in range ±10% of nominal voltage for a time not more than 500 us. The key points of this design are presented in this article."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups05.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS05",
      "page_number": "86",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPS06",
      "title": "Electron Cooling Simulation Benchmarking",
      "authors": [
        "B. Veglia",
        "J. Resta-López",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "N. Biancacci",
        "D. Gamba",
        "A. Latina",
        "Á. Saá Hernández",
        "CERN",
        "Meyrin",
        "Switzerland",
        "J. Resta-López",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "Electron coolers are commonly used in storage rings to reduce the phase space volume of heavy particles such as protons",
        "antiprotons and ions. Their effect depends on the Coulomb interactions between the circulating beam and the cold electrons at small relative velocities. The cooling process can be modelled through different approaches and the behaviour of the cooling force",
        "can be described by various formulas",
        "which include different parameters. The aim of the present study is to compare the accuracy of the cooling simulations performed by two distinct beam-tracking codes: Betacool and RF-Track. Being based on different models and formulas",
        "the two simulation tools require different parameters in order to realistically describe electron cooling. In this contribution",
        "the impact of these parameters is discussed",
        "and simulation predictions are compared with experimental data from LEIR (Low Energy Ion Ring) at CERN and ESR (Experimentier-Speicher-Ring) at GSI. Fur-thermore",
        "the friction force is calculated for the new antimatter storage ring ELENA (Extra Low Energy Anti-proton) at CERN."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups06.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS06",
      "page_number": "89",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPS07",
      "title": "WinSAM and WinMAG - New Program Packages for Simulation of Electron-Optical Systems",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "In BINP new program packages WinSAM and WinMAG have been developed. The main goal of WinSAM program is the simulation of axially symmetric electron optical systems with space charge consideration. This program is the further development of SAM code with greatly improved interface and enhanced scope of considered tasks. WinMAG is developed to solve 3D non-linear magnetostatic tasks",
        "direct integral method is used in this code. Several types of coils including user-defined coils can be entered",
        "magnetic volumes can be described by several basic volumes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups07.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS07",
      "page_number": "93",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPS08",
      "title": "Beam Position Monitor System for High Voltage Electron Cooler for NICA Collider",
      "authors": [
        "G.V. Karpov",
        "E.A. Bekhtenevpresenter",
        "V.B. Reva",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "E.A. Bekhtenevpresenter",
        "V.B. Reva",
        "NSU",
        "Novosibirsk",
        "Russia",
        "The high voltage (2.5 MV) electron cooler for NICA collider is now designing in BINP. Beam position monitor (BPM) system for orbit measurements has been developed at BINP. The system contains 16 BPMs inside the cooling sections",
        "4 BPMs inside the high voltage vessels and 22 BPMs in transport channels. Continuous electron beam is modulated with 10 MHz sinusoidal signal for capability to get signals from pickup electrodes. The beam current modulation can be varied in the range of 0.3 - 5 mA. The modulation signal may be supplied to each sector of the control electrode. So",
        "the position of one quadrant sector of the electron beam can be measured by BPM system. Comparing the positions of each sectors from BPM to BPM it is possible to analyse the shape of the electron beam in the transport channel and cooling section. The BPMs inside the cooling section can measure both electron and ion beams. It is achieved by means of switching the reference signals inside the BPM electronics. The prototypes of new BPM electronics have been fabricated and tested. The BPM electronics provides highly precise beam position measurements. Position measurement error doesn’t exceed a few micron. Design features of the BPM system",
        "its parameters and testing results are presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups08.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS08",
      "page_number": "96",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPS09",
      "title": "Electron Cooler Introduced Perturbations on Ion Beam",
      "authors": [
        "Y.J. Yuan",
        "P. Li",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "The influence of electron cooler on stored ion beams in heavy ion synchrotron has been studied for many years. Usually",
        "only the influence on lattice from the magnetic field of solenoid and toroids were considered",
        "in addition to the cooling effect from Coulomb Scatter-ing. However",
        "electron cooling experiments show that there exist limits on intensity of electron beam and the stored ion beams. Meanwhile",
        "experiments of cooling with pulsed e-beam show structure instability that should be explained. The influence of electron beam induced electromagnetic field on ion beams was studied in this paper by means of Lie Algebraic method. The combined transport matrix of solenoid and e-beam field focusing is given. Application of the matrix may help to understand the above phenomena."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups09.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS09",
      "page_number": "99",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPS10",
      "title": "Power Supplies for Correctors of the 2.5 MeV Electron Cooling System for the NICA Collider",
      "authors": [
        "O.V. Belikov",
        "M.I. Bryzgunov",
        "V.R. Kozak",
        "V.V. Parkhomchuk",
        "V.B. Reva",
        "D.S. Vinnik",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Power supply system for corrector magnets of NICA electron cooling system includes different power supply sources. 112 bipolar power supply sources provide a maximal current 6 A and maximal voltage from 24 V to 140 V. 32 bipolar power supply sources provide maximal current 20 A and maximal voltage 50 V. Additionally the system includes 16 power supply sources with a maximal current 20 A for active correction of current in the main magnets by connecting power supplies to the magnet windings in parallel. The paper will present the description and parameters of power supply system. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups10.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS10",
      "page_number": "102",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPS11",
      "title": "Specifications for a new Electron Cooler for the Antiproton Decelerator (AD)",
      "authors": [
        "G. Tranquille",
        "L.V. Joergensenpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "In October 1979 the first electron cooling experiments at CERN were performed on the Initial Cooling Experiment (ICE) ring. Forty years later",
        "and after two re-incarnations",
        "the same device continues to cool beams of antiprotons on the AD",
        "improving the quality of the particle beams delivered to the different trap experiments. However",
        "with time",
        "it has become increasingly difficult to obtain spare units for this device. Many sub-systems can only be replaced by newly design parts",
        "which can be complicated to integrate in the present device. In addition",
        "some design flaws have become apparent over the last years",
        "which have seriously degraded the availability of the cooler. To ensure the best performance of the antimatter complex at CERN for the coming years",
        "we have decided to build an entirely new state-of-the-art electron cooler operating at higher energies than the present device. The specifications of this new electron cooler and the expected performance will be presented in this paper.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups11.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS11",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPS12",
      "title": "Commissioning the ELENA Electron Cooler",
      "authors": [
        "G. Tranquille",
        "J. Cenede",
        "S. Deschamps",
        "A. Frassier",
        "L.V. Joergensenpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Electron cooling is central to the success of the Extra Low ENergy Antiproton (ELENA) ring which will increase by a factor of up to 100 the number of antiprotons available for the trap experiments. Cooling is needed to reduce or eliminate the emittance blow-up caused by the deceleration process and obtain the small emittance antiproton beams needed for further deceleration and extraction to the experiments. The device that has been installed on ELENA is designed to operate at electron energies below 350 eV in an ultrahigh vacuum environment and with minimum perturbation to the ring. We present the key stages of the commissioning of the cooler (magnetic measurements",
        "installation",
        "setting-up etc.) which culminated in the phase-space cooling of antiprotons in ELENA at energies as low as 100 keV.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups12.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS12",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPS13",
      "title": "The Cascade Transformer for the High-Voltage Electron Cooling System for the NICA Collider",
      "authors": [
        "A.P. Denisov",
        "M.I. Bryzgunov",
        "A.D. Goncharov",
        "V.V. Parkhomchuk",
        "V.B. Reva",
        "D.N. Skorobogatov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The 2.5 MeV electron cooling system for the NICA collider (JINR",
        "Dubna) will use cascade transformers for distributing the power among the sections of the high-voltage column and for transferring power to the high-voltage terminal. The design of the cascade transformer and the measurements of its prototype are described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups13.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS13",
      "page_number": "105",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPS14",
      "title": "Electron Cooling Application for Hadron Therapy",
      "authors": [
        "V.A. Vostrikov",
        "V.V. Parkhomchuk",
        "V.B. Reva",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "V.B. Reva",
        "V.A. Vostrikov",
        "NSU",
        "Novosibirsk",
        "Russia",
        "The project of synchrotron for hadron therapy with electron cooling is developing in Budker Institute of Nuclear Physics. The main goal of project is design of the effective and low cost hadron therapy facility. The electron cooling is applied for ion beam accumullation",
        "cooling and preparation for the slow extraction. The high quality cold ion beam with an extreme small emittance and energy spread allows significantly decrease the synchrotron and beam transfer lines apertures. Moreover",
        "the cooling can be applied for accumulation of short lived radioactive izotopes which can be used for online visualization of treatment."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups14.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS14",
      "page_number": "108",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPS15",
      "title": "The Magnetic System of Electron Coolers of Collider NICA",
      "authors": [
        "V.M. Panasyuk",
        "M.I. Bryzgunov",
        "A.V. Bubley",
        "V.M. Konstantinov",
        "V.Ya. Korchagin",
        "N.S. Kremnev",
        "V.V. Parkhomchuk",
        "S. Pospolita",
        "V.B. Reva",
        "S.I. Ruvinsky",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The complex of electron cooling is created in the BINP SB RAS. Complex is duplex of electron coolers. According to technical specifications total power consumption of the complex should not exceed 500 kW",
        "electron energy from 0.2 to 2.5 MeV",
        "magnetic field in solenoids of cooling up to 2kG",
        "and distance between the centers of solenoids should be 320mm. In general",
        "the layout of this complex is similar to the layout of the cooler created in BINP for COSY",
        "but its production due to the above specifications is much more complicated."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups15.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS15",
      "page_number": "112",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPS16",
      "title": "Laser Cooling of Relativistic Lithium-like 16O5+ Ion Beams at the CSRe",
      "authors": [
        "H.B. Wang",
        "B. Hai",
        "Z. Huang",
        "N. Khan",
        "J. Li",
        "X.N. Li",
        "X. Ma",
        "L.J. Mao",
        "R.S. Mao",
        "W.Q. Wen",
        "J.X. Wu",
        "J.C. Yang",
        "D.Y. Yin",
        "Y.J. Yuan",
        "D. Zhao",
        "T.C. Zhao",
        "X. Zhu",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "HZDR",
        "Dresden",
        "Germany",
        "D.Y. Chen",
        "D. Zhang",
        "H.Y. Zhang",
        "Xidian University",
        "Xi’an",
        "People’s Republic of China",
        "D. Kiefer",
        "S. Klammes",
        "T. Walther",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "S.A. Litvinov",
        "D.F.A. Winters",
        "GSI",
        "Darmstadt",
        "Germany",
        "Laser cooling of Li-like O5+ ion beams with an relativistic energy of 275.7 MeV/u was achieved for the first time at the heavy-ion storage ring CSRe in Lanzhou",
        "China [*",
        "**]. In the experiment",
        "a CW la-ser system with a wavelength of 220 nm was used to interact with the closed 2s1/2-2p1/2 optical transi-tion of O5+ ions. In order to cool the relativistic ion beams with only one counter-propagating CW laser",
        "the ion beams were bunched by applying a sinusoidal voltage to the RF-buncher system. The relative longitudinal momentum spread dp/p of laser-cooled ion beams reached 1×10-6. The O5+ ions are of the highest charge state and highest beam energy that have ever been cooled by laser cooling method. We will present the very recent experimental results on this COOL 2019 workshop. Based on this successful laser cooling experiment",
        "the precision laser spectroscopy experiment of O5+ ions is in preparation at the CSRe. A new optical detector is under design and will be installed at the CSRe to measure the forward-emitted fluorescence by the laser-excited O5+ ions [***",
        "****]. The high voltage of the electron cooler will be precisely calibrated to determine the beam energy. Precision laser spectroscopy of O5+ ions to measure the transition energy of 2s1/2-2p1/2 and 2s1/2-2p3/2 is foreseen",
        "and the relative accuracy could reach 1×10-5.",
        "*Wang H B",
        "et al.",
        "in preparation  **Wen W Q",
        "et al",
        "2019 Hyperfine Interact. 240 45  ***Hannen V",
        "et al.",
        "2013 JINST 8 09018  ****Winters D",
        "et al.",
        "2013 Phys. Scr. T156 014089",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Funding: This work is supported by the NSFC No. U1732141 and 11504388, National Postdoctoral Program for Innovative Talents No. BX201700256, the Youth Innovation Promotion Association CAS."
      ],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups16.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS16",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPS17",
      "title": "Parameter Optimization of Ring Slot Coupler Pickup and Kicker for the NICA Stochastic Cooling System",
      "authors": [
        "K.G. Osipov",
        "I.V. Gorelyshev",
        "A.O. Sidorin",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "V.V. Filimonov",
        "A.O. Sidorin",
        "JINR",
        "Dubna",
        "Russia",
        "I.V. Gorelyshev",
        "A.O. Sidorin",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "St. Petersburg University",
        "St. Petersburg",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Ring Slot Coupler structure is planned to be used as pickup and kicker for the new NICA stochastic cooling system. Design optimization for the device was provided. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups17.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS17",
      "page_number": "116",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPS18",
      "title": "Phase Step Method for Friction Force Measurement in Filter Stochastic Cooling",
      "authors": [
        "I.V. Gorelyshev",
        "A.O. Sidorin",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "V.V. Filimonov",
        "A.V. Shemchuk",
        "JINR",
        "Dubna",
        "Russia",
        "I.V. Gorelyshev",
        "A.O. Sidorin",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "N. Shurkhno",
        "R. Stassen",
        "FZJ",
        "Jülich",
        "Germany"
      ],
      "institutions": [],
      "abstract": "Voltage step method for friction force measurement in electron cooling is well known. The similar method for friction force measurement in longitudinal stochastic cooling with comb filter is provided. First test of the method during the run at COSY has been implemented.",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups18.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS18",
      "page_number": "119",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPS19",
      "title": "Stochastic Cooling Simulation of Rare Isotope Beams on the Spectrometer Ring of the High Energy and High Intensity Accelerator Facility",
      "authors": [
        "X.J. Hu",
        "J.X. Wu",
        "Y.J. Yuan",
        "G. Zhu",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "Among various cooling methods",
        "stochastic cooling is an effective way of cooling low intensity beams with larger size. for the HIAF (High energy and high Intensity Accelerator Facility) project",
        "stochastic cooling will be built on the SRing (Spectrometer Ring).this paper mainly concerns on cooling effect based on different stochastic cooling methods",
        "aiming at finding the optimal cooling method and cooling parameters for different physical experiment purposes. simulation analysis will provide theoretical reference and support for the engineering construction."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups19.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS19",
      "page_number": "123",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPS20",
      "title": "Laser Cooling at Ultrarelativistic Energies and the Gamma Factory Based on the LHC",
      "authors": [
        "CERN",
        "Meyrin",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Partially stripped ions stored in the LHC and resonantly excited by a Doppler-boosted laser pulse can be used as an efficient converter of optical photons into gamma-rays with energies of up to 400 MeV. This process opens the possibility of developing a very intense source of gamma radiation (Gamma Factory project at CERN). The ion beam dynamics in such a facility is strongly affected by the process of laser cooling or heating as the ion emits the radiation. Beam dynamics simulations and other details of the Gamma Factory project at CERN will be presented in this talk."
      ],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups20.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS20",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPS21",
      "title": "Adjusting Unit of Longitudinal Field Coils for NICA HV Electron Cooler’s Solenoid",
      "authors": [
        "N.S. Kremnev",
        "M.I. Bryzgunov",
        "A.V. Bubley",
        "V.M. Panasyuk",
        "V.V. Parkhomchuk",
        "A.A. Putmakov",
        "V.B. Reva",
        "S.V. Shiyankov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "NSU",
        "Novosibirsk",
        "Russia",
        "Adjusting unit of longitudinal field coils is necessary element used to obtaining a rectilinear longitudinal field in cooling solenoids of electron cooling machines. Due to limited distance between cooling channels of HV electron cooler for NICA collider",
        "previously used adjusting unit for longitudinal coil couldn’t been applied. Possible orientation of adjusting unit is 90 degrees rotated and gravity force could not preload longitudinal field coil mounting to make adjusting unit working. New design of preloaded coil mounting unit",
        "made by BINP",
        "solves this problem and provides necessary adjusting range and adjusting precision of longitudinal field coils for NICA HV electron cooler’s solenoid."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2019/talks/tups21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2019/papers/tups21.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2019/posters/tups21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2019-TUPS21",
      "page_number": "127",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "stats": {
    "total_sessions": 1,
    "total_papers": 21,
    "scrape_time": "2025-10-10 17:19:30"
  }
}