{
  "session_info": {
    "id": "WEBL",
    "name": "WEBL - Transverse Profile Monitors",
    "url": "https://proceedings.jacow.org/ibic2016/html/webl.htm"
  },
  "papers": [
    {
      "paper_id": "WEBL01",
      "title": "Beam Diagnostics Challenges for Beam Dynamics Studies",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "This presentation will review the performance and limitations of present beam instrumentation in relation to beam dynamics studies",
        "and give an overview of the main requirements from the accelerator physics community for new or improved measurements that need R&D effort from the beam diagnostics side."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/webl01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/webl01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/webl01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEBL01",
      "page_number": "577",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBL02",
      "title": "Beam Size Measurements Using Interferometry at LHC",
      "authors": [
        "G. Trad",
        "E. Bravin",
        "A. Goldblatt",
        "S. Mazzoni",
        "F. Roncarolo",
        "CERN",
        "Geneva",
        "Switzerland",
        "KEK",
        "Ibaraki",
        "Japan",
        "During the long LHC shutdown 2013-2014",
        "both the LHC and its injector chain underwent significant upgrades. The most important changes concerned increasing the maximum LHC beam energy from 4TeV to 6.5TeV and reducing the transverse emittance of the beam from the LHC injectors. These upgrades pose challenges to the measurement of the transverse beam size via Synchrotron Radiation (SR) imaging",
        "as the radiation parameters approach the diffraction limit. Optical SR interferometry",
        "widely used in synchrotron light facilities",
        "was considered as an alternative method to measure the 150 'm rms beam size at top energy as it allows measurements below the diffraction limit. A system based on this technique was therefore implemented in the LHC",
        "for the first time on a proton machine. This paper describes the design of the LHC interferometer and its two SR sources (a superconducting undulator at low energy and a bending dipole at high energy)",
        "along with the expected performance in terms of beam size measurement as compared to the imaging system. The world's first proton beam interferogram measured at the LHC will be shown and plans to make this an operational monitor will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/webl02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/webl02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/webl02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEBL02",
      "page_number": "583",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBL03",
      "title": "Beam Shape Reconstruction Using Synchrotron Radiation Interferometry",
      "authors": [
        "L. Torino",
        "U. Iriso",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "Synchrotron Radiation Interferometry (SRI) through a double-aperture system is a well known technique to measure the transverse beam size using visible light. In many machines the beam is tilted in the transverse plane",
        "but the SRI technique only allows to directly measure the size of the projection of the beam shape along the axis connecting the two apertures. A method to fully reconstruct the beam in the transverse plane using SRI has been developed and successfully tested at the ALBA synchrotron light source. This report shows the full beam reconstruction technique and presents the results at ALBA. Moreover",
        "we also discuss how this technique could improve the measurement of very small beam sizes",
        "improving the resolution of standard SRI."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/webl03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/webl03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/webl03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEBL03",
      "page_number": "589",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBL04",
      "title": "The New Optical Device for Turn to Turn Beam Profile Measurement",
      "authors": [
        "BINP",
        "Novosibirsk",
        "Russia",
        "A.D. Khilchenko",
        "A.I. Kotelnikov",
        "A.N. Kvashnin",
        "O.I. Meshkov",
        "P.V. Zubarev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "V. Korchuganov",
        "A.I. Stirin",
        "A.G. Valentinov",
        "NRC",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The electron beam quality determines the main synchrotron radiation characteristics therefore beam diagnostics is of great importance for synchrotron radiation source performance. The real-time processing of the electron beam parameters is a necessary procedure to optimize the key characteristics of the source using feedback loops. The frequency of electron beam cycling in the synchrotron storage ring is about 1 MHz. In multi-bunch mode electrons are grouped into a series of bunches. The bunch repetition frequency depends on the total number of bunches and usually reaches hundreds of MHz. The actual problem is to study the separate bunch dimensions behavior under multi-bunch beam instabilities. To solve this problem a turn-to-turn electron beam profile monitor is developed for Siberia-2 synchrotron light source. The linear avalanche photodiodes array is applied to imaging. The apparatus is able to record a transversal profile of selected bunches and analyze the dynamics of beam during 106 turns. The recent experimental results obtained with the diagnostics are described.",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/webl04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/webl04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/webl04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEBL04",
      "page_number": "593",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:52:26"
}