{
  "session_info": {
    "id": "WEOAB2",
    "name": "WEOAB2 - Contributed Oral Presentations (Particle Sources and Alt. Acc. Techniques)",
    "url": "https://proceedings.jacow.org/IPAC2013/html/weoab2.htm"
  },
  "papers": [
    {
      "paper_id": "WEOAB201",
      "title": "Intense Beam Ion Sources Development at IMP",
      "authors": [
        "L.T. Sun",
        "Y. Cao",
        "Y.C. Feng",
        "J.Y. Li",
        "Z.W. Liu",
        "W. Lu",
        "Q. Wu",
        "Y. Yang",
        "W.H. Zhang",
        "X.Z. Zhang",
        "Z.M. Zhang",
        "H.W. Zhao",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "To satisfy the HIRFL (Heavy Ion Research Facility in Lanzhou) accelerators’ requirement and the needs of several other future accelerator facilities",
        "many high beam intensity ion sources have been developed at IMP. The ion sources include intense high charge state ion beam ECR ion sources and high intensity proton beam ECR or microwave sources. This paper will review the high charge state ion sources developed at IMP",
        "especially the recently built fully superconducting ECR ion source SECRAL",
        "and the other classical ion sources and all permanent magnet ion sources will also be discussed. The latest performance of the recently built intense proton ion source which can operate continuously at more than 65emA beam (after LEBT) and 50kV source high voltage for more than 150 hours with very few HV spark intervals will be especially presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weoab201_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weoab201.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weoab201_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEOAB201",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAB202",
      "title": "JEMMRLA - Electron Model of a Muon RLA with Multi-pass Arcs",
      "authors": [
        "S.A. Bogacz",
        "G.A. Krafft",
        "V.S. Morozov",
        "Y. Roblin",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "We propose a demonstration experiment for a new concept of a ‘dogbone’ RLA with multi-pass return arcs – JEMMRLA (Jlab Electron Model of Muon RLA). Such an RLA with linear-field multi-pass arcs was introduced for rapid acceleration of muons for the next generation of Muon Facilities. It allows for efficient use of expensive RF while the multi-pass arc design based on linear combined-function magnets exhibits a number of advantages over separate-arc or pulsed-arc designs. Here we describe a test of this concept by scaling a GeV scale muon design for electrons. Scaling muon momenta by the muon-to-electron mass ratio leads to a scheme",
        "in which a 4.5 MeV electron beam is injected in the middle of a 3 MeV/pass linac with two double-pass return arcs and is accelerated to 18 MeV in 4.5 passes. All spatial dimensions including the orbit distortion are scaled by a factor of 7.5",
        "which arises from scaling the 200 MHz muon RF to a readily available 1.5 GHz. The hardware requirements are not very demanding making it straightforward to implement. Such an RLA may have applications going beyond muon acceleration: in medical isotope production",
        "radiation cancer therapy and homeland security."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weoab202_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weoab202.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weoab202_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEOAB202",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAB203",
      "title": "The PEPPo Concept for a Polarized Positron Source",
      "authors": [
        "LPSC",
        "Grenoble",
        "France",
        "Polarized positron beams are identified as an essential ingredient for the experimental program at the next generation of lepton accelerators (JLab",
        "Super KEK B",
        "ILC",
        "CLIC). A proof-of-principle experiment for a new method to produce polarized positrons has recently been performed at the Jefferson Laboratory. The PEPPo (Polarized Electrons for Polarized Positrons) concept relies on the production of polarized e+e− pairs from the bremsstrahlung radiation of a longitudinally polarized electron beam interacting within a high Z conversion target. The experiment was performed at the injector of the CEBAF accelerator at JLab and investigated the polarization transfer of an 8.3 MeV/c polarized electron beam to positrons produced in varying production target thicknesses. A dedicated new beam-line was constructed to produce",
        "collect and transport positrons in the momentum range of 3.2 MeV/c to 6.2 MeV/c to a polarized iron target for polarization measurements. This technique potentially opens a new pathway for both high energy and thermal polarized positron beams. This presentation will discuss the PEPPo concept",
        "the motivations for the experiment and the preliminary experimental results.",
        "The U.S. Government retains a non-exclusive",
        "paid-up",
        "irrevocable",
        "world-wide license to publish or reproduce this manuscript for U.S. Government purposes."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weoab203_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weoab203.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weoab203_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEOAB203",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 21:26:44"
}