{
  "session_info": {
    "id": "WEAO",
    "name": "WEAO - Technology Review of BPM-Buttons-UHV-Feedthroughs",
    "url": "https://proceedings.jacow.org/ibic2019/html/weao.htm"
  },
  "papers": [
    {
      "paper_id": "WEAO01",
      "title": "Technological Review of Beam Position Button Design and Manufacture",
      "authors": [
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "A workshop in May 2019",
        "hosted by DLS (UK)",
        "reviewed both the design and the manufacturing aspects of beam position monitor (BPM) pick-up buttons with an integrated UHV feedthrough and coaxial connector. The UHV feedthrough technology (e.g. ceramic brazing vs glass-sealing)",
        "the limits on mechanical tolerances",
        "reproducibility and material choices for high reliability were examined by more than 20 diagnostics users of these devices and a number of reputed manufacturers. Calibration techniques and tools and methods for inspection & testing were also assessed. This talk will present the outcome & conclusions of this workshop and identify challenges and opportunities for future BPM manufacture."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2019/talks/weao01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2019/papers/weao01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2019/posters/weao01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2019-WEAO01",
      "page_number": "448",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAO02",
      "title": "Pile-Up Effect of Cold Button BPMs in the European XFEL Accelerator",
      "authors": [
        "D. Lipka",
        "B. Lorbeer",
        "DESY",
        "Hamburg",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The European XFEL facility is in operation with a maximum of 2700 bunches in one train. The highest bunch repetition rate is 4.5 MHz; this corresponds to a minimum time separation of 222 ns. The measurement of the beam properties for each bunch in a train is required. Therefore the beam position monitor (BPM) system needs to separate the signals from each bunch. All BPM types (button, re-entrant and cavity) fulfill this requirement except a few button BPMs installed inside of the cold accelerator module, where Pile-Up from the train can be observed. To identify the cause of this effect we measured the S-parameters during a shutdown of the accelerator, compared it with a similar BPM at the FLASH accelerator but located in a warm section and finally measured the spectrum of the button signal during beam operation. As a result, resonances were found at about 2.46 GHz with relatively high quality factor that remains within the frequency range accepted by the electronics.",
      "presentation_url": "https://proceedings.jacow.org/ibic2019/talks/weao02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2019/papers/weao02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2019/posters/weao02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2019-WEAO02",
      "page_number": "453",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAO03",
      "title": "Development of Beam Position Monitor Using Cherenkov Diffraction Radiation",
      "authors": [
        "K. Nanbu",
        "H. Hama",
        "F. Hinode",
        "S. Kashiwagi",
        "T. Muto",
        "Tohoku University",
        "Research Center for Electron Photon Science",
        "Sendai",
        "Japan",
        "Recently laser-plasma accelerators (LPAs) have attracted a lot of attention and have been developed actively toward practical applications worldwide. LPAs can accelerate electrons to high energy within a very short distance. However",
        "its beam stability is still insufficient as compared with conventional RF accelerators. In addition",
        "beam repetition rate is very low",
        "consequently a beam pulse has to be diagnosed simultaneously with application. Cherenkov Diffraction Radiation (ChDR)",
        "which is the radiation generated when electrons pass near the dielectric material",
        "will offer non-destructive beam diagnostics for LPAs. A basic experimental study on ChDR for developing a novel beam position monitor has been conducted at test accelerator facility",
        "t-ACTS",
        "in Tohoku University. We have investigated characteristics of ChDR from a hollow radiator and an intensity distribution of ChDR with respect to the electron beam position."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2019/talks/weao03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2019/papers/weao03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2019/posters/weao03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2019-WEAO03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEAO04",
      "title": "Beam Measurements at the CERN SPS Using Interferometric Electro-Optic Pickups",
      "authors": [
        "A. Arteche",
        "A. Bosco",
        "S.M. Gibson",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "S.E. Bashforth",
        "A. Bosco",
        "S.M. Gibson",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "M. Krupa",
        "T. Lefèvre",
        "CERN",
        "Geneva",
        "Switzerland",
        "Since 2016 a prototype electro-optic pickup has been installed on the SPS as part of the ongoing development of a high bandwidth electro-optic beam position monitor for the High Luminosity LHC. Following the success of initial beam signal observations with the prototype",
        "improvements of the sensitivity and stability of the pickup have become the main focus of the project. A new concept has been developed which uses an interferometric technique to measure the image field of a passing bunch. One arm of an interferometer passes through an electro-optic lithium niobate crystal",
        "embedded in a pickup",
        "whereas the other arm bypasses. The recombination after the pickup results in an interference pattern that changes as a bunch passes by",
        "due to the electro-optic response of the crystal to the image field. This technique enhances the sensitivity to the field and improves control of the working point. Results from high intensity beams at the SPS are presented. These include a comparison between two different interferometric configurations that were tested on different pickups with similar beam conditions. The stability is assessed by frequency scanning interferometry during beam operation."
      ],
      "institutions": [
        "Funding: Work supported by UK STFC grants ST/N001583/1, JAI at Royal Holloway University of London and CERN."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2019/talks/weao04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2019/papers/weao04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2019/posters/weao04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2019-WEAO04",
      "page_number": "457",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:45:04"
}