{
  "session_info": {
    "id": "THAL",
    "name": "THAL - Feedback Control, Machine Tuning and Optimization II",
    "url": "https://proceedings.jacow.org/icalepcs2021/html/thal.htm"
  },
  "papers": [
    {
      "paper_id": "THAL01",
      "title": "Machine Learning Tools Improve BESSY II Operation",
      "authors": [
        "L. Vera Ramiréz",
        "T. Birke",
        "G. Hartmann",
        "R. Müller",
        "M. Ries",
        "A. Schälicke",
        "P. Schnizer",
        "HZB",
        "Berlin",
        "Germany",
        "At the HZB user facility BESSY II Machine Learning (ML) technologies aim at advanced analysis",
        "automation",
        "explainability and performance improvements for accelerator and beamline operation. The development of these tools is intertwined with improvements of the prediction part of the digital twin instances at BESSY II [*] and the integration into the Bluesky Suite [**",
        "***]. On the accelerator side",
        "several use cases have recently been identified",
        "pipelines designed and models tested. Previous studies applied Deep Reinforcement Learning (RL) to booster current and injection efficiency. RL now tackles a more demanding scenario: the mitigation of harmonic orbit perturbations induced by external civil noise sources. This paper presents methodology",
        "design and simulation phases as well as challenges and first results. Further ML use cases under study are",
        "among others",
        "anomaly detection prototypes with anomaly scores for individual features.",
        "[*] P. Schnizer et. al"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thal01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thal01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thal01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THAL01",
      "page_number": "784",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAL02",
      "title": "Bayesian Techniques for Accelerator Characterization and Control",
      "authors": [
        "R.J. Roussel",
        "A.L. Edelen",
        "C.E. Mayes",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "J.P. Gonzalez-Aguilera",
        "Y.K. Kim",
        "University of Chicago",
        "Chicago",
        "Illinois",
        "USA",
        "Accelerators and other large experimental facilities are complex",
        "noisy systems that are difficult to characterize and control efficiently. Bayesian statistical modeling techniques are well suited to this task",
        "as they minimize the number of experimental measurements needed to create robust models",
        "by incorporating prior",
        "but not necessarily exact",
        "information about the target system. Furthermore",
        "these models inherently take into account noisy and/or uncertain measurements and can react to time-varying systems. Here we will describe several advanced methods for using these models in accelerator characterization and optimization. First",
        "we describe a method for rapid",
        "turn-key exploration of input parameter spaces using little-to-no prior information about the target system. Second",
        "we highlight the use of Multi-Objective Bayesian optimization towards efficiently characterizing the experimental Pareto front of a system. Throughout",
        "we describe how unknown constraints and parameter modification costs are incorporated into these algorithms."
      ],
      "institutions": [
        "Funding: This work was supported by the U.S. National Science Foundation under Award No. PHY-1549132, the Center for Bright Beams."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thal02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thal02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thal02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THAL02",
      "page_number": "791",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAL03",
      "title": "Machine Learning Based Middle-Layer for Autonomous Accelerator Operation and Control",
      "authors": [
        "S. Pioli",
        "B. Buonomo",
        "D. Di Giovenale",
        "C. Di Giulio",
        "L.G. Foggetta",
        "G. Piermarini",
        "LNF-INFN",
        "Frascati",
        "Italy",
        "F. Cardelli",
        "P. Ciuffetti",
        "INFN/LNF",
        "Frascati",
        "Italy",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "The Singularity project",
        "led by National Laboratories of Frascati of the National Institute for Nuclear Physics (INFN-LNF)",
        "aim to develop automated machine-independent middle-layer to control accelerator operation through machine learning (ML) algorithms like Reinforcement Learning (RL) and Cluster integrated with accelerator’s sub-systems. In this work we will present architecture and of the middle-layer made with main purpose to drive user requests through the control framework backend and allow users to enjoy a better User Experience (UX) handling system performances without facing problems due to the interaction with control system. We will report the strategy to develop autonomous operation control with RL algorithms together with the fault detection capability improved by Clustering approach as breakdown and waveguide and RF cavity thermal stability monitor. Results of the first period of operation of this system",
        "currently operating at the electron-positron LINAC of the Dafne complex in Frascati",
        "autonomously controlling accelerator performance in terms of beam transport",
        "beam current optimization and RF cavity phase-jitter compensation will be reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thal03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thal03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thal03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THAL03",
      "page_number": "797",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAL04",
      "title": "Machine Learning Based Tuning and Diagnostics for the ATR Line at BNL",
      "authors": [
        "J.P. Edelen",
        "K. Bruhwiler",
        "E.G. Carlin",
        "C.C. Hall",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "K.A. Brown",
        "V. Schoefer",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "Over the past several years machine learning has increased in popularity for accelerator applications. We have been exploring the use of machine learning as a diagnostic and tuning tool for transfer line from the AGS to RHIC at Brookhaven National Laboratory. In our work",
        "inverse models are used to either provide feed-forward corrections for beam steering or as a diagnostic to illuminate quadrupole magnets that have excitation errors. In this talk we present results on using machine learning for beam steering optimization for a range of different operating energies. We also demonstrate the use of inverse models for optical error diagnostics. Our results are from studies that use combine simulation and measurement data."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thal04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thal04.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thal04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THAL04",
      "page_number": "803",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 18:06:47"
}