{
  "session_info": {
    "id": "TUODB2",
    "name": "TUODB2 - Contributed Oral Presentations (Accelerator Technology)",
    "url": "https://proceedings.jacow.org/IPAC2013/html/tuodb2.htm"
  },
  "papers": [
    {
      "paper_id": "TUODB201",
      "title": "Recent Progress on the Development of a High Gradient RF System using High Impedance Magnetic Alloy, FT3L",
      "authors": [
        "C. Ohmori",
        "K. Hara",
        "K. Hasegawa",
        "M. Toda",
        "M. Yoshii",
        "KEK",
        "Ibaraki",
        "Japan",
        "M. Nomura",
        "A. Schnase",
        "T. Shimada",
        "F. Tamura",
        "M. Yamamoto",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "An upgrade project of J-PARC MR (Main Ring) includes developments of high gradient RF cavities and magnet power supplies for high repetition rate. A dedicated production system for high impedance magnetic alloy (FT3L) cores was assembled in J-PARC. This setup demonstrated that we can produce material with two times higher muQf product compared to the cores used for present cavities. And",
        "the new results also show up to 20% higher impedance than the 2011 production with the former setup. In this summer",
        "the system will be used for mass production of 200 FT3L cores for J-PARC MR. The cores produced in 2011 are already used for standard machine operation. The operation experience shows that the power loss in the cores was reduced significantly as expected. The scenario describing the upgrade plan of MR and the cavity replacements is reported. By the replacement plan",
        "the total acceleration voltage will be almost doubled",
        "while the number of RF stations remains the same."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tuodb201_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tuodb201.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tuodb201_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUODB201",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUODB202",
      "title": "Experiment and Numerical Simulation Results of Plasma Window",
      "authors": [
        "K. Zhu",
        "S. Huang",
        "Y.R. Lu",
        "B.L. Shi",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "A windowless vacuum seal technique has been widely researched and designed",
        "which can connect high pressure cavity to a vacuum condition with rather little thickness of material. As a result",
        "it will reduce most interaction with the particle beam penetrating through comparing to that of foil window. It is desired extensively in experiments using high-intensity heavy ion beams which will break foil window in a short time or in experiments which require the injecting beams with mono-energy and high purity for example. In this work",
        "we study the plasma window in argon which is used as a windowless vacuum sealing device. A numerical 2D FLUENT-based magneto-hydrodynamic model has been developed to investigate the physical reasons of high pressure difference in plasma window. Further",
        "preliminary experimental results are presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tuodb202_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tuodb202.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tuodb202_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUODB202",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUODB203",
      "title": "Dual Chip in Single Module Solid-State Power Amplifier Design for Compact Transmitter Architecture",
      "authors": [
        "T.-C. Yu",
        "L.-H. Chang",
        "M.H. Chang",
        "L.J. Chen",
        "F.-T. Chung",
        "M.-C. Lin",
        "Y.-H. Lin",
        "Z.L. Liu",
        "C.H. Lo",
        "M.H. Tsai",
        "Ch. Wang",
        "T.-T. Yang",
        "M.-S. Yeh",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "At present",
        "the high power solid-state technique transmitter design are composed of hundreds parallel combined single chip for hundreds Watts power modules to achieve enough output power. Although the large numbers can bring high redundancy during system operation",
        "the power hungry of next generation RF system of accelerator would need much more modules to reach its power requirement. Huge amount of power modules would bring the complexity and difficulty in power combining",
        "system construction",
        "management and maintenance. To overcome this problem",
        "upgrading the power level of a single module could be the solution. Besides depending on the power level growing with technology advancement in semiconductor industry",
        "a circuit level solution to combine dual chip in advance in a single PCB board is proposed to produce twice power as single chip. Such feasible solution can overcome the over-complexity of future several-hundreds kW solid-state transmitter design."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tuodb203_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tuodb203.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tuodb203_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUODB203",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 21:16:34"
}