{
  "session_info": {
    "id": "THBPP",
    "name": "THBPP - Experiment Control 2",
    "url": "https://proceedings.jacow.org/icalepcs2019/html/thbpp.htm"
  },
  "papers": [
    {
      "paper_id": "THBPP01",
      "title": "Building the Control System to Operate the Cryogenic Near Infrared Spectropolarimeter Instrument for the Daniel K. Inouye Solar Telescope",
      "authors": [
        "R.J. Williams",
        "A.J. Borrowman",
        "A. Greer",
        "A. Yoshimura",
        "OSL",
        "St Ives",
        "Cambridgeshire",
        "United Kingdom",
        "A. Fehlmann",
        "B.D. Goodrich",
        "J.R. Hubbard",
        "DKIST/NSO",
        "Boulder",
        "Colorado",
        "USA",
        "University of Hawaii",
        "Institute for Astronomy",
        "Pukalani",
        "Hawaii",
        "USA",
        "The Cryogenic Near Infrared Spectropolarimeter (Cryo-NIRSP) will be one of the first light instruments on the Daniel K. Inouye Solar Telescope (DKIST) currently under construction in Hawaii. Cyro-NIRSP is a near- and thermal- IR imager and spectrograph operating in a cryogenic environment. It will be used to study the faint solar coronal magnetic field across a large field-of-view. Such a complex and precise instrument demands equal requirements from the control system. The control system must handle the many sub-components (e.g. cameras",
        "polarimeter",
        "mirrors) and bring them all together to manage the setup",
        "timings",
        "synchronization",
        "real time motion and overall monitoring. It is built within the pre-defined DKIST software framework",
        "which provides consistency across all instruments. This paper will discuss how such a control system has been achieved for the Cryo-NIRSP instrument detailing some of the challenges that were overcome relating to the synchronization of specific components and the complex inter-dependencies between configurables. It will also touch on the data processing and visualization software development for the end-to-end functioning of the instrument."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/thbpp01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/thbpp01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/thbpp01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-THBPP01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THBPP02",
      "title": "DonkiOrchestra: A Software Trigger-Driven Framework for Data Collection and Experiment Management Based on Zeromq Distributed Messaging",
      "authors": [
        "R. Borghes",
        "F. Billè",
        "V. Chenda",
        "G. Kourousias",
        "M. Prica",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "Synchrotron end-stations consist of a complex network of devices. The setup is not static and is often upgraded. The data acquisition systems are constantly challenged by such changes and upgrades",
        "so scalability and flexibility are crucial skills. DonkiOrchestra is a ZeroMQ-based framework for data acquisition and experiment control based on an advanced software trigger-driven paradigm. In the DonkiOrchestra approach a software device",
        "referred to as Director",
        "provides the logical organization of the experiment as a sequential workflow relying on triggers. Each software trigger activates a set of Actor devices that can be hierarchically organized according to different priority levels. Data acquired by the Actors is tagged with the trigger number and stored in HDF5 archives. The intrinsic asynchronicity of ZeroMQ maximizes the opportunity of performing parallel operations and sensor readouts. This paper describes the software architecture behind DonkiOrchestra",
        "which is fully configurable and scalable",
        "so it can be reused on multiple endstations and facilities. Furthermore",
        "experimental applications at Elettra beamlines and future developments are presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/thbpp02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/thbpp02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/thbpp02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-THBPP02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THBPP03",
      "title": "Deep Learning Methods on Neutron Scattering Data",
      "authors": [
        "P. Mutti",
        "F. Cecillon",
        "Y. Le Goc",
        "G. Song",
        "ILL",
        "Grenoble",
        "France",
        "Recently",
        "by using deep learning methods",
        "computers are able to surpass or come close to matching human performance on image analysis and pattern recognition. This advanced method could also help interpreting data from neutron scattering experiments. Those data contain rich scientific information about structure and dynamics of materials under investigation",
        "and deep learning could help researchers better understand the link between experimental data and materials properties. We applied deep learning techniques to scientific neutron scattering data. This is a complex problem due to the multi-parameter space we have to deal with. We have used a convolutional neural network-based model to evaluate the quality of experimental neutron scattering images",
        "which can be influenced by instrument configuration",
        "sample and sample environment parameters. Sample structure can be deduced during data collection that can be therefore optimized. The neural network model can predict the experimental parameters to properly setup the instrument and derive the best measurement strategy. This results in a higher quality of data obtained in a shorter time",
        "facilitating data analysis and interpretation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/thbpp03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/thbpp03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/thbpp03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-THBPP03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THBPP04",
      "title": "Hard X-Ray Pair Distribution Function (PDF) Beamline and End-Station Control System",
      "authors": [
        "O. Ivashkevych",
        "M. Abeykoon",
        "J. Adams",
        "G. Bischof",
        "E.D. Dooryhee",
        "J. Li",
        "R. Petkus",
        "J.T. Trunk",
        "Z. Yin",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "PDF beamline is a new addition to Diffraction and In Situ Scattering program. Its state-of-the-art end-station gantry system has two detector stages and one sample environment with 3 m travel rated for 200 kg each. Detectors and environment stages move with 300 mm/s. Linear Brushless DC motors are controlled by Geo Brick LV Delta Tau motor-controller. Stages are equipped with absolute encoders and proximity sensors to avoid collisions. Control system slows the stages down when proximity switches are activated and moves 300 mm/s otherwise. A complex controls and safety system with many custom features is required to provide the full functionality of the gantry system and to protect equipment and users. An optics condition module located upstream of the gantry system contain beam defining slits",
        "a fast shutter that is synchronized with detector frame rate",
        "an alignment LASER",
        "and an X-ray Energy Calibration System. The controls system of the OCM supports automatic operation of the ECS followed by unexpected beam dumps to recalibrate the X-ray wavelength. This contribution will discuss the details of the control system design",
        "implementation",
        "challenges",
        "and first user experience."
      ],
      "institutions": [
        "Funding: National Synchrotron Light Source, a U.S. Department of Energy (DOE) Office of Science User Facility operated by Brookhaven National Laboratory under Contract No. DE-AC02-98CH10886."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/thbpp04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/thbpp04.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/thbpp04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-THBPP04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THBPP05",
      "title": "Implementing Odin as a Control and Data Acquisition Framework for Eiger Detectors",
      "authors": [
        "G.D. Yendell",
        "U.K. Pedersen",
        "M.P. Taylor",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "OSL",
        "St Ives",
        "Cambridgeshire",
        "United Kingdom",
        "A.B. Neaves",
        "T.C. Nicholls",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The increasing data throughput of modern detectors is a growing challenge for back-end data acquisition systems. OdinData provides a scalable framework for data acquisition used by multiple beamlines at Diamond Light Source (DLS). While it can be implemented standalone",
        "OdinControl is used to provide a convenient interface to OdinData. Eiger detectors at DLS were initially integrated into the Odin framework specifically for the data acquisition capability",
        "but the addition of detector control provides a more coherent and easily deployable system. OdinControl provides a generic HTTP API as a single point of control for various devices and applications. Adapters can abstract the low-level control of a detector into a consistent API",
        "making it easier for high-level applications to support different types of detector. This paper sets out the design and development of Odin as a control system agnostic interface to integrate Eiger detectors into EPICS beamline control systems at DLS",
        "as well as the current status of operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/thbpp05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/thbpp05.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/thbpp05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-THBPP05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-10 18:13:32"
}