{
  "session_info": {
    "id": "MOAL",
    "name": "MOAL - Introduction and News",
    "url": "https://proceedings.jacow.org/IBIC2013/html/moal.htm"
  },
  "papers": [
    {
      "paper_id": "MOAL1",
      "title": "Welcome and Overview of Accelerators in the UK",
      "authors": [
        "Diamond",
        "Oxfordshire",
        "United Kingdom",
        "A warm welcome will be given to participants of the second International Beam Instrumentation Conference (IBIC 2013)",
        "hosted by Diamond Light Source. An attempt will be made to make an overview of accelerators in the UK",
        "from their early origins to the present day and what might lie ahead in the future."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/moal1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/moal1.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/moal1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-MOAL1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOAL2",
      "title": "The First Demonstration of EOS 3D-BCD Monitor to Maximize 3D-Overlapping for HHG-Seeded FEL",
      "authors": [
        "H. Tomizawa",
        "T. Ishikawa",
        "K. Ogawa",
        "H. Tanaka",
        "M. Yabashi",
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "S. Matsubara",
        "Y. Okayasu",
        "T. Togashi",
        "JASRI/SPring-8",
        "Hyogo",
        "Japan",
        "In FEL seeding as a full-coherent light source",
        "a high hit rate of successfully seeded FEL pulses is required. Precise measurements of the electron bunch charge distribution (BCD) and its arrival timing are crucial keys to maximize and keep 3D overlapping between the high-order harmonics (HH) laser pulse and electron bunch. We constructed a relative timing drift monitor based on EOS",
        "which measured the timing differences between the seeding HH-laser pulse and the electron bunch",
        "using a common external laser source of both HH-driving and EO-probing pulses. The feedback system of timing drift was realized with real-time data processing of EO-signal spectra. Our system realized stable seeded FEL operation with a hit rate of 30%. The 3D-BCD monitor enables non-destructive measurements of the longitudinal and transverse BCD at the same time. The transverse detection can be used to control the relative pointing between HH-pulse and electron bunch. We also verified this transverse detection with multiple EO crystals at the EUV-FEL accelerator. Our next target for temporal resolution is 30 fs",
        "with an octave-band EO-probing for DAST crystals",
        "aiming FEL seeding in the soft X-ray region."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/moal2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/moal2.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/moal2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-MOAL2",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOAL3",
      "title": "Diagnostic for a High Repetition Rate Electron Photo-Gun and First Measurements",
      "authors": [
        "D. Filippetto",
        "S. De Santis",
        "L.R. Doolittle",
        "G. Huang",
        "W.E. Norum",
        "G.J. Portmann",
        "H.J. Qian",
        "F. Sannibale",
        "R.P. Wells",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The APEX electron source at LBNL combines the high-repetition-rate with the high beam brigthness typical of photo-guns",
        "delivering low emittance electron pulses at MHz frequency. Proving the high beam quality of the beam is an essential step for the success of the experiment",
        "opening the doors of the high average power to brightness-hungry applications as X-Ray FELs",
        "MHz ultrafast electron diffraction etc. As first step",
        "a full 6D characterization of the beam is foreseen at the Gun beam energy of 750 keV. Diagnostics for low and high current measurements have been installed and tested",
        "and measurements of cathode lifetime and thermal emittance in a RF environment are currently being commissioned. The recently installed double slit system will allow the measurements of beam emittance at full current (mA). Also a deflecting cavity and a high precision spectrometer are foreseen at low energy",
        "allowing the exploration of the longitudinal phase space. Here we discuss the present layout of the machine and future upgrades",
        "showing the latest results at low and high repetition rate",
        "together with the tools and techniques used."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/moal3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/moal3.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/moal3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-MOAL3",
      "page_number": "4",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOAL4",
      "title": "First Results from the Bunch Arrival-Time Monitor at the SwissFEL Test Injector",
      "authors": [
        "V.R. Arsov",
        "M.M. Dehler",
        "S. Hunziker",
        "M.G. Kaiser",
        "V. Schlott",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Non-destructive electron bunch arrival-time monitors (BAMs) with resolution <10 fs",
        "sensitivity down to 10 pC and high intrinsic bandwidth for double bunch detection are required for reliable operation of SwissFEL. To achieve this ultimate goal",
        "such a monitor based on a Mach-Zehnder electro-optical intensity modulator has been under development at the SwissFEL Test Injector. The high timing precision is derived by a stable pulsed optical reference system. The first BAM is located before the bunch compressor where the bunch energy is 230 MeV and the pulse length is approximately 3 ps. At this position",
        "the bunch arrival time is sensitive to the laser- and gun timing. In this paper",
        "we report on the commissioning of the RF- and optical front ends",
        "the first arrival-time jitter and drift measurements with the entire system",
        "as well as correlation of the arrival-time with different machine and environmental parameters. We achieve a resolution of 20 fs down to 60 pC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/moal4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/moal4.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/moal4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-MOAL4",
      "page_number": "8",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:58:11"
}