{
  "session_info": {
    "id": "WEOB",
    "name": "WEOB - Beam Physics for FEL",
    "url": "https://proceedings.jacow.org/FEL2012/html/weob.htm"
  },
  "papers": [
    {
      "paper_id": "WEOB02",
      "title": "Optical Diffraction Radiation Interference as a Non-intercepting Emittance Measurement for High Brightness and High Repetition Rate Electron Beam",
      "authors": [
        "A. Cianchi",
        "L. Catani",
        "E. Chiadroni",
        "INFN-Roma II",
        "Roma",
        "Italy",
        "V. Balandin",
        "N. Golubeva",
        "K. Honkavaara",
        "G. Kube",
        "DESY",
        "Hamburg",
        "Germany",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "URLS",
        "Rome",
        "Italy",
        "Conventional intercepting transverse electron beam diagnostics",
        "as the one based on Optical Transition Radiation (OTR)",
        "cannot tolerate high power beams without significant mechanical damages of the diagnostics device. Optical Diffraction Radiation (ODR)",
        "instead",
        "is an excellent candidate for the measurements of the transverse phase space parameters in a non-intercepting way. One of the main limitation of this method is the low signal to noise ratio",
        "mainly due to the synchrotron radiation background. This problem can be overcome by using ODRI (ODR Interference). In this case the beam goes through slits opened in two metallic foils placed at a distance shorter than the radiation formation zone. Due to the shielding effect of the first screen a nearly background-free ODR interference pattern can be measured allowing the determination of the beam size and the angular divergence. We report here the result of the first measurements of the beam emittance using ODRI carried out at FLASH (DESY). Our result demonstrate the unique potential of this technique suitable to be used as not intercepting diagnostic in every machine with high brightness and high repetition rate electron beam."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/weob02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/weob02.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/weob02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-WEOB02",
      "page_number": "353",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOB03",
      "title": "Laser-induced CSR : Seeding of the Microbunching Instability in Storage Rings",
      "authors": [
        "E. Roussel",
        "S. Bielawski",
        "C. Evain",
        "C. Szwaj",
        "T. Tanikawa",
        "PhLAM/CERCLA",
        "Villeneuve d'Ascq Cedex",
        "France",
        "M. Adachi",
        "M. Katoh",
        "UVSOR",
        "Okazaki",
        "Japan",
        "M. Hosaka",
        "N. Yamamoto",
        "Nagoya University",
        "Nagoya",
        "Japan",
        "CERLA",
        "Villeneuve d'Ascq",
        "France",
        "Kyoto University",
        "Institute for Advanced Energy",
        "Kyoto",
        "Japan",
        "Microbunching instability arises both in Linear Free Electron Laser and in storage rings due to the interaction of the electrons with their own radiation",
        "mainly in dipoles (bending magnets in storage rings and chicanes in linear FEL). This instability leads to the formation of micro-structures in the longitudinal phase-space (typically in the mm range in the longitudinal profile) and limits the performances of these accelerator based ligth sources. We show that the interaction of the electron bunch with an external laser pulse",
        "whose envelope is modulated at a Terahertz frequency (associated to mm wavelength)",
        "allows to investigate the dynamics of electron bunches in storage rings during the micro-bunching instability. Here",
        "we achieve experiments at UVSOR-II* around the CSR instability threshold. We also perform numerical calculations using a one-dimensional Fokker-Planck-Vlasov modeling taking into account CSR wakefield. This seeding mechanism highlights that CSR depends on the wakefields for some ranges of excited wavenumber.",
        "* C. Evain et al.",
        "Phys. Rev. ST Accel. Beams 13",
        "090703 (2010); S. Bielawski et al.",
        "Nature Physics 4",
        "390 (2008)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/weob03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/weob03.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/weob03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-WEOB03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEOB04",
      "title": "First Observation of Optical Current Noise Suppression Below the Shot-Noise Limit",
      "authors": [
        "A. Gover",
        "E. Dyunin",
        "University of Tel-Aviv",
        "Faculty of Engineering",
        "Tel-Aviv",
        "Israel",
        "University of Tel Aviv",
        "Tel Aviv",
        "Israel",
        "We report first demonstration of optical frequency current shot-noise suppression in a relativistic e-beam. The effect was demonstrated by measuring sub-linear growth of OTR Radiation as a function of current. This finding indicates that the beam charge homogenizes",
        "and its distribution becomes sub-Poissonian. The effect is made possible by collective Coulomb interaction between the electrons of a cold intense beam during beam drift",
        "and is essentially a process of longitudinal beam-plasma oscillation[1]. Suppression of beam current noise below the classical \"shot-noise\" level has been known in the microwave tubes art[2]. This is the first time that it is demonstrated in the optical regime. We predict that the scheme can be extended to the XUV and possibly to shorter wavelengths with further development of technology. The fundamental current shot-noise determines the level of incoherent spontaneous radiation emission from e-beam radiators and SASE-FELs. Suppressing shot-noise would make it possible to attain spontaneous emission sub-radiance[3] and surpass the shot-noise coherence limits of seed-injected FELs",
        "approaching fundamental (Schawlow-Towenes[4]) coherence limits of lasers.",
        "[1] A. Gover",
        "E. Dyunin",
        "PRL",
        "102",
        "154801",
        "2009  [2] H. Haus",
        "N. Robinson",
        "Proc. IRE",
        "43",
        "981 (1955)  [3] A. Dicke",
        "Phys. Rev. 93",
        "99 (1954)  [4] A.L.Schawlow and C.H.Townes",
        "Phys. Rev.",
        "112",
        "1940"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/weob04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/weob04.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/weob04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-WEOB04",
      "page_number": "357",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:34:44"
}