{
  "session_info": {
    "id": "TUPMY",
    "name": "TUPMY - Poster Session",
    "url": "https://proceedings.jacow.org/ipac2016/html/tupmy.htm"
  },
  "papers": [
    {
      "paper_id": "TUPMY001",
      "title": "Very Low Emittance Muon Beam using Positron Beam on Target",
      "authors": [
        "M. Antonelli",
        "M.E. Biagini",
        "M. Boscolo",
        "A. Variola",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "INFN-Ferrara",
        "Ferrara",
        "Italy",
        "INFN-Roma",
        "Roma",
        "Italy",
        "ESRF",
        "Grenoble",
        "France",
        "Muon beams are customarily obtained via K/π decays produced in proton interaction on target. In this paper we investigate the possibility to produce low emittance muon beams from electron-positron collisions at centre-of-mass energy just above the μ+{+}μ+{-} production threshold with maximal beam energy asymmetry",
        "corresponding to a positron beam of about 45 GeV interacting on electrons on target. Performances on both amorphous and crystal target are presented",
        "and the general scheme for the muon production will be given. We present the main features of this scheme with a first preliminary evaluation of the performances that could be achieved by a multi-TeV muon collider."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy001.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY002",
      "title": "APF IH-DTL Design for the Muon LINAC in the J-PARC Muon g-2/EDM Experiment",
      "authors": [
        "M. Otani",
        "T. Mibe",
        "M. Yoshida",
        "KEK",
        "Tsukuba",
        "Japan",
        "K. Hasegawa",
        "Y. Kondo",
        "JAEA",
        "Ibaraki-ken",
        "Japan",
        "RLNR",
        "Tokyo",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "University of Tokyo",
        "Tokyo",
        "Japan",
        "J-PARC",
        "KEK & JAEA",
        "Ibaraki-ken",
        "Japan",
        "The muon linac for the J-PARC muon g-2/EDM experiment consists of RFQ (324 MHz)",
        "IH-DTL (324 MHz)",
        "DAW coupled cell linac (1.3 GHz)",
        "and disk loaded structure (1.3 GHz). Because muon has finite life time",
        "the muons should be accelerated in a sufficiently short period. To realize fast acceleration",
        "Alternative Phase Focusing (APF) scheme is adopted in IH-DTL in which the muons are accelerated from 0.34 MeV to about 4 MeV. In this poster",
        "the design of the APF IH-DTL for muon acceleraiton with the computer calculation will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY003",
      "title": "Development of Muon LINAC for the Muon g-2/EDM Experiment at J-PARC",
      "authors": [
        "M. Otani",
        "T. Mibe",
        "F. Naito",
        "N. Saito",
        "M. Yoshida",
        "KEK",
        "Tsukuba",
        "Japan",
        "K. Hasegawa",
        "T. Ito",
        "Y. Kondo",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "RLNR",
        "Tokyo",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "University of Tokyo",
        "Tokyo",
        "Japan",
        "Precision measurements of the muon's anomalous magnetic moment (g-2) and electric dipole moment (EDM) are effective ways to cast light on beyond the standard model of elementary particle physics. The J-PARC E34 experiment aims to measure g-2 with a precision of 0.1 ppm and search for EDM with a sensitivity to 10-{-21} e· cm with high intensity proton beam at J-PARC and a novel technique of making a muon beam with small emittance (the ultra-cold muon beam). The ultra-cold muon beam is generated from a surface muon beam by the thermal muonium (30 meV) production followed by the laser ionization",
        "and acceleration to 212 MeV or 300 MeV/c by the muon dedicated LINAC. The muon LINAC consists of RFQ",
        "inter-digital IH",
        "Disk And Washer (DAW) coupled cell and disk loaded structure. The ultra-cold muons will have an extremely small transverse momentum spread of less than 1 % with a normalized transverse emittance of around 1.5 pi mm-mrad. The muon acceleration to 300 MeV/c will be the first case in the world and it will be one of the base technologies of future accelerator programs. In this talk",
        "design and status of the muon LINAC will be reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy003.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY004",
      "title": "The MICE Demonstration of Muon Ionization Cooling",
      "authors": [
        "J.-B. Lagrange",
        "C. Hunt",
        "J. Pasternakpresenter",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "INFN-Napoli",
        "Napoli",
        "Italy",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Muon beams of low emittance provide the basis for the intense",
        "well-characterised neutrino beams necessary to elucidate the physics of flavour at the Neutrino Factory and to provide lepton-antilepton collisions up to several TeV at the Muon Collider. The international Muon Ionization Cooling Experiment (MICE) will demonstrate muon ionization cooling",
        "the technique proposed to reduce the phase-space volume occupied by the muon beam at such facilities. In an ionization-cooling channel",
        "the muon beam traverses a material (the absorber) loosing energy",
        "which is replaced using RF cavities. The combined effect is to reduce the transverse emittance of the beam (transverse cooling). The configuration of MICE required to deliver the demonstration of ionization cooling is being prepared in parallel to the execution of a programme designed to measure the cooling properties of liquid-hydrogen and lithium hydride. The design of the cooling-demonstration experiment will be presented together with a summary of the performance of each of its components and the cooling performance of the experiment."
      ],
      "institutions": [],
      "abstract": "J. Pasternakpresenter Submitted by the MICE speakers bureau that will identify later a member of the collaboration to present the contribution reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy004.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY005",
      "title": "A Muon Source Proton Driver at JPARC-based Parameters",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "An \"ultimate\" high intensity proton source for neutrino factories and/or muon colliders was projected to be a ~4 MW multi-GeV proton source providing short",
        "intense proton pulses at ~15 Hz. The JPARC ~1 MW accelerators provide beam at parameters that in many respects overlap these goals. Proton pulses from the JPARC Main Ring can readily meet the pulsed intensity goals. We explore these parameters",
        "describing the overlap and consider extensions that may take a JPARC-like facility toward this \"ultimate\" source. JPARC itself could serve as a stage 1 source for such a facility."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy005.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY006",
      "title": "MICE Step IV Optics without the M1 Coil in SSD",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The international Muon Ionization Cooling Experiment (MICE) will demonstrate ionization cooling",
        "the only technique that",
        "given the short muon lifetime",
        "can reduce the phase-space volume occupied by a muon beam quickly enough. MICE will demonstrate cooling in two steps. In the first one",
        "Step IV",
        "MICE will study the multiple Coulomb scattering in liquid hydrogen (LH2) and lithium hydride (LiH). A focus coil module will provide focussing on the absorber. The transverse emittance will be measured upstream and downstream of the absorber in two spectrometer solenoids (SS). Magnetic fields generated by two match coils in the SSs allow the beam to be matched into a flat-field regions in which the tracking detectors are installed. An incident in September 2015 rendered matching coil \\#1 (M1D) of the downstream spectrometer inoperable. A new Step IV lattice without M1D and its optimization via a Genetic Algorithm (GA) will be described in this paper."
      ],
      "institutions": [
        "Funding: Fermi National Accelerator Laboratory"
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy006.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY008",
      "title": "Phase Rotation of Muon Beams for Producing Intense Low-energy Muon Beams",
      "authors": [
        "Y. Bao",
        "Y. Bao",
        "G. Hansen",
        "UCR",
        "Riverside",
        "California",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Low-energy muon beams are useful for rare decay researches",
        "providing access to new physics that cannot be addressed at high-energy colliders. However",
        "the large initial energy spread of the muon beam greatly limits the efficiency of muon applications. In this paper we outline a phase rotation method to significantly increase the intensity of low-energy muons. The muons are first produced by a short pulsed proton driver",
        "and after a drift channel they form a time-momentum correlation. A series of rf cavities is used to bunch the muons and then phase rotate the bunches so that all the bunches reaches a momentum around 100 MeV/c. Then another group of rf cavities is used to decelerate the muon bunches to low-energy. Such a method produces low-energy muons with an efficiency of 0.1 muon per 8 GeV proton",
        "which is significantly higher than the current Mu2e experiment at Fermilab",
        "and it provides the possibility for the next generation rare decay researches."
      ],
      "institutions": [],
      "abstract": "D.V. Neufferpresenter reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy008.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY009",
      "title": "MuSim, a Graphical User Interface for Multiple Simulation Programs",
      "authors": [
        "T.J. Roberts",
        "M.A.C. Cummings",
        "R.P. Johnson",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "MuSim is a new user-friendly program designed to interface to many different particle simulation codes",
        "regardless of their data formats or geometry descriptions. It presents the user with a compelling graphical user interface that includes a flexible 3-D view of the simulated world plus powerful editing and drag-and-drop capabilities. All aspects of the design can be parametrized so that parameter scans and optimizations are easy. It is simple to create plots and display events in the 3-D viewer (with a slider to vary the transparency of solids)",
        "allowing for an effortless comparison of different simulation codes. Simulation codes: G4beamline",
        "MAD-X",
        "and MCNP; more coming. Many accelerator design tools and beam optics codes were written long ago",
        "with primitive user interfaces by today's standards. MuSim is specifically designed to make it easy to interface to such codes",
        "providing a common user experience for all",
        "and permitting the construction and exploration of models with very little overhead. For today's technology-driven students",
        "graphical interfaces meet their expectations far better than text-based tools",
        "and education in accelerator physics is one of our primary goals."
      ],
      "institutions": [],
      "abstract": "D.V. Neufferpresenter reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy009.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY010",
      "title": "Status of Mice Step IV",
      "authors": [
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "Muon beams of low emittance provide the basis for the intense",
        "well characterised neutrino beams of the Neutrino Factory and for lepton-antilepton collisions at energies of up to several TeV at a Muon Collider. The international Muon Ionization Cooling Experiment (MICE) will demonstrate ionization cooling–the technique by which it is proposed to reduce the phase-space volume occupied by the muon beam. MICE is being constructed in a series of Steps. The configuration currently in operation at the Rutherford Appleton Laboratory is optimised for the study the properties of liquid hydrogen and lithium hydride that affect cooling. The plans for data taking in the present configuration will be described together with a summary of the status of preparation of the experimental configuration by which MICE will demonstration the principle of ionization cooling."
      ],
      "institutions": [],
      "abstract": "Submitted by the MICE speakers bureau that will identify later a member of the collaboration to present the contribution reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY011",
      "title": "Simulated Measurements of Cooling in Muon Ionization Cooling Experiment",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy011.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY012",
      "title": "Hybrid Methods for Simulation of Muon Ionization Cooling Channels",
      "authors": [
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "M. Berz",
        "K. Makino",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "COSY Infinity is an arbitrary-order beam dynamics simulation and analysis code. It can determine high-order transfer maps of combinations of particle optical elements of arbitrary field configurations. New features are being developed for inclusion in COSY to follow the distribution of charged particles through matter. To study in detail some of the properties of muons passing through material",
        "the transfer map approach alone is not sufficient. The interplay of beam optics and atomic processes must be studied by a hybrid transfer map–Monte Carlo approach in which transfer map methods describe the deterministic behavior of the particles in the accelerator channel",
        "and Monte Carlo methods are used to model the stochastic processes intrinsic to liquid and solid absorbers. The advantage of the new approach is that the vast majority of the dynamics is represented by fast application of the high-order transfer map of an entire element and accumulated stochastic effects. The gains in speed are expected to simplify the optimization of muon cooling channels which are usually very computationally demanding. Progress on the development of the required algorithms is reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy012.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY013",
      "title": "Progress on Beam-Plasma Effect Simulations in Muon Ionization Cooling Lattices",
      "authors": [
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "New computational tools are essential for accurate modeling and simulation of the next generation of muon based accelerator experiments. One of the crucial physics processes specific to muon accelerators that has not yet been implemented in any current simulation code is beam induced plasma effect in liquid",
        "solid",
        "and gaseous absorbers. We report here on the progress of developing the required simulation tools and applying them to study the properties of plasma and its effects on the beam in muon ionization cooling channels."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy013.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY014",
      "title": "Muon Acceleration Concepts for Future Neutrino Factory",
      "authors": [
        "JLab",
        "Newport News",
        "Virgina",
        "USA",
        "Here",
        "we summarize current state of concept for muon acceleration aimed at future Neutrino Factory. The main thrust of these studies was to reduce the overall cost while maintaining performance through exploring interplay between complexity of the cooling systems and the acceptance of the accelerator complex. To ensure adequate survival of the short-lived muons",
        "acceleration must occur at high average gradient. The need for large transverse and longitudinal acceptances drives the design of the acceleration system to initially low RF frequency",
        "e.g. 325 MHz",
        "and then increased to 650 MHz",
        "as the transverse size shrinks with increasing energy. High-gradient normal conducting RF cavities at these frequencies require extremely high peak-power RF sources. Hence superconducting RF (SRF) cavities are chosen. Here",
        "we considered two cost effective schemes for accelerating muon beams for a stagable Neutrino Factory: Exploration of the so-called 'dual-use' linac concept",
        "where the same linac structure is used for acceleration of both H− and muons and alternatively",
        "the SRF efficient design based on multi-pass (4.5) 'dogbone' RLA",
        "extendable to multi-pass FFAG-like arcs."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy014.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY015",
      "title": "Ultrafast Electron Guns for the Efficient Acceleration using Single-Cycle THz Pulses",
      "authors": [
        "A. Fallahi",
        "F.X. Kärtner",
        "A. Yahaghipresenter",
        "CFEL",
        "Hamburg",
        "Germany",
        "DESY",
        "Hamburg",
        "Germany",
        "Over the past decades",
        "advances in ultrafast technologies led to the production of intense ultrashort THz to optical pulses reaching single-cycle pulse duration. Using such pulses for electron acceleration offers advantages in terms of higher thresholds for materials breakdown",
        "thus introducing a promising path towards increasing acceleration gradients. Conventional accelerator technology is based on either continuous wave or long pulse operation",
        "where resonant or guiding structures are usually employed. We introduce novel structures for electron acceleration which operate with single-cycle pulses named as single-cycle ultrafast guns. The operating frequencies considered here are at THz wavelengths inspired by the recent progress in the optical generation of intense single-cycle THz pulses. We begin with designing guns for low energy pulses and proceed with structures designed for high energy pulses. More importantly",
        "it is shown that the already achieved THz pulse energies of 20 uJ are enough to realize relativistic fields for electron acceleration. These structures will underpin future devices for fabricating miniaturized electron guns and linear accelerators."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy015.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY016",
      "title": "Design of a Collection and Selection System for High Energy Laser-driven Ion Beams",
      "authors": [
        "F. Schillaci",
        "L. Allegra",
        "A. Amato",
        "L. Andò",
        "G.A.P. Cirronepresenter",
        "M. Costa",
        "G. Cuttone",
        "G. De Luca",
        "G. Gallo",
        "J. Pipek",
        "F. Romano",
        "INFN/LNS",
        "Catania",
        "Italy",
        "G. Korn",
        "D. Margarone",
        "V. Scuderi",
        "ELI-BEAMS",
        "Prague",
        "Czech Republic",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "Laser-target acceleration represents a very promising alternative to conventional accelerators for several potential applications",
        "from the nuclear physics to the medical ones. However",
        "some extreme features",
        "not suitable for multidisciplinary applications",
        "as the wide energy and angular spreads are typical of optically accelerated ion beams. Therefore",
        "beyond the improvements at the laser-target interaction level",
        "a lot of efforts have been recently devoted to the development of specific beam-transport devices in order to obtain controlled and reproducible output beams. In this framework",
        "a three years contract has been signed between INFN-LNS (IT) and Eli-Beamlines-IoP (CZ) to provide the design and the realization of a complete transport beam-line",
        "named ELIMED",
        "dedicated to the transport",
        "diagnostics and dosimetry of laser-driven ion beams. The transport devices will be composed by a set of super-strong permanent magnet quadrupoles able to collect and focus laser driven ions up to 70MeV/u",
        "and a magnetic chicane made of conventional electromagnetic dipole to select particles within a narrow energy range. Here",
        "the design and development of these magnetic systems is described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy016.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY017",
      "title": "Laser Driven Dielectric Accelerator in the Non-relativistic Energy Region",
      "authors": [
        "K. Koyama",
        "M. Uesaka",
        "The University of Tokyo",
        "Nuclear Professional School",
        "Ibaraki-ken",
        "Japan",
        "NIMS",
        "Ibaraki",
        "Japan",
        "H. Okamoto",
        "S. Otsuki",
        "The University of Tokyo",
        "Tokyo",
        "Japan",
        "KEK",
        "Ibaraki",
        "Japan",
        "Laser-driven dielectric accelerator (LDA) is suitable for delivering a submicron-size ultra-short electron beam",
        "which is useful for studying basic processes of the radiation effect in a biological cell. Both the oblique incidence and the normal incidence configurations of LDA were studied. The oblique incidence configuration of LDA relaxes the synchronization condition as ve=¥pm c LG/¥left(¥λ+ LG n ¥sin ¥theta ¥right) and is somewhat suitable for accelerating the non-relativistic electrons. The required energy to accelerate electrons in the oblique incidence configuration is smaller than that in the normal incidence configuration by a factor of ¥cos ¥theta",
        "where ¥theta is the incidence angle of the laser beam. Two gratings each were made of different material structure of silica ({¥rm SiO2}) were fabricated by the electron beam lithography. When a crystal silica was adopted",
        "many large humps of several hundred nm size were observed in grooves of the grating. On the other hand",
        "a glass silica had smoother grooves."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy017.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY018",
      "title": "Recent Progress of Proton Acceleration at Peking University",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy018.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY019",
      "title": "CLAPA Proton Beam Line in Peking University",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy019.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY023",
      "title": "Advanced Gabor Lens Lattice for Laser Driven Hadron Therapy and Other Applications",
      "authors": [
        "J.K. Pozimski",
        "M. Aslaninejad",
        "P.A. Posoccopresenter",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "The application of laser accelerated ion beams in hadron therapy requires a beam optics with unique features. Due to the spectral and spatial distribution of laser accelerated protons a compact ion optical system with therapy applications",
        "based on Gabor space charge lenses for collecting",
        "focusing and energy filtering the laser produced proton beam",
        "has significant advantages compared with other setups. While a passive momentum selection could improve already the usability of laser driven hadron",
        "we show that an advanced lattice utilizing additional RF cavities not only will deliver a momentum spread smaller than conventional accelerators",
        "but also will increases the dose delivered. Furthermore",
        "a possible near term application in the field of radio nuclide production is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy023.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY024",
      "title": "First Test of The Imperial College Gabor (Plasma) Lens prototype at the Surrey Ion Beam centre",
      "authors": [
        "P.A. Posocco",
        "J.K. Pozimski",
        "Y. Xia",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "UoM ICS",
        "Manchester",
        "United Kingdom",
        "The Christie NHS Foundation Trust",
        "Manchester",
        "United Kingdom",
        "The first plasma (Gabor) lens prototype operating at high electron density was built by the Imperial College London in 2015. In November 2015 the lens was tested at the Ion Beam Centre of the University of Surrey with a 1 MeV proton beam. Over 500 snapshots of the beam hitting a scintillator screen installed 0.5 m downstream of the lens were taken for a wide range of settings. Unexpectedly",
        "instead of over- or underfocusing the incoming particles",
        "the lens converted pencil beams into rings. In addition to the dependence of their radius on the lens settings",
        "periodic features appeared along the circumference",
        "suggesting that the electron plasma was exited into a coherent off-axis rotation. The cause of this phenomenon is under investigation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy024.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY025",
      "title": "Proton-Driven Electron Acceleration in Hollow Plasma",
      "authors": [
        "Y. M. Li",
        "K. Hanahoe",
        "O. Mete Apsimonpresenter",
        "T.H. Pacey",
        "G.X. Xia",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Proton driven plasma wakefield acceleration has been proposed to accelerate electrons to TeV-scale in a single hundreds of meters plasma section. However",
        "it is difficult to conserve beam quality due to the positively charged driven scheme. In this paper",
        "we demonstrate via simulation that hollow plasma is favourable to maintain the long and stable acceleration and simultaneously be able to achieve low normalized emittance and energy spread of the witness electrons. Moreover",
        "it has much higher beam loading tolerance compared to the uniform case. This will potentially facilitates the acceleration of a large number of particles with high beam quality.",
        "* Caldwell A et al.Nature Physics",
        "2009",
        "5(5): 363-367  ** K. Lotov",
        "Phys. Rev. ST Accel. Beams",
        "2010",
        "13(4): 041301.  *** W. Kimura et al.",
        "Phys. Rev. ST Accel. Beams",
        "2011",
        "14(4): 041301."
      ],
      "institutions": [
        "Funding: President's Doctoral Scholar Award from The University of Manchester."
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy025.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY026",
      "title": "Electron Beam Generation and Injection From a Pyroelectric Crystal Array",
      "authors": [
        "R.B. Yoder",
        "Z. Kabilova",
        "B. Saeks",
        "Goucher College",
        "Baltimore",
        "Maryland",
        "USA",
        "Novel acceleration structures (e.g. dielectric laser accelerators [DLAs]*) powered by lasers have the potential to greatly reduce the footprint and cost of both industrial linacs and colliders. As these devices have dimensions comparable to optical wavelengths",
        "they require injection of a sub-micron-scale electron bunch to generate high-quality output beams",
        "which are well beyond the capability of conventional rf photocathodes. Photoexcitation and field emission from an array of nanotips",
        "followed by further acceleration and focusing",
        "is a promising approach to achieving the requisite small beam sizes for successful injection. Pyroelectric crystals can provide electrostatic fields of sufficient magnitude and uniformity to enable emission and acceleration. We present an initial design for a low-energy injection module using the accelerating electrostatic fields provided by pyroelectric crystals. The approach is modeled numerically and supported by direct benchtop measurements of pyroelectric fields from a 2-crystal array.",
        "*R. J. England et al.",
        "Rev. Mod. Phys. 86",
        "p. 1337 (2014)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy026.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY028",
      "title": "Ultra-high Gradient Acceleration in Nano-crystal Channels",
      "authors": [
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "D.M. Farinella",
        "P. Taborek",
        "T. Tajima",
        "UCI",
        "Irvine",
        "California",
        "USA",
        "A.H. Lumpkin",
        "V.D. Shiltsev",
        "R.M. Thurman-Keup",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Shanghai Institute of Optics and Fine Mechanics",
        "Shanghai",
        "People's Republic of China"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy028.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY030",
      "title": "Measurements of Transmitted Electron Beam Extinction through Si Crystal Membranes",
      "authors": [
        "E.A. Nanni",
        "R.K. Li",
        "C. Limborgpresenter",
        "X. Shen",
        "S.P. Weathersby",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "W.S. Graves",
        "R. Kirian",
        "J. Spence",
        "U. Weierstall",
        "Arizona State University",
        "Tempe",
        "USA",
        "A recently proposed method for the generation of relativistic electron beams with nanometer-scale current modulation requires diffracting relativistic electrons from a perfect crystal Si grating",
        "accelerating the diffracted beam and imaging the crystal structure into the temporal dimension via emittance exchange. The relative intensity of the current modulation is limited by the ability to extinguish the transmitted beam via diffraction with a single-crystal Si membrane. In these preliminary experiments we will measure the extinction of the transmitted electron beam at zero scattering angle due to multiple Bragg scattering from a Si membrane with a uniform thickness of 340 nm at 2.35 MeV using the SLAC UED facility. The impact of beam divergence and charge density at the Si target will be quantified. The longevity of the Si membrane will also be investigated by monitoring the diffraction pattern as a function of time to observe the potential onset of damage to the crystal."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy030.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY031",
      "title": "Estimation and Suppression of Aberrations in Emittance Exchange based Current Profile Shaping",
      "authors": [
        "G. Ha",
        "M.-H. Cho",
        "W. Namkung",
        "POSTECH",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "W. Gai",
        "G. Ha",
        "K.-J. Kim",
        "J.G. Power",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The longitudinal current profile manipulation has been explored for many applications including THz radiation",
        "FEL and advanced acceleration schemes. Especially",
        "collinear dielectric wakefield accelerations require a microbunch shaping for a high transformer ratio. We have studied aberrations from the emittance exchange based current profile shaping to preserve the high transformer ratio. All second order aberration terms in the double dog-leg emittance exchange beam line are discovered. Aberration patterns from each aberration sources like second order terms",
        "space-charge",
        "and CSR and their effect on the transformer ratio are estimated analytically. These aberration sources and corresponding patterns are confirmed using a particle tracking code GPT. Simple methods to suppress each aberration will be presented too. All calculation in this work is done with a double dog-leg emittance exchange beam line."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy031.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY032",
      "title": "Radiation from Open Ended Waveguide with a Dielectric Loading",
      "authors": [
        "S.N. Galyamin",
        "A.A. Grigoreva",
        "A.V. Tyukhtin",
        "V.V. Vorobev",
        "Saint-Petersburg State University",
        "Saint-Petersburg",
        "Russia",
        "LETI",
        "Saint-Petersburg",
        "Russia",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "Terahertz radiation is considered as a promising tool for a number of applications. One possible way to emit THz waves is to pass short electron bunch through a waveguide structure loaded with dielectric*. In our previous papers",
        "we have analyzed this problem in both approximate** and rigorous*** formulation. However",
        "we have encountered certain difficulties with calculations. In the present report",
        "we are starting to develop another rigorous approach based on mode-matching technique and modified residue-calculus technique. We consider the radiation from the open-ended dielectrically loaded cylindrical waveguide placed inside regular cylindrical waveguide with larger radius. We present structure of reflected and transmitted modes and typical radiation patterns from the open end of larger radius waveguide.",
        "* S. Antipov et al.",
        "Appl. Phys. Lett.",
        "vol. 100",
        "p. 132910",
        "2012.  ** S.N. Galyamin et al.",
        "Opt. Express",
        "vol. 22",
        "No. 8",
        "p. 8902",
        "2014. *** S.N. Galyamin et al.",
        "in Proc. IPAC'15",
        "pp. 2578-2580."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy032.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY033",
      "title": "Radiation of Charged Particle Flying into Chiral Isotropic Medium",
      "authors": [
        "S.N. Galyamin",
        "A.V. Tyukhtin",
        "Saint-Petersburg State University",
        "Saint-Petersburg",
        "Russia",
        "HIJ",
        "Jena",
        "Germany",
        "In recent years",
        "the interest to radiation of moving charged particles in media with chiral properties is connected with relatively new and prospective method for diagnostics of biological objects which uses the Cherenkov radiation ' Cherenkov luminescence imaging*. Optical activity (chirality",
        "gyrotropy) is typical or biological matter and is caused by mirrorless structure of molecules. Contrary to such gyrotropic medium as magnetized ionospheric plasma",
        "aforementioned media are isotropic. One distributed model describing the frequency dispersion of isotropic chiral media is Condon model. In this report",
        "we continue the investigation performed in our previous paper** where we dealt with the field produced by uniformly moving charge in infinite chiral isotropic medium. Moreover",
        "we perform generalization of early paper***",
        "where the problem with half-space was considered in the specific case of slow charge motion. We present typical radiation patterns in vacuum area and corresponding ellipses of polarization which allows determination of the chiral parameter of the medium.",
        "* Spinelli A.E. et al. // NIM A. 2011. V. 648. P. S310.  ** Galyamin S.N. et al. // Phys. Rev. E. 2013. V. 88. P. 013206.  *** Engheta N.",
        "Mickelson A.R. // IEEE Trans. AP. 1982. V. 30. P. 1213."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy033.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY034",
      "title": "On Bunch Diagnostics with use of Surface Waves Generated on Planar Wire Grid",
      "authors": [
        "V.V. Vorobev",
        "S.N. Galyamin",
        "A.V. Tyukhtinpresenter",
        "Saint-Petersburg State University",
        "Saint-Petersburg",
        "Russia",
        "Periodic structures can be used for non-destructive diagnostics of charged particle bunches*. We consider structures which consist of thin conducting parallel wires. It is assumed that the structure period is much less than the typical wavelength under consideration. Therefore the influence of the structure on the electromagnetic field can be described with help of the averaged boundary conditions**. We consider radiation of bunches which move along the grid but transversely to wires. Unlike previous works the bunch is assumed to have essential transversal dimensions along with definite longitudinal charge distribution. In particular we analyze the effect of reflection of the surface wave from the structure edge. For all considered situations",
        "analytical and numerical results demonstrate that analysis of the surface waves allows estimating the size and the shape of the bunch.",
        "* A.V. Tyukhtin et al.",
        "Phys. Rev. ST AB 17",
        "122802 (2014); A.V. Tyukhtin et al.",
        "Phys. Rev. E 91",
        "063202 (2015).  ** M.I. Kontorovich et al.",
        "Electrodynamics of Grid Structures (Moscow",
        "1987)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy034.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY035",
      "title": "Short-wavelength Radiation of a Small Charged Bunch in Presence of a Dielectric Prism",
      "authors": [
        "A.V. Tyukhtin",
        "S.N. Galyamin",
        "Saint-Petersburg State University",
        "Saint-Petersburg",
        "Russia",
        "LETI",
        "Saint-Petersburg",
        "Russia",
        "Investigation of radiation of a charged particle bunch in the presence of a large (compared with wavelengths under consideration) dielectric object can be performed using certain approximate methods. We develop here the method based on the known Stratton-Chu formulae which allows calculating the field everywhere outside the object including the Fresnel and Fraunhofer areas",
        "as well as neighborhoods of focal points*. The main problem considered here consists in investigation of radiation of a small bunch moving along boundary of a dielectric prism or in channel inside a prism. Approximate analytical solutions of the problem are obtained and typical numerical results are given.",
        "*S.N. Galyamin and A.V. Tyukhtin",
        "Phys. Rev. Lett. 113",
        "064802",
        "2014."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy035.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY036",
      "title": "Drive Generation and Propagation Studies for the Two Beam Acceleration Experiment at the Argonne Wakefield Accelerator",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy036.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY038",
      "title": "Preliminary Measurement of the Transfer Matrix of a TESLA-type Cavity at FAST",
      "authors": [
        "A. Halavanau",
        "P. Piot",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "N. Eddy",
        "D.R. Edstrom",
        "A. Lunin",
        "P. Piot",
        "J. Ruan",
        "J.K. Santucci",
        "J.K. Santucci",
        "N. Solyak",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Superconducting linacs are capable of producing intense",
        "ultra-stable",
        "high-quality electron beams that have widespread application in Science and Industry. Many current and planned projects employ 1.3-GHz 9-cell superconducting cavities of the TESLA design*. In the present paper we discuss the transverse-focusing properties of such a cavity and non-ideal transverse-map effects introduced by field asymmetries in the vicinity of the input and high-order-mode radiofrequency (RF) couplers**. We especially consider the case of a cavity located downstream of an RF-gun in a setup similar to the photoinjector of the Fermilab Accelerator Science and Technology (FAST) facility. Preliminary experimental measurements of the CC2 cavity transverse matrix were carried out at the FAST facility. The results are discussed and compared with analytical and numerical simulations.",
        "* A. Aunes et al.",
        "Phys. Rev.ST Accel. Beams 3",
        "092001 (2000). ** P. Piot",
        "el. al.",
        "Proc. 2005 Part. Accel. Conf.",
        "Knoxville",
        "TN",
        "p. 4135 (2005)."
      ],
      "institutions": [
        "Funding: US Department of Energy (DOE) under contract DE-SC0011831 with Northern Illinois University. Fermilab is operated by the Fermi Research Alliance LLC under US DOE contract DE-AC02-07CH11359."
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy038.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY041",
      "title": "Delivery Status of the ELI-NP Gamma Beam System",
      "authors": [
        "S. Tomassini",
        "D. Alesini",
        "A. Battisti",
        "R. Boni",
        "F. Cioeta",
        "A. Delle Piane",
        "E. Di Pasquale",
        "G. Di Pirro",
        "A. Falone",
        "A. Gallo",
        "S.I. Incremona",
        "V.L. Lollo",
        "A. Mostacci",
        "S. Pioli",
        "R. Ricci",
        "U. Rotundo",
        "A. Stella",
        "C. Vaccarezza",
        "A. Vannozzi",
        "A. Variola",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "A. Bacci",
        "D.T. Palmer",
        "L. Serafini",
        "Istituto Nazionale di Fisica Nucleare",
        "Milano",
        "Italy",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "INFN-Roma1",
        "Rome",
        "Italy",
        "K. Cassou",
        "Z.F. Zomer",
        "LAL",
        "Orsay",
        "France",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "A. Giribono",
        "V. Pettinacci",
        "INFN-Roma",
        "Roma",
        "Italy",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Rome University La Sapienza",
        "Roma",
        "Italy",
        "University of Rome La Sapienza",
        "Rome",
        "Italy",
        "The ELI-NP GBS is a high intensity and monochromatic gamma source under construction in Magurele (Romania). The design and construction of the Gamma Beam System complex as well as the integration of the technical plants and the commissioning of the overall facility",
        "was awarded to the Eurogammas Consortium in March 2014. The delivery of the facility has been planned in for 4 stages and the first one was fulfilled in October 31st 2015. The engineering aspects related to the delivery stage 1 are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy041.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY042",
      "title": "Proton Injection into the Fermilab Integrable Optics Test Accelerator (IOTA)",
      "authors": [
        "E. Prebys",
        "K. Carlson",
        "H. Piekarz",
        "A. Valishev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "University of Chicago",
        "Chicago",
        "Illinois",
        "USA",
        "The Integrable Optics Test Accelerator (IOTA) is an experimental synchrotron being built at Fermilab to test the concept of non-linear \"integrable optics\". These optics are based on a lattice including non-linear elements that satisfies particular conditions on the Hamiltonian. The resulting particle motion is predicted to be stable but without a unique tune. The system is therefore insensitive to resonant instabilities and can in principle store very intense beams",
        "with space charge tune shifts larger than those which are possible in conventional linear synchrotrons. The ring will initially be commissioned with electrons",
        "but this poster describes progress toward the injection of protons into the ring",
        "using the RFQ originally built for the High Energy Neutrino Source (HINS) project."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy042.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPMY044",
      "title": "Carbon and Mercury Target Systems for Muon Colliders and Neutrino Factories",
      "authors": [
        "PU",
        "Princeton",
        "New Jersey",
        "USA",
        "J.S. Berg",
        "H.G. Kirk",
        "D. Stratakis",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "UCLA",
        "Los Angeles",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "A high-power target is required to convert a powerful MW-class proton beam into an intense muon source or neutrino source in support of physics at the intensity frontier. The first phase of a Muon Collider or Neutrino Factory program may use a 6.75-GeV proton driver with beam power of only 1 MW. At this lower power it is favorable to use a graphite target with beam and target tilted slightly to the axis of a 20-T pion-capture solenoid around the target. Using the",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tupmy044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tupmy044.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tupmy044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUPMY044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 34,
  "scrape_time": "2025-10-10 20:08:22"
}