{
  "session_info": {
    "id": "THPPA",
    "name": "THPPA - Awards Session",
    "url": "https://proceedings.jacow.org/IPAC2013/html/thppa.htm"
  },
  "papers": [
    {
      "paper_id": "THPPA01",
      "title": "Realization of New Charge-state Stripper for High-power Uranium Ion Beams",
      "authors": [
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "Recent works to realize the new charge-state stripper using recirculating helium gas are presented. Very limited lifetimes of conventional solid-state strippers due to huge dE/dx for very heavy ion beams (e.g.",
        "for uranium ions",
        "several thousand times larger than protons at the energy around 10 MeV/u) were a principal bottleneck for their multi-stage acceleration at high intensities. The new stripping system is characterized by its infinite lifetime",
        "efficient stripping and small beam degradation even for the world’s most intense uranium ion beams provided by the RIBF (more than 1 pμA at the injected energy of 11 MeV/u). Successful operations of the system in 2012 greatly contribute to the remarkable expansion of the accelerator performance of the RIBF that will allow an enormous breakthrough for exploring new domains of the nuclear world in the next several years; the peak intensity of the uranium beam has reached 15.1 pnA (almost 1011 pps) at 345 MeV/u and the average intensity provided for the users has become ten times higher than it was in 2011."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thppa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thppa01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thppa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPPA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPPA02",
      "title": "Features and Applications of the Program ELEGANT",
      "authors": [
        "ANL",
        "Argonne",
        "USA",
        "ELEGANT is an open-source accelerator design and simulation code that has been in use and development for nearly two decades. In that time",
        "it has evolved into a fairly general code for the design and modeling of linacs and storage rings",
        "due in no small measure to suggestions and feedback from users world-wide. The code is best known for modeling of linacs for free electron lasers and particularly its relatively fast and straightforward modeling of coherent synchrotron radiation in magnetic bunch compression systems. This capability led to the discovery of a microbunching instability in such systems",
        "thus helping to seed a new field of research. ELEGANT's capabilities are enhanced by the use of self-describing data files and the Self-Describing Data Sets (SDDS) toolkit. In this paper",
        "we briefly review the features and capabilities of the code",
        "then give a series of application examples from simulation of linear accelerators and storage rings."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thppa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thppa02.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thppa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPPA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPPA03",
      "title": "The Development of China’s Accelerators I Have Experienced",
      "authors": [
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The development of China’s high energy accelerator for half a century falls into two stages",
        "namely the first 20 hovering years (1958-1978) and the later 30 years of rapid development (from 1978 till now). I was lucky enough to have experienced the whole process",
        "witnessed",
        "and to some extent",
        "joined in the decision-making",
        "the projects approval",
        "the designing",
        "the development and construction of China's five large scientific facilities undertaken by the Institute of High Energy Physics in Beijing. A brief review is given of the previous stage of history regarding the consideration of China’s high energy accelerators in the first 20 years. A short presentation is also given of the later 30 years concerning the rapid development of the Beijing Electron-Positron Collider (BEPC and BEPCII)",
        "the completed BEPC-based Shanghai Synchrotron Radiation Facility (SSRF)",
        "the Chinese Spallation Neutron Source (CSNS) under construction",
        "the high-intensity proton accelerator (ADS) used for nuclear waste transmutation and the proton therapy machine in the R&D stage."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thppa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thppa03.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thppa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THPPA03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 21:39:50"
}