{
  "session_info": {
    "id": "TUIDCC",
    "name": "TUIDCC - WG2.2 ERL Optics and Lattice Design",
    "url": "https://proceedings.jacow.org/erl2017/html/tuidcc.htm"
  },
  "papers": [
    {
      "paper_id": "TUIDCC001",
      "title": "PERLE - Beam Optics Design",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "PERLE (Powerful ERL for Experiments) is a novel ERL test facility",
        "initially proposed to validate design choices for a 60 GeV ERL needed for a future extension of the LHC towards a hadron-electron collider",
        "the LHeC. Its main goal is to test the limits of a high current",
        "CW",
        "multi-pass operation with superconducting cavities at 802 MHz (and perhaps exploring other frequencies of interest). PERLE optics features Flexible Momentum Compaction (FMC) lattice architecture for six vertically stacked return arcs and a high current",
        "5 MeV photo-injector. With only one pair of 4-cavity cryomodules",
        "400 MeV beam energy can be reached in three re-circulation passes",
        "with beam currents in excess of 15 mA. This unique quality beam is intended to perform a number of experiments in different fields reaching from uncharted tests of accelerator components via elastic ep scattering to laser-Compton backscattering for photon physics. Following the experiment",
        "the CW beam is decelerated in three consecutive passes back to the injection energy",
        "transferring virtually stored energy back to the RF."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuidcc001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuidcc001.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuidcc001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUIDCC001",
      "page_number": "49",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUIDCC002",
      "title": "eRHIC Multi-Pass ERL",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The talk concentrates on accelerator physics and accelerator technology issues related with the multi-pass ERL of ERL-Ring design option of future high luminosity electron-hadron collider eRHIC. Possible solutions for recirculating passes are described which include individual loops as well as FFAG-type re-circulations. Major beam dynamics effects dominating the ERL performance are described",
        "which include electron beam disruption",
        "multi-pass beam-break-up",
        "preservation of transverse emittance and energy spread during acceleration and deceleration process. The recent design modifications of ERL-Ring eRHIC aim to balance technological risks and the project cost."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuidcc002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuidcc002.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuidcc002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUIDCC002",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUIDCC003",
      "title": "CBETA Multipass Lattice Design",
      "authors": [
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Cornell University and Brookhaven National Laboratory are currently designing the Cornell-BNL ERL-FFAG Test Accelerator (CBETA)",
        "to be built at Cornell that utilizes the existing energy recovery linac (ERL) injector and main linac cryomodule (MLC). The bulk of the recirculation arcs will consist of fixed-field alternating-gradient (FFAG) magnets made from permanent magnet material. Four acceleration passes through the MLC will bring the beam to 150 MeV. We will review the overall lattice design for this machine."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuidcc003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuidcc003.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuidcc003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUIDCC003",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUIDCC004",
      "title": "CBETA FFAG Beam Optics Design",
      "authors": [
        "J.S. Berg",
        "S.J. Brooks",
        "F. Méot",
        "D. Trbojevic",
        "N. Tsoupas",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "J.A. Crittenden",
        "Y. Li",
        "C.E. Mayes",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "CBETA is an Energy Recovery Linac (ERL) accelerating an electron beam to 150 MeV in four linac passes. Instead of having four separate return loops to the linac",
        "it instead has a single fixed field alternating gradient (FFAG) beamline with nearly a factor of 4 energy acceptance. While ideally the FFAG would be circular with identical cells all around",
        "space and cost considerations dictate that small radius of curvature FFAGs should be used near the linac",
        "connected by a straight beamline. To ensure good orbit matching over the entire energy range",
        "adiabatic transitions are inserted between the arcs and the straight. After briefly introducing basic principles of FFAG optics",
        "we describe how we choose the parameters of the arc cell",
        "the basic building block of the lattice. We then describe how the straight cell is chosen to work well with the arc. Finally we describe the design process for the transition that ensures orbits over the entire energy range end up very close to the axis of the straight. We discuss how the realization of this lattice design with physical magnets impacts the design process."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuidcc004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuidcc004.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuidcc004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUIDCC004",
      "page_number": "52",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUIDCC005",
      "title": "ERL Recirculation Optics for MESA",
      "authors": [
        "IKP",
        "Mainz",
        "Germany"
      ],
      "institutions": [],
      "abstract": "MESA is a recirculating superconducting accelerator under construction at Johannes Gutenberg-Universität Mainz. It will be used for high precision particle physics experiments in two different operation modes: external beam (EB) mode and energy recovery (ERL) mode. The operating beam current and energy in EB mode is 0.15 mA with polarized electrons at 155 MeV. In ERL mode a beam of 1 mA at 105 MeV will be available. In a later construction stage of MESA the beam current in ERL-mode shall be upgraded to 10 mA. The recirculating main linac follows the concept of a double sided accelerator design with vertical stacking of return arcs. Acceleration is done by in total four TESLA/XFEL 9-cell SRF-cavities mounted in two modified ELBE cryomodules. Within this contribution the recirculation optics for MESA will be presented focussing on achieving best energy spread at the experimental setups in recirculation ERL and non-ERL operation.",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuidcc005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuidcc005.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuidcc005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUIDCC005",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-10 17:05:33"
}