{
  "session_info": {
    "id": "WEXZO",
    "name": "WEXZO - Wednesday Oral Before Second Break",
    "url": "https://proceedings.jacow.org/ecris2020/html/wexzo.htm"
  },
  "papers": [
    {
      "paper_id": "WEXZO01",
      "title": "High Intensity Ion Beam Extraction System for FECR",
      "authors": [
        "Z. Shen",
        "X. Fang",
        "J.W. Guo",
        "Z.H. Jia",
        "Y.G. Liu",
        "W. Lu",
        "L.T. Sun",
        "Y. Yang",
        "X.Z. Zhang",
        "H.W. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "UCAS",
        "Beijing",
        "People’s Republic of China",
        "To meet the beam requirements of High Intensity heavy ion Accelerator Facility (HIAF)",
        "the Institute of Modern Physics is developing a Fourth generation ECR ion source (FECR). Targeting at the operation frequency of 45 GHz",
        "FECR is expected to produce very high intensity highly charged heavy ion beams",
        "such as 1.0 emA 238U35+",
        "2 emA 78Kr19+",
        "10 emA 16O6+",
        "etc. Based on the records with the 3rd generation ECR ion source operating at 24-28 GHz",
        "the corresponding total drain current of FECR could reach 20-60 emA. To extract such high intensity multi-charged ion beams from the source with high beam quality and transmission efficiency",
        "conventional diode or triode extraction system might not be suitable",
        "and therefore a 4-electrode extraction system with a total extraction voltage of 50 kV is designed to mitigate the space charge influences and minimize the beam emittance growth in the extraction region. In this paper",
        "a 3D model of the FECR extraction system is built using the IBSimu code. The electrode angles",
        "voltages and electrode spacings are optimized for different ion beam conditions respectively. Beam properties comparison of various simulation conditions are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/wexzo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/wexzo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/wexzo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-WEXZO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXZO02",
      "title": "³⁹Ar Enrichment System Based on a 2.45 GHz ECR Ion Source",
      "authors": [
        "Z.H. Jia",
        "X. Fang",
        "Y.H. Guo",
        "Q. Hu",
        "Y.J. Li",
        "Y.G. Liu",
        "L.T. Sun",
        "Q. Wu",
        "Y. Yang",
        "T.X. Zhan",
        "J.Q. Zhang",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "HNLPSM",
        "Hefei",
        "People’s Republic of China",
        "USTC",
        "SNST",
        "Anhui",
        "People’s Republic of China",
        "Aimed at improving the ATTA’s (Atom Trap Trace Analysis) dating efficiency with 39Ar radioactive isotope",
        "an isotope enrichment system has been developed at IMP (Institute of Modern Physics) to increase the abundance of 39Ar in the incident sample gas. In this enrichment system",
        "a 2.45 GHz ECR ion source was designed to ionize sample gas and produce isotopes beams with several mA",
        "and the isotopes beam is transported and separated in the separation beam line",
        "which is consisted of two quadrupoles and an analysis magnet. The separated isotopes are collected by a rotated aluminum foil target. According to the recent cross-checked results with ATTA",
        "high enrichment factor of 39Ar isotope has been successfully reached. This paper will give a general introduction to the platform setup. The isotope enrichment efficiency is the critical issue for such a platform and will be specially discussed."
      ],
      "institutions": [
        "Funding: National Key Research and Development Project (contract No.2016YFA0302202)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/wexzo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/wexzo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/wexzo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-WEXZO02",
      "page_number": "128",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXZO03",
      "title": "Conceptual Design of an Electrostatic Trap for High Intensity Pulsed Beam",
      "authors": [
        "W. Huang",
        "Y.G. Liu",
        "L.T. Sun",
        "H.W. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "UCAS",
        "Beijing",
        "People’s Republic of China",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Highly charged ion sources play an important role in the advancement of heavy ion accelerators worldwide. The beam requirements of highly charged heavy ions from new accelerators have driven the performance of ion sources to their limits and beyond. In parallel to developing new technologies to enhance the performance of ECR ion source",
        "this paper presents a conceptual design of an ion trap aiming to convert a cw ion beam into a short beam pulse with high compression ratios. With an electron gun",
        "a solenoid and a set of drift tubes",
        "the injected ions will be trapped radially and axially. By manipulating the potential of drift tubes",
        "ions can be accumulated with multiple injections and extracted at a fast or slow scheme. This paper presents the simulation and design results of this ion trap prototype."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/wexzo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/wexzo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/wexzo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-WEXZO03",
      "page_number": "132",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXZO04",
      "title": "Numerical Simulations of Plasma Dynamics in ECRIS Afterglow",
      "authors": [
        "L. Lei",
        "X.L. Jin",
        "University of Electronic Science and Technology of China",
        "Chengdu",
        "People’s Republic of China",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "Plasma dynamics in the afterglow of ECRIS has been studied through the Particle-in-cell (PIC) simulations. A full 3D implicit electrostatic PIC code was developed to meet the needs of ECRIS simulations and to study the characteristics of the ECR plasma during the afterglow. The initial plasma parameters at the simulation start-up were assumed by referring to the experimental diagnostics of the ECRISs from IMP",
        "Lanzhou. The dynamics of electrons and ions in the presence of the external magnetic field and at the absence of the microwave energy were simulated to study the mechanism of afterglow. Through the abundant diagnostics of the 3D PIC simulation",
        "some ECR plasma features during afterglow including the plasma potential and electron energy distributions could be obtained and analyzed. The goal was to determine the important evolutions that contribute to the afterglow and thus to have a clearer understanding of ECRIS afterglow mode."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/wexzo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/wexzo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/wexzo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-WEXZO04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXZO05",
      "title": "Production of Metal Ion Beams From ECR Ion Sources",
      "authors": [
        "A.E. Bondarchenko",
        "S.L. Bogomolov",
        "N. Lebedev",
        "V.N. Loginov",
        "V. Mironov",
        "D.K. Pugachev",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "M.B. Abdigaliyev",
        "I.A. Ivanov",
        "M.V. Koloberdin",
        "A.E. Kurakhmedov",
        "D.A. Mustafin",
        "Y.K. Sambayev",
        "M.V. Zdorovets",
        "INP NNC RK",
        "Almaty",
        "Kazakhstan",
        "The work describes the preparation of metal ion beams from ECR ion sources by the MIVOC (Metal Ions from Volatile Compounds) method. The method is based on the use of volatile metal compounds having high vapor pressure at room temperature: for example",
        "Ni(C5H5)2",
        "(CH3)5C5Ti(CH3)3 and several others. Using this method",
        "intense beams of chromium",
        "titanium",
        "iron",
        "and other ions were obtained at the U-400 FLNR JINR and DC-60 cyclotrons (Astana branch of the INP",
        "Alma-Ata",
        "Kazakhstan Republic)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/wexzo05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/wexzo05.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/wexzo05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-WEXZO05",
      "page_number": "137",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-10 17:26:49"
}