{
  "session_info": {
    "id": "MOPF",
    "name": "MOPF - Poster Session I",
    "url": "https://proceedings.jacow.org/cool2015/html/mopf.htm"
  },
  "papers": [
    {
      "paper_id": "MOPF01",
      "title": "Final Cooling for a High Energy High Luminosity Collider",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "T.L. Hart",
        "D.J. Summers",
        "UMiss",
        "University",
        "Mississippi",
        "USA",
        "The final cooling system for a high-energy high-luminosity muon collider requires reduction of the transverse emittance by an order of magnitude to ~0.00003 m (rms",
        "N)",
        "while allowing longitudinal emittance increase to ~0.1m. In an initial approach",
        "this is obtained by transverse cooling of low-energy muons within a sequence of high field solenoids with low-frequency rf systems. Since the final cooling steps are actually emittance exchange",
        "much of this transformation can be obtained by thick wedge absorbers at matched parameters. Other variations using quad-based cooling channels",
        "transverse beam slicing and round to flat transforms can be used. in x-y",
        "with transverse slicing and longitudinal recombination are discussed. Development of lowest emittance cooling with final exchange is discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf01.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPF02",
      "title": "The Green Energy Turbine as Turbo Generator for Powering the HV-Solenoids at a Relativistic Electron Cooler",
      "authors": [
        "A. Hofmann",
        "K. Aulenbacher",
        "M.W. Bruker",
        "J. Dietrich",
        "T. Weilbach",
        "HIM",
        "Mainz",
        "Germany",
        "V.V. Parkhomchuk",
        "V.B. Reva",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "One challenge in the development of a relativistic electron cooler is the powering of components",
        "e.g. HV-solenoids",
        "which sit on different potentials within a high voltage vessel and need a floating power supply. Within a design study",
        "BINP SB RAS Novosibirsk has proposed two possibilities to build a power supply in a modular way. The first proposal is to use two cascade transformers per module. One cascade transformer powers 22 small HV-solenoids; the second one should generate the acceleration/deceleration voltage. The cascade transformers are fed by a turbo generator",
        "which is powered by a gas under high pressure which is generated outside of the vessel. The second possibility is to use two big HV-solenoids per module. In this proposal",
        "the HV-solenoids are powered directly by a turbo generator. For both concepts",
        "a suitable turbo generator is essential. A potential candidate for the turbo generator could be the Green Energy Turbine (GET) from the company DEPRAG",
        "which works with dry air and delivers a power of 5 kW. At the Helmholtz-Institut Mainz two GETS are tested. After an introduction",
        "we present our experience with the GET and give an overview of the further road map."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf02.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF02",
      "page_number": "29",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPF03",
      "title": "Electron Lenses and Cooling for the Fermilab Integrable Optics Test Accelerator",
      "authors": [
        "G. Stancari",
        "A.V. Burov",
        "V.A. Lebedev",
        "S. Nagaitsev",
        "E. Prebys",
        "A. Valishev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Recently",
        "the study of integrable Hamiltonian systems has led to nonlinear accelerator lattices with one or two transverse invariants and wide stable tune spreads. These lattices may drastically improve the performance of high-intensity machines",
        "providing Landau damping to protect the beam from instabilities",
        "while preserving dynamic aperture. The Integrable Optics Test Accelerator (IOTA) is being built at Fermilab to study these concepts with 150-MeV pencil electron beams (single-particle dynamics) and 2.5-MeV protons (dynamics with self fields). One way to obtain a nonlinear integrable lattice is by using the fields generated by a magnetically confined electron beam (electron lens) overlapping with the circulating beam. The required parameters are similar to the ones of existing devices. In addition",
        "the electron lens will be used in cooling mode to control the brightness of the proton beam and to measure transverse profiles through recombination. More generally",
        "it is of great interest to investigate whether nonlinear integrable optics allows electron coolers to exceed limitations set by both coherent or incoherent instabilities excited by space charge."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf03.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF03",
      "page_number": "32",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF04",
      "title": "D McMillan map for Accelerator Physics",
      "authors": [
        "T. Zolkin",
        "S. Nagaitsev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The McMillan lens is one of the most important concepts of 1D nonlinear integrable optics for accelerators",
        "however",
        "its generalization to higher dimensions is not trivial. We will discuss two possible extensions to 2D",
        "namely",
        "axially symmetric McMillan lens which is based on hollow electron lens",
        "and",
        "quasi-integrable map based on the McMillan magneto-static lens and properly tuned linear lattice. The beam dynamics in the first case resembles the electron cooling process and possibly the lens can be used as a cooling device by itself. The second one has very nontrivial phase-space structure due to strong sensitivity to initial conditions",
        "which experimental study may be done with the use of very cold (in transverse dimensions) pencil-like beams. In addition we will discuss Smaller and Global Alignment Indexes techniques allowing to distinguish ordered motion from chaotic which is based on the Lyapunov stability analysis.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf04.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF04",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPF05",
      "title": "A Cooling Storage Ring for an Electron-Ion Collider",
      "authors": [
        "J. Gerity",
        "P.M. McIntyre",
        "Texas A&M University",
        "College Station",
        "USA",
        "Electron cooling offers performance advantages to the design of an electron-ion collider. A first design of a 6 GeV/u storage ring for the cooling of ions in MEIC is presented",
        "along with some remarks on the particulars of electron cooling in this ring."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf05.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF05",
      "page_number": "36",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF06",
      "title": "Quantification of the Electron Plasma in TItan's Cooler Penning Trap",
      "authors": [
        "B.A. Kootte",
        "B. Barquest",
        "U. Chowdhury",
        "J. Even",
        "M. Good",
        "A.A. Kwiatkowski",
        "D. Lascar",
        "K.G. Leach",
        "A. Lennarz",
        "D.A. Short",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "Universität Muenster",
        "Physikalisches Institut",
        "Muenster",
        "Germany",
        "SFU",
        "Burnaby",
        "BC",
        "Canada",
        "J. Bale",
        "J. Dilling",
        "A. Finlay",
        "A.A. Gallant",
        "E. Leistenschneider",
        "UBC & TRIUMF",
        "Vancouver",
        "British Columbia",
        "Canada",
        "Institut für Kernphysik",
        "Westfälische Wilhelms-Universität Münster",
        "Münster",
        "Germany",
        "University of Manitoba",
        "Manitoba",
        "Canada",
        "Heidelberg University",
        "Physics Institute",
        "Heidelberg",
        "Germany",
        "UW/Physics",
        "Waterloo",
        "Ontario",
        "Canada",
        "University of Calgary",
        "NW Calgary",
        "Alberta",
        "Canada",
        "MPI",
        "Muenchen",
        "Germany",
        "Modern rare isotope facilities provide beams of shortlived radionuclides primarily for studies in the field of nuclear structure",
        "nuclear astrophysics",
        "and low energy particle physics. At these facilities",
        "many activities such as re-acceleration",
        "improvement of resolving power",
        "and precision experimental measurements require charge breeding of ions. However",
        "the charge breeding process can increase the energy spread of an ion bunch",
        "adversely affecting the experiment. A Cooler Penning Trap (CPET) is being developed to address such an energy spread by means of sympathetic electron cooling of the Highly Charged Ion bunches to . 1 eV/q. Recent work has focused on developing a strategy to effectively detect the trapped electron plasma without obstructing the passage of ions through the beamline. The first offline tests demonstrate the ability to trap and detect more than 108 electrons. This was achieved by using a novel wire mesh detector as a diagnostic tool for the electrons.",
        "* E.M. Burbidge et al",
        "Rev Mod Phys",
        "29 547 (1957)  ** V.V. Simon et al",
        "Phys Rev C",
        "85 064308 (2012)\r  *** Z. Ke et al",
        "Hyp Int",
        "173 103 (2006)\r **** U. Chowdhury et al",
        "AIP Conf Proc",
        "1640 120 (2015)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf06.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF06",
      "page_number": "39",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF07",
      "title": "Final Muon Ionization Cooling Channel using Quadrupole Doublets for Strong Focusing",
      "authors": [
        "J.G. Acosta",
        "L.M. Cremaldi",
        "T.L. Hart",
        "S.J. Oliveros",
        "D.J. Summers",
        "UMiss",
        "University",
        "Mississippi",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Considerable progress has been made in the design of muon ionization cooling for a collider. A 6D normalized emittance of 0.123 cubic mm has been achieved in simulation",
        "almost a factor of a million in cooling. However",
        "the 6D emittance required by a high luminosity muon collider is 0.044 cubic mm. We explore a final cooling channel composed of quadrupole doublets limited to 14 Tesla. Flat beams formed by a skew quadrupole triplet are used. The low beta regions",
        "as low as 5 mm",
        "produced by the strong focusing quadrupoles are occupied by dense",
        "low Z absorbers that cool the beam. Work is in progress to keep muons with different path lengths in phase with the RF located between cells and to modestly enlarge quadrupole admittance. Calculations and individual cell simulations indicate that the final cooling needed may be possible. Full simulations are in progress. After cooling",
        "emittance exchange in vacuum reduces the transverse emittance to 25 microns and lets the longitudinal emittance grow to 70 mm as needed by a collider. Septa slices a bunch into 17 parts. RF deflector cavities",
        "as used in CLIC tests",
        "form a 3.7 meter long bunch train. Snap bunch coalescence combines the 17 bunches into one in a 21 GeV ring in 55 microseconds."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf07.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF07",
      "page_number": "43",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF08",
      "title": "Secondary Electron Measurements at the HIM Electron Cooler Test Set-Up",
      "authors": [
        "M.W. Bruker",
        "K. Aulenbacher",
        "J. Dietrich",
        "A. Hofmann",
        "T. Weilbach",
        "HIM",
        "Mainz",
        "Germany",
        "The planned advances in electron cooling technology aimed at improving the operation of future hadron storage rings include an increase in electron beam current and acceleration voltage. A test set-up has been built at Helmholtz-Insitut Mainz (HIM) to optimize the recuperation efficiency of such high-current beams in energy recovery operation",
        "requiring a thorough understanding of their interaction with external electric and magnetic fields",
        "such as those found in a Wien velocity filter. Beam diagnostics are carried out using a BPM and current-sensing scraper electrodes. At present",
        "the set-up can be successfully operated at U=17 kV",
        "I=600 mA",
        "showing a relative secondary electron current of about 2·10-4. We present the current state of the project and its objectives for the foreseeable future."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf08.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF08",
      "page_number": "48",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF09",
      "title": "Signals from a Beam Performing Betatron Oscillations Using an Electrostatic Electrode Model with Rectangular Boundaries",
      "authors": [
        "GSI",
        "Darmstadt",
        "Germany",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "We present a novel electrostatic electrode model with rectangular boundaries. The fields are calculated using a conformal mapping. These fields are used to calculate the signal due to a relativistic beam. The response at harmonics of the revolution frequency and at the corresponding horizontal and vertical sidebands is given. The underlying nonlinear formalism is due to Bisognano and Leeman. The electrode geometry of the new stochastic cooling system at the CSRe ring at the IMP in Lanzhou is taken to derive the responses in the sum mode",
        "the horizontal difference mode",
        "and the vertical difference mode."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf09.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF09",
      "page_number": "51",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF10",
      "title": "Design Beam Diagnostic System for Optical Stochastic Cooling at IOTA Ring",
      "authors": [
        "K. Yonehara",
        "V.A. Lebedev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "Validation test of optical stochastic cooling (OSC) with 100 MeV electron beam is designed at IOTA ring at Fermilab. A beam diagnostic system for the test is discussed in this paper. The beam position and bunch length will be measured by using a standard button-pickup BPM; while the beam emittance will be measured by using a CCD-based synchrotron light detector. Especially",
        "accurate time measurement is essential to carry out OSC experiments with a single particle. Desired time resolution is the order of 100 ps to study the cooling decrement in various lattice parameters. SiPM is an attractive solid-state device to detect a time domain synchrotron radiation photon. It can realize a fast rise time < 100 ps with a short time width 1-2 ns FWHM and its quantum efficiency is > 40 % at 420 nm. The beam instrumentation required to tune timing in the OSC insert is also discussed. It is based on the interference of radiation coming from the pickup and kicker undulators."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf10.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF10",
      "page_number": "55",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF11",
      "title": "First Tests and Status of the Cec Pop Experiment",
      "authors": [
        "I. Pinayev",
        "V. Litvinenko",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "The construction of the CeC PoP experimental set-up approach the final stage. In this paper we describe the status of the project and near term plans. The low power beam test results of the SRF gun will be also presented. reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf11.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF11",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPF12",
      "title": "N-body Code to Demonstrate Electron Cooling",
      "authors": [
        "S. Abeyratne",
        "B. Erdelyi",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "ANL",
        "Argonne",
        "USA",
        "In the Electron Ion Collider (EIC)",
        "the collision between the electron beam and the proton",
        "or heavy ion",
        "beam results in emittance growth of the proton beam. Electron cooling",
        "where an electron beam and the proton beam co-propagate",
        "is the desired cooling method to cool or mitigate the emittance growth of the proton beam. The pre-booster",
        "the larger booster",
        "and the collider ring in EIC are the major components that require electron cooling. To study the cooling effect",
        "we previously proposed Particles' High order Adaptive Dynamics (PHAD) code that uses the Fast Multiple Method (FMM) to calculate the Coulomb interactions among charged particles. We further used the Strang splitting technique to improve the code's efficiency and used Picard iteration-based novel integrators to maintain very high accuracy. In this paper we explain how this code is used to treat relativistic particle collisions. We are able calculate the transverse emittances of protons and electrons in the cooling section while still maintaining high accuracy. This presentation will be an update on progress with the parallelization of the code and the current status of production runs."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf12.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF12",
      "page_number": "59",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF13",
      "title": "Taper and Tuner Scheme of a Multi-Frequency Cavity for the Fast Kicker Resonator in MEIC Electron Circular Cooler Ring",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "R.A. Rimmer",
        "H. Wang",
        "S. Wang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "An ultra-fast harmonic kicker consisted of normal conducting resonators with high transverse shunt impedance thus less RF power consumption was designed for the proposed Medium energy Electron Ion Collider (MEIC). In the prototype design",
        "four quarter wave resonator (QWR) based deflecting cavities are used to generate ten cosine harmonic waveforms",
        "the electron bunches passing through these cavities will experience an integral effect of all the harmonic fields",
        "thus every 10th bunch in a continues bunch train of 10th harmonic bunch frequency will be kicked while all the other bunches un-kicked. Ten harmonic waves are distributed in the four cavities with the proportion of 5:3:1:1. For the multi-frequency cavities",
        "a great challenge is to tune each harmonic to be exact frequency. In this paper",
        "the taper and tuning scheme for the 5-modes cavity is presented. Five taper points in the inner conductor are chosen to make the five frequencies to be odd harmonics. Five stub tuners on the outer conductor are used to tune every harmonic back to its target frequency from the manufacturing errors.",
        "Authored by Jefferson Science Associates",
        "LLC under U.S. DOE Contract No. DE-AC05-06OR23177."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf13.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF13",
      "page_number": "63",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF14",
      "title": "MEIC Electron Cooler Architecture and Beam Simulations",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "A discussion of the complexities in meeting the MEIC electron cooling beam specifications is presented. Simulations of various schemes are shown to evaluate the best architecture. reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/mopf14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/mopf14.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/mopf14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-MOPF14",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 14,
  "scrape_time": "2025-10-10 17:20:30"
}