{
  "session_info": {
    "id": "MOCOBAB",
    "name": "MOCOBAB - Integrating Complex or Diverse Systems",
    "url": "https://proceedings.jacow.org/ICALEPCS2013/html/mocobab.htm"
  },
  "papers": [
    {
      "paper_id": "MOCOBAB01",
      "title": "New Electrical Network Supervision for CERN: Simpler, Safer, Faster, and Including New Modern Features",
      "authors": [
        "J-C. Tournier",
        "G. Burdet",
        "M. Gonzalez-Berges",
        "S. Infante",
        "A. Kiourkos",
        "P. Kozlowski",
        "F. Varela",
        "CERN",
        "Geneva",
        "Switzerland",
        "Since 2012",
        "an effort started to replace the ageing electrical supervision system (managing more than 200",
        "000 tags) currently in operation with a WinCC OA-based supervision system in order to unify the monitoring systems used by CERN operators and to leverage the internal knowledge and development of the products (JCOP",
        "UNICOS",
        "etc.). Along with the classical functionalities of a typical SCADA system (alarms",
        "event",
        "trending",
        "archiving",
        "access control",
        "etc.)",
        "the supervision of the CERN electrical network requires a set of domain specific applications gathered under the name of EMS (Energy Management System). Such applications include network coloring",
        "state estimation",
        "power flow calculations",
        "contingency analysis",
        "optimal power flow",
        "etc. Additionally",
        "as electrical power is a critical service for CERN",
        "a high availability of its infrastructure",
        "including its supervision system",
        "is required. The supervision system is therefore redundant along with a disaster recovery system which is itself redundant. In this paper",
        "we will present the overall architecture of the future supervision system with an emphasis on the parts specific to the supervision of electrical network."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/mocobab01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/mocobab01.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/mocobab01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-MOCOBAB01",
      "page_number": "27",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCOBAB02",
      "title": "Integration of PLC with EPICS IOC for SuperKEKB Control System",
      "authors": [
        "J.-I. Odagiri",
        "K. Furukawa",
        "T.T. Nakamura",
        "KEK",
        "Ibaraki",
        "Japan",
        "Recently",
        "more and more PLCs are adopted for various frontend controls of　accelerators. It is common to connect the PLCs with higher level control layers by the network. As a result",
        "control logic becomes dispersed over separate layers",
        "one of which is implemented by ladder programs on PLCs",
        "and the other is implemented by higher level languages on frontend computers. EPICS-based SuperKEKB accelerator control system",
        "however",
        "take a different approach by using FA-M3 PLCs with a special CPU module (F3RP61)",
        "which runs Linux and functions as an IOC. This consolidation of PLC and IOC enables higher level applications to directly reach every PLC placed at frontends by Channel Access. In addition",
        "most of control logic can be implemented by the IOC core program and/or EPICS sequencer to make the system more homogeneous resulting in easier development and maintenance of applications. This type of PLC-based IOCs are to be used to monitor and control many subsystems of SuperKEKB",
        "such as personnel protection system",
        "vacuum system",
        "RF system",
        "magnet power supplies",
        "and so on. This paper describes the applications of the PLC-based IOCs to the SuperKEKB accelerator control system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/mocobab02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/mocobab02.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/mocobab02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-MOCOBAB02",
      "page_number": "31",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCOBAB03",
      "title": "The Laser MegaJoule ICCS Integration Platform",
      "authors": [
        "J. Fleury",
        "J.P.A. Arnoul",
        "A. Mugnier",
        "CEA",
        "LE BARP cedex",
        "France",
        "CEA/DAM/DIF",
        "Arpajon",
        "France",
        "The French Atomic Energy Commission(CEA)has just built an integration platform outside the LMJ facility in order to assemble the various components of the Integrated Control Command System(ICCS). The talk gives an overview of this integration platform and the qualification strategy based on the use of equipment simulators",
        "and focuses on several tools that have been developed to integrate each sub-system and qualify the overall behavior of the ICCS. Each delivery kit of a sub-system component(Virtual Machine",
        "WIM",
        "PLC",
        ".) is scanned by antivirus software and stored in the delivery database. A specific tool allows the deployment of the delivery kits on the hardware platform (a copy of the LMJ hardware platform). Then",
        "the TMW(Testing Management Workstation) performs automatic tests by coordinating the equipment simulators behavior and the operator’s behavior. The tests configurations",
        "test scenarios and test results are stored in another database. Test results are analyzed",
        "every dysfunction is stored in an event data base which is used to perform reliability calculation of each component. The qualified software is delivered on the LMJ to perform the commissioning of each bundle."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/mocobab03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/mocobab03.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/mocobab03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-MOCOBAB03",
      "page_number": "35",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCOBAB04",
      "title": "The Advanced Radiographic Capability, a Major Upgrade of the Computer Controls for the National Ignition Facility",
      "authors": [
        "G.K. Brunton",
        "A.I. Barnes",
        "G.A. Bowers",
        "C.M. Estes",
        "J.M. Fisher",
        "B.T. Fishler",
        "S.M. Glenn",
        "B. Horowitz",
        "L.M. Kegelmeyer",
        "L.J. Lagin",
        "A.P. Ludwigsen",
        "D.T. Maloy",
        "C.D. Marshall",
        "D.G. Mathisen",
        "J.T. Matone",
        "D.L. McGuigan",
        "M. Paul",
        "R.S. Roberts",
        "G.L. Tietbohl",
        "K.C. Wilhelmsen",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "The Advanced Radiographic Capability (ARC) currently under development for the National Ignition Facility (NIF) will provide short (1-50 picoseconds) ultra high power (>1 Petawatt) laser pulses used for a variety of diagnostic purposes on NIF ranging from a high energy x-ray pulse source for backlighter imaging to an experimental platform for fast-ignition. A single NIF Quad (4 beams) is being upgraded to support experimentally driven",
        "autonomous operations using either ARC or existing NIF pulses. Using its own seed oscillator",
        "ARC generates short",
        "wide bandwidth pulses that propagate down the existing NIF beamlines for amplification before being redirected through large aperture gratings that perform chirped pulse compression",
        "generating a series of high-intensity pulses within the target chamber. This significant effort to integrate the ARC adds 40% additional control points to the existing NIF Quad and will be deployed in several phases over the coming year. This talk discusses some new unique ARC software controls used for short pulse operation on NIF and integration techniques being used to expedite deployment of this new diagnostic."
      ],
      "institutions": [
        "Funding: This work performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344. #LLNL-ABS-633793"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/mocobab04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/mocobab04.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/mocobab04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-MOCOBAB04",
      "page_number": "39",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCOBAB05",
      "title": "How to Successfully Renovate a Controls System? - Lessons Learned from the Renovation of the CERN Injectors’ Controls Software",
      "authors": [
        "G. Kruk",
        "S. Deghaye",
        "O. Kulikova",
        "V.V. Lezhebokov",
        "M. Pace",
        "P. Pera Mira",
        "E. Roux",
        "J.P. Wozniak",
        "CERN",
        "Geneva",
        "Switzerland",
        "Renovation of the control system of the CERN LHC injectors was initiated in 2007 in the scope of the Injector Controls Architecture (InCA) project. One of its main objectives was to homogenize the controls software across CERN accelerators and reuse as much as possible the existing modern sub-systems",
        "such as the settings management used for the LHC. The project team created a platform that would permit coexistence and intercommunication between old and new components via a dedicated gateway",
        "allowing a progressive replacement of the former. Dealing with a heterogeneous environment",
        "with many diverse and interconnected modules",
        "implemented using different technologies and programming languages",
        "the team had to introduce all the modifications in the smoothest possible way",
        "without causing machine downtime. After a brief description of the system architecture",
        "the paper discusses the technical and non-technical sides of the renovation process such as validation and deployment methodology",
        "operational applications and diagnostic tools characteristics and finally users’ involvement and human aspects",
        "outlining good decisions",
        "pitfalls and lessons learned over the last five years."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/mocobab05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/mocobab05.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/mocobab05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-MOCOBAB05",
      "page_number": "43",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCOBAB06",
      "title": "Integrated Monitoring and Control Specification Environment",
      "authors": [
        "S. Roy Chaudhuri",
        "H. Hayatnagarkar",
        "S. Natarajan",
        "TRDDC",
        "Pune",
        "India",
        "Monitoring and control solutions for large one-off systems are typically built in silos using multiple tools and technologies. Functionality such as data processing logic",
        "alarm handling",
        "UIs",
        "device drivers are implemented by manually writing configuration code in isolation and their cross dependencies maintained manually. The correctness of the created specification is checked using manually written test cases. Non-functional requirements – such as reliability",
        "performance",
        "availability",
        "reusability and so on – are addressed in ad hoc manner. This hinders evolution of systems with long lifetimes. For ITER",
        "we developed an integrated specifications environment and a set of tools to generate configurations for target execution platforms",
        "along with required glue to realize the entire M&C solution. The SKA is an opportunity to enhance this framework further to include checking for functional and engineering properties of the solution based on domain best practices. The framework includes three levels: domain-specific",
        "problem-specific and target technology-specific. We discuss how this approach can address three major facets of complexity: scale",
        "diversity and evolution."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/mocobab06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/mocobab06.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/mocobab06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-MOCOBAB06",
      "page_number": "47",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCOBAB07",
      "title": "Building a Maintenance and Refresh Strategy to Address Controls Hardware Diversity for the National Ignition Facility (NIF) Computer Controls System",
      "authors": [
        "M.G. Miller",
        "B.V. Beeman",
        "D. Casavant",
        "R. Demaret",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "The National Ignition Facility (NIF) at LLNL is a 2.0 Mega joule laser with ~100",
        "000 control points managed by ~2",
        "000 networked computers. The installation of the controls system began in 2002 with prototype controls for one quad. By 2004 the controls system build-out began and over the next 6 years the remainder was installed and activated. The NIF has now transitioned to a user facility with a 30 year operational lifespan. As with many large",
        "long duration projects the controls system diversity has created maintenance issues and components have reached end-of-life. This requires the controls team to develop and execute a controls hardware refresh cycle to replace aging components before reliability issues interfere with facility operations. This refresh also affects the controls system software since modernization of controls hardware and operating system require corresponding software changes and possibly coding language changes. This talk addresses the NIF controls system maintenance and refresh strategy",
        "including plans to evolve towards a more homogenous controls posture",
        "and also discusses the extended schedule required to transition to the new platform base."
      ],
      "institutions": [
        "Funding: This work performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344. #LLNL-ABS-633360"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/mocobab07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/mocobab07.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/mocobab07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-MOCOBAB07",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 7,
  "scrape_time": "2025-10-10 18:24:28"
}