{
  "session_info": {
    "id": "TUIPA",
    "name": "TUIPA - Industry Session",
    "url": "https://proceedings.jacow.org/icalepcs2017/html/tuipa.htm"
  },
  "papers": [
    {
      "paper_id": "TUIPA01",
      "title": "Safety Is One- Main- Key to Research",
      "authors": [
        "PILZ GmbH & Co. KG",
        "Ostfildern",
        "Germany",
        "Safety is not an end in itself",
        "but the enabler for functionalities. We as human beings do not recognize the presence of safety",
        "just the absence and the possible",
        "sometimes negative results. Science research especially in laser labs or synchrotrons is not possible without a structure around. These structures/activities include administrative",
        "security",
        "automation and safety issues. In Europe all \"machines and facilities\" have to fulfill the demands of the Machine Directive (MD). These demands are simplified named to provide a safe workplace according the state of the art. In order to fulfill that",
        "we apply the norms and standards",
        "in the case of the Synchrotron in Alba the IEC 61508. Pilz offered since 1995 one of the first safe PLC",
        "called PSS3000. PSS3000 was a centralized concept",
        "which could be expanded with decentral safe I/O via SafetyBUS p. This Safety PLC is used all across the world in various applications and proven by its availability and robustness. Since a couple of years these concept led into the new PSS4000 with it's Ethernet based backbone called SafetyNET p. The new PLC is fully decentral in design",
        "which a central point of view for the programming."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/tuipa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/tuipa01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/tuipa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-TUIPA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:14:47"
}