{
  "session_info": {
    "id": "WEZZO",
    "name": "WEZZO - Wednesday Oral After Third Break",
    "url": "https://proceedings.jacow.org/ecris2020/html/wezzo.htm"
  },
  "papers": [
    {
      "paper_id": "WEZZO01",
      "title": "Role of the 1+ Beam Optics Upstream the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/wezzo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/wezzo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/wezzo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-WEZZO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZZO02",
      "title": "Contaminants Reduction in ECR Charge Breeders by LNL LPSC GANIL Collaboration",
      "authors": [
        "J. Angot",
        "M.A. Baylac",
        "M. Migliore",
        "P. Sole",
        "T. Thuillier",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "GANIL",
        "Caen",
        "France",
        "Contaminants reduction in Electron Cyclotron Resonance Charge Breeders (ECRCB) is a key point for the future experiments foreseen at LNL and GANIL Isotope Separation On Line (ISOL) facilities. According to the mass separator resolution set downstream the ECRCB",
        "the radioactive ion beam study can be challenged in case of low production rate. An ongoing collaboration between LNL",
        "LPSC and GANIL laboratories aims to improve the beam purity",
        "acting on all the pollutant causes. Comparative experiments will be done at LPSC using different techniques",
        "like covering the plasma chamber wall with liners of different materials. Different configurations of the ECRCB will also be tested",
        "with the enhancement of the efficiency and charge breeding time parameters as additional objectives. A presentation of this program is proposed together with the recent upgrade of the LPSC 1+N+ test bench",
        "with the aim to improve the vacuum quality."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/wezzo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/wezzo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/wezzo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-WEZZO02",
      "page_number": "151",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZZO03",
      "title": "ECR3 Commissioning and Planning for C-14 Ion Beams at the Argonne Tandem Linac Accelerator System",
      "authors": [
        "R.H. Scott",
        "R.C. Vondrasek",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "The Electron Cyclotron Resonance Ion Source ECR3* has recently been commissioned at the Argonne Tandem Linac Accelerator System (ATLAS) at Argonne National Laboratory. While ECR3 can provide many of the stable ATLAS beams",
        "its other intended purpose is the production of C-14 ion beams which were previously produced by a now-retired negative ion source. This paper will discuss the final installation and commissioning of the ion source as well as the preparations for running C-14. A stable C-13 ethylene gas was used as a surrogate to determine the expected level of N-14 contamination when running C-14 since they are inseparable at ATLAS. We were also able to confirm consumption rates and charge state efficiencies under different C-13 running conditions in order to optimize the upcoming C-14 beam production."
      ],
      "institutions": [
        "*R. H. Scott, C. Dickerson, R. C. Pardo, and R. C. Vondrasek, \"A New ECRIS Installation at the Argonne Tandem Linac Accelerator System\", doi:10.18429/JACoW-"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/wezzo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/wezzo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/wezzo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-WEZZO03",
      "page_number": "157",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZZO04",
      "title": "Improvement of the Efficiency of the TRIUMF Charge State Booster (CSB)",
      "authors": [
        "J.A. Adegun",
        "F. Ames",
        "O.K. Kester",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "The Electron Cyclotron Resonance Ion Source (ECRIS) is a versatile and reliable ion source to charge-breed rare isotopes at the TRIUMF’s Isotopes Separation and Acceleration (ISAC) facility. Significant research work has been done by different groups worldwide to improve the efficiency and performance of the ECRIS. The most recent result of these activities is the implementation of the two-frequency plasma heating. At the ISAC facility of TRIUMF",
        "a 14.5 GHz PHOENIX booster which has been in operation since 2010 was recently upgraded to accommodate the two-frequency heating system using a single waveguide to improve its charge breeding efficiency. Besides",
        "a program has been launched to improve and optimize the extraction of charge bred isotopes in terms of beam emittance. A detailed investigation of the effect of the two-frequency heating technique on the intensity",
        "emittance",
        "and the efficiency of the extracted beam is presently being conducted and the status will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/wezzo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/wezzo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/wezzo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-WEZZO04",
      "page_number": "160",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZZO05",
      "title": "Studies of ECR Plasma Chamber Contamination With Accelerated Beams and Diamond Detectors",
      "authors": [
        "B.T. Roeder",
        "J.E. Ärje",
        "D.P. May",
        "S.J. Yennello",
        "Texas A&M University Cyclotron Institute",
        "College Station",
        "Texas",
        "USA",
        "F.P. Abegglen",
        "G.J. Kim",
        "G. Tabacaru",
        "Texas A&M University",
        "Cyclotron Institute",
        "College Station",
        "Texas",
        "USA",
        "While developing stable and re-accelerated rare isotope beams (RIB) for acceleration with the TAMU K500 cyclotron",
        "a background of various stable beams has been observed. It has been determined that this background is arising from alloys and contamination in the components of our ECR ion sources",
        "in particular",
        "the aluminum alloy plasma chamber. We have developed a detector system based on diamond detector telescopes that allows us to measure the composition of the beam after acceleration with the K500 cyclotron at TAMU. Using this technique",
        "we have been able to develop ion source and cyclotron tuning methods to minimize the stable beam background and maximize the stable beams of interest and/or the RIBs. We also endeavor to reduce the stable beam background from the ECR ion sources using techniques such as pure aluminum liners. In my presentation",
        "I plan to show our accelerated beam detection setup with diamond detectors. I also plan to present about the background we have measured with this setup from the ECRIS components",
        "in particular",
        "the plasma chamber. Finally",
        "I will comment on our efforts to reduce this background."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/wezzo05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/wezzo05.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/wezzo05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-WEZZO05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEZZO10",
      "title": "Electron Cyclotron Emission Imaging of Electron Cyclotron Resonance Ion Source Plasmas",
      "authors": [
        "L.E. Henderson",
        "H.L. Clark",
        "C.A. Gagliardi",
        "Texas A&M University",
        "Cyclotron Institute",
        "College Station",
        "Texas",
        "USA",
        "Texas A&M University Cyclotron Institute",
        "College Station",
        "Texas",
        "USA",
        "A new imaging system for Electron Cyclotron Resonance Ion Sources (ECRIS) has been designed and is being built. This K- and Ka-band camera will extract localized measurements of absolute energy and relative number density for ECRIS plasma electrons by imaging their Electron Cyclotron Emission (ECE) spectra",
        "as the frequency",
        "shape",
        "and strength of the ECE harmonics correlate directly with the local magnetic field",
        "electron energy",
        "and plasma density. The design of the overall quasi-optical system will be presented",
        "including novel ceramic optics for the radial viewports of the Cyclotron Institute’s ECRIS and metamaterial mirrors with electronically controllable reflectivity. Spatial resolution sufficient to distinguish important plasma regions and temporal resolution sufficient to study dynamic plasma processes is expected."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/wezzo10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/wezzo10.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/wezzo10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-WEZZO10",
      "page_number": "164",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-10 17:26:57"
}