{
  "session_info": {
    "id": "THOAA",
    "name": "THOAA - Contributed Oral Presentations, Industrial Accelerators and Applications",
    "url": "https://proceedings.jacow.org/PAC2013/html/thoaa.htm"
  },
  "papers": [
    {
      "paper_id": "THOAA1",
      "title": "Single-Shot Ultrafast Electron Microscopy",
      "authors": [
        "R.K. Li",
        "P. Musumeci",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "Electron microscopy is an extremely powerful tool for a variety of studies in physics",
        "biology",
        "material science",
        "and industrial applications. One of the mostly desired capabilities of a future electron microscopy is the improved resolving power in the time domain approaching ps or even fs levels. In this paper we show that the low emittance",
        "low energy spread electron beams from a state-of-the-art photoinjector can be used to take single-shot intensity-contrast snapshots of the sample. The spatial-temporal resolution can achieve 10 nm – 1 ps level. The beam optics is based on permanent quadrupole magnets which are compact and avoid the high charge density cross-over in contrast to solenoids. The proposed single-shot ultrafast electron microscopy will greatly facilitate the studies of irreversible dynamic process in materials."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thoaa1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thoaa1.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thoaa1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THOAA1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THOAA2",
      "title": "Compact, Inexpensive X-band Linacs as Radioactive Isotope Source Replacements",
      "authors": [
        "S. Boucher",
        "R.B. Agustsson",
        "L. Faillace",
        "J.J. Hartzell",
        "A.Y. Murokh",
        "S. Seung",
        "A.V. Smirnov",
        "S. Storms",
        "K.E. Woods",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "Radioisotope sources are commonly used in a variety of industrial and medical applications. The US National Research Council has identified as a priority the replacement of high-activity sources with alternative technologies",
        "due to the risk of accidents and diversion by terrorists for use in Radiological Dispersal Devices (“dirty bombs”). RadiaBeam Technologies is developing novel",
        "compact",
        "inexpensive linear accelerators for use in a variety of such applications as cost-effective replacements. The technology is based on the MicroLinac (originally developed at SLAC)",
        "an X-band linear accelerator powered by an inexpensive and commonly available magnetron. Prototypes are currently under construction. This paper will describe the design",
        "engineering",
        "fabrication and testing of these linacs at RadiaBeam. Future development plans will also be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thoaa2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thoaa2.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thoaa2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THOAA2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 01:49:21"
}