{
  "session_info": {
    "id": "FRM2I",
    "name": "FRM2I - Friday Morning Invited Oral 2",
    "url": "https://proceedings.jacow.org/HIAT2015/html/frm2i.htm"
  },
  "papers": [
    {
      "paper_id": "FRM2I01",
      "title": "Radioactive Ion Beams Programme at Vecc Kolkata, Indian Efforts",
      "authors": [
        "VECC",
        "Kolkata",
        "India",
        "An ISOL type Radioactive Ion Beam (RIB) facility has been built at VECC with K130 cyclotron that delivers proton and alpha particle beams as the driver accelerator. So far ion beams of A/q < 14 have been accelerated up to 414 keV/u using a Radio Frequency Quadrupole (RFQ) linac and three IH-Linacs. Two more IH Linac modules are being added to increase the energy to 1.0 MeV/u. RIBs of 14O",
        "42K",
        "43K",
        "41Ar and 111In have been accelerated with typical intensities of 103 to 104 pps at the separator focal plane. In the next phase",
        "the plan is to construct a new facility called ANURIB (Advanced National facility for Unstable and Rare Isotope Beams) at the upcoming new campus of VECC at New Town in Kolkata. ANURIB aims to attract a wide user community in nuclear physics",
        "nuclear-astrophysics",
        "and materials science and is being built as a national facility. There will be two primary accelerators in ANURIB aimed at producing both neutron-rich and proton-rich beams. One is a 50 MeV 100 kW superconducting electron linac photo-fission driver that is being developed in collaboration with TRIUMF Canada and the other a 50 MeV proton injector to be developed indigenously. To be built in phases starting from low energy of 1.5 keV/u in Phase-I to a final energy of 100 MeV/u in Phase-II",
        "ANURIB will be a combined ISOL and PFS type facility.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "Slides FRM2I01 [29.704 MB] reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/frm2i01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/frm2i01.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/frm2i01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-FRM2I01",
      "page_number": "300",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:39:32"
}