{
  "session_info": {
    "id": "THKL",
    "name": "THKL - Keynote Session IV",
    "url": "https://proceedings.jacow.org/icalepcs2021/html/thkl.htm"
  },
  "papers": [
    {
      "paper_id": "THKL01",
      "title": "Infrared Remote Sensors for Chinese Meteorological Satellites",
      "authors": [
        "Shanghai Institute of Technical Physics",
        "Chinese Academy of Sciences",
        "Shanghai",
        "People’s Republic of China",
        "An infrared hyper-spectral sounder",
        "Geostationary Interferometric Infrared Sounder (GIIRS) on-board FY-4A satellite",
        "is the first interferometer with less than 1 wavenumber spectral resolution that works on geostationary orbit. GIIRS takes measurements of three dimensional atmospheric structure from interference of split light beams",
        "complementing the advanced IR sounders in polar orbit. It measures the infrared radiation spectrum distribution in the middle and long wave infrared spectra of the earth by using the Fourier spectroscopic technique. GIIRS provides breakthrough measurements with the temporal",
        "horizontal",
        "and vertical resolution needed to resolve the quickly changing water vapor and temperature structures associated with severe weather events. Through the atmospheric detection made by GIIRS",
        "the weather trend is calculated for the numerical weather prediction model",
        "and the large-scale",
        "rapid",
        "continuous and long-term meteorological measurements have been realized. The international Meteorological community is eager to use the new type of data and get experience with it",
        "as Dr. Tillmann Mohr",
        "former Director-General of EUMETSAT",
        "mentioned."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thkl01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thkl01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thkl01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THKL01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:06:43"
}