{
  "session_info": {
    "id": "MOOA",
    "name": "MOOA - Monday Contributed Oral Session A",
    "url": "https://proceedings.jacow.org/medsi2020/html/mooa.htm"
  },
  "papers": [
    {
      "paper_id": "MOOA01",
      "title": "Overcoming Challenges during the Insertion Device Straight Section Component Production and Tuning Phase of the Advanced Photon Source Upgrade",
      "authors": [
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "The Advanced Photon Source Upgrade (APSU) scope for insertion devices (IDs) and ID vacuum systems is extensive. Thirty-five of the 40 straight sections in the storage ring will be retrofitted with new 4.8-meter-long Superconducting Undulators (SCUs) or a mix of new and reused Hybrid-Permanent Magnet Undulators (HPMUs). All 35 ID straight sections will require new vacuum systems and new HPMU control systems. Production is well underway at multiple manufacturing sites around the world for these components. Simultaneously",
        "ID assembly and HPMU tuning is occurring onsite at Argonne National Laboratory (ANL). In addition to component production and assembly/tuning activities",
        "our team also started the ID swap out program at the Advanced Photon Source (APS) in late 2020. This program allows us to remove HPMUs intended for reuse from the APS storage ring and retune them to meet the APSU magnetic specifications to reduce the tuning workload during dark time. These activities have presented technical and logistical challenges that are as unique as the components themselves. Additionally",
        "the ongoing Covid-19 pandemic presented unforeseen challenges that required new work processes to be created to sustain pace and quality of work while maintaining the high workplace safety standards required at Argonne. This paper will summarize the many challenges we encountered during the course of the project and how they were overcome."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/mooa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/mooa01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/mooa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-MOOA01",
      "page_number": "6",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOA02",
      "title": "Experience with the Vacuum System for the First Fourth Generation Light Source: MAX IV",
      "authors": [
        "E. Al-Dmour",
        "M.J. Grabski",
        "K. Åhnberg",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "The 3 GeV electron storage ring of the MAX IV laboratory is the first storage-ring-based synchrotron radiation facility with small aperture and with the inner surface of almost all the vacuum chambers along its circumference coated with non-evaporable getter (NEG) thin film. This concept implies challenges during the whole project phase from design into operation. The fast conditioning of the vacuum system and over five years of reliable accelerator operation have demonstrated that the chosen design proved to be good and does not impose limits on the operation. A summary of the vacuum system design",
        "production",
        "installation and performance is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/mooa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/mooa02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/mooa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-MOOA02",
      "page_number": "10",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOA03",
      "title": "Design Study of Vacuum System for a 4th Generation Storage Ring in Korea",
      "authors": [
        "PAL",
        "Pohang",
        "Republic of Korea"
      ],
      "institutions": [],
      "abstract": "It will be presented a new concept vacuum system for a 4th generation storage ring which consists of the distributed pumping and photon absorbing by aluminuim extracted chamber with pill type getters.",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/mooa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/mooa03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/mooa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-MOOA03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 23:22:53"
}