{
  "session_info": {
    "id": "MOOAMH",
    "name": "MOOAMH - M3",
    "url": "https://proceedings.jacow.org/ECRIS2014/html/mooamh.htm"
  },
  "papers": [
    {
      "paper_id": "MOOAMH01",
      "title": "Simulation Of The CERN GTS-LHC ECR Ion Source Extraction System With Lead And Argon Ion Beams",
      "authors": [
        "V. Toivanen",
        "G. Bellodi",
        "D. Küchler",
        "A.M. Lombardi",
        "R. Scrivens",
        "J.T. Stafford-Haworth",
        "CERN",
        "Geneva",
        "Switzerland",
        "A comprehensive study of beam formation and beam transport has been initiated in order to improve the performance of the CERN heavy ion injector",
        "Linac3. As part of this study",
        "the ion beam extraction system of the CERN GTS-LHC 14.5 GHz Electron Cyclotron Resonance Ion Source (ECRIS) has been modelled with the ion optical code IBSimu. The simulations predict self-consistently the triangular and hollow beam structures which are often observed experimentally with ECRIS ion beams. The model is used to investigate the performance of the current extraction system and provides a basis for possible future improvements. In addition",
        "the extraction simulation provides a more realistic representation of the initial beam properties for the beam transport simulations",
        "which aim to identify the performance bottle necks along the Linac3 low energy beam transport. The results of beam extraction simulations with Pb and Ar ion beams from the GTS-LHC will be presented and compared with experimental observations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/mooamh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/mooamh01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/mooamh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-MOOAMH01",
      "page_number": "23",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOAMH02",
      "title": "High Current Proton and Deuteron Beams for Accelerators and Neutron Generators",
      "authors": [
        "V. Skalyga",
        "S. Golubev",
        "I. Izotov",
        "S. Razin",
        "V. Sidorov",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "T. Kalvas",
        "H. A. Koivisto",
        "O.A. Tarvainen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "A.V. Maslennikova",
        "A. Volovecky",
        "Nizhny Novgorod State Medical Academy",
        "Nizhny Novgorod",
        "Russia",
        "This paper presents the latest results of high current proton and deuteron beam production at SMIS 37 at the Institute of Applied Physics. In this experimental setup the plasma is created by 37.5 GHz gyrotron radiation with power up to 100 kW in a simple mirror trap. High microwave power and frequency allow sustaining higher density hydrogen plasma in comparison to conventional ECRIS's or microwave sources. The low ion temperature",
        "on the order of a few eV",
        "is beneficial to produce proton beams with low emittance. Latest experiments with hydrogen and deuterium show possibility of beam formation with currents up to 550 mA at high voltages below 45 kV with normalized rms emittance lower than 0.2 pi*mm*mrad. Such beams have a high potential for application in future accelerator research. Also in frames of the present paper it is suggested to use such an ion source in a scheme of D-D neutron generator. Such ion source can produce deuteron ion beams with current density up to 700-800 mA/cm2. Generation of the neutron flux with density at the level of 7-8*1010 s−1cm-2 could be obtained in case of TiD2 target bombardment with deuteron beam accelerated to 100 keV."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/mooamh02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/mooamh02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/mooamh02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-MOOAMH02",
      "page_number": "30",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOAMH03",
      "title": "Optimization Of Low-Energy Beam Transport",
      "authors": [
        "H.R. Kremers",
        "J.P.M. Beijers",
        "S. Brandenburg",
        "KVI",
        "Groningen",
        "The Netherlands",
        "We have studied the extraction and transport of a low-energy ion beam between an Electron Cyclotron Resonance (ECR) Ion Source and the analyzing magnet. This first part of the transport line is particularly sensitive to emittance blowup caused by ion-optical aberrations and non-paraxiality of the beam. This can be prevented by an appropriate focussing element between ion source and analyzing magnet. We present the results of beam transport simulations for different focussing elements including an einzel lens",
        "solenoid and quadrupole element. These calculations",
        "verified by measurements",
        "lead to a design of an optimal",
        "low-energy beam transport line for ion beams with large beam divergences."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/mooamh03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/mooamh03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/mooamh03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-MOOAMH03",
      "page_number": "33",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOAMH04",
      "title": "Axial Symmetric Open Magnetic Traps with Depressed Transversal Losses of Plasmas",
      "authors": [
        "V. Sidorov",
        "S. Golubev",
        "I. Izotov",
        "S. Razin",
        "V. Skalyga",
        "A. Vodopyanov",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "Development trend of the modern ECR ion sources is connected with the continued increase of the heating radiation frequency and",
        "as a consequence",
        "increase of the magnetic field value. In this case the construction of the MHD stable non-axial symmetric magnetic systems becomes rather complicated. Thus",
        "the search of axial symmetric magnetic systems with depressed transversal losses caused by MHD instabilities is in a great demand. In this report some of the possible versions of such magnetic systems are presented: cusp magnetic trap",
        "system with magnetic divertor and the mirror trap with the differential rotation layer in plasmas. Perspectives of using these systems in the ECR ion sources according to the results of experimental investigations on SMIS 37 setup in Nizhny Novgorod are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/mooamh04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/mooamh04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/mooamh04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-MOOAMH04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOOAMH05",
      "title": "Combination of Two ECRIS Calculations: Plasma Electrons and Extracted Ions",
      "authors": [
        "S. Biri",
        "R. Rácz",
        "ATOMKI",
        "Debrecen",
        "Hungary",
        "R. Lang",
        "J. Mäder",
        "F. Maimone",
        "B.R. Schlei",
        "P. Spädtke",
        "K. Tinschert",
        "GSI",
        "Darmstadt",
        "Germany",
        "In strongly magnetized ECRIS plasmas collisions do not influence the path of the charged particle. Electrons and ions can move more freely only along the magnetic field line compared to the transverse direction. Extraction simulation requires that the trajectories of charged particles have to be traced through the plasma chamber. In previous simulations the particle density at the beginning of the trajectory deep inside the plasma has been unknown. Now the full 3D electron tracking within the plasma chamber has been combined with the generation of initial ion starting conditions including particle density for ion tracking. The TrapCAD code has been used to determine the electron spatial distribution in a certain energy window. The idea is that at the places where the electron reaches a specific energy",
        "an ion trajectory can be started. The magnetic field has been modeled with OPERA. The computer code"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/mooamh05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/mooamh05.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/mooamh05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-MOOAMH05",
      "page_number": "38",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-10 17:28:17"
}