{
  "session_info": {
    "id": "MOCC",
    "name": "MOCC - Contributed Talk in Monday-C",
    "url": "https://proceedings.jacow.org/IBIC2012/html/mocc.htm"
  },
  "papers": [
    {
      "paper_id": "MOCC01",
      "title": "UV/X-ray Diffraction Radiation for Non-intercepting Micron-scale Beam Size Measurement",
      "authors": [
        "L.M. Bobb",
        "N. Chritin",
        "T. Lefèvre",
        "CERN",
        "Geneva",
        "Switzerland",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "L.M. Bobb",
        "V. Karataev",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "Diffraction Radiation (DR) is produced when a relativistic charged particle moves in the vicinity of a medium. The electric field of the charged particle polarizes the target atoms which then oscillate",
        "emitting radiation with a very broad spectrum. The spatial-spectral properties of DR are sensitive to a range of electron beam parameters. Furthermore",
        "the energy loss due to DR is so small that the electron beam parameters are unchanged. Therefore DR can be used to develop non-invasive diagnostic tools. The aim of this project is to measure the transverse (vertical) beam size using incoherent DR. To achieve the micron-scale resolution required by CLIC",
        "DR in the UV and X-ray spectral-range must be investigated. During the next few years",
        "experimental validation of such a scheme will be conducted on the CesrTA at Cornell University",
        "USA. Here we present the current status of the experiment preparation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/mocc01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/mocc01.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/mocc01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-MOCC01",
      "page_number": "24",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCC03",
      "title": "The First Electron Bunch Measurement by means of DAST Organic EO Crystals",
      "authors": [
        "Y. Okayasu",
        "S. Matsubara",
        "T. Togashi",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "JAEA/Kansai",
        "Kyoto",
        "Japan",
        "A. Iwasaki",
        "S. Owada",
        "The University of Tokyo",
        "Tokyo",
        "Japan",
        "RIKEN ASI",
        "Sendai",
        "Miyagi",
        "Japan",
        "RIKEN Advanced Science Insititute",
        "Sendai",
        "Miyagi",
        "Japan",
        "K. Ogawa",
        "T. Sato",
        "H. Tomizawa",
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "RIKEN",
        "Saitama",
        "Japan",
        "Pilot user experiments via the seeded FEL have been demonstrated at the Prototype Test Accelerator (VUV-FEL)",
        "SPring-8 from July",
        "2012. A precise measurement of the electron bunch charge distribution (BCD) is crucial key to keep spatial and temporal overlaps between high-order harmonic (HH) laser pulses and electron bunches. R&D of the 3D-BCD monitor with a single-shot detection has been extensively promoted at SPring-8. The monitor adopts a spectral decoding based Electro-Optic (EO) sampling technique that is non-destructive and enables real-time reconstruction of the 3D-BCD with a temporal resolution of 30- to 40-fs (FWHM). So far",
        "such EO sampling based BCD monitors have been developed by utilizing inorganic EO crystals such as ZnTe and their temporal resolutions are limited to ~130 fs (FWHM). As a part of this project",
        "the first BCD measurement with an organic EO crystal DAST has been successfully demonstrated at the facility. Signal intensities",
        "temporal resolutions and radiation related issues via both ZnTe and DAST are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/mocc03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/mocc03.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/mocc03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-MOCC03",
      "page_number": "29",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCC04",
      "title": "Improvement of Screen Monitor with Suppression of Coherent-OTR Effect for SACLA",
      "authors": [
        "S. Matsubara",
        "Y. Otake",
        "RIKEN/SPring-8",
        "Hyogo",
        "Japan",
        "SES",
        "Hyogo-pref.",
        "Japan",
        "RIKEN Spring-8 Harima",
        "Hyogo",
        "Japan",
        "The construction of SACLA (SPring-8 Angstrom Compact free electron LAser) was already completed and it is under operation. A screen monitor (SCM) system has been developed and was installed in order to obtain a direct image of a transverse beam profile with a spatial resolution of about 10 um",
        "which is required to investigate electron-beam properties",
        "such as a beam emittance. The SCM originally has a stainless steel target as a OTR radiator or a Ce:YAG crystal as a scintillation target. At the beginning of the SACLA operation",
        "strong coherent OTR (COTR)",
        "which made an incorrect beam profile",
        "was observed after bunch compressors. In order to suppress the COTR on the SCM",
        "the stainless steel target was replaced to the Ce:YAG scintillation target. Since the COTR was still generated from the Ce:YAG target",
        "a spatial mask was employed. The mask was mounted on the center of the optical line of the SCM",
        "because the COTR light is emitted forward within ~1/γ radian",
        "while the scintillation light has not angular dependence. Clear beam profiles with a diameter of a few tens of micro-meter are observed by means of the SCMs with this simple improvement."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/mocc04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/mocc04.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/mocc04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-MOCC04",
      "page_number": "34",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 18:01:51"
}