{
  "session_info": {
    "id": "WEXA",
    "name": "WEXA - Fundamental-non Nb II",
    "url": "https://proceedings.jacow.org/srf2017/html/wexa.htm"
  },
  "papers": [
    {
      "paper_id": "WEXA01",
      "title": "High Performance Nb3Sn Cavities",
      "authors": [
        "D.L. Hall",
        "M. Liepe",
        "R.D. Porter",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "T. Arias",
        "P. Cueva",
        "D. Liarte",
        "D.A. Muller",
        "J.P. Sethna",
        "N. Sitaraman",
        "Cornell University",
        "Ithaca",
        "New York",
        "USA",
        "In recent years",
        "1.3 GHz single-cell cavities coated with Nb3Sn at Cornell University have repeatedly demonstrated quality factors of >1010 at 4.2 K and >15 MV/m. Ongoing research is currently focussed on the impact of intrinsic and extrinsic factors that limit the quality factor and quench field in these cavities. New single-cell cavities have been commissioned to enable further exploration of the coating parameter space. Experimental studies on both cavities and sample coupons have been supplemented by theoretical work done on layer growth",
        "trapped vortex motion and flux entry. In this paper",
        "we provide a comprehensive overview of the latest developments on Nb3Sn cavities",
        "including work conducted in collaboration with the new NSF Centre for Bright Beams",
        "with a brief summary on work being done in the field at large."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/wexa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/wexa01.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/wexa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-WEXA01",
      "page_number": "667",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXA02",
      "title": "Material Studies for Understanding of Nb3Sn Cavity Performance Limiting Mechanisms",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Understanding the link between effect of the cavity processing at microscopic level and performance of the cavity after this processing allows new developments of the processing technologies. We have performed extensive microscopic studies of Nb3Sn coated Nb cavity cutouts (from Cornell) with known dissipation characteristics which allowed us to identify material features responsible for the local heating. Using SEM",
        "STEM/EDS",
        "TEM/NED and XRD characterization of Nb3Sn-coated Nb cavity cutouts we show structural and compositional flaws potentially responsible for the poor performance. Analysis of well SRF-characterized Nb3Sn also provided a valuable insight into the nucleation and growth processes",
        "which brings us ahead with understanding of performance-limiting mechanisms in Nb3Sn.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/wexa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/wexa02.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/wexa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-WEXA02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXA03",
      "title": "High-performance Thin-film Niobium Produced via Chemical Vapor Deposition (CVD)",
      "authors": [
        "R.D. Porter",
        "D.L. Hall",
        "M. Liepe",
        "J.T. Maniscalco",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "V.M. Arrieta",
        "S.R. McNeal",
        "W.E. Williams",
        "Ultramet",
        "Pacoima",
        "California",
        "USA",
        "Bulk niobium cavities have been the standard for superconducting particle accelerators for many years. However",
        "the cost of high RRR niobium start materials makes them expensive. The use of Chemical Vapor Deposition (CVD) processing technologies to produce thin Nb films on low-cost substrates (e.g. copper) offers a method to significantly reduce the cost of accelerator cavity fabrication while increasing cavity performance capabilities. Recent optimization of CVD niobium processes for high RRR Nb films has led to RF performance approaching that of bulk Nb. In collaboration with Ultramet",
        "Cornell continues to explore the potential of CVD techniques. This paper presents results from a detailed study of CVD thin film Nb materials produced by Ultramet on 5-inch diameter copper and molybdenum substrates",
        "including RF performance results with T-mapping and detailed surface analysis of performance limiting regions. Our work shows that CVD-based cavity fabrication methods are a promising alternative to sheet-formed bulk cavities",
        "and to other thin Nb film techniques",
        "warranting further development. Additional results from the field will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/wexa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/wexa03.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/wexa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-WEXA03",
      "page_number": "674",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXA04",
      "title": "SRF Cavity Coatings: Review of Alternative Materials and Coating Techniques",
      "authors": [
        "G.J. Rosaz",
        "S. Aull",
        "E.A. Ilyina",
        "A. Sublet",
        "W. Venturini Delsolaro",
        "CERN",
        "Geneva",
        "Switzerland",
        "R/D is ongoing at CERN to study A15 coatings on copper substrates for applications on SRF cavities",
        "in particular for future large accelerators like the FCC. The presentation will give an overview of the techniques and of the main results achieved so far"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/wexa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/wexa04.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/wexa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-WEXA04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXA05",
      "title": "Dirty Layers, Bi-layers and Multi-layers: Insights from Muon Spin Rotation Experiments",
      "authors": [
        "T. Junginger",
        "R.E. Laxdal",
        "D.W. Storey",
        "E. Thoeng",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "D.L. Hall",
        "M. Liepe",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "HZB",
        "Berlin",
        "Germany",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "T. Prokscha",
        "Z. Salman",
        "A. Suter",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Victoria University",
        "Victoria",
        "B.C.",
        "Canada",
        "T. Tan",
        "W.K. Withanage",
        "M.A. Wolak",
        "X. Xi",
        "Temple University",
        "Philadelphia",
        "USA",
        "UBC & TRIUMF",
        "Vancouver",
        "British Columbia",
        "Canada",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "UBC",
        "Vancouver",
        "B.C.",
        "Canada",
        "The multilayer approach is being investigated for SRF applications since 2006 \"*\". More recently the option of using a bilayer system of two superconductors has been considered as an alternative approach to reach accelerating gradients beyond bulk niobium or to explain the gradient enhancement from a 120°C bake by introduction of a 'dirty layer \"**\"'. In this talk results are presented from two muon spin rotation experiments at TRIUMF and PSI. The former measures the field of first entry Hentry. It will be shown that MgB2 and Nb3Sn on top of Nb both push Hentry above Hc1 to a value consistent with Hsh",
        "independent of the layer thickness. 120°C baking increases Hentry slightly but significantly above Hc1. Using the low energy muon beam at PSI we show that there is a long range proximity effect in a bilayer system of NbTiN on Nb. This effect yields a stronger decay of the RF field with depth as expected for pure NbTiN",
        "opposite to what has been predicted for a bi-layer system due to counter current flow at the superconductor-superconductor interface \"***\". An insulating layer suppresses this proximity effect.",
        "* Gurevich",
        "A. APL 88.1 (2006)  ** Checchin",
        "M. Diss. Illinois Institute of Technology",
        "2016.  Kubo",
        "T. Superconductor Science and Technology 30.2 (2016) *** Kubo",
        "T et al. APL 104.3 (2014)"
      ],
      "institutions": [],
      "abstract": "A-M. Valente-Feliciano",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/wexa05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/wexa05.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/wexa05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-WEXA05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXA06",
      "title": "The role of cool down dynamics on the performance on Nb/Cu cavities– HIE-ISOLDE resonator as an example",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "The High intensity and Energy upgrade of the ISOLDE facility (HIE-ISOLDE) is operated by superconducting quarter-wave resonators (QWR) made of a thin Nb film sputtered on a Cu substrate (Nb/Cu).The intrinsic quality factor of these cavities strongly depend on the thermal gradient (less than 1K) between top and bottom of the cavity as pointed out by P. Zhang in SRF15. Although the best cavity performance can be achieved by careful cool down",
        "the physics of this phenomenon is not fully understood. In this study",
        "possible hypotheses and experimental efforts are presented. A similar phenomenon has been reported on the elliptical bulk Nb cavities",
        "and its physics was interpreted as flux expulsion efficiency. Since Nb/Cu QWR is insensitive to the flux expulsion",
        "the thermoelectrically induced magnetic field due to Nb/Cu bi-metal structure is supposed to be the most promising hypothesis instead. Some of the model calculations and experiments to measure such a thermoelectric effect are explained. Recent findings showed that thermal gradient does not only affect the residual resistance but also temperature-dependent resistance. A result on a seamless QWR without welding will be also shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/wexa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/wexa06.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/wexa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-WEXA06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXA07",
      "title": "Theoretical Estimates of Maximum Fields in Superconducting Resonant Radio Frequency Cavities: Stability Theory, Disorder, and Laminates",
      "authors": [
        "D. Liarte",
        "M. Liepe",
        "J.P. Sethna",
        "Cornell University",
        "Ithaca",
        "New York",
        "USA",
        "Forschungszentrum Jülich",
        "Peter Gruenberg Institut",
        "Jülich",
        "Germany",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Brigham Young University",
        "Provo",
        "USA",
        "Theoretical limits to the performance of superconductors in high magnetic fields parallel to their surfaces are of key relevance to current and future accelerating cavities. We present intuitive arguments and simple estimates for Hsh",
        "and combine them with rigorous calculations. We explore the effects of materials anisotropy and the danger of disorder in nucleating vortex entry. Will we need to control surface orientation in the layered compound MgB2? Can we estimate theoretically whether dirt and defects make these new materials fundamentally more challenging to optimize than niobium? We discuss and analyze recent proposals to use thin superconducting layers or laminates to enhance the performance of superconducting cavities. Flux entering a laminate can lead to so-called pancake vortices; we consider the physics of the dislocation motion and potential re-annihilation or stabilization of these vortices after their entry."
      ],
      "institutions": [
        "Funding: This work was supported by the US National Science Foundation under Award OIA-1549132, the Center for Bright Beams."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/wexa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/wexa07.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/wexa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-WEXA07",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXA08",
      "title": "Current-blocking Grain Boundaries in SRF Cavities and RF Dissipation Due to Nonlinear Dynamics of Josephson Vortices under Strong RF Fields",
      "authors": [
        "A.V. Gurevich",
        "A. Sheikhzada",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "Grain boundaries (GBs) in polycrystalline Nb cavities do not significantly degrade the SRF performance. However",
        "the situation may change for Nb3Sn in which GBs can partially obstruct current and pin vortices",
        "as it has been established in many previous studies. Such weak-linked GBs can cause a medium-field Q slope and cavity quench triggered by guided penetration of vortices along networks of GBs. Vortices trapped at GBs can also contribute to the residual surface resistance. This talk gives an overview of current-limiting mechanisms of GBs and dissipation of vortices in strongly-coupled GBs under RF field. We present results of extensive numerical simulations of vortices in GBs in polycrystalline bulk and thin films",
        "and contribution of vortices to the RF dissipation. Our simulations revealed Cherenkov instability of Josephson vortices driven by strong RF currents and generation of vortex-antivortex pairs",
        "dynamic transition of vortices into phase slips in thin films",
        "and dynamic interaction of moving vortices with pinning centers. Contributions of these mechanisms to the field dependent surface resistance and reduction of the RF breakdown field is discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/wexa08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/wexa08.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/wexa08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-WEXA08",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 8,
  "scrape_time": "2025-10-11 03:41:42"
}