{
  "session_info": {
    "id": "TUPB",
    "name": "TUPB - Poster in Room 202 on Tuesday",
    "url": "https://proceedings.jacow.org/IBIC2012/html/tupb.htm"
  },
  "papers": [
    {
      "paper_id": "TUPB48",
      "title": "Beam Instrumentation for the COSY Electron Cooler",
      "authors": [
        "V. Kamerdzhiev",
        "L.J. Mao",
        "K. Reimers",
        "FZJ",
        "Jülich",
        "Germany",
        "E.A. Bekhtenev",
        "V.N. Bocharov",
        "M.I. Bryzgunov",
        "A.V. Bubley",
        "A.P. Denisov",
        "G.V. Karpov",
        "V.M. Panasyuk",
        "V.V. Parkhomchuk",
        "V.B. Reva",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "HIM",
        "Mainz",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The report deals with beam instrumentation of the electron cooler for COSY storage ring. The electron cooler is an electrostatic accelerator designed for beam energy up to 2 MeV and electron current up to 3 A with recuperation. The electron beam is immersed in longitudinal magnetic field so the electron motion is strongly magnetized. The control electrode in the electron gun is composed of four electrically isolated sectors. Applying AC voltage to one sector allows tracing of motion of that particular part of the beam. The electron beam shape is registered with the combination of 4-sector electron gun and the BPMs. This method allows observing both dipole and quadruple (galloping) modes of electron beam oscillation. Compass probe for measuring and tuning the direction of magnetic field in the cooling section is described. A profile monitor based on a few small Faraday cups for measuring distribution of the electron beam is presented.",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb48_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb48.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb48_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB48",
      "page_number": "468",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB49",
      "title": "Electron Cloud Density Measurements using Resonant TE Waves at CesrTA",
      "authors": [
        "J.P. Sikora",
        "M.G. Billing",
        "D.O. Duggins",
        "Y. Li",
        "D. L. Rubin",
        "R.M. Schwartz",
        "K.G. Sonnad",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The Cornell Electron Storage Ring has been reconfigured as a test accelerator (CesrTA) with beam energies ranging from 2 GeV to 5 GeV of either positrons or electrons. Research at CesrTA includes the study of the growth",
        "decay and mitigation of electron clouds in the storage ring. Electron Cloud (EC) densities can be measured by resonantly exciting the beam-pipe with microwaves. The EC density will change beam-pipe's resonant frequency by an amount that is proportional to the local electric field squared of the standing waves. When the EC density is not uniform",
        "it is especially important to know the standing wave pattern in order to obtain an absolute EC density measurement. We will present our current understanding of this technique in the context of new test sections of beam-pipe installed in August 2012. This will include bench measurements of standing waves in the beam-pipe",
        "simulations of this geometry and recent EC density measurements with beam."
      ],
      "institutions": [
        "Funding: This work is supported by the US National Science Foundation PHY-0734867, PHY-1002467, and the US Department of Energy DE-FC02-08ER41538, DE-SC0006505."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb49_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb49.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb49_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB49",
      "page_number": "471",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB51",
      "title": "Gatling Gun Test Stand Instrumentation",
      "authors": [
        "D.M. Gassner",
        "I. Ben-Zvi",
        "J.C. Brutus",
        "C. Liu",
        "M.G. Minty",
        "A.I. Pikin",
        "O.H. Rahman",
        "E.J. Riehn",
        "J. Skaritka",
        "E. Wang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "In order to reach the design eRHIC luminosity 50mA of polarized electron current is needed. This is far beyond what the present state-of-the-art polarized electron cathode can deliver. A high average polarized current injector based on the Gatling Gun principle is being designed. This technique will employ multiple cathodes and combine their multiple bunched beams along the same axis. A proof-of-principle test bench will be constructed that includes a 220 keV Gatling Gun",
        "beam combiner",
        "diagnostics station",
        "and collector. The challenges for the instrumentation systems and the beam diagnostics that will measure current",
        "profile",
        "position",
        "and halo will be described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb51_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb51.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb51_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB51",
      "page_number": "474",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB53",
      "title": "Abort Diagnostics and Analysis during KEKB Operation",
      "authors": [
        "H. Ikeda",
        "J.W. Flanagan",
        "T. Furuya",
        "M. Tobiyama",
        "KEK",
        "Ibaraki",
        "Japan",
        "Mitsubishi Electric System & Service Co.",
        "Ltd",
        "Tsukuba",
        "Japan",
        "KEKB has stopped since June 2010 for upgrading the luminosity 40 times",
        "i.e. SuperKEKB. During the operation of 11 years",
        "a pair of controlled beam abort systems worked more than 10000 times to protect the hardware components of KEKB accelerator and the detector against the high intensity beams of LER and HER. Optimization of the abort trigger was necessary to balance efficient operation with the safety of the hardware. Therefore",
        "we analyzed one-by-one all of the aborts",
        "and continually adjusted the abort system. The diagnostic system was based on a high-sampling-rate data logger that recorded beam currents",
        "RF signals and beam loss monitor signals. The beam oscillation signals",
        "vacuum pressure and detector dose rate were also examined. This paper describes the typical abort causes",
        "optimizations of abort levels",
        "and abort statistics over approximately eight years after having arrived at high beam current operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb53_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb53.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb53_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB53",
      "page_number": "477",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB57",
      "title": "Extreme Light Infrastructure (ELI Beamlines) - Research and Technology with new Ultra-short Pulse Intense Laser driven Sources of Energetic Photons and Charged Particles",
      "authors": [
        "L. Pribyl",
        "L. Juha",
        "G. Korn",
        "T. Levato",
        "B. Rus",
        "S. Ter-Avetisyan",
        "Czech Republic Academy of Sciences",
        "Institute of Physics",
        "Prague",
        "Czech Republic",
        "INFN/LNS",
        "Catania",
        "Italy",
        "LOA",
        "Palaiseau",
        "France",
        "We will be giving an overview on the development of the 'ELI-Beamline facility'",
        "which will be a high-energy",
        "repetition-rate laser pillar of the ELI (Extreme Light Infrastructure) project. It will be an international facility for both academic and applied research",
        "slated to provide user capability since the beginning of 2016. The main purpose of the facility is the generation and applications of laser driven high-brightness X-ray sources and accelerated particles (electrons",
        "protons and ions). The laser system will be delivering pulses with length ranging between 10 and 150 fs and will provide high-energy Petawatt and 10-PW peak powers. We will concentrate on the development of short photon wavelength (20 eV-100 keV) laser driven sources and their practical implementation. The sources are either based on direct interaction of the laser beam with a gaseous or solid target or will first accelerate electrons which then will interact with laser produced wigglers or directly injected into undulators. The main planned short pulse laser driven x-ray sources and their parameters will be presented together with requirements on the relevant beam detectors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb57_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb57.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb57_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB57",
      "page_number": "482",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB60",
      "title": "Beam Diagnostics of Central Japan Synchrotron Radiation Research Facility Accelerator Complex",
      "authors": [
        "M. Hosaka",
        "A. Mano",
        "H. Morimoto",
        "E. Nakamura",
        "K. Takami",
        "T. Takano",
        "Y. Takashima",
        "N. Yamamoto",
        "Nagoya University",
        "Nagoya",
        "Japan",
        "KEK",
        "Ibaraki",
        "Japan",
        "UVSOR",
        "Okazaki",
        "Japan",
        "SAGA",
        "Tosu",
        "Japan",
        "A. Murata",
        "K. Nakayama",
        "Toshiba",
        "Yokohama",
        "Japan",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "A new synchrotron radiation facility",
        "Central Japan Synchrotron Radiation Research Facility is built in Aichi area. The light source accelerator complex consists of a 1.2 GeV compact electron storage ring and a full energy injector for top-up operation. The key equipments of the accelerator are four 5 T superconductive bending magnets. Although the acceleration energy of the storage ring is relatively low",
        "synchrotron radiation from the superconductive bending magnet reaches hard X-ray region and can be provided for more than 10 beamlines. Construction of the facility started in 2010 and finished in Apr. 2012. Commissioning of the accelerator complex started in Mar. 2012. We adapted a turn-by-turn beam position monitoring system based on a digital oscilloscope developed at the UVSOR. In the presentation",
        "we report on details of beam diagnostics conducted during the commissioning."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb60_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb60.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb60_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB60",
      "page_number": "486",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB61",
      "title": "The First Experience with the LHC Beam Gas Ionisation Monitor",
      "authors": [
        "M. Sapinski",
        "W. Andreazza",
        "B. Dehning",
        "A. Guerrero",
        "M. Patecki",
        "R. Versteegen",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [],
      "abstract": "The Beam Gas Ionisation Monitors (BGI) are used to continuously measure the beam size at the LHC. This paper describes the detectors and their operation and discusses the issues encountered during the commissioning. It also discusses the various calibration procedures used to correct for non-uniformity of Multi-Channel plates and to correct the beam size for effects affecting the electron trajectory after ionisation.",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb61_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb61.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb61_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB61",
      "page_number": "489",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB63",
      "title": "Development of Turn-by-turn Beam Diagnostic System using Undulator Radiation",
      "authors": [
        "M. Masaki",
        "A. Mochihashi",
        "H. Ohkuma",
        "S. Takano",
        "K. Tamura",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "At the diagnostic beamline II (BL05SS) of the SPring-8 storage ring",
        "a turn-by-turn beam diagnostic system using undulator radiation has been developed to observe fast phenomena such as stored beam oscillations during the top-up injections",
        "blowups of beam size and energy spread coming from the instabilities of a high current single bunch and so on. The fast diagnostic system observes a spatial profile of the undulator radiation on a selected harmonic number. Especially",
        "the higher harmonic radiations than the 10th-order are sensitive to the energy spread. A fluorescence screen (YAG:Ce) with afterglow of several tens of nano-second converts the radiation profile into visible light image. The imaging optics makes the horizontal and vertical profiles as two line images by one-dimensional focusing using cylindrical lenses. A fast-gated CCD camera with image intensifier simultaneously captures the two line images. The kinetics readout mode of the fast CCD camera is used to register the spatial profiles of several tens of turns in one flame. The principle and experimental setup of the turn-by-turn diagnostic system",
        "and examples of beam observations will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb63_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb63.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb63_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB63",
      "page_number": "492",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB64",
      "title": "Methods to Reduce the System Error for High Power MSSW Emittance Meter",
      "authors": [
        "S.X. Peng",
        "J. Chen",
        "Z.Y. Guo",
        "P.N. Lu",
        "H.T. Ren",
        "Y. Xu",
        "Z.X. Yuan",
        "J. Zhao",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Recently a new Multi-Slit Single-Wire (MSSW) type high power beam emittance meter named as HIBEMU-5 has developed in Peking University (PKU). Compared to previous MSSW devices",
        "HIBEMU-5 greatly reduced the system error from 16.4% to 3.7% by specific designs to solve the incomplete short-slit sampling and fixed slit-wire distance. The problems of previous PKU devices are analyzed in part one. In part two",
        "we describe the specific updating methods to solve its short-slit disadvantage by re-designing a longer-slit board with sufficient cooling",
        "detail the mechanical scheme of changing the slit-wire distance for different beam divergence. The commissioning results given at part three prove that this new long slits design is successful to complete the beam sampling without being distorted by high power H+ beam. And the movable wire cup is able to locate the best measurement position for different beam focusing."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb64_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb64.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb64_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB64",
      "page_number": "496",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB65",
      "title": "Transverse-acceptance Measurement System for the JAEA AVF Cyclotron",
      "authors": [
        "H. Kashiwagi",
        "S. Kurashima",
        "N. Miyawaki",
        "S. Okumura",
        "JAEA/TARRI",
        "Gunma-ken",
        "Japan",
        "We are developing an acceptance measurement system to evaluate transverse phase-space matching of the emittance of an injection beam to the acceptance of the AVF cyclotron. The system is composed of a phase-space collimator in the low energy section and a beam intensity monitor in the high energy section. The phase-space collimator",
        "which consists of two pairs of slits",
        "allows very small-emittance beams to be injected into the cyclotron by limiting position and divergence angle of the beam from an ion source. The beam intensity monitor is used to obtain the ratio of beam intensity at the collimator to that at the monitor. In acceptance measurement",
        "the small-emittance beams at various positions in a transverse phase-plane are injected to determine the distribution of relative transmission in the phase plane. In preliminary tests",
        "only a part of acceptance was able to be measured because the injection-beam emittance from ion sources does not cover the whole acceptance. To expand the measurement area",
        "a steering magnet has been added in the system. The magnet scans the injection beam in phase planes in synchronization with the acceptance measurement to simulate the large emittance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb65_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb65.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb65_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB65",
      "page_number": "499",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB69",
      "title": "Numerical Analysis on the Gain-reduction Characteristics of Multi-wire Proportional Chambers",
      "authors": [
        "K. Katagiri",
        "T. Furukawa",
        "K. Noda",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "Several MWPC (Multi-Wire Proportional Chamber) monitors are installed to diagnosis the beam profiles in the high-energy beam transport at HIMAC (Heavy Ion Medical Accelerator in Chiba) synchrotrons. When the intensity of the incident beams are much high",
        "the gain reduction of the output signal from the MWPC monitor occurs due to the space charge effect of positive ions around the anode wires. The gain reduction is expected to be improved by changing geometric parameters",
        "such as anode radius and distance between electrodes. In order to investigate the gain-reduction characteristics for different geometric parameters",
        "we performed numerical simulation using a numerical code. The numerical code was developed using a two-dimensional drift-diffusion model to evaluate the gas gain including the reduction effect caused by the space charge effect of the moving positive ions. We investigate the gain-reduction rate for several parameters of the anode distance when changing the beam intensity. From these results",
        "we discuss desirable distances between the anode wires to improve the gain reduction."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb69_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb69.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb69_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB69",
      "page_number": "502",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB70",
      "title": "The ATF2 Multi-OTR System: Studies and Design Improvements",
      "authors": [
        "J. Alabau-Gonzalvo",
        "C. Blanch Gutierrez",
        "A. Faus-Golfe",
        "J.J. García-Garrigós",
        "J. Resta-López",
        "IFIC",
        "Valencia",
        "Spain",
        "J. Cruz",
        "D.J. McCormick",
        "G.R. White",
        "M. Woodley",
        "SLAC",
        "Menlo Park",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "A multi-Optical Transition Radiation system made of four stations has been installed in the extraction line of ATF2 and has been fully operational since September 2011. The system is being used routinely for beam size and emittance measurements as well as for coupling correction and energy spread measurements. In this paper we present the beam sizes and emittance measurements performed during 2012 runs as well as a detailed study of the experimental single-shot automated coupling correction and the comparison with the simulations. Wakefields problems experimented with the simultaneous measurement has been studied and will be solved by new target holders that will be installed in the next Fall 2012 run.",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb70_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb70.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb70_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB70",
      "page_number": "505",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB72",
      "title": "Injected Beam Profile Measurement during Top-up Operation",
      "authors": [
        "ASCo",
        "Clayton",
        "Victoria",
        "Australia",
        "KEK",
        "Ibaraki",
        "Japan",
        "The University of Melbourne",
        "Melbourne",
        "Australia"
      ],
      "institutions": [],
      "abstract": "A coronagraph-like apparatus was constructed on the optical diagnostic beamline on the storage ring to observe the injected beam during top-up operations. An image was created on an intensified CCD that can be gated on a single bunch or on a bunch train for a stronger signal. The bright central stored beam was obscured so the comparatively faint injected beam could be observed. The injected beam comes in at a large enough offset so that it was clearly visible above any diffraction or beam halo signals. The beam profile measured was in good agreement with the observations made of the injected beam only using a telescope apparatus. The measurements were made during user beam in top-up operation mode and can be used to optimise the injection process.",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb72_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb72.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb72_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB72",
      "page_number": "508",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB73",
      "title": "Development of a Beam Profile Monitor using Nitrogen-Molecular Jet for Intense Beams",
      "authors": [
        "Y. Hashimoto",
        "T. Toyama",
        "J-PARC",
        "KEK & JAEA",
        "Ibaraki-ken",
        "Japan",
        "T. Fujisawa",
        "T.M. Murakami",
        "K. Noda",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "Y. Hori",
        "S. Muto",
        "K. Yoshimura",
        "KEK",
        "Ibaraki",
        "Japan",
        "Morimoto Engineering",
        "Iruma",
        "Saitama",
        "Japan",
        "Kyoto University",
        "Radioisotope Research Center",
        "Kyoto-shi",
        "Japan",
        "A non-destructive beam profile monitor using a sheeted jet beam of nitrogen molecular as a target has been developed for intense ion beams. The pressure of the sheeted molecular beam was 5 x 10-4 Pa at the beam collision point. A light emitted from excited nitrogen by an ion beam collision is measured by a high sensitive camera with a radiation resistant image intensifier. Verification of such a principle was already demonstrated with low-energy ion beams[1]. In this paper",
        "some actual designs for intense beams of the J-PARC MR will be discussed mainly as bellow",
        "intensity upgrade of the jet beam production",
        "configuration of the detection chamber and its apparatus placed beam collision point",
        "and the optical system for the light detection.",
        "*[1] Y. Hashimoto",
        "et al.",
        "Proc. of IPAC'10",
        "Kyoto",
        "Japan",
        "p.987-989."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb73_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb73.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb73_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB73",
      "page_number": "511",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB74",
      "title": "Diamond Mirrors for the SuperKEKB Synchtron Radiation Monitor",
      "authors": [
        "J.W. Flanagan",
        "A. Arinaga",
        "H. Fukuma",
        "H. Ikeda",
        "KEK",
        "Ibaraki",
        "Japan",
        "The SuperKEKB accelerator",
        "a 40x luminosity upgrade to the KEKB accelerator",
        "will be a high-current",
        "low-emittance double ring collider. The beryllium primary extraction mirrors used for the synchrotron radiation monitors at KEKB suffered from heat distortion due to incident synchrotron radiation",
        "leading to systematic changes in magnification with beam current and necessitating continuous monitoring and compensation of such distortions in order to correctly measure the beam sizes. The heat loads on the extraction mirrors will be higher at SuperKEKB",
        "with heat-induced magnification changes up to 40% expected if the same mirrors were used as at KEKB. We are working on a design based on mirrors made of quasi-monocrystalline diamond",
        "which has much higher heat conductance and a lower thermal expansion coefficient than beryllium. With such mirrors it is targeted to reduce the beam current-dependent magnification effects to the level of a few percent at SuperKEKB. Measurements of heat-induced deformations on fabricated prototype mirrors will be presented",
        "along with comparisons with the results of numerical simulations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb74_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb74.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb74_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB74",
      "page_number": "515",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB76",
      "title": "Intra Undulator Screen Diagnostics for the FERMI@Elettra FEL",
      "authors": [
        "M. Veronese",
        "A. Abrami",
        "E. Allaria",
        "M. Bossi",
        "A. Bucconi",
        "M. De Marco",
        "M. Ferianis",
        "L. Fröhlich",
        "L. Giannessi",
        "S. Grulja",
        "R. Sauro",
        "C. Spezzani",
        "M. Tudor",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "ESRF",
        "Grenoble",
        "France",
        "The FERMI@Elettra seeded FEL poses demanding requirements in terms of intra undulator diagnostics due to the short wavelength of its FEL radiation and to the coexistence of the electron and photon FEL beams. An advanced multi-beam screen system has equipped both FEL1 and FEL2. The system has been designed for transverse size and profile measurement on both the electron beam and the FEL radiation. Challenging design constrains are present: COTR suppression",
        "seed laser suppression",
        "FEL wavelength range and minimization of the ionizing radiation delivered to the undulators. This paper describes the novel design and the obtained performance with the FERMI intra undulator screen system (IU-FEL)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb76_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb76.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb76_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB76",
      "page_number": "519",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB77",
      "title": "Measurement of the Frequency Spectrum on the Beam Profile Controlled by RF Kicker",
      "authors": [
        "Ritsumeikan University",
        "Kusatsu-City",
        "Shiga",
        "Japan"
      ],
      "institutions": [
        "The frequency spectrum on the beam profile was measured at the compact superconducting storage ring of Ritsumeikan University. The radiation detector was used an avalanche photodiode module with a high frequency response of 1 GHz for the visible ray. Signals from the detector were transferred to a spectrum analyzer. The beam profile was magnified strongly by a conventional profile monitor system. We scanned the beam profile in vertical direction by shifting the detector. The distribution of peak intensity as a function of the position on beam profile was obtained."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb77_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb77.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb77_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB77",
      "page_number": "524",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB78",
      "title": "Flying Wire Beam Profile Monitors at the J-PARC MR",
      "authors": [
        "S. Igarashi",
        "D.A. Arakawa",
        "Y. Hashimoto",
        "M. Tejima",
        "T. Toyama",
        "KEK",
        "Ibaraki",
        "Japan",
        "Mitsubishi Electric System & Service Co.",
        "Ltd",
        "Tsukuba",
        "Japan"
      ],
      "institutions": [],
      "abstract": "Transverse beam profiles have been measured using flying wire monitors at the main ring of the Japan Proton Accelerator Research Complex. The wire target should be thin and the wire scan has to be fast for the precise profile measurement. Otherwise the beam distribution would be disturbed and the measured profile would not be accurate. We use carbon fibers of 7 μm in diameter and the scan speed of 10 m/s. The wire is attached with an aluminum flame of 140 mm of the rotation radius and rotated with a DC servomotor. A potentiometer is attached to the wire flame and the angle readout is used for the feedback of the servomotor and the wire position measurement. The secondary particles from the beam-wire scattering are measured with a scintillation counter. Beam profiles are reconstructed by making the scatter plot of the scintillator signal and wire position. Both horizontal and vertical flying wire monitors have been used for the beam commissioning. We have successfully measured the beam profile of up to 1.2×1013 protons per bunch.",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb78_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb78.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb78_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB78",
      "page_number": "527",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB79",
      "title": "Use of Gafchromic Films to Measure the Transverse Intensity Distribution of a Large-area Ion Beam",
      "authors": [
        "Y. Yuri",
        "I. Ishibori",
        "T. Ishizaka",
        "A. Kitamura",
        "S. Okumura",
        "T. Yuyama",
        "JAEA/TARRI",
        "Gunma-ken",
        "Japan",
        "S. Sawada",
        "T. Yamaki",
        "JAEA/QuBS",
        "Takasaki",
        "Japan",
        "In the TIARA AVF cyclotron facility of JAEA",
        "it is necessary to evaluate the cross-sectional area and uniformity of a large-area uniform ion beam formed by multipole magnets both precisely and handily. A technique has",
        "therefore",
        "been developed to measure the two-dimensional transverse intensity distribution of the ion beam using Gafchromic radiochromic films (Ashland Inc.). In order to show available fluence ranges of the film",
        "the coloring response of the Gafchromic films irradiated with several species of ion beams is investigated as a change in the optical density of the film. It has been found that the optical density increases linearly with the fluence",
        "whose range is practical for materials and biological research. Thus",
        "the relative transverse intensity distribution of ion beams can be measured using the film. Furthermore",
        "the intensity distribution determined by the Gafchromic film is compared with the area-density distribution of track-etched pores in a polymer film from a microscopic viewpoint. It has been demonstrated that the beam uniformity obtained from the Gafchromic film is equivalent to the relative standard deviation of the microscopic pore distribution."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb79_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb79.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb79_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB79",
      "page_number": "531",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB81",
      "title": "Design of the Beam Profile Monitors for the SXFEL Facility",
      "authors": [
        "L.Y. Yu",
        "J. Chen",
        "Y.B. Leng",
        "K.R. Ye",
        "W.M. Zhou",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "The Shanghai X-ray Free Electron Laser Facility will begin construction at next year. The linac electron beam energy is 0.84 GeV. Over 50 beam profile monitors with OTR and YaG screen will be installed along the linac and undulators. The profile monitor system design is a challenging task",
        "since the system has to measure transverse electron beam sizes from millimeter down to 40μm scale with a 20μm resolution and 50μm repeat positioning accuracy. This paper describes the design of the mechanical detector",
        "the integrated step-servo motor controlling system",
        "the beam imaging system",
        "as well as the software system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb81_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb81.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb81_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB81",
      "page_number": "534",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB84",
      "title": "Storage Ring Tune Measurements using High-speed Metal-semiconductor-metal Photodetector",
      "authors": [
        "S. Dawson",
        "D.J. Peake",
        "R.P. Rassool",
        "The University of Melbourne",
        "Melbourne",
        "Australia",
        "ASCo",
        "Clayton",
        "Victoria",
        "Australia",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [
        "Knowledge of the betatron tunes within a storage ring is important to prevent the creation of instabilities and maximise the lifetime of the stored current within the ring. Typical tune measurements excite the beam and measure the resulting motion over time using electromagnetic pickups. The novel measurement technique presented utilises high-speed MSM photodiodes in a balanced detector set-up to measure the vertical and horizontal betatron tunes. Radiation from a bending magnet consists of both visible light and X-rays. The visible light is separated from the X-rays with an optical chicane and focussed onto a pair of length-matched optical fibers each coupled to an MSM photodiode. The specialised biasing circuit for the photodiodes is constructed in a balanced detector configuration to emphasise any motion in the beam. Signal resulting from beam motion is amplified and digitised for analysis. Using this set-up the tunes for the storage ring at the Australian Synchrotron have been measured and verified with comparison to existing tune measurement technologies. The results from the new optical tune measurement system will be presented and discussed."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb84_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb84.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb84_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB84",
      "page_number": "537",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPB85",
      "title": "Spectrum of Multi-bunch Position Model and Parameter Acquisition Algorithm",
      "authors": [
        "Y. Yang",
        "Y.B. Leng",
        "SSRF",
        "Shanghai",
        "People's Republic of China",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "Based on the spectrum of turn-by-turn model for the storage ring",
        "spectrum of multi-bunch position model was derived through some assumptions. Spectrum of excited electron beam position was analyzed in Shanghai Synchrotron Radiation Facility(SSRF) and Genetic Algorithm was used to obtain the model parameters when fitting multi-curve data. Results show that",
        "after 100 times iteration",
        "all the correlation of fitted data and original data can be up to 95%",
        "and the model can accurate estimate a bimodal split of the spectrum curve."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/tupb85_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/tupb85.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/tupb85_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-TUPB85",
      "page_number": "540",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 22,
  "scrape_time": "2025-10-10 18:03:39"
}