{
  "session_info": {
    "id": "THODA",
    "name": "THODA - Applications",
    "url": "https://proceedings.jacow.org/hiat2018/html/thoda.htm"
  },
  "papers": [
    {
      "paper_id": "THODA01",
      "title": "Preliminary Design and Simulation Results of Ne+ Beam Source",
      "authors": [
        "Y.H. Xie",
        "C.D. Hu",
        "J. Li",
        "Y.L. Xie",
        "Y. Xu",
        "ASIPP",
        "Hefei",
        "People’s Republic of China",
        "An ion source of Ne beam was designed for basic physics research in the Institute of Plasma Physics",
        "Chinese Academy of Science (ASIPP). The ion source was designed with hot cathode plasma source with three electrodes accelerator. The designed beam energy is 10-20 keV",
        "the beam power is 50 kW",
        "beam size is 25 cm × 25 cm and beam duration is 2 seconds. The three electrodes accelerator with slit type was designed. The extracted beam current and beam divergence angle was simulated. The maximum beam power of 40 kW can be extracted when the divergence angle less than 5 degree with beam energy of 10 keV and the beam power of 28 kW can be extracted with minimum divergence angle of 2.2 degree. When the beam energy is 20 keV",
        "the maximum beam power of 95 kW can be extracted when divergence angle less than 5 degree. And the beam power is 65 kW with minimum beam divergence angle is 2.2 degree too. The results shown that",
        "the maximum beam power can not got 50 kW with beam energy of 10 kW",
        "but the beam power can achieve 95 kW with beam energy of 20 keV."
      ],
      "institutions": [
        "Funding: The National Key R&D Program of China(2017YFE300101) The National Natural Science Foundation of China (NNSFC) (Contract No.11505225 & 11675215)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hiat2018/talks/thoda01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hiat2018/papers/thoda01.pdf",
      "poster_url": "https://proceedings.jacow.org/hiat2018/posters/thoda01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2018-THODA01",
      "page_number": "179",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:37:39"
}