{
  "session_info": {
    "id": "TUPAG",
    "name": "TUPAG - Tuesday Parallel Grand Ballroom",
    "url": "https://proceedings.jacow.org/icap2018/html/tupag.htm"
  },
  "papers": [
    {
      "paper_id": "TUPAG01",
      "title": "Computation of Eigenmodes in the BESSY VSR Cavity Chain by Means of Concatenation Strategies",
      "authors": [
        "T. Flisgen",
        "A.V. Vélez",
        "HZB",
        "Berlin",
        "Germany",
        "J. Heller",
        "G. Zadeh",
        "U. van Rienen",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "Invited Talk: The computation of eigenmodes in chains of superconducting cavities with asymmetric couplers is a demanding problem. This problem typically requires the use of high-performance computers in combination with dedicated software packages. Alternatively",
        "the eigenmodes of chains of superconducting cavities can be determined by the so-called State-Space Concatenation (SSC) approach that has been developed at the University of Rostock. SSC is based on the decomposition of the full chain into individual segments. Subsequently",
        "the RF properties of every segment are described by reduced-order models. These reduced-order models are concatenated to a reduced-order model of the entire chain by means of algebraic side constraints arising from continuity conditions of the fields across the decomposition planes. The constructed reduced-order model describes the RF properties of the complete structure so that the field distributions",
        "the coupling impedances and the external quality factors of the eigenmodes of the full cavity chain are available. In contrast to direct methods",
        "SSC allows for the computation of the eigenmodes of cavity chains using desktop computers. The current contribution revises the scheme using the BESSY VSR cavity chain as an example. In addition",
        "a comparison between a direct computation of a specific localized mode is described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag01.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG01",
      "page_number": "253",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG02",
      "title": "First Steps Towards a New Finite Element Solver for MOEVE PIC Tracking",
      "authors": [
        "U. van Rienen",
        "C.R. Bahls",
        "J. Heller",
        "D. Zheng",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "University of Rostock",
        "Rostock",
        "Germany",
        "A relevant task in designing high-brilliance light sources based on high-current linear accelerators (e.g. Energy Recovery Linacs (ERLs)) consists in systematic investigations of ion dynamics in the vacuum chamber of such machines. This is of high importance since the parasitic ions generated by the electron beam turned out to be a current-limiting factor for many synchrotron radiation sources. In particular",
        "the planned high current operation at ERL facilities requires a precise analysis and an accurate development of appropriate measures for the suppression of ion-induced beam instabilities. The longitudinal transport of ions through the whole accelerator plays a key role for the establishment of the ion concentration in the machine. Using the Particle-in-Cell (PIC) method",
        "we started redesigning our code MOEVE PIC Tracking in order to allow for the fast estimation of the effects of ions on the beam dynamics. For that",
        "we exchanged the previously used Finite Difference (FD) method for the solution of Poisson’s equation within the PIC solver by a solver based on the Finite Element Method (FEM). Employing higher order FEM",
        "we expect to gain improved convergence rates and thus lower computational times. We chose the Open Source Framework FEniCS for our new implementation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag02.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG02",
      "page_number": "260",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG03",
      "title": "High-Precision Lossy Eigenfield Analysis Based on the Finite Element Method",
      "authors": [
        "W. Ackermann",
        "H. De Gersempresenter",
        "V. Pham-Xuan",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "A proper eigenanalysis of resonating particle accelerator components is particularly advantageous to characterize structures with high quality factors. While in former times eigenmode calculations have been concentrating on the lossless cases only",
        "meanwhile also lossy structures with finite-conductive materials or with absorbing boundary conditions like PML or ports even with low quality factors are routinely available. In the lossless case where no damping is present",
        "all eigenvalues are located along the real axis. If damping has to be modeled instead",
        "the corresponding eigenvalues are distributed within the first quadrant of the complex plane that renders their determination much more expensive. One of the critical issues is that no resonance should be missed so that all desired eigenvalues in a given region of the complex plane can be precisely determined. We implemented two different eigenvalue solvers based on a distributed-memory architecture. While the first one is a classical Jacobi-Davidson eigenvalue solver which has been adopted to be used also within a complex-arithmetic environment",
        "the second one is based on the contour-integral method which enables to determine all eigenvalues within a given closed contour in the complex plane. Both solvers are attached to a FEM processor with second-order edge elements on curved tetrahedra and can be used together in order to improve the computational efficiency. In the presentation a selection of successful real-world applications of the implemented parallel eigenvalue solvers will be given."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag03.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG04",
      "title": "Statistical Analysis of the Eigenmode Spectrum in the SRF Cavities with Mechanical Imperfections",
      "authors": [
        "A. Lunin",
        "T.N. Khabiboulline",
        "N. Solyak",
        "A.I. Sukhanov",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The superconducting radio frequency (SRF) technology is progressing rapidly over last decades toward high accelerating gradients and low surface resistance making feasible the particle accelerators operation with high beam currents and long duty factors. However",
        "the coherent RF losses due to high order modes (HOMs) excitation becomes a limiting factor for these regimes. In spite of the operating mode",
        "which is tuned separately",
        "the parameters of HOMs vary from one cavity to another due to finite mechanical tolerances during cavities fabrication. It is vital to know in advance the spread of HOM parameters in order to predict unexpected cryogenic losses",
        "overheating of beam line components and to keep stable beam dynamics. In this paper we present the method of generating the unique cavity geometry with imperfections while preserving operating mode frequency and field flatness. Based on the eigenmode spectrum calculation of series of randomly generated cavities we can accumulate the data for the evaluation the HOM statistics. Finally",
        "we describe the procedure for the estimation of the probability of the resonant HOM losses in the SRF resonators. The study of these effects leads to specifications of SC cavity and cryomodule and can significantly impact on the efficiency and reliability of the machine operation"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag04.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG04",
      "page_number": "265",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG05",
      "title": "Trimcoil Optimisation Using Multi-Objective Optimisation Techniques and HPC",
      "authors": [
        "M. Frey",
        "A. Adelmann",
        "J. Snuverink",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Uncertainties in the bunch injection (i.e. energy",
        "radius",
        "radial momentum and angle) as well as magnet inaccuracies harm the isochronicity of the PSI 590 MeV Ring Cyclotron. An additional magnetic field provided by trim coils is an effective solution to restore this condition. Therefore",
        "an accurate description of trim coils is essential to match the turn pattern of the machine in simulations. However",
        "due to the high-dimensional search space consisting of 21 design variables and more than 180 objectives the turns cannot be matched in a straightforward manner and without sufficient HPC resources. In this talk we present a realistic trim coil model for the PSI 590 MeV Ring Cyclotron implemented in OPAL that was used together with its built-in multi-objective optimisation algorithm to find the 4 injection parameters and the magnetic field strengths of 17 trim coils. The optimisations were performed on Piz Daint (currently 3rd fastest supercomputer world-wide) with more than 1000 cores per job."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag05.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG06",
      "title": "Parallel Algorithms for Solving Nonlinear Eigenvalue Problems in Accelerator Cavity Simulations",
      "authors": [
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "We present an efficient and reliable algorithm for solving a class of nonlinear eigenvalue problems arising from the modeling of particle accelerator cavities. The eigenvalue nonlinearity in these problems results from the use of waveguides to couple external power sources or to allow certain excited electromagnetic modes to exit the cavity. We use a rational approximation to reduce the nonlinear eigenvalue problem first to a rational eigenvalue problem. We then apply a special linearization procedure to turn the rational eigenvalue problem into a larger linear eigenvalue problem with the same eigenvalues",
        "which can be solved by existing iterative methods. By using a compact scheme to represent both the linearized operator and the eigenvectors to be computed",
        "we obtain a numerical method that only involves solving linear systems of equations of the same dimension as the original nonlinear eigenvalue problem. We refer to this method as a compact rational Krylov (CORK) method. We implemented the CORK method in the Omega3P module of the Advanced Computational Electromagnetic 3D Parallel (ACE3P) simulation suite and validated it by comparing the computed cavity resonant frequencies and damping Q factors of a small model problem to those obtained from a fitting procedure that uses frequency responses computed by another ACE3P module called S3P. We also used the CORK method to compute trapped modes damped in an ideal eight 9-cell SRF cavity cryomodule. This was the first time it was possible to compute these modes directly. The damping Q factors of the computed modes match well with those measured in experiments and the difference in resonant frequencies is within the range introduced by cavity imperfection. Therefore",
        "the CORK method is an extremely valuable tool for computational cavity design."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag06.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG07",
      "title": "Efficient Computation of Lossy Higher Order Modes in Complex SRF Cavities Using Reduced Order Models and Nonlinear Eigenvalue Problem Algorithms",
      "authors": [
        "H.W. Pommerenke",
        "J. Heller",
        "U. van Rienen",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "Superconducting radio frequency (SRF) cavities meet the demanding performance requirements of modern accelerators and high-brilliance light sources. For the operation and design of such resonators",
        "a very precise knowledge of their electromagnetic resonances is required. The non-trivial cavity shape demands a numerical solution of Maxwell’s equations to compute the resonant eigenfrequencies",
        "eigenmodes",
        "and their losses. For large and complex structures this is hardly possible on conventional hardware due to the high number of degrees of freedom required to obtain an accurate solution. In previous work it has been shown that the considered problems can be solved on workstation computers without extensive simplification of the structure itself by a combination of State-Space Concatenation (SSC) and Newton iteration to solve the arising nonlinear eigenvalue problem (NLEVP). First",
        "SSC is applied to the complex",
        "closed and thus lossless RF structure. SSC employs a combination of model order reduction and domain decomposition",
        "greatly reducing the computational effort by effectively limiting the considered frequency domain. Next",
        "a perturbation approach based on SSC is used to describe the resonances of the same geometry subject to external losses. This results in a NLEVP which can be solved efficiently by Newton’s method. In this paper",
        "we expand the NLEVP solution algorithm by a contour integral technique",
        "which increases the completeness of the solution set."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag07.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG07",
      "page_number": "270",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG08",
      "title": "Uncertainty Quantification for the Fundamental Mode Spectrum of the European XFEL Cavities",
      "authors": [
        "N. G. Georg",
        "J. Corno",
        "H. De Gersempresenter",
        "U. Römer",
        "S. Schöps",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "S. Gorgi Zadeh",
        "U. van Rienen",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "DESY",
        "Hamburg",
        "Germany",
        "The fundamental mode spectrum of superconducting cavities is sensitive to small geometry deformations introduced by the manufacturing process. In this work we consider variations in the equatorial and iris radii of the 1.3 GHz TESLA cavities used at the European XFEL. The cavities with slightly perturbed geometry are simulated using a finite element based eigenvalue solver. Employing uncertainty quantification methods such as sparse-grids",
        "statistical information about the fundamental mode spectrum can be efficiently calculated. Moreover",
        "using global sensitivity analysis",
        "in particular Sobol indices",
        "the impact of the individual geometry parameters on the quantities of interest",
        "i.e. resonance frequencies",
        "field-flatness and the cell-to-cell coupling coefficient",
        "can be computed. We will explain important aspects of the uncertainty quantification methodology and give numerical results for illustration."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag08.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG08",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG09",
      "title": "Electron Beam Longitudinal Phase Space Restoration From the Image After Beam Pass Deflector Cavity and Spectrometer Arm",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA"
      ],
      "institutions": [
        "Recently commissioned X-band deflector cavity at Brookhaven National Laboratory Accelerator Test Facility (BNL ATF) is used for electron bunch longitudinal profile measurements in both - at zero-degree beamline and at spectrometer arm directions to measure the e-beam longitudinal phase space profile. The deflector cavity induces energy distortions on the off-axis particles and corrupt real picture of the beam energy profile at spectrometer screen. A special computational phase space restoration technique which is under development at BNL ATF to reveal undistorted e-beam parameters will be discussed."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag09.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG09",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG10",
      "title": "Nonlinear Optics at UMER: Lessons Learned in Simulation",
      "authors": [
        "UMD",
        "College Park",
        "Maryland",
        "USA"
      ],
      "institutions": [],
      "abstract": "K.J. Ruisard, B.L. Beaudoin, I. Haber, T.W. Koeth, D.B. Matthew",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag10.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG10",
      "page_number": "278",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG11",
      "title": "ESS Accelerator Lattice Design Studies and Automatic Synoptic Deployment",
      "authors": [
        "Y. Levinsen",
        "R. De Prisco",
        "M. Eshraqi",
        "T.J. Grandsaert",
        "A. Jansson",
        "H. Kocevar",
        "Ø. Midttun",
        "N. Milas",
        "R. Miyamoto",
        "D.C. Plostinar",
        "A. Ponton",
        "T.J. Shea",
        "ESS",
        "Lund",
        "Sweden",
        "AU",
        "Aarhus",
        "Denmark",
        "The European Spallation Source (ESS) is currently under construction in the south of Sweden. A highly brilliant neutron source with a 5 MW proton driver will provide state of the art experimental facilities for neutron science. A peak proton beam power in the accelerator of 125 MW means that excellent control over the beam losses becomes essential. The beam physics design of the ESS accelerator is in a TraceWin format",
        "for which we have developed revision control setup",
        "automated regression analysis and deployment of synoptic viewer and tabulated spreadsheets. This allows for an integrated representation of the data that are always kept synchronized and available to other engineering disciplines. The design of the accelerator lattice has gone through several major and minor iterations which are all carefully analysed. In this contribution we present the status of the latest studies which is the first time a complete end-to-end study beginning from the ion source has been performed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag11.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG11",
      "page_number": "285",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG12",
      "title": "SNS Beam Test Facility for Experimental Benchmark of High Intensity Beam Dynamics Computer Simulation",
      "authors": [
        "A.V. Aleksandrov",
        "S.M. Cousineau",
        "A.P. Zhukov",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "B.L. Cathey",
        "Z.L. Zhang",
        "ORNL RAD",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "The SNS Beam Test Facility (BTF) is a 2.5 MeV hadron accelerator equipped with state-of-the-art transverse and longitudinal beam diagnostics. The BTF can produce pulsed high intensity H− beam with up to 50mA peak current. The expected available beam-on time of a few thousand hours per year provides an opportunity for carrying out advanced high intensity beam dynamics experiments. The first ever direct measurement of 6D phase space distribution of a beam in an accelerator has recently been completed. Preliminary analysis of the data shows a complex phase space structure that is not visible in measurements below 5D",
        "including correlations between degrees of freedom not customarily measured together. This result opens path forward to solving the long-standing problem of initial condition in hadron linac beam dynamics simulation. An extension of the BTF beam line consisting of a FODO line and high dynamic range emittance monitor is being built to provide a test bench for simulation codes benchmarking against measurements in well controlled environment. This paper describes these efforts along with the longer-term plans."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag12.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG12",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG13",
      "title": "S-Based Macro-Particle Spectral Algorithm for an Electron Gun",
      "authors": [
        "P. M. Jung",
        "T. Planche",
        "TRIUMF",
        "Vancouver",
        "Canada"
      ],
      "institutions": [],
      "abstract": "We derive a Hamiltonian description of a continuous particle distribution and its electrostatic potential from the Low Lagrangian. The self consistent space charge potential is discretized according to the spectral Galerkin approximation. The particle distribution is discretized using macro-particles. We choose a set of initial and boundary conditions to model the TRIUMF 300keV thermionic DC electron gun. The field modes and macro-particle coordinates are integrated self-consistently. The current status of the implementation is discussed.",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag13.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG13",
      "page_number": "290",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG14",
      "title": "Constrained Multi-Objective Shape Optimization of Superconducting RF Cavities to Counteract Dangerous Higher Order Modes",
      "authors": [
        "M. Kranjcevic",
        "P. Arbenz",
        "ETH",
        "Zurich",
        "Switzerland",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "S. Gorgi Zadeh",
        "U. van Rienen",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "High current storage rings",
        "such as the Z operating mode of the FCC-ee",
        "require superconducting radio frequency (RF) cavities that are optimized with respect to both the fundamental mode and the dangerous higher order modes. In order to optimize the shape of the RF cavity",
        "a constrained multi-objective optimization problem is solved using a massively parallel implementation of an evolutionary algorithm. Additionally",
        "a frequency-fixing scheme is employed to deal with the constraint on the frequency of the fundamental mode. Finally",
        "the computed Pareto front approximation and an RF cavity shape with desired properties are shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag14.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG14",
      "page_number": "293",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG17",
      "title": "Beamline Map Computation for Paraxial Optics",
      "authors": [
        "B. Nash",
        "J.P. Edelen",
        "N.B. Goldring",
        "S.D. Webb",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "Modeling of radiation transport is an important topic tightly coupled to many charged particle dynamics simulations for synchrotron light sources and FEL facilities. The radiation is determined by the electron beam and magnetic field source",
        "and then passes through beamlines with focusing elements",
        "apertures and monochromators",
        "in which one may typically apply the paraxial approximation of small angular deviations from the optical axis. The radiation is then used in a wide range of spectroscopic experiments",
        "or else may be recirculated back to the electron beam source",
        "in the case of an FEL oscillator. The Wigner function representation of electromagnetic wavefronts has been described in the literature and allows a phase space description of the radiation",
        "similar to that used in charged particle dynamics. It can encompass both fully and partially coherent cases",
        "as well as polarization. Here",
        "we describe the calculation of a beamline map that can be applied to the radiation Wigner function",
        "reducing the computation time. We discuss the use of ray tracing and wave optics codes for the map computation and benchmarking. We construct a four crystal 1:1 imaging beamline that could be used for recirculation in an XFEL oscillator",
        "and benchmark the map based results with SRW wavefront simulations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag17.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG17",
      "page_number": "297",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG19",
      "title": "Bragg Diffraction Modeling Between X-Ray Free-Electron Laser and Crystals",
      "authors": [
        "H.X. Deng",
        "N. S. Huang",
        "K. Li",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "In pursuit of fully coherent X-ray free-electron laser (FEL)",
        "high reflective Bragg crystals have being and will be used as high selective spectral filter in the hard X-ray self-seeding FELs and X-ray FEL oscillators (XFELO)",
        "respectively. However",
        "currently in the self-seeding FEL and XFELO simulations",
        "the three-dimensional effect of Bragg diffraction is not fully considered. In this paper",
        "we derive comprehensive solution for the response function of crystal in Bragg diffraction. And a three-dimensional X-ray crystal Bragg diffraction code named BRIGHT is introduced",
        "which could collaborate closely with other FEL related code",
        "e.g.",
        "GENESIS and OPC. The performance and feasibility are evaluated by two numerical examples",
        "i.e.",
        "self-seeding experiment for LCLS and XFELO options for Shanghai high repetition rate XFEL and extreme light facility (SHINE). The results indicate BRIGHT provides a new and useful tool for three-dimensional FEL simulation.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag19.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG19",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG20",
      "title": "Computational Beam Dynamics Requirements for FRIB",
      "authors": [
        "P.N. Ostroumov",
        "Y. Hao",
        "T. Maruta",
        "A.S. Plastun",
        "T. Yoshimoto",
        "T. Zhang",
        "Q. Zhao",
        "FRIB",
        "East Lansing",
        "USA",
        "The Facility for Rare Isotope Beams (FRIB) being built at Michigan State University moved to the commissioned stage in the summer of 2017. There were extensive beam dynamics simulations in the FRIB driver linac during the design stage. Recently",
        "we have used TRACK and IMPACT simulation codes to study dynamics of ion beam contaminants extracted from the ECR together with main ion beam. The contaminant ion species can produce significant losses after the stripping. These studies resulted in development of beam collimation system at relatively low energy of 16 MeV/u and room temperature bunchers instead of originally planned SC cavities. Commissioning of the Front End and the first 3 cryomodules enabled detailed beam dynamics studies experimentally which were accompanied with the simulations using above-mentioned beam dynamics codes and optimization code FLAME. There are significant challenges in understanding of beam dynamics in the FRIB linac. The most computational challenges are in the following areas: (1) Simulation of the ion beam formation and extraction from the ECR; (2) Development of the virtual accelerator model available on-line both for optimization and multi-particle simulations. The virtual model should include realistic accelerator parameters including device misalignments; (3) Large scale simulations to support high-power ramp up of the linac with minimized beam losses; (4) Interaction of the beam with the gas stripper which is the backup option for high power operation of the linac."
      ],
      "institutions": [
        "Funding: Work supported by the U.S. DOE of Science under Cooperative Agreement DE-SC0000661 and the NSF under Cooperative Agreement PHY-1102511, the State of Michigan and Michigan State University."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag20.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG20",
      "page_number": "303",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG21",
      "title": "Novel, Fast, Open-Source Code for Synchrotron Radiation Computation on Arbitrary 3D Geometries",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Open Source Code for Advanced Radiation Simulation (OSCARS) is an open-source project (https://oscars.bnl.gov) developed at Brookhaven National Laboratory for the computation of synchrotron radiation from arbitrary charged particle beams in arbitrary and time-dependent mag- netic and electric fields on arbitrary geometries in 3D. Computational speed is significantly increased with the use of built-in multi-GPU and multi-threaded techniques which are suitable for both small scale and large scale computing infrastructures. OSCARS is capable of computing spectra",
        "flux",
        "and power densities on simple surfaces as well as on objects imported from common CAD software. It is additionally applicable in the regime of high-field acceleration. The methodology behind OSCARS cal- culations will be discussed along with practical examples and applications to modern accelerators and light sources."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag21.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG21",
      "page_number": "309",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG22",
      "title": "Main and Fringe Field Computations for the Electrostatic Quadrupoles of the Muon g-2 Experiment Storage Ring",
      "authors": [
        "E.V. Valetov",
        "M. Berz",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "We consider semi-infinite electrostatic deflectors with plates of different thickness",
        "including plates with rounded edges",
        "and we calculate their electrostatic potential and field using conformal mappings. To validate the calculations",
        "we compare the fringe fields of these electrostatic deflectors with fringe fields of finite electrostatic capacitors",
        "and we extend the study to fringe fields of adjacent electrostatic deflectors with consideration of electrostatic induction",
        "where field falloffs of semi-infinite electrostatic deflectors are slower than exponential and thus behave differently from most magnetic fringe fields. Building on the success with electrostatic deflectors",
        "we develop a highly accurate and fully Maxwellian conformal mappings method for calculation of main fields of electrostatic particle optical elements. A remarkable advantage of this method is the possibility of rapid recalculations with geometric asymmetries and mispowered plates. We use this conformal mappings method to calculate the multipole terms of the high voltage quadrupole used in the storage ring of the Muon g-2 Experiment (FNAL-E-0989). Completing the methodological framework",
        "we present a method for extracting multipole strength falloffs of a particle optical element from a set of Fourier mode falloffs. We calculate the quadrupole strength falloff and its effective field boundary (EFB) for the Muon g-2 quadrupole",
        "which has explained the experimentally measured tunes",
        "while simple estimates based on a linear model exhibited discrepancies up to 2%."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag22.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG22",
      "page_number": "313",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAG23",
      "title": "Study of Electron Cyclotron Resonance Acceleration by Cylindrical TE011 Mode",
      "authors": [
        "O. Otero Olarte",
        "E.A. Orozco",
        "UIS",
        "Bucaramanga",
        "Colombia",
        "In this work",
        "we present results from analytical and numerical studies of the electron acceleration by a TE011 cylindrical microwave mode in a static homogeneous magnetic field under electron cyclotron resonance (ECR) condition. The stability of the orbits is analyzed using the particle orbit theory. In order to get a better understanding of the interaction wave-particle we decompose the azimuthally electric field component as the superposition of right and left hand circular polarization standing waves. The trajectory",
        "energy and phase-shift of the electron are found through a numerical solution of the relativistic Newton-Lorentz equation in a finite difference method by the Boris method. It is shown that an electron longitudinally injected with an energy of 7 keV in a radial position r=Rc/2",
        "being Rc the cavity radius",
        "is accelerated up to energy of 90 keV by an electric field strength of 14 kV/cm and frequency of 2.45 GHz. This energy can be used to produce X-ray for medical imaging. These results can be used as a starting point for the study the acceleration of electrons in a magnetic field changing slowly in time (GYRAC)",
        "which has some important applications as the electron cyclotron resonance Ion proton accelerator (ECR-IPAC) for cancer therapy and to control plasma bunches with relativistic electrons.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupag23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupag23.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupag23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAG23",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 20,
  "scrape_time": "2025-10-10 18:31:29"
}