{
  "session_info": {
    "id": "WEPH",
    "name": "WEPH - Wednesday Poster Session",
    "url": "https://proceedings.jacow.org/SAP2014/html/weph.htm"
  },
  "papers": [
    {
      "paper_id": "WEPH01",
      "title": "Uniformization of the transverse beam profile by a new type nonlinear magnet",
      "authors": [
        "G. Gu",
        "W.B. Liu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The uniform particle beam is desirable in many beam applications. One method to get this type of beam distribution is using octupoles",
        "but loss of particles in the halo will be produced by this method. To reduce the beam loss",
        "a new type of magnet is proposed in this paper. The field in the middle region of the new type magnet is similar to the octupole magnet field",
        "but the rate of rise decline quickly in the edge. So that the particle in the edge experience a lower magnet field",
        "and this would result in less particle loss. We also add a mechanical structure on the new type magnet to make it possible to adjust the size of middle region. So that the magnet can adapt to different transverse dimensions of the beam",
        "and this would further reduce particle loss. Some numerical simulations have been done respectively with octuples and the new type of magnet. The simulation results show that the new type of magnet could get the uniform distribution of particle beam with less particle loss. We are processing a magnet now",
        "and an experiment to test the magnet will be arranged on CPHS."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph01.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPH02",
      "title": "Beam Optimization in Parasitic Mode of BEPCII during R Measurement",
      "authors": [
        "D. Ji",
        "Q. Qin",
        "C.H. Yu",
        "Y. Zhang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The Beijing Electron Positron Collider II (BEPCII) operated for R measurement from 2013 November to 2014 February in parasitic mode. During R measurement",
        "beam energy shifted from 1.89GeV to 2.3GeV in three month. Meanwhile",
        "in parasitic mode",
        "8 beamlines including 3 from wigglers could also operate for synchrotron radiation (SR) experiments. Frequent energy change in such wide range and wigglers effect made beam optimization a hard task. This paper will describe the main progresses on the beam optimization of the BEPCII during R measurement in the field of accelerator physics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph02.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH02",
      "page_number": "29",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH04",
      "title": "Physics Design of CSNS RCS Injection and Extraction System",
      "authors": [
        "J. Qiu",
        "N. Huang",
        "J.Y. Tang",
        "S. Wang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "In this paper",
        "the development of injection and extraction system design for CSNS RCS are introduced. It is a challenge for the injection system to place all the complicated injection devices in one uninterrupted long drift",
        "such as DC and painting bumper magnets",
        "the carbon stripping foils system",
        "beam monitors",
        "the ceramic vacuum chambers",
        "and beam dump. The beam extraction process from the CSNS RCS is a single turn two step process",
        "requiring a group of kickers and a Lambertson septum magnet."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph04.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH04",
      "page_number": "32",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH06",
      "title": "Design and Beam Dynamics Study of a C-Band Deflecting Cavity for Bunch Length Measurement",
      "authors": [
        "P. Wang",
        "H.B. Chen",
        "J. Shi",
        "S.X. Zheng",
        "TUB",
        "Beijing",
        "People's Republic of China"
      ],
      "institutions": [],
      "abstract": "We design a C-band deflecting cavity at a resonance frequency of 5712MHz. We study the dynamics of the beams in the cavity to ensure that the cavity is suitable to work as a deflector in the future high-precision bunch length measurement of the electron beam. The deflecting cavity supplied by a RF source of 1MW can generate a deflecting voltage of 1.23MV. We obtain a positive correlation between the phases of the electromagnetic fields and the deflections in y-direction.",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph06.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH06",
      "page_number": "35",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH07",
      "title": "Simulation Study of Dark Current in the Thomson Scattering X-Ray Source",
      "authors": [
        "L.M. Zheng",
        "Y.-C. Du",
        "C.-X. Tang",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "This paper focuses on the study of beam dynamics of the dark current",
        "including the dark current generation and transmission in the photocathode injector. For the longitudinal compression of the nominal beam in the Thomson scattering X-ray source",
        "we add a velocity bunching cavity behind the RF gun. We analyse the influence of the bunching cavity on the transmission efficiency of the dark current. At last",
        "some methods to reduce the dark current are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph07.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH07",
      "page_number": "38",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH08",
      "title": "Simulation of Magnet Field Disturbance Effect on the Third Order Resonant Extraction",
      "authors": [
        "J. Li",
        "L.J. Mao",
        "R.S. Mao",
        "J. Shi",
        "M.T. Song",
        "J.W. Xia",
        "J.C. Yang",
        "X.D. Yang",
        "Y.J. Yuan",
        "T.C. Zhao",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "The third order resonant slow extraction experimental research has progressed at the main ring of HIRFL",
        "but the extracted beam spill intensity is significantly modulated by some periodic disturbances which leaded to large-scale beam break during continuous extraction and hardly decreased beam emittance at external targets. The periodic beam disturbance can be attributed to the main magnet field disturbances by low-frequency ripple of magnet power supplies. The disturbance effect of quadruple and dipole magnetic fields on the extracted beam spill intensity variation and emittance are evaluated by simulation in this paper. The simulation result shows that the current quadruple field disturbance level has a strong impact on both beam spill intensity and extracted beam emittance on the main ring."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph08.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH08",
      "page_number": "41",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH09",
      "title": "Concept Design of the Collimation System in the CSRm",
      "authors": [
        "P. Li",
        "Z. Chai",
        "P. Jiang",
        "J. Meng",
        "J.C. Yang",
        "Y.J. Yuan",
        "W.H. Zheng",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "The heavy ion beams would be easily lost at the vacuum chamber along the CSRm when it is used to accumulate the intermediate charge state particles. The vacuum pressure bump due to the ion-induced desorption in turn leads to an increase in beam loss rate. In order to avoid the complete beam loss",
        "the collimation system is investigated in the CSRm. The beam loss distribution is simulated considering the particle charge exchanged process. Then the collimation efficiency of the lost particle is calculated and optimized under different collimator's position",
        "geometry",
        "and beam emittance and so on. Furthermore",
        "the closed orbit distortion which is caused by different types of error in the ring will affect the collimation efficiency. The collimation efficiency of the lost particles in the CSRm is investigated by taking real magnet alignment errors into consideration. Two prototype collimators are under designing and will be tested in the CSRm."
      ],
      "institutions": [
        "Funding: National Natural Science Foundation of China (Projects No. 11305227)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph09.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH09",
      "page_number": "44",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH10",
      "title": "Heavy Ions Radiography Facility at IMP",
      "authors": [
        "L.N. Sheng",
        "R. Cheng",
        "P. Li",
        "J.W. Xia",
        "G.Q. Xiao",
        "J.C. Yang",
        "Y.J. Yuan",
        "Y.T. Zhao",
        "X.M. Zhou",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "J. Deng",
        "X.G. Jiang",
        "G.J. Yang",
        "L.W. Zhang",
        "CAEP/IFP",
        "Mainyang",
        "Sichuan",
        "People's Republic of China",
        "Institute of Fluid Physics",
        "China Academy of Engineering Physics",
        "Mianyang",
        "Sichuan",
        "People's Republic of China",
        "Lanzhou University",
        "Lanzhou",
        "People's Republic of China",
        "In order to identify the density and material type",
        "high energy protons",
        "electron",
        "and heavy ions are used to radiograph dense objects. The transmitted particles through the object undergo the multiple coulomb scattering",
        "and focus on an image plane by a magnetic lens system. A transformed beam line in the Institute of Modern Physics (IMP) of the Chinese Academy of Sciences (CAS) has been developed for heavy ions radiography. It can radiograph a static object and the spatial resolution is about 65um (σ). This paper presents the heavy ions radiography facility at IMP",
        "including the beam optics",
        "the simulation of radiography by Monte Carlo code and the experiment result with 600 MeV/u carbon ions. In addition",
        "the dedicated beam lines for proton radiography in plan are also introduced."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph10.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH10",
      "page_number": "48",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH11",
      "title": "Study of the Heavy Ion Bunch Compression in CSRm",
      "authors": [
        "D.Y. Yin",
        "W.P. Chai",
        "J. Li",
        "P. Li",
        "Y. Liu",
        "P. Shang",
        "J.C. Yang",
        "Y.J. Yuan",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "The feasibility of attaining nanosecond pulse length heavy ion beam is studied in the main ring(CSRm) of the Heavy Ion Research Facility in Lanzhou. Such heavy ion beam can be produced by non-adiabatic compression",
        "and it is implemented by a fast rotation in the longitudinal phase space. In this paper",
        "the possible beam parameters during longitudinal bunch compression are studied with the envelope model and Particle in Cell simulation",
        "and the results are compared. The result shows that the short bunch 238U28+ with the pulse duration of about 50ns at the energy of 200MeV/u can be obtained"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph11.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH11",
      "page_number": "51",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH12",
      "title": "Lattice Upgrade of the SSRF Storage Ring",
      "authors": [
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "Shanghai Synchrotron Radiation Facility (SSRF) will implement its Phase II beamline project in the near future. In this project",
        "two long straight sections of the SSRF storage ring will be installed with dual-canted insertion devices. Double-mini-βy optics in the long straight section is designed and optimized in order to obtain high brightness and good machine performance. Lattice upgrade with super-bend is also proposed. Local achromatic for superconducting wiggler is necessary to suppress emittance growth. The lattice upgrade and beam dynamics of the SSRF storage ring with these considerations are presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph12.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH12",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPH13",
      "title": "Transverse Impedance Distribution Measurement at SSRF",
      "authors": [
        "M.Z. Zhang",
        "B.C. Jiang",
        "S.Q. Tian",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "Impedance is very important for the beam instability in a storage ring. More and more small gap In-vacuum IDs are installed in the SSRF storage ring and introduced local transverse impedance. Since the beams sees the impedance as quadrupole whose strength depends on the beam current",
        "LOCO is used for the impedance distribution. Impedance disribution is determined by phase advance and quadrupole strengths slops."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph13.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH13",
      "page_number": "54",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH14",
      "title": "Ion Tracking in a High-Voltage DC Photo-Gun",
      "authors": [
        "R.J. Yang",
        "K. Li",
        "Q. Pan",
        "H. Wang",
        "D. Wu",
        "D.X. Xiao",
        "X. Yang",
        "CAEP/IAE",
        "Mianyang",
        "Sichuan",
        "People's Republic of China",
        "The photocathode lifetime of GaAs in a high voltage DC gun is limited primarily by ion back bombardment. Ions produced in collisions of the electron beam with residual gas in cathode-anode gap and downstream of the anode are accelerated toward the cathode and strike the cathode surface. Systematical studies suggest that ion back bombardment is determined by gas pressure",
        "gun voltage",
        "laser spot and electric field profile. This paper presents a study of ion back bombardment in a high average current DC photocathode gun. This study is based on numerical analysis and particle tracking simulation. The results implies that ion generation can be suppressed by improving vacuum condition as well as gun voltage",
        "and the back bombardment can be reduced by the optimization of laser spot position and electric field profile."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph14.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH14",
      "page_number": "58",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH16",
      "title": "The Simulation of Stripping Extraction Process for CYCIAE-100",
      "authors": [
        "Shizhong. An",
        "F.P. Guan",
        "M. Li",
        "S.M. Wei",
        "J.J. Yang",
        "T.J. Zhang",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "A 100 MeV H− compact cyclotron is under construction at China Institute of Atomic Energy (CYCIAE-100). The proton beams of 75 MeV - 100 MeV at an intensity of 200 μA will be extracted in dual opposite directions by charge exchange stripping devices. The two main parameters for the stripping extraction are the positions of stripping foil and combination magnet. For CYCIAE-100",
        "the center of combination magnet is fixed at (R=2.75 m",
        "θ=100°) and the extracted radii decide the positions of stripping foil for different extracted energies. In order to analyze the extracted proton beam parameters",
        "the stripping extraction process for CYCIAE-100 is simulated in detail in this paper. The simulation is mainly done for the different RF acceptance or acceleration phase width. The simulation results indicate that the energy spreads of the extracted beams under different initial phase width conditions are almost the same. The transverse beam distribution and the extracted beam profile are not affected by the initial phase width due to the simulation",
        "that's the characters of the cyclotron with the stripping extraction mode."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph16.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH16",
      "page_number": "62",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH18",
      "title": "Activities on Proton Accelerator R&D in Tsinghua University",
      "authors": [
        "S.X. Zheng",
        "X. Guan",
        "X.W. Wang",
        "Q.Z. Xing",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "Hadron Application and Technology Center (HATC) was founded in Tsinghua University at 2009",
        "its mission is conducting research and development on proton accelerator and its application. The first project is Compact Pulsed Hadron Source (CPHS). It consists of an accelerator front-end'a high-intensity ion source",
        "a 3 MeV radiofrequency quadrupole linac (RFQ)",
        "and a 13 MeV drift-tube linac (DTL)",
        "a neutron target station'a beryllium target with solid methane and room temperature water moderators/reflector",
        "and tentatively six neutron stations for imaging/radiography",
        "activation analysis",
        "small-angle scattering",
        "reflectometry",
        "beamline optics development",
        "and therapy. Up to now",
        "the 3 MeV linac and target station have been finished. And neutron detecting experiments are underway. At the same time",
        "a 200 MeV proton synchrotron dedicated space irradiation effects research is planed too. The main ring consists of 6 dipoles and 12 quadrupoles. A 7 MeV H− linac is as injector of the synchrotron. The HATC group is developing cooling system for FRIB 80MHz RFQ also."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph18.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH18",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPH20",
      "title": "Mismatch Study of C-ADS Main Linac",
      "authors": [
        "C. Meng",
        "S. Pei",
        "J.Y. Tang",
        "F. Yan",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The C-ADS accelerator is a CW (Continuous-Wave) proton linac of 1.5 GeV in beam energy",
        "10 mA in beam current",
        "and 15 MW in beam power. To meet the extremely low beam loss rate and high reliability",
        "it is very important to study the beam halo caused by beam mismatch. To avoid the envelope instability",
        "the phase advances per period are smaller than 90 degree in the design of main linac. In this paper",
        "we reported the results of emittance growth and the envelope oscillations caused by mismatch in the main linac section. According to the simulation results",
        "the transverse mismatch factor should be smaller than 0.4 and longitudinal mismatch factor smaller than 0.3 to meet the emittance growth requirement."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph20.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH20",
      "page_number": "65",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH22",
      "title": "An X-Band Linear Accelerator with Continuously-adjustable Beam Energy",
      "authors": [
        "L. Zhang",
        "H.B. Chen",
        "Q.X. Jin",
        "J. Shi",
        "C.-X. Tang",
        "P. Wang",
        "Z. Zhang",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "An X-band linac is designed to produce beam energy between 0.5MeV and 1.5MeV",
        "and the output beam energy is continuously adjustable within this range. Two sections of linacs are combined and powered by a single microwave source. By tuning the RF phase and amplitude of the second section of the linac",
        "the electron beam can see either acceleration or deceleration",
        "which tunes the output energy. This paper presented the principle and the design of the linac",
        "as well as the production of the whole system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph22.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH22",
      "page_number": "68",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH23",
      "title": "Design of Secondary Electron Emission Test Equipment with Low Electron Energy and Experimental Research",
      "authors": [
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "In particle accelerators",
        "the secondary electrons resulting from the interaction between the particles and the vacuum chamber have important influence on beam quality. Especially for the positron",
        "proton and heavy ion accelerators",
        "massive electrons lead to electron cloud",
        "which affect the stability",
        "energy",
        "emittance and beam life adversely. We designed a secondary electron emission measurement system with low electron energy and studied measurement of secondary electron emission (SEE) of metal and non-evaporable getter materials. From this system",
        "we can obtain the characteristics of the SEE yield from non-evaporable getter materials irradiated by an electron beam with an independently adjustable energy of 50 eV to 5 keV. This paper will provide the basis for the design and construction of the new generation of particle accelerator",
        "and can also be applied in the fields of electron microscope",
        "electro vacuum and aerospace components."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph23.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH23",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPH24",
      "title": "Design and Simulation of Ultra-Low Beta IH Linac",
      "authors": [
        "CAEP/IFP",
        "Mainyang",
        "Sichuan",
        "People's Republic of China",
        "Recently IH structure has been used in low energy heavy particle linac to get high shunt impedence and reduce cavity dimention. The input beam energy is about 600KeV/u",
        "which is accelerated by RFQ from ECR ion source .We have designd an ultra-low beta linac with IH structure",
        "the input energy is about 40KeV/u.The simulation of the beam dynamic shows that the beam can be successfully accelerated to high energy from ECR ion sourec without RFQ."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph24.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH24",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPH25",
      "title": "RF and Coupler Design of a Micro-Pulse Electron Gun",
      "authors": [
        "L. Liao",
        "Q. Gu",
        "M. Zhang",
        "M.H. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "The RF parameter design of a micro-pulse electron gun (MPG) should be inclined to benefit both the resonance condition of multipacting effect and beam quality",
        "and in particular it is found that the axis electric field of cavity is essential to yield high quality beams. The high RF power density is delivered to the cavity by a small hole in the top of cavity. The size of coupling hole is carefully regulated to overcoupling by using CST MW. Also the configuration of whole gun is presented. Because of its simple structure and operation",
        "the MPG will play a major role in some cost-effective accelerating systems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph25.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH25",
      "page_number": "71",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH26",
      "title": "Applying the None-stationary Theory to the Multipacting Analysis of a Cyclotron RF Cavity",
      "authors": [
        "C. Wang",
        "B. Ji",
        "Z.G. Yin",
        "T.J. Zhang",
        "Z.L. Zhao",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "The most of the available multipacting theories are based on assumptions on the emission velocities of secondary electrons and restrict the electron-surface impact pattern to double surface impacts. And these theories can only predict the multipacting conditions in the form of Hatch diagram",
        "which is a formularization of RF voltage vs. frequency multiplied by gap distance",
        "and have very little information on the dynamics of multipacting processes. However",
        "the None-stationary multipacting theory introduced by S. Anza *",
        "uses more physical statistic way to dealing with the emission velocities of secondary electrons and have no restrict on the electron-surface impact pattern. In this paper we first extend the None-stationary multipacting theory. And then",
        "we have made a careful analysis on the dynamics of a multipacting process observed during RF conditioning of a cyclotron",
        "by using the none-stationary theory. This analysis gives us an inspiration to both figure out the problem and develop a cure to it."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph26.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH26",
      "page_number": "74",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH27",
      "title": "Lattice Design of Low Beta Function at Interaction Point for TTX Compact Ring",
      "authors": [
        "T. Rui",
        "W.-H. Huang",
        "H.S. Xu",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "A storage ring is being designed at Accelerator Laboratory in Tsinghua University to increase the average photon flux generated by Tsinghua Thomson scattering x-ray source (TTX). To achieve a small beta function at the interaction point(IP)",
        "four pairs of quadrupole magnets are added to the baseline design. Global scan of all stable settings and genetic algorithm(GA) techniques are utilized to optimize the design. The lattice design is presented in this work."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph27.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH27",
      "page_number": "78",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH28",
      "title": "Study",
      "authors": [
        "ASIPP",
        "Hefei",
        "People's Republic of China"
      ],
      "institutions": [
        "Funding: The National Magnetic Confinement Fusion Science Program of China (2013GB101000)"
      ],
      "abstract": "A transmission circuit",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph28.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH28",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPH29",
      "title": "Recent Progress on Plasma-based Acceleration at Tsinghua University",
      "authors": [
        "TUB",
        "Beijing",
        "People's Republic of China",
        "A unique facility for laser plasma physics and advanced accelerator research has been built recently at Tsinghua Universtiy. This system is based on Tsinghua Thomson scattering X-ray source (TTX)",
        "which combining an ultrafast TW laser with a synchronized 45MeVhigh brightness linac. In our recent laser wakeeld acceleration experiments",
        "we have obtained 10~40MeV high quality monoenergetic electron beams by running the laser at 5TW peak power. Under certain conditions",
        "very low relative energy spreads of a few percent can be achieved",
        "which closes to the best published results. Absolute charge calibration for three dierent scintillating screens has also been performed using our linac system",
        "and the typical charge of accelerated electron beams is in the picocoulomb range."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph29.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH29",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPH30",
      "title": "Mechanical Stablitity Analysis on Optical Cavity  Used for TTX",
      "authors": [
        "X. Liu",
        "W.-H. Huang",
        "C.-X. Tang",
        "L.X. Yan",
        "Y. You",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "Due to the great applications of ultrafast X-ray in detecting the micro-world",
        "the X-ray sources develop rapidly. One of X-ray sources named Laser-Electron X-ray Machine (LEXM) based on the Inverse Compton Scattering of optical cavity is very promising. Accelerator Lab of Tsinghua University has finished the basic proto-type design. This paper compares the different kinds of X-ray source",
        "such as SR",
        "FEL",
        "X-ray tubes and LEXM. And this paper optimizes the optical lengths of four mirrors structure optical cavity and analysis the mechanical stabilities of two mirrors and four mirrors structure optical cavity. According to the simulation results",
        "we choose the four mirrors structure optical cavity."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph30.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH30",
      "page_number": "81",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH31",
      "title": "Progress of Development of a 4 MW High Power Ion Source for the EAST Neutral Beam Injector",
      "authors": [
        "Y.H. Xie",
        "C.D. Hu",
        "ASIPP",
        "Hefei",
        "People's Republic of China",
        "A 4 MW high Power ion source is developed for the Experimental Advanced Superconducting Tokamak (EAST) neutral beam injector (NBI). The ion source is designed to generate a deuterium beam of 40-70 A with energy of 50-80 keV，the beam duration is 10-100 seconds. The ion source is consists of a magnetic bucket plasma generator with multi-pole cusp-fields and a set of tetrode accelerators with slit-type apertures. The plasma generator has a rectangular shape arc chamber with dimension of 650mm(Length) * 260mm(Width) * 300mm (Depth). There are 40 lines permanent magnets are installed outside of the arc chamber to form axial line-cusp configuration",
        "and 32 pure tungsten filaments installed to supply primary thermo-electrons. The accelerator consists of plasma gird (PG)",
        "gradient grid (GG)",
        "suppressor grid (SG) and exit grid (EG). Each grid has 64 rails which are made of molybdenum. The beam extraction area is 120mm * 480mm",
        "and has a transparency of 60 %. The ion source is tested on the test bed. The hydrogen beam power of 4MW with beam energy of 80 keV in 1 second and long pulse of 100 seconds with beam energy of 50 keV are achieved on the test stand respectively."
      ],
      "institutions": [
        "Funding: Supported by the National Magnetic Confinement Fusion Science Program of China (No. 2013GB101000)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph31.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH31",
      "page_number": "84",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH32",
      "title": "Measurement of Key Parameters for EAST Neutral Beam Injector",
      "authors": [
        "Y. Xu",
        "C.D. Hu",
        "L.Z. Liang",
        "S. Liu",
        "Z.M. Liu",
        "P. Sheng",
        "Y.H. Xie",
        "ASIPP",
        "Hefei",
        "People's Republic of China",
        "Neutral beam injection is recognized as one of the most effective means of plasma heating. The target values of EAST Neutral beam injector (NBI) are beam energy 50-80kev",
        "injection beam total power 2-4 MW",
        "beam pulse width 10-100s. The beam power will deposit on the beam collimator due to the beam divergence and it will cause heat damage to heat load components",
        "or even destroy the entire NBI system. In order to decrease the risk",
        "the key parameters of NBI",
        "such as divergence angle",
        "beam power density distribution",
        "neutralizing efficiency",
        "the beam power deposited on heat load components",
        "should be assessed. In this article",
        "the calculation principles and experimental results are given. The results direct the operation parameter optimization of EAST NBI and lay a solid foundation for realization of plasma heating for EAST."
      ],
      "institutions": [
        "Funding: Supported by the National Magnetic Confinement Fusion Science Program of China (2013GB101000)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph32.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH32",
      "page_number": "87",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPH34",
      "title": "The Area Density Resolution of 11MeV Low-energy Proton Radiography Using Magnetic Lens System",
      "authors": [
        "Institute of Fluid Physics",
        "China Academy of Engineering Physics",
        "Mianyang",
        "Sichuan",
        "People's Republic of China",
        "The low-energy proton radiography (PRAD) based on the magnetic lens imaging system is an imaging technique suited for the diagnosis of thin objects. According to the theoretical analysis",
        "for objects of small thicknesses",
        "the contrast of the low-energy PRAD result is superior to that of the high-energy PRAD. Proceeding from the imaging principle",
        "the influence of the collimator angle of the magnetic lens system on the area density resolving power is investigated. The PRAD results of aluminum foil objects on the 11MeV PRAD beamline at the China Academy of Engineering Physics (CAEP) are also demonstrated. The experimental results show that",
        "by setting the collimator angle appropriately",
        "this 11MeV PRAD beamline was able to radiograph objects of area density less than 2.7×10'2 g/cm2."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph34.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH34",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPH35",
      "title": "APF DTL Design Besed on iMpAPF",
      "authors": [
        "P. Jiang",
        "C. Li",
        "P. Li",
        "Z.J. Wang",
        "Y.J. Yuan",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "Alternative phase focusing (APF) DTL has advantages in price and space. However",
        "the designing of APF is difficult because of the jumping phases. In order to design and simulate a proper APF",
        "a code iMpAPF(i Multi-particle APF) has been developed. RK4 is introduced in this code for calculation",
        "and the soul of the code is smoothness. Theoretically",
        "the particle tracing figures out that the theoretic phase advance ratio between longitudinal direction and transversal direction is close to 2. Based on this code",
        "a C5+",
        "200 MHz",
        "medium energy APF as a linear injector of a synchrotron used for cancer therapy has been designed. This paper focuses on the development of iMpAPF",
        "and also several results obtained from the code are shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SAP2014/talks/weph35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SAP2014/papers/weph35.pdf",
      "poster_url": "https://proceedings.jacow.org/SAP2014/posters/weph35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2014-WEPH35",
      "page_number": "90",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 28,
  "scrape_time": "2025-10-11 02:57:36"
}