{
  "session_info": {
    "id": "TUOBA",
    "name": "TUOBA - Contributed Oral Presentations, Hadron Accelerators",
    "url": "https://proceedings.jacow.org/ipac2017/html/tuoba.htm"
  },
  "papers": [
    {
      "paper_id": "TUOBA1",
      "title": "Beam Commissioning Results of the CSNS Linac",
      "authors": [
        "J. Peng",
        "Y.W. An",
        "S. Fu",
        "L. Huang",
        "M.Y. Huang",
        "Y. Li",
        "Z.P. Li",
        "S. Wang",
        "S.Y. Xu",
        "Y. Yuan",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "M.T. Li",
        "Y.D. Liu",
        "CSNS",
        "Guangdong Province",
        "People's Republic of China",
        "The China Spallation Neutron Source(CSNS) accelera-tor systems is designed to deliver a 1.6GeV",
        "100kW pro-ton beam to a solid metal target for neutron scattering research. It consists of a 50keV H− Ion Source",
        "a 3MeV Radio Frequency Quadrupole (RFQ)",
        "an 80MeV Drift Tube Linac (DTL)",
        "and a 1.6GeV Rapid-cycling Synchro-tron (RCS). The beam commissioning has been started since April 2015. The Front End and three of the four DTL tanks have been commissioned",
        "while the last tank and the RCS will be commissioned at the autumn this year. At the end of the DTL3",
        "beam has been accelerated to 61MeV with nearly 100% transmission",
        "other parame-ters such as peak current",
        "transverse emittance and beam orbit have reached the design goal. Results and status of the beam commissioning program will be presented."
      ],
      "institutions": [
        "*This work is supported by National Natural Science Foundation of China (11505101).  **E-mail:pengjun@ihep.ac.cn"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/tuoba1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/tuoba1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/tuoba1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-TUOBA1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOBA2",
      "title": "Commissioning of the MYRRHA Low Energy Beam Transport Line and Space Charge Compensation Experiments",
      "authors": [
        "F. Bouly",
        "M.A. Baylac",
        "D. Bondoux",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "J. Belmans",
        "D. Vandeplassche",
        "Studiecentrum voor Kernenergie - Centre d'Étude de l'énergie Nucléaire (SCK•CEN)",
        "Mol",
        "Belgium",
        "N. Chauvin",
        "F. Gérardin",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "The MYRRHA project aims at the construction of a new research reactor in Mol (Belgium) to demonstrate the nuclear waste transmutation feasibility with an Accelerator Driven System (ADS). In its subcritical configuration",
        "the MYRRHA facility requires a proton beam with a maximum power of 2.4 MW (600 MeV - 4 mA). Such a continuous wave beam will be delivered by a superconducting linear accelerator (linac) which must fulfil very stringent reliability requirements to ensure the safe ADS operation with a high level of availability. The linac injector will be composed of: a proton source",
        "a low energy beam transport line (LEBT)",
        "a 176 MHz RFQ and CH-DTL cavities. The LEBT prototype has been built and is presently installed and operated at LPSC Grenoble (France). An experimental program",
        "to optimise the tuning of the line",
        "the beam transport",
        "and to study the space charge compensation mechanism",
        "is in progress. We here review the main achievements of the LEBT commissioning. Experimental results will be presented and discussed",
        "in particular the influence of the residual gas (type and pressure) on the beam dynamics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/tuoba2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/tuoba2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/tuoba2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-TUOBA2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOBA3",
      "title": "Strain and Temperature Measurements From the SNS Mercury Target Vessel During High Intensity Beam Pulses",
      "authors": [
        "W. Blokland",
        "Y. Liu",
        "B.W. Riemer",
        "M. Wendel",
        "D.E. Winder",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "To better understand the mechanical impact of the proton beam on the lifetime on Spallation Neutron Source (SNS*) mercury-filled",
        "stainless steel targets",
        "these targets are now instrumented with optical and metal strain sensors",
        "temperature sensors",
        "and accelerometers. The strain and temperature sensors are placed inside the target vessel",
        "between the water shroud and mercury vessel",
        "while the accelerators are placed outside on the target mount and on the mercury return line. We now have data from four targets. The first instrumented target used regular multimode optical sensors",
        "while later targets have used radhard multimode sensors. We are also developing super-radhard single-mode optical strain sensors to get data further into the production cycle.  In this paper",
        "we describe the data-acquisition system",
        "compare the measured strain to the simulated strain for the different targets",
        "estimate the survivable radiation level for each type of sensor",
        "and discuss the implications of the results on the lifetime of the target."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/tuoba3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/tuoba3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/tuoba3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-TUOBA3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:46:52"
}