{
  "session_info": {
    "id": "THIOA",
    "name": "THIOA - Technical R&D - Mass production",
    "url": "https://proceedings.jacow.org/SRF2013/html/thioa.htm"
  },
  "papers": [
    {
      "paper_id": "THIOA01",
      "title": "Infrastructure, Methods and Test Results for the Testing of 800 Series Cavities for the European XFEL",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "The main linac of the European XFEL will consist of 100 accelerator modules",
        "i.e. 800 superconducting accelerator cavities operated at a design gradient of 23.6 MV/m. The fabrication and surface preparation of the cavities in industry is in full swing. This talk describes the infrastructure and procedures of the vertical acceptance test in the \"Accelerator Module Test Facility AMTF\" at DESY. The present status of the test results is given."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/thioa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/thioa01.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/thioa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-THIOA01",
      "page_number": "812",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THIOA02",
      "title": "The Challenge to Assemble 100 Cryomodules for the European E-XFEL",
      "authors": [
        "CEA",
        "Gif-sur-Yvette",
        "France",
        "S. Berry",
        "J.-P. Charrier",
        "M. Fontaine",
        "Y. Gasser",
        "O. Napoly",
        "C.S. Simon",
        "T.V. Vacher",
        "B. Visentin",
        "CEA/DSM/IRFU",
        "France",
        "P. Charon",
        "C. Cloué",
        "G. Monnereau",
        "J.L. Perrin",
        "D. Roudier",
        "Y. Sauce",
        "T. Trublet",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "As In-Kind contributor to the E-XFEL project",
        "CEA is committed to the integration on the Saclay site of the 100 cryomodules (CM) of the superconducting linac as well as to the procurement of miscellaneous parts including 31 cold beam position monitors (BPM) of the re-entrant type. The assembly infrastructure has been renovated from the previous Saturne Synchrotron Laboratory facility: it includes a 200 m2 clean room complex with 112 m2 under ISO4",
        "1325 m2 of assembly platforms and 400 m2 of storage area. In parallel",
        "CEA has conducted industrial studies and three cryomodule assembly prototyping both aiming at preparing the industrial file",
        "the quality management system and the commissioning of the assembly plant",
        "tooling and control equipment. In 2012",
        "the contract of the integration has been awarded to ALSYOM. The first pre-series modules have been assembled and are being tested at DESY. This paper will present the challenges of the module integration from the preparation phase to the industrial phase."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/thioa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/thioa02.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/thioa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-THIOA02",
      "page_number": "816",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THIOA03",
      "title": "Cavity Fabrication Study in CFF at KEK",
      "authors": [
        "M. Yamanaka",
        "Y. Ajima",
        "H. Inoue",
        "T. Kubo",
        "T. Saeki",
        "Y. Watanabe",
        "S. Yamaguchi",
        "KEK",
        "Ibaraki",
        "Japan",
        "The construction of new facility for the fabrication of superconducting RF cavity at KEK was completed in 2011. It is equipped with the following machines; an electron-beam welding (EBW) machine",
        "a servo press machine and a CNC vertical lathe. A chemical etching apparatus is also equipped. The study on the fabrication of 9-cell cavity for International Linear Collier (ILC) has been started from 2009 using this facility. The study is focusing on the cost reduction with keeping high performance of cavity",
        "and the goal is the establishment of mass-production procedure for ILC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/thioa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/thioa03.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/thioa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-THIOA03",
      "page_number": "821",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THIOA04",
      "title": "Low-Beta Cryomodule Design Optimized for Large-Scale Linac Installations",
      "authors": [
        "S.J. Miller",
        "B. Bird",
        "N.K. Bultman",
        "F. Casagrande",
        "A.D. Fox",
        "M.J. Johnson",
        "M. Leitner",
        "T. Nellis",
        "J.P. Ozelis",
        "X. Rao",
        "R.J. Rose",
        "M. Shuptar",
        "K. Witgen",
        "Y. Xu",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "This paper will present most recent design developments at FRIB to optimize low-beta cryomodules for large-scale linac installations. FRIB",
        "which requires the fabrication of 53 cryomodules",
        "has to emphasize ease of assembly and alignment plus low cost. This paper will present experimental results of a novel kinematic rail support system which significantly eases cryomodule assembly. Design choices for mass-production are presented. Results of vibration calculations and measurements on a FRIB prototype cryomodule will be reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/thioa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/thioa04.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/thioa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-THIOA04",
      "page_number": "825",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THIOA05",
      "title": "Optimization of SRF Linacs",
      "authors": [
        "JLAB",
        "Newport News",
        "Virginia",
        "USA"
      ],
      "institutions": [],
      "abstract": "This work describes preliminary results of a new software tool that allows one to vary parameters and understand the effects on the optimized costs of construction plus 10 year operations of an SRF linac, the associated cryogenic facility, and controls, where operations includes the cost of the electrical utilities but not the labor or other costs. It derives from collaborative work done with staff from Accelerator Science and Technology Centre, Daresbury, UK several years ago while they were in the process of developing a conceptual design for the New Light Source project. The initial goal was to convert a spread sheet format to a graphical interface to allow the ability to sweep different parameter sets. The tools also allow one to compare the cost of the different facets of the machine design and operations so as to better understand the tradeoffs. More recent additions to the software include the ability to save and restore input parameters as well as to adjust the Qo versus E parameters in order to explore the potential costs savings associated with doing so.",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/thioa05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/thioa05.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/thioa05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-THIOA05",
      "page_number": "830",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-11 04:16:49"
}