{
  "session_info": {
    "id": "WEPWO",
    "name": "WEPWO - Poster Session",
    "url": "https://proceedings.jacow.org/IPAC2013/html/wepwo.htm"
  },
  "papers": [
    {
      "paper_id": "WEPWO001",
      "title": "Power Couplers for XFEL",
      "authors": [
        "W. Kaabi",
        "M. El Khaldi",
        "A. Gallas",
        "P. Lepercq",
        "C. Magueur",
        "A. Variola",
        "A. Verguet",
        "LAL",
        "Orsay",
        "France",
        "DESY",
        "Hamburg",
        "Germany",
        "The LAL contribution to the XFEL project will be the delivery of 800 power couplers to equip 100 Cry-modules. The LAL’s tasks consist on the industrial monitoring and coupler quality control at two different production sites",
        "in addition to the RF conditioning at LAL of the 800 produced couplers. The RF conditioning and all the coupler preparation process will be held in a 70m2 ISO5 clean room. An RF power station delivering 5MW",
        "allow 8 couplers conditioning in the same time. Being in production control side and also RF conditioning one",
        "the aim of LAL is to reach the rate of 8 couplers delivery per week",
        "after a rump up phase. The starting of Coupler mass production is scheduled for beginning 2013."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo001.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO002",
      "title": "RF Measurements of the 1.6 Cell Lead/Niobium Photoinjector in HoBiCaT",
      "authors": [
        "A. Burrill",
        "W. Anders",
        "T. Kamps",
        "J. Knobloch",
        "O. Kugeler",
        "P. Lauinger",
        "A. Neumann",
        "HZB",
        "Berlin",
        "Germany",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "NCBJ",
        "Świerk/Otwock",
        "Poland",
        "DESY",
        "Hamburg",
        "Germany",
        "The development of a simple and robust SRF photoinjector capable of delivering up to 1 mA average current in c.w. operation continues to progress with the horizontal RF testing of the 1.6 cell Pb/Nb hybrid photoinjector. This injector utilizes a sputtered lead coating on a removable Nb cathode plug as the photoelectron source and has recently been tested in the horizontal test cryostat facility",
        "HoBiCaT",
        "at HZB. In this paper we will report on the status of these RF measurements and compare the performance to previous vertical RF tests performed at JLab. We will also report on the experience operating this cavity with a TTF-III high power RF input coupler",
        "as well as provide a summary of the microphonics susceptibility now that it has been installed into a helium vessel and equipped with a Saclay style tuner."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo002.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO004",
      "title": "Studies of Systematic Flux Expulsion in Superconducting Niobium",
      "authors": [
        "J.M. Vogt",
        "J. Knobloch",
        "O. Kugeler",
        "HZB",
        "Berlin",
        "Germany",
        "The quality factor Q0 that can be obtained in a superconducting cavity is known to depend on various factors like niobium material properties",
        "treatment history and magnetic shielding. We believe that cooling conditions have an additional impact",
        "as they appear to influence the amount of trapped flux and hence the residual resistance. We have constructed a test stand using niobium rods to study flux trapping. Here we can precisely control the temperature and approach Tc from below in the superconducting state. Although the sample remains in the superconducting state",
        "a change in the amount of trapped flux is visible. The procedure can be applied repeatedly resulting in a significantly lowered level of trapped flux in the sample. Furthermore",
        "simulations using the Radia software package for Mathematica developed by the ESR were used to better unterstand the measured changes in magnetic flux around the Sample. Applying a similar procedure for minimization of trapped magnetic flux to a superconducting cavity could allow for reduction of the magnetic contribution to the surface resistance and result in a significant improvement of Q0."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo004.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO005",
      "title": "Microphonics Analysis of the SC 325 MHz CH-Cavity",
      "authors": [
        "M. Amberg",
        "M. Busch",
        "F.D. Dziuba",
        "H. Podlech",
        "U. Ratzinger",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "M. Amberg",
        "K. Aulenbacher",
        "HIM",
        "Mainz",
        "Germany",
        "IKP",
        "Mainz",
        "Germany",
        "Since the walls of superconducting (sc) cavities are kept very thin to support the cooling process",
        "even small mechanical disturbances can detune the cavity. One of the main sources of detuning a cavity is microphonics. These low-frequent vibrations caused by vacuum pumps or underground noise are transferred to the cryostat and excite mechanical resonances of the cavity which may lead to frequency shifts larger than the bandwidth. To determine the mechanical resonance frequencies of the sc 325 MHz CH-cavity (Crossbar-H-Mode) simulations with ANSYS Workbench have been performed in a first step. Additionally",
        "microphonics measurements were taken at room temperature as well as in a vertical cryostat at 4K in the cryo-lab of the IAP",
        "Frankfurt University. Furthermore",
        "the contraction of the cavity walls and the resulting frequency shift due to the cavity cool-down has been measured. A comparison between simulation results and the measured values is presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo005.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO007",
      "title": "Shape Optimization of a SRF Injector Cavity",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "W.C. Grabowski",
        "R. Nietubyć",
        "T. Wasiewicz",
        "NCBJ",
        "Świerk/Otwock",
        "Poland",
        "In this contribution we present studies on the shape optimization of 1.6-cell cavity with solenoid for a 1-mA class photo injector",
        "meant as an electron source for FEL facilities. The main criterion for the optimization was the lowest slice emittance. Inclination angle of the cavity back wall",
        "solenoid position and magnetic field",
        "amplitude of the accelerating field",
        "and emission phase were varied in these studies in order to find the minimum of slice emittance at the distance of 1 m from a photocathode",
        "located in center of the cavity back wall"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo007.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO008",
      "title": "SRF Conical Half-wave Resonator Tuning Developments",
      "authors": [
        "FZJ",
        "Jülich",
        "Germany",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA"
      ],
      "institutions": [
        "A conical Half-Wave Resonator is considered as an option for a first accelerating cavity for β=v/c=0.11 with the resonance frequency 162.5 MHz for a high-intensity proton accelerator complex proposed at Fermi National Accelerator Laboratory (Project X). We present results of different options of the cavity mechanical tuning. The \"standard\" tuning method of beam port deformations is an effective tuning method still requiring a relatively high tuning pressure. The side tuning is considered as a novel option for the resonance frequency adjustment featuring lower tuning force and an option of the structure design for the resonator frequency shift self compensation."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo008.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO009",
      "title": "Numerical Coupling Analyses of BERLinPro SRF Gun",
      "authors": [
        "FZJ",
        "Jülich",
        "Germany",
        "W. Anders",
        "A. Burrill",
        "T. Kamps",
        "J. Knobloch",
        "O. Kugeler",
        "A. Neumann",
        "HZB",
        "Berlin",
        "Germany",
        "BERLinPro is an approved ERL project to demonstrate energy recovery at 100 mA beam current by pertaining a high quality beam. These goals place stringent requirements on the SRF cavity (1300 MHz",
        "β=1) for the photoinjector which has to deliver a small emittance 100 mA beam with at least 1.8 MeV kinetic energy while limited by fundamental power coupler performance to about 230 kW forward power. The RF and beam dynamics gun cavity features 1.4 λ/2 cell resonator. We present results of mechanical structure developments of SRF gun. The main purpose of the whole structure optimization was the design of the gun helium vessel together with the tuner and stiffening rings to provide the simple construction for structure tuning with minimization of the cavity frequency dependence on external pressure. During the resonator tuning and external load structure deformations the cavity field profile variation along the beam path should stay within 5%."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo009.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO010",
      "title": "BERLinPro Seven-cell SRF Cavity Optimization and HOMs External Quality Factors Estimation",
      "authors": [
        "T. Galek",
        "K. Brackebusch",
        "T. Flisgen",
        "U. van Rienen",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "J. Knobloch",
        "A. Neumann",
        "HZB",
        "Berlin",
        "Germany",
        "B. Riemann",
        "T. Weis",
        "DELTA",
        "Dortmund",
        "Germany",
        "The main scope of this work is the optimization of the superconducting radio frequency (SRF) accelerating cavity design for the Berlin Energy Recovery Linac Project (BERLinPro)*. BERLinPro shall serve as a demonstrator for 100-mA-class ERLs with CW LINAC technology. High-current operation requires an effective damping of higher-order modes (HOMs) of the 1.3 GHz main-linac cavities. Consequently it is important",
        "at the SRF cavity design optimization stage",
        "to calculate the external quality factors of HOMs to avoid beam break up (BBU) instabilities. The optimization of the SRF cavity design consists of two steps. In the first step the cavities' end half-cells are tuned with respect to field flatness",
        "effective shunt impedance and geometrical factor of the fundamental accelerating mode using robust eigenmode simulations. The second step involves frequency domain simulations and the extraction of external quality factors of HOMs from transmission S-parameter spectra using vector fitting procedure and an automated scheme to remove non-static poles **. The eigenmode",
        "as well as the frequency domain simulations are performed using CST Microwave Studio ***.",
        "* A. Neumann et al.",
        "Proc. of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo010.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO011",
      "title": "In-vacuum Temperature Measurement of Niobium Components using Infrared Pyrometry during Electron Beam Welding Procedure",
      "authors": [
        "L. Monaco",
        "P. Michelato",
        "C. Pagani",
        "D. Sertore",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "V. Battista",
        "G. Corniani",
        "M. Festa",
        "Ettore Zanon S.p.A.",
        "Schio",
        "Italy",
        "Electron beam welding (EBW) is widely used in the construction of Niobium Superconducting RF cavities. The welding sequence of such a complex structure",
        "foresees many welding operations. The welding parameters depend on many variables as the material thickness",
        "but also on the component temperature before each weld. This paper presents a technique to measure the temperature of Nb components in vacuum during the EBW operation using an IR pyrometer placed outside the vacuum chamber through an appropriate vacuum viewport. With the current configuration the system can measure temperatures up to 350°C in the vacuum conditions of the EBW vacuum chamber (10-5-10-6 mbar). The technique was used to optimize the time interval between each subsequent equatorial weld operation during Nb cavities production at Ettore Zanon",
        "increasing the welding procedure reliability and decreasing the waiting time by control of the temperatures in the weld region. Moreover this technique can be generally used for in vacuum measurements of components from room temperature up to about 350 °C. Future developments are under way to make this technique compatible with UHV and increasing the measurement range."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo011.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO012",
      "title": "XFEL 3.9 GHz Prototype Cavities Tests",
      "authors": [
        "P. Pierini",
        "M. Bertucci",
        "A. Bosotti",
        "C. Maiano",
        "P. Michelato",
        "L. Monaco",
        "R. Paparella",
        "D. Sertore",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "Fermilab",
        "Batavia",
        "USA",
        "Università degli Studi di Milano & INFN",
        "Segrate",
        "Italy",
        "DESY",
        "Hamburg",
        "Germany",
        "In preparation for the XFEL components production",
        "three prototype cavities have been manufactured and vertically tested at INFN-LASA. Several tests",
        "with and without HOM antennas and in a double cavity test configuration",
        "have been performed. Further tests of one of the prototypes took place at FNAL",
        "to validate results between the two test facilities. Results were consistent with those obtained at INFN-LASA."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo012.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO013",
      "title": "High Power Tests of Injector Cryomodule for Compact-ERL",
      "authors": [
        "E. Kako",
        "D.A. Arakawa",
        "K. Hara",
        "T. Honma",
        "H. Katagiri",
        "Y. Kojima",
        "Y. Kondo",
        "S. Michizono",
        "T. Miura",
        "H. Nakai",
        "H. Nakajima",
        "K. Nakanishi",
        "S. Noguchi",
        "T. Shishido",
        "T. Takenaka",
        "K. Watanabe",
        "Y. Yamamoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "H. Hara",
        "H. Hitomi",
        "K. Sennyu",
        "MHI",
        "Kobe",
        "Japan",
        "In the cERL injector cryomodule",
        "electron beams of 10 mA are accelerated from the beam energy of 500 keV to 5 MeV. A three 2-cell cavity system was chosen for the cERL injector. Each cavity is driven by two input couplers to reduce a required RF power handling capacity and also to compensate a coupler kick. In the cERL injector cryomodule",
        "critical hardware components are not superconducting cavities but RF input couplers operating in CW mode. Six input couplers for the installation in the cryomodule were fabricated",
        "and three pairs of input couplers were carefully conditioned. Costruction status",
        "cool-down tests and high power RF test results on injector cryomodule for compact-ERL at KEK will be discussed in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO014",
      "title": "Rf Field-Attenuation Formulae for the Multilayer Coating Model",
      "authors": [
        "T. Kubo",
        "T. Saeki",
        "KEK",
        "Ibaraki",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan"
      ],
      "institutions": [],
      "abstract": "Formulae that describe the RF electromagnetic field attenuation in the multilayer coating model with a single superconductor layer and a single insulator layer deposited on a bulk superconductor are derived with a rigorous calculation based on the Maxwell equations and the London equation.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo014.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO015",
      "title": "Electron Beam Welding for High Gradient Superconducting Cavity",
      "authors": [
        "T. Kubo",
        "Y. Ajima",
        "H. Hayano",
        "H. Inoue",
        "S. Kato",
        "T. Saeki",
        "M. Sawabe",
        "K. Umemori",
        "Y. Watanabe",
        "S. Yamaguchi",
        "M. Yamanaka",
        "KEK",
        "Ibaraki",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "ULVAC",
        "Inc.",
        "Tsukuba",
        "Japan"
      ],
      "institutions": [],
      "abstract": "Relations between electron beam welding parameters and appearances of weld beads are studied. It was found that a beam generator position and a welding direction affect a geometry of weld bead dramatically. Carbon including contaminants found after the chemistry are also commented.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo015.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO016",
      "title": "Construction of Main Linac Cryomodule for Compact ERL Project",
      "authors": [
        "K. Umemori",
        "K. Enami",
        "T. Furuya",
        "H. Sakai",
        "M. Satoh",
        "K. Shinoe",
        "KEK",
        "Ibaraki",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "JAEA",
        "Ibaraki-ken",
        "Japan",
        "Compact ERL (cERL)",
        "which is a test facility of ERL",
        "is under construction at KEK",
        "in Japan. At the first stage of cERL project",
        "electron beam will be accelerated by 30 MV at main linac region. We have developed a main linac cryomodule",
        "which contains two L-band 9-cell superconducting cavities. Cavity assembly work was carefully done at a class-10 clean room and HOM absorbers and cold windows of input couplers were successfully mounted on the cavities. Next",
        "the frequency tuners",
        "thermal anchors",
        "magnetic shields and temperature sensors and so on were assembled to the cryomodule. Then",
        "using a clean-booth",
        "warm windows of the input couplers are connected to the cold windows and gate valves were also attached to the both ends of the cryomodule. Finally",
        "the cryomodule was installed into the beamline of cERL and connected to a 2K cryogenic system. Target of alignment precision of the cavities",
        "after cooling down to 2K",
        "are set to be within 1 mm against the beamline. The first cool-down test",
        "followed by low power and high power measurements",
        "is scheduled within the year 2012."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo016.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO017",
      "title": "Efforts on Nondestructive Inspections for SC Cavities",
      "authors": [
        "Y. Iwashita",
        "Y. Fuwa",
        "M. Hashida",
        "S. Sakabe",
        "S. Tokita",
        "H. Tongu",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "H. Hayano",
        "K. Watanabe",
        "Y. Yamamoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "INRS-EMT",
        "Varennes (Québec)",
        "Canada",
        "The high resolution camera",
        "so-called Kyoto Camera",
        "inspecting the Sc cavity inner surface showed the importance of nondestructive inspections to improve yield in production of high performance SC Cavities. Further efforts have been continued for the inspection and the high resolution T-map",
        "X-map and eddy current scanner have been developed. A radiography to detect small voids inside the Nb EBW seam with the target resolution of 0.1 mm is under investigation. We have carried out radiography tests with X-rays induced from an ultra short pulse intense laser."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo017.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO018",
      "title": "Status of the IHEP 1.3 GHz Superconducting RF Program for the ILC",
      "authors": [
        "J. Gao",
        "Y.L. Chi",
        "J.P. Dai",
        "R. Ge",
        "T.M. Huang",
        "S. Jin",
        "C. H. Li",
        "S.P. Li",
        "Z.Q. Li",
        "H.Y. Lin",
        "Y. Liu",
        "Z.C. Liu",
        "Q. Ma",
        "Z.H. Mi",
        "W.M. Pan",
        "Y. Sun",
        "J.Y. Zhai",
        "T.X. Zhao",
        "H.J. Zheng",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The 1.3 GHz superconducting radio-frequency (SRF) technology is one of the key technologies for the ILC. IHEP is building an SRF Accelerating Unit",
        "named the IHEP ILC Test Cryomodule (IHEP ILC-TC1)",
        "for the ILC SRF system integration study",
        "high power horizontal test and possible beam test in the future. In this paper",
        "we report the components test results and the assembly preparation of this cryomodule. Processing and vertical test of the large grain low-loss shape 9-cell cavity is done. Performance of the in-house made high power input coupler and tuner at room temperature reaches the ILC specification."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo018.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO019",
      "title": "Development of Frequency Measurement Setup for ADS 650MHz and 1.3GHz Superconducting RF Cavities at IHEP",
      "authors": [
        "S. Jin",
        "J. Gao",
        "Y. Liu",
        "Z.C. Liu",
        "J.Y. Zhai",
        "T.X. Zhao",
        "H.J. Zheng",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The Accelerator Driven Sub-critical System (ADS) is under development in China",
        "and the 650MHz β=0.82 superconducting RF cavity (SRF) has been chosen as a possible candidate to accelerate the proton bunches in the medium energy section from 360MeV to 1.5GeV [1]. In order to obtain quality management and quality assurance during fabrication",
        "radio frequency measurements on parts and subassemblies of SRF cavities become a proper method [2]. In this paper",
        "study on developing a new frequency measurement setup mainly for half cells",
        "dumb-bells and end groups of ADS650MHz cavities at IHEP was reported. A digital pressure sense was assembled in the setup. Together with the simulation on the structural and frequency by ANSYS Workbench",
        "a quantitative standard for the frequency measurement was built for the cavity fabrication. Since a 9-cell TESLA-Like cavity is also under study in the meantime",
        "via a slight modification",
        "the setup can be also used for it."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo019.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO021",
      "title": "ADS 650MHz β=0.82 Supercongducting Cavity Research Status",
      "authors": [
        "Z.C. Liu",
        "J. Gao",
        "S. Jin",
        "Y. Liu",
        "J.Y. Zhai",
        "T.X. Zhao",
        "H.J. Zheng",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "J.X. Wang",
        "H. Yu",
        "H. Yuan",
        "BIAM",
        "Beijing",
        "People's Republic of China"
      ],
      "institutions": [],
      "abstract": "IHEP is developing a 650MHz β=0.82 supercongducting cavity for the China ADS project. The cavity is for the energy range of from 367MeV to 1500Mev. We have chosen a five cell cavity and optimized the cavity with Epk/Eacc and Bpk/Eacc to reach high gradient. Two cavity parts were fabricated and the EB welding is in process. This paper will show the fabrication status and measurement results.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo021.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO022",
      "title": "",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo022.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO023",
      "title": "High Current Superconducting Cavity Study and Design",
      "authors": [
        "Z.C. Liu",
        "J. Gao",
        "S. Jin",
        "Y. Liu",
        "J.Y. Zhai",
        "T.X. Zhao",
        "H.J. Zheng",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "PKU",
        "Beijing",
        "People's Republic of China"
      ],
      "institutions": [],
      "abstract": "IHEP is developing a new type of high current superconducting cavity called slotted cavity proposed in 2010. The cavity is suitable for accelerating high beam current in Energy Recovery Linac (ERL). The cavity can extremely dump high order modes (HOMs) in the cavity to keep a high beam current threshold in the linac. We have studied and designed a three cell cavity and the fabrication is under going.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO025",
      "title": "Preliminary Design of 325 MHz Half-Wave Resonator",
      "authors": [
        "X.Y. Zhang",
        "X. Chen",
        "Z.Q. Li",
        "Q. Ma",
        "W.M. Pan",
        "Y. Sun",
        "G.W. Wang",
        "Q.Y. Wang",
        "B. Xu",
        "G.Y. Zhao",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The Half-Wave Resonator (HWR) has been widely used in proton and heavy ion accelerators",
        "for it has particular advantages of accelerating low energy charged particles. Preliminary design of a 325 MHz β=0.12 superconducting HWR cavity has been proposed at Institute of High Energy Physics (IHEP). The basic geometric parameters choices of the cavity are based upon theoretical model and numerical calculation",
        "and then the RF performances are optimized by extensive electromagnetic simulations. In this paper",
        "the detailed mechanical analysis",
        "frequency control",
        "and the considerations for fabrication of the 325 MHz HWR cavity are also presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo025.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO026",
      "title": "HOM Parameters Simulation and Measurement Result of the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo026.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO028",
      "title": "×10mm2 MgB2 Film Fabricated by HPCVD as a Candidate Material for SRF Cavit",
      "authors": [
        "F. He",
        "K.X. Liu",
        "Z. Ni",
        "D. Xie",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Peking University",
        "Beijing",
        "People's Republic of China",
        "Magnesium diboride (MgB2) is one of candidate material for superconducting radio frequency cavities because of its good features: high transition temperature of ~39K and absence of weak links between grains which prevents other high-Tc superconducting materials",
        "such as YBCO. Previous study of MgB2 are mainly focused on the films’ superconducting properties which are fabricated on Al2O3",
        "SiC or some metal substrates with small scale less than 10×10 mm2. In this work we explore a technique to deposit clean and large-scale MgB2 films on Mo substrate",
        "which is expected to provide a probable way to fabricate MgB2 thin-film cavities.. The measurement results show that its superconducting properties and mechanical behaviors are as good as those fabricated on small-scale metal substrates."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo028.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO029",
      "title": "Design of a SRF Quarter Wave Electron Gun at Peking University",
      "authors": [
        "P.L. Fan",
        "K.X. Liu",
        "S.W. Quan",
        "F. Zhu",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Superconducting RF electron guns hold out the promise of very bright beams for use in electron injectors",
        "particularly in future high average power free-electron lasers (FELs) and energy recovery linacs (ERLs). Peking University is designing a new SRF gun which is composed of a quarter wave resonator (QWR) and an elliptical cavity. Comparing to the elliptical cavity",
        "the QWR is sufficiently compact at the same frequency and its electric field is quasi-DC. We have finished the preliminary design of the QWR cavity. The simulation shows that multipacting is not a critical issue for our cavity structure. Beam dynamic simulation of the QWR cavity is also presented."
      ],
      "institutions": [
        "Funding: Work supported by National Basic Research Project (No. 2011CB808302) and National Natural Science Funds (No. 11075007)"
      ],
      "abstract": "contact author : zhufeng7726@pku.edu.cn",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo029.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO036",
      "title": "Conceptual Design of a Superfluid Superconducting Third Harmonic RF System for the SSRF Storage Ring",
      "authors": [
        "H.T. Hou",
        "J.F. Liu",
        "Z.T. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "Shanghai KEY Laboratory of Cryogenics & Superconducting RF Technology",
        "Shanghai",
        "People's Republic of China",
        "Harmonic cavity can improve the beam quality through bunch size lengthening which includes providing Landau damping",
        "suppressing coupled bunch instability and microwave instability",
        "enhancing the beam current per bunch besides the beam lifetime improvement. A passive third harmonic superconducting cavity operating at super fluid liquid helium has been proposed for the SSRF storage ring with compromise on the required harmonic voltage",
        "limited installation space and dissipated cryogenic power. This paper will mainly present the conceptual design of the harmonic rf system including the requirement of SSRF",
        "a brief review on beam dynamics of harmonic rf system and the harmonic cavity choice."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo036.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO039",
      "title": "Prototyping of TEM-like Mode Resonators in the RAON",
      "authors": [
        "H.C. Jung",
        "M.O. Hyun",
        "D. Jeon",
        "H.J. Kim",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "Preliminary electric-magnetic designs of TEM-like mode resonators(a quarter wave resonator",
        "a half wave resonator",
        "two single spoke resonators) are accomplished for the superconducting linear accelerator in the RAON. Resonant cavities are numerically optimized using a CST MWS code to obtain higher E-field gradient along the beam line in conditions of the peak E-field and B-field is less than 30MV/m",
        "60mT respectively. Prototyping test of a quater wave resonator of optimum beta 0.047 using OFC(Oxygen Free Cupper)is in progress to analyze resonant frequency shifting by tolerances in fabrication process and external perturbations. It is compared with expected one using compuational codes."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo039.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO040",
      "title": "Design of HWR at RISP",
      "authors": [
        "G.-T. Park",
        "H.J. Cha",
        "H.C. Jung",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "At RISP",
        "superconducting cavity resonators to accelerate the various ions in high current are being developed. In particular",
        "hal-wave resonator (HWR) will be used for β=0.12",
        "f=162.5 MHz. Here we present the structural analysis of HWR",
        "which includes the prediction of resonant frequency shift during the manufacturing and testing process",
        "stiffening measures to minimize the shift",
        "and the tuning mechanism. The processes of welding",
        "polishing",
        "vacuuming",
        "cooling (to crygenic temperature)as well as Lorentz force",
        "helium pressure fluctuation",
        "microphonics",
        "and interaction with the helium vessel and tuning system will be simulated optimizing the frequency shift."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo040.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO041",
      "title": "Beam Commissioning Superconducting RF Cavities for PLS-II Upgrade",
      "authors": [
        "Y.U. Sohn",
        "M.-H. Chun",
        "J.Y. Huang",
        "Y.D. Joo",
        "S.H. Nam",
        "C.D. Park",
        "H.J. Park",
        "I.S. Park",
        "I.H. Yu",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "Two superconducting RF cavities were commissioned with electron beam at PLS-II",
        "which is upgraded machine from PLS with 3 GeV",
        "20 insertion devices",
        "and now on user service. These srf cavities have been prepared during last 3 years. Each cavity was tested with higher than 2 MV rf voltage and 125 kW standing wave power at CW mode after installation at storage ring. PLS-II is on user operation with 200 mA beam current now",
        "and on the way of beam current improvement upto 400mA",
        "by synchrotron conditioning for beam chamber and in-vacuum udulators. Upto 200 mA beam current no beam instability from the higher order modes is observed. With top-up mode operation",
        "the errors of amplitude of rf field and phase are recorded as 0.3% and 0.3 degree peak to peak",
        "respectively during one day. Successful PLS-II upgrade with hardware and its designed performance will be declared at the end of 1st half user run in 2013."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo041.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO042",
      "title": "Dubna-Minsk SRF Technology Development Status Report",
      "authors": [
        "N.S. Azaryan",
        "Ju. Boudagov",
        "D.L. Demin",
        "V.V. Glagolev",
        "G. Shirkov",
        "G.V. Trubnikov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "M.A. Baturitsky",
        "N.M. Shumeiko",
        "NC PHEP BSU",
        "Minsk",
        "Belarus",
        "S.E. Demyanov",
        "E.Yu. Kaniukov",
        "Scientific-Practical Materials Research Centre of the National Academy of Sciences of Belarus",
        "Minsk",
        "Belarus",
        "A. Ermakov",
        "W. Singer",
        "X. Singer",
        "DESY",
        "Hamburg",
        "Germany",
        "V.A. Karpovich",
        "N.V. Liubetsky",
        "BSU",
        "Minsk",
        "Belarus",
        "S.V. Kolosov",
        "A.A. Kurayev",
        "A.O. Rak",
        "A.K. Sinitsyn",
        "Belarus State University of Informatics and Radioelectronics (BSUIR)",
        "Minsk",
        "Belarus",
        "S.I. Maximov",
        "V.N. Rodionova",
        "Belarussian State University",
        "Scientific Research Institute of Nuclear Problems",
        "Minsk",
        "Belarus",
        "A. Parshuto",
        "V.S. Petrakovsky",
        "I.L. Pobol",
        "A.I. Pokrovsky",
        "S.V. Yurevich",
        "A.Yu. Zhuravsky",
        "Physical-Technical Institute of the National Academy of Sciences of Belarus",
        "Minsk",
        "Belarus",
        "In 2011 Dubna-Minsk collaboration started an activity on the development and manufacture the series of 1.3 GHz superconducting Nb cavities in the enterprises in Belarus. The current status of this work is presented in this report. Main EM characteristics of the cavity were calculated and the shop drawings for cavity fabrication were developed. Two test-benches were assembled for RF-tests of the cavities at room temperature and at liquid helium temperature. The measured SWR was about 1.01 due to special matching device developed for that. This measurement technique was applied to the single-cell cavity from FNAL at power level nearby 10 mW. Measured resonant frequency was about 1.27 GHz",
        "while the measured Q-factor was 2.8·104 at room temperature and more than 108 at liquid helium temperature. To evaluate mechanical properties of sheet Nb and of model materials (Cu and Al)",
        "a number of tests were made. Series of half-cells were fabricated of Al to test the technique of hydraulic deep-drawing that will be used in production of Nb cavities. The modes for electron-beam welding of sheet Nb were explored and the first welding seams were tested. The method of chemical treatment of cavities was also elaborated."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo042.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO042",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO043",
      "title": "IFMIF-EVEDA SRF Linac Couplers Test Bench",
      "authors": [
        "D. Regidor",
        "I. Kirpitchev",
        "J. Molla",
        "P. Méndez",
        "A. Salom",
        "M. Weber",
        "CIEMAT",
        "Madrid",
        "Spain",
        "M. Desmons",
        "N. Grouas",
        "P. Hardy",
        "V.M. Hennion",
        "H. Jenhani",
        "F. Orsini",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "The IFMIF-EVEDA SRF Linac is a cryomodule equipped with eight superconducting HWR cavities",
        "operating at the frequency of 175 MHz and powered by 200kW CW RF couplers. Before assembling the couplers to the cryomodule",
        "it is necessary to process them using high levels of RF power. In order to perform this conditioning",
        "the power couplers must be connected to a RF network which is fed by an RF source and ended with a load or a short-circuit",
        "depending on the conditioning mode to be applied. A test bench has been designed for the conditioning of the SRF LINAC couplers. The main component is the “test box”",
        "a resonant cavity where two couplers will be assembled to transmit the 200 kW from the RF source to the appropriate termination. The test box includes a large pumping port allowing an efficient pumping of the entire vacuum volume limited by the coupler ceramic windows. Several diagnostics as light detectors",
        "vacuum gauges and thermal transducers will provide information on the relevant parameters for the control of the RF conditioning process. In addition",
        "a support frame has been designed to maintain the whole assembly and reduce the mechanical stress on the couplers."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo043.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO044",
      "title": "RF Characterization of Niobium Films for Superconducting Cavities",
      "authors": [
        "S. Aull",
        "S. Calatroni",
        "S. Döbert",
        "T. Junginger",
        "G. Terenziani",
        "CERN",
        "Geneva",
        "Switzerland",
        "University of Siegen",
        "Siegen",
        "Germany",
        "A.P. Ehiasarian",
        "G. Terenziani",
        "Sheffield University",
        "Sheffield",
        "United Kingdom",
        "HZB",
        "Berlin",
        "Germany",
        "The surface resistance RS of superconductors shows a complex dependence on the external parameters such as temperature",
        "frequency or radio-frequency (RF) field. The excited modes of 400",
        "800 and 1200 MHz allow measurements at actual operating frequencies of superconducting cavities. Niobium films on copper substrates have several advantages over bulk niobium cavities. HiPIMS (High-power impulse magnetron sputtering) is a promising technique to increase the quality and therefore the performance of niobium films. This contribution will introduce CERNs recently developed HiPIMS coating apparatus. Moreover",
        "first results of niobium coated copper samples will be presented",
        "revealing the dominant loss mechanisms."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo044.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO045",
      "title": "RF Multipolar Characterization of the Latest LHC Deflecting Cavities",
      "authors": [
        "M. Navarro-Tapia",
        "R. Calaga",
        "A. Grudiev",
        "CERN",
        "Geneva",
        "Switzerland",
        "Deflecting cavity geometries considered for the Large Hadron Collider (LHC)crab scheme lack axial symmetry resulting in non-zero higher-order components of the deflecting field. A formalism to express the higher-order multipoles was developed and applied on previous cavity designs to characterize their influence on the beam stability. In this paper",
        "the radio frequency (RF) multipoles are numerically estimated for the latest cavity geometries and compared to the older versions. A sensitivity study is carried to understand the numerical error levels and define mechanical tolerances."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO046",
      "title": "First Test Results of the 4-rod Crab Cavity",
      "authors": [
        "R. Calaga",
        "L.S. Alberty Vieira",
        "S. Calatroni",
        "O. Capatina",
        "E. Ciapala",
        "L.M.A. Ferreira",
        "E. Jensen",
        "P. Maesen",
        "A. Mongelluzzo",
        "T. Renaglia",
        "M. Therasse",
        "CERN",
        "Geneva",
        "Switzerland",
        "P.K. Ambattu",
        "D. Doherty",
        "B.D.S. Hall",
        "C. Lingwood",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "The first prototype crab cavity with the 4-rod geometry has undergone surface treatment and cold testing. Due to the complex geometry and unique fabrication procedure",
        "RF validation of the field at beyond the nominal operating voltage at a sufficiently high Q0 is an important pre-requiste. Preliminary results of the first cold tests are presented along with cavity performance at different stages of the cavity processing is described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO047",
      "title": "A Double Quarter-Wave Deflecting Cavity for the LHC",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "S.A. Belomestnykh",
        "I. Ben-Zvi",
        "J. Skaritka",
        "Q. Wu",
        "B. P. Xiao",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "An asymmetric quarter wave deflecting cavity at 400 MHz for crab crossing in the LHC was already proposed in 2011. Due to improved cancellation of on-axis longitudinal field and the higher order components of the deflecting field",
        "a symmetric version is now considered as the baseline for the quarter wave geometry. Relevant RF properties of the symmetric cavity are compared to the original asymmetric cavity. Some aspects of input coupler design",
        "higher order modes",
        "multipacting and frequency tuning are also addressed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo047.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO048",
      "title": "Investigation of a Ridge-loaded Waveguide Structure for CLIC X-band Crab Cavity",
      "authors": [
        "V.F. Khan",
        "R. Calaga",
        "A. Grudiev",
        "CERN",
        "Geneva",
        "Switzerland",
        "In conventional crab cavities the TM11 mode is used to deflect the beam. In a linear collider such as CLIC",
        "it is necessary to damp all the other modes",
        "namely the accelerating i.e. lower order mode (LOM)",
        "same order mode (SOM) and higher order modes (HOMs). In addition to this",
        "as the TM11 mode is not the fundamental mode",
        "it is generally not excited with the highest shunt impedance. This necessitates damping of the high shunt impedance modes to acceptable level. Here we report on the investigation of an alternative design of the X-band crab cavity for CLIC based on ridge-loaded waveguide. In this type of cavity",
        "the deflecting mode is the fundamental mode and has the maximum shunt impedance. However",
        "the geometry of the cavity is chosen to optimise the ratio of group velocity to shunt impedance to minimise the effect of beam loading. The other modes are excited above the crabbing mode and are damped using wave-guides. Another advantage of this type of cavity is",
        "unlike the conventional TM11 mode cavities",
        "the e.m. surface fields do not peak at the iris. This provides ample margin to optimise the cavity geometry and reach the desired field distribution."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo048.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO049",
      "title": "A Proposal for an ERL Test Facility at CERN",
      "authors": [
        "R. Calaga",
        "E. Jensen",
        "CERN",
        "Geneva",
        "Switzerland",
        "An energy recovery linac at 300-400 MeV is proposed as a test facility using a two-pass two-cryomodule concept as a proof of principle for a future ERL based electron-ion collider. This facility will enable both the development and validation of the required SRF technology performance and ERL specific beam dynamics essential for the future collider. Furthermore",
        "the test facility can be used as the injector to the main linac in future. The test facility proposal",
        "its potential uses and some aspects of the RF system are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo049.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO050",
      "title": "Mechanical Study of 400 MHz Double Quarter Wave Crab Cavity for LHC Luminosity Upgrade",
      "authors": [
        "B. P. Xiao",
        "S.A. Belomestnykh",
        "I. Ben-Zvi",
        "J. Skaritka",
        "Q. Wu",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "L. Alberty Vieira",
        "R. Calaga",
        "CERN",
        "Geneva",
        "Switzerland",
        "Niowave",
        "Inc.",
        "Lansing",
        "Michigan",
        "USA",
        "A prototype double quarter wave crab cavity was designed for the Large Hadron Collider luminosity upgrade. A finite element model is used to simulate the mechanical properties of the crab cavity. The results are presented and a reinforcement concept is proposed to meet the safety requirements. The reinforcement components",
        "as well as the cavity",
        "are presently being fabricated at Niowave Inc."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo050.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO051",
      "title": "Manufacture of a Compact Prototype 4R Crab Cavity for HL-LHC",
      "authors": [
        "G. Burt",
        "B.D.S. Hall",
        "C. Lingwood",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "L. Alberty Vieira",
        "R. Calaga",
        "O. Capatina",
        "CERN",
        "Geneva",
        "Switzerland",
        "C.H. Boulware",
        "D. Gorelov",
        "T.L. Grimm",
        "C. Krizmanich",
        "T.S. Lamie",
        "Niowave",
        "Inc.",
        "Lansing",
        "Michigan",
        "USA",
        "C. Hill",
        "P.A. McIntosh",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "R.A. Rimmer",
        "H. Wang",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA"
      ],
      "institutions": [
        "Funding: This work has been funded by the EU through EUCARD and HiLumi and by STFC via the Cockcroft Institute."
      ],
      "abstract": "A prototype compact SRF deflecting cavity has been manufactured for LHC. The base of the cavity has been machined out of large grain niobium ingot to allow the manufacture of the complex rod profile. Stiffening rods have been used to increase the mechanical strength of the outer can. Details of the cavity design and manufacture will be discussed.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo051.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO053",
      "title": "SRF Development for a MW Proton Source at Fermi National Accelerator Laboratory",
      "authors": [
        "T.T. Arkan",
        "C.M. Ginsburg",
        "A. Grassellino",
        "S. Kazakov",
        "T.N. Khabiboulline",
        "T.H. Nicol",
        "Y. Orlov",
        "T.J. Peterson",
        "L. Ristori",
        "A. Romanenko",
        "A.M. Rowe",
        "N. Solyak",
        "A.I. Sukhanov",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "USA",
        "Fermilab is planning a megawatt-level proton beam facility utilizing niobium superconducting RF (SRF) cavities. Project X at Fermilab will eventually provide high-intensity beams for research into the nature of matter at the \"intensity frontier\". Research and development in several areas will bring the SRF technology to the level needed for this application. Among developments in SRF being pursued with our national and international collaborators are 162.5 MHz half-wave resonators",
        "325 MHz single-spoke resonators",
        "and two types of elliptical multi-cell 650 MHz cavities. Performance requirements for these cavities and cryomodules in continuous wave (CW) operation are extremely stringent in order to provide high accelerating gradients with acceptable total cryogenic load and overall accelerator capital and operating costs. This paper presents some highlights of the SRF R&D program and proton linac development work at Fermilab."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo053.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO054",
      "title": "Multistep Mechanical Analyses of Centrifugal Barrel Polishing Barrel and Cavity",
      "authors": [
        "M. Chen",
        "C.A. Cooper",
        "L. Ristori",
        "Fermilab",
        "Batavia",
        "USA",
        "Fermilab has successfully demonstrated the ability to improve the performance of damaged 1.3 GHz single cell and 9-cell Tesla–type cavities by using a modified centrifugal barrel polishing (CBP) process that leaves a mirror finish on the inside of the cavity. Fermilab now is developing and constructing a new CBP machine which can handle both 650 MHz and 1.3 GHz cavities. The new machine will have a larger moment arm and therefore impart more force on the cavity and machine. Because of these increased forces the effects on cavity supports and machine design were examined. This paper will document the multistep mechanical analyses for the CBP barrel and cavity",
        "calculations of the fatigue life and the requirements for the structural welds."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo054.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO055",
      "title": "Fabrication and Testing of SSR1 Resonators for PXIE",
      "authors": [
        "L. Ristori",
        "M.H. Awida",
        "P. Berrutti",
        "T.N. Khabiboulline",
        "M. Merio",
        "D. Passarelli",
        "A.M. Rowe",
        "D.A. Sergatskov",
        "A.I. Sukhanov",
        "Fermilab",
        "Batavia",
        "USA",
        "Fermilab is in the process of constructing a proton linac to accelerate a 1 mA CW beam up to 30 MeV. It will be a test for the front end of Project X and known as the Project X Injector Experiment (PXIE). The major goal of PXIE is the validation of the Project X concept and mitigation of technical risks. It is expected to be constructed in the period of 2012-2016. The PXIE linac consists of a Ion source and LEBT",
        "a 162.5 MHz RFQ",
        "a MEBT",
        "a 162.5 MHz HWR cryomodule (designed and built at ANL) and a 325 MHZ SSR1 cryomodule (designed and built at FNAL). In this paper we present the recent advances in the development of the SSR1 resonators at Fermilab. Several bare SSR1 resonators have been processed",
        "heat-treated and tested successfully in the Fermilab Vertical Test Stand. The outfitting of helium vessels is in process and the coarse-fine frequency tuning system has been designed and is currently being procured and tested. Details of the power coupler are also discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo055.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO056",
      "title": "Update of the Mechanical Design of the 650 MHZ β=0.9 Cavities for Project X",
      "authors": [
        "I.V. Gonin",
        "M.H. Awida",
        "M.H. Foley",
        "C.J. Grimm",
        "T.N. Khabiboulline",
        "Y.M. Pischalnikov",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "USA",
        "Five-cell elliptical 650 MHz β=0.9 cavities to accelerate 1 mA of average H− beam current in the range 520-3000 MeV of the Project X Linac are currently planned. We will present the results of optimization of mechanical design of cavities with their Helium Vessel. We discuss the efforts to optimize the mechanical stability of the cavity versus the Helium bath pressure fluctuations",
        "cavity tunability. We present also modal and thermal analysis; discuss tuner options and other issues."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo056.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO057",
      "title": "Update of SSR2 Cavities Design for Project X and RISP",
      "authors": [
        "M. Merio",
        "M.H. Awida",
        "P. Berrutti",
        "I.V. Gonin",
        "T.N. Khabiboulline",
        "D. Passarelli",
        "Y.M. Pischalnikov",
        "L. Ristori",
        "N. Solyak",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "USA",
        "Single spoke resonators SSR2 (f=325 MHz) are under development at Fermilab. These cavities can meet requirements of Project X (FNAL) and RISP (Korea). The initial design of SSR2 cavities has been modified and optimized in order to satisfy the necessities of both projects. This paper will discuss the RF optimization for a single spoke resonator with a 50 mm beam pipe aperture and an optimal beta of 0.51. Further",
        "the approach to the mechanical design of the cavity will be presented together with the proposed helium vessel. The latter is intended to guarantee a low He pressure sensitivity df/dp of the entire jacketed SSR2 and actively control the microphonics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo057.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO058",
      "title": "Recent Progress at Fermilab Controlling Lorentz Force Detuning and Microphonics in Superconducting Cavities",
      "authors": [
        "W. Schappert",
        "Y.M. Pischalnikov",
        "Fermilab",
        "Batavia",
        "USA"
      ],
      "institutions": [],
      "abstract": "SRF cavities are susceptible to detuning by mechanical deformations induced by the Lorentz force and microphonics. Providing the RF overhead required to maintain the accelerating gradient in detuned cavities can increase both the capital and operating costs of superconducting accelerators. Recent work at Fermilab has shown that active vibration control using a piezo actuator can reduce both Lorentz Force detuning and microphonics to the point where negligible RF overhead is required to maintain the accelerating gradient.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo058.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO059",
      "title": "Cornell's HOM Beamline Absorbers",
      "authors": [
        "R. Eichhorn",
        "J.V. Conway",
        "Y. He",
        "G.H. Hoffstaetter",
        "M. Liepe",
        "T.I. O'Connell",
        "P. Quigley",
        "J. Sears",
        "V.D. Shemelin",
        "N.R.A. Valles",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "The proposed energy recovery linac at Cornell aims for high beam currents and short bunch lengths",
        "the combination of which requires efficient damping of the higher order modes (HOMs) being present in the superconducting cavities. Numerical simulations show that the expected HOM power could be as high as 200 W per cavity with frequencies ranging to 40 GHz. Consequently",
        "a beam line absorber approach was chosen. We will review the design",
        "report on first results from a prototype and discuss further improvements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo059.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO060",
      "title": "The CW Linac Cryo-module for Cornell’s ERL",
      "authors": [
        "R. Eichhorn",
        "Y. He",
        "G.H. Hoffstaetter",
        "M. Liepe",
        "T.I. O'Connell",
        "P. Quigley",
        "D.M. Sabol",
        "J. Sears",
        "E.N. Smith",
        "V. Veshcherevich",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "Cornell University has proposed an energy-recovery linac (ERL) based synchrotron-light facility which can provide greatly improved X-ray beams due to the high electron-beam quality that is available from a linac. As part of the phase 1 R&D program",
        "critical challenges in the design were addressed",
        "one of them being a full linac cryo-module. It houses 6 superconducting cavities- operated at 1.8 K in cw mode- HOM absorbers and a magnet/ BPM section. We will present the design being finalized recently and report on the fabrication status that started in late 2012."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo060.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO061",
      "title": "Readiness for the Cornell ERL",
      "authors": [
        "G.H. Hoffstaetter",
        "A.C. Bartnik",
        "I.V. Bazarov",
        "D.H. Bilderback",
        "M.G. Billing",
        "J.D. Brock",
        "J.A. Crittenden",
        "L. Cultrera",
        "D.S. Dale",
        "J. Dobbins",
        "B.M. Dunham",
        "R.D. Ehrlich",
        "M. P. Ehrlichman",
        "R. Eichhorn",
        "K. Finkelstein",
        "E. Fontes",
        "M.J. Forster",
        "S.J. Full",
        "F. Furuta",
        "D. Gonnella",
        "S.W. Gray",
        "S.M. Gruner",
        "C.M. Gulliford",
        "D.L. Hartill",
        "Y. He",
        "R.G. Helmke",
        "K.M.V. Ho",
        "R.P.K. Kaplan",
        "S.S. Karkare",
        "V.O. Kostroun",
        "H. Lee",
        "Y. Li",
        "M. Liepe",
        "X. Liu",
        "J.M. Maxson",
        "C.E. Mayes",
        "A.A. Mikhailichenko",
        "H. Padamsee",
        "J.R. Patterson",
        "S.B. Peck",
        "S. Posen",
        "P. Quigley",
        "P. Revesz",
        "D.H. Rice",
        "D. Sagan",
        "J. Sears",
        "V.D. Shemelin",
        "D.M. Smilgies",
        "E.N. Smith",
        "K.W. Smolenski",
        "A.B. Temnykh",
        "M. Tigner",
        "N.R.A. Valles",
        "V. Veshcherevich",
        "A.R. Woll",
        "Y. Xie",
        "Z. Zhao",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "Energy-Recovery Linacs (ERLs) are proposed as drivers for hard x-ray sources because of their ability to produce electron bunches with small",
        "flexible cross sections and short lengths at high repetition rates. Cornell University has pioneered the design and hardware for ERL lightsources. This preparatory research for ERL-lightsource construction will be discussed. Important milestones have been achieved in Cornell's prototype ERL injector",
        "including the production of a prototype SRF cavity that exceeds design specifications",
        "the regular production of long-lived and low emittance cathodes",
        "the acceleration of ultra-low emittance bunches",
        "and the world-record of 65 mA current from a photoemission DC gun. We believe that demonstration of the practical feasibility of these technologies have progressed sufficiently to allow the construction of an ERL-based lightsource like that described in [erl.chess.cornell.edu/PDDR]."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo061.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO065",
      "title": "Optimization of Elliptical SRF Cavities for β <1",
      "authors": [
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "Rochester University",
        "Rochester",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "A systematic approach to optimization of SRF cavities which was done earlier for β=1 is extended to β<1 Some improvements for earlier developed designs are proposed.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo065.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO066",
      "title": "Frequency Control in the Cornell-ERL Main-Linac Cavity Production",
      "authors": [
        "V.D. Shemelin",
        "B. Bullock",
        "P.R. Carriere",
        "B. Clasby",
        "R. Eichhorn",
        "B. Elmore",
        "J.J. Kaufman",
        "J. Sears",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "Cavity fabrication can be broken down into three main stages: deep-drawing cups",
        "welding the cups in pairs to obtain “dumbbells” and end groups",
        "and",
        "finally",
        "welding the obtained components into a completed cavity. Frequency measurements and precise machining were implemented after the second stage. A custom RF fixture and data acquisition system were used for this purpose. The system comprised of a mechanical press with RF contacts",
        "a network analyzer",
        "a load cell and custom LabVIEW and MATLAB scripts. To extract the individual frequencies of the cups from these measurements",
        "algorithm of calculations was developed. Corrections for the ambient environment were also incorporated into the measurement protocol. Two 7-cell 1.3 GHz cavities were produced with high field flatness immediately after fabrication."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo066.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO067",
      "title": "Conditions for the Existence of 1- and 2-point Multipactor in SRF Cavities",
      "authors": [
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "One- and two-point multipactor (MP) in RF cavities are well-known phenomena. However",
        "conditions when this or the other type of discharge develops were not clearly defined up to now. Here",
        "an explicit description of these two types of the MP is presented",
        "geometrical parameters",
        "or figures of merit",
        "responsible for initiation of the MP defined",
        "and areas of their existence delineated. Small sizes of trajectories in the MP require a very precise calculation of fields for simulations. On the other hand",
        "due to these small sizes",
        "fields can be presented as the Taylor expansions and trajectories can be found solving ordinary differential equations of motion. Conditions of motion stability and influence of the Miller force are also accounted."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo067.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO068",
      "title": "Cornell ERL Main Linac 7-cell Cavity Performance in Horizontal Test Cryomodule Qualifications",
      "authors": [
        "N.R.A. Valles",
        "R. Eichhorn",
        "F. Furuta",
        "G.M. Ge",
        "D. Gonnella",
        "Y. He",
        "K.M.V. Ho",
        "G.H. Hoffstaetter",
        "M. Liepe",
        "T.I. O'Connell",
        "S. Posen",
        "P. Quigley",
        "J. Sears",
        "V. Veshcherevich",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "Cornell has recently ﬁnished producing and testing the ﬁrst prototype 7-cell main linac cavity for the Cornell Energy Recovery Linac",
        "and completed the prototype cavity qualification program. This paper presents quality factor results from the horizontal test cryomodule (HTC) measurements",
        "from the HTC-1 through HTC-3 experiments",
        "reaching Q's up to 6 x 1010 at 1.6 K. We investigate the effect of thermal cycling on cavity quality factor and show that high quality factors can be preserved from initial mounting to fully outfitting the cavity with side-mounted input coupler and beam line absorbers. We also discuss the production of six additional main-linac cavities as we progress toward constructing a full 6-cavity cryomodule."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo068.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO069",
      "title": "HOM Studies of the Cornell ERL Main Linac Cavity: HTC-1 Through HTC-3",
      "authors": [
        "N.R.A. Valles",
        "R. Eichhorn",
        "G.H. Hoffstaetter",
        "M. Liepe",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "The Cornell energy recovery linac is designed to run a high energy (5 GeV)",
        "high current (100 mA)",
        "very low emittance beam (30 pm at 77 pC bunch charge). A major challenge to running such a large current continuously through the machine is the effect of strong higher-order modes(HOMs) that can lead to beam breakup. This paper presents the results of HOM studies for the prototype 7-cell cavity installed in a horizontal test cryomodule (HTC) from initial RF test",
        "to being fully outfitted with side-mounted input coupler and beam line absorbers. We compare the simulated results of the optimized cavity geometry with measurements from all three HTC experiments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo069.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO069",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO071",
      "title": "Quench and High Field Q-SLOP Studies using a Single Cell Cavity with Artificial Pits",
      "authors": [
        "Y. Xie",
        "G.H. Hoffstaetter",
        "M. Liepe",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "Surface defects such as pits have been identified as some of the main sources of limitations of srf cavity performance. A single cell cavity was made with 30 artificial pits in the high magnetic field region to gain new insight in how pits limit the cavity performance. The test of the pit cavity showed clear evidence that the edges of two of the largest radius pits transitioned into the normal conducting state at field just below the quench field of the cavity",
        "and that the quench was indeed induced by these two pits. Insights about quench and non-linear rf resistances will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo071_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo071.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo071_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO071",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO072",
      "title": "HOM Damping Coupler Design for the 400-MHz RF Dipole Compact Crab Cavity for the LHC HiLumi Upgrade",
      "authors": [
        "Z. Li",
        "L. Ge",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "S.U. De Silva",
        "J.R. Delayen",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "Crab cavities are adapted as the baseline design for the LHC HiLumi upgrade to achieve head-on beam-beam collisions for further improvement in luminosity. A 400-MHz compact RF dipole crab cavity design was developed by a joint effort between Old Dominion University and SLAC under the support of US LARP program. This design has shown very favorable RF parameters and can fit into the available beamline spacing for either vertical and horizontal crabbing schemes. A niobium prototype cavity based on such a design has been manufactured for vertical test. In addition",
        "there are stringent wakefield requirements that needed to be met for such a cavity in order to preserve the quality of the circulating beams. In this paper",
        "we will discuss different damping schemes for such a compact design and present the HOM coupler designs to meet the damping requirements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo072_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo072.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo072_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO072",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO073",
      "title": "RF Design Optimization for New Injector Cryounit at CEBAF",
      "authors": [
        "H. Wang",
        "G. Cheng",
        "F.E. Hannon",
        "A.S. Hofler",
        "R. Kazimi",
        "J.P. Preble",
        "R.A. Rimmer",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "A new injector superconducting RF (SRF) cryounit with one new 2-cell",
        "β=0.6 cavity plus one refurbished 7-cell",
        "β=0.97",
        "C100 style cavity has been re-designed and optimized for the engineering compatibility of existing module for CEBAF operation. The optimization of 2-cell cavity shape for longitudinal beam dynamic of acceleration from 200keV to 533keV and the minimization of transverse kick due to the waveguide couplers to less than 1 mrad have been considered. Operating at 1497MHz",
        "two cavities has been designed into a same footprint of CEBAF original quarter cryomodule to deliver an injection beam energy of 5MeV in less than 0.27o rms bench length and a maximum energy spread of 5keV."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo073.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO073",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO076",
      "title": "Development of Ultra High Gradient and High Q0 Superconducting Radio Frequency Cavities",
      "authors": [
        "R.L. Geng",
        "W.A. Clemens",
        "J. Follkie",
        "T. Harris",
        "D. Machie",
        "R. Martin",
        "A.D. Palczewski",
        "E. Perry",
        "G. Slack",
        "R.S. Williams",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "C. Adolphsen",
        "Z. Li",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "J.K. Hao",
        "Y.M. Li",
        "K.X. Liu",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "We report on the recent progress at Jefferson Lab in developing ultra high gradient and high Q0 superconducting radio frequency (SRF) cavities for future SRF based machines. A new 1300 MHz 9-cell prototype cavity is being fabricated. This cavity has an optimized shape in terms of the ratio of the peak surface field (both magnetic and electric) to the acceleration gradient",
        "hence the name low surface field (LSF) shape. The goal of the effort is to demonstrate an acceleration gradient of 50 MV/m with Q0 of 1010 at 2 K in a 9-cell SRF cavity. Fine-grain niobium material is used. Conventional forming",
        "machining and electron beam welding method are used for cavity fabrication. New techniques are adopted to ensure repeatable",
        "accurate and inexpensive fabrication of components and the full assembly. The completed cavity is to be first mechanically polished to a mirror-finish",
        "a newly acquired in-house capability at JLab",
        "followed by the proven ILC-style processing recipe established already at JLab. In parallel",
        "new single-cell cavities made from large-grain niobium material are made to further advance the cavity treatment and processing procedures",
        "aiming for the demonstration of an acceleration gradient of 50 MV/m with Q0 of 2·1010 at 2K.",
        "The U.S. Government retains a non-exclusive",
        "paid-up",
        "irrevocable",
        "world-wide license to publish or reproduce this manuscript for U.S. Government purposes."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo076.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO076",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO077",
      "title": "Rf System Requirements for JLab’s MEIC Collider Ring",
      "authors": [
        "S. Wang",
        "R. Li",
        "R.A. Rimmer",
        "H. Wang",
        "Y. Zhang",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "The Medium-energy Electron Ion Collider (MEIC)",
        "proposed by Jefferson Lab",
        "consists of a series of accelerators [1]. At the top energy are the electron and ion collider rings. For the ion ring",
        "it accelerates five long ion bunches to colliding energy and rebunches ions into a train of very short bunches before colliding. A set of low frequency RF system is needed for the long ion bunch energy ramping. Another set of high frequency RF cavities is needed to rebunch ions. For the electron ring",
        "superconducting RF (SRF) cavities are needed to compensate the synchrotron radiation energy loss. The impedance of the SRF cavities must be low enough to keep the high current electron beam stable. The preliminary design requirements of these RF cavities are presented.",
        "The U.S. Government retains a non-exclusive",
        "paid-up",
        "irrevocable",
        "world-wide license to publish or reproduce this manuscript for U.S. Government purposes."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo077.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO077",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO079",
      "title": "Superconducting Single-spoke Cavities for High-velocity Applications",
      "authors": [
        "C.S. Hopper",
        "J.R. Delayen",
        "R.G. Olave",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "Spoke cavities have been investigated for particle acceleration in the high-velocity regime. As part of these efforts",
        "single-spoke cavities for particles traveling at the speed of light are being designed and built for proof-of-principle demonstration. We report here on the results of electromagnetic properties",
        "design optimization",
        "multipacting analysis",
        "field non-linearities and higher order mode spectrum for a single-spoke cavity operating at 325 MHz."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo079_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo079.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo079_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO079",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO080",
      "title": "Compact Superconducting RF-dipole Cavity Designs for Deflecting and Crabbing Applications",
      "authors": [
        "S.U. De Silva",
        "A. Castilla",
        "J.R. Delayen",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "DCI-UG",
        "León",
        "Mexico",
        "Over the years the superconducting parallel-bar design has evolved into an rf-dipole cavity with improved properties. The new rf-dipole design is considered for number of deflecting and crabbing applications. Some of those applications are the 499 MHz rf separator system for the Jefferson Lab 12 GeV upgrade",
        "400 MHz crabbing cavity system for the proposed LHC high luminosity upgrade",
        "and 750 MHz crabbing cavity for the medium energy electron-ion collider in Jefferson Lab. In this paper we present the optimized rf design in terms of rf performance including rf properties",
        "higher order mode properties",
        "multipacting",
        "multipole expansion for the above mentioned applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo080.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO080",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO082",
      "title": "Ferroelectric Based High Power Tuner for L-band Accelerator Applications",
      "authors": [
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "S. Kazakov",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "USA",
        "LETI",
        "Saint-Petersburg",
        "Russia",
        "Ceramics Ltd.",
        "St. Petersburg",
        "Russia",
        "With this paper",
        "we present our recent breakthrough with a new fast ferroelectric tuner development. The tuner is based on BST(M) ferroelectric elements (ε~150)",
        "which are designed to be used as the basis for L-band accelerator components intended for ERL",
        "ILC",
        "Project X and other applications. These new ferroelectric elements are to be fabricated for the new fast active tuner for SC cavities that can operate in air at low biasing DC fields. Note there were no reliable results on the long-term piezo actuators operations in CW regime. Specific features of ERL",
        "ILC and Project X accelerator technology and challenges of the designs are high magnitude and phase stability of its operations. Mechanical vibrations",
        "or microphonics affect the SRF resonator",
        "while the ferroelectric tuners have shown extremely high tuning speed. We have demonstrated successful mitigation of the residual effects on the ferroelectric-metal interface along with the acceptable level of the overall loss factor of the tuner element. A new concepts of a tuning element based on low dielectric constant ferroelectrics along with fabrication technology of these new BST(M) ferroelectric elements will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo082_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo082.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo082_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO082",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO084",
      "title": "Improvement of the Q-factor Measurement in RF Cavities",
      "authors": [
        "W. Xu",
        "S.A. Belomestnykh",
        "I. Ben-Zvi",
        "H. Hahn",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "S.A. Belomestnykh",
        "I. Ben-Zvi",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "The Q values of Higher-order-modes (HOMs) in RF cavities are measured at room temperature with the 3 dB bandwidth reading by a network analyzer. The resonant curve distortion is created by the resonance splitting due to the ellipticity caused by manufacture tolerance and RF ports. Therefore",
        "the measured Q values are usually lower than the simulated or theoretical Q values. In some cases",
        "even only one mode’s Q can be measured with the 3 dB method. There may be two reasons for this happening. One is that only one mode was excited and the neighbor splitmode was close to 90° polarized; the other reason is that the resonant curve of one mode was distorted by the other mode too much to measure the 3dB range. In this paper",
        "we resolve this issue by looking into the RF measurement setup",
        "including cavity",
        "input coupler and pick-up coupler",
        "from the equivalent circuit and wave point of view. Based on the BNL3 copper prototype cavity",
        "we compared these results from measurement and simulation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo084_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo084.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo084_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO084",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO085",
      "title": "Commissioning SRF Gun for the R&D ERL at BNL",
      "authors": [
        "W. Xu",
        "Z. Altinbas",
        "S.A. Belomestnykh",
        "I. Ben-Zvi",
        "S. Deonarine",
        "D.M. Gassner",
        "H. Hahn",
        "J.P. Jamilkowski",
        "P. Kankiya",
        "D. Kayran",
        "N. Laloudakis",
        "L. Masi",
        "G.T. McIntyre",
        "D. Pate",
        "D. Phillips",
        "T. Seda",
        "K.S. Smith",
        "A.N. Steszyn",
        "T.N. Tallerico",
        "R. Than",
        "R.J. Todd",
        "D. Weiss",
        "A. Zaltsman",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "S.A. Belomestnykh",
        "I. Ben-Zvi",
        "J. Dai",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "The R&D ERL project at BNL aims to demonstrate a high charge",
        "high current energy recovery linac. One of the key SRF system is the 704 MHz half-cell SRF gun. The SRF gun is designed to deliver up to 0.5 A beam at 2 MeV with 1 MW of CW RF power. The gun commissioning started in November 2012. The first photoemission beam from the SRF gun is expected in early 2013. This presentation will discuss the results of the SRF gun commissioning",
        "and the performance of the high-power RF system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo085_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo085.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo085_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO085",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO086",
      "title": "Split Higher Order Modes in Superconducting Cavities",
      "authors": [
        "H. Hahn",
        "S.A. Belomestnykh",
        "W. Xu",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA"
      ],
      "institutions": [
        "Funding: This work was supported by Brookhaven Science Associates, LLC under Contract No. DE-AC02-98CH10886 with the U.S. DOE and award no. DE-SC0002496 to Stony Brook University with the US DOE."
      ],
      "abstract": "Split resonances are a common appearance in superconducting cavities and were studied here on the specific example of the TE11 dipole resonance in five-cell copper models of the ERL and BNL3. The BNL3 cavity was designed to be suitable for the envisioned electron-hadron collider eRHIC. Achieving the required high-current performance depends on avoiding beam break-up instabilities by minimizing the Higher Order Modes (HOM) Q-values. This was attempted in the design phase and will be done with appropriate mode dampers in operation. The availability of a copper model provided a convenient opportunity to confirm the design and to study potentially nefarious high-Q resonances. The appearance of split resonances impeded the HOM identification and the theoretical interpretation as elipticity deformation is presented in this report.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo086_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo086.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo086_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO086",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWO087",
      "title": "Parameter Optimization for Laser Polishing of Niobium for SRF Applications",
      "authors": [
        "L. Zhao",
        "M.J. Kelley",
        "The College of William and Mary",
        "Williamsburg",
        "USA",
        "M.J. Kelley",
        "J.M. Klopf",
        "C.E. Reece",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "Surface smoothness is critical to the performance of SRF cavities. As laser technology has been widely applied to metal machining and surface treatment",
        "we are encouraged to use it on niobium as an alternative to the traditional wet polishing process where aggressive chemicals are involved. In this study",
        "we describe progress toward smoothing by optimizing laser parameters on BCP treated niobium surfaces. Results show that microsmoothing of the surface without ablation is achievable."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepwo087_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepwo087.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepwo087_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPWO087",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 64,
  "scrape_time": "2025-10-10 21:30:06"
}