{
  "session_info": {
    "id": "TUYO",
    "name": "TUYO - Plasma Physics & Techniques",
    "url": "https://proceedings.jacow.org/ECRIS2012/html/tuyo.htm"
  },
  "papers": [
    {
      "paper_id": "TUYO01",
      "title": "Experimental Study of Temperature and Density Evolution During Breakdown in a 2.45 GHz ECR Plasma",
      "authors": [
        "O.D. Cortázar",
        "A. Megía-Macías",
        "A. Vizcaíno-de-Julián",
        "ESS Bilbao",
        "LEIOA",
        "Spain",
        "An experimental study of temperature and density evolution during breakdown in off-resonance ECR hydrogen plasma by time resolved Langmuir probe diagnostic is presented. Under square 2.45 GHz microwave excitation pulses with a frequency of 50 Hz and relative high microwave power",
        "unexpected transient temperature peaks that reach 18 eV during 20 μs are reported at very beginning of plasma breakdown. Decays of such peaks reach final stable temperatures of 5 eV at flat top microwave excitation pulse. Evidence of interplay between incoming power and duty cycle giving different kind of plasma parameters evolutions engaged to microwave coupling times is observed. Under relative high power conditions where short microwave coupling times are recorded",
        "high temperature peaks are measured. However",
        "for lower incoming powers and longer coupling times",
        "temperature evolves gradually to a higher final temperature without peaking. On the other hand",
        "the early instant where temperature peaks are observed also suggest a possible connection with preglow and superadiabatic processes during breakdown in ECR plasmas."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuyo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuyo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuyo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUYO01",
      "page_number": "13",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYO02",
      "title": "Control of the Plasma Transversal Losses, Caused by MHD Instabilities, in Open Mirror Magnetic Trap of the ECRIS: Recent Experiments on SMIS 37 Setup",
      "authors": [
        "V. Sidorov",
        "I. Izotov",
        "S. Razin",
        "V. Skalyga",
        "V. Zorin",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "This work is a continuation of the experiments described in [1",
        "2] and aimed at the investigation of the new conceptions of MHD stabilization of plasma in open axisymmetric traps",
        "specifically",
        "it is aimed at the investigation of the shear flow influence on the transport control in open mirror traps. As in previous experiments",
        "shear flow was created by limiter-electrode with bias potential according to the vacuum chamber. Plasma density structure in radial and azimuthal directions was studied. Mode structure of the perturbations was investigated. Substantial sharp shift of the plasma density maximum to the system axis with bias potential growth was demonstrated. It was shown",
        "that the value of the bias potential that corresponds to the plasma density profile shift grows with the magnetic field growth that can be interpreted as the electron temperature growth. Some theoretical estimations of the influence of the transversal losses decrease on plasma parameters were made.",
        "[1] A.Sidorov",
        "P.Bagryansky",
        "A.Beklemishev et al. Trans. Fusion Sci. and Technology",
        "59",
        "112",
        "(2011).  [2] I.Izotov",
        "S.Razin",
        "A.Sidorov et al. Rev. Sci. Instrum.",
        "83",
        "02A318 (2012)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuyo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuyo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuyo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUYO02",
      "page_number": "18",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYO03",
      "title": "Secondary-electron-enhanced Plasma as an Alternative to Double/Variable-frequency Heating in ECRIS",
      "authors": [
        "IKF",
        "Frankfurt-am-Main",
        "Germany",
        "S. Dobrescu",
        "L. Schächter",
        "IFIN",
        "Magurele- Bucuresti",
        "Romania",
        "As \"double frequency heating\" (DFH) now has become the method of choice to optimize the output from the newest generation ECRIS",
        "it was a challenge to compare this method with the comparatively cheap method of \"metal dielectric\" (MD) structures introduced into the plasma chamber",
        "which has also proven to strongly enrich the plasma with electrons that are effectively trapped and heated. Two RF-systems have been launched to the 14 GHz ECRIS",
        "however",
        "not allowing RF-differences as large as 1.5 GHz as demanded for DFH. Therefore the source was operated in a \"frequency tuning\" mode (FT) by optimizing the frequency difference by the output of Ar14+ ions. The data without and with MD-configuration are compared and related to data for the DFH. On the basis of Bremsstrahlung radiation spectroscopy and charge state analysis",
        "it turned out that the FT-mode does not change the source performance substantially. The measured effects are in the order of 20% to 30% as reported elsewhere. In contrast to this",
        "the enhancement gained by the MD method is much higher. The measured enhancement ratios even surpass those reported for real double frequency heating."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuyo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuyo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuyo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUYO03",
      "page_number": "22",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYO04",
      "title": "Neutral Gas Temperature Measurements of a Radio Frequency Micro-thruster",
      "authors": [
        "A.D. Greig",
        "R.W. Boswell",
        "C. Charles",
        "R.P. Hawkins",
        "SP3",
        "Canberra",
        "Australia",
        "M.D. Bowden",
        "Y.C. Sutton",
        "The Open University",
        "Milton Keynes",
        "United Kingdom",
        "A radio frequency (13.56 MHz) capacitively coupled cylindrical argon plasma discharge was analysed using optical emission spectroscopy (OES) for various powers and pressures in the ranges 10 W to 40 W and 0.5 Torr to 5 Torr. Trace amounts of nitrogen were added to the discharge to estimate the temperature of the neutrals using rovibrational band matching of the 2nd positive system of nitrogen and the 1st negative system of nitrogen ions. Comparing simulated computer generated spectra of these bands to experimentally measured spectra determined the rotational and vibrational temperatures of the nitrogen",
        "from which the temperature of the neutrals was inferred by assuming the rotational temperature was the same as the neutral gas temperature."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuyo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuyo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuyo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUYO04",
      "page_number": "25",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:29:03"
}