{
  "session_info": {
    "id": "FRYBB",
    "name": "FRYBB - Invited Oral Presentations, Accelerator Technology",
    "url": "https://proceedings.jacow.org/PAC2013/html/frybb.htm"
  },
  "papers": [
    {
      "paper_id": "FRYBB1",
      "title": "Advances in Superconducting Undulators",
      "authors": [
        "ANL",
        "Argonne",
        "USA",
        "Superconducting technology could be employed for building undulators with enhanced parameters for synchrotron light sources and free–electron lasers. Expected and measured performance of superconducting undulators will be presented. Although superconducting technology is already working in superconducting wigglers",
        "the development of superconducting undulators was slowed down by a variety of challenges that will be discussed. Possible solutions with examples will be presented. Finally",
        "an overview of recent developments in superconducting undulators will be given."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/frybb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/frybb1.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/frybb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-FRYBB1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRYBB2",
      "title": "Development and Operation of the SNS Fast Chopper Systems",
      "authors": [
        "ORNL RAD",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "D.E. Anderson",
        "C. Deibele",
        "V.V. Peplov",
        "M.P. Stockli",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "The Spallation Neutron Source (SNS) at Oak Ridge National Laboratory requires fast chopper systems to create a series of mini-pulses in the Linear Accelerator (LINAC) for injection into the accumulation ring. The fast chopper systems are in the front end of the accelerator with one set of four choppers in the Low Energy Beam Transport (LEBT)",
        "immediately upstream of the Radio Frequency Quadrupole (RFQ)",
        "and another set of two choppers in the Medium Energy Beam Transport (MEBT)",
        "downstream of the RFQ",
        "where the beam energy is approximately 2.5 MeV. Clean bunching requires fast rise and fall time and low jitter to minimize the amount of charge in the ring extraction gap. The chopper systems operate at a burst frequency of 1 MHz and a burst width of greater than 1 ms. The choppers have had historically poor reliability especially in the LEBT system. This paper describes the development of reliable LEBT and MEBT choppers and the operational performance since SNS commissioning in 2006."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/frybb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/frybb2.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/frybb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-FRYBB2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 01:59:03"
}