{
  "session_info": {
    "id": "WEIOB",
    "name": "WEIOB - Basic R&D New materials - Multilayers, MgB2 - I",
    "url": "https://proceedings.jacow.org/SRF2013/html/weiob.htm"
  },
  "papers": [
    {
      "paper_id": "WEIOB01",
      "title": "Status of MgB2 Coating Studies for SRF Applications",
      "authors": [
        "T. Tajima",
        "L. Civale",
        "D.J. Devlin",
        "G.C. Martinez",
        "R.K. Schulze",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA"
      ],
      "institutions": [],
      "abstract": "MgB2 has shown promising results on small samples and its coating development is entering into the stage to coat large samples and elliptical cavities. Several coating techniques that seem to be appropriate for cavity coating and their status will be shown together with some cavity measurement results with either 6 GHz or 1.3 GHz single-cell cavities. Other data such as RF surface resistance at low temperatures and vortex penetration fields with small samples will also be shown.",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/weiob01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/weiob01.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/weiob01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-WEIOB01",
      "page_number": "777",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEIOB02",
      "title": "Proof of Concept Thin Films and Multilayers Toward Enhanced Field Gradients in SRF Cavities",
      "authors": [
        "R.A. Lukaszew",
        "D. Beringer",
        "W.M. Roach",
        "The College of William and Mary",
        "Williamsburg",
        "USA",
        "G.V. Eremeev",
        "A-M. Valente-Feliciano",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "TU",
        "Philadelphia",
        "USA",
        "Due to the very shallow penetration depth of the RF fields",
        "SRF properties are inherently a surface phenomenon involving a material thickness of less than 1 micron thus opening up the possibility of using thin film coatings to achieve a desired performance. The challenge has been to understand the dependence of the SRF properties on the detailed characteristics of real surfaces and then to employ appropriate techniques to tailor these surface properties for greatest benefit. Our aim is to achieve gradients >100 MV/m and no simple material is known to be capable of sustaining this performance. A theoretical framework has been proposed which could yield such behavior [1] and it requires creation of thin film layered structures. I will present our systematic studies on such proof-of-principle samples. Our overarching goal has been to build a basic understanding of key nano-scale film growth parameters for materials that show promise for SRF cavity multilayer coatings and to demonstrate the ability to elevate the barrier for vortex entry in such layered structures above the bulk value of Hc1 for type-II superconductors and thus to sustain higher accelerating fields.",
        "[1]. A. Gurevich",
        "Appl. Phys. Lett. 88",
        "012511 (2006)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/weiob02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/weiob02.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/weiob02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-WEIOB02",
      "page_number": "782",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 04:15:28"
}