{
  "session_info": {
    "id": "WEBO",
    "name": "WEBO - Applications",
    "url": "https://proceedings.jacow.org/ecris2016/html/webo.htm"
  },
  "papers": [
    {
      "paper_id": "WEBO01",
      "title": "An ECRIS Facility for Investigating Nuclear Reactions in Astrophysical Plasmas",
      "authors": [
        "M. Kreller",
        "C. Baumgart",
        "G. Zschornack",
        "DREEBIT",
        "Dresden",
        "Germany",
        "K. Czerski",
        "M. Kaczmarski",
        "N. Targosz-Ślęczka",
        "University of Szczecin",
        "Institute of Physics",
        "Szczecin",
        "Poland",
        "A. Huke",
        "G. Ruprecht",
        "D. Weißbach",
        "IFK Berlin",
        "Berlin",
        "Germany",
        "Technische Universität Dresden",
        "Institut für Angewandte Physik",
        "Dresden",
        "Germany",
        "Nuclear reactions at low energies can be strongly enhanced due to screening of the Coulomb barrier by the surrounding electrons. This effect was studied for the deuteron fusion reactions taking place in metallic environments as a model for dense astrophysical plasmas. Experimentally determined screening energies corresponding to the reduction of the Coulomb barrier height are much larger than the theoretical predictions. One possible explanation is the excitation of a hypothetical threshold resonance in the 4He nucleus. As the energy dependence of the resonant reaction cross section differs to that of the electron screening effect",
        "one can distinguish between both processes expanding measurements down to the deuteron energies of 1keV. A novel ion accelerator was implemented at the University of Szczecin. Ions are produced by a Dresden ECRIS-2.45M as a high-current",
        "low-Z ion source. The following beam line is designed to work on HV potential for decelerating ions below a kinetic energy of 1keV and combined with a ultra-high vacuum target chamber to reduce target impurities. The ion irradiation facility as well as first experimental results are described and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/webo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/webo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/webo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEBO01",
      "page_number": "59",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBO02",
      "title": "Design of Compact ECR Ion Source for C5+ Production",
      "authors": [
        "M. Muramatsu",
        "Y. Iwata",
        "A. Kitagawa",
        "E. Noda",
        "M. Sekiguchi",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "K. Fukushima",
        "T. Sasano",
        "T. Suzuki",
        "K. Takahashi",
        "AEC",
        "Chiba",
        "Japan",
        "H. Murata",
        "T. Takahashi",
        "SHI",
        "Kanagawa",
        "Japan",
        "The Heavy Ion Medical Accelerator in Chiba (HIMAC) was constructed as the first medical dedicated heavy ion accelerator facility at National Institute of Radiological Sciences (NIRS). Over 9000 cancer patients have been treated with 140-430 MeV/u carbon beams since 1994. Compact ECR ion source with all permanent magnets",
        "named Kei2",
        "was developed for production of C4+ ions for medical treatment at NIRS. A compact ECR ion source for Gunma University (Gunma University Heavy Ion Medical Center: GHMC)",
        "Saga carbon-ion radiotherapy (Saga Heavy Ion Medical Accelerator in Tosu: SAGA HIMAT) and Kanagawa carbon-ion radiotherapy (Ion-beam Radiation Oncology Center in Kanagawa: i-ROCK) facility has been operated for medical use. It is a copy of the Kei2 which was developed by NIRS. In order to reduce operation cost of the injector for next designed carbon ion facility",
        "we start design of new compact ECR ion source for C5+ production. Some dependence (mirror field",
        "microwave power and frequency) were checked for optimal parameter of C5+ production at 18 GHz NIRS-HEC source. Results of experiments and specification of new compact source are described in this presentation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/webo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/webo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/webo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEBO02",
      "page_number": "64",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBO03",
      "title": "In-situ Observation of Phase Transformation During Ion Beam Irradiation",
      "authors": [
        "KBSI",
        "Deajeon",
        "Republic of Korea",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "The new method uses reflection high-energy electron diffraction (RHEED) to collect electron diffraction patterns while performing ion irradiation. We use a 50 keV electron beam impinging on a crystalline substrate at grazing incidence. In this presentation",
        "we report on ion irradiations of a single crystal. Irradiations were performed using 100 keV Ar ions at room temperature. Before the single crystal was bombarded with Ar ions",
        "a diffraction pattern with strong diffraction maxima was observed. During the Ar ion irradiation",
        "electron diffraction patterns were collected from the near surface region. The initially strong diffraction patterns gradually faded in intensity until no diffraction spots were visible on the phosphor screen at the fluence of 6~8x1014 ions/cm2. To confirm the presence of the ion-induced amorphization in the near surface region",
        "we used grazing incidence X-ray diffraction and electron diffraction in a transmission electron microscope. Both characterization techniques corroborated the RHEED in-situ measurement",
        "showing the existence of an amorphous region produced by the 100 keV Ar ions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/webo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/webo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/webo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEBO03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:27:42"
}