{
  "session_info": {
    "id": "MOYBA",
    "name": "MOYBA - Plenary Oral Session, Hadron Accelerators",
    "url": "https://proceedings.jacow.org/IPAC2014/html/moyba.htm"
  },
  "papers": [
    {
      "paper_id": "MOYBA01",
      "title": "The Very High Intensity Future",
      "authors": [
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "This paper surveys the key technologies and design challenges that form a basis for the next generation of very high intensity hadron accelerators",
        "including projects operating",
        "under construction",
        "and under design for science and applications at MW beam power level."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/moyba01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/moyba01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/moyba01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-MOYBA01",
      "page_number": "17",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOYBA02",
      "title": "New Design Approaches for High Intensity Superconducting Linacs – The New ESS Linac Design",
      "authors": [
        "ESS",
        "Lund",
        "Sweden",
        "The cost of the next generation of high intensity accelerators has become so large that no single institution can solely afford to fund the construction of the project. To fund these large projects",
        "institutions have embarked on forming ambitious collaboration structures with other laboratories. To induce other laboratories to join the collaboration",
        "compromises must be made in the accelerator technical design to offer interesting and challenging projects to partner institutions. The cost of high intensity hadron accelerators is largely driven by RF system. A new design philosophy different from the traditional approach is emerging for the high intensity frontier machines. Emittance preservation is often less of an issue as long as beam losses are kept low. At ESS modifications were introduced to the linac design. One of the major changes is the reduction of final energy and an increase of gradient and beam current. As a result the design now meets the cost objective but for the price of a higher risk. The accelerator system designer must then try to balance the cost and technical risks while also satisfying the interests and external goals of the partner laboratories."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/moyba02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/moyba02.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/moyba02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-MOYBA02",
      "page_number": "23",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 20:36:38"
}