{
  "session_info": {
    "id": "THPMP",
    "name": "THPMP - Poster Session - Magpie",
    "url": "https://proceedings.jacow.org/ipac2019/html/thpmp.htm"
  },
  "papers": [
    {
      "paper_id": "THPMP002",
      "title": "Optics Design and  Beam Dynamics Simulation for a VHEE Radiobiology Beam Line at PRAE Accelerator",
      "authors": [
        "A. Faus-Golfe",
        "B. Bai",
        "Y. Han",
        "C. Vallerand",
        "LAL",
        "Orsay",
        "France",
        "R. Delorme",
        "Y. Prezado",
        "IMNC",
        "Orsay",
        "France",
        "CERN",
        "Meyrin",
        "Switzerland",
        "IPN",
        "Orsay",
        "France",
        "V. Favaudon",
        "C. Fouillade",
        "P.M. Poortmans",
        "F. Pouzoulet",
        "Institut Curie - Centre de Protonthérapie d’Orsay",
        "Orsay",
        "France",
        "The Platform for Research and Applications with Electrons (PRAE) is a multidisciplinary R&D facility gathering subatomic physics",
        "instrumentation",
        "radiobiology and clinical research around a high-performance electron accelerator with beam energies up to 70 MeV. In this paper we report the complete optics design and performance evaluation of a Very High Energy Electron (VHEE) innovative radiobiology study",
        "in particular by using Grid mini-beam and FLASH methodologies",
        "which could represent a major breakthrough in Radiation Therapy (RT) treatment modality."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP003",
      "title": "The PRORAD Beam Line Design for PRAE",
      "authors": [
        "A. Faus-Golfe",
        "B. Bai",
        "Y. Han",
        "C. Vallerand",
        "LAL",
        "Orsay",
        "France",
        "P. Duchesne",
        "D. Marchand",
        "E.J-M. Voutier",
        "IPN",
        "Orsay",
        "France",
        "The PRAE (Platform for Research and Applications with Electrons) accelerator is being built at Orsay campus with the main objective of creating a multidisciplinary R&D platform",
        "involving subatomic physics",
        "instrumentation",
        "radiobiology and clinical research around a high-performance electron accelerator with beam energies up to 70 MeV (planned 140 MeV). In this paper we will report the optics design and beam dynamics simulations for the beam line dedicated to subatomic physics",
        "more specifically for the measurement of the proton radius. This measurement requires extremely low energy spread (5×10−4) and small beam sizes with low divergence at three beam energies: 30",
        "50 and 70 MeV. The beam line includes a D-type chicane coupled to a dechirping passive structure",
        "which generates inductive wakeﬁelds in order to get the performances required for such measurement."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp003.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP005",
      "title": "Charge Stripping at High Energy Heavy Ion Linacs",
      "authors": [
        "W.A. Barth",
        "S. Yaramyshev",
        "GSI",
        "Darmstadt",
        "Germany",
        "HIM",
        "Mainz",
        "Germany",
        "W.A. Barth",
        "T. Kulevoy",
        "S.M. Polozov",
        "S. Yaramyshev",
        "MEPhI",
        "Moscow",
        "Russia",
        "A.S. Fomichev",
        "L.V. Grigorenko",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "NRC",
        "Moscow",
        "Russia",
        "For heavy-ion accelerator facilities charge stripping is a key Technology: the stripping charge state",
        "its efficiency to produce ions in the required charge state",
        "and the beam quality after stripping substantially determine the entire accelerator performance. Modern heavy ion accelerator facilities such as the future Facility for Antiproton and Ion Research (FAIR) at GSI provide for high intensity heavy ion beams beyond 200 MeV/u. Heavy ion stripping at a lower energy enables more efficient acceleration up to the final beam energy",
        "compared to acceleration of ions with a low charge state. Due to the high power deposited by the heavy ions in the stripping media and radiation damages if a solid target is used",
        "self-recovering stripper media must be applied. General implementation options for different stripper target media are discussed in this paper",
        "as well as general considerations to optimize the Linac layout through the appropriate choice of stripping medium and stripping energy. The driver Linac for the Dubna Electron-Radioactive Isotope Collider fAcility (DERICA) project",
        "recently initiated by JINR",
        "is foreseen to provide for 100 MeV/u Uranium beam in continuous wave mode. First layout scenarios of a one-step and a two-step DERICA-stripper approach will be also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp005.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP006",
      "title": "Study on the Theta Pinch Plasmas for Applied as Ion Stripper",
      "authors": [
        "K. Cistakov",
        "Ph. Christ",
        "M. Fröhlich",
        "M. Iberler",
        "J. Jacoby",
        "L. Manganelli",
        "G. Xu",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "R. Gavrilin",
        "A. Khurchiev",
        "S.M. Savin",
        "ITEP",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp006.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP007",
      "title": "MICROTCA TECHNOLOGY LAB AT DESY: CURRENT CASES IN TECHNOLOGY TRANSFER",
      "authors": [
        "T. Walter",
        "I. Mahns",
        "H. Schlarb",
        "DESY",
        "Hamburg",
        "Germany",
        "MicroTCA-based LLRF systems for beam control and beam diagnostics are gaining traction in many facilities around the world. Over the past decade",
        "a comprehensive portfolio of hardware solutions (boards",
        "crates",
        "backplanes) has become available to cater for demanding signal processing applications in state-of-the-art facilities like the European XFEL. Gradually",
        "industrial applications of MicroTCA also have become more common. In response various requests",
        "DESY has opened the MicroTCA Technology Lab (A Helmholtz Innovation Lab) in April 2018 as a service unit for research and industry with a focus on: - Customer-specific developments in MicroTCA (hardware",
        "firmware",
        "software)",
        "- High-end test and measurement services",
        "- Consulting and system integration. We report on intermediate results and emerging projects after one year of operation",
        "with transfer examples from the industrial automation and medical technology sectors as well as overlapping developments for the physics research community."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp007.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP008",
      "title": "Feasibility Study on Mo-99 Production Using Hybrid Method Based on High Power Electron Accelerator",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp008.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP009",
      "title": "LATINO: A Laboratory in Advanced Technologies for Innovation",
      "authors": [
        "L. Sabbatini",
        "D. Alesini",
        "A. Falone",
        "A. Gallo",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "INFN-Roma",
        "Roma",
        "Italy",
        "LATINO (a Laboratory in Advanced Technologies for INnOvation) is an open Research Infrastructure that will be hosted at the Frascati National Laboratories (LNF) of the Italian National Institute for Nuclear Physics (INFN). LATINO will allow the scientific community and the SMEs to get access to the technologies and competences developed for particle accelerators. The Infrastructure will be organized in four Laboratories: Radio Frequency",
        "Vacuum and Thermal Treatments",
        "Magnetic Measurements",
        "Mechanical Integration. The list of the available instruments will include",
        "besides others",
        "a high power X-Band station to test cavities up to 50 Hz repetition rate and 200 MW input power",
        "a network analyser to characterize microwave devices up to 100 GHz",
        "a ultra high vacuum oven for thermal treatments and brazing",
        "an outgassing measurement system to characterize vacuum materials",
        "a stretched wire bench and a rotating coil for the magnetic field measurements of multipoles",
        "environment and laser scanners. The regional and national industrial background comprises a remarkable number of highly qualified small and medium enterprises that could take advantage of the technologies offered by LATINO infrastructure to develop novel products within the Key Enabling Technologies and to get the access to new market segments. The Infrastructure will be fully operational at the beginning of 2020. For further information please visit www.latino.lnf.infn.it."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp009.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP010",
      "title": "Implementation of RF-KO Extraction at CNAO",
      "authors": [
        "S. Savazzi",
        "E. Bressi",
        "G. Debernardi",
        "L. Falbo",
        "V. Lante",
        "C. Priano",
        "M.G. Pullia",
        "CNAO Foundation",
        "Pavia",
        "Italy",
        "University of Pavia",
        "Pavia",
        "Italy",
        "Politecnico di Torino",
        "Torino",
        "Italy",
        "The National Centre for Oncological Hadrontherapy (CNAO) is a synchrotron based particle therapy facility. Both protons and carbon ions can be used for treatments. The main extraction system is based on ’amplitude-momentum selection’ driven by a betatron core",
        "but RF-KO (Radio-Frequency Knock Out) is being implemented as an alternative extraction scheme",
        "being more suitable for a future implementation of a ’multi energy extraction’ operation of the accelerator. With a double extraction possibility",
        "CNAO would allow an interesting theoretical and experimental evaluation of the relative merits of the two extraction schemes. The RF deflector is already installed and the RF power generation is under commissioning. Extraction simulations and first results of the system are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP011",
      "title": "Optics and Commissioning of the CNAO Experimental Beam Line",
      "authors": [
        "S. Savazzi",
        "E. Bressi",
        "L. Falbo",
        "V. Lante",
        "C. Priano",
        "M.G. Pullia",
        "CNAO Foundation",
        "Pavia",
        "Italy",
        "University of Pavia",
        "Pavia",
        "Italy",
        "CNAO (National Centre for Oncological Hadronthera-py) in Pavia is one of the six centres worldwide in which hadrontherapy is administered with both protons and carbon ions. The main accelerator is a 25 m diameter synchrotron designed to accelerate carbon ions up to an energy of 400 MeV/u and protons up to an energy of 250 MeV. It was designed with three treatment rooms and an ’experimental room’ where research can be carried out. The room itself was built since the beginning",
        "but the beam line was planned to be installed in a second moment in order to give priority to treatments. The beam line of the experimental room (XPR) is designed to be \"general purpose\"",
        "for research activities in different fields. In October 2018 the installation phase of the line was started and it ended in January 2019. In this paper a short description of the optics layout and commissioning strategy is given."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp011.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP012",
      "title": "New Industrial Application Beamline for the cERL in KEK",
      "authors": [
        "Y. Morikawa",
        "K. Haga",
        "M. Hagiwara",
        "K. Harada",
        "N. Higashi",
        "T. Honda",
        "Y. Honda",
        "M. Hosumi",
        "Y. Kamiya",
        "R. Kato",
        "H. Kawata",
        "Y. Kobayashi",
        "H. Matsumura",
        "C. Mitsuda",
        "T. Miura",
        "T. Miyajima",
        "S. Nagahashi",
        "N. Nakamura",
        "K.N. Nigorikawa",
        "T. Nogami",
        "T. Obina",
        "H. Sagehashi",
        "H. Sakai",
        "M. Shimada",
        "M. Tadano",
        "R. Takai",
        "H. Takaki",
        "O.A. Tanaka",
        "Y. Tanimoto",
        "A. Toyoda",
        "T. Uchiyama",
        "A. Ueda",
        "K. Umemori",
        "M. Yamamoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "The new beam line for the industrial applications is constructed at the cERL (compact Energy Recovery LINAC) in KEK. In these applications",
        "only north straight sections of cERL consisting of injector and main LINAC will be used. The test for the radio isotope production and electron beam irradiation for the materials are firstly planned with very small beam current without energy recovery."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp012.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP013",
      "title": "Challenges Towards Industrialization of the ERL-FEL Light Source for EUV Lithography",
      "authors": [
        "N. Nakamura",
        "E. Kako",
        "R. Kato",
        "H. Kawata",
        "T. Miyajima",
        "H. Sakai",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "EUV Lithography is going to HVM (high volume manufacturing) stage with 250-W-class laser-produced plasma sources and it is important to develop a new-type EUV light source to meet future demand for higher power. Energy-recovery linac based free-electron lasers (ERL-FELs) are possible candidates of a high-power EUV light source that can distribute 1 kW power to multiple scanners simultaneously. In Japan",
        "an ERL-FEL based EUV light source has been designed using available technologies without much development to demonstrate generation of EUV power more than 10 kW and the EUV-FEL Light Source Study Group for Industrialization has been established since 2015 to realize industrialization of the light source and the related items. For industrialization",
        "high availability is essential as well as high power and reduction of the light source size is also required. In this paper",
        "we will report an overview of the designed ERL-FEL light source for EUV lithography and some activities for the industrialization and describe considerations and developments for obtaining high availability and size reduction of the light source."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp013.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP014",
      "title": "D TRACKING CODE FOR DRIFT TUBE LINAC",
      "authors": [
        "A. Yamaguchi",
        "K. Nakayama",
        "K. Okaya",
        "K. Sato",
        "Toshiba",
        "Yokohama",
        "Japan",
        "RLNR",
        "Tokyo",
        "Japan",
        "Y. Iwata",
        "S. Yamada",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "Toshiba Energy Systems & Solutions Corporation",
        "Keihin Product Operations",
        "Yokohama",
        "Japan",
        "A 2D tracking code has been developed for Alternating-Phase-Focusing drift tube linacs (APF-DTL). This code can design DTLs with a 2D electric field simulation and particle tracking by approximate equations. In this paper",
        "we describe an outline of the 2D tracking code and a comparison of 2D tracking results and 3D simulation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp014.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP016",
      "title": "Design of the Condenser System and Imaging System for a UEM",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp016.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP017",
      "title": "Design and Development of the Beamline System for a Proton Therapy Facility",
      "authors": [
        "B. Qin",
        "Q.S. Chen",
        "M. Fan",
        "K.F. Liu",
        "X. Liu",
        "J. Yang",
        "Z.F. Zhao",
        "HUST",
        "Wuhan",
        "People’s Republic of China",
        "W.J. Han",
        "D. Li",
        "Z.K. Liang",
        "Huazhong University of Science and Technology",
        "State Key Laboratory of Advanced Electromagnetic Engineering and Technology",
        "Hubei",
        "People’s Republic of China",
        "A proton therapy facility with multiple treatment rooms based on superconducting cyclotron scheme is under development in HUST (Huazhong University of Science and Technology). Design features and overview of development progress for the beamline system will be presented in this paper",
        "which mainly focuses on prototype beamline magnets",
        "a kicker magnet for fast beam switch",
        "and the gantry beamline using image optics."
      ],
      "institutions": [
        "Funding: This work was supported by The National Key Research and Development Program of China, with grant No. 2016YFC0105305; and by National Natural Science Foundation of China (11375068)."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp017.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP020",
      "title": "Single-Shot Cascade High Energy Electron Radiography based on Strong Permanent Magnet Quadrupole Composed Imaging Lens",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp020.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP021",
      "title": "X-ray Dose Rate of 6/4 MeV European S-band Linac Structure for Industrial Application at RTX",
      "authors": [
        "P. Buaphad",
        "I.G. Jeong",
        "Y. Joo",
        "H.R. Lee",
        "University of Science and Technology of Korea (UST)",
        "Daejeon",
        "Republic of Korea",
        "I.G. Jeong",
        "J.Y. Lee",
        "Korea Atomic Energy Research Institute (KAERI)",
        "Daejeon",
        "Republic of Korea",
        "Y. Joo",
        "Y. Kim",
        "H.R. Lee",
        "KAERI",
        "Daejon",
        "Republic of Korea",
        "H.D. Park",
        "S. Song",
        "RTX",
        "Daejeon",
        "Republic of Korea",
        "Recently",
        "RTX has been developing a 6/4 MeV European S-band (= 2998 MHz) industrial linac by using a magnetron with a low RF power of about 3 MW for container inspection system (CIS). Its accelerating structure is designed to operate in π/2 mode by coupling 6 accelerating cells together through 5 side-coupled cells. In CIS",
        "high dose rate X-rays from MeV-energy electron beam has been used to detect the possible presence of contrabands in cargoes or truck containers. To determine a dose rate output",
        "the X-ray dose rate can be simulated by using FLUKA Monte Carlo simulation. The aim of this work was to study the effects of thickness of X-ray target on dose rate as well as X-ray dose map at 1.0 m away from the X-ray target. This study gives the thickness of target in which the dose rate can be highest and electron beam current can be lowest."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp021.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP025",
      "title": "Modern Heavy Ion Based Test Facilities For Spacecrafts Electronics Qualification",
      "authors": [
        "ISDE",
        "Moscow",
        "Russia",
        "United Rocket and Space Corporation",
        "Institute of Space Device Engineering",
        "Moscow",
        "Russia",
        "I.V. Kalagin",
        "S.V. Mitrofanov",
        "V.A. Skuratov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "All spacecraft electronics should be subject to radiation hardness qualifications. For modern semiconductor technologies",
        "individual high-energy particles of outer space are the greatest danger",
        "causing upsets and failures in satellite equipment. For ground tests at single event effects",
        "heavy ion-based modeling facilities are used. The report describes the test benches used for testing space-based electronics",
        "created on the basis of the U-400",
        "U-400M ion accelerators in the FLNR JINR (Dubna",
        "Russia) at the request of ISDE (Moscow",
        "Russia)."
      ],
      "institutions": [],
      "abstract": "V.S. Anashinpresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp025.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP026",
      "title": "Mobile Accelerator Based on Ironless Pulsed Betatron for Dynamic Objects Radiographing",
      "authors": [
        "V.A. Fomichev",
        "A.A. Chinin",
        "S.G. Kozlov",
        "Yu.P. Kuropatkin",
        "V.I. Nizhegorodtsev",
        "I.N. Romanov",
        "K.V. Savchenko",
        "V.D. Selemir",
        "O.A. Shamro",
        "E.V. Urlin",
        "RFNC-VNIIEF",
        "Sarov",
        "Nizhniy Novgorod region",
        "Russia",
        "The paper concerns a mobile accelerator based on the ironless pulsed betatron. The accelerator has a possibility to obtain up to three frames in a single pulse and is aimed to radiograph dynamic objects with a large optical thickness. The block diagram of the accelerator",
        "the temporal diagram of its separate systems operation and oscillograms of the betatron output parameters are provided. The testing powering in a single frame mode was carried out in 2018. The capacitance of the storage of the betatron electromagnet pulsed powering system that defines the electron beam energy was equal to 1800 μF. The following test results have been obtained. The thickness of the lead test object examined with X-rays reached 140 mm at 4 m from the tantalum target of the betatron. The full width of the output gamma pulse at half maximum in a single frame mode was equal to 120 ns; the dimension of the radiation source was 6 mm x 3 mm; the dimension of the tantalum target was 6 mm x 6 mm. The application of these accelerators within the radiographic complex* enables the optimization of the hydrodynamic experiments geometry resulting in the increase of the test efficiency.",
        "* Pat. 2548585 C1 RU MPK G03B 42/02. D.I. Zenkov and others. «Mobile radiographic complex and radiation source of betatron type for radiographic complex» (in Russian)",
        "2015."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp026.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP027",
      "title": "Concept of Radiographic Complex Based on Ironless Pulsed Betatrons for Small-Angle Tomography",
      "authors": [
        "O.A. Shamro",
        "A.A. Chinin",
        "V.A. Fomichev",
        "Yu.P. Kuropatkin",
        "V.I. Nizhegorodtsev",
        "K.V. Savchenko",
        "V.D. Selemir",
        "RFNC-VNIIEF",
        "Sarov",
        "Nizhniy Novgorod region",
        "Russia",
        "The active research complexes intended for the radiography of dynamic objects with a high optical density are reviewed. The concept of a multi-beam radiographic complex for a small-angle tomography based on ironless pulsed betatrons is proposed*. It is possible to use up to 18 compact facilities in a complex; they are located in three horizontal planes. The test object is placed in the explosion-proof chamber. Each facility consists of two typical units: an accelerator unit",
        "and a unit of the electromagnet pulsed powering system. The output parameters of the facility are the maximum translucent capacity of 200 mm of the lead at 1 m from the betatron target",
        "the resolution of less than 1 mm",
        "the gamma-pulse full width at half maximum of 100 ns in a single frame mode",
        "the gamma-pulse full width at half maximum of 150 ns in a three-frame mode. The complex will be able to obtain up to 54 frames in one hydrodynamic experiment at the operation of each facility in a three-frame mode. The complex is compact. Its diameter with a service area will be 20 m.",
        "* Pat. 2515053 С1 RU МPK G03B 42/02. Yu.P. Kuropatkin",
        "others. «Method of Radiograph. Image Form. of Fast Processes in Inhomogeneity and Radiograph. Complex for its Implementation»",
        "2014."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp027.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP029",
      "title": "Design Study of a Compact Superconducting Cyclotron SC240 for Proton Therapy",
      "authors": [
        "F. Jiang",
        "G. Chen",
        "Y. Chen",
        "K.Z. Dingpresenter",
        "J. Li",
        "Y. Song",
        "Z. Wu",
        "J. Zhou",
        "ASIPP",
        "Hefei",
        "People’s Republic of China",
        "HFCIM",
        "HeFei",
        "People’s Republic of China",
        "A compact AVF cyclotron of 240 MeV is under-designed for proton therapy. In order to reduce the size",
        "the weight and operation cost",
        "two superconducting coils are designed to implement the 2.35T central field. And the magnet weight is about 90 tons. The constant gap between the sectors is considered without deteriorating the beam stability. A dedicated design on extraction zone is performed to make the average field to close the isochronous field. The extraction efficiency is expected higher than 80%",
        "by regulating the 1st harmonic field and arranging the extraction elements properly. In order to avoid the large scale of volume helium explosion in the quench",
        "the low temperature superconducting coil using NbTi/Cu wire is cooled by 4K GM Cryocooler in a helium volume limiting design. The paper will present the physical design of this cyclotron."
      ],
      "institutions": [
        "Funding: National Natural Science Foundation of China under grant No. 11775258 & 11575237; International Scientific and Technological Co-operation Project of Anhui (grant No. 1704e1002207)."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp029.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP033",
      "title": "Beam Characterisation Using",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp033.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP034",
      "title": "Simulating Matter Interactions of Partially Stripped Ions in BDSIM",
      "authors": [
        "A. Abramov",
        "S.T. Boogert",
        "L.J. Nevay",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "Acceleration and storage of beams of relativistic partially stripped ions is more challenging than in the case of fully stripped ions because the interactions with matter",
        "such as those with residual gas and collimators can strip electrons via ionisation. BDSIM is a code for the simulation of energy deposition and charged particle backgrounds in accelerators that uses the Geant4 physics library. Geant4 includes a broad range of ion elastic and inelastic interactions and allows the definition of partially stripped ion beams. However",
        "no models are currently available to handle in-flight interactions involving the bound electrons. In this paper we present a semi-empirical model of beam ion stripping by material atoms that is implemented in BDSIM as an extension of Geant4’s existing physics processes and is fully integrated into a comprehensive set of matter interactions for partially stripped ions. The stripping cross-section for select cases and results from comprehensive simulations are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp034.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP035",
      "title": "Tactile Collider : Accelerator Outreach to Visually Impaired Audiences",
      "authors": [
        "R.B. Appleby",
        "B. Jeffrey",
        "B.S. Kyle",
        "T.H. Pacey",
        "H. Rafique",
        "S.C. Tygier",
        "R. Watson",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "T. Boyd",
        "A.L. Healy",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The University of Manchester",
        "The Photon Science Institute",
        "Manchester",
        "United Kingdom",
        "The Large Hadron Collider (LHC) has attracted significant attention from the general public. The science of the LHC and Higgs Boson is primarily communicated to school children and the wider public using visual methods. As a result",
        "people with visual impairment (VI) often have difficulty accessing scientific communications and may be culturally excluded from news of scientific progress. Tactile Collider is a multi-sensory experience that aims to communicate particle accelerator science in a way that is inclusive of audiences with VI. These experiences are delivered as a 2-hour event that has been touring the UK since 2017. In this article we present the methods and training that have been used in implementing Tactile Collider as a model for engaging children and adults with science. The event has been developed alongside experts that specialise in making learning accessible to people with VI."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp035.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP036",
      "title": "Beam Dynamics of Novel Hybrid Ion Mass Analysers",
      "authors": [
        "R.B. Appleby",
        "T. Rose",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "M.R. Green",
        "P. Nixon",
        "K. Richardson",
        "Waters Corporation",
        "Manchester",
        "United Kingdom",
        "Fourier transform (FT) mass spectrometers achieve high resolution using relatively long transient times by trapping ions and measuring the frequency of their motion (inductively) inside an electrostatic potential. By contrast",
        "time-of-flight (ToF) mass spectrometers measure the time of flight between an initiation pulse and contact with a destructive detector positioned on a plane of space focus after flying along a predetermined route. These devices have relatively short flight times and",
        "generally",
        "lower resolution. A class of hybrid analysers have been proposed and studied",
        "utilising a quadro-logarithmic potential to reflect ions multiple times past an inductive detector",
        "with the potential for the short transient of ToF devices - and the high resolution of FT devices. In this paper we compute the ion dynamics inside such devices",
        "tracking bunches of ions and studying induced signals."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp036.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP038",
      "title": "Collaborative Strategies for Meeting the Global Need for Cancer Radiation Therapy Treatment Systems",
      "authors": [
        "M. Dosanjh",
        "P. Collier",
        "I. Syratchev",
        "W. Wuensch",
        "CERN",
        "Meyrin",
        "Switzerland",
        "KCL",
        "London",
        "United Kingdom",
        "D. Angal-Kalinin",
        "P.A. McIntoshpresenter",
        "B.L. Militsyn",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "N. Coleman",
        "D.A. Pistenmaa",
        "ICEC",
        "Washington",
        "DC",
        "USA",
        "USTRAT/SUPA",
        "Glasgow",
        "United Kingdom",
        "I.V. Konoplev",
        "S.L. Sheehy",
        "JAI",
        "Oxford",
        "United Kingdom",
        "The idea of designing affordable equipment and developing sustainable infrastructures for delivering radiation treatment for patients with cancer in countries that lack resources and expertise stimulated a first International Cancer Expert Corps (ICEC) championed",
        "CERN-hosted workshop in Geneva in November 2016. Which has since been followed by three additional workshops involving the sponsorship and support from UK Science and Technology Facilities Council (STFC). One of the major challenges in meeting this need to deliver radiotherapy in low- and middle-income countries (LMIC) is to design a linear accelerator and associated instrumentation system which can be operated in locations where general infrastructures and qualified human resources are poor or lacking",
        "power outages and water supply fluctuations can occur frequently and where climatic conditions might be harsh and challenging. In parallel it is essential to address education",
        "training and mentoring requirements for current",
        "as well as future novel radiation therapy treatment (RTT) systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp038.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP039",
      "title": "How Robust Are Existing Medical Linacs in Challenging Environments? A Study of Down Time and Failure Causes.",
      "authors": [
        "S.L. Sheehy",
        "L. Wroe",
        "JAI",
        "Oxford",
        "United Kingdom",
        "Egerton Consulting Ltd",
        "Minety",
        "Malmesbury",
        "Wiltshire",
        "United Kingdom",
        "Oxford University",
        "Physics Department",
        "Oxford",
        "Oxon",
        "United Kingdom",
        "There is a severe lack of radiotherapy linear accelerators (LINACs) in Low- and Middle-Income countries (LMICs)",
        "limiting capacity for cancer care in these regions. Anecdotally",
        "operating high tech accelerators in environments with power fluctuations",
        "harsh climatic conditions and geographic isolation leads to large failure rates and downtime. To guide future developments",
        "this study presents a data-driven approach to collect statistical data on LINAC downtime and failure modes",
        "comparing to a simple availability model."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp039.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP041",
      "title": "A Comparative Study of Biological Effects of Electrons and Co-60 Gamma Rays on pBR322 Plasmid DNA",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp041.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP042",
      "title": "Performance Optimization of Ion Beam Therapy",
      "authors": [
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "Proton beam therapy promises significant advantages over other forms of radiation therapy. However",
        "to assure the best possible cancer care for patients further R&D into novel beam imaging and patient diagnostics",
        "enhanced biological and physical models in Monte Carlo codes",
        "as well as clinical facility design and optimization is required. Within the pan-European Optimization of Medical Accelerators (OMA) project collaborative research is being carried out between universities",
        "research and clinical facilities",
        "and industry in all of these areas. This contribution presents results from studies into low-intensity proton beam diagnostics",
        "prompt gamma-based range verification in proton therapy",
        "as well as prospects for a new proton irradiation facility for radiobiological measurements at an 18 MeV cyclotron within OMA. These results are then connected to the wider project aims of enhancing ion beam therapy. A summary of past and future events organised by the OMA consortium is also given."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp042.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP043",
      "title": "Non-Invasive Beam Monitoring Using LHCb VELO With 40 MeV Protons",
      "authors": [
        "R. Schnuerer",
        "C.P. Welsch",
        "J.S.L. Yap",
        "H.D. Zhangpresenter",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Birmingham University",
        "Birmingham",
        "United Kingdom",
        "R. Schnuerer",
        "C.P. Welsch",
        "J.S.L. Yap",
        "H.D. Zhangpresenter",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "AGH",
        "Cracow",
        "Poland",
        "In proton beam therapy",
        "knowledge of the detailed beam properties is essential to ensure effective dose delivery to the patient. In clinical practice",
        "currently used interceptive ionisation chambers require daily calibration and suffer from slow response time. This contribution presents a new non-invasive method for dose online monitoring. It is based on the silicon multi-strip sensor LHCb VELO (VErtex LOcator)",
        "developed originally for the LHCb experiment at CERN. The semi-circular detector geometry offers the possibility to measure beam intensity through halo measurements without interfering with the beam core. Results from initial tests using this monitor in the 40 MeV proton beamline at the University of Birmingham",
        "UK are shown. Synchronised with an ionisation chamber and the RF cyclotron frequency",
        "VELO was used as online monitor by measuring the intensity in the proton beam halo and using this information as basis for 3D beam profiles. Experimental results are discussed."
      ],
      "institutions": [
        "Funding: EU grant agreements 215080 and 675265, the Cockcroft Institute core Grant (ST/G008248/1), national agency: MNiSW and NCN (UMO-2015/17/B/ST2/02904) and the Grand Challenge Network+ (EP/N027167/1)."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp043.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP044",
      "title": "Radiation Hard Sensor for Reactor Applications",
      "authors": [
        "R.J. Abrams",
        "M.A. Cummings",
        "R.P. Johnson",
        "T.J. Roberts",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illinois",
        "USA",
        "A novel method of measuring temperature of the coolant inside a reactor core is presented. The method",
        "which is both standoff and non-invasive",
        "is based on the interaction between an ultrasonic pulse and a delayed light pulse in the coolant. In the interaction",
        "the light pulse",
        "which is scattered backward by Brillouin scattering",
        "is frequency-shifted. The frequency shift is dependent on the temperature and other parameters of the coolant. The light pulses and the ultrasound pulses are generated and detected outside of the core."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp044.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP046",
      "title": "Knowledge Exchange Within the Particle Accelerator Community via Cloud Computing",
      "authors": [
        "D.L. Bruhwiler",
        "D.T. Abell",
        "N.M. Cook",
        "C.C. Hall",
        "M.V. Keilman",
        "P. Moeller",
        "R. Nagler",
        "B. Nash",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "The development",
        "testing and use of particle accelerator modeling codes is a core competency of accelerator research laboratories around the world",
        "and likewise for synchrotron radiation and X-ray optics codes at lightsource facilities. Such codes require time and training to learn a command-line workflow involving multiple input and configuration files",
        "execution on a high-performance server or cluster",
        "post-processing with specialized software and finally visualization. Such workflows are error prone an difficult to reproduce. Cloud computing and UI design are core competencies of RadiaSoft LLC",
        "where the Sirepo* framework is being developed to make state of the art codes available in the browser of any desktop",
        "laptop or tablet. We present our initial successes as real world examples of knowledge exchange (KE) between industry and the research community. This work is leading to broader knowledge exchange throughout the community by facilitating education of students and enabling instantaneous sharing of simulation details between colleagues. Sirepo design objectives include: seamless integration with legacy codes",
        "low barrier to entry for new users",
        "configuration transfer to command line mode",
        "catalog of provenance to aid reproducibility",
        "and simplified collaboration through multimodal sharing. The Sirepo Scientific Gateway** allows users to directly test the software. The combination of intuitive browser-based GUIs and Sirepo’s server-side application container technology enables simplified computational archiving and reproducibility. If embraced by the community",
        "this could become an important asset for the design",
        "commissioning and future upgrade of particle accelerator and X-ray beamline facilities.",
        "* Sirepo cloud computing framework",
        "https://github.com/radiasoft/sirepo ** Sirepo Scientific Gateway",
        "https://sirepo.com"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp046.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP047",
      "title": "Advanced Modeling and Optimization of Thermionic Energy Converters",
      "authors": [
        "J.P. Edelen",
        "N.M. Cook",
        "C.C. Hall",
        "Y. Hu",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Thermionic energy converters (TEC) are a class of thermoelectric devices",
        "which promise improvements to the efficiency and cost of both small- and large-scale electricity generation. A TEC is comprised of a narrowly-separated thermionic emitter and an anode. Simple structures are often space-charge limited as operating temperatures produce currents exceeding the Child-Langmuir limit. We present results from 3D simulations of these devices using the particle-in-cell code Warp",
        "developed at Lawrence Berkeley National Lab. We demonstrate improvements to the Warp code permitting high fidelity simulations of complex device geometries. These improvements include modeling of non-conformal geometries using mesh refinement and cut-cells with a dielectric solver",
        "in addition to importing geometries directly from standard CAD output. In this paper we showcase some of these new features and demonstrate their use."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp047.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP048",
      "title": "Mu*STAR: A Modular Accelerator-Driven Subcritical Reactor Design",
      "authors": [
        "R.P. Johnson",
        "R.J. Abrams",
        "M.A. Cummings",
        "J.D. Lobo",
        "M. Popovic",
        "T.J. Roberts",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "Mu*STAR is an accelerator-driven molten-salt sub-critical reactor based on recent superconducting RF technological breakthroughs that allow a highly efficient and powerful proton accelerator to drive a spallation target inside a graphite-moderated",
        "thermal-spectrum reactor. The additional spallation neutrons can be used to overcome the absorption of neutrons by fission products to allow a deeper burn than is possible with critical reactor designs. Simulations have shown that as much as seven times the energy that was extracted from used fuel from light water reactors can be produced by this method before the accelerator demands significant power from the reactor. Once the fuel rods have been converted from oxide ceramics to fluoride salts",
        "in a process that is proliferation resistant (not chemical reprocessing)",
        "the fuel can be burned for centuries without increasing its volume while reducing its radio-toxicity. Our 2017 GAIN voucher grant supported studies by ORNL",
        "SRNL",
        "and INL to design and cost a Fuel Processing Plant to convert used nuclear fuel into the molten-salt fuel for Mu*STAR. Based on those studies",
        "it seems possible to build Mu*STAR systems on existing sites where used fuel is stored",
        "convert it to fluoride salts",
        "and use it to provide affordable carbon-free electricity for centuries."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp048.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP049",
      "title": "Sequential Excitation Scheme for Laser Stripping of Hydrogen Ion Beams",
      "authors": [
        "Y. Liu",
        "A.V. Aleksandrov",
        "S.M. Cousineau",
        "T.V. Gorlov",
        "A. Rakhman",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Resonant laser excitation of the electron in a hydrogen atom is essential to achieve high-efficiency laser stripping of hydrogen ion (H−) beam. In the laser stripping experiments recently carried out at SNS",
        "an ultra-violet (UV) laser was used to excite the electrons in 1-GeV hydrogen atoms from the n=1 state to the n=3 state. In this talk",
        "we propose a sequential resonant excitation scheme by using two laser beams to excite electrons in a sequence of two steps: from the n=1 state to the n=2 state and from the n=2 state to any higher state. The advantages of the sequential resonant excitation scheme include (1) lower laser power requirement due to higher transition probability in the first excitation step and (2) possibility of shifting the stripping laser wavelength from UV regime to longer wavelengths. An application of the sequential resonant excitation scheme in combination with the double-resonance optical cavity technology to the laser stripping of 1.3-GeV H− beam (envisioned in the SNS proton power upgrade project) will be described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp049.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP050",
      "title": "Progress on the Optics Modeling of BMI’s Ion Rapid-Cycling Medical Synchrotron at BNL",
      "authors": [
        "F. Méot",
        "P.N. Joshi",
        "N. Tsoupas",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Best Medical International",
        "Springfield",
        "USA",
        "The Brookhaven National Laboratory continues to provide technical support and guidance to Best Medical International to build and test a 60 degree magnetic arc of a rapid-cycling ion synchrotron for cancer treatment. The 60 degree magnetic sector on its guirder has undergone field measurements",
        "including the production of partial 3D field maps. Concurrently",
        "OPERA field map computations as well as lattice and beam dynamics simulations have been performed",
        "aimed at both preparing and analyzing the field measurements. Contingency responses aimed at adapting to non-ideal orbit and optics have been devised. These works and their outcomes are summarized here."
      ],
      "institutions": [
        "Funding: A project funded by Best Medical International, in the framework of a Technical Services Agreement (No. TSA-NF-18-50) with Brookhaven National Laboratory."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp050.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP051",
      "title": "Development of 211-Astatine Production in the Crocker Nuclear Laboratory Cyclotron",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "UCB",
        "Berkeley",
        "California",
        "USA",
        "University of California at Davis (UC Davis)",
        "Davis",
        "California",
        "USA",
        "UCD",
        "Davis",
        "California",
        "USA",
        "There is a great deal of interest in the medical community in the use of the alpha-emitter 211-At as a therapeutic isotope. Among other things",
        "its 7.2 hour half life is long enough to allow for recovery and labeling",
        "but short enough to avoid long term activity in patients. Unfortunately",
        "the only practical technique for its production is to bombard a 209-Bi target with a ~29 MeV alpha beam",
        "so it is not accessible to commercial isotope production facilities",
        "which all use fixed energy proton beams. The US Department of Energy is therefore supporting the development of a \"University Isotope Network\" (UIN) to satisfy this need. Our prposoal is to retrofit the variable-energy",
        "multi-species cyclotron at the Crocker Nuclear Laboratory at the University of California Davis with an internal Bi-209 target",
        "such that we can put at least 100 uA of 29 MeV alpha particles on target without concerns about extraction efficiency. Using very conservative assumptions",
        "we are confident we will be able to produce 60 mCi of 211-At in solution in an eight hour shift",
        "which includes setup",
        "exposure",
        "and chemical recovery. This poster will cover the design of the target",
        "as well as the required chemical processing and reliability upgrades."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp051.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP052",
      "title": "Recent Progress in R&D for Ionetix Ion-12SC Superconducting Cyclotron for Production of Medical Isotopes",
      "authors": [
        "X. Wu",
        "G.F. Blosser",
        "G.S. Horner",
        "Z.S. Neville",
        "J.M. Paquette",
        "N.R. Usher",
        "J.J. Vincent",
        "Ionetix",
        "Lansing",
        "Michigan",
        "USA",
        "NSCL",
        "East Lansing",
        "Michigan",
        "USA",
        "The Ion-12SC is a sub-compact",
        "12.5 MeV proton su-perconducting isochronous cyclotron for commercial medical isotope production recently developed at Ionetix Corporation [1]. The machine features a patented cold steel and cryogen-free conduction cooling magnet",
        "a low power internal cold-cathode PIG ion source",
        "and an inter-nal liquid target [2]. It was initially designed to produce N-13 ammonia for dose on-demand cardiology applica-tions but can also be used to produce F-18",
        "Ga-68 and other medical isotopes widely used in Positron Emission Tomography (PET). The 1st engineering prototype was completed and commissioned in September 2015",
        "and four additional units have been completed since [3]. The first two units have been installed and operated at the University of Michigan and MIT. R&D efforts in physics and engineering have continued to improve machine performance",
        "stability and reliability. These improve-ments include: 1) Water cooling added to the dummy dee to limit the operating temperature of the ion source to improve lifetime and performance",
        "2) Magnetic field maps",
        "obtained with a Hall probe based mapper",
        "were used to accurately measure the isochronism and provide information needed to compensate for any unwanted 1st harmonics and 3) Feedback based control methods ap-plied to regulate the beam intensity on target by adjusting the ion source cathode current. The C1 unit installed at the University of Michigan Medical School early this year treated ~100 patients/month with N-13 ammonia. The machines are now capable of routinely producing > 21 doses/day with > 99% availability. The Ionetix manu-facturing facility is capable of producing up to 30 ma-chines per year."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp052.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP053",
      "title": "Tuning Quadrupoles for Brighter and Sharper Ultra-fast Electron Diffraction Imaging",
      "authors": [
        "X. Yang",
        "L. Doom",
        "M.G. Fedurin",
        "Y. Hidaka",
        "J.J. Li",
        "D. Padrazo Jr",
        "T.V. Shaftan",
        "V.V. Smalukpresenter",
        "G.M. Wang",
        "L.-H. Yu",
        "Y. Zhu",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "ShanghaiTech University",
        "Shanghai",
        "People’s Republic of China",
        "We report our proof-of-principle design and experi-mental commissioning of broadly tunable and low-cost transverse focusing lens system for MeV-energy electron beams at the ultra-fast electron diffraction (UED) beam-line of the Accelerator Test Facility II of BNL. We exper-imentally demonstrate the independent control over the size and divergence of the electron beam at the sample via tunable quadrupoles. By applying online optimiza-tion",
        "we achieve minimum beam sizes 75 µm from 1 to 13 pC",
        "two orders of magnitude higher charge density than previously achieved using conventional solenoid tech-nique. Finally",
        "we experimentally demonstrate Bragg-diffraction image (BDI) with significant improvement up to 3 times brighter and 2 times sharper BDI peaks via the optimized quadrupoles",
        "improvement larger with higher charge. The result could be crucial for the future single-shot ultra-fast electron microscope development."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp053.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPMP054",
      "title": "Superconducting Dipole Design for a Proton Computed Tomography Gantry",
      "authors": [
        "E. Oponowicz",
        "H.L. Owen",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Proton computed tomography aims to increase the accuracy of proton treatment planning by directly measuring proton stopping power. This imaging technique requires a proton beam of 330 MeV incident kinetic energy for adult patients. Employing superconducting technology in the beam delivery system allows it to be of comparable size to a conventional proton therapy gantry. A superconducting bending magnet design for a proton computed tomography gantry is proposed in this paper. The 30 deg",
        "3.9 T canted-cosine-theta dipole wound with NbTi wires is used to steer 330 MeV protons in an isocentric beam delivery system which rotates around the patient. Two methods of magnetic field shielding are compared in the context of proton therapy facility requirements; traditional passive shielding with an iron yoke placed around the magnet and an active shielding option utilising extra layers of the superconducting coil."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thpmp054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thpmp054.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thpmp054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THPMP054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 39,
  "scrape_time": "2025-10-10 19:17:21"
}