{
  "session_info": {
    "id": "MOCPR",
    "name": "MOCPR - Systems Engineering, Collaborations, and Project Management 1",
    "url": "https://proceedings.jacow.org/icalepcs2019/html/mocpr.htm"
  },
  "papers": [
    {
      "paper_id": "MOCPR01",
      "title": "Graduate Software Engineer Development Program at Diamond Light Source",
      "authors": [
        "A.A. Wilson",
        "T.M. Cobb",
        "U.K. Pedersen",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Diamond Light Source is the UK’s synchrotron facility. The support and development of the beamlines and accelerators at Diamond requires a significant quantity of specific knowledge and skills; the opportunity to acquire these beforehand is not available to many early in their career. This limits the field of candidates who can begin working independently at the level of software systems engineer. The graduate software engineer development program was started in 2015 to provide a route for engineers who are recent graduates or new to the field to develop the required skills and experience. Over the course of two years it comprises a series of projects in different groups",
        "mentored on-the-job training and organized training courses. The program has recently been expanded to cover all groups in the Scientific Software",
        "Controls and Computation department at Diamond",
        "with an intake of four new engineers per year. This paper presents the structure and development of the program and invites discussion with other organizations to share knowledge and experience."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mocpr01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mocpr01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mocpr01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOCPR01",
      "page_number": "97",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCPR02",
      "title": "The EPICS Collaboration Turns 30",
      "authors": [
        "Osprey DCS LLC",
        "Ocean City",
        "USA",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "At a time when virtually all accelerator control systems were custom developments for each individual laboratory",
        "an idea emerged from a meeting between the Los Alamos National Laboratory developers of the Ground Test Accelerator Control System and those tasked to design the control system for the Advanced Photon Source at Argonne National Laboratory. In a joint effort",
        "the GTACS toolkit concept morphed into the beginnings of a powerful toolkit for building control systems for scientific facilities. From this humble beginning the Experimental Physics and Industrial Control System (EPICS) Collaboration quickly grew. EPICS is now used as a framework for control systems for scientific facilities on seven continents. The EPICS Collaboration started from a dedicated group of developers with very different ideas. This software continues to meet the increasingly challenging requirements for new facilities. This paper is a retrospective look at the creation and evolution of a collaboration that has grown for thirty years",
        "with a look ahead to the future."
      ],
      "institutions": [],
      "abstract": "A.N. Johnsonpresenter",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mocpr02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mocpr02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mocpr02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOCPR02",
      "page_number": "101",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCPR03",
      "title": "Planning of Interventions With the Atlas Expert System",
      "authors": [
        "I. Asensi Tortajada",
        "A. Rummler",
        "C.A. Solans Sanchez",
        "CERN",
        "Geneva",
        "Switzerland",
        "Valencia University",
        "Burjassot",
        "Spain",
        "The ATLAS Technical Coordination Expert System is a tool for the simulation of the ATLAS experiment infrastructure that combines information from diverse areas such as detector control (DCS) and safety systems (DSS)",
        "gas",
        "water",
        "cooling",
        "ventilation",
        "cryogenics",
        "and electricity distribution. It allows the planning of an intervention during technical stops and maintenance periods",
        "and it is being used during the LS2 to provide an additional source of information for the planning of interventions. This contribution will describe the status of the Expert System and how it us used to provide information on the impact of an intervention based on the risk assessment models of fault tree analysis and principal component analysis."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mocpr03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mocpr03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mocpr03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOCPR03",
      "page_number": "106",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCPR04",
      "title": "Moving Beyond Bias",
      "authors": [
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "The benefits of diverse work groups have been well documented",
        "and our leaders speak of the need for our laboratories to become more diverse and inclusive. Despite these motivators",
        "the field of accelerator controls remains strikingly homogeneous. This trend continues despite many long standing programs to attract underrepresented groups to STEM careers and the explicit desire of leadership to create more inclusive organizations. Research consistently points to the strong role implicit bias plays in preventing organizations from truly providing equal opportunities. The desire to become more diverse must be coupled with a strong culture",
        "cultivated to change deeply rooted practices which influence recruiting",
        "hiring",
        "development",
        "and promotion decisions based on stereotypes rather than accomplishments and abilities. Real change in this arena requires intentional action across the board",
        "not just from human resources and underrepresented groups. This paper discusses practical approaches to changing organizational culture to enable diverse work groups to grow and thrive."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mocpr04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mocpr04.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mocpr04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOCPR04",
      "page_number": "110",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCPR05",
      "title": "CI-CD Practices with the TANGO-controls Framework in the Context of the Square Kilometre Array (SKA) Telescope Project",
      "authors": [
        "INAF - OAAB",
        "Teramo",
        "Italy",
        "D. Bartashevich",
        "J.B. Morgado",
        "D.F. Nunes",
        "GRIT",
        "Aveiro",
        "Portugal",
        "SKA Organisation",
        "Macclesfield",
        "United Kingdom",
        "K. Madisa",
        "A.J. Venter",
        "M.J.A. de Beer",
        "SARAO",
        "Cape Town",
        "South Africa",
        "ROE",
        "UTAC",
        "Edinburgh",
        "United Kingdom",
        "The Square Kilometre Array (SKA) project is an international effort to build two radio interferometers in South Africa and Australia to form one observatory monitored and controlled from the global headquarters (GHQ) in the United Kingdom. The project is very close to the end of its design phase and many decisions have already been made like the adoption of the Tango-controls framework. The time from the end of the design phases and the beginning of the construction has been called bridging with the goal of promoting CI-CD practices. CI-CD is an acronym for Continuous integration (CI) and continuous delivery and/or continuous deployment. CI is the practice of merging all developers’ local (working) copies into the mainline very often (at least daily). Continuous delivery is the approach of developing software in short cycle ensuring that it can be released anytime",
        "and continuous deployment is the approach of delivering the software frequently and automatically. The present paper analyzes the decision taken by the system team (a specialized agile team for continuous practices in the Safe framework) for promoting those practices within the Tango-controls framework."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mocpr05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mocpr05.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mocpr05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOCPR05",
      "page_number": "115",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-10 18:08:25"
}