{
  "session_info": {
    "id": "WEOBMH",
    "name": "WEOBMH - W2",
    "url": "https://proceedings.jacow.org/ECRIS2014/html/weobmh.htm"
  },
  "papers": [
    {
      "paper_id": "WEOBMH01",
      "title": "Experimental Activities with the LPSC Charge Breeder in the European Context",
      "authors": [
        "T. Lamy",
        "J. Angot",
        "T. Thuillier",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "J. Choinski",
        "L. Standylo",
        "HIL",
        "Warsaw",
        "Poland",
        "P. Delahaye",
        "L. Maunoury",
        "GANIL",
        "Caen",
        "France",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "H. A. Koivisto",
        "O.A. Tarvainen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "One of the Work Packages of the \"Enhanced Multi-Ionization of short-Lived Isotopes at EURISOL\" NuPNET project focuses on the ECR charge breeding. The LPSC charge breeder is used for experimental studies in order to better understand the fundamental processes involved in the 1+ beam capture by a 14 GHz ECR plasma. Some improvements",
        "like symmetrisation of the magnetic field at the injection side and higher pumping speed",
        "have been carried out on the PHOENIX charge breeder. The impact of these modifications on the efficiencies and charge breeding times are presented. In the same time",
        "the new LPSC 1+ source developments performed in order to ease the efficiency measurements with various elements are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/weobmh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/weobmh01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/weobmh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-WEOBMH01",
      "page_number": "120",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOBMH02",
      "title": "Study of ECRIS Scaling Laws with the Particle-in-Cell Code",
      "authors": [
        "V. Mironov",
        "S.L. Bogomolov",
        "A.A. Efremov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "ECRIS scaling laws for the magnetic field configuration have been experimentally established elsewhere by systematically varying the magnetic fields at the injection",
        "extraction",
        "radial wall and at minimum. In an attempt to clarify the reasons for such the scaling",
        "we had performed the detailed studies of the ion dynamics in ECRIS plasma with using the PIC code. With a minimal set of free parameters",
        "we are able to reproduce the main features of ECRIS operation",
        "including the dynamics with variations in the magnetic field. Details of the modeling will be given",
        "as well as some recommendations for a source improvement."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/weobmh02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/weobmh02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/weobmh02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-WEOBMH02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEOBMH03",
      "title": "Investigation on the Origin of High Energy X-Rays Observed in 3rd Generation ECRIS",
      "authors": [
        "LPSC",
        "Grenoble Cedex",
        "France",
        "The operation of third generation ECR ion source heated with 24 or 28 GHz microwave frequency shows a high energy x-ray spectrum with a characteristic temperature much higher than the one observed at the usual heating frequencies (14-18 GHz). The behaviour of the x-ray spectrum is studied based on the review of a set of data previously done at LBNL [1]. The data reviewed shows that the hot x-ray temperature scales with the ECR frequency. The experimental data is compared with the prediction of a simple model of ECR heating developed for this purpose. A formula to estimate the ECR resonance thickness is calculated. The model explains nicely the experimental x-ray temperature variation when the central magnetic field of the ECRIS is changed. It demonstrates that such a magnetic field variation does not change the electron confinement time and that the change of the x-ray spectrum temperature is due to the change of the ECR zone thickness. The only way for the model to reproduce the fact that the x-ray temperature scales with the ECR frequency is to assume that the electron confinement time scales (at least) with the ECR frequency. This result brings new credit to the theoretical prediction that the hot electron RF scattering is decreasing when the ECR frequency increases.[2",
        "3] The spatial gyrac effect",
        "which can be considered as another possible origin of the very hot x-ray produced in ECRIS is recalled for convenience in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/weobmh03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/weobmh03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/weobmh03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-WEOBMH03",
      "page_number": "127",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOBMH04",
      "title": "Theory of Cyclotron Instability of Hot Electrons in ECRIS: Origin, Manifestation, and Influence on Plasma Confinement",
      "authors": [
        "D. Mansfeld",
        "I. Izotov",
        "V. Skalyga",
        "M. Viktorov",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "Interaction between electromagnetic waves and particles in magnetoactive plasma under cyclotron resonance conditions can result in the growth of cyclotron instabilities of various kinds. Electron cyclotron instability (ECI) is a kinetic type instability",
        "which is driven by the anisotropy of the energetic electrons distribution function traps with the transverse kinetic energy relative to the magnetic field dominating over the longitudinal one. One of the most interesting manifestations of ECI is the generation of bursts of electromagnetic radiation accompanied by hot electron precipitations from the trap. Such phenomena are observed in a wide range of plasma parameters: in the magnetospheres of the Earth and planets",
        "in solar coronal loops",
        "and in laboratory magnetic traps. Recently ECI were experimentally observed in ECR ion sources and it was shown that bursts of hot electrons escaping from the trap can destruct plasma confinement affecting highly charged ions beams current [1]. In this report we discuss basic mechanisms of cyclotron instability growth in non-equilibrium plasma of ECR discharge",
        "main features of instability manifestation and its influence on ECRIS parameters."
      ],
      "institutions": [],
      "abstract": "* O Tarvainen et al 2014 Plasma Sources Sci. Technol. 23 025020",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/weobmh04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/weobmh04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/weobmh04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-WEOBMH04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:28:47"
}