{
  "session_info": {
    "id": "TUPBB",
    "name": "TUPBB - WG11- Instrumentation",
    "url": "https://proceedings.jacow.org/eefact2018/html/tupbb.htm"
  },
  "papers": [
    {
      "paper_id": "TUPBB03",
      "title": "Performance of the FCC-ee Polarimeter",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Inverse Compton scattering is the classical way to measure the electron beam polarization. Eligibility of the approach at high energy domain has been demonstrated by LEP",
        "HERA and SLD experiments. Fast measurement of beam polarization allows to apply the resonant depolarization technique for precise beam energy determination. The distinctive feature of the FCC-ee polarimeter is the registration of scattered electrons along with scattered photons. Polarimeter is designed to measure the transverse polarization of the non-colliding pilot bunch with 1 % accuracy every second. Furthermore the same apparatus allows to measure the beam energy",
        "longitudinal beam polarization (if any) and transverse beam positions/sizes at the place of installation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-ee",
      "presentation_url": "https://proceedings.jacow.org/eefact2018/talks/tupbb03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2018/papers/tupbb03.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2018/posters/tupbb03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2018-TUPBB03",
      "page_number": "157",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPBB04",
      "title": "Resonant Depolarization at Z and W at FCC-ee",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Both future 100 km in circumference electron-positron colliders CEPC and FCC-ee need know beams energies with the extreme precision of 1-2 ppm. This can be done only with the help of Resonant Depolarization (RD) technique. Still",
        "some beam parameters of these machines",
        "like energy spread and damping decrements",
        "are so high near 80 GeV per beam",
        "that it is required special consideration and tricks to overcome the difficulties. The author has written simple spin tracking code",
        "which simulates main features of the RD process in presence of continuous energy diffusion due to synchrotron radiation fluctuations. It was shown by this study",
        "that the applicability of the RD method is limited by the effect of widening of a width of the central peak of the spin precession spectrum when the synchrotron tune is chosen too low",
        "say below 0.05. In this case spin precession lost its resonant nature due to overlap of the wide central spectrum peak with nearby synchrotron side bands. Dependencies of the spectrum peaks width from various beam parameters and a new RD-procedure recipe are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-ee",
      "presentation_url": "https://proceedings.jacow.org/eefact2018/talks/tupbb04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2018/papers/tupbb04.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2018/posters/tupbb04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2018-TUPBB04",
      "page_number": "165",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPBB05",
      "title": "Beam Instrumentation at SuperKEKB",
      "authors": [
        "G.M. Mitsuka",
        "M. Arinaga",
        "J.W. Flanagan",
        "H. Fukuma",
        "H. Ikeda",
        "H. Ishii",
        "S.H. Iwabuchi",
        "K. Mori",
        "E. Mulyani",
        "M. Tejima",
        "M. Tobiyama",
        "KEK",
        "Ibaraki",
        "Japan",
        "Wayne State University",
        "Detroit",
        "Michigan",
        "USA",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "University of Hawaii",
        "Honolulu",
        "USA",
        "Phase 2 commissioning of the SuperKEKB electron-positron collider has been performed with final focus optics from February 8 to July 17",
        "2018. The main aims of Phase 2 commissioning were to verify the novel nano-beam collision scheme and achieve the machine luminosity O(1034 cm-2s-1). The beam instruments including the bunch-by-bunch feedback and orbit feedback systems",
        "which are central to the beam diagnostics at SuperKEKB",
        "were successfully operated throughout Phase 2. In this talk",
        "we will present the commissioning results focusing on beam diagnostics and show prospects for the final phase of commissioning from next spring."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-ee",
      "presentation_url": "https://proceedings.jacow.org/eefact2018/talks/tupbb05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2018/papers/tupbb05.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2018/posters/tupbb05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2018-TUPBB05",
      "page_number": "169",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPBB06",
      "title": "Fast Luminosity Monitoring for the SuperKEKB Collider (LumiBelle2 Project)",
      "authors": [
        "P. Bambade",
        "S. Di Carlo",
        "D. Jehanno",
        "V. Kubytskyi",
        "C.G. Pang",
        "Y. Peinaud",
        "LAL",
        "Orsay",
        "France",
        "Y. Funakoshi",
        "S. Uehara",
        "KEK",
        "Ibaraki",
        "Japan",
        "LumiBelle2 is a fast luminosity monitoring system prepared for SuperKEKB*. It uses sCVD diamond detectors placed in both the electron and positron rings to measure the Bhabha scattering process at vanishing scattering angle. Two types of online luminosity signals are provided",
        "a Train-Integrated-Luminosity at 1 kHz as input to the dithering feedback system used to maintain optimum overlap between the colliding beams in horizontal plane",
        "and Bunch-Integrated-Luminosities at about 1 Hz to check for variations along the bunch trains. Individual beam sizes and offsets can also be determined from collision scanning. The design of LumiBelle2 will be described and its performance during the Phase-2 commissioning of SuperKEKB will be reported."
      ],
      "institutions": [
        "Funding: - MSCA RISE E-JADE project, funded by European Commission grant number 645479 - Toshiko Yuasa France-Japan Particle Physics Laboratory (project A-RD-08)",
        "*First Tests of SuperKEKB Fast Luminosity Monitors During 2018 Phase-2 Commissioning\" ("
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2018/talks/tupbb06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2018/papers/tupbb06.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2018/posters/tupbb06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2018-TUPBB06",
      "page_number": "173",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPBB07",
      "title": "Experience with the Large Angle Beamstrahlung Monitor (LABM) at SuperKEKB",
      "authors": [
        "Wayne State University",
        "Detroit",
        "Michigan",
        "USA",
        "The LABM is a set of four telescopes pointed to the SuperKEKB Interaction Point (IP). It measures large angle beamstrahlung in the visible range",
        "providing both polarization and spectral information. The experience with the LABM during both Phase I and Phase II is reviewed. It is shown that large angle beamstrahlung has been observed",
        "and beam parameters are preliminarly extracted from the measured yields. The measurements during beam-beam controlled oscillations are also discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/eefact2018/talks/tupbb07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2018/papers/tupbb07.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2018/posters/tupbb07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2018-TUPBB07",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-11 08:36:30"
}