{
  "session_info": {
    "id": "FRAL",
    "name": "FRAL - Project Status Reports II",
    "url": "https://proceedings.jacow.org/icalepcs2021/html/fral.htm"
  },
  "papers": [
    {
      "paper_id": "FRAL01",
      "title": "The Laser MegaJoule Facility Status Report",
      "authors": [
        "CEA",
        "LE BARP cedex",
        "France",
        "The Laser MegaJoule (LMJ)",
        "the French 176-beam laser facility",
        "is located at the CEA CESTA Laboratory near Bordeaux (France). It is designed to deliver about 1.4 MJ of energy on targets",
        "for high energy density physics experiments",
        "including fusion experiments. The first bundle of 8-beams was commissioned in October 2014. By the end of 2021",
        "ten bundles of 8-beams are expected to be fully operational. In this paper",
        "we will present: - The LMJ Bundles Status report - The main evolutions of the LMJ facility since ICALEPS 2019: the new target diagnostics commissioned and a new functionality to manage final optic damage with the implementation of blockers in the beam. - the result of a major milestone for the project : ‘Fusion Milestone’"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/fral01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/fral01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/fral01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRAL01",
      "page_number": "989",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRAL02",
      "title": "DISCOS Updates",
      "authors": [
        "S. Poppi",
        "M. Buttu",
        "G. Carboni",
        "A. Fara",
        "C. Migoni",
        "INAF - OAC",
        "Selargius (CA)",
        "Italy",
        "M. De Biaggi",
        "A. Orlati",
        "S. Righini",
        "INAF - IRA",
        "Bologna",
        "Italy",
        "INAF-Osservatorio Astronomico di Brera",
        "Merate",
        "Italy",
        "INAF IRA",
        "Bologna",
        "Italy",
        "DISCOS is the control software of the Italian Radio Telescopes and it is based on the Alma Control Software. The project core started during the construction of the Sardinia Radio Telescope and it has been further developed to support also the other antennas managed by INAF",
        "which are the Noto and the Medicina antenna. Not only does DISCOS control all the telescope subsystems like servo systems",
        "backends",
        "receivers and active optic",
        "but also allows users to execute the needed observing strategies. In addition",
        "many tools and high-level applications for observers have been developed over time. Furthermore",
        "DISCOS development is following test driven methodologies",
        "which",
        "together with real hardware simulation and automated deployment",
        "speed up testing and maintenance. Altogether",
        "the status of the DISCOS project is described here with its related activities",
        "and also future plans are presented as well."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/fral02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/fral02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/fral02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRAL02",
      "page_number": "994",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRAL03",
      "title": "CERN Cryogenic Controls Today and Tomorrow",
      "authors": [
        "M. Pezzetti",
        "Ph. Gayet",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN cryogenic facilities demand a versatile",
        "distributed",
        "homogeneous and highly reliable control system. For this purpose",
        "CERN conceived and developed several frameworks (JCOP",
        "UNICOS",
        "FESA",
        "CMW)",
        "based on current industrial technologies and COTS equipment",
        "such as PC",
        "PLC and SCADA systems complying with the requested constraints. The cryogenic control system nowadays uses these frameworks and allows the joint development of supervision and control layers by defining a common structure for specifications and code documentation. Such a system is capable of sharing control variable from all accelerator apparatus. The first implementation of this control architecture started in 2000 for the Large Hadron Collider (LHC). Since then CERN continued developing the hardware and software components of the cryogenic control system",
        "based on the exploitation of the experience gained. These developments are always aimed to increase the safety and to improve the performance. The final part will present the evolution of the cryogenic control toward an integrated control system SOA based CERN using the Reference Architectural Model Industrie 4.0 (RAMI 4.0)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/fral03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/fral03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/fral03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRAL03",
      "page_number": "997",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRAL04",
      "title": "The Control System of the New Small Wheel Electronics for the Atlas Experiment",
      "authors": [
        "NTUA",
        "Athens",
        "Greece",
        "The present ATLAS Small Wheel Muon detector will be replaced with a New Small Wheel(NSW) detector in order to cope up with the future LHC runs of high luminosity. One crucial part of the integration procedure concerns the validation of the electronics for a system with more than 2.1 M electronic channels. The readout chain is based on optical link technology connecting the backend to the front-end electronics via the FELIX",
        "which is a newly developed system that will serve as the next generation readout driver for ATLAS. For the configuration",
        "calibration and monitoring path the various electronics boards are supplied with the GBT-SCA ASIC and its purpose is to distribute control and monitoring signals to the electronics. Due to its complexity",
        "NSW electronics requires the development of a sophisticated Control System. The use of such a system is necessary to allow the electronics to function consistently",
        "safely and as a seamless interface to all sub-detectors and the technical infrastructure of the experiment. The central system handles the transition between the probe’s possible operating states while ensuring continuous monitoring and archiving of the system’s operating parameters."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/fral04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/fral04.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/fral04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRAL04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRAL05",
      "title": "MACE Camera Electronics: Control, Monitoring & Safety Mechanisms",
      "authors": [
        "S.K. Neema",
        "A. Behere",
        "S. Joy",
        "S. Mohanan",
        "P. Sridharan",
        "S. Srivastava",
        "BARC",
        "Trombay",
        "Mumbai",
        "India",
        "Bhabha Atomic Research Centre (BARC)",
        "Mumbai",
        "India",
        "*MACE camera controller embedded software: Redesign for robustness and maintainability",
        "S.Srivastava et.al.",
        "Astronomy and Computing Volume 30"
      ],
      "institutions": [],
      "abstract": "MACE Telescope installed in Ladakh Region of India comprises of many functionally diverse subsystems, Camera being the most important one. Mounted at the focal plane of 21 m diameter parabolic reflector dish, event driven Camera system comprises of 1088 PMTs, with 16 PMTs constituting one Camera Integrated Module (CIM). Central Camera Controller (CCC), located in Camera housing, manages and coordinates all the actions of these 68 Modules and other camera subsystems as per the command sequence received from Operator Console. In addition to control and monitoring of subsystems, various mechanisms have been implemented in hardware as well as embedded firmware of CCC and CIM to provide safety of PMTs against exposure to ambient bright light, bright star masking and detection and recovery from loss of event synchronization at runtime. An adequate command response protocol with fault tolerant behavior has also been designed to meet performance requirements. The paper presents the overall architecture and flow of camera control mechanisms with a focus on software and hardware challenges involved. Various experimental performance parameters and results will be presented.",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/fral05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/fral05.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/fral05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRAL05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-10 18:07:36"
}