{
  "session_info": {
    "id": "WEOXA",
    "name": "WEOXA - Applications",
    "url": "https://proceedings.jacow.org/hiat2018/html/weoxa.htm"
  },
  "papers": [
    {
      "paper_id": "WEOXA01",
      "title": "The Dc130 Project: New Multipurpose Applied Science Facility for FLNR",
      "authors": [
        "S.V. Mitrofanov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "B. Gikal",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "N.Yu. Kazarinov",
        "V. Mironov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The main activities of Flerov Laboratory of Nuclear Reactions",
        "following its name - are related to fundamental science",
        "but",
        "in parallel",
        "plenty of efforts are paid for practical applications. Certain amount of beam time every year is spent for applied science experiments on FLNR accelerator complex. For the moment",
        "the main directions are: the production of the heterogeneousμ- and nano-structured materials; testing of electronic components (avionics and space electronics) for radiation hardness; ion-implantation nanotechnology and radiation materials science. Basing on FLNR long term experience in these fields and aiming to improve the instrumentation",
        "the accelerator department start the Design Study for new cyclotron DC130 which will be dedicated machine for applied researches in FLNR. Following the user’s requirements DC130 should accelerate the heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The first outlook of DC130 parameters",
        "its features",
        "layout of its casemate and general overview of the new FLNR facility for applied science will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hiat2018/talks/weoxa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hiat2018/papers/weoxa01.pdf",
      "poster_url": "https://proceedings.jacow.org/hiat2018/posters/weoxa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2018-WEOXA01",
      "page_number": "122",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:37:17"
}