{
  "session_info": {
    "id": "MOOCB",
    "name": "MOOCB - Contributed Oral Presentations, Alternative Acceleration Schemes",
    "url": "https://proceedings.jacow.org/PAC2013/html/moocb.htm"
  },
  "papers": [
    {
      "paper_id": "MOOCB1",
      "title": "Generation of Monoenergetic Protons by Laser Acceleration of Multi-Ion Foils with Polarization Switch",
      "authors": [
        "T.-C. Liu",
        "C.-S. Liu",
        "X. Shao",
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "NCU",
        "Chung Li",
        "Taiwan",
        "Ruhr-Universität Bochum",
        "Bochum",
        "Germany",
        "IAMS",
        "Taipei",
        "Taiwan",
        "Laser radiation pressure acceleration is considered as an effective method in obtaining high energy quasi-monoenergetic ions. By irradiating a laser beam on a multi-species target made of carbon and hydrogen",
        "the proton layer can be accelerated ahead of the carbon ion layer due to a higher charge-to-mass ratio. And the shielded Coulomb repulsion provided by the left-behind electron-carbon layer can not only further accelerate the proton layer",
        "but also stabilize it for a long time. The acceleration time of quasi-monoenergetic protons by the combined mechanisms is extended over ten times longer compared to the case of applying single-species targets and using radiation pressure acceleration alone. 60 MeV of quasi-monoenergetic protons from a multi-species foil with input laser power of 70 TW is obtained",
        "which is at least five times greater than the energy obtainable from pure hydrogen targets. To further increase the efficiency",
        "we achieve an improvement of 30 percent energy enhancement by introducing a polarization switch in the laser profile. An analytical approach to interpret and optimize the results is also studied."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/moocb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/moocb1.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/moocb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOOCB1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOOCB2",
      "title": "Modeling Underdense Plasma Photocathode Experiments",
      "authors": [
        "CIPS",
        "Boulder",
        "Colorado",
        "USA",
        "G. Andonian",
        "J.B. Rosenzweig",
        "Y. Xi",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "Tech-X",
        "Boulder",
        "Colorado",
        "USA",
        "Uni HH",
        "Hamburg",
        "Germany",
        "The underdense plasma photocathode concept (aka Trojan horse) *",
        "** is a promising approach to achieving fs-scale electron bunches with pC-scale charge and transverse normalized emittance below 0.01 mm-mrad",
        "yielding peak currents of order 100 A and beam brightness as high as 1019 A/(m rad)2",
        "for a wide range of achievable beam energies up to 10 GeV. A proof-of-principle experiment will be conducted at the FACET user facility in early 2014. We present 2D and 3D simulations with physical parameters relevant to the planned experiment.",
        "* Hidding et al.",
        "PRL 108:035001 (2012). ** Xi et al.",
        "PRST-AB 16:031303 (2013)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/moocb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/moocb2.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/moocb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOOCB2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 01:30:31"
}