{
  "session_info": {
    "id": "THAO",
    "name": "THAO - Status reports and new development IV",
    "url": "https://proceedings.jacow.org/ecris2016/html/thao.htm"
  },
  "papers": [
    {
      "paper_id": "THAO01",
      "title": "Recent production of intense high charge ion beams with VENUS",
      "authors": [
        "D. Xie",
        "J.Y. Benitez",
        "C.M. Lyneis",
        "D.S. Todd",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Several modifications have been made to the VENUS to enhance its performance at high microwave power and bring its performance closer to the levels predicted by scaling laws for 28 GHz operation. Two of these modifications improved its tolerance for operation at microwave power up to 10 kW. The cooling scheme on the plasma wall was improved to eliminate damage caused by localized electron heating. Similarly the extraction electrode was redesigned to transport away the electron heating more effectively. The third modification reduced the waveguide diameter",
        "which launches the 28 GHz power into the plasma chamber. The source now runs efficiently at 10 kW of injected power with a more favorable magnetic field configuration. The production of intense highly charged ion beams with VENUS has been substantially enhanced. It has produced a number of record CW beams: 4.5 emA of O6+",
        "0.40 emA of Ar16+ and 0.06 emA of Ar17+ and for the first time the VENUS has produced more than 1 emA of Ar12+ and O7+. Source tuning is currently underway to explore the potential of VENUS and the overall improved source performance will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/thao01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/thao01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/thao01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-THAO01",
      "page_number": "142",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAO02",
      "title": "Development Status of 28 GHz Superconducting ECR Ion Source for the KBSI Accelerator",
      "authors": [
        "S. Choi",
        "J. Bahng",
        "J.G. Hong",
        "S.J. Kim",
        "B.S. Lee",
        "J.W. Ok",
        "J.Y. Park",
        "M. Won",
        "J.H. Yoon",
        "Korea Basic Science Institute",
        "Busan",
        "Republic of Korea",
        "A 28 GHz superconducting ECR ion source has been developed as an injector apparatus for heavy ion accelerator of KBSI. The final goal of accelerated ion beam was aimed to generate fast neutrons with the proton target by p(Li",
        "n)Be reaction under inverse kinematics scheme. In 2014",
        "most of parts for ECR ion source was developed and assembled. We have made the first ECR plasma generation and ion beam extraction",
        "which was reported in 2014. For optimizing the operational issues of ECR ion source",
        "we carried out various experiments with respect to several species of ion beam. Recently",
        "we have encountered to maintain the cryogenics for superconudcting magnet due to the operating time of cryocooler and compressor. We modified three parts during maintanance: (1) installation of iron pole in the hexapole magnet to enhance the radial magnetic field",
        "(2)new recondensation device to increase the efficiency of the liquid helium liquification",
        "(3)bias disk modification for better beam extraction. We will present the current status and further modificaion effect on the 28 GHz superconducting ECR ion source of KBSI."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/thao02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/thao02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/thao02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-THAO02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 17:28:02"
}