{
  "session_info": {
    "id": "THOBA",
    "name": "THOBA - Contributed Oral Presentations, Accelerator Technology",
    "url": "https://proceedings.jacow.org/PAC2013/html/thoba.htm"
  },
  "papers": [
    {
      "paper_id": "THOBA1",
      "title": "High-Gradient Metallic Photonic Band-Gap (PBG) Structure Breakdown Testing At 17 GHz",
      "authors": [
        "B.J. Munroe",
        "M.A. Shapiro",
        "R.J. Temkin",
        "MIT/PSFC",
        "Cambridge",
        "Massachusetts",
        "USA",
        "Photonic Band-gap (PBG) structures continue to be a promising area of research for future accelerator structures. Previous experiments at X-Band have demonstrated that PBG structures can operate at high gradient and low breakdown probability",
        "provided that pulsed heating is controlled. A metallic single-cell standing-wave structure has been constructed at MIT to investigate breakdown performance of PBG structures with very high surface temperature rise. The MIT standing-wave structure test stand has an available power of 4 MW for a maximum gradient of 130 MV/m; the actual realized gradient may be lower due to breakdown limitations. The MIT test stand will also utilize novel diagnostics",
        "including fast camera imaging and optical spectroscopy of breakdowns."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thoba1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thoba1.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thoba1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THOBA1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THOBA2",
      "title": "First Cavity Results from the Cornell SRF Group's Nb3Sn Program",
      "authors": [
        "S. Posen",
        "M. Liepe",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "As an alternative material for SRF accelerator cavities",
        "Nb3Sn presents two important benefits. Its large Tc gives it a very small surface resistance",
        "leading to a huge reduction in cooling costs; and its predicted Hsh of nearly 400 mT would allow for very high gradients and therefore fewer cavities in high energy linacs. Researchers in the Cornell SRF group have recently fabricated two 1.3 GHz cavities coated with Nb3Sn. Testing of these first cavities has produced encouraging results",
        "including a very high Tc and some very high performing regions. These cavity results as well as new sample results under TEM will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thoba2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thoba2.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thoba2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THOBA2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THOBA3",
      "title": "Completion of the First SSR1 Cavity for PXIE and First Jacketed Tests",
      "authors": [
        "Fermilab",
        "Batavia",
        "USA"
      ],
      "institutions": [],
      "abstract": "Fermilab is in the process of constructing a proton linac to accelerate a 1 mA CW beam up to 30 MeV to serve as a test beam for the Project X Injector Experiment (PXIE). The major goals of PXIE are the validation of the Project X concept and mitigation of technical risks. The SSR1 cryomodule comprises the last portion of PXIE and contains 8 SSR1 cavities operating at 325 MHz with an optimal beta of 0.22. In this paper we present the lessons learned from the completion of the first cavity including the welding operations necessary to install the Nb-SST transition ring and the SST helium jacket. The results of various tests on the jacketed resonator are also presented.",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thoba3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thoba3.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thoba3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THOBA3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THOBA4",
      "title": "Development of Yb Laser For High Power Ultra-Short Pulse",
      "authors": [
        "Y. Matsumura",
        "K. Koyama",
        "University of Tokyo",
        "Tokyo",
        "Japan",
        "The University of Tokyo",
        "Nuclear Professional School",
        "Ibaraki-ken",
        "Japan",
        "M. Yoshida",
        "X. Zhou",
        "KEK",
        "Ibaraki",
        "Japan",
        "Passively mode-locked Yb lasers can easily generate femtosecond pulse at high repetition rate. The Yb lasers also have a property of high efficiency",
        "which enables us to obtain high power laser. Because of these characteristics",
        "the Yb lasers have been applied to many fields such as optical frequency comb and X-ray generation. Now",
        "femtosecond pulse of much higher energy at high repetition rate is being required for dielectric laser accelerator (DLA) and lasertron. We have developed high power mode-locked Yb laser",
        "and achieved 20W mode-locked Yb fiber laser amplification system at repetition rate of 62MHz. At the conference",
        "our latest results will be reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thoba4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thoba4.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thoba4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THOBA4",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-11 01:49:34"
}