{
  "session_info": {
    "id": "TUOXGD",
    "name": "TUOXGD - Contributed Orals: Beam Instrumentation, Controls, Feedback and Op. Aspects",
    "url": "https://proceedings.jacow.org/ipac2022/html/tuoxgd.htm"
  },
  "papers": [
    {
      "paper_id": "TUOXGD1",
      "title": "Design and Construction of Optical System of the Coronagraph for Beam Halo Observation in the SuperKEKB",
      "authors": [
        "G. Mitsuka",
        "H. Ikeda",
        "T.M. Mitsuhashi",
        "KEK",
        "Ibaraki",
        "Japan",
        "For the observation of beam halo",
        "the coronagraph is designed and constructed in the SuperKEKB. The coronagraph has three stages of optical systems",
        "objective system",
        "re-diffraction system and relay system. Since the SR monitor of SuperKEKB has a long optical path (60 m)",
        "we need an objective system with long focal length. The Aperture limit is determined by the diamond mirror which is set in 23.6 m from the source point. Therefore",
        "we must assign this aperture for the entrance pupil of the objective system. For satisfying these conditions",
        "we design a reflective telephoto system based on the Gregorian telescope for the objective system. The focal length is designed to 7028 mm. and front principal point position is designed to the position of diamond mirror. The result of construction",
        "the performance of the objective system has a diffraction limited quality. The re-diffraction system and relay system are also designed based on Kepler type telescope. The result of optical testing using the beam in the HER",
        "we achieved a contrast of 6 order magnitude. Some early result for the observation of beam halo in the HER will also present in this presentation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/tuoxgd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/tuoxgd1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/tuoxgd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-TUOXGD1",
      "page_number": "769",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOXGD2",
      "title": "Wireless IoT in Particle Accelerators: A Proof of Concept with the IoT Radiation Monitor at CERN",
      "authors": [
        "S. Danzeca",
        "A.J. Cass",
        "A. Masi",
        "R. Sierra",
        "A. Zimmaro",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The Internet of Things (IoT) is an ecosystem of web-enabled \"smart devices\" that integrates sensors and communication hardware to collect",
        "send and act on data acquired from the surrounding environment. Use of the IoT in particle accelerators is not new",
        "with accelerator systems long having been connected to the network to retrieve",
        "send and analyse data. What has been missing is the IoT concept of \"smart devices\" and above all wireless connectivity. We report here on the advantages of using a particular IoT technology",
        "LoRa",
        "for the deployment of wireless radiation monitors within the CERN particle accelerator complex. IoT Radiation Monitors have been developed as a result of growing demand for radiation measurements where standard infrastructure is not available. As a radiation-tolerant device",
        "the IoT Radiation Monitor is a powerful \"eye\" for observing the real-time radiation levels in the CERN accelerators. We describe here the technologies used for the project and the various advantages their deployment offers in a particle accelerator environment. This opens up the possibility for the deployment of heterogeneous implementations that would otherwise have been impractical."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/tuoxgd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/tuoxgd2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/tuoxgd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-TUOXGD2",
      "page_number": "772",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOXGD3",
      "title": "D Phase Space Diagnostics Based on Adaptively Tuned Physics-Informed Generative Convolutional Neural Networks",
      "authors": [
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "UCLA",
        "Los Angeles",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "A physics-informed generative convolutional neural network (CNN)-based 6D phase space diagnostic is presented which generates all 15 unique 2D projections (x",
        "y)",
        "(x",
        "y’)",
        "…",
        "(z",
        "E) of a charged particle beam’s 6D phase space (x",
        "y",
        "z",
        "x’",
        "y’",
        "E)*. The CNN is trained by supervised learning over a wide range of input beam distributions",
        "accelerator parameters",
        "and the associated 6D beam phase spaces at multiple accelerator locations. The CNN is applied in an un-supervised adaptive manner without knowledge of the input beam distribution or accelerator parameters and is robust to their unknown time variation. Adaptive feedback automatically tunes the low-dimensional latent space of the encoder-decoder CNN to predict the 6D phase space based only on 2D (z",
        "E) longitudinal phase space measurements from a device such as a transverse deflecting RF cavity (TCAV). This method has the potential to provide diagnostics beyond the existing state of the art at many accelerator facilities. Studies are presented for two very different accelerators: the 5-meter-long ultra-fast electron diffraction (UED) HiRES compact accelerator at LBNL and the kilometer long plasma wakefield accelerator FACET-II at SLAC."
      ],
      "institutions": [],
      "abstract": "F.W. Cropp Vpresenter *A. Scheinker. \"Adaptive machine learning for time-varying systems: low dimensional latent space tuning.\" Journal of Instrumentation 16.10, 2021: P10008. https://doi.org/10.1088/1748-0221/16/10/P10008",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/tuoxgd3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/tuoxgd3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/tuoxgd3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-TUOXGD3",
      "page_number": "776",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 18:36:27"
}