{
  "session_info": {
    "id": "MOYA",
    "name": "MOYA - Facility II",
    "url": "https://proceedings.jacow.org/srf2017/html/moya.htm"
  },
  "papers": [
    {
      "paper_id": "MOYA01",
      "title": "The Superconducting Accelerator for the ESS Project",
      "authors": [
        "F. Schlander",
        "C. Darve",
        "N. Elias",
        "M. Lindroos",
        "C.G. Maiano",
        "ESS",
        "Lund",
        "Sweden",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "IPN",
        "Orsay",
        "France",
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "The European Spallation Source",
        "ESS",
        "is under construction in Lund since 2014. While the installation of the source and the normal conducting part will start in this autumn",
        "the production and testing of cryomodules and cavities for the superconducting accelerator is in full swing at the partner laboratories. The spoke cavities and cryomodules will be provided by IPN Orsay and the testing of those modules will take place at Uppsala University. Prototyping and assembly of the elliptical cryomodules series is occurring at CEA Saclay",
        "and the modules will be tested at a new test stand at ESS. The fabrication and test of the medium beta cavities is provided by INFN Milan and STFC Daresbury for the high beta cavities respectively. An overview of the current activities and test results will be presented in this talk."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/moya01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/moya01.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/moya01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-MOYA01",
      "page_number": "24",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOYA02",
      "title": "BESSY VSR: SRF Challenges and Developments for a Variable-pulse Length Next-generation Light Source",
      "authors": [
        "A.V. Vélez",
        "H.-W. Glock",
        "F. Glöckner",
        "B.D.S. Hall",
        "J. Knobloch",
        "A. Neumann",
        "P. Schnizer",
        "E. Sharples",
        "HZB",
        "Berlin",
        "Germany",
        "Helmholtz-Zentrum Berlin für Materialien und Energie GmbH (HZB)",
        "Berlin",
        "Germany",
        "The BESSY VSR project represents an exciting alternative to diffraction limited storage rings in the development of a next generation light source. Such a system should be capable to store \"standard\" (some 10 ps long) and \"short\" (ps and sub-ps long) pulses simultaneously in the storage ring opening the door to picosecond dynamic and high-resolution experiments at the same facility. This unique feature can be created by the introduction of the beating effects produced by higher harmonic SRF cavity systems (1.5 GHz & 1.75 GHz). The challenging design specifications as well as the technological demands on the SRF system make BESSY VSR a defiant project where non-standard techniques such as waveguide-damped cavities have been further developed. This talk focuses on the new SRF developments that includes wveguide-damped cavities",
        "high-power couplers and higher-order mode absorbers that must handle nearly 2 kW of HOM power. The cryomodule design and its interaction with the beam will also be discussed."
      ],
      "institutions": [],
      "abstract": "Comment: VSR concept was introduced at SRF15. Much development work has now been done. Here the focus is more one the technology of VSR and the talk could also be listed under \"SRF technology R&D\"",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/moya02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/moya02.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/moya02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-MOYA02",
      "page_number": "29",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOYA03",
      "title": "Progress of the RAON",
      "authors": [
        "D. Jeon",
        "B.H. Choi",
        "C. Choi",
        "J.W. Choi",
        "C.O. Choi",
        "S. Choi",
        "I. Chun",
        "I.S. Hong",
        "M.O. Hyun",
        "H. Jang",
        "H.M. Jang",
        "J.-H. Jang",
        "S.C. Jeong",
        "H. Jin",
        "Y.W. Jo",
        "J. Joo",
        "M.J. Joung",
        "H.C. Jung",
        "I.I. Jung",
        "Y. Jung",
        "J. Kang",
        "D.G. Kim",
        "H. Kim",
        "H.J. Kim",
        "J.H. Kim",
        "J.-W. Kim",
        "W.K. Kim",
        "Y. Kim",
        "Y.K. Kwon",
        "D.Y. Lee",
        "J. Lee",
        "K.W. Lee",
        "M. Lee",
        "S. Lee",
        "S. Lee",
        "S.H. Nam",
        "B.-S. Park",
        "M.J. Park",
        "K.T. Seol",
        "I. Shin",
        "J.H. Shin",
        "C.W. Son",
        "K.T. Son",
        "S.W. Yoon",
        "A. Zaghloul",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "Construction of the RAON heavy ion accelerator facility is in-progress in Korea. The driver linac is a superconducting linac with 200 MeV/u for uranium beam and 400 kW beam power. Prototyping of major components and their tests are proceeding including superconducting cavities",
        "superconducting magnets and cryomodules. December 2016",
        "the RFQ accelerated oxygen beam. Status report of the RAON accelerator systems is presented."
      ],
      "institutions": [
        "Funding: This work was supported by the Institute for Basic Science funded by the Ministry of Science, ICT and Future Planning (MSIP) and the National Research Foundation (NRF) under Contract 2013M7A1A1075764"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/moya03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/moya03.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/moya03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-MOYA03",
      "page_number": "36",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOYA04",
      "title": "Set of RF Parameters for the FCC-ee Machines",
      "authors": [
        "O. Brunner",
        "N. Schwergpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "The FCC-ee RF system must handle beams at different energies and beam intensities ranging from the high energy case of a few mA at 175 GeV to the heavily beam loaded situation at 1.45 A and 45.5 GeV. Higher order mode power will be a major issue at the highest beam intensities. A conceptual design of the FCC RF system is proposed along with highlights of specific R&D topics to reach the design performance. Challenges related to RF structure design",
        "RF powering and higher order modes are addressed. Breakeven point between bulk Nb and Nb/Cu technologies are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/moya04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/moya04.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/moya04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-MOYA04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOYA05",
      "title": "SRF Technology for PIP-II and III",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Proton Improvement Plan-II (PIP-II) is an 800 MeV SRF LINAC Fermilab will build as part of a critical upgrade to the accelerator complex required to serve LBNF/DUNE. The LINAC is a CW capable SRF machine designed to accelerate H− ions with 2 mA average beam current to 800 MeV which will be transported to the existing Booster and Main Injector accelerators. In combination",
        "these accelerators will deliver 120 GeV beam with 1.2 MW beam power to the LBNF target. The PIP-II SRF LINAC is constructed of five cryomodule types starting with a CW 162.5 MHz",
        "β=0.11 half-wave which leads to a β=0.22 and β=0.47 325 MHz single spokes",
        "and concludes with β=0.61 and β=0.92 650 MHz elliptical types. In the future",
        "the PIP-II LINAC will be the front end of PIP-III which will deliver multi-megawatt beam power to DUNE via the Main Injector. The SRF alternative for PIP-III is an SRF LINAC extended from 800MeV to 8 GeV which will inject beam into the Main Injector. This presentation focuses on the five PIP-II cryomodules and the development of critical ancillary components. In several cases",
        "contributions from the India DAE and other International Collaborators are highlighted."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/moya05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/moya05.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/moya05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-MOYA05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-11 03:32:35"
}