{
  "session_info": {
    "id": "MOOCB",
    "name": "MOOCB - Contributed Oral Presentations, Beam Instrumentation and Feedback",
    "url": "https://proceedings.jacow.org/IPAC2014/html/moocb.htm"
  },
  "papers": [
    {
      "paper_id": "MOOCB01",
      "title": "Beam-induced Quench Tests of LHC Magnets",
      "authors": [
        "M. Sapinski",
        "B. Auchmann",
        "T. Bär",
        "W. Bartmann",
        "M. Bednarek",
        "S. Bozyigit",
        "C. Bracco",
        "R. Bruce",
        "F. Cerutti",
        "V. Chetvertkova",
        "K. Dahlerup-Petersen",
        "B. Dehningpresenter",
        "E. Effinger",
        "J. Emery",
        "A. Guerrero",
        "E.B. Holzer",
        "W. Höfle",
        "A. Lechner",
        "A. Priebe",
        "S. Redaelli",
        "B. Salvachua",
        "R. Schmidt",
        "N.V. Shetty",
        "A.P. Siemko",
        "E. Skordis",
        "M. Solfaroli Camillocci",
        "J. Steckert",
        "J.A. Uythoven",
        "D. Valuch",
        "A.P. Verweij",
        "J. Wenninger",
        "D. Wollmann",
        "M. Zerlauth",
        "E.N. del Busto",
        "CERN",
        "Geneva",
        "Switzerland",
        "At the end of the LHC Run1 a 48-hour quench-test campaign took place to investigate the quench levels of superconducting magnets for loss durations from nanoseconds to tens of seconds. The longitudinal losses produced extended from one meter to hundreds of meters and the number of lost protons varied from 108 to 1013. The results of these and other",
        "previously conducted quench experiments",
        "allow the quench levels of several types of LHC magnets under various loss conditions to be assessed. The quench levels are expected to limit LHC performance in the case of steady-state losses in the interaction regions and also in the case of fast losses initiated by dust particles all around the ring. It is therefore required to accurately adjust beam loss abort thresholds in order to maximize the operation time. A detailed discussion of these quench test results and a proposal for additional tests after the LHC restart is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/moocb01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/moocb01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/moocb01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-MOOCB01",
      "page_number": "52",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOCB02",
      "title": "A Common Operation Metrics for Third Generation Light Sources",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "DESY",
        "Hamburg",
        "Germany",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "CELLS-ALBA Synchrotron",
        "Cerdanyola del Vallès",
        "Spain"
      ],
      "institutions": [],
      "abstract": "High reliability is a very important goal for third generation light sources. Very often the beam availability is used as the operation metrics to measure the reliability of the accelerator. A survey at several light sources revealed that the calculation of this statistics varies significantly between facilities. This prevents a useful comparison of their reliabilities. The authors propose a specific metrics for the reliability of third generation light sources; a metrics that will allow a detailed and meaningful comparison of these particle accelerators.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/moocb02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/moocb02.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/moocb02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-MOOCB02",
      "page_number": "56",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOCB03",
      "title": "The New LCLS-II Controls System Overview",
      "authors": [
        "H. Shoaee",
        "M. Boyes",
        "P. Krejcikpresenter",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The new LCLS-II facility at the SLAC National Accelerator Laboratory is a significant addition to the LCLS-I FEL",
        "designed to dramatically decrease data acquisition time by providing high repetition rate over a broad energy range. The new design consisting of a CW superconducting linac with bunch repetition rates of up to one MHz and beam power of several hundred kilowatts requires major enhancements to the LCLS-I controls system. LCLS-II will retain the system architecture based on EPICS while implementing additional technologies to meet the new requirements. This includes new designs for SC LLRF",
        "timing system to allow MHz operation",
        "data acquisition electronics for the beam position monitors and other beam diagnostic systems",
        "and a new beam-based feedback facility. The high beam rate and power also necessitate faster beam abort mechanisms",
        "requiring enhanced machine and personnel protection systems as well as a new radiation containment system. This paper will present an overview of the LCLS-II controls and discuss the design status of the critical systems including the development of a general purpose electronic system to serve as a common platform for several applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/moocb03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/moocb03.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/moocb03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-MOOCB03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 20:36:51"
}