{
  "session_info": {
    "id": "THYA",
    "name": "THYA - Invited Oral Presentation, Beam Dynamics and Electromagnetic Fields",
    "url": "https://proceedings.jacow.org/IPAC2014/html/thya.htm"
  },
  "papers": [
    {
      "paper_id": "THYA01",
      "title": "Control and Application of Beam Microbunching in High Brightness Linac-driven Free Electron Lasers",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The remarkable properties of coherent radiation from free-electron lasers (FELs) are due to the current modulation in the beam with the modulation period equal to the radiation wavelength. This modulation is developed as a result of a beam instability when the beam propagates in a long FEL undulator",
        "and requires a beam with a high-peak current",
        "small emittance and a small energy spread. Unfortunately the same beam qualities make it a subject to a so-called microbunching instability at a much longer scale than the radiation wavelength. It is driven by the space charge and CSR impedances in the machine and develops during the beam acceleration in the linac",
        "compression",
        "and transport to the undulator. If not controlled",
        "the microbunching instability influences dramatically the FEL performance and in the worst case can even ruin the lasing. In the presentation we will review the mechanism behind the microbunching instability",
        "the suppression methods used in existing facilities as well as possible future developments and concepts."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/thya01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/thya01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/thya01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-THYA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 20:48:10"
}