{
  "session_info": {
    "id": "FRCA",
    "name": "FRCA - Contributed Oral: Data Acquisitions 1",
    "url": "https://proceedings.jacow.org/pcapac2018/html/frca.htm"
  },
  "papers": [
    {
      "paper_id": "FRCA1",
      "title": "New Collaborative Approach to Scientific Data Management with NOVA",
      "authors": [
        "W. Mexner",
        "E. Bründermann",
        "M. Caselle",
        "S. Funkner",
        "A. Kopmann",
        "G. Niehues",
        "N. Tan Jerome",
        "M. Vogelgesang",
        "KIT",
        "Eggenstein-Leopoldshafen",
        "Germany",
        "Accelerator physics studies at the storage ring KARA at KIT produce terabytes of diagnostics data per day",
        "which is recorded once and then reused on a long-term basis to answer different research questions at KIT. Finally",
        "raw data and intermediate analysis results should be published along with scientific results. Thus storing from the very beginning the data of all analysis steps and its metadata in a central portal would be very beneficial. Similar requirements exist for synchrotron X-rayμtomography at the KIT imaging cluster and there is an interest to share the large data analysis effort. By using a new collaborative approach",
        "the NOVA project aims to create tools",
        "to enable an efficient use of valuable beam time. Forμtomography beamlines the project will build up a comprehensive database of various demonstrator organisms up for the morphological analysis of animals. The NOVA portal is integrated in the local data handling procedures and the datasets automatically appear in the NOVA portal as they are recorded. For both applications",
        "accelerator diagnostics and X-ray tomography",
        "the NOVA portal will offer new collaborative tools to enable synergetic data analysis."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frca1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frca1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frca1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCA1",
      "page_number": "224",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCA2",
      "title": "Development of a Task-Oriented Chatbot Application for Monitoring Taiwan Photon Source Front-End System",
      "authors": [
        "Y.Z. Lin",
        "C.-C. Chang",
        "Y.T. Cheng",
        "J.-Y. Chuang",
        "H.P. Hsueh",
        "C.H. Huang",
        "I.C. Sheng",
        "Y.C. Yang",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "In this study",
        "we propose a task-oriented chatbot application as an interactive user interface for monitoring Taiwan Photon Source front-end system. This application can get specific information faster and improve the efficiency of the maintenance engineer’s definition of fault information when a fault occurs. The chatbot uses LINE’s Message API to provide services",
        "and obtains information and status of the front-end system over EPICS protocol",
        "responding to users’ needs",
        "like a virtual assistant. At present",
        "the application can obtain the front-end system information already in operation of Taiwan Photon Source",
        "including x-ray beam position monitor",
        "safety interlock system",
        "front-end valve status",
        "vacuum status…etc. However",
        "in addition to the passive provision of information",
        "this program has a fault warning function",
        "and will actively transmit fault information to relevant personnel when a problem occurs in the safety interlock system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frca2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frca2.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frca2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCA2",
      "page_number": "228",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 02:02:51"
}