{
  "session_info": {
    "id": "TUPAK",
    "name": "TUPAK - MC4 Poster Session",
    "url": "https://proceedings.jacow.org/ipac2018/html/tupak.htm"
  },
  "papers": [
    {
      "paper_id": "TUPAK001",
      "title": "Progress of the Modulated 325 MHz Ladder RFQ",
      "authors": [
        "M. Schuett",
        "U. Ratzinger",
        "M. Syha",
        "IAP",
        "Frankfurt am Main",
        "Germany"
      ],
      "institutions": [],
      "abstract": "Based on the positive results of the unmodulated 325 MHz Ladder-RFQ prototype from 2013 to 2016, we developed and designed a modulated 3.3 m Ladder-RFQ*. The unmodulated Ladder-RFQ features a very constant voltage along the axis. It accepted 3 times the operating power of which is needed in operation**. That level corresponds to a Kilpatrick factor of 3.1 with a pulse length of 200 μs. The 325 MHz RFQ is designed to accelerate protons from 95 keV to 3.0 MeV according to the design parameters of the proton linac within the FAIR project. This particular high frequency creates difficulties for a 4-ROD type RFQ, which triggered the development of a Ladder RFQ with its high symmetry. The results of the unmodulated prototype have shown, that the Ladder-RFQ is a suitable candidate for that frequency. The duty cycle is suitable up to 5%. The basic design and tendering of the RFQ has been successfully completed in 2016. Manufacturing will be completed in May 2018. We will show the latest results of manufacturing, beam dynamics simulations for the matching between LEBT and RFQ. *Journal of Physics: Conf. Series 874 (2017) 012048 **Proceedings of",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak001.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK001",
      "page_number": "952",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK002",
      "title": "Advanced Approach for Beam Matching along the Multi-Cavity SC CW Linac at GSI",
      "authors": [
        "S. Yaramyshev",
        "W.A. Barth",
        "M. Heilmann",
        "GSI",
        "Darmstadt",
        "Germany",
        "IKP",
        "Mainz",
        "Germany",
        "K. Aulenbacher",
        "W.A. Barth",
        "V. Gettmann",
        "T. Kürzeder",
        "M. Miski-Oglu",
        "HIM",
        "Mainz",
        "Germany",
        "M. Basten",
        "M. Busch",
        "H. Podlech",
        "M. Schwarzpresenter",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "A multi-stage program for the development of a heavy ion superconducting (sc) continuous wave (cw) linac is in progress at HIM (Mainz",
        "Germany) and GSI (Darmstadt",
        "Germany) under support of IAP (Frankfurt",
        "Germany). In 2017 the first section of the CW-Linac has been successfully commissioned at GSI. Beam acceleration at the CW-Linac is foreseen to be performed by up to twelve multi-gap CH cavities. The linac should provide the beam for physics experiments",
        "smoothly varying the output particle energy from 3.5 to 7.3 MeV/u",
        "simultaneously keeping high beam quality. Due to a wide variation of the input- and output -beam energy for each cavity",
        "a longitudinal beam matching to every cavity is of high importance. An advanced algorithm for an optimization of matched beam parameters under variable rf-voltage and rf-phase of each cavity has been developed. The description of the method and the obtained results are presented in the paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK002",
      "page_number": "955",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK003",
      "title": "Beam Dynamics Simulations for the New Superconducting CW Heavy Ion LINAC at GSI",
      "authors": [
        "M. Schwarz",
        "M. Basten",
        "M. Busch",
        "H. Podlech",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "IKP",
        "Mainz",
        "Germany",
        "K. Aulenbacher",
        "W.A. Barth",
        "F.D. Dziuba",
        "V. Gettmann",
        "T. Kürzeder",
        "M. Miski-Oglu",
        "HIM",
        "Mainz",
        "Germany",
        "W.A. Barth",
        "M. Heilmann",
        "A. Rubin",
        "A. Schnase",
        "S. Yaramyshev",
        "GSI",
        "Darmstadt",
        "Germany",
        "For future experiments with heavy ions near the coulomb barrier within the super-heavy element (SHE) research project a multi-stage R&D program of GSI/HIM and IAP is currently in progress. It aims for developing a supercon-ducting (sc) continuous wave (CW) LINAC with multiple CH cavities as key components downstream the High Charge State Injector (HLI) at GSI. The LINAC design is challenging due to the requirement of intense beams in CW mode up to a mass-to-charge ratio of 6",
        "while covering a broad output energy range from 3.5 to 7.3 MeV/u with unchanged minimum energy spread. Testing of the first CH-cavity in 2016 demonstrated a promising maximum accelerating gradient of Ea = 9.6 MV/m; the worldwide first beam test with this sc multi-gap CH-cavity in 2017 was a milestone in the R&D work of GSI/HIM and IAP. In the light of experience gained in this research so far",
        "the beam dynamics layout for the entire LINAC has recently been updated and optimized."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak003.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK003",
      "page_number": "959",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK004",
      "title": "Superconducting CH-Cavity Heavy Ion Beam Testing at GSI",
      "authors": [
        "W.A. Barth",
        "M. Heilmann",
        "A. Rubin",
        "A. Schnase",
        "S. Yaramyshev",
        "GSI",
        "Darmstadt",
        "Germany",
        "IKP",
        "Mainz",
        "Germany",
        "K. Aulenbacher",
        "F.D. Dziuba",
        "V. Gettmann",
        "T. Kuerzederpresenter",
        "M. Miski-Oglu",
        "HIM",
        "Mainz",
        "Germany",
        "M. Basten",
        "M. Busch",
        "H. Podlech",
        "M. Schwarz",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "Recently the first section of a standalone superconducting (sc) continuous wave (cw) heavy ion Linac as a demonstration of the capability of 217 MHz multi gap Crossbar H-mode structures (CH) has been commissioned and extensively tested with beam from the GSI- High Charge State Injector. The demonstrator set up reached acceleration of heavy ions up to the design beam energy and beyond. The required acceleration gain was achieved with heavy ion beams even above the design mass to charge ratio at high beam intensity and full beam transmission. This contribution presents systematic beam measurements with varying RF-amplitudes and phases of the CH-cavity",
        "as well as versatile phase space measurements for heavy ion beams with different mass to charge ratio. The worldwide first and successful beam test with a superconducting multi gap CH-cavity is a milestone of the R&D work of Helmholtz Institute Mainz (HIM) and GSI in collaboration with Goethe University Frankfurt (GUF) in preparation of the sc cw heavy ion Linac project and other cw-ion beam applications."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak004.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK004",
      "page_number": "962",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK005",
      "title": "Upgrade Plan of J-PARC MR - Toward 1.3 MW Beam Power",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "The Main Ring Synchrotron (MR)",
        "a 30-GeV slow cycling proton synchrotron",
        "delivers intense proton beam to a long-baseline neutrino oscillation experiment",
        "T2K",
        "by fast extraction and to an experimental facility",
        "which is called hadron hall by slow extraction. The achieved beam intensities for routine operations are 470 kW ( 2.4 x 1014 ppp) for the fast extraction and 44 kW ( 5.1 x 1013 ppp) for the slow extraction. In order to increase the beam intensity",
        "a plan to replace the magnet power supplies are now in progress for operation with a higher repetition rate. After the replacement",
        "the cycle time will be shortened about a half and increase beam intensities two times larger for the fast extraction. In addition",
        "a further upgrade plan for the fast extraction is mainly reinforcement of rf power supplies. The goal of the upgrade plan is reaching 1.3 MW beam power for the neutrino experiment."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak005.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK005",
      "page_number": "966",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK007",
      "title": "Simulation of Surface Muon Beamline, Ultra-Slow Muon Production and Extraction for the J-PARC g-2/EDM Experiment",
      "authors": [
        "M. Otani",
        "N. Kawamura",
        "T. Mibe",
        "T. Yamazaki",
        "KEK",
        "Tsukuba",
        "Japan",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "The E34 experiment aims to measure muon anomalous magnetic moment with a precision of 0.1 ppm to cast light on beyond standard model in elementary particle physics. The experiment utilizes a brand new muon beam line in J-PARC (H line)",
        "which is designed to have large acceptance to supply an intense muon beam. The surface muons are injected into a silica aerogel target to generate bound state of muon and electron (muonium). Then the muoniums are ionized by lasers and ultra slow (30 meV) muons (USM) are generated. The USM's are extracted by electro-static lens and injected to a muon linac. In this poster",
        "simulation for optics of the surface muon beamline",
        "muonium production and extraction by the electro-static lens",
        "and the estimation of the USM's intensity are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak007.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK007",
      "page_number": "970",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK008",
      "title": "Longitudinal Bunch Size Measurements with an RF Deflector at J-PARC LINAC",
      "authors": [
        "M. Otani",
        "K. Futatsukawa",
        "KEK",
        "Tsukuba",
        "Japan",
        "K. Hirano",
        "A. Miura",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "KEK/JAEA",
        "Ibaraki-Ken",
        "Japan",
        "FRIB",
        "East Lansing",
        "USA",
        "Measurement of the longitudinal bunch size is important for the stable beam operation. Especially in a medium energy beam transport (MEBT) located after a radio-frequency quadrupole in J-PARC",
        "it is necessary to measure the bunch size with minimum set of equipment to avoid subsequent emittance growth due to space charge. We had proposed a longitudinal size measurement with an rf deflector normally used for deflecting theμbunch; phase spread is migrated to spatial one if the reference particle arrives at the deflector when the voltage is rising in time and is zero. Then a buncher cavity located upstream of the deflector is utilized to scan the phase spread to measure the longitudinal beam parameters. In this poster",
        "recent measurement results are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak008.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK008",
      "page_number": "974",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK009",
      "title": "Muon Profile Measurement After Acceleration With a Radio-Frequency Quadrupole Linac",
      "authors": [
        "M. Otani",
        "Y. Fukao",
        "K. Futatsukawa",
        "N. Kawamura",
        "T. Mibe",
        "Y. Miyake",
        "T. Yamazaki",
        "KEK",
        "Tsukuba",
        "Japan",
        "S. Bae",
        "H. Choi",
        "S. Choi",
        "B. Kim",
        "H.S. Ko",
        "SNU",
        "Seoul",
        "Republic of Korea",
        "K. Hasegawa",
        "Y. Kondo",
        "T. Morishita",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "T. Iijima",
        "Y. Sue",
        "Nagoya University",
        "Graduate School of Science",
        "Chikusa-ku",
        "Nagoya",
        "Japan",
        "H. Iinuma",
        "Y. Nakazawa",
        "Ibaraki University",
        "Ibaraki",
        "Japan",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "University of Tokyo",
        "Tokyo",
        "Japan",
        "The University of Tokyo",
        "Graduate School of Science",
        "Tokyo",
        "Japan",
        "Budker INP & NSU",
        "Novosibirsk",
        "Russia",
        "J-PARC",
        "KEK & JAEA",
        "Ibaraki-ken",
        "Japan",
        "Korea University",
        "Seoul",
        "Republic of Korea",
        "The E34 experiment aims to measure muon anomalous magnetic moment with a precision of 0.1ppm. The experiment utilizes low emittance muon beam with a muon linac to sweep out beam related uncertainties",
        "which limit the g-2 precision in past experiments. A beam matching with precise beam measurements is required to avoid substantial emittance growth and satisfy the experimental requirement on the beam emittance of around 1.5 pi mm mrad. We conduct profile measurement of muon after acceleration with a radio-frequency quadrupole (RFQ) on December 2017 following a first muon acceleration experiment on October. In the experiment of profile measurement",
        "epi-thermal negative muonium ions are generated by injecting surface muons to a thin metal foil. The muonium ions are accelerated to 5 keV. by an electro-static lens and accelerated to 90 keV by the RFQ. Then the muonium ions are transported to a profile detector consisting of a micro-channel plate and a ccd camera via a quadrupole pair and a bending magnet. In this poster",
        "the experimental result and comparison to the simulation are reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak009.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK009",
      "page_number": "977",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK010",
      "title": "The Development of a New Low Field Septum Magnet System for Fast Extraction in Main Ring of J-PARC",
      "authors": [
        "T. Shibata",
        "K. Ishii",
        "H. Matsumoto",
        "T. Sugimoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "HUST",
        "Wuhan",
        "People's Republic of China",
        "The J-PARC Main Ring (MR) is being upgraded to improve its beam power to the design goal of 750 kW. One important way is to reduce the repetition period from 2.48 s to 1.3 s so that the beam power can be nearly doubled. We need to improve the septum magnets for fast extraction. We are improving the magnets and their power supplies. The present magnets which are conventional type have problem in durability of septum coil by its vibration",
        "and large leakage field at the flange of the beam duct. The new magnets are eddy current type. The eddy current type does not have septum coil",
        "but has a thin plate. We expect that there is no problem in durability",
        "we can construct the thin septum plate",
        "the leakage field can be reduced. The output of the present power supply are pattern current which of flat top is 10 ms width",
        "the new one is short pulse which of one is 10 us. The short pulse consists of 1st and 3rd higher harmonic. We can expect that the flatness and reproducibility of flat top current can be improved. The calorific power can be also reduced. This paper will report the performance of the power supply and its magnetic field with the eddy septum magnet systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK010",
      "page_number": "981",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK011",
      "title": "Present Status and Future Upgrades of the J-PARC Ring RF Systems",
      "authors": [
        "M. Yoshii",
        "M. Furusawa",
        "K. Hara",
        "K. Hasegawa",
        "C. Ohmori",
        "Y. Sugiyama",
        "KEK",
        "Tokai",
        "Ibaraki",
        "Japan",
        "M. Nomura",
        "T. Shimada",
        "F. Tamura",
        "M. Yamamoto",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "J-PARC is the multipurpose research institutes. 10 years have passed since the user operation started. We have been considering the upgrades for the future and the target beam powers for 3 GeV rapid cycling synchrotron (RCS) and 30GeV Main ring (MR) are 1.5MW and 1.3MW. To achieve a 1.5MW of RCS output beam power",
        "increasing the number of Linac proton particles is necessary. For accelerating such higher beam current",
        "the rf systems in the RCS need to upgrade an accelerating voltage and to take account of heavier beam loading. In case of the MR",
        "increasing the number of proton is not appropriate from the viewpoint of space charge effects. We chose to shorten the MR cycle time. The required RF voltages become almost double. All nine systems have been replaced with the higher accelerating gradient RF systems using a newly developed magnetic alloy material. At present",
        "the proton beam of 470kW is being delivered with a cycle time of 2.48s. Beam powers of MR will plan to aim first at 750KW after replacing the magnet power supplies. But",
        "to realize a 1.3MW beam power",
        "upgrading the RF power sources will be necessary. We present the ring RF system status and their upgrades for the future."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak011.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK011",
      "page_number": "984",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK012",
      "title": "Conceptual Design of a Single-Ended MA Cavity for J-PARC RCS Upgrade",
      "authors": [
        "M. Yamamoto",
        "M. Nomura",
        "T. Shimada",
        "F. Tamura",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "M. Furusawa",
        "K. Hara",
        "K. Hasegawa",
        "C. Ohmori",
        "Y. Sugiyama",
        "M. Yoshiipresenter",
        "KEK",
        "Tokai",
        "Ibaraki",
        "Japan",
        "The J-PARC RCS employes Magnetic Alloy (MA) loaded cavities and rf power is fed by vacuum tubes in push-pull operation. The multi-harmonic rf driving and the multi-harmonic beam loading compensation are realized due to the broadband characteristics of the MA. However",
        "the push-pull operation has disadvantages in the multi-harmonics. An unbalance of the anode voltage swing remarkably appears at very high intensity beam acceleration. In order to avoid the unbalance",
        "a single-ended MA cavity is considered for the RCS beam power upgrade because no unbalance arises intrinsically. We will describe the conceptual design of the single-end MA cavity for the RCS upgrade."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak012.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK012",
      "page_number": "987",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK013",
      "title": "Geant4 Simulation of Radiation Effect on the Deflector of Extraction System in HUST SCC250",
      "authors": [
        "S. Hu",
        "K. Fan",
        "L.X.F. Li",
        "Z.Y. Mei",
        "Z.J. Zeng",
        "L.G. Zhang",
        "HUST",
        "Wuhan",
        "People's Republic of China",
        "China has payed extensive attention to the development of proton therapy in recent years. When design a compact",
        "high energy superconducting cyclotron for proton therapy， radiation effect induced by beam losses is a crucial consideration. Since the proton beam is extracted out of HUST SCC250 by electrostatic deflectors",
        "the fierce interaction between proton beam and the deflector septum is the main cause of beam losses",
        "which will bring about radiation effect leading to activation and coil quench. This paper presents simulation results of radiation effect by utilizing Geant4 Monte Carlo code. The energy depositions of proton beam in various septum materials are compared. Meanwhile",
        "the yields",
        "the ener-gy and angular distributions of secondary particles are investigated. Those simulation results based on radiation effect will provide us with valuable implications for the design of this superconducting cyclotron."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak013.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK013",
      "page_number": "990",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK015",
      "title": "The SARAF-LINAC Project 2018 Status",
      "authors": [
        "N. Pichoff",
        "D. Chirpaz-Cerbatpresenter",
        "R. Cubizolles",
        "J. Dumas",
        "R.D. Duperrier",
        "G. Ferrand",
        "B. Gastineau",
        "P. Gastinel",
        "F. Gougnaud",
        "M. Jacquemet",
        "C. Madec",
        "Th. Plaisant",
        "F. Senée",
        "A. Sutra-Fourcade",
        "D. Uriot",
        "IRFU",
        "CEA",
        "University Paris-Saclay",
        "Gif-sur-Yvette",
        "France",
        "D. Berkovits",
        "J. Luner",
        "A. Perry",
        "E. Reinfeld",
        "J. Rodnizki",
        "Soreq NRC",
        "Yavne",
        "Israel",
        "GANIL",
        "Caen",
        "France",
        "SNRC and CEA collaborate to the upgrade of the SARAF accelerator to 5 mA CW 40 MeV deuteron and proton beams (Phase 2). CEA is in charge of the design",
        "construction and commissioning of the MEBT line and the superconducting linac (SARAF-LINAC Project). The prototypes of the 176 MHz NC rebuncher",
        "SC cavities",
        "RF coupler and SC Solenoid-Package are under construction and their test stands construction or adaptation is in progress at Saclay. Meanwhile",
        "the cryomodules and the global system just passed their Critical Design Reviews. This paper presents the status of the SARAF-LINAC Project at April 2018."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak015.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK015",
      "page_number": "994",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK016",
      "title": "Commissioning of the Diagnostic Beam Line for the Muon RF Acceleration with H− Ion Beam Derived from the Ultraviolet Light",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak016.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK016",
      "page_number": "997",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK017",
      "title": "Abandoned Proton Beam Separation Design at MOMENT",
      "authors": [
        "C. Meng",
        "H.T. Jing",
        "Y.P. Song",
        "J.Y. Tang",
        "H. Wangpresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "MOMENT (MuOn-decay MEdium baseline NeuTrino beam facility) is an accelerator-based neutrino beam facility using neutrino from muon decays. The proton driver is a continuous-wave proton linac of 1.5 GeV and 10 mA",
        "which means an extremely high beam power of 15 MW. After bombarding the target",
        "the abandoned proton beam power is very high and should be separate from target station carefully. Because of the energy is not very high and the layout of following transport line isn't linear",
        "we should design special separation line for high momentum proton beam. In this paper the design of separation scheme at MOMENT will be proposed and discussed."
      ],
      "institutions": [
        "Funding: The National Natural Science Foundation of China under Grants 11575217"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak017.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAK018",
      "title": "Study on the Collimation Method for a Future Proton-Proton Collider",
      "authors": [
        "J.Q. Yang",
        "Y. Baopresenter",
        "J.Y. Tang",
        "J.Y. Tang",
        "Y. Zou",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "As the second phase of CEPC-SPPC project",
        "SPPC (Super Proton-Proton Collider) is to explore new physics beyond the standard model in the energy frontier with a center-of-mass energy of 75 TeV. In order to handle extremely-high stored energy in beam",
        "the collimation system of extremely high efficiency is required for safe operation. SPPC has been studying a collimation method which arranges both the transverse and momentum collimations in one long straight section. In this way",
        "the downstream momentum collimation section can clean those particles related to the single diffractive effect in the transverse collimation section thus eliminate beam losses in the arc section. In addition",
        "one more collimation stage is obtained with use of special superconduct-ing quadrupoles in the transverse collimation section. Multiple particle simulations have proven the effectiveness of the methods. This paper presents the study results on the collimation scheme."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupak018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupak018.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupak018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAK018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 16,
  "scrape_time": "2025-10-10 19:25:52"
}