{
  "session_info": {
    "id": "THXAT01",
    "name": "THXAT01 - WG6: Injection",
    "url": "https://proceedings.jacow.org/eefact2022/html/thxat01.htm"
  },
  "papers": [
    {
      "paper_id": "THXAT0101",
      "title": "P-cubed: A Positron Source Demonstrator for FCC-ee",
      "authors": [
        "N. Vallis",
        "B. Auchmann",
        "P. Craievich",
        "M. Duda",
        "H. Garcia Rodrigues",
        "J. Kosse",
        "M. Schaer",
        "R. Zennaro",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The PSI Positron Production project (P-cubed) is a demonstrator for a novel positron source for FCC-ee. The high current requirements of future colliders can be compromised by the extremely high positron emittance at the production target and consequent poor capture and transport to the damping ring. However",
        "recent advances in high temperature superconductors allow for an efficient matching of such an emittance through the use a solenoid around the target delivering a field over 10 T on-axis. Moreover",
        "the emittance of the matched positron beam can be contained through large aperture RF cavities surrounded by a multi-Tesla field generated by conventional superconducting solenoids",
        "where simulations estimate a yield higher by one order of magnitude with respect to the state-of-theart. The goal of P3 is to demonstrate this basic principle by implementing the aforementioned solenoids into a prototype positron source based on a 6 GeV electron beam from the SwissFEL linac",
        "including two RF capture cavities and a beam diagnostics section."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/thxat0101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/thxat0101.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/thxat0101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-THXAT0101",
      "page_number": "218",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXAT0102",
      "title": "Issues Related to CEPC e⁺/e⁻ Injection",
      "authors": [
        "C. Meng",
        "J. Gao",
        "X.P. Li",
        "G. Pei",
        "D. Wang",
        "J.R. Zhang",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "Circular Electron-Positron Collider (CEPC) is a 100 km ring collider as a Higgs factory. It consists of a double ring collider",
        "a full energy booster",
        "a Linac and several transport lines. The Linac is a normal conducting S-band and C-band linear accelerator and provide electron and positron beam at an energy up to 30 GeV with repetition frequency of 100 Hz. After a conventional positron source",
        "there is a 1.1 GeV damping ring to reduce the emittance of positron beam. C-band accelerating structures are adopted to accelerate electron and positron beam from 1.1 GeV to 30 GeV. For Z mode",
        "in order to obtain higher injection speed",
        "the Linac operates in double-bunch acceleration mode. The physics design and dynamic simulation results of the Linac will be detailed present-ed in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/thxat0102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/thxat0102.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/thxat0102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-THXAT0102",
      "page_number": "222",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXAT0104",
      "title": "FCC-ee e⁺e⁻ Injection and Booster rRng",
      "authors": [
        "R.L. Ramjiawan",
        "M.J. Barnes",
        "W. Bartmann",
        "J.C.C.M. Borburgh",
        "Y. Dutheil",
        "M. Hofer",
        "CERN",
        "Meyrin",
        "Switzerland",
        "CEA",
        "Gif-sur-Yvette",
        "France",
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "University of Saskatchewan",
        "Saskatoon",
        "Canada",
        "The Future Circular electron-positron Collider (FCC-ee) is a proposal for a 91.17 km collider",
        "which would operate in four modes with energies ranging from 45.6 GeV (Z-pole) to 182.5 GeV (ttbar-production). At high energies the beam lifetime could be as low as 6 minutes",
        "requiring the beam to be continuously topped up to reach a high integrated luminosity. This top-up injection would use a separate booster ring in the same tunnel as the collider",
        "which would accelerate the beams to the collider energy. The booster ring should achieve a lower equilibrium emittance than the collider",
        "despite challenges such as a long damping time and no magnet-strength tapering to compensate for the impact of synchrotron radiation. For top-up injection into the collider",
        "we consider two strategies: conventional bump injection",
        "employing a closed orbit bump",
        "and injection using a multipole kicker magnet. On-axis and off-axis sub-schemes will be studied for both. We compare these injection strategies on aspects including spatial constraints",
        "machine protection",
        "perturbation to the stored beam and hardware parameters."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/thxat0104_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/thxat0104.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/thxat0104_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-THXAT0104",
      "page_number": "227",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-11 08:35:30"
}