{
  "session_info": {
    "id": "MOPWI",
    "name": "MOPWI - Monday Posters (Wilson)",
    "url": "https://proceedings.jacow.org/IPAC2015/html/mopwi.htm"
  },
  "papers": [
    {
      "paper_id": "MOPWI001",
      "title": "First Results From Beam Tests of the CLIC Drive Beam Phase Feedforward Prototype at CTF3",
      "authors": [
        "J. Roberts",
        "P. Burrows",
        "G.B. Christian",
        "C. Perry",
        "JAI",
        "Oxford",
        "United Kingdom",
        "A. Andersson",
        "R. Corsini",
        "P.K. Skowroński",
        "CERN",
        "Geneva",
        "Switzerland",
        "A. Ghigo",
        "F. Marcellini",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "In the CLIC two beam acceleration scheme 100 MV/m normal conducting cavities are fed with RF power extracted from a secondary high power but low energy drive beam. To ensure the efficiency and luminosity performance of CLIC the phase synchronisation between the high energy main beam and the drive beam must be maintained to within 0.2 degrees of 12 GHz. To reduce the drive beam phase jitter to this level a low-latency drive beam phase feedforward correction with bandwidth above 17.5 MHz is required. A prototype of this system has been installed at the CLIC test facility CTF3 to prove its feasibility",
        "in particular the challenges of high bandwidth",
        "high power and low latency hardware. The final commissioning and first results from operation of the complete phase feedforward system are presented here."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi001.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI002",
      "title": "Bunch Length Measurements using Synchrotron Light Monitor",
      "authors": [
        "M.M. Ali",
        "M.G. Tiefenback",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The bunch length is measured at CEBAF using an invasive technique. The technique depends on applying an energy chirp for the electron bunch and imaging it through a dispersive region. The measurements are taken through Arc1 and Arc2 at CEBAF. The fundamental equations",
        "procedure and the latest results are given."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi002.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI003",
      "title": "Laserwire Emittance Scanner at CERN Linac 4",
      "authors": [
        "K.O. Kruchinin",
        "G.E. Boorman",
        "A. Bosco",
        "S.M. Gibson",
        "P. Karataev",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "E. Bravin",
        "T. Hofmann",
        "U. Raich",
        "F. Roncarolo",
        "F. Zocca",
        "CERN",
        "Geneva",
        "Switzerland",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom"
      ],
      "institutions": [
        "Linac 4 presently under construction at CERN is designed to replace the existing 50 MeV Linac 2 in the LHC injector chain and will accelerate the beam of high current negative hydrogen ions to 160 MeV. During the commissioning a laserwire emittance scanner has been installed allowing noninvasive measuring of the emittance at 3 MeV and 12 MeV setups. A low power infrared fibre coupled laser was focused in the interaction region down to ~150 um and collided with the ion beam neutralising negative ions. At each transverse laser position with respect to the ion beam the angular distribution of the neutral particle beamlets was recorded by scanning a diamond detector across the beamlet at a certain distance from the IP while the main beam of the H− ions was deflected using dipole magnet installed upstream the detector. Measuring the profile of the beamlet by scanning the laser across the beam allows to directly measure the transverse phase-space distribution and reconstruct the transverse beam emittance. In this report we will describe the analysis of the data collected during the 3 MeV and 12 MeV operation of the Linac 4. We will discuss the hardware status and future plans."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi003.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI004",
      "title": "Novel Single Shot Bunch Length Diagnostic using Coherent Diffraction Radiation",
      "authors": [
        "R.B. Fiorito",
        "C.P. Welsch",
        "H.D. Zhang",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "Current beam bunch length monitors which measure the spectral content of beam-associated coherent radiation to determine the longitudinal bunch form factor usually require wide bandwidth detection or Fourier transformation of interferometric data and multiple beam pulses. The data must then be Fourier transformed to obtain the bunch length. In this contribution we discuss progress in the development of a novel single shot method that utilizes the frequency integrated angular distribution (AD) of coherent diffraction radiation (CDR) to measure the RMS bunch length directly. We also present simulation results which show how the AD changes with bunch length for several electron beam linacs",
        "where we are planning to test this new method",
        "our single shot measurement technique and plans for comparison to other bunch length monitors."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi004.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI005",
      "title": "Emittance and Optics Measurements on the Versatile Electron Linear Accelerator at Daresbury  Laboratory",
      "authors": [
        "C.P. Topping",
        "D.J. Scott",
        "A. Wolski",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "S.D. Barrett",
        "C.P. Topping",
        "A. Wolski",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "B.L. Militsyn",
        "D.J. Scott",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The Versatile Electron Linear Accelerator (VELA) is a facility designed to provide a high quality electron beam for accelerator systems development",
        "as well as industrial and scientific applications. Currently",
        "the RF gun can deliver short (of order a few ps) bunches with charge in excess of 250 pC at up to 5.0 MeV/c beam momentum. Measurement of the beam emittance and optics in the section immediately following the gun is a key step in tuning both the gun and the downstream beamlines for optimum beam quality. We report the results of measurements (taking account of coupling and space charge) indicating normalised emittances of order 0.5 μm at low bunch charge."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi005.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI006",
      "title": "Development of a Supersonic Gas-jet Monitor to Measure Beam Profile Non-destructively",
      "authors": [
        "H.D. Zhang",
        "A. Jeff",
        "V. Tzoganis",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "CERN",
        "Geneva",
        "Switzerland",
        "A. Jeff",
        "V. Tzoganis",
        "C.P. Welsch",
        "H.D. Zhang",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "RIKEN",
        "Saitama",
        "Japan",
        "The measurement of the transverse beam profile is a great challenge for high intensity",
        "high brightness and high power particle beams due to their destructive power. Current non-destructive methods such as residual gas monitors and beam induced fluorescence monitors either require a rather long integration time or residual gas pressures in the order of 10-7 mbar to make meaningful measurements. A supersonic gas-jet beam profile monitor has been developed by QUASAR group at the Cockcroft Institute",
        "UK and promises significant improvements over these established techniques. In this monitor",
        "a supersonic gas curtain is generated that crosses the beam to be analyzed under an angle of 45°. When both beams interact",
        "ionization of the gas jet particles occurs and these ions are then accelerated by an electrostatic extraction field towards a Micro Channel Plate (MCP). Beam images are then obtained via a phosphor screen-CCD camera combination. In this contribution",
        "we discuss the monitor design and present beam profile measurements of a 5 keV electron beam. These are complemented by results from measurements using a pulsed valve to study the gas jet dynamics."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi006.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI009",
      "title": "A Multi-pinhole Faraday Cup Device for Measurement of Discrete Charge Distribution of Heavy and Light Ions",
      "authors": [
        "P.K. Roy",
        "S. Dwaraknath",
        "F.U. Naab",
        "S. Taller",
        "O.F. Toader",
        "G. Was",
        "NERS-UM",
        "Ann Arbor",
        "Michigan",
        "USA",
        "It is a difficult task to identify the beam density distribution profile over discrete areas using a standard Faraday cup",
        "as the measurements are provided for the full aperture geometry of the instrument. Ideally",
        "the intensity of the scintillating material would provide a correlation to the beam density",
        "but the low photon efficiency",
        "damage to the scintillator",
        "and camera resolution all limit the practicality of using this system for assessing the spatial resolution of an ion beam. A beam profile monitor (BPM) device has the ability to provide a partial or discrete distribution of an integrated beam profile. The BPM",
        "however",
        "does not discriminate between ions and electrons",
        "the latter of which can be problematic for assessing the full beam profile. To provide a better description of the beam density in spatial dimensions",
        "a multi-pinhole Faraday cup (MPFC) has been designed",
        "developed",
        "and applied to the measurement of energetic ions. This device uses an array of millimeter sized Faraday cups arranged in a grid to measure the current of the beam at discrete locations. This report presents the design of the device",
        "and its performance with ion beams."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi009.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI010",
      "title": "Design and Development of a Beam Stablity Mechanical Motion System Diagnostic for the APS MBA Upgrade",
      "authors": [
        "R.M. Lill",
        "G. Decker",
        "N. Sereno",
        "B.X. Yang",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "The Advanced Photon Source (APS) is currently in the conceptual design phase for the MBA lattice upgrade. In order to achieve long-term beam stability goals",
        "a Mechanical Motion System (MMS) has been designed to monitor critical in-tunnel beam position monitoring devices. The mechanical motion generated from changes in chamber cooling water temperature",
        "tunnel air temperature",
        "beam current and undulator gap positon causes erroneous changes in beam position measurements causing drift in the X-ray beam position. The MMS has been prototyped and presently provides critical information on the vacuum chamber and BPM support systems. We report on first results of the prototype system installed in the APS storage ring."
      ],
      "institutions": [
        "Funding: Results shown in this report result from work performed at Argonne National Laboratory operated by UChicago Argonne, LLC, for the U.S. Department of Energy under contract DE-AC02-06CH11357."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi010.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI011",
      "title": "Beam Stability R&D for the APS MBA Upgrade",
      "authors": [
        "N. Sereno",
        "N.D. Arnold",
        "H. Bui",
        "J. Carwardine",
        "G. Decker",
        "L. Emery",
        "R.I. Farnsworth",
        "R.T. Keane",
        "F. Lenkszus",
        "R.M. Lill",
        "R. Lipa",
        "S. Veseli",
        "S. Xu",
        "B.X. Yang",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "Beam diagnostics required for the APS MBA are driven by ambitious beam stability requirements. The major AC stability challenge is to correct rms beam motion to 10% the rms beam size at the insertion device source points from 0.01 to 1000 Hz. The vertical plane represents the biggest challenge for AC stability which is required to be 400 nm rms for a 4 micron vertical beam size. Long term drift over a period of 7 days is required to be 1 micron or less. Major diagnostics R&D components are improved rf beam position processing using commercially available fpga based bpm processors",
        "new XRay beam position monitors sensitive only to hard X-rays",
        "mechanical motion sensing and remediation to detect and correct long term drift and a new feedback system featuring a tenfold increase in sampling rate and a several-fold increase in the number of fast correctors and bpms. Feedback system development represents a major effort and we are pursuing development of a novel algorithm that integrates orbit correction for both slow and fast correctors down to DC simultaneously. Finally a new data acquisition system (DAQ) is being developed to acquire streaming data from all diagnostics."
      ],
      "institutions": [
        "Funding: Results shown in this report result from work performed at Argonne National Laboratory operated by UChicago Argonne, LLC, for the U.S. Department of Energy under contract DE-AC02-06CH11357."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi011.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI012",
      "title": "Conceptual Design and Analysis of a Storage Ring Beam Position Monitor for the APS Upgrade",
      "authors": [
        "B.K. Stillwell",
        "R.M. Lill",
        "R.R. Lindberg",
        "M.M. O'Neill",
        "B.G. Rocke",
        "X. Sun",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A conceptual design has been developed for a radio frequency (rf) pickup-type beam position monitor (BPM) for use in a multi-bend achromat (MBA) storage ring under consideration by the APS Upgrade project (APS-U). Beam feedback systems are expected to require fourteen rf BPMs per sector with exceptional sensitivity and mechanical stability. Simultaneously",
        "BPM insertion length must be minimized to allow lattice designers the greatest freedom in selecting magnet lengths and locations. Envisioned is a conventional four probe arrangement integrated inside of a pair of rf-shielded bellows for mechanical isolation. Basic aspects of the design are presented along with the results of analyses which establish expected mechanical",
        "electronic",
        "and beam physics-related performance measures."
      ],
      "institutions": [
        "Funding: Created by UChicago Argonne, LLC, operator of Argonne National Laboratory, a U.S. Department of Energy Office of Science laboratory operated under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi012.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI013",
      "title": "Control System for the LCLS-II Undulator Prototype",
      "authors": [
        "J.Z. Xu",
        "R.I. Farnsworth",
        "N.O. Strelnikov",
        "I. Vasserman",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "The Linac Coherent Light Source (LCLS) has been successfully operated for more than 6 years. In order to expand the capability and capacity of the LCLS",
        "LCLS-II has been planned and funded by the Department of Energy. The Advanced Photon Source (APS) at Argonne National Laboratory is tasked with building the prototype of the LCLS-II undulator based on the concept of magnetic force dynamic compensation. The control system for the prototype is responsible for four motion and feedback channels with sub-micron-level accuracy",
        "eight load cells that monitor the forces that act on the system in real time",
        "and multiple temperature sensors. A detailed description of the control system and its operation is reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI014",
      "title": "Design and Development for the Next Generation X-ray Beam Position Monitor System at the APS",
      "authors": [
        "B.X. Yang",
        "G. Decker",
        "Y. Jaski",
        "S.-H. Lee",
        "M. Ramanathan",
        "N. Sereno",
        "F. Westferro",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "The proposed Advanced Photon Source (APS) Upgrade will bring storage-ring beam sizes down to several micrometers and require x-ray beam directional stability in 100 nrad range for undulator power exceeding 16 kW. The next generation x-ray beam position monitors (XBPMs) are designed to meet these requirements. We present first commissioning data on the recently installed grazing-incidence insertion device x-ray beam position monitor (GRID-XBPM) based on Cu K-edge x-ray fluorescence from limiting absorbers of the front end for two inline undulators. It demonstrated a 50-fold improvement for signal-to-background ratio over existing photoemission-based XBPMs. Techniques for calibrating the XBPMs will be discussed. We will also present a new XBPM design based Compton scattering from diamond blades. This XBPM is designed for less powerful undulators such as the APS canted-undulator beamlines where each undulator generates < 10 kW of beam power. We will discuss the thermal design of the blade",
        "the optics design of the detector assembly",
        "and computer simulations of expected response to the x-ray beam. Test data of the prototype may be presented if available."
      ],
      "institutions": [
        "Funding: Work performed at Argonne National Laboratory, operated by UChicago Argonne, LLC, for the U.S. Department of Energy under contract DE-AC02-06CH11357."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi014.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI015",
      "title": "A Low Time-Dispersion Refractive Optical Transmission Line for Streak Camera Measurements",
      "authors": [
        "J.G. Power",
        "G. Ha",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "POSTECH",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "Streak camera measurements of the charge particle bunch length are limited in resolution due to several factors: (1) the light from the source (optical transition radiation",
        "Cherenkov",
        "synchrotron radiation",
        "etc.); (2) time dispersion introduced in the optical transmission line between the source and the streak camera; and finally (3) the streak camera resolution. The limiting resolution usually arises from the optical transmission line. While an all-reflective transmission line can eliminate dispersion",
        "the system is complicated and expensive. In this paper",
        "we consider how to design a refractive optical transport line to minimize the time dispersion while maximizing the signal. We present a theoretical model of the dispersion",
        "modeling",
        "and measurements of the time dispersion for several different lens materials."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi015.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI016",
      "title": "Development of a Versatile Bunch-length Monitor for Electron Beams at ASTA",
      "authors": [
        "A.H. Lumpkin",
        "D.J. Crawfordpresenter",
        "D.R. Edstrom",
        "J. Ruan",
        "J.K. Santucci",
        "R.M. Thurman-Keup",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The generation of bright electron beams at the ASTA/IOTA facility at Fermilab includes implementation of a versatile bunch-length monitor located after the 4-dipole chicane bunch compressor for electron beam energies of 20-50 MeV and integrated charges in excess of 10 nC. The station will include both a Hamamatsu C5680 synchroscan streak camera and a Martin-Puplett interferometer (MPI). An Al-coated Si screen will be used to generate both optical transition radiation (OTR) and coherent transition radiation (CTR) during the beam’s interaction with the screen. A chicane bypass beamline will allow the measurement of the initial bunch length at the same downstream beamline location using OTR and the streak camera. The UV component of the drive laser has previously been characterized with a Gaussian fit σ of 3.5 ps*",
        "and the uncompressed electron beam is expected to be similar to this value at low charge per micropulse. In addition",
        "OTR will be transported to the streak camera from the focal plane of the downstream spectrometer to provide an E-t distribution within the micropulse time scale. Commissioning of the system and initial results with beam will be presented as available.",
        "*A.H. Lumpkin et al.",
        "Proceedings of FEL14",
        "MOP021",
        "Basel",
        "Switzerland",
        "www. JACoW.org."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi016.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI017",
      "title": "Beam Extinction Monitoring in the Mu2e Experiment",
      "authors": [
        "E. Prebys",
        "A. Gaponenko",
        "P.H. Kasper",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Bartoszek Engineering",
        "Aurora",
        "Illinois",
        "USA",
        "The Mu2e Experiment at Fermilab will search for the conversion of a muon to an electron in the field of an atomic nucleus with unprecedented sensitivity. The experiment requires a beam consisting of proton bunches approximately 200ns FW long",
        "separated by 1.7 microseconds",
        "with no out-of-time protons at the 10-10 fractional level. The verification of this level of extinction is very challenging. The proposed technique uses a special purpose spectrometer which will observe particles scattered from the production target of the experiment. The acceptance will be limited such that there will be no saturation effects from the in-time beam. The precise level and profile of the out-of-time beam can then be built up statistically",
        "by integrating over many bunches."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi017.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI018",
      "title": "New Hadron Monitor By Using A Gas-Filled RF Resonator",
      "authors": [
        "K. Yonehara",
        "A.V. Tollestrup",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "CNI",
        "Roma",
        "Italy",
        "G. Flanagan",
        "R.P. Johnson",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "It is trend to build an intense neutrino beam facility for the fundamental physics research",
        "e.g. LBNF at Fermilab",
        "T2K at KEK",
        "and CNGS at CERN. They have investigated a hadron monitor to diagnose the primary/secondary beam quality. The existing hadron monitor based on an ionization chamber is not robust in the high-radiation environment vicinity of MW-class secondary particle production targets. We propose a gas-filled RF resonator to use as the hadron monitor since it is simple and hence radiation robust in this environment. When charged particles pass through the resonator they produce ionized plasma via the Coulomb interaction with the inert gas. The beam-induced plasma changes the permittivity of inert gas. As a result",
        "a resonant frequency in the resonator shifts with the amount of ionized electrons. The radiation sensitivity is adjustable by the inert gas pressure and the RF amplitude. The hadron profile will be reconstructed with a tomography technique in the hodoscope which consists of X",
        "Y",
        "and theta layers by using a strip-shaped gas resonator. The sensitivity and possible system design will be shown in this presentation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi018.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI020",
      "title": "Development of Simple Tracking Libraries for ALS-U",
      "authors": [
        "H. Nishimura",
        "D. Robin",
        "K. Song",
        "C. Steier",
        "C. Sunpresenter",
        "W. Wan",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The conceptual lattice design study of a new diffraction-limited light source has become much more computer intensive than that for the 3rd-generation rings. We are in a process of upgrading our existing accelerator modeling and simulation libraries",
        "Goemon* in C++ and a new version Tracy#**",
        "to fulfil such new demand. The C++ version has been actively used on the ALS HPC cluster for multi-objective optimization (MOGA) to optimize the ALS lattice***",
        "and recently for ALS-U****. This time",
        "based on the current version in C#",
        "we extracted its subset and ported it to C and C++. The routines are made thread-safe to enable OpenMP locally",
        "and CPU-time profiling was extensively used to remove redundancies. The new refitting method of quad settings brought smooth switching from 5-dim to 6-dim. The data structure itself is simplified for the use on GPU that is based on our previous effort of tracking particles in GPU*****. Tracy# itself is also upgraded to cooperate with these C/C++ versions. Their use from Python will be also mentioned.",
        "* H. Nishimura",
        "PAC01",
        "3066-3068.  ** H. Nishimura"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi020.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI021",
      "title": "The LCLS-II LLRF System",
      "authors": [
        "C. Hovater",
        "R. Bachimanchi",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "S. Babel",
        "B. Hong",
        "D. Van Winkle",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "B.E. Chase",
        "E. Cullerton",
        "P. Varghese",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "L.R. Doolittle",
        "G. Huang",
        "A. Ratti",
        "C. Serrano",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The SLAC National Accelerator Laboratory is planning an upgrade (LCLS-II) to the Linear Coherent Light Source with a 4 GeV CW superconducting (SCRF) linac. The SCRF linac consists of 35 ILC style cryomodules (eight cavities each) for a total of 280 cavities. Expected cavity gradients are 16 MV/m with a loaded QL of ~ 4x107. The RF system will have 3.8 kW solid state amplifiers driving single cavities. To ensure optimum field stability a single source single cavity control system has been chosen. It consists of a precision four channel cavity receiver and RF stations (Forward",
        "Reflected and Drive signals). In order to regulate the resonant frequency variations of the cavities due to He pressure",
        "the tuning of each cavity is controlled by a Piezo actuator and a slow stepper motor. In addition the system (LLRF-amplifier-cavity) is being modeled and cavity microphonic testing has started. This paper describes the LLRF system under consideration",
        "including recent modeling and cavity tests."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi021.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI022",
      "title": "Experimental Study of a Two-Color Storage Ring FEL",
      "authors": [
        "J. Yan",
        "H. Hao",
        "S.F. Mikhailov",
        "V. Popov",
        "Y.K. Wu",
        "FEL/Duke University",
        "Durham",
        "North Carolina",
        "USA",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Multi-color Free-electron Lasers (FELs) have been developed on linac based FELs over the past two decades. On the storage ring",
        "the optical klystron (OK) FEL in its early days was demonstrated to produce lasing at two adjacent wavelengths with their spectral separation limited by the bandwidth of single wiggler radiation. Here",
        "we report a systematic experimental study on the two-color operation at the Duke FEL facility",
        "the first experimental demonstration of a tunable two-color harmonic FEL operation of a storage ring based FEL. We demonstrate a simultaneous generation of two FEL wavelengths",
        "one in infrared (IR) and the other in ultraviolet (UV) with a harmonic relationship. The experimental results show a good performance of the two-color FEL operation in terms of two-color wavelength tunability",
        "power tunability and power stability."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi022.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI023",
      "title": "Development Plan for Physics Application Software for FRIB Driver Linac",
      "authors": [
        "M. Ikegami",
        "G. Shen",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "FRIB is a heavy ion linac facility presently under construction at Michigan State University",
        "USA",
        "and its driver linac accelerates CW beams of all stable ions up to uranium to the energy of 200 MeV/u with the beam power of 400 kW. We plan to start beam commissioning of the driver linac from December 2017. An adequate software environment and infrastructure is critical for our commissioning and operation. Recently",
        "a middle layer based architecture",
        "EPICS V4 based services for example",
        "for physics application has been rapidly developed at other facilities like NSLS II. It has been showing its flexibility",
        "and portability. After reviewing those recent developments",
        "we decided to adopt these services as software infrastructure for FRIB driver linac commissioning. It enables us to take advantage of their cutting edge technologies and maturity as a system sustained by the experience accumulated in the commissioning of NSLS-II. In this paper",
        "we present a plan to develop physics application software for FRIB driver linac based on EPICS V4 services and related software. We also present a plan to adjust these EPICS V4 related software to meet the FRIB specific requirements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI024",
      "title": "Accelerator Online Simulation Platform",
      "authors": [
        "C.P. Chu",
        "Y. Zhangpresenter",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "A platform for accelerator online beam simulation has been established for Facility for Rare Isotope Beams (FRIB). This modeling platform supports multiple simulation codes for different sections of the complex machine which cannot be properly modeled with a single online simulation tool. Model data for the platform is stored in a relational database which is designed to accommodate most simulation data. The stored data is accessible with physics intuitive data API (Application Programming Interface). Presently",
        "the platform is supporting Open XAL",
        "MAD-X and IMPACT simulation codes. In addition to the model data storage and access",
        "tools such as data comparison and simple graphing capability are also included in the platform."
      ],
      "institutions": [
        "Funding: This material is based upon work supported by the U.S. Department of Energy Office of Science under Cooperative Agreement DE-SC0000661, the State of Michigan and Michigan State University."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi024.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI025",
      "title": "Phase and Amplitude Tuning Algorithms for the FRIB Superconducting Cavities",
      "authors": [
        "Y. Zhang",
        "P. Chu",
        "Z.Q. He",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "FRIB driver linac will deliver all heavy ion beams up to uranium with energy above 200 MeV/u",
        "and maximum beam power on target 400 kW for nuclear physics research. Phase and amplitude tuning of the FRIB superconducting cavities – totally about 330 of them",
        "are important to the linac beam commissioning at low power and normal operation at high power. Because relatively low beam energy and high acceleration gradient",
        "beam velocity changes significantly in the cavity RF gaps and the beam bunch cannot preserve perfectly in the further downstream beam diagnostics systems",
        "beam longitudinal tuning algorithms are studied for different FRIB cavities and at different beam energy",
        "which include the acceleration cavities as well as the re-buncher cavities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi025.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI026",
      "title": "Transverse Matching of Horizontal-Vertical Coupled Beams for the FRIB Linac",
      "authors": [
        "Y. Zhang",
        "P. Chu",
        "Z.Q. He",
        "S.M. Lund",
        "D.G. Maxwell",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "FRIB driver linac will deliver all heavy ion beams up to uranium with energy above 200 MeV/u",
        "and maximum beam power on target 400 kW for nuclear physics research. Strong horizontal-vertical beam coupling exists in the FRIB linac since superconducting solenoids are applied to focus multi charge state beams. Further",
        "the FRIB low beta SRF cavities have raised quadrupole field components. The combined effects make beam transverse matching challenging. In this paper",
        "we study transverse matching of horizontal-vertical coupled beams based on beam profile measurements with multiple wire scanners. There are multiple solutions for the initial linac beams with coupling",
        "and errors of the beam diagnostics and magnet power supplies introduce further complication. Nonetheless",
        "simulation studies show that satisfactory transverse matching can be achieved with proper linac beam tuning."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi026.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI027",
      "title": "Open XAL Control Room Experience",
      "authors": [
        "C.P. Chu",
        "D.G. Maxwell",
        "Y. Zhangpresenter",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "C.K. Allen",
        "T.A. Pelaia II",
        "A.P. Shishlo",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "This paper reports the control room experience",
        "lessons learned",
        "and quick deployment approach for the Open XAL application environment. Open XAL is a java-based framework for building high-level accelerator applications",
        "it is a major revision of the XAL framework which was developed at the Spallation Neutron Source (SNS). Open XAL is site neutral and may be deployed at multiple accelerator facilities. Currently",
        "Open XAL is installed at SNS and at the Re-Accelerator facility of Michigan State University. At SNS we are in the final process of replacing the old XAL environment with Open XAL; we describe the upgrade process and our accelerator operations experience using Open XAL. At Michigan State",
        "Open XAL has been tested during a cryomodule commissioning and result will be shown."
      ],
      "institutions": [
        "Funding: This material is based upon work supported by the U.S. Department of Energy under Cooperative Agreement DE-SC0000661 and DE-AC05-00OR22725, the State of Michigan and Michigan State University."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi027.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI028",
      "title": "Initial Experimental Results of a Machine Learning-Based Temperature Control System for an RF Gun",
      "authors": [
        "A.L. Edelen",
        "S. Biedron",
        "S.V. Milton",
        "CSU",
        "Fort Collins",
        "Colorado",
        "USA",
        "B.E. Chase",
        "D.J. Crawford",
        "N. Eddy",
        "D.R. Edstrom",
        "E.R. Harms",
        "J. Ruan",
        "J.K. Santucci",
        "P. Stabile",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Colorado State University (CSU) and Fermi National Accelerator Laboratory (Fermilab) have been developing a control system to regulate the resonant frequency of an RF electron gun. As part of this effort",
        "we present experimental results for a benchmark temperature controller that combines a machine learning-based model and a predictive control algorithm for improved settling time",
        "overshoot",
        "and disturbance rejection relative to conventional techniques. Such improvements have implications for machine up-time and management of reflected power. This work is part of an on-going effort to develop adaptive",
        "machine learning-based tools specifically to address control challenges found in particle accelerator systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi028.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI029",
      "title": "Electron Bombardment of ZnTe EO Bunch Charge Detector for Signal Lifetime Studies in Radiation Environment",
      "authors": [
        "J.E. Williams",
        "S. Biedron",
        "S.V. Milton",
        "CSU",
        "Fort Collins",
        "Colorado",
        "USA",
        "S.V. Benson",
        "S. Zhang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Electro-optic detection of bunch charge distribution utilizing the nonlinear Pockel's and Kerr effect of materials has been implemented at various facilities as a method of passive detection for beam preservation throughout characterization. Most commonly",
        "the inorganic II-VI material ZnTe is employed due to it's strong Pockel's EO effect and relatively high temporal resolution (~90 fs). Despite early exploration of radiation damage on ZnTe in exploration of semi-conductor materials in the 1970's",
        "full characterization of EO response over radiation lifetime has yet to be performed. The following poster presents a method for ZnTe crystal characterization studies throughout radiation exposure at various energies and dosages by analyzing the changes in index of refraction including bulk uniformity",
        "and THz signal response changes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi029.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI030",
      "title": "Low Emittance Tuning With a Witness Bunch",
      "authors": [
        "D. L. Rubin",
        "R.E. Meller",
        "J.P. Shankspresenter",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Electron positron damping rings and colliders will require frequent tuning to maintain ultra-low vertical emittance. Emittance tuning begins with precision beam based measurement of lattice errors (orbit",
        "transverse coupling",
        "and dispersion) followed by compensation with corrector magnets. Traditional techniques for measuring lattice errors are incompatible with simultaneous operation of the storage ring as light source or damping ring. Dedicated machine time is required. The gated tune tracker (the device that drives the beam at the normal mode frequencies) and the bunch-by-bunch",
        "turn-by-turn beam position monitor system developed at CESR are integrated to allow synchronous detection of phase. The system is capable of measuring lattice errors during routine operation. A single bunch at the end of a train of arbitrary length",
        "is designated as the witness. The witness bunch alone is resonantly excited",
        "and the phase and amplitude of the witness is mea- sured at each of the 100 beam position monitors. Lattice errors are extracted from the measurements. Corrections are then applied. The emittance of all of the bunches in the train is measured and the effectiveness of the correction procedure demonstrated."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi030.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI031",
      "title": "Microwave Modeling for Electron Cloud Density Measurements at CesrTA",
      "authors": [
        "J.P. Sikora",
        "Y. Li",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The electron cloud (EC) density in accelerator beam-pipe has been measured using resonant microwaves. The resonances are produced by changes in beam-pipe geometry that generate reflections and standing waves",
        "with typical behavior being similar to a section of waveguide with shorted ends. The technique uses fact that the EC density will shift the resonant frequencies. In previous analysis",
        "we have made the simplifying approximation that the standing waves are multiples of a half-wavelength and that the magnitude of the electric field is symmetric about the longitudinal center of the resonance. In this paper we show that some changes in beam-pipe geometry will result in asymmetric electric field magnitudes along the resonant length. When this is combined with an EC density that varies along this length",
        "the magnitude of the frequency shift will be altered. We present our initial attempt to correct for this effect by modeling the existing beam-pipe using CST Microwave Studio(R) to obtain a more realistic electric field distribution. This correction is then applied to data taken with beam at several resonant frequencies. The measurements were made at the Cornell Electron Storage Ring (CESR)",
        "which has been reconfigured as a test accelerator (CesrTA) providing electron or positron beams ranging in energy from 2 to 5 GeV."
      ],
      "institutions": [
        "Funding: This work is supported by the US National Science Foundation PHY-0734867, PHY-1002467, and the US Department of Energy DE-FC02-08ER41538, DE-SC0006505."
      ],
      "abstract": "* http://dx.doi.org/10.1016/j.nima.2014.03.063 reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi031.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI032",
      "title": "Analysis of Primary Stripper Foils at SNS by an Electron Beam Foil Test Stand",
      "authors": [
        "E.P. Barrowclough",
        "C.S. Feigerle",
        "University of Tennessee",
        "Knoxville",
        "Tennessee",
        "USA",
        "C.F. Luck",
        "M.A. Plum",
        "R.W. Shaw",
        "L.L. Wilson",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Diamond foils are used at the Spallation Neutron Source (SNS) as the primary strippers of hydride ions. A nanocrystalline diamond film",
        "typically 17x45 mm with an aerial density of 0.35 mg/cm2",
        "is deposited on a corrugated silicon substrate by plasma-assisted chemical vapor deposition. After growth",
        "30 mm of the silicon substrate is etched away",
        "leaving a freestanding diamond foil with a silicon handle that can be inserted into SNS for operation. An electron beam test facility was constructed to study stripper foil degradation and impact on foil lifetime. The electron beam capabilities include: current up to 5 mA",
        "focused spot size of 0.30 mm2",
        "and rastering in the x- and y-directions. A 30 keV and 1.6 mA/mm2 electron beam deposits the same power density on a diamond foil as a 1.4 MW beam on SNS target. Rastering of the electron beam can expose a similar area of the foil as SNS beams. Experiments were conducted using the foil test stand to study: foil flutter and lifetime; effects of corrugation patterns",
        "aerial densities",
        "crystal size (micro vs. nano)",
        "and boron doping; temperature distributions and film emissivity; and conversion rate of nanocrystalline diamond into graphite."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi032.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI033",
      "title": "Advantages to an Online Multi-particle Beam Dynamics Model for High-power Proton Linacs",
      "authors": [
        "L. Rybarcyk",
        "S.A. Baily",
        "X. Pang",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "High-power proton linacs like the 800-MeV LANSCE accelerator typically use a physics-based approach and online single-particle and envelope beam dynamics models to establish nominal set points for operation. However",
        "these models are not good enough to enable immediate transition to high-power operation. Instead",
        "some amount of empirical adjustment is necessary to achieve stable",
        "low beam-loss operation. At Los Alamos",
        "we have been developing a new online model",
        "which employs multiparticle beam dynamics",
        "as a tool for providing more information and insight to the operations staff",
        "especially during this transition to high-power operations. This presentation will discuss some of the advantages and benefits of using this type of tool in the tune-up and operation of a high-power proton linac."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi033.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI034",
      "title": "Adaptive Accelerator Tuning",
      "authors": [
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "We start with an overview of advanced adaptive control schemes in use throughout the accelerator community. We then present a recently developed",
        "novel",
        "model-independent feedback controller*",
        "which is robust to measurement noise",
        "and able to tune an arbitrary number of coupled parameters simultaneously based only on a user-defined cost function. We discuss the possibility of combining virtual beam measurements from simulations with actual diagnostic signals from the accelerator into a single cost function",
        "which takes into account both unknown machine variations and estimates of physically inaccessible beam characteristics. We present recent in-hardware experimental results obtained at the Los Alamos Neutron Science Center** and at the Facility for Advanced Accelerator Tests (FACET)***",
        "demonstrating the scheme’s ability to simultaneously tune many parameters and its robustness to noise and system time-variation.",
        "* A. Scheinker et al.",
        "PRSTAB",
        "16",
        "102803",
        "2013.  ** A. Scheinker et al.",
        "NIMA",
        "756",
        "pp. 30-38",
        "2014. *** A. Scheinker and S. Gessner",
        "Conference on Decision and Control",
        "2014."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi034.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI035",
      "title": "Characterization of Visible Synchrotron Radiation Polarization at",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi035.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI036",
      "title": "Investigation of Continuous Scan Methods for Rapid Data Acquisition",
      "authors": [
        "East China University of Science and Technology",
        "Shanghai",
        "People's Republic of China",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "University of Saskatchewan",
        "Saskatoon",
        "Canada",
        "It is common practice to perform spatially resolved X ray data acquisition by automatically moving components to discrete locations and then measuring beam intensity with the system at rest. While effective",
        "scanning in this manner can be time consuming",
        "with motors needing to accelerate",
        "move and decelerate at each location before recording data. Information between data points may be missed unless fine grid scans are performed",
        "which accounts for a further increase of scan time. Recent advances in commercial hardware and software enables a continuous scan capability for a wide range of applications",
        "which saves the start and end of step motors. To compare scanning performance",
        "both step and continuous scan modes were examined using the SPEC command language with both commercial and in-house hardware. The advantages and limitations of each are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi036.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI037",
      "title": "Upgrade and Operation of  the Demonstration 4 GS/Sec. Intra-Bunch Instability Control System for the SPS",
      "authors": [
        "J.E. Dusatko",
        "J.D. Fox",
        "C.H. Rivetta",
        "O. Turgut",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "CERN",
        "Geneva",
        "Switzerland",
        "We present the expanded system implementation and operational experience details for the “Demo” technology platform commissioned at the SPS in January 2015. The system has been expanded during the LS1 shutdown with added features. The upgraded system has enhanced performance and more robust synchronization to the beam and accelerator timing system. Central to the new features are 1 GHz bandwidth kickers and RF amplifiers (including associated equalizers) which allow excitation and control of higher modes within the 2 ns bunch. We highlight the expanded features",
        "and present their details."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi037.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI041",
      "title": "Identification of Intra-Bunch Transverse Dynamics for Model Based Wideband Feedback Control at CERN Super Proton Synchrotron",
      "authors": [
        "O. Turgut",
        "J.E. Dusatko",
        "J.D. Fox",
        "C.H. Rivetta",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [
        "Multi-input multi-output (MIMO) feedback design techniques can be helpful to stabilize intra-bunch transverse instabilities induced by electron-clouds or transverse mode couplings at the CERN Super Proton Synchrotron (SPS). These MIMO techniques require a reduced order model of intra-bunch dynamics. We estimate a linear reduced order MIMO models for transverse intra-bunch dynamics and use these models to design model based MIMO feedback controllers. The effort is motivated by the plans to increase currents in the SPS as part of the HL-LHC upgrade. Parameters of the reduced order models are estimated based on driven beam SPS measurements. We study different types of controllers. We test the model based designs using macro particle simulation codes (CMAD and HEADTAIL) and compare its performance with FIR filters tested during beam measurements of the feedback system in SPS machine development (MD) studies."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi041.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI044",
      "title": "Beamline Insertions Manager at Jefferson Lab",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The beam viewer system at Jefferson Lab provides operators and beam physicists with qualitative and quantitative information on the transverse electron beam properties. There are over 140 beam viewers installed on the 12 GeV CEBAF accelerator. This paper describes an upgrade consisting of replacing the EPICS based system tasked with managing all viewers with a mixed system utilizing EPICS and high level software. Most devices",
        "particularly the beam viewers",
        "cannot be safely inserted into the beam line during high-current beam operations. Software is partly responsible for protecting the machine from untimely insertions. The multiplicity of beam-blocking and beam-vulnerable devices motivate us to try a data-driven approach. The beamline insertions application components are centrally managed and configured through an object-oriented software framework created for this purpose. A rules-based engine tracks the configuration and status of every device",
        "along with the beam status of the machine segment containing the device. The application uses this information to decide on which device actions are allowed at any given time."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi044.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI045",
      "title": "The CEBAF Element Database and Related Operational Software",
      "authors": [
        "T. L. Larrieu",
        "M.E. Joyce",
        "M. Keesee",
        "C.J. Slominski",
        "R.J. Slominski",
        "D.L. Turner",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The newly commissioned 12 GeV CEBAF accelerator relies on a flexible",
        "scalable and comprehensive database to define the accelerator. This database delivers the configuration for CEBAF operational tools",
        "including hardware checkout",
        "the downloadable optics model",
        "control screens",
        "and much more. The presentation will describe the flexible design of the CEBAF Element Database (CED)",
        "its features and assorted use case examples."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI046",
      "title": "eDT and Model-based Configuration of 12 GeV CEBAF",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "This poster will discuss model-driven setup of CEBAF for the 12GeV era",
        "focusing on the elegant Download Tool (eDT). eDT is a new operator tool that generates magnet design setpoints for various machine energies and pass configurations. eDT was developed in the effort towards a process for reducing machine configuration time and reproducibility by way of an accurate accelerator model."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI047",
      "title": "Architectural Improvements and New Processing Tools for the Open XAL Online Model",
      "authors": [
        "C.K. Allen",
        "T.A. Pelaia II",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "University of South Carolina",
        "Columbia",
        "USA",
        "The Open XAL online model is the component of Open XAL* providing accelerator modeling dynamic synchronization to live hardware. Several significant architectural enhancements and feature additions have been made concerning the handling and processing of simulation data. The major structural change is the creation of a single class Trajectory<> that manages all simulation data. Another significant design change was the development of standard tools for processing simulation results. One may obtain machine parameters such as fixed orbit",
        "phase advance",
        "dispersion",
        "etc.",
        "or beam-based calculations such as RMS size and centroid location simply by passing simulation results",
        "i.e. a Trajectory<> object",
        "to these computation tools. Finally",
        "the ability to fully create composite modeling elements was implemented in the online model. Specifically",
        "accelerator hardware can be modeled as a collection of constituent modeling elements. This sub-structure capability is extremely useful for modeling RF cavities consisting of coupled RF gaps coupled and drift spaces. We present an overview of the new architecture and how it is used when building applications."
      ],
      "institutions": [],
      "abstract": "* http://xaldev.sourceforge.net/ reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi047.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI048",
      "title": "Open XAL Build System",
      "authors": [
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Open XAL is an accelerator physics software platform developed in collaboration among several facilities around the world. The build system is implemented through Apache Ant build files and features zero configuration simplicity based on directory patterns. These directory patterns allow for correctly building the Open XAL environment including the core and site specific applications",
        "services",
        "extensions",
        "plugins and resources. Options are available for deployment and custom application packaging. This paper describes the Open XAL build rules",
        "options and workflows."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi048.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI049",
      "title": "Open XAL Services Architecture",
      "authors": [
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Open XAL is an accelerator physics software platform developed in collaboration among several facilities around the world. It includes a powerful new services extension that allows for natural remote procedure calls. The high level services interface is based upon custom implementations of modern standard protocols such as JSON-RPC and WebSockets. This choice of modern protocols allows for flexibility such as seamless communication with web clients free of plugins plus rich object type support. The JSON parser was designed for convenient data type transformations with easy extensibility",
        "high performance and low memory overhead. The Open XAL services architecture features a simple application programming interface",
        "high performance",
        "memory efficiency and thread safety."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi049.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI050",
      "title": "Open XAL Status Report 2015",
      "authors": [
        "T.A. Pelaia II",
        "C.K. Allen",
        "A.P. Shishlo",
        "A.P. Zhukov",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Y.-C. Chao",
        "C. Gong",
        "F.W. Jones",
        "R. Newhouse",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "P. Chu",
        "D.G. Maxwell",
        "Y. Zhang",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "R. Fearn",
        "L. Fernández",
        "E. Laface",
        "M. Muñoz",
        "ESS",
        "Lund",
        "Sweden",
        "University of South Carolina",
        "Columbia",
        "USA",
        "P. Gillette",
        "P. Laurent",
        "G. Normand",
        "GANIL",
        "Caen",
        "France",
        "University of Tennessee",
        "Knoxville",
        "USA",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "I. List",
        "M. Pavleski",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "East Tennessee State University",
        "Johnson City",
        "USA",
        "Open XAL is an accelerator physics software platform developed in collaboration among several facilities around the world. The Open XAL collaboration was formed in 2010 to port",
        "improve and extend the successful XAL platform used at the Spallation Neutron Source for use in the broader accelerator community and to establish it as the standard platform for accelerator physics software. The site-independent core is complete",
        "active applications have been ported",
        "and now we are in the process of verification and transitioning to using Open XAL in production. This paper will present the current status and a roadmap for this project."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi050.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPWI052",
      "title": "Responsivity Study of Diamond X-ray Monitors with nUNCD Contact",
      "authors": [
        "M. Gaowei",
        "J. Smedley",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "E.M. Muller",
        "T. Zhou",
        "SBU",
        "Stony Brook",
        "New York",
        "USA",
        "Argonne National Laboratory",
        "Center for Nanoscale Materials",
        "Argonne",
        "USA"
      ],
      "institutions": [],
      "abstract": "Nitrogen doped ultrananocrystalline diamond (nUNCD) grown on the surface of a CVD single crystal diamond is tested at various beamlines covering an x-ray photon energy range of 200eV to 28 keV. The nUNCD has much lower x-ray absorption than metal contacts and is designed to improve the performance of our device. The responsivity of nUNCD diamond x-ray detector is compared with the conventional platinum coated diamond x-ray beam position monitor and the results are presented in this paper. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/mopwi052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/mopwi052.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/mopwi052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOPWI052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 43,
  "scrape_time": "2025-10-10 20:23:54"
}