{
  "session_info": {
    "id": "WEXD",
    "name": "WEXD - Beam Dynamics",
    "url": "https://proceedings.jacow.org/napac2022/html/wexd.htm"
  },
  "papers": [
    {
      "paper_id": "WEXD1",
      "title": "Advances in Beam Dynamics at Nuclear Physics Accelerator Facilities",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Beam dynamics of particle accelerators is a rich subfield that enables accelerators to be used in pursuit of fundamental topics in particle physics in increasingly complex ways. The field is constantly evolving as new and advanced accelerators push the limits of energy",
        "luminosity",
        "and accelerated species. This talk will cover some recent beam dynamics developments for future operation of DOE nuclear physics user facilities",
        "including upgrade options for Jefferson Lab’s 12 GeV CEBAF."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/wexd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/wexd1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/wexd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEXD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXD2",
      "title": "Storage Ring Tracking Using Generalized Gradient Representations of Full Magnetic Field Maps",
      "authors": [
        "R.R. Lindberg",
        "M. Borland",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "We have developed a set of tools to simulate particle dynamics in the full magnetic field using the generalized gradients representation. Generalized gradients provide accurate and analytic representations of the magnetic field that allow for symplectic tracking [1]. We describe the tools that convert magnetic field data into generalized gradients representations suitable for tracking in Elegant",
        "and discuss recent results based upon tracking with the full field representations for all magnets in the APS-U storage ring."
      ],
      "institutions": [
        "[1] A. Dragt. Lie Methods for Nonlinear Dynamics with Applications to Accelerator Physics. University of Maryland (2019)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/wexd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/wexd2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/wexd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEXD2",
      "page_number": "542",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXD3",
      "title": "Map Tracking Including the Effect of Stochastic Radiation",
      "authors": [
        "D. Sagan",
        "G.H. Hoffstaetter",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "KEK",
        "Ibaraki",
        "Japan",
        "Using transfer maps to simulate charged particle motion in accelerators is advantageous since it is much faster than tracking step-by-step. One challenge to using transfer maps is to properly include radiation effects. The effect of radiation can be divided into deterministic and stochastic parts. While computation of the deterministic effect has been previously reported",
        "handling of the stochastic part has not. In this paper",
        "an algorithm for including the stochastic effect is presented including taking into account the finite opening angle of the emitted photons. A comparison demonstrates the utility of this approach. Generating maps which include radiation has been implemented in the PTC software library which is interfaced to the Bmad toolkit."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/wexd3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/wexd3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/wexd3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEXD3",
      "page_number": "548",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXD4",
      "title": "OPAL for Self-Consistent Start-to-End Simulation of Undulator-Based Facilities",
      "authors": [
        "A. Albà",
        "A. Adelmann",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "ETH Zurich",
        "Photonics Laboratory",
        "Zurich",
        "Switzerland",
        "The Object Oriented Parallel Accelerator Library (OPAL)",
        "a parallel open source tool for charged-particle optics is augmented with a new flavor OPAL-FEL. With OPAL-FEL we solve the electromagnetic potential equations in free-space for radiating particles propagating along an undulator using an FDTD/PIC scheme. We present results of two benchmark [1] studies where OPAL-FEL simulations are compared to experimental results. Both experiments are about electron beamlines where the longitudinal phase space is modulated with a short magnetic wiggler. To our knowledge",
        "this is the only beam dynamics model that allows a start-to-end simulation of FELs",
        "in a fully 3D fashion including radiation."
      ],
      "institutions": [],
      "abstract": "[1] arXiv:2112.02316 (https://arxiv.org/pdf/2112.02316.pdf)",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/wexd4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/wexd4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/wexd4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEXD4",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXD5",
      "title": "Benchmarking Simulation for AWA Drive Linac and Emittance Exchange Beamline Using OPAL, GPT, and Impact-T",
      "authors": [
        "S.Y. Kim",
        "G. Chen",
        "D.S. Doran",
        "G. Ha",
        "W. Liu",
        "J.G. Power",
        "E.E. Wisniewski",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "E.A. Frame",
        "P. Piot",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "At the Argonne Wakefield Accelerator (AWA) facility",
        "particle-tracking simulations have been critical to guiding beam-dynamic experiments",
        "e.g.",
        "for various beam manipulations using an available emittance-exchange beamline (EEX). The unique beamline available at AWA provide a test case to perform in-depth comparison between different particle-tracking programs including collective effects such as space-charge force and coherent synchrotron radiation. In this study",
        "using AWA electron injector and emittance exchange beamline",
        "we compare the simulations results obtained by GPT",
        "OPAL",
        "and Impact-T beam-dynamics programs. We will specifically report on convergence test as a function of parameters that controls the underlying algorithms."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/wexd5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/wexd5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/wexd5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEXD5",
      "page_number": "552",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXD6",
      "title": "Electron Cloud Measurements in Fermilab Booster",
      "authors": [
        "S.A.K. Wijethunga",
        "J.S. Eldred",
        "E. Pozdeyev",
        "C.-Y. Tan",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Fermilab Booster synchrotron requires an intensity upgrade from 4.5×1012 to 6.5×1012 protons per pulse as a part of Fermilab’s Proton Improvement Plan-II (PIP-II). One of the factors which may limit the high-intensity performance is the fast transverse instabilities caused by electron cloud effects. According to the experience in the Recycler",
        "the electron cloud gradually builds up over multiple turns in the combined function magnets and can reach final intensities orders of magnitude greater than in a pure dipole. Since the Booster synchrotron also incorporates combined function magnets",
        "it is important to discover any existence of an electron cloud. And if it does",
        "its effects on the PIP-II era Booster and whether mitigating techniques are required. As the first step",
        "the presence or absence of the electron cloud was investigated using a gap technique. This paper presents experimental details and observations of the bunch-by-bunch tune shifts of beams with various bunch train structures at low and high intensities and simulation results conducted using PyECLOUD software."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/wexd6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/wexd6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/wexd6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEXD6",
      "page_number": "556",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:20:16"
}