{
  "session_info": {
    "id": "WEOAA",
    "name": "WEOAA - Contributed Oral Presentations, Synchrotron Light Sources and FELs",
    "url": "https://proceedings.jacow.org/IPAC2014/html/weoaa.htm"
  },
  "papers": [
    {
      "paper_id": "WEOAA01",
      "title": "Longitudinal Top-up Injection for Small Aperture Storage Rings",
      "authors": [
        "M. Aiba",
        "M. Böge",
        "F. Marcellini",
        "Á. Saá Hernández",
        "A. Streun",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Future light sources aim at achieving a diffraction limited photon beam both in the horizontal and vertical planes. Small magnet apertures and high magnet gradients of a corresponding ultra-low emittance lattice may restrict physical and dynamic acceptance of the storage ring such that off-axis injection and accumulation may become impossible. We investigate a longitudinal injection",
        "i.e. injecting an electron bunch onto the closed orbit with a time-offset with respect to the circulating bunches. The injected bunch will be merged to a circulating bunch thanks to longitudinal damping."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/weoaa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/weoaa01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/weoaa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEOAA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAA02",
      "title": "Development of the Very Short Period Undulators",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "We have been exploring a method to fabricate very short period undulators",
        "a period length of which is one order-of-magnitude shorter than the ordinary period of several cm. We are developing a plate-type magnet some 100mm long with a period length of 4mm. We selected this period length since we can generate 12-keV radiation with the first harmonic of this undulator in the 2.5-GeV storage ring. A multi-pole magnetizing method was applied to magnetizing this plate: a periodic undulator field (of 4-mm period in this case) was generated by pulsed electro-magnets",
        "and was transcribed into the plate. The magnetization procedure allows the undulator field to be obtained in a very short gap between the pair of opposing plates",
        "which is also one order-of-magnitude shorter than a gap in the ordinary undulators. We report the magnetization method to obtain a very short period and present the test results. The calculated spectrum of the radiation from the measured field compares well with that from an ideal magnetic field in the region of the fundamental radiation in case of 2.5-GeV energy of the electron beam."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/weoaa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/weoaa02.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/weoaa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEOAA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAA03",
      "title": "Ultrashort and Coherent Radiation for Pump-probe Experiments at the DELTA Storage Ring",
      "authors": [
        "M. Huck",
        "S. Hilbrich",
        "H. Huck",
        "M. Höner",
        "S. Khan",
        "C. Mai",
        "A. Meyer auf der Heide",
        "R. Molo",
        "H. Rast",
        "A. Schick",
        "P. Ungelenk",
        "DELTA",
        "Dortmund",
        "Germany",
        "A light source facility employing the coherent harmonic generation (CHG) principle is being commissioned and operated since 2011 at DELTA",
        "a 1.5-GeV electron storage ring at the TU Dortmund University",
        "with the purpose of providing ultrashort coherent VUV radiation for time-resolved experiments. CHG is based on the interaction of ultrashort laser pulses with electrons in an undulator to generate coherent harmonics of the laser wavelength. Different methods have been used to optimize",
        "detect and characterize the CHG radiation. One example is the study of transverse and longitudinal coherence properties in double-slit and Michelson experiments. Moreover",
        "final steps towards performing pump-probe experiments to study ultrafast magnetic phenomena have been taken."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/weoaa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/weoaa03.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/weoaa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEOAA03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 20:44:11"
}