{
  "session_info": {
    "id": "THXA",
    "name": "THXA - Thursday Oral Parallel A",
    "url": "https://proceedings.jacow.org/ipac2021/html/thxa.htm"
  },
  "papers": [
    {
      "paper_id": "THXA01",
      "title": "Beyond RMS: Understanding the Evolution of Beam Distributions in High Intensity Linacs",
      "authors": [
        "K.J. Ruisard",
        "A.V. Aleksandrov",
        "S.M. Cousineau",
        "A.P. Shishlo",
        "A.P. Zhukov",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Understanding the evolution of beams with space charge is crucial to design and operation of high intensity linacs. While the community holds a broad understanding of the mechanisms leading to emittance growth and halo formation",
        "there is outstanding discrepancy between measurements and beam evolution models that precludes prediction of halo losses. This may be due in part to insufficient information of the initial beam distribution. This talk will describe work at the SNS Beam Test Facility to directly measure the 6D beam distribution. Full-and-direct 6D measurement has revealed hidden but physically significant dependence between the longitudinal distribution and transverse coordinates. This nonlinear correlation is driven by space charge and reproduced by self-consistent simulation of the RFQ. Omission of this interplane correlation",
        "common when bunches are reconstructed from lower-dimensional measurements",
        "degrades downstream predictions. This talk will also describe the novel diagnostics supporting this work. This includes ongoing improvements to efficiency of the 6D phase space measurement as well as recent achievement of six orders of dynamic range in 2D phase space."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/thxa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/thxa01.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/thxa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-THXA01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXA02",
      "title": "Overview of the Micro-Bunching Instability in Electron Storage Rings and Evolving Diagnostics",
      "authors": [
        "KIT",
        "Karlsruhe",
        "Germany",
        "The micro-bunching instability is a longitudinal instability that leads to dynamical deformations of the charge distribution in the longitudinal phase space. It affects the longitudinal charge distribution",
        "and thus the emitted coherent synchrotron radiation spectra",
        "as well as the energy distribution of the electron bunch. Not only the threshold in the bunch current above which the instability occurs",
        "but also the dynamics above the instability threshold strongly depends on machine parameters",
        "e.g.",
        "natural bunch length",
        "accelerating voltage",
        "momentum compaction factor",
        "and beam energy. All this makes the understanding and potential mitigation or control of the micro-bunching instability an important topic for the next generation of light sources and circular e+/e− colliders. This presentation will give a review on the micro-bunching instability and discuss how technological advances in the turn-by-turn and bunch-by-bunch diagnostics are leading to a deeper understanding of this intriguing phenomenon."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/thxa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/thxa02.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/thxa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-THXA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXA03",
      "title": "Simultaneous Top-Up Injection Into Four Storage Rings at SuperKEKB",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "The injector linac at KEK is being upgraded for SuperKEKB",
        "where ten-times smaller emittance and five-times larger current in injection beam are required as compared to KEKB. An RF gun and damping ring were built to generate low emittance beams for the SuperKEKB electron (HER) and positron (LER) beams",
        "respectively. A pulse-to-pulse beam modulation scheme for delivery of beam to the 7 GeV HER and 4 GeV LER",
        "as well as to the 2.5 GeV Photon Factory (PF) ring and the and 6.5 GeV PF-AR ring",
        "has been successfully developed",
        "and simultaneous top-up injections are carried out during SuperKEKB Phase III commissioning. The linac upgrades needed for these simultaneous top-up injections are reported here.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/thxa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/thxa03.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/thxa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-THXA03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THXA04",
      "title": "Microbunching Instability in the Presence of Intrabeam Scattering for Single-Pass Accelerators",
      "authors": [
        "HUST",
        "Wuhan",
        "People’s Republic of China",
        "Lund University",
        "Lund",
        "Sweden",
        "Intrabeam scattering (IBS) has long been studied in lepton or hadron storage rings as a slow diffusion process",
        "while the effects of IBS on single-pass or recirculating electron accelerators have drawn attention only in the recent two decades due to the emergence of linac-based or ERL-based 4th-generation light sources",
        "which require high-quality electron beams during the beam transport. Recent experimental measurements indicate that in some parameter regimes",
        "IBS can have a significant influence on microbunched beam dynamics. Here we develop a theoretical formulation* of microbunching instability (MBI) in the presence of IBS for single-pass accelerators. We start from the Vlasov-Fokker-Planck (VFP) equation",
        "combining both collective longitudinal space charge and incoherent IBS effects. The linearized VFP equation with the corresponding coefficients is derived. The evolutions of the phase space density and energy modulations are formulated as a set of coupled integral equations. The formulation** is then applied to a simplified single-pass transport line. The results from the semi-analytical calculation are compared and show good agreement with particle tracking simulations."
      ],
      "institutions": [
        "Funding: This work is supported by the Fundamental Research Funds for the Central Universities under Project No. 5003131049 and National Natural Science Foundation of China under project No. 11905073."
      ],
      "abstract": "* C.-Y. Tsai et al., Phys. Rev. Accel. Beams 23, 124401 (2020) ** C.-Y. Tsai and W. Q, Phys. Plasmas (2021), accepted for publication",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/thxa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/thxa04.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/thxa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-THXA04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXA05",
      "title": "A Fast Method of 2D Calculation of Coherent Synchrotron Radiation Wakefield in Relativistic Beams",
      "authors": [
        "J. Tang",
        "Z. Huang",
        "G. Stupakov",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Coherent Synchrotron Radiation (CSR) is regarded as one of the most important reasons that limit beam brightness in modern accelerators. CSR wakefield is often computed in a 1D assuming a line charge",
        "which can become invalid when the beam has a large transverse extension and small bunch length. On the other hand",
        "the existing 2D or 3D codes are often computationally inefficient or incomplete. In our previous work * we developed a new model for fast computation of 2D CSR wakefield in relativistic beams with Gaussian distribution. Here we further generalize this model to achieve self-consistent computation compatible with arbitrary beam distribution and nonlinear magnetic lattice with particle tracking. These new features can enable us to perform realistic simulations and study the physics of CSR beyond 1D in electron beams with extreme short bunch length and high peak current."
      ],
      "institutions": [],
      "abstract": "* J. Tang and G. Stupakov.",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/thxa05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/thxa05.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/thxa05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-THXA05",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXA06",
      "title": "The Effect of Beam Velocity Distribution on Electron-Cooling at Elena",
      "authors": [
        "B. Veglia",
        "A. Farricker",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "B. Veglia",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "ELENA is a novel storage ring at CERN",
        "designed to deliver low energy",
        "high-quality antiprotons to antimatter experiments. The electron cooler is a key component of this decelerator",
        "which counters the beam blow-up as the antiproton energy is reduced from 5.3 MeV to 100 keV. Typical numerical approximations on electron cooling processes assume that the density distribution of electrons in analytical form and the velocity distribution space to be Maxwellian. However",
        "it is useful to have an accurate description of the cooling process based on a realistic electron distribution. In this contribution",
        "BETACOOL simulations of the ELENA antiproton beam phase space evolution were performed using uniform",
        "Gaussian",
        "and \"hollow beam\" electron velocity distributions. The results are compared with simulations considering a custom electron beam distribution obtained with G4beamline. The program was used to simulate the interaction of an initially Gaussian electron beam with the magnetic field measured inside the electron cooler interaction chamber. The resulting beam lifetime and equilibrium parameters are then compared with measurements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/thxa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/thxa06.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/thxa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-THXA06",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THXA07",
      "title": "Driven 3D Beam Oscillations for Optics Measurements in Synchrotrons",
      "authors": [
        "L. Malina",
        "J.M. Coello de Portugal",
        "H. Timko",
        "R. Tomás García",
        "CERN",
        "Geneva",
        "Switzerland",
        "Optics measurements in storage rings employ turn-by-turn data of transversely excited beams. Traditionally",
        "to measure chromatic properties",
        "the relative momentum is changed step-wise",
        "which is time-consuming and almost impractical during the energy ramp. We present an optics measurement method based on adiabatic simultaneous 3-dimensional beam excitation",
        "which is more time-efficient and well fitted for the energy ramp. This method was successfully demonstrated in the LHC utilising AC-dipoles in combination either with a slow RF-frequency modulation or a driven RF-phase modulation close to the synchrotron frequency. Faster longitudinal oscillations improve the accuracy of optics parameters inferred from the synchro-betatron sidebands. This paper reports on the experimental demonstration of optics measurements based on 3D driven beam excitations and the plans for LHC Run 3."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/thxa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/thxa07.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/thxa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-THXA07",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 7,
  "scrape_time": "2025-10-10 18:58:15"
}