{
  "session_info": {
    "id": "WEOCB",
    "name": "WEOCB - Contributed Oral Presentations, Accelerator Technology",
    "url": "https://proceedings.jacow.org/ipac2017/html/weocb.htm"
  },
  "papers": [
    {
      "paper_id": "WEOCB1",
      "title": "HTS Magnets for Accelerator Applications",
      "authors": [
        "K. Hatanaka",
        "M. Fukuda",
        "S. Hara",
        "K. Kamakura",
        "M. Nakao",
        "Y. Yasuda",
        "T. Yorita",
        "RCNP",
        "Osaka",
        "Japan",
        "We have developed HTS magnets using the first generation wires for 15 years. HTS materials have larger temperature margin than LTS materials. Magnets can be operated around 20 K or higher temperature and can be conduction-cooled by cryocoolers. The cooling structure becomes simpler and the cooling power of a cooler is high. We expect to excite HTS magnets by AC or pulsed currents without quenching. After successful performance tests of prototype magnets",
        "we fabricated two magnets for practical use",
        "an air-core cylindrical magnet and a super-ferric dipole magnet. The former one is used to polarize ultra-cold neutrons and the latter is a switching dipole magnet to deliver accelerated beams to two target stations by time sharing. Their design and operational performance are presented"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/weocb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/weocb1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/weocb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEOCB1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOCB2",
      "title": "Superconducting Magnets at FAIR",
      "authors": [
        "E.S. Fischer",
        "A. Bleile",
        "J. Ceballos Velasco",
        "V.I. Datskov",
        "F. Kaether",
        "J.P. Meier",
        "A. Mierau",
        "H. Müller",
        "C. Roux",
        "P.J. Spiller",
        "K. Sugita",
        "GSI",
        "Darmstadt",
        "Germany",
        "For the FAIR (Facility of Antiproton and Ion Research) accelerators",
        "various technologies of superconducting magnets have been developed. In total",
        "613 superconducting magnets are required for the FAIR modularized start version. For the heavy ion synchrotron SIS100",
        "which is the central accelerator under construction",
        "fast ramped",
        "iron dominated superconducting magnets of the Nuclotron type will be used. Due to the high beam intensity operation desired for SIS100",
        "highest precision and reproducibility is requested for the iron yoke of these magnets. For the dipole magnets of SIS100 the series production has already been released. In parallel",
        "the Super-FRS will be built for the generation of radioactive beams and for isotope separation. Huge aperture superconducting dipole magnets and multiplet modules are required for the main separator of the Super-FRS. For testing of the various types of sc magnets",
        "three test facilities at GSI",
        "JINR and CERN have been set-up. We give an overview on the modern design aspects for the different magnet types and their first test results and the preparation of the appropriate test facilities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/weocb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/weocb2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/weocb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEOCB2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOCB3",
      "title": "The Radiation Damage in Accelerator Target Environments (RaDIATE) Collaboration R&D Program - Status and Future Activities",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The RaDIATE collaboration (Radiation Damage In Accelerator Target Environments)",
        "founded in 2012",
        "has grown to over 50 participants and 14 institutions globally. The primary objective is to harness existing expertise in nuclear materials and accelerator targets to generate new and useful materials data for application within the accelerator and fission/fusion communities. Current activities include post-irradiation examination of materials taken from existing beamlines (such as the NuMI beryllium primary beam window and graphite target fins from Fermilab) as well as new irradiations of candidate target materials at low energy and high energy beam facilities (such as titanium and aluminum alloys",
        "glassy carbon",
        "TZM and tungsten). In addition",
        "the program includes thermal shock experiments utilizing high intensity proton beam pulses available at the HiRadMat facility at CERN. Status of current RaDIATE activities as well as future plans will be discussed",
        "including highlights of preliminary results from various ongoing RaDIATE activities and the high level plan to explore the high-power accelerator target relevant thermal shock and radiation damage parameter space."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/weocb3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/weocb3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/weocb3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEOCB3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:51:56"
}