{
  "session_info": {
    "id": "MOPB",
    "name": "MOPB - Monday Poster B",
    "url": "https://proceedings.jacow.org/ibic2018/html/mopb.htm"
  },
  "papers": [
    {
      "paper_id": "MOPB02",
      "title": "ARIES-ADA: An R&D Network for Advanced Diagnostics at Accelerators",
      "authors": [
        "P. Forck",
        "M. Sapinski",
        "GSI",
        "Darmstadt",
        "Germany",
        "C. Gerth",
        "K. Wittenburg",
        "DESY",
        "Hamburg",
        "Germany",
        "U. Iriso",
        "F. Pérez",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "CERN",
        "Meyrin",
        "Switzerland",
        "Accelerator Research and Innovation for European Science and Society",
        "ARIES",
        "is an initiative funded by the European Union (https://aries.web.cern.ch/). The activity comprises three major categories: Joint Research Activities; Transnational Access; Network Activities. One of these networks is related to Advanced Diagnostics at Accelerators (ADA) with the task of strengthening collaborations between international laboratories for coordinated research and development in beam diagnostics (https://aries.web.cern.ch/content/wp8). This task is performed by organizing topical workshops on actual developments and supporting interchange of experts between different labs. Since the start of the project in May 2017 four topical workshops of two to three days duration have been organized",
        "each with 30-40 participants ranging from novices to worldwide experts in their particular field. In this contribution these initial workshops are summarized and an outlook given for further workshops within this ARIES-ADA network."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mopb02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mopb02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mopb02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOPB02",
      "page_number": "71",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB03",
      "title": "High-Energy Scraper System for the S-DALINAC Extraction Beam Line - Commissioning Run",
      "authors": [
        "L.E. Jürgensen",
        "M. Arnold",
        "T. Bahlo",
        "C. Burandt",
        "R. Grewe",
        "J. Pforr",
        "N. Pietralla",
        "A. Rostpresenter",
        "S. Weih",
        "J. Wissmann",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "IKP",
        "Mainz",
        "Germany",
        "HIM",
        "Mainz",
        "Germany",
        "The S-DALINAC is a thrice recirculating",
        "superconducting linear electron accelerator at TU Darmstadt. It delivers electron beams in cw-mode with energies up to 130 MeV. The high-energy scraper system has been installed in its extraction beam line to reduce the energy spread and improve the energy stability of the beam for the experiments operated downstream. It comprises three scraper slits within a dispersion-conserving chicane consisting of four dipole magnets and eight quadrupole magnets. The primary scraper",
        "located in a dispersive section",
        "allows to improve and stabilize the energy spread. In addition energy fluctuations can be detected. Scraping of x- and y-halo is implemented in two positions enclosing the position of the primary scraper. We will present technical details and results of the first commissioning run of the recently installed system at the S DALINAC. Besides improving on the energy spread",
        "it proved to be a valuable device to observe energy spread and energy fluctuations as well as to reduce background count rates next to the experimental areas."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mopb03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mopb03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mopb03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOPB03",
      "page_number": "75",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB04",
      "title": "Progress in the Stripline Kicker for ELBE",
      "authors": [
        "Ch. Schneider",
        "A. Arnold",
        "J. Hauser",
        "P. Michel",
        "HZDR",
        "Dresden",
        "Germany",
        "The linac based cw electron accelerator ELBE operates different secondary beamlines one at a time. For the future different end stations should be served simultaneously",
        "hence specific bunch patterns have to be kicked into different beam-lines. The variability of the bunch pattern and the frequency resp. switching time are one of the main arguments for a stripline-kicker. A design with two tapered active electrodes and two ground fenders was optimized in time and frequency domain with the software package CST. From that a design has been transferred into a construction and was manufactured. The presentation summarises the recent results and the status of the project."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mopb04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mopb04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mopb04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOPB04",
      "page_number": "78",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB06",
      "title": "DAΦNE Luminosity Monitor",
      "authors": [
        "A. De Santis",
        "C. Bisegni",
        "O.R. Blanco-García",
        "O. Coiro",
        "A. Michelotti",
        "C. Milardi",
        "A. Stecchi",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "The DAΦNE collider instantaneous luminosity has been measured identifying Bhabha scattering events at low polar angle (∼10°) around the beam axis by using two small crystal calorimeters shared with the KLOE-2 experiment. Independent DAQ setup based on !CHAOS",
        "a novel Control System architecture",
        "has been designed and realized in order to implement a fast luminosity monitor",
        "also in view of the DAΦNE future physics runs. The realized setup allows for measurement of Bunch-by-Bunch (BBB) luminosity that allows to investigate the beam-beam interaction for the Crab-Waist collisions at DAΦNE and luminosity dependence on the bunch train structure."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mopb06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mopb06.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mopb06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOPB06",
      "page_number": "81",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB07",
      "title": "Beam Parameter Measurements for the J-PARC High-Intensity Neutrino Extraction Beamline",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "Proton beam monitoring is absolutely essential for the J-PARC neutrino extraction beamline",
        "where neutrinos are produced by the collision of 30 GeV protons from the J-PARC MR accelerator with a long carbon target. Continuous beam monitoring is crucial for the stable and safe operation of the extraction line high intensity proton beam",
        "since even a single misfired beam spill can cause serious damage to beamline equipment at 2.5x1014 and higher protons-per-pulse. A precise understanding of the proton beam intensity and profile on the neutrino production target is also necessary for predicting the neutrino beam flux with high precision. Details of the suite of monitors used to continuously and precisely monitor the J-PARC neutrino extraction line proton beam will be shown",
        "including recent running experiences",
        "challenges",
        "and future upgrade plans."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mopb07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mopb07.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mopb07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOPB07",
      "page_number": "85",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB08",
      "title": "Evaluation of the Transverse Impedanse of Pf in-Vacuum Undulator Using Local Orbit Bump Method",
      "authors": [
        "O. A. Tanaka",
        "M. Adachi",
        "K. Harada",
        "R. Kato",
        "N. Nakamura",
        "T. Obina",
        "R. Takai",
        "Y. Tanimoto",
        "K. Tsuchiya",
        "N. Yamamoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "When a beam passes through insertion devices (IDs) with narrow gap or beam ducts with small aperture",
        "it receives a transverse kick from the impedances of those devices. This transverse kick depends on the beam trans-verse position and beam parameters such as the bunch length and the total bunch charge. In the orbit bump method",
        "the transverse kick factor of an ID is estimated through the closed orbit distortion (COD) measurement at many BPMs for various beam currents [1]. In the present study",
        "we created an orbit bump of 1 mm using four steering magnets",
        "and then measured the COD for two cases: when the gap is opened (the gap size is 42 mm) and when the gap is closed (the gap size is 3.83 mm). The ID’s kick factors obtain by these measurements are compared with those obtain by simulations and analytical evaluations."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mopb08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mopb08.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mopb08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOPB08",
      "page_number": "89",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB09",
      "title": "Comparison Among Different Tune Measurement Schemes at HLS-II Storage Ring",
      "authors": [
        "L.T. Huang",
        "X.Y. Liu",
        "P. Lu",
        "M.X. Qian",
        "B.G. Sun",
        "J.G. Wang",
        "J.H. Wei",
        "F.F. Wu",
        "Y.L. Yang",
        "T.Y. Zhou",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "Tune measurement is one of the most significant beam diagnostics at HLS-II storage ring. When measuring tune",
        "higher tune spectral component and lower other compo-nents are expected",
        "so that the tune measurement will be more accurate. To this end",
        "a set of BBQ (Base Band Tune) front-end based on 3D (Direct Diode Detection) technique has previously developed to improve the effec-tive signal content and suppress other components. Em-ploying the BBQ front-end",
        "four different tune measure-ment schemes are designed and related experiments per-formed on the HLS-II storage ring. Experimental results and analysis will be presented later."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mopb09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mopb09.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mopb09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOPB09",
      "page_number": "93",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB10",
      "title": "A Study on the Influence of Bunch Longitudinal Distribution on the Cavity Bunch Length Measurement",
      "authors": [
        "Q. Wang",
        "Q. Luo",
        "B.G. Sun",
        "F.F. Wu",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "Cavity bunch length measurement is used to obtain the bunch length depending on the eigenmodes exciting in-side the cavity. For today’s FELs",
        "the longitudinal distribution of particles in electron bunch (bunch shape) may be non-Gaussian",
        "sometimes very novel. In this paper",
        "the influence of bunch shape on the cavity bunch length measurement is analyzed",
        "and some examples are given to verify the theoretical results. The analysis shows that the longitudinal distribution of particles in electron bunch has little influence on the cavity bunch length measure-ment when the bunch length is less than 1 ps and the eigenmodes used in measurement are below 10GHz."
      ],
      "institutions": [
        "Funding: Supported by National Key R&D Program of China (2016YFA0401900, 2016YFA0401903), NSFC (11375178, 11575181) and the Fundamental Research Funds for the Central Universities (WK2310000046)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mopb10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mopb10.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mopb10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOPB10",
      "page_number": "97",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB13",
      "title": "Active Magnetic Field Compensation System for SRF Cavities",
      "authors": [
        "Laboratory GREYC",
        "Caen",
        "France",
        "J. Liang",
        "H. Liu",
        "Z.P. Xiepresenter",
        "Hohai University",
        "Nanjing",
        "People’s Republic of China",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "Abstract: Superconducting Radio Frequency (SRF) cavities are becoming popular in modern particle accelerators. When the SRF cavity is transitioning from the non-conducting to the Superconducting state at the critical temperature (Tc)",
        "the ambient magnetic field can be trapped. This trapped flux may lead to an increase in the surface resistance of the cavity wall",
        "which can reduce the Q-factor and efficiency of the cavity. In order to increase the Q-factor",
        "it is important to lower the surface resistance by reducing the amount of magnetic flux trapped in the cavity wall to sub 10mG range during the Tc transition. In this paper",
        "we present a 3-axis automatic active magnetic field compensation system that is capable of reducing the earth magnetic field and any local disturbance field. Design techniques are described to enhance the system stability while utilizing the flexibility of embedded electronics. This paper describes the system implementation and concludes with initial results of tests. Experimental results demonstrate that the proposed magnetic field compensation system can reduce the earth magnetic field to around 2.5 mG even without shielding."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mopb13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mopb13.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mopb13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOPB13",
      "page_number": "101",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB14",
      "title": "SSRF Beam Operation Stability Evaluation Using Bunch by Bunch Beam Position Method",
      "authors": [
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "Y.B. Leng",
        "Y.M. Zhou",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "In order to improve the efficiency and quality of light in top-up mode at SSRF",
        "disturbance caused by leakage fields mismatch during injection should be minimized and stable. This could be evaluated by analysis of bunch by bunch residual betatron oscillation data",
        "using this method",
        "instability of tune distribution and damping repeatability could also be calculated. So we could evaluate the beam operation stability by the data analysis and discuss in the paper."
      ],
      "institutions": [
        "Funding: Work supported by National Natural Science Foundation of China (No.11575282 No.11375255 No.11305253)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mopb14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mopb14.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mopb14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOPB14",
      "page_number": "104",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPB16",
      "title": "Continuous Beam Energy Measurements at Diamond Light Source",
      "authors": [
        "N. Vitoratou",
        "P. Karataev",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Resonant Spin Depolarization (RSD) is a well-known technique that has been employed by Diamond Light Source (DLS) for beam energy measurements. In this project",
        "we study a new approach to make RSD compatible with user beam operation and provide a continuously updated online measurement. An array of four custom-made scintillation detectors has been installed around the beam pipe",
        "downstream of collimators to capture the highest fraction of lost particles and maximize the count rate. The excitation is gated to half of the stored bunches and the acquisition system counts losses in both halves independently. Using the count in the un-excited part for normalisation suppresses external factors that modify the loss rate. Different parameters of the measurement",
        "like excitation kick strength and duration have been explored to optimise depolarisation and to increase the reliability of the measurement."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mopb16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mopb16.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mopb16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOPB16",
      "page_number": "107",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPB17",
      "title": "Using a TE011 Cavity as a Magnetic Momentum Monitor",
      "authors": [
        "J. Guo",
        "J. Henry",
        "M. Poelker",
        "R.A. Rimmer",
        "R. Suleiman",
        "H. Wang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The Jefferson Lab Electron-Ion Collider (JLEIC) design relies on cooling of the ion beam with bunched electron beam constrained in a pair of long solenoids. The high current cooling electron beam needs to be generated in a magnetized electron source",
        "and the beam’s magnetization needs to be maintained during the acceleration and transport to the cooling channel. A non-invasive real time monitoring system is highly desired to quantify electron beam magnetization. The authors propose to use a passive copper RF cavity in TE011 mode as such a monitor. In this paper",
        "we present the mechanism and scaling law of this device",
        "as well as the design and preliminary test results of the prototype cavity."
      ],
      "institutions": [
        "Funding: Authored by Jefferson Science Associates, LLC with Laboratory Directed Research and Development funding, under U.S. DOE Contract No. DE-AC05-06OR23177."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mopb17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mopb17.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mopb17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOPB17",
      "page_number": "111",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 12,
  "scrape_time": "2025-10-10 17:46:25"
}