{
  "session_info": {
    "id": "WEPSB",
    "name": "WEPSB - Poster Session B",
    "url": "https://proceedings.jacow.org/rupac2016/html/wepsb.htm"
  },
  "papers": [
    {
      "paper_id": "WEPSB001",
      "title": "Particle Swarm Method for Optimization of Special RFQ Channel",
      "authors": [
        "V.V. Altsybeyev",
        "D.A. Ovsyannikov",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "MRTI RAS",
        "Moscow",
        "Russia",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "Particle swarm method is used for optimization of special RFQ channel. There is a considered possibility of separate preacceleration of the multicharged ions with the different A/Z ratios in single radio-frequency quadrupole (RFQ) channel. Magnitude of the injection energy into RFQ is about a few keV/u",
        "magnitude of the injection energy into booster or following linac cascade are 300 keV/u. Aim of optimization to change regular part of RFQ or matching section profile to improve outut parameters of the beams particles",
        "such as current",
        "emittance",
        "phase width",
        "etc. Phase ellipses of the beams partiles on input RFQ may be arbitrary oriented in phase space. In this case particle swarm method is effictive enough for optimizations.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb001.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB002",
      "title": "First Experimental Demonstration of the Extraction of Low Energy Beams from the ESR to the CRYRING@ESR",
      "authors": [
        "S.A. Litvinov",
        "Z. Andelkovic",
        "D. Beck",
        "A. Bräuning-Demian",
        "S. Fedotova",
        "W. Geithner",
        "F. Herfurth",
        "R. Hess",
        "C.M. Kleffner",
        "I. Kraus",
        "M. Lestinsky",
        "F. Nolden",
        "M. Steck",
        "G. Vorobyev",
        "GSI",
        "Darmstadt",
        "Germany",
        "The CRYRING@ESR facility will provide the unique possibility for studying properties of highly charged cooled stable and short-lived ions stored at low energy for atomic and nuclear research within the FAIR project. Heavy ion beams will be stored",
        "cooled and decelerated to energies between 10 and 4 MeV/u in the ESR and then delivered to the CRYRING@ESR. There is no dedicated kicker magnet for the fast extraction in this direction. However",
        "a specially developed distorted closed orbit of the beam stored in the ESR in combination with the injection kicker has been suggested for the extraction and experimentally verified in 2014. In the first experiment the ion beam was extracted and transported over a distance of 20 m towards the CRYRING@ESR. In the 2016 machine development run the heavy ion beam was successfully extracted from the ESR and delivered to the first fluorescent screen inside CRYRING@ESR for the first time. Detailed ion-optical simulations as well as the experimental results will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb002.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB002",
      "page_number": "351",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB003",
      "title": "Design Relativistic Charged Particle Beam Transportation Channels",
      "authors": [
        "G.P. Averyanov",
        "V.A. Budkin",
        "I.O. Osadchukpresenter",
        "MEPhI",
        "Moscow",
        "Russia",
        "This paper contains results of development new version (2016) of program for channels design high-energy beams of charged particles. The program includes application package modeling the dynamics of charged particles in the channel",
        "operational tools to change the channel parameters",
        "channel optimization tools and processing output beam parameters with graphic and digital presentation of its key features. The MATLAB (Scilab) was used as programming tools",
        "allows to make the source code modular",
        "compact and scalable. New object-oriented graphical user interface provides an interactive assembly of new or modernization of previously developed channel - selection and arrangement of its elements",
        "as well as the installation and the variation of their parameters. The relational database",
        "which is part of the new version of program",
        "providing additional functionality to the designer. It is intended for storage of the current development",
        "and to preserve the previously completed projects",
        "as well as other useful designer related information. A multi-output of all the main parameters of the beam at the output",
        "as well as anywhere in the channel. In this case",
        "the developer has the ability to interactively search and setting the optimum mode of operation channel."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb003.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB003",
      "page_number": "354",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB004",
      "title": "The Intelligent Object-oriented Interface in the Design Environment of The Charged Particles Relativistic Beams Transport Channels",
      "authors": [
        "G.P. Averyanov",
        "V.A. Budkin",
        "A.V. Kobylyatskiy",
        "I.O. Osadchukpresenter",
        "MEPhI",
        "Moscow",
        "Russia",
        "The effectiveness of the design during the computer modeling is significantly determined by the user interface convenience of the application package and the time adaptation of the user to that application. This paper presents a new approach in the implementation of KATRAN software interface for the transport channels design of the charged particles relativistic beams. The interface is a sequence of operations for the designer during the virtual channel creation ' setting beam parameters at the channel input",
        "the choice of the displayed elements of the channel",
        "the channel assembly",
        "setting the calculation algorithm with the parameters optimization. Thus the immersion of the designer into the details of the computing environment",
        "the features of the software and channel modeling mathematical methods is not needed. The data objects are the typical elements of the transport channels (quadrupole lenses",
        "magnets",
        "open intervals",
        "etc.). The work is carried out in interactive mode. After the \"build and run\" of the channel is finished",
        "the full-screen multi-factor analysis of all major parameters of the beam and channel transparency is provided."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb004.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB004",
      "page_number": "357",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB005",
      "title": "On the Minimax Problem of Beam Dynamics Optimization",
      "authors": [
        "M.A. Mizintseva",
        "D.A. Ovsyannikov",
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The problem of simultaneous optimization of the ensemble of trajectories and some selected trajectory arises in the research of the charged particle beam dynamics. The present work suggests the use of a smooth functional for the evaluation of the selected trajectories and a minimax functional for the evaluation of the dynamics of the beam of trajectories. A combination of those functionals is considered. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb005.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB005",
      "page_number": "360",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB006",
      "title": "On Modeling and Optimization of Intense Quasiperiodic Beam Dynamics",
      "authors": [
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The paper is devoted to quasiperiodic beam dynamics investigation. Particle density is modeled by trigonometric polynomial. Space charge field is represented in the similar form. This approach is applied to beam dynamics investigation in klystron-type buncher. Numerical algorithm of polynomial coefficients calculation from the positions and impulses of model particles is formalized. As a result Coulomb field intensity is expressed in the form of integral over the set of particle phase states. Integro-differential beam evolution model is presented. Analytical expression of the variation of beam dynamics quality criterion is obtained. It makes possible directed methods using for beam dynamics optimization. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb006.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB006",
      "page_number": "363",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB007",
      "title": "On Application of Monte Carlo Method for Poisson Problem Solving",
      "authors": [
        "L.V. Vladimirova",
        "I.D. Rubtsova",
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia",
        "The paper presents the application of random grid walk for Dirichlet problem solving for Poisson equation. Boundary value problem is discretized and reduced to the system of linear algebraic equations. The matrix of this system is used for stochastic matrix constructing. Thus",
        "there is a possibility of Markov chains obtaining. The special random value is defined on Markov chain trajectories; this value is used for approximation of the desired solution. The advantages of this method are discussed in the paper. The algorithm is applied for electric potential calculation in the cell of support lattice of exit window in large-aperture electron accelerator."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb007.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB007",
      "page_number": "367",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB008",
      "title": "About Behavior of Electrons and Ions in the Accelerating Interval",
      "authors": [
        "Allrussian Electrotechnical Institute",
        "Moskow",
        "Russia",
        "MEPhI",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The behavior of electron-ion ensemble accelerated in the diode is studied. Hot electrons are described by means of the distribution function which is a solution of the collisionless kinetic function depending not only from integrals of motion. To describe the cold ions the hydrodynamics equations are used. The possibility of the ion-sound velocity excess of the ions is shown. The expression for the electron gas pressure is received. The dependence of relative density of the ions on the coordinate is discussed in the case of closed phase trajectories. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb008.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB008",
      "page_number": "371",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB009",
      "title": "The Behavior of Powerful Relativistic Electron Beam With Elliptical Cross-Section in Longitudinal Magnetic Field",
      "authors": [
        "Allrussian Electrotechnical Institute",
        "Moskow",
        "Russia",
        "MEPhI",
        "Moscow",
        "Russia",
        "The behavior of relativistic intense electron beam with elliptical cross-section moving in a longitudinal magnetic field is investigated with the help of self-consistent model. The solutions for the beam envelopes are obtained in the case of the beam current differed from Alfven limit and the beam charge neutralized. The conditions of stationary beam propagation are determined",
        "however it is discovered that for the case of non-zero self-consistent magnetic field the stationary beam propagation is violated",
        "the partial emittance oscillations being observed. The found time- dependence of the partial emittances and the beam envelopes illustrates the effect of emittance transfer caused by the coupled particle motion in magnetic field."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb009.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB009",
      "page_number": "373",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB010",
      "title": "The Use of Multi-Objective Genetic Algorithms for Accelerator and Light Source Optimization",
      "authors": [
        "Y.A. Fomin",
        "V. Korchuganov",
        "A.S. Smygacheva",
        "NRC",
        "Moscow",
        "Russia",
        "The nonlinear effects are very important in the development of new accelerators and synchrotron light sources. Nowadays they are one of the main factors limiting the achievement of the required facility parameters. In many cases in the development of new accelerators the analytical estimations give very coarse results and in some cases they don't apply at all. Therefore",
        "the best way to research and design accelerators is to use numerical simulation. Nevertheless",
        "very often during complex physical process simulation (taking into account many nonlinear effects) the use of classical optimization methods is difficult and does not give the desired results. The article deals with the application of multi-objective optimization using genetic algorithms for accelerators and light sources. These algorithms allow both simple linear and complex nonlinear accelerator structures to be optimized with the same effectiveness to achieve the required facility parameters."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb010.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB010",
      "page_number": "376",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB011",
      "title": "About Development System for the Analysis of Charged Particle Beam Dynamics",
      "authors": [
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Modern research process of scientific problems often requires large computational resources. To solve them we have to use distributed computing systems. Researcher groups need to use them simultanieously and mostly remotely. The paper describes build of the distributed system for collaborative research process. As example was chosen a problem of the optimization dynamics charged particle beams using high-performance computing systems. The solution of many topical tasks leads to nonlinear optimization problems for example the controlling beams of charged particles. Optimization is performed by minimizing some quality functional the choice of which is a corollary fact that the control functions which provides a functional minimum should determine the accelerating structure with the desired characteristics. The problem is usually formulated as finding the control functions for which the controlled system satisfies the given constraints. There is a necessity of the quality functional choice which ensures the problem solution. Research objectives: the development of a distributed information-computational system for the analysis of charged particle beam dynamics. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb011.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB011",
      "page_number": "379",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB012",
      "title": "On The Beam Dynamics Simulation In The Injection System",
      "authors": [
        "A.D. Ovsyannikov",
        "S.A. Kozynchenkopresenter",
        "V.A. Kozynchenko",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "When developing a particle accelerator for generating the high-precision beams",
        "the injection system design is of importance",
        "because it largely determines the output characteristics of the beam. At the present paper we consider the injection systems consisting of electrodes with given potentials. The design of such systems requires carrying out simulation of beam dynamics in the electrostatic fields. For external field simulation we use the new approach",
        "proposed by A.D. Ovsyannikov",
        "which is based on analytical approximations",
        "or finite difference method",
        "taking into account the real geometry of the injection system. The software designed for solving the problems of beam dynamics simulation and optimization in the injection system for non-relativistic beams has been developed. Both beam dynamics and electric field simulations in the injection system",
        "that use analytical approach and finite difference method have been made and the results presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb012.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB012",
      "page_number": "382",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB013",
      "title": "On Approach for Resonant Frequency Tuning in Drift Tube Structures on the Designing Stage",
      "authors": [
        "I. Skudnova",
        "V.V. Altsybeyev",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "Current research considers the interdigital H-mode linear resonant accelerator with drift tubes mounted inside the cavity. The focus of the study has been on the dependence of resonant frequency on the parameters of the geometry. Since Alternating-Phase-Focusing (APF) type of accelerator is investigated",
        "the efficiency of the operation depends on the synchronization of the charged particle velocity and accelerating field oscillations. Researchers can control it by the variation of longitudinal size of the cells of the structure (periods). On the other hand",
        "the effective performance of the resonant system requires the equality of resonant frequencies of its cells",
        "because it affects the uniformity of accelerating field distribution along the axis. The diversity of cells longitudinal sizes causes the deviation from the particular value of the resonant frequency. This aberration can be eliminated by the adjustment of other geometry parameters: period's length",
        "gap ratio and drift tube diameter. We have conducted the study to analyze the relation between resonant frequency and these values. Using the this dependency we can tune the geometry parameters of each period in the structure. We first create the computer-aided design (CAD) geometry model of the accelerator cavity. Then",
        "using Comsol Multiphysics",
        "the platform for physics-based modeling and simulation",
        "we conduct the calculation of resonant frequencies."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb013.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB013",
      "page_number": "386",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB014",
      "title": "Symmetrical Parameterization for 6D Fully Coupled One-Turn Transport Matrix",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Symmetry properties of 6D and 4D one-turn symplectic transport matrices were studied. A new parameterization was proposed for 6D matrix",
        "which is an extension of the Lebedev-Bogacz parameterization for 4D case. The parameterization is fully symmetric relative to radial",
        "vertical and longitudinal motion. It can be useful for lattices with strong coupling between all degrees of freedom."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb014.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB014",
      "page_number": "389",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPSB015",
      "title": "On the Integro-Differential Equations for   Dynamics of Interacting Charged Particles Modeling",
      "authors": [
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia"
      ],
      "institutions": [],
      "abstract": "In this paper we investigate the integro-differential model for the dynamics of charged particles with smooth interaction for the analysis and optimization of intense charged particle beams motion in accelerating and focusing structures. Introduced mathematical models allows us to calculate the first variation of the different functionals characterizing the desired parameters of accelerators in analytical form. Thus mathematical model can be effectively used in the analysis and optimization of charged particles dynamics in accelerators. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb015.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB015",
      "page_number": "392",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB016",
      "title": "Coupled Bunch Instabilities in the Storage Rings",
      "authors": [
        "A.S. Smygacheva",
        "Y.A. Fomin",
        "V. Korchuganov",
        "NRC",
        "Moscow",
        "Russia",
        "Coherent instabilities of the bunched beam are one of the reasons that limit a total beam current in the storage rings. Although there are solutions of this problem",
        "the estimation and reduction of wake-fields influence on the longitudinal beam dynamics remain important things. In the article we return to the subject of coherent instabilities of the unevenly-filled bunches in the storage rings."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb016.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB016",
      "page_number": "395",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB017",
      "title": "Chromatic and Nonlinear Dynamics of Antiprotons Injected to Collector Ring at FAIR",
      "authors": [
        "D.B. Shwartz",
        "I. Koop",
        "P.Yu. Shatunovpresenter",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "NSU",
        "Novosibirsk",
        "Russia",
        "Collector Ring (CR) is the storage ring for capturing and stochastic cooling of secondary beams of antiprotons or secondary ions. It is a part of a FAIR project being presently at the early start of a construction phase. Due to the proposed large acceptance in both transverse and longitudinal phase spaces",
        "the chromatic aberrations and their correction with sextupoles are very important for capture efficiency. Calculations results for beam transfer from Pbar target to the ring are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb017.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB017",
      "page_number": "398",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB018",
      "title": "Beam Dynamics Calculation of Electron Bunch Sequence Passing Through Dielectric",
      "authors": [
        "LETI",
        "Saint-Petersburg",
        "Russia",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "The present work involves modeling the electron beams dynamics for development of new THz source based on cylindrical dielectric waveguide. The sequence of relativistic electron bunch generates Cherenkov radiation",
        "which is a superposition of the TM and HEM-modes. The distances between bunches is selected for creating of monochromatic THz radiation*. We made calculation of beam dynamics taking into account the Space Charge and focusing field with help of original BBU 3000 code. We present result for different parameters of waveguide and different offsets of bunches. The main parameter of radiation was investigated: length of wave pocket",
        "monochromaticity and frequency.",
        "* Altmark A",
        "Kanareykin A. The source of THz radiation based on dielectric waveguide excited by sequence of electron bunches// 2016 J. Phys.: Conf. Ser. 732 012037"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb018.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB018",
      "page_number": "401",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB019",
      "title": "Orbital Motion in Multipole Fields via Multiscale Decomposition",
      "authors": [
        "A.N. Fedorova",
        "M.G. Zeitlinpresenter",
        "RAS/IPME",
        "St. Petersburg",
        "Russia"
      ],
      "institutions": [],
      "abstract": "We present applications of methods of nonlinear local harmonic analy- sis in variational framework for a description of multiscale decomposition in polynomial/rational approximations (up to any order) for nonlinear motions in arbitrary n-pole fields. Our approach is based on the methods allowed to consider dynamical beam/particle localization in phase space and provided exact multiscale representations via nonlinear high-localized eigenmodes for observables with exact control of contributions to motion from each underlying hidden scale. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb019.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB019",
      "page_number": "404",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB020",
      "title": "On a New Approach for Description of Self-Consistent Distributions for a Charged Particle Beam",
      "authors": [
        "O.I. Drivotin",
        "D.A. Ovsyannikov",
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia",
        "The present report is concerned with the problem of particle phase space distributions for a charged particle beam. A new approach is presented. It provides the possibility to specify various coordinates in the phase space. The main attention has been focused on the case where motion integrals are taken as phase coordinates. Using such coordinates",
        "one can obtain a lot of self-consistent distributions. Some distributions for a breathing beam are considered as examples: generalized Brillouin flow",
        "generalized KV distribution",
        "and others. Besides",
        "this approach allows simple graphical representation of various self-consistent distributions."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb020.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB020",
      "page_number": "407",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB021",
      "title": "McMillan Map and Its Application for Accelerator Physics",
      "authors": [
        "T. Zolkin",
        "S. Nagaitsev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "McMillan map is an important discrete time model of 1D transverse nonlinear accelerator lattice. We will discuss a full analytical theory based on parametrization of individual canonical biquadratic curves*. Using the normal forms provided in* we were able to generalize this result to entire phase-plane of finite trajectories and calculate mechanical action-angle coordinates. In addition we will present an alternative way of analytical extraction of phase-advance variable out of map's invariant of motion (Danilov Theorem). The connection of these results with possible 2D generalizations",
        "axially symetric and 2D-magnetostatic McMillan lenses",
        "is presented.",
        "Iatrou",
        "A.",
        "& Roberts",
        "J. A. (2002). Integrable mappings of the plane preserving biquadratic invariant curves II. Nonlinearity",
        "15(2)",
        "459.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb021.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB022",
      "title": "Vanishing TMCI",
      "authors": [
        "T. Zolkin",
        "A.V. Burov",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The space charge (SC) is known to be one of the major limitations for the collective transverse beam stability. When SC is strong (i.e. space charge tune shift is much greater than synchrotron tune) the problem allows an exact analytical solution. When machine chromaticity is not equal to zero the beam is unstable for any wake amplitude. On the other hand",
        "when chromaticity is equal to zero the instability has a threshold and respectively called TMCI (transverse mode coupling instability). The question of convergence of TMCI threshold is still open. In this presentation we will consider various longitudinal distribution functions of a bunch (bi-Gaussian and Hoffman-Pedersen distributions",
        "Boxcar model and bunch in a square potential well) under the action of driving and detuning wake forces. We will discuss the appearance of instability for different families of wake functions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb022.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB023",
      "title": "Formation of a Given Distribution of the Beam in the Periodic Channel",
      "authors": [
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "The article considers the problem of forming a predetermined distribution density of the beam (in the phase or configuration space) in a periodic channel. The proposed approach is based on a method of constructing a beam mapping in the form of a truncated series consisting from matrices up to necessary order of nonlinearities. Similar approach allows us to formulate the given task as an optimization problem for some special functionals",
        "created from parameters of the accelerator. Some results of the testing tasks are demonstrated."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb023.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB023",
      "page_number": "411",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB024",
      "title": "Program Complex for Modeling of the Beam Transverse Dynamics and Orbit Correction in Nuclotron, LHEP JINR",
      "authors": [
        "I.V. Antropov",
        "V.O. Khomutova",
        "V.A. Kozynchenkopresenter",
        "D.A. Ovsyannikov",
        "A.O. Sidorin",
        "G.V. Trubnikov",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "I.L. Avvakumova",
        "A.O. Sidorin",
        "G.V. Trubnikov",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "O.S. Kozlov",
        "V.A. Mikhaylov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Program complex for modelling of transverse dynamic of particle beams and orbit correction at Nuclotron synchrotron (LHEP JINR) is considered in current work. The program complex provides calculation of transverse dynamic of charged particle beams in Nuclotron and its axis",
        "based on linear model with transport matrix of lattice elements",
        "calculation of Nuclotron Twiss parameters",
        "acceptance and emittance of the beam. A possibility to optimize the location of beam position monitors (pick-up) and multipole correctors is foreseen as well as calculation of the orbit with measuring data of pick-up stations of Nuclotron. Program complex includes realizations of orbit correction algorithms with response matrix and provides correction of the orbit in Nuclotron. User's graphic interface provides interaction of user with program complex",
        "including performance on demand of the user of separate functions of the program complex",
        "providing input and maintenance of parameters",
        "download from file and record into the file of parameters and calculation results",
        "graphical view of the calculations results in program complex. Program software environment is integrated with MAD-X program (upload",
        "processing of data to and from",
        "visualization). Format of input and output data is compatible with relevant MAD-X format."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb024.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB024",
      "page_number": "414",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB025",
      "title": "Application of GPGPUs and Multicore CPUs in Optimization of Some of the MpdRoot Codes",
      "authors": [
        "A.I. Fatkina",
        "O.O. Iakushkin",
        "N.O. Tikhonov",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "We analyzed the ways to optimize MPDRoot algorithms using existing solutions from external libraries. We also examined the libraries designed to work with graphics accelerators and multi-core CPUs",
        "such as cuRAND",
        "cuFFT and OpenCL FFT. The paper describes the ways to expedite a portion of Kalman filter by transferring it to GPUs or multi-core CPUs using the implementation included into the MPDRoot package."
      ],
      "institutions": [
        "Funding: This research was partially supported by SPbU (Saint Petersburg State University) grants 9.37.157.2014, 0.37.155.2014 and Russian Foundation for Basic Research grant (project no. 16-07-01113)."
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb025.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB025",
      "page_number": "416",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB026",
      "title": "Dynamical Aperture Beyond Perturbations: From Qualitative Analysis to Maps",
      "authors": [
        "A.N. Fedorova",
        "M.G. Zeitlinpresenter",
        "RAS/IPME",
        "St. Petersburg",
        "Russia",
        "We start with a qualitative approach based on the detailed analysis of smoothness classes of the underlying functional spaces provided possible evaluation of the dynamical aperture in general nonlinear/polynomial models of particle/beam motion in accelerators. We present the applications of discrete multiresolution analysis technique to the maps which arise as the invariant discretization of continuous nonlinear polynomial problems. It provides a generalization of the machinery of local nonlinear harmonic analysis",
        "which can be applied for both discrete and continuous cases and allows to construct the explicit multiresolution decomposition for solutions of discrete problems which are the correct discretizations of the corresponding continuous cases."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb026.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB026",
      "page_number": "419",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB027",
      "title": "Acceleration of Electron Bunches Generated by a Laser Pulse Interacting with an Inhomogeneous Plasma",
      "authors": [
        "JIHT RAS",
        "Moscow",
        "Russia",
        "The process of the generation of a short electron bunches by a laser pulse of relativistic intensity that passes through a sharp boundary of plasma and their subsequent acceleration in the wake wave of a laser pulse has been analytically studied*. It is shown in one-dimensional geometry that one physical mechanism that is responsible for the generation of electron bunches is self-injection of electrons into the wake field of a laser pulse",
        "which occurs due to the mixing of electrons during the action of the laser pulse on plasma. The length of the trapped electron bunch is determined by the effect of kinematic grouping",
        "which consists in the fact that electron self-injection into the wake wave occurs at the point of space and the moment of time when the previously trapped electrons are close to this point. Subsequently",
        "during acceleration of trapped electrons in the wake wave",
        "the length of the bunch increases as a result of the initial spread in the conditions of electron injection and their mutual repulsion in the bunch. Simple analytic relationships were obtained that can be used for estimating the length",
        "charge of an electron bunch and the spread of electron energies**.",
        "*S.V. Kuznetsov Tech. Phys. Lett.",
        "2016",
        "Vol. 42",
        "No. 7",
        "pp. 740-742.  ** S.V. Kuznetsov JETP",
        "2016",
        "Vol. 123",
        "No. 2",
        "in print.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb027.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB028",
      "title": "Computer Simulation of the Slow Beam Extraction From Nuclotron",
      "authors": [
        "A.D. Kovalenko",
        "I.L. Avvakumovapresenter",
        "JINR/VBLHEP",
        "Moscow",
        "Russia",
        "A.D. Kovalenko",
        "V.A. Mikhaylov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "* Issinsky I.",
        "Mikhaylov V.",
        "Shchepunov V. Nuclotron lattice. Proceedings of EPAC 1990",
        "p.458.  ** Kovalenko A. Nuclotron: status and future. Proceedings of EPAC 2000",
        "p.554. *** Agapov N. et al. Slow beam extraction from Nuclotron. Proceedings of the 2001 Particle Accelerator Conference",
        "p.1646."
      ],
      "institutions": [],
      "abstract": "The results of modelling of ion's motion during beam slow extraction from Nuclotron at the energy 6 GeV/Amu are shown in this work. Influence of sextupole field component of dipole magnets and fringe fields of Lambertson's magnets on the characteristics of extracted beam was analyzed. The calculations have been done via MadX. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb028.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB028",
      "page_number": "422",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB029",
      "title": "Simulation of Nonlinear Dynamics of Radiation Formed by High-Current Beams of Charged Particles in Multidimensional Space-Periodic Structures",
      "authors": [
        "Belarussian State University",
        "Scientific Research Institute of Nuclear Problems",
        "Minsk",
        "Belarus",
        "The principle of volume free electron lasers (VFEL) is based on the interaction of relativistic electron beam with two or more strong coupled electromagnetic waves generating in essentially non-one-dimensional geometry as a result of dynamical Bragg diffraction inside the resonator. Such resonator is a multidimensional space-periodic structure (natural or artificial electromagnetic (photonic) crystal). Previously VFEL were considered in various two- and three-wave diffraction geometries theoretically and experimentally. Here the general system of equations describing the various variants of multiple beam multi-wave VFEL is proposed. It takes into account multisection resonator",
        "the dispersion of electromagnetic waves in the system",
        "external reflectors etc. The mathematical modeling of two-beam two-wave VFEL was carried out using the proposed system of equations. It is shown that the change of current density of electron beams leads to change of VFEL chaotic dynamics and is one of the ways of chaos control in the system.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb029.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB030",
      "title": "Parallelization of Envelope Dynamics of High Intensive Beams",
      "authors": [
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia",
        "In this work the survey of methods for high intensive beam dynamics is given. As an alternative to them the approach based on envelope dynamics was used. This method is focusing on the use of the matrix form for Lie algebraic methods for calculating the beam dynamics in the presence of self-field of the beam. In particular",
        "the corresponding calculations are based on the predictor-corrector method. Pros and cons of using described approach on hybrid systems are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb030.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB030",
      "page_number": "425",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB031",
      "title": "Connection of Betatron Oscillations with the Properties of Synchrotron Radiation",
      "authors": [
        "Moscow State Academy of Water Transport",
        "Moscow",
        "Russia",
        "The reason we study this topic",
        "is that some properties of synchrotron radiation derived for a homogeneous magnetic field",
        "are not consistent with the experimental data. Since the main source of synchrotron light are storage rings",
        "the specifics of each machine in this case should be taken into account by its beta function. Vertical and radial small oscillations for the problem of radiation can be determined in the linear approximation but for the angular velocity necessary to maintain the guadratic terms. Following the Schwinger method we define the components of the linear polarization for the radiation intensity with the first quantum correction although in this case it is a small. After transfomations we obtain the genaral formulas for the spectral-angular distributions",
        "depending on the axial velocity of the charged particle; moreover is considered the point in the orbit at which the radiation is removed. Found expressions",
        "as in the experiments revealed that the radiation is not completely linearly polarized",
        "and that one of the radiation components in the orbital plane does not vanish.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb031.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB032",
      "title": "Numerical Analysis of Cavity Mode Operation and Electron Beam Dynamics in Lebedev Institute Microtron",
      "authors": [
        "V.S. Dyubkov",
        "Y.A. Bashmakov",
        "Y. Lozeev",
        "MEPhI",
        "Moscow",
        "Russia",
        "LPI",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Dynamics of electrons in classic microtron is studied. 3D cavity model is developed and electromagnetic field distribution is simulated. Dependence of output beam parameters on microtron operation mode is investigated and discussed. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb032.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB032",
      "page_number": "428",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB033",
      "title": "Focusing of Charged Particles by Magnetic Dipoles",
      "authors": [
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The possibility of using magnetic dipoles for tight focusing of charged particles is discussed. Plane-parallel geometry of the magnetic poles of the dipoles greatly simplifies lens design and reduces the cost of creating a focusing system. Focusing is performed using gradient pulses of force of the magnetic dipoles. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb033.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB033",
      "page_number": "431",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB034",
      "title": "The Electromagnetic Field Structure in the Circular Waveguide with Transverse Boundary",
      "authors": [
        "Saint-Petersburg State University",
        "Saint-Petersburg",
        "Russia",
        "S.N. Galyamin",
        "A.V. Tyukhtin",
        "V.V. Vorobev",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "The study of the electromagnetic field in a circular waveguide having a partial dielectric filling is of interest for a series of applications including new methods of particle acceleration. We consider the structure of the electromagnetic field in the circular waveguide which consists of two semi-infinite parts. One of them is empty and the other one has a cylindrical dielectric layer and a coaxial vacuum channel. Incident electromagnetic field is a symmetrical TM mode launching either from the vacuum part or from the partially dielectric part. Such mode can be excited by a particle bunch moving along the waveguide axis. The analytical investigation of reflected and transmitted fields is performed. On the basis of this study",
        "we develop an algorithm for numerical calculation and demonstrate properties of waveguide modes excited because of presence of transversal boundary. Moreover we perform direct numerical simulation using Comsol Multiphysics. The comparison of results of our algorithm with simulations is given",
        "and the good agreement between both methods is demonstrated."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb034.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB034",
      "page_number": "434",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB035",
      "title": "Model of the Optimal Parameters Choice for the Charged Particles Beam",
      "authors": [
        "S.A. Nemnyugin",
        "O.A. Malafeyev",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "Problem of the optimal parameters choice for the charged particles beam is considered. The beam is characterized by the set of control parameters and multiple parameters which characterize its quality. So multiple criteria of optimization should be taken into account. Among possible criteria of optimization following ones should be mentioned: energy",
        "intensity",
        "biological efficiency and so on. It is assumed that in general case choice of the control parameters which is optimal for all criteria is not possible. The problem is formulated as the conflict control problem. The case is considered when parameters which should be optimized forms the vector. Finding of the compromise solution is considered. The method and computing algorithms are proposed. Present work is further extension of *.",
        "* G. V. Alferov",
        "O. A. Malafeyev",
        "S. A. Nemnyugin. Charged Particles Beam Focusing with Uncontrollable Changing Parameters // 2014 2nd International Conference on Emission Electronics",
        "Proceedings",
        "2014. P. 25-27."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb035.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB035",
      "page_number": "437",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB036",
      "title": "Gold Ions Beam Losses at the Nuclotron Booster",
      "authors": [
        "A.V. Philippov",
        "A. Tuzikovpresenter",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The calculation results of the gold ions beam losses along the Nuclotron Booster perimeter are given. The presented results take the ion stimulated desorption from the cold surface of the vacuum chamber and collimation of charge-exchanged gold ions into account.",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb036.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB036",
      "page_number": "440",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPSB037",
      "title": "Beam Transfer From Heavy-Ion Linear Accelerator HILAC Into Booster of NICA Accelerator Complex",
      "authors": [
        "A. Tuzikov",
        "A.V. Butenko",
        "A.A. Fateev",
        "S.Yu. Kolesnikov",
        "I.N. Meshkov",
        "V.A. Mikhaylov",
        "V.S. Shvetsov",
        "A.O. Sidorin",
        "A.I. Sidorov",
        "G.V. Trubnikov",
        "V. Volkov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Designs of systems of ion beam transfer from the linear accelerator HILAC into the Booster of the NICA accelerator complex (JINR",
        "Dubna) including the transport beam line HILAC-Booster and the beam injection system of the Booster are considered in the report. The proposed systems provide multivariant injection for accumulation of beams in the Booster with required intensity. Special attention is paid to various aspects of beam dynamics during its transfer. Main methods of beam injection into the Booster are described. These are single-turn",
        "multiturn and multiple injection ones. Results of beam dynamics simulations are presented. Status of technical design and manufacturing of the systems' equipment is also highlighted."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb037.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB037",
      "page_number": "443",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB038",
      "title": "Multigap and Polyharmonic Bunching Systems at FLNR Cyclotrons",
      "authors": [
        "I.V. Kalagin",
        "B. Gikal",
        "G.G. Gulbekyan",
        "S.V. Prokhorov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "JINR/FLNR",
        "Moscow region",
        "Russia",
        "Since 1997",
        "different variants of bunching systems have been used at the axial injections of FLNR cyclotrons to increase ions capture into acceleration efficiency. Combination of two single gap Sine and Line bunchers are used at the axial injections of U400 and DC110 cyclotrons. Since 2015",
        "a single gap double RF harmonic buncher has been installed into the upper part of the U400M injection in addition to the lower sine buncher",
        "the experimental results will be presented. For the HV axial injection of the new DC280 cyclotron",
        "two variants of polyharmonic bunchers will be used: a multigap buncher and a single gap one."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb038.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB038",
      "page_number": "446",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB039",
      "title": "New Techniques for Operation and Diagnostics of Relativistic Electron Coolers",
      "authors": [
        "J. Dietrich",
        "M.W. Bruker",
        "A. Hofmann",
        "E. Riehn",
        "T. Weilbach",
        "HIM",
        "Mainz",
        "Germany",
        "K. Aulenbacher",
        "W. Klag",
        "IKP",
        "Mainz",
        "Germany",
        "M.I. Bryzgunov",
        "V.V. Parkhomchuk",
        "V.B. Reva",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The Helmholtz Institut Mainz (HIM) performs experiments related to possible improvements of high-energy d.c.-electron coolers. Results and activities concerning non-invasive beam diagnostics and beam control at large operating currents will be shown. Furthermore",
        "progress of our project to use turbo generators as a means for potential-free power generation in high-energy electron coolers is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb039.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB039",
      "page_number": "449",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB040",
      "title": "Commissioning of the 60 keV Electron Cooler for the NICA Booster",
      "authors": [
        "A.V. Bubley",
        "M.I. Bryzgunov",
        "A.P. Denisov",
        "A.D. Goncharov",
        "V.M. Panasyuk",
        "V.V. Parkhomchuk",
        "V.B. Reva",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The 60 keV electron cooler for the NICA booster was designed and constructed at BINP SB RAS. The article describes results of various measurements obtained during its commissioning. Also some details of design and construction of the cooler are discussed. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb040.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB040",
      "page_number": "452",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB041",
      "title": "Stochastic Cooling System at NICA Project",
      "authors": [
        "I.V. Gorelyshev",
        "A.O. Sidorin",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "N. Shurkhno",
        "G.V. Trubnikov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Stochastic cooling system is one of the crucial elements for luminosity preservation at NICA accelerator-collider complex. The foundation of main parameters of the stochastic cooling system is provided. The preparatory experimental work for longitudinal stochastic cooling was performed at Nuclotron accelerator. The description of Nuclotron system components",
        "adjustment algorithms and remote control is given."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb041.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB041",
      "page_number": "455",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB042",
      "title": "Commissioning of Electron Cooling Devices at HIRFL-CSR",
      "authors": [
        "X.D. Yang",
        "G.H. Li",
        "J. Li",
        "X.M. Ma",
        "L.J. Mao",
        "M.T. Tang",
        "T.L. Yan",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Electron cooling plays an important role in the Heavy Ion Research Facility of Lanzhou cooler storage ring(HIRFL-CSR). Two electron coolers were equipped in main ring(CSRm) and experimental ring(CSRe) in HIRFL-CSR respectively. Two electron cooling devices have commissioned for twelve years since they were installed and completed in 2004. The function and operation procedure of electron cooler were presented in this report. Their performance and the highlights of experiments results were described. Their commission and optimization were summarized here. The issues and troubles during the commission were enumerated and collected in this presentation. The future upgrade and improvement were suggested",
        "and the new operation scenario and requirement were proposed."
      ],
      "institutions": [
        "Funding: National Natural Science Foundation of China, NSFC Grant No. 11375245"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb042.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB042",
      "page_number": "458",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPSB043",
      "title": "Status of a THz source based on a FEL",
      "authors": [
        "Y.J. Pei",
        "G. Feng",
        "X.Y. He",
        "Y. Hong",
        "G. Huang",
        "D. Jia",
        "K. Jin",
        "P. Lu",
        "L. Shang",
        "B.G. Sun",
        "Zh. X. Tang",
        "W. Wei",
        "K. Xuan",
        "Z. Zhao",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Q.S. Chen",
        "M. Fan",
        "T. Hu",
        "B. Qin",
        "P. Tan",
        "Y.Q. Xiong",
        "HUST",
        "Wuhan",
        "People's Republic of China",
        "DESY",
        "Hamburg",
        "Germany",
        "USTC/PMPI",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "DICP",
        "Dalian",
        "People's Republic of China",
        "Abstract THz wave have many special performances so that it will be applied in many field. So far there were many kind of THz Source",
        "one of them is based on a FEL that can produce high power (~kW). This paper will describe the design of a THz source based on a FEL which is consists of a LINAC of 14MeV",
        "undulator and a optical resonance cavities. The LINAC was composed of a novel EC-ITC-RF gun",
        "constant gradient travelling wave accelerator with a collinear absorbing load",
        "focusing system",
        "RF power system",
        "beam diagnostic system",
        "vacuum system",
        "control system and so on. The LINAC was installed on November of 2014. Last year",
        "we finished the install of the undulator and the optical resonance cavities. Now the LINAC has been testing and commissioning for THz radiation test. So far",
        "the beam parameters tested of the LINAC are as the following: beam Energy is of 13.58MeV",
        "macro pulse current is of 655mA",
        "μpulse beam current is of 30A",
        "beam macro pulse length is of 1-2's",
        "beam bunch length(μpulse) is of 8ps",
        "energy spread of 0.33%",
        "normal beam emmitance is of 24.1mm.mrad.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb043.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB044",
      "title": "Design and Calculation of Cylindrical Electrostatic Deflector for the Transport Channel of the Heavy Ion Beam",
      "authors": [
        "N.Yu. Kazarinov",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "JINR/FLNR",
        "Moscow region",
        "Russia"
      ],
      "institutions": [
        "The cylindrical electrostatic deflector is used in the beam transport channel of GALS spectrometer that is created at U400M cyclotron in Flerov Lab of Nuclear Reaction of Joint Institute for Nuclear research. The design and calculation of the deflector are presented in this report. The angular length of the electrodes and gap between potential electrode and screen are found by using of the minimization procedure."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb044.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB044",
      "page_number": "461",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPSB045",
      "title": "The Way To Improve Conformity Of Proton Therapy",
      "authors": [
        "I.A. Yakovlev",
        "S.V. Akulinichev",
        "Y.K. Gavrilov",
        "RAS/INR",
        "Moscow",
        "Russia",
        "VINCA",
        "Belgrade",
        "Serbia",
        "In the case of small tumors the pencil beam width may be comparable with the target size. In these cases the application of classic method of passive beam scattering with a one-stage formation of dose distribution may be reasonable. However",
        "the last method in its standard implementation fails to provide the dose conformity: either the maximal dose exceeds the tumor volume on its proximate site or the dose deviates too much within the tumor. In order to overcome this shortcoming of the passive scattering method",
        "we suggest a new construction of a two-component ridge filter (the corresponding patent is pending). We have performed a series of calculations with the Monte-Carlo code SRNA in order to find the optimal construction from the point of view of dose delivery accuracy and of the device manufacturability. With that ridge filter the 95% isodose does not notably leave the tumor volume. The usual 'wings' of isodoses on proximate side are now absent and the volume of irradiated healthy tissue is significantly reduced. The experimental tests with proton beams are now in progress."
      ],
      "institutions": [
        "Funding: Institute for nuclear research of RAS (INR), Moscow 117312, Russia"
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb045.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB045",
      "page_number": "464",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB046",
      "title": "A Cyclotron Complex for Acceleration of Carbon Ions",
      "authors": [
        "V.L. Smirnov",
        "S.B. Vorozhtsov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "An accelerating complex for hadron therapy is proposed. Facility consists of two superconducting cyclotrons and is aimed to produce beams of 12C6+ ions with energy of 400 MeV/nucleon. Accelerator-injector is a compact 70 MeV/nucleon cyclotron. Main machine is separated sector cyclotron consisting of six magnets. Basic features of the main cyclotron are high magnetic field",
        "compact size",
        "and feasible design of a magnetic system. The advantages of the dual cyclotron design are typical of cyclotron-based solutions. The first design studies of the sector magnet of the main cyclotron show that the beam dynamics is acceptable with the obtained magnetic field. Due to its relatively compact size (outer diameter of 12 m) the complex can be an alternative to synchrotrons. Design study of the main cyclotron is described here."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb046.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB046",
      "page_number": "467",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB047",
      "title": "Electron Accelerators in Production of Isotopes for Nuclear Medicine",
      "authors": [
        "NSC/KIPT",
        "Kharkov",
        "Ukraine",
        "The main criterion for the selection of radioisotope for nuclear medicine is the ratio of the accumulation of radiotracer in the pathological focus of relatively normal tissue. It is most important criterion for use of isotopes in nuclear medicine. These isotopes must be produce with high specific activity and a sufficiently low power penetrating radiation. Production of isotopes 99Mo",
        "67Cu",
        "195mPt",
        "149Pm",
        "and 153Sm with high specific activity is implemented on the electronic accelerator NSC KIPT. The feature of the development of technology of medical isotopes in this case is use of a classic extraction of 99Mo",
        "67Cu",
        "195mPt",
        "149Pm",
        "and use of new method of recoil nuclei from nanoparticles MoO3 and Sm2O3 (30-50 nm) for production of 99Mo and 153Sm. The use of nanotechnology allows to obtain generators 99mTc-99Mo and isotopes of 153Sm",
        "149Pm with high specific activity that give possibility to improve the kinetics of uptake of these isotopes into the tumor in the case palliative therapy of bone metastases.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb047.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB048",
      "title": "Beam Shaping Assembly Optimization for Boron Neutron Capture Therapy",
      "authors": [
        "T. Sycheva",
        "S.Yu. Taskaev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "S.A. Frolov",
        "S.I. Lezhnin",
        "NSI RAS",
        "Moscow",
        "Russia",
        "Epithermal neutron source",
        "based on vacuum insulation tandem accelerator and lithium target",
        "has been developed and is now in use in the Budker Institute of Nuclear Physics. Neutrons are generated in 7Li(p",
        "n)7Be reaction under proton energies from 2 to 2.5 MeV. A beam shaping assembly (BSA) for therapeutic neutron beam forming is used. It includes moderator",
        "reflector",
        "and absorber. In this work the simulation results of the depth dose rate distribution in modified Snyder head phantom for a range of neutron energies are presented and discussed. Variants of BSA optimization depending on tumor depth are proposed. The calculations were carried out by Monte-Carlo neutron and photon transport code NMC. Our research revealed that high quality neutron beam generation may be obtained with proton energy of 2.3 MeV. Discovered optimal schemes of BSA including sizes and materials are presented and discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb048.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB048",
      "page_number": "471",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB049",
      "title": "Temperature Control System for Thermoradiotherapy Facilities",
      "authors": [
        "S.M. Polozov",
        "A.M. Fadeev",
        "S.M. Ivanov",
        "MEPhI",
        "Moscow",
        "Russia",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "It is known",
        "hyperthermia is widely used to improve the efficiency of cancer treatment. Local hyperthermia is a method where only tumor is heated",
        "on the other hand healthy tissues are protected from overheating. It was proposed to use an array of eight independently phased dipoles operating on 100-150 MHz to focus the RF energy in deep-situated volume of 30-50 mm size. But the problem of non-invasive temperature measurement should to be solved for correct operation of the local thermoradiotherapy systems. Conventional invasive thermometry devices as thermocouples",
        "thermistors or Bragg optical sensors can not be widely used because of serious risk of the cancer cells transport to healthy tissues. Radiothermometry or acoustic thermometry can not be used for tissues located deeper than 5-7 cm. As known electrodynamics characteristics of tissues depend on temperature. It was proposed to use this effect for active radiothermometry in local hyperthermia. Two opposite RF dipoles can be used as generator and receiver of pick-up signal. It was shown by simulations that such method can be used for thermometry of deep-situated tissues and have high resolution. Results of simulation will present in report."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb049.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB049",
      "page_number": "474",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB050",
      "title": "Laboratory Model of Thermoradiotherapy Facility: Experimental Results",
      "authors": [
        "S.M. Polozov",
        "A.M. Fadeev",
        "S.M. Ivanov",
        "MEPhI",
        "Moscow",
        "Russia",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Hyperthermia combined with radiotherapy (thermoradiotherapy) or with chemotherapy is one of promising approach to improve the cancer treatment efficiency. The treatment of deep-situated tumors is a problem which can not be solved by means of traditional facilities developed for whole-body or regional hyperthermia because of overheating of healthy tissues and blood. A cylindrical array of independently phased dipoles was proposed to focus electromagnetic energy in deep-situated tumors. It was early shown by simulations that array of eight independently phased dipoles operating on 100-150 MHz can be used to focus energy in an ellipsoid of 30-50 mm in size. Later the laboratory model of thermoradiotherapy facility was developed and constructed and series of experiments were carried out. Results of experiments and its comparison with simulations will discuss in report. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb050.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB050",
      "page_number": "477",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB051",
      "title": "Mathematical and Computer Methods of Data Processing in Nuclear Medicine Studies",
      "authors": [
        "E.D. Kotina",
        "A.V. Babin",
        "P. V. Bazhanov",
        "D.A. Ovsyannikov",
        "V.A. Ploskikh",
        "Yu. Shirokolobov",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "Currently nuclear medicine is a high-tech field. Its development requires solutions of problems related both to the improvement of hardware and computer processing of the information obtained in the course of study. The basic types of hardware of nuclear medicine are gamma cameras and single photon emission computed tomography (SPECT)",
        "positron emission tomography (PET) and hybrid scanners (SPECT/CT",
        "PET/ CT). The methods of SPECT data processing include analysis of static",
        "dynamic",
        "tomographic and ECG-gated images. The PET data reconstruction software restores the three-dimensional distribution of the radiopharmaceutical in the body. Performance of iterative methods increases with the use of modern graphics processors. Three-dimensional imaging allows a detailed analysis of the study area. The software also implements a fusion imaging of SPECT/CT",
        "PET/CT scans performed in the same coordinate system. An application of data flow model in medical software development is considered. Web-based imaging front-end of storage and processing system is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb051.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB051",
      "page_number": "480",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB052",
      "title": "The Use of Graphene as Stripper Foils in the Siemens Eclipse Cyclotron",
      "authors": [
        "S. Korenev",
        "R. Dishman",
        "A. Martin Yebra",
        "Siemens Medical Solutions Molecular Imaging",
        "Knoxville",
        "TN",
        "USA",
        "R.L. Fink",
        "I. Pavlovsky",
        "ANI",
        "Austin",
        "USA",
        "N.D. Meshcheryakov",
        "I.B. Smirnovpresenter",
        "Siemens Healthcare",
        "Moscow",
        "Russia",
        "This paper presents the results of an experimental study for the use of graphene foils as an extractor (stripper) foil in the 11-MeV Siemens Eclipse Cyclotron. The main advantage of graphene foils compared with carbon and graphite foils is its very high thermal conductivity. The graphene also has significant mechanical strength for atomically thin carbon layers. The life time of these foils is more than 18",
        "000 mkA*H. The graphene foils showed a significant increase in the transmission factor (the ratio of the beam current on the stripper foil to the current on the target)",
        "which was approximately 90%. The technology in fabricating these graphene foils is shown. The pros and cons of using the graphene material as a stripper foil in cyclotrons are analyzed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb052.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB052",
      "page_number": "483",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB053",
      "title": "Preparation of the Water Target Device Experience for the F-18 Operating on the Cyclotron CC-18/9M",
      "authors": [
        "A.S. Guchkin",
        "N.R. Antipkin",
        "I.A. Ashanin",
        "I.P. Grigoryev",
        "CHTD",
        "Moscow",
        "Russia",
        "P.A. Gnutov",
        "M.L. Klopenkov",
        "R.M. Klopenkovpresenter",
        "A.N. Kuzhlev",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "NIITFA",
        "Moscow",
        "Russia",
        "Experience of preparation of the water target device for the F-18 operating is presented in the present article. Processes of vacuum preparation",
        "target coils",
        "seals",
        "a body of a target",
        "deinstallation and installation of the target device are considered. So",
        "by preparation for mounting of vacuum and target coils",
        "as a result of flushing in a hostile environment (potassium permanganate) the material corrupting discloses at a stage of the vacuum target tests is revealed. Subsequently coil flushing was carried out in the deionized water. The derived development researches have revealed a need for refuse a hostile environment by preparation of target devices. Isotope operating results and the subsequent product synthesis based on F-18 showed an almost total impurity absence. The product yield after the module of synthesis constituted at least 60%. Besides",
        "installation works with the target device has shown need of application of quick-detachable connections on the cooling target lines that generally affined with the high induced activity on the work place."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb053.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "WEPSB054",
      "title": "Direct Problem of Calculation of Allowances for Element Parameters of the Synchrotron for Applied Research",
      "authors": [
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "The influence of perturbations in magnetic elements of the synchrotron for applied research",
        "is studied by means of numerical calculations. At given momentum spread of beam particles the influence of lenses longitudinal alignment errors and allowances for lengths and gradients of quadrupole lenses in matched insertion on maximum of beta-function (beta-max ) and betatron oscillations frequency (v) is calculated. The changes of beta-max and v are connected with quantities of allowances for parameters (ksii) by means of coefficients (alfa ksii) . These coefficients are calculated by means of a written program. Obtained results allow one to estimate a necessary lenses aperture reserve",
        "which is additional compared to the not perturbated beam size.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb054.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB055",
      "title": "The Problems of Accelerator-Driver Design for ADS",
      "authors": [
        "A.G. Golovkina",
        "I.V. Kudinovich",
        "D.A. Ovsyannikov",
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia",
        "KSRC",
        "St. Petersburg",
        "Russia",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "NIIEFA",
        "St. Petersburg",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Y.A. Svistunovpresenter Y.A. Svistunovpresenter Main problems of accelerator-driver design for ADS are considered. Accelerator-driver should meet additional requirements in comparison with accelerators for other purposes: - high neutron production rate; - higher reliability; - continuous operation for more than 5000 hours; - possibility of accelerator parameters adjustment to regulate ADS power level. Different types of accelerators were analyzed taking into account the mentioned features and the fact that the most prospective way of ADS application nowadays is transmutation. It's shown that the most preferable accelerator type is proton linac. Also it's marked that for demonstration facilities accelerators with lower requirements and correspondingly cost can be used. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb055.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB055",
      "page_number": "486",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB056",
      "title": "Study of Oil Wells With the Use of Accelerator Tubes, Time and Energy Spectrometers of Neutrons and Gamma Rays in a Single Geophysical Complex",
      "authors": [
        "A.E. Shikanov",
        "B.Y. Bogdanovich",
        "A.V. Il'inskiy",
        "A.A. Isaev",
        "K.I. Kozlovskiy",
        "A. Nesterovich",
        "E.D. Vovchenko",
        "MEPhI",
        "Moscow",
        "Russia",
        "The report discusses the finding of the coefficient of oil saturation of the reservoir by of nuclear methods. For this purpose",
        "the data about pulse and the activation neutron logging and spectral logging of natural gamma activity are used in a single geophysical complex. As sources of neutron radiation can been applied accelerating tube (AT) based on different ion sources",
        "such as plasma discharge with oscillating electrons (gas AT)",
        "vacuum arc and laser-plasma (vacuum AT). For investigation of the oil reservoir",
        "in particular with heavy oil",
        "we discuss the prospects of using vacuum accelerating tube based on a laser-plasma source of deuterons with coaxial acceleration geometry and pulsed magnetic isolation of electrons."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb056.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB056",
      "page_number": "490",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB057",
      "title": "Beam Dynamics in New 10 Mev High-Power Electron Linac for Industrial Application",
      "authors": [
        "S.M. Polozov",
        "V.I. Rashchikov",
        "MEPhI",
        "Moscow",
        "Russia",
        "CORAD Ltd.",
        "St. Petersburg",
        "Russia",
        "Beam dynamics simulation in electron gun",
        "bunching and accelerating cells of new 10 Mev high-power electron linac was fulfieled with the help of developed at MEPhI SUMA * and BEAMDULAC-BL ** codes. Three-electrode electron gun was used to obtain up to 400-450 mA of pulse beam current which is necessary to produce 300 mA of the accelerated beam. Precise gun simulation was conducted to satisfy all necessary output beams characteristics",
        "such as profile",
        "energy spectrum",
        "phase space size etc. Some additional calculation was conducted to provide wide range of gun output beam parameters which will be used for subsequent accelerator modification. The conventional biperiodical accelerating structure based on disk loaded waveguide was used in linac. Beam dynamics optimization was pointed to obtain effective beam bunching for all energy range and to achieve narrow energy spectrum. Simulation results shows that linac provides effective beam bunching and acceleration for wide bands of beam currents and energies.",
        "* V.I. Rashchikov",
        "PAST",
        "Series: Nuclear Physics Investigations",
        "10 (18)",
        "p.50",
        "1990 ** T.V. Bondarenko et al. PAST",
        "Series: Nuclear Physics Investigations",
        "6 (88)",
        "p. 114",
        "2013"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb057.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB057",
      "page_number": "493",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB058",
      "title": "Electron Accelerator for Radiation Sterylization Facility",
      "authors": [
        "Institute of Nuclear Chemistry and Technology",
        "Warsaw",
        "Poland",
        "Upgrading of radiation facility located at INCT has been performed towards higher technical and economical effectiveness",
        "better operational characteristics suitable for radiation processing and research programs. The objective of the project partly supported by IAEA was construction 10 MeV",
        "10-15 kW linear electron accelerator equipped with the microwave source based on TH 2158 klystron (Thales)",
        "and standing wave accelerating section (NIIEFA). The gun was designed to meet requirements of accelerating structure. Fiber-optic synchronization and triggering circuit based on pulse generator as reference source were applied. Klystron modulator was designed on the based of semiconductor switch (current load 1600 A",
        "with voltage up to 18 kV). The microwave system of the accelerator was composed from S-band components including microwave isolator. SF6 gas is used in waveguide to improve isolation. Accelerator control system is equipped with Siemens microprocessors and modules type Simatic S7-300",
        "with communication channel Profibus. The vacuum system consists of three ion vacuum pump type (pumping velocity 60 l/s) and turbomolecular vacuum pump which is used to start ion pumps. Accelerator is installed in vertical position and equipped with beam scanner 60 cm wide. The technical capability of certain accelerator systems and electron beam parameters were confirmed during starting up period.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb058.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB059",
      "title": "Realization of Positron Annihilation Spectroscopy at LEPTA Facility",
      "authors": [
        "K. Siemek",
        "V.I. Hilinov",
        "P. Horodek",
        "JINR/DLNP",
        "Dubna",
        "Moscow region",
        "Russia",
        "E.V. Ahmanova",
        "M.K. Eseev",
        "A.G. Kobets",
        "I.N. Meshkov",
        "O. Orlov",
        "A.A. Sidorin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "NAFU",
        "Arkhangelsk",
        "Russia",
        "IERT",
        "Kharkov",
        "Ukraine",
        "Positrons are used in materials science to study open volume defects. Several positron annihilation spectroscopy (PAS) techniques exist. These methods are based on detection of the 511 keV gamma quantum. The first method is the analysis of the Doppler broadening of annihilation line and provide information about defect concentration. Both annihilation quanta can be observed. Coincidence observation of two quanta gives additional information about the environment around defect. The second method is based on lifetime concept",
        "which allows to distinguish type of defects. Nowadays",
        "positron beams are of great interest for materials science. Using a low energy",
        "monoenergetic beam it is possible to control the positron penetration depth from the sample surface to a depth of several microns. Thus",
        "the beam can be used to characterize thin films",
        "analysis of surface modification",
        "studying influence of ions on matter etc. This report aims to present a current status of realization and progress in PAS methods at LEPTA facility at JINR."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb059.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB059",
      "page_number": "496",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB060",
      "title": "Development of Positron Annihilation Spectroscopy at the LEPTA Facility",
      "authors": [
        "A.A. Sidorin",
        "E.V. Ahmanova",
        "M.K. Eseev",
        "A.G. Kobets",
        "I.N. Meshkov",
        "O. Orlov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "NAFU",
        "Arkhangelsk",
        "Russia",
        "V.I. Hilinov",
        "P. Horodek",
        "I.N. Meshkov",
        "K. Siemek",
        "JINR/DLNP",
        "Dubna",
        "Moscow region",
        "Russia",
        "P. Horodek",
        "K. Siemek",
        "IFJ-PAN",
        "Kraków",
        "Poland",
        "IERT",
        "Kharkov",
        "Ukraine",
        "The report aims to present the status of the development of the LEPTA facility for further enhancement of the positron annihilation spectroscopy (PAS) method application at the LEPTA facility. The research in solid state physics performed currently is based on slow monochromatic positron flux from the injector and Doppler PAS. The new positron transfer channel being under construction at the LEPTA allows us to develop more advanced PAS method - so called 'Positron Annihilation life-time spectroscopy' (PALS). It will enrich significantly the research program at the LEPTA. PAS method is sensitive to microdefects in solids. A pair of gamma quanta",
        "born as a result of positron-electron annihilation carries information about the density of the defects that have the size less than 10 nm and are located at the depth from the surface of the material depending on the positron energy. New monochromatic positron source construction supplied with the autonomous cooling system with emitter-source of the activity of 30 mCi (iThemba LABS production) and new positron transfer channel are presented in report."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb060.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB060",
      "page_number": "499",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB061",
      "title": "Neutron Generators of the NG-10 Series for Metrology",
      "authors": [
        "D.A. Solnyshkov",
        "A.V. Kozlov",
        "A.N. Kuzhlev",
        "N.P. Mikulinas",
        "A.V. Morozov",
        "G.G. Voronin",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "Neutron generators NG-10 and NG-10M with a neutron yield of 1*1010 n/s and 2*1011 n/s respectively have been designed in the JSC \"NIIEFA\". The generators are high-voltage accelerators with target devices intended for installation and effective cooling of Ti-T/Ti-D targets of different diameters. A duoplasmotron with a beam current up to 5 mA is used in the NG-10 generator",
        "and the NG-10M employs a microwave ion source providing the beam current up to 10 mA. The power supplies",
        "which are under high voltage",
        "are controlled via fiber optic communication lines. Deuterium ions produced in the ion source are accelerated up to 150 keV in a sectionalized accelerating tube",
        "separated in mass with an electromagnetic mass-separator and focused onto a target with a doublet of electromagnetic quadrupole lenses. The generators are equipped with several lines to transport the beam to targets",
        "which can be placed in separate rooms. In addition to a high and stable in time yield of neutrons when operating continuously",
        "the generators provide the pulsed mode with a smooth variation of the pulse width from 2 mks up to 100 mks and pulse repetition rate from 1 Hz up to 20 kHz."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb061.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB061",
      "page_number": "502",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB063",
      "title": "Investigation of Electronic Exposure on Microorganisms",
      "authors": [
        "V.P. Filippovich",
        "A.Yu. Gracheova",
        "N.V. Iluhina",
        "Z.A. Kalinina",
        "V.V. Kondratenko",
        "M.A. Zavialov",
        "RRICT",
        "Vidnoye",
        "Russia",
        "I.I. Esakov",
        "S.N. Puchkov",
        "MRTI RAS",
        "Moscow",
        "Russia",
        "IPCE RAS",
        "Moscow",
        "Russia",
        "MEPhI",
        "Moscow",
        "Russia",
        "It is considered the effect of electron irradiation on the efficiency of suppression of conditionally pathogenic",
        "causing spoilage of food. The international scientific community prepared an extensive information base",
        "which",
        "after the necessary experimental testing can be successfully used to create the prerequisites of radiation technologies development in the food industry. Radioresistance of microorganisms is very different for various microorganisms. The objects of the electron beam exposure were microorganism suspension of Gram-negative bacteria Escherichia coli and of Gram-positive bacteria Staphylococcus aureus. Research was carried out on X-ray sterilization plant with local bio-protection",
        "which is located at the Moscow Radiotechnical Institute of Russian Academy of Sciences. Studies have compared the results of microorganism radioresistance index",
        "obtained by irradiation with accelerated electrons of varying intensity. It is established that the irradiation of relatively small doses possible to reduce the concentration of opportunistic strains of microorganisms examined. The results can be applied to development of evidence-based radiation treatment modes",
        "that allowing ensure microbiological safety of food products and agricultural raw materials.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb063.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB064",
      "title": "Modifications of  Electron Linear Accelerators Produced in NIIEFA for Sterilization",
      "authors": [
        "Yu. Zuev",
        "A.P. Klinov",
        "A.S. Krestianinov",
        "O.L. Maslennikov",
        "V.V. Terentyev",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "The paper analyses a series of electron linear accelerators equipped with one and the same accelerating structure. The structure operates in the standing-wave mode at a frequency of 2856 MHz. The accelerators differ in type and duty cycle of RF generators",
        "electron sources",
        "beam extraction and scanning devices and in configuration and layout of their auxiliary equipment. These modifications can provide the beam energy of 8-10 MeV and beam power up to 10-12 kW. Facilities with the accelerating structure have been used for electron beam sterilization of medical disposables and food processing over ten years."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb064.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB064",
      "page_number": "505",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB065",
      "title": "Development of the Beam Diagnostic System for the Radiobiological Research at the Proton Linear Accelerator I-2",
      "authors": [
        "A.V. Bakhmutova",
        "A. Golubev",
        "A.V. Kantsyrev",
        "N.V. Markov",
        "ITEP",
        "Moscow",
        "Russia",
        "At the present time at ITEP there is a possibility to investigate the biological mechanisms of the low energy protons on living systems on linear accelerator I-2. The unique high current linear accelerator allows to obtain 20 MeV intense proton beams. They could be used for the radiobiological research in a wide range of absorbed doses and for different cell types. Currently some preliminary experiments were made to specify diagnostic equipment required for further investigations. This work presents the main results on the proton beam parameters measurements such as beam current",
        "beam cross section dimension as well as the measurements of the absorbed dose and depth dose distribution using different types of detectors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb065.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB065",
      "page_number": "508",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPSB067",
      "title": "Modeling of ADSR Dynamics With Proton Linac in Multi-Point Approximation",
      "authors": [
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia",
        "The mathematical model of multi-point kinetics is proposed in the paper. The transients in subcritical reactor driven by proton linac taking into account the fuel and coolant temperature feedbacks are analyzed using this model. In contrast to the widely used point kinetics model",
        "the proposed model makes it possible to more accurately take into account the heterogeneity of the material composition in the core. That is the one of the main features of transmutation systems with accelerator-driver."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb067.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB067",
      "page_number": "511",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB068",
      "title": "Radiation From Open-Ended Flanged Waveguide With Dielectric Loading",
      "authors": [
        "V.V. Vorobev",
        "S.N. Galyamin",
        "A.A. Grigorevapresenter",
        "A.V. Tyukhtin",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Terahertz radiation is considered as a promising tool for a number of applications. One possible way to emit THz waves is to pass short electron bunch through a waveguide structure loaded with dielectric. Previously we considered the extraction of radiation from the open end of the waveguide with dielectric loading in both approximate and rigorous formulation. We also developed a rigorous approach based on mode-matching technique and modified residue-calculus technique for the case when the waveguide with dielectric is co-axial with infinite waveguide with greater radius. The study presented is devoted to the case when the dielectric loaded waveguide has a flange and enclosed into another waveguide with a greater radius. The case of the flanged waveguide in the unbounded vacuum space can be described as the limiting case of the problem under consideration. We perform analytical calculation (based on mode-matching technique and modified residue-calculus technique) and direct numerical simulation. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb068.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB068",
      "page_number": "515",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB069",
      "title": "Radiation of a Bunch Flying from the Open End of a Waveguide with a Dielectric Loading",
      "authors": [
        "S.N. Galyamin",
        "A.V. Tyukhtin",
        "V.V. Vorobev",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "A. Altmark",
        "S. Baturin",
        "LETI",
        "Saint-Petersburg",
        "Russia",
        "* S.N. Galyamin",
        "A.V. Tyukhtin",
        "S.S. Baturin",
        "S. Antipov",
        "Opt. Express 22(8) 8902 (2014). ** S.N. Galyamin",
        "A.V. Tyukhtin",
        "S.S. Baturin",
        "V.V. Vorobev",
        "A.A. Grigoreva",
        "in Proc. IPAC'16",
        "pp. 1617-1619."
      ],
      "institutions": [],
      "abstract": "In this paper we proceed with our investigation of Terahertz emission from beam moving in waveguide structures with dielectric layer*. Recently we have considered an open-ended waveguide (with uniform dielectric filling) placed inside regular vacuum waveguide of a larger radius and excited by a single incident waveguide mode**. Here we present analytical results for the case where the structure is excited by a moving charge. We also perform simulations using CST® PS code and compare results. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb069.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB069",
      "page_number": "518",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB070",
      "title": "Power GeV-positron Beams as a Novel Branch of the Accelerator Science",
      "authors": [
        "NRC",
        "Moscow",
        "Russia",
        "It is becoming clear that future applications of the readily available form of antimatter (especially",
        "in the form of power and high brightness positron beams) will lead to the excellent progress in a few avenue of inquiries of accelerator science and",
        "consequently",
        "it will be useful for development of fundamental and apply physics. Especially",
        "this concerned this clue and stubborn problems as high velocity macroparticle acceleration for strong shock waves research",
        "trims the size of heavy ions accelerator for ICF and any others(*-***)In this report we reveal that such problems mention above can result from today technology and trust of the nowadays research is to reduce the cost of the future machines through development of an ideas such as \"charge pumping mode\". The paper will discuss the scientific ideas",
        "directions of the critical researchers and limitations of basic principles.",
        "* V.V.Gorev. About annihilation mode of macroparticle acceleration for ICF. Doklady AS USSR.v.274",
        "p68-71.1984.  ** V.V.Gorev. Power positron beams. High Power particle Beams Conf. USA",
        "Washington",
        "2014. p.78. *** V.V.Gorev. Power positron beams for HEDP. Pulse Power Conf. USA",
        "Chicago",
        "2011",
        "p.69.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb070.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB070",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB071",
      "title": "Charged Beams Optical Properties of Scattering Media",
      "authors": [
        "V.G. Kurakin",
        "P.V. Kurakin",
        "LPI",
        "Moscow",
        "Russia",
        "In some accelerator based applications scattering media are placed on beam path. It may be internal beam target",
        "dielectric film or metallic foil to separate volumes with different gas pressure during beam extraction from accelerator",
        "roughing target in charge changing injection in circular accelerator and storage ring and so on. In particular cases detailed knowledge of beam dynamics in scattering media is necessary. This is especially true",
        "for example",
        "in the case of recovery energy accelerator where accelerated in superconducting linac high energy electron beam is directed again to accelerator after interaction with target. Distribution function for scattering angle and transverse displacement is used to derive the phase-plane portrait transformation in scattering medium for incoming charged particle beam. The phase-plane portrait of scattered beam depends strongly on incoming beam ellipse proportions and orientation",
        "and simple matching conditions and expression has been derived. It is shown as well that in heterogeneous medium incident beam experiences trajectory refraction at the out coming medium border. Refraction factor has been calculated for an off-normal incidence of a beam. It is worth to note that refractive property of scattering media may for used for beam focusing."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb071_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb071.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb071_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB071",
      "page_number": "521",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB073",
      "title": "Design Study of the Proton Linac for  Radiopharmaceuticals Production",
      "authors": [
        "G. Kropachev",
        "A.I. Balabin",
        "T. Kulevoypresenter",
        "D.N. Selesnev",
        "A. Sitnikov",
        "ITEP",
        "Moscow",
        "Russia",
        "MEPhI",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The 8 MeV 200 MHz linac for acceleration of quasi cw 0.2 mA proton beam is under development at ITEP. The linac is designed for radiopharmaceuticals production which will be used in the Positron-Emission Tomography. The linac includes RFQ and DTL sections with 6D-beam matching between them. The DTL section has modular structure and consists of separated individually phased IH-cavities with beam focusing by permanent magnet quadrupoles located between the cavities. This DTL structure provides linac compactness and enables its tuning and commissioning cavity by cavity. Results of beam dynamic simulation and electrodynamics characteristics of linac cavities are presented. reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb073.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB073",
      "page_number": "524",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB074",
      "title": "High Current Pulsing Deuteron Accelerator with Energy of 500 keV",
      "authors": [
        "A.A. Isaev",
        "K.I. Kozlovskiy",
        "A.E. Shikanov",
        "E.D. Vovchenko",
        "MEPhI",
        "Moscow",
        "Russia",
        "It is reported on the development of a compact experimental model of the deuteron accelerator with energies up to 400 KeV. The ion current is about 1 kA and the current density is greater than 20 A/cm2 in pulses with a duration of 0.5 mks and a repetition rate of 1 Hz. In this accelerator",
        "we applied the effective ion source of laser-plasma and the optimized method of magnetic insulation of the electrons in the accelerating gap."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb074.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB074",
      "page_number": "527",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB075",
      "title": "Beam Injector for Vacuum Insulated Tandem Accelerator",
      "authors": [
        "A.S. Kuznetsov",
        "K.A. Blokhina",
        "A.A. Gmyrya",
        "A.V. Ivanov",
        "D.A. Kasatov",
        "A.M. Koshkarev",
        "A.L. Sanin",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "K.A. Blokhina",
        "A.A. Gmyrya",
        "NSTU",
        "Novosibirsk",
        "Russia",
        "D.A. Kasatov",
        "A.M. Koshkarev",
        "NSU",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb075.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB075",
      "page_number": "529",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB076",
      "title": "The Development and Application of Injectors Free Electrons",
      "authors": [
        "MIPT",
        "Dolgoprudniy",
        "Moscow Region",
        "Russia",
        "Electronic injectors (or electron accelerators with the output of the electron beam into the atmosphere or other media) have been known",
        "since the 20-ies of XX century. However",
        "only the recent achievements of electronic and vacuum technology have allowed progress in the creation of industrial designs of injectors. To date",
        "this large stationary devices that use is usually powerful thermionic cathodes. Currently",
        "such injectors are used in many industries and medicine. Such as: 1) processing and curing of polymer materials and coatings; 2) disinfection and sterilization of medical devices; 3) neutralization of waste",
        "both industrial and human activity; 4) Processing of food products from cereal to meat",
        "increases the shelf life of their times; 5) many other applications. Electron beams are especially needed for applications such as they maximally and optimally structure without changing the material and affect the crystalline structure of the gene processed materials. There is growing demand for mobile and relatively low-voltage injector (U = 200-1000kV) and power up to 1kW. In our department we created a prototype of such a device with a very worthy performance*",
        "which will be the prototype for the development of a new class of relatively small-sized electron injectors.",
        "* N.N. Chadaev",
        "E.P. Sheshin Compact electron injector with cathodes made from carbon materials.\" Proceedings of the 56th Conf. MIPT",
        "\"Physical and Quantum Electronics\"",
        "Dolgoprudny",
        "2013 pp. 63-64.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb076.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB076",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB077",
      "title": "High Speed Cryogenic Monodisperse Targets for  High Intensity Cyclic and Linear Accelerators",
      "authors": [
        "A.V. Bukharov",
        "E.V. Vishnevskii",
        "MPEI",
        "Moscow",
        "Russia",
        "The basic possibility of creation of high speed cryogenic monodisperse targets is shown. According to calculations at input of thin liquid cryogenic jets with a velocity of bigger 100 m/s in vacuum the jets don't manage to freeze at distance to 1 mm and can be broken into monodisperse drops. Drops due to evaporation are cooled and become granules. High speed cryogenic monodisperse targets have the following advantages: direct input in vacuum (there is no need for a chamber of a triple point chamber and sluices)",
        "it is possible to use the equipment of a cluster target",
        "it is possible to receive targets with a diameter of D < 20 mkm from various cryogenic liquids (H2",
        "D2",
        "N2",
        "Ar) with dispersion less than 1%",
        "the high velocity of monodisperse granules(> 100m/s)",
        "exact synchronization of the target hitting moment in a beam with the moment of sensors turning on"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb077.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB077",
      "page_number": "532",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB078",
      "title": "Ion Beams and Optimal Target Structure for ADS",
      "authors": [
        "M. Paraipan",
        "A.A. Baldin",
        "A.I. Berlev",
        "S.I. Tyutyunnikov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The possibility to use proton and ion beams for ADS was investigated through simulation with the code Geant4. The interaction of various particles (protons and 8 ions: deuteron",
        "triton",
        "7Li",
        "9Be",
        "11B",
        "12C",
        "14N 20Ne",
        "24Mg",
        "32S",
        "and 40Ca) with energies from 0.3 to 10 AGeV was simulated in a quasi-infinite natural uranium target. The particle fluences",
        "the fragment distributions",
        "and the energy released were registered",
        "and the energetic efficiency of different beams was compared. The energetic efficiency of a beam was calculated reporting the energy released to the energy spent to accelerate the beam. The dependence of the spent energy on the particle type",
        "accelerator type and beam intensity was discussed. The energy released in targets with different levels of enrichment was calculated. The possibility to use a target with core from various materials and the influence on the energy released was also investigated. The optimal energy for protons is 3 GeV in a synchrotron",
        "1- 1.5 Gev in linac and 1 GeV in cyclotron. Starting with 7Li and energies > 0.5 AGeV ion beams demonstrate a higher efficiency than protons with energy 2- 3 GeV. For proton beams the optimal solution is a target made entirely from uranium. For beams of 7Li and heavier ions the use of a core from light materials with the length equal to the stopping range increases the energy deposition.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/wepsb078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/wepsb078.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/wepsb078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-WEPSB078",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 75,
  "scrape_time": "2025-10-11 02:46:42"
}