{
  "session_info": {
    "id": "WEPME",
    "name": "WEPME - Poster Session",
    "url": "https://proceedings.jacow.org/IPAC2013/html/wepme.htm"
  },
  "papers": [
    {
      "paper_id": "WEPME001",
      "title": "SOLEIL Beam Stability Status",
      "authors": [
        "N. Hubert",
        "L. Cassinari",
        "J.-C. Denard",
        "M. Labat",
        "J.-F. Lamarre",
        "A. Nadji",
        "L.S. Nadolski",
        "D. Pédeau",
        "M.-A. Tordeux",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "This paper reports recent work for improving SOLEIL electron beam stability. X-BPMs from four bending magnet beamline frontends have been inserted in the global orbit feedback loops during user operation. The corresponding source point stabilities have improved and results are reported. Some of the new beamlines request more stringent stability than the existing ones. Their requirements are not only tighter for beam orbit but also for beam size and divergence stability. For these reasons",
        "SOLEIL has decided to define beam quality criteria for each sensitive beamline. Then it can predict ahead of commissioning how well the beamline will likely perform. A feedback on the vertical emittance",
        "measured by a pinhole camera",
        "has been introduced in order to reduce beam size and divergence variations due to magnetic configuration changes of a few insertion devices."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme001.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME002",
      "title": "Fast Orbit Feedback at BESSY-II: Performance and Operational Experiences",
      "authors": [
        "R. Müller",
        "T. Birke",
        "M. Diehn",
        "D.B. Engel",
        "B. Franksen",
        "R. Görgen",
        "P. Kuske",
        "R. Lange",
        "I. Müller",
        "A. Schaelicke",
        "G. Schindhelm",
        "HZB",
        "Berlin",
        "Germany",
        "At the 3rd generation light source BESSY II the first phase of a fast orbit feedback system(*) has been completed and put into operation in 2012. In this first phase the aim was to achieve noise suppression in the 1Hz to several 10Hz range",
        "mostly avoiding expensive upgrades to existing hardware",
        "such as beam position monitors and the CAN based setpoint transmission to the power supplies. Only the power supplies were replaced with newer",
        "faster versions. This paper describes the capability of the phase-I FOFB with respect to beam motion transient suppression",
        "low frequency damping and high frequency noise generation as well as aspects of operational integration and stability.",
        "* Müller",
        "R. et. al.: Installing a Fast Orbit Feedback at BESSY.  IPAC 10",
        "Kyoto",
        "Japan",
        "23 - 28 May",
        "2010.",
        "p. 2749-2751"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme002.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPME003",
      "title": "Determination of Optics Transfer between the Kicker and BPMs for Transverse Feedback System",
      "authors": [
        "M. Alhumaidi",
        "A.M. Zoubir",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "TU Darmstadt",
        "RTR",
        "Darmstadt",
        "Germany",
        "The knowledge of the transfer optics between the positions of the Kicker and the BPMs is required for the calculation of the correction signal in transverse feedback systems. Therefore",
        "using nominal values of the transfer optics with uncertainties leads to feedback quality degradation",
        "and thus beam disturbances. In this work",
        "we propose a method for measuring the phase advances and amplitude scaling between the positions of the kicker and the BPMs. Directly after applying a kick on the beam by means of the kicker",
        "we record the BPM signals. Consequently",
        "we use the Second-Order Blind Identification (SOBI) algorithm to decompose the noised recorded signals into independent sources mixture. Finally",
        "we determine the required optics parameters by identifying and analyzing the betatron oscillation sourced from the kick based on its mixing and temporal patterns. Results for the heavy ions synchrotron SIS 18 at the GSI are shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme003.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME004",
      "title": "A Digital Beam-Phase Control System for a Heavy-Ion Synchrotron with a Double-Harmonic Cavity System",
      "authors": [
        "J. Grieser",
        "D.E.M. Lens",
        "TU Darmstadt",
        "RTR",
        "Darmstadt",
        "Germany",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "H. Klingbeil",
        "U. Laier",
        "K.-P. Ningel",
        "S. Schäfer",
        "B. Zipfel",
        "GSI",
        "Darmstadt",
        "Germany",
        "For the new Facility for Antiproton and Ion Research (FAIR) at GSI Helmholtzzentrum für Schwerionenforschung GmbH",
        "the heavy-ion synchrotron SIS18 will be operated with a double-harmonic cavity system*. The second cavity",
        "running at twice the fundamental RF frequency",
        "is used to lengthen the bucket which introduces nonlinearities to the control system. To damp longitudinal rigid dipole oscillations a digital feedback system consisting of a filter and an integrator is used. For the existing single-harmonic setup an FIR-filter is implemented which realizes a multiple bandpass filter with the first passband close to the synchrotron frequency. Both",
        "the feedback gain and the passband frequency of the filter depend on the actual value of the synchrotron frequency**. It was shown by simulations and in an experiment that this setup can be transferred to a double-harmonic cavity system obtaining similar results for the region of stable feedback parameters",
        "if the oscillation frequency of the bunch barycenter*** is considered instead of the synchrotron frequency of a linearized bucket. In this contribution the results of the simulation and the experiment are presented and compared.",
        "*Klingbeil et al.: Phys. Rev. Special Topics - Accelerators and Beams 14",
        "102802",
        "2011  **Klingbeil et al.: IEEE Trans. on Nucl. Science",
        "Vol. 54",
        "No. 6",
        "2007 ***Grieser et al.: Proc. 3rd IPAC",
        "2012"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme004.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME005",
      "title": "Pulsed RF Control for the P-Linac Test Stand at FAIR",
      "authors": [
        "P. Nonn",
        "U. Bonnes",
        "C. Burandt",
        "F. Hug",
        "M. Konrad",
        "N. Pietralla",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "Cornell University",
        "Ithaca",
        "New York",
        "USA",
        "H. Klingbeil",
        "G. Schreiber",
        "W. Vinzenz",
        "GSI",
        "Darmstadt",
        "Germany",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "The p-linac will be a dedicated proton injector for antiproton production at FAIR (GSI Darmstadt). It will provide a 70 MeV/70 mA pulsed proton beam with a duty cycle of about 10-4. Therefore the RF of the normal conducting",
        "coupled CH cavities* will be pulsed",
        "too. In order to test the operation of those cavities",
        "a test stand is under construction at GSI. The RF control hard- and software for the test stand is developed at TU Darmstadt. It is based on the digital low level RF control system",
        "which is operational at the S-DALINAC**. Hardware as well as software had to be customized",
        "in order to achieve pulsed operation within the given limits. These customizations as well as measurements from pulsed operation will be presented.",
        "*R. Brodhage et al. Development and Measurements on a Coupled CH Proton Linac for FAIR",
        "IPAC'10 **M. Konrad et al. Digital base band rf control system for the…",
        "PRL ST Accel. & Beams 15"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme005.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME006",
      "title": "Optical Synchronization and Electron Bunch Diagnostic at ELBE",
      "authors": [
        "M. Kuntzsch",
        "M. Gensch",
        "U. Lehnert",
        "F. Röser",
        "R. Schurig",
        "HZDR",
        "Dresden",
        "Germany",
        "M. Bousonville",
        "M.K. Czwalinna",
        "H. Schlarb",
        "S. Schulz",
        "S. Vilcins",
        "DESY",
        "Hamburg",
        "Germany",
        "The continuous wave electron accelerator ELBE is upgraded to generate short and highly charged electron bunches (~200fs duration",
        "up to 1 nC) . In the last years a prototype of an optical synchronization system using a mode locked fiber laser has been build up at ELBE which is now in commissioning phase. The stabilized pulse train can be used for new methods of electron bunch diagnostics like bunch arrival time measurements with the potential of femtosecond resolution. At ELBE a bunch arrival time monitor (BAM) has been designed and tested at the accelerator. The contribution will show the design of the BAM and first measurement results at the ELBE accelerator."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme006.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME007",
      "title": "Commissioning of the Upgraded Superconducting CW Linac ELBE",
      "authors": [
        "H. Büttig",
        "A. Arnold",
        "A. Büchner",
        "M. Justus",
        "M. Kuntzsch",
        "U. Lehnert",
        "P. Michel",
        "R. Schurig",
        "G.S. Staats",
        "J. Teichert",
        "HZDR",
        "Dresden",
        "Germany"
      ],
      "institutions": [],
      "abstract": "With the expansion of the radiation source ELBE a center for high power radiation sources is being built at the Helmholtz Zentrum Dresden-Rossendorf (HZDR). In a first step (January 2012) the available CW RF-power (1.3 GHz) per superconducting 9-cell TESLA cavity at ELBE had been increased from 8.5 kW to 20 kW (CW) using solid state amplifiers. In a second step the performance of several machine components of ELBE must be redesigned to enable full power operation without risks. The poster gives an overview how these problems have been solved at ELBE and reports on the commissioning.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme007.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME008",
      "title": "Precision LLRF Controls for the S-Band Accelerator REGAE",
      "authors": [
        "M. Hoffmann",
        "H. Kay",
        "U. Mavrič",
        "H. Schlarb",
        "Ch. Schmidt",
        "DESY",
        "Hamburg",
        "Germany",
        "W. Jałmużna",
        "T. Kozak",
        "A. Piotrowski",
        "TUL-DMCS",
        "Łódź",
        "Poland",
        "The linear accelerator REGAE (Relativistic Electron Gun for Atomic Exploration) at DESY delivers electron bunches with a few femtosecond duration for time-resolved experiments of material structure in pump-probe configuration. To achieve the desired 10 fs resolution",
        "the Low Level RF controls for the normal conducting S-band cavities must provide field stability of 0.01% in amplitude and of 0.01deg in phase. To achieve these demanding stability a recently developed LLRF controller based on the Micro-Telecommunications Computing Architecture (MTCA.4) have been installed and commission. In this paper",
        "we report on measurement performance of the LLRF system",
        "the achieved stability and current limitations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme008.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME009",
      "title": "Recent Developments of the European XFEL LLRF System",
      "authors": [
        "Ch. Schmidt",
        "G. Ayvazyan",
        "V. Ayvazyan",
        "J. Branlard",
        "Ł. Butkowski",
        "M.K. Grecki",
        "M. Hoffmann",
        "T. Jeżyński",
        "F. Ludwig",
        "U. Mavrič",
        "S. Pfeiffer",
        "H. Schlarb",
        "H.C. Weddig",
        "B.Y. Yang",
        "DESY",
        "Hamburg",
        "Germany",
        "P. Barmuta",
        "S. Bou Habib",
        "K. Czuba",
        "M. Grzegrzółka",
        "E. Janas",
        "J. Piekarski",
        "I. Rutkowski",
        "D. Sikora",
        "Ł. Zembala",
        "M. Żukociński",
        "Warsaw University of Technology",
        "Institute of Electronic Systems",
        "Warsaw",
        "Poland",
        "W. Cichalewski",
        "K. Gnidzińska",
        "W. Jałmużna",
        "D.R. Makowski",
        "A. Mielczarek",
        "A. Napieralski",
        "P. Perek",
        "A. Piotrowski",
        "T. Pożniak",
        "K.P. Przygoda",
        "TUL-DMCS",
        "Łódź",
        "Poland",
        "S. Korolczuk",
        "I.M. Kudla",
        "J. Szewiński",
        "NCBJ",
        "Świerk/Otwock",
        "Poland",
        "K. Oliwa",
        "W. Wierba",
        "IFJ-PAN",
        "Kraków",
        "Poland",
        "The European XFEL is comprised of more than 800 TESLA-type super-conducting accelerator cavities which are driven by 25 high-power multi-beam klystrons. For reliable",
        "reproducible and maintainable operation of linac",
        "the LLRF system will process more than 3000 RF channels. Beside the large number of RF channels to be processed",
        "stable FEL operation demands field stability better than 0.010deg in phase and 0.01% in amplitude. To cope with these challenges the LLRF system is developed on MTCA.4 platform. In this paper",
        "we will give an update of the latest electronics developments",
        "advances in the feedback controller algorithm and measurement results at FLASH."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme009.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME010",
      "title": "Patient-specific Intensity-modulation of a Slowly Extracted Beam at the HIT Synchrotron",
      "authors": [
        "C. Schömers",
        "E. Feldmeier",
        "Th. Haberer",
        "J. Naumann",
        "R.E. Panse",
        "A. Peters",
        "HIT",
        "Heidelberg",
        "Germany",
        "Since 2009 more than 1100 tumour patients have been treated at the Heidelberg Ion Therapy-Centre (HIT). The HIT synchrotron produces a library of energy",
        "focus and intensity-variable pencil beams used to deliver dose distributions of utmost conformity to irregularly shaped target volumes. The required number of particles for each volume element of the tumour",
        "which can vary by more than two magnitudes",
        "is applied using the rasterscan technology. The irradiation-time and thus the patient throughput are highly sensitive to the achieved spill-structure driven by RF-Knockout extraction. Presently unfavourable fluctuations of the extracted intensity due to inhomogeneous phase space distribution of the beam are present. Recently a feedback-loop coupling the dose-defining ionisation chamber in front of the patient with the RF-Exciter was implemented allowing for the adaptation of the extracted intensity to the patient-specific treatment plan in real-time. The technical implementation and the impact on the clinical operation will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme010.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME011",
      "title": "Beam Tests and Plans for the CERN PS Transverse Damper System",
      "authors": [
        "A. Blas",
        "S.S. Gilardoni",
        "G. Sterbini",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN Proton Synchrotron (CPS) has been running without any transverse damping equipment since 1998",
        "thanks to the stabilizing effect of the linear coupling applied between horizontal and vertical planes. Lately",
        "the demand for an active damper strongly emerged for two main reasons: to avoid restrictions as imposed on the betatron tune settings by the linear coupling and to cure instabilities appearing with high intensity beams",
        "especially at the extraction energy. Late in 2012",
        "two electronic prototype units",
        "newly developed for the CPS one-turn-feedback",
        "were programmed with a firmware designed to satisfy the transverse feedback (TFB) requirements in both planes. The main achievements were to automatically adapt the loop delay to the particles' time-of-flight variation within a nanosecond precision and to compensate the changing betatron phase advance between pick-up and kicker during the entire accelerating cycle. With the power equipment limited to the modest bandwidth of 23 MHz and 2 x 800 W per plane",
        "encouraging results were obtained such as fast damping of injection oscillations caused by injection errors",
        "reduction of beam losses along the cycle and damping of instabilities at all CPS energies."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme011.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME013",
      "title": "Development and Test of a Fully Automated PkQl Control Procedure at KEK STF",
      "authors": [
        "M. Omet",
        "A. Kuramoto",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "H. Hayano",
        "T. Matsumoto",
        "S. Michizono",
        "KEK",
        "Ibaraki",
        "Japan",
        "In order to operate the cavities near their maximum gradients",
        "cavity input (Pk) and cavity loaded Q (QL) should be controlled individually (PkQL control) at the International Linear Collider (ILC). A manual PkQL operation procedure was developed and performed at the linear electron accelerator at the Superconducting RF Test Facility (STF)",
        "in which the beam is accelerated up to 40 MeV by two superconducting 9-cell TESLA type L band cavities. The cavity gradients were set to 16 MV/m and 24 MV/m with QL values of 1106 and 3·106. A 6.2 mA beam with a pulse length of 154 us was used. The field stabilities in amplitude were 0.160% and 0.097% for the cavities and 0.016% for the vector sum. The stabilities without beam are 0.057% and 0.054% for the cavities and 0.009% for the vector sum. For stability improvement during beam transient an adaptive beam feedforward for beam loading compensation is under development. So far an amplitude field stability of 0.013% for the vector sum was achieved at cavity gradients of 15 MV/m and 25 MV/m (no PkQL control) during a 6.8 mA beam with a pulse length of 123 us. Furthermore a fully automated PkQL control procedure is currently developed and tested."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPME014",
      "title": "Progress in Development of New LLRF Control System for SuperKEKB",
      "authors": [
        "T. Kobayashi",
        "K. Akai",
        "K. Ebihara",
        "A. Kabe",
        "K. Nakanishi",
        "M. Nishiwaki",
        "J.-I. Odagiri",
        "KEK",
        "Ibaraki",
        "Japan",
        "H. Deguchi",
        "K. Harumatsu",
        "K. Hayashi",
        "T. Iwaki",
        "J. Mizuno",
        "J. Nishio",
        "M. Ryoshi",
        "Mitsubishi Electric TOKKI Systems",
        "Amagasaki",
        "Hyogo",
        "Japan",
        "For the SuperKEKB project",
        "a new LLRF control system was developed to realize high accuracy and flexibility. It is an FPGA-based digital RF feedback control system using 16-bit ADC's",
        "which works on the μTCA platform. The FPGA boards control accelerating cavity fields and cavity tuning",
        "and the EPICS-IOC is embedded in each of them. The CSS-BOY was adopted for a user interface of our system. High power test of the new LLRF control system was performed with the ARES Cavity of KEKB. The obtained feedback control stability with a klystron drive was sufficient as well as the low-level evaluation result. And auto tuner control also worded successfully. The start-up sequencer program for the cavity operation and auto-aging program also worked very well. The temperature characteristics of the system depend largely on band-pass filters (BPF). We tried to tune the BPF to reduce the temperature coefficient. Consequently the temperature dependence was improved to satisfy the required stability."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme014.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME015",
      "title": "Evaluation of the Superconducting LLRF system at cERL in KEK",
      "authors": [
        "F. Qiu",
        "D.A. Arakawa",
        "H. Katagiri",
        "T. Matsumoto",
        "S. Michizono",
        "T. Miura",
        "T. Miyajima",
        "K. Tsuchiya",
        "KEK",
        "Ibaraki",
        "Japan",
        "A low level RF (LLRF) design is being currently developed within the compact Energy Recover Linac (cERL) at KEK. One challenging task is to achieve the high amplitude and high phase stability required by the accelerating fields of up to 0.1% and 0.1°",
        "respectively. To improve the performance of the LLRF system",
        "a gain scanning experiment for determining the optimal controller gain was carried out on the cERL. Furthermore",
        "as a substitute for the traditional PI controller",
        "a more robust H∞-based multiple input multiple output (MIMO) controller was realized. This controller requires more detailed system information (transfer function or state equation)",
        "which can be acquired by using modern system identification methods. In this paper",
        "we describe the current status of these experiments on the cERL."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme015.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME016",
      "title": "Recent Progress of a Laser-based Alignment System at the KEKB Injector Linac",
      "authors": [
        "T. Suwada",
        "M. Satoh",
        "KEK",
        "Ibaraki",
        "Japan",
        "K. Minoshima",
        "S. Telada",
        "AIST",
        "Tsukuba",
        "Japan",
        "A new laser-based alignment system is under development in order to precisely align accelerator components with a precision level of ±0.1 mm along an ideal straight line at the KEKB injector linac. The high-precision alignment system is strongly required for the Super B-factory at KEK. The laser-based alignment system comprises a He-Ne laser source and optical components for delivering the laser beam",
        "and silicon photodetectors. The laser-based alignment system aligns a misalignment of a girder unit for accelerating structures while accelerator components on the girder unit are aligned with another laser tracker system with a similar precision level. A new PC-based feedback system for the laser pointing stability has been introduced in order to stabilize the transverse laser positions at the photodetector. The experimental results show that although the laser pointing stability is easily disturbed by environmental factors without the feedback system",
        "it has been successfully applied to control the laser pointing stability within a few ten-micron-meter. In this report",
        "the experimental investigations in the new feedback system are reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme016.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME017",
      "title": "Development and Application of the Trigger Timing Watchdog System in KEK Electron/Positron Linac",
      "authors": [
        "M. Satoh",
        "K. Furukawa",
        "F. Miyahara",
        "T. Suwada",
        "KEK",
        "Ibaraki",
        "Japan",
        "T. Kudou",
        "S. Kusano",
        "Mitsubishi Electric System & Service Co.",
        "Ltd",
        "Tsukuba",
        "Japan",
        "The KEK injector linac provides electrons and positrons to several accelerator facilities. A 50 Hz beam-mode switching system has been constructed to realize simultaneous top-up injections for Photon Factory and the KEKB high- and low-energy rings",
        "which require different beam characteristics. An event-based timing and control system was built to change the parameters of various accelerator components within 20 ms. The components are spread over a 600-m-long linac and require changes to a total of 100 timing and control parameters. The system has been operated successfully since the autumn of 2008 and has been improved upon as beam operation experience has been accumulated. The timing watchdog and alert system are indispensable for the stable and high quality beam operation. For this purpose",
        "we developed and utilized several timing watchdog system. We will present the detail of timing signal watchdog system for the KEK injector linac."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme017.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME018",
      "title": "Ytterbium Laser Development of DAW RF Gun for SuperKEKB",
      "authors": [
        "X. Zhou",
        "T. Natsui",
        "Y. Ogawa",
        "M. Yoshida",
        "KEK",
        "Ibaraki",
        "Japan",
        "For obtaining higher luminosity in the SuperKEKB",
        "the photocathode RF electron gun with strong electric focusing field for high-current",
        "low-emittance beams will be employed in the injector linac. The electron beams with a charge of 5 nC and a normalized emittance of 10 μm are expected to be generated in the photocathode RF gun by using the laser source with a center wavelength of 260 nm and a pulse width of 30 ps. Furthermore",
        "for reducing the emittance",
        "the laser pulse width should be reshaped from Gaussian to rectangle structure. Therefore",
        "Ytterbium (Yb)-doped laser system that provides broader bandwidth",
        "higher amplify efficiency and higher output power is employed. The laser system starts with a large mode-area Yb-doped fiber-based amplifier system",
        "which consists of a passively mode-locked femtosecond Yb-fiber oscillator and two steps Yb-fiber amplifier. To obtain the several 10mJ-class pulse energy",
        "a Yb:YAG thin-disk regenerative solid-state amplifier is employed. Deep UV pulses for the photocathode are generated by using two frequency-doubling stages. High pulse energy and good stability would be expected."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme018.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME019",
      "title": "Development of Beam Position Feedback Control System in KU-FEL",
      "authors": [
        "H. Ohgaki",
        "Y.W. Choi",
        "H. Imon",
        "T. Kii",
        "R. Kinjo",
        "T. Konstantin",
        "K. Masuda",
        "H. Negm",
        "K. Okumura",
        "M. Omer",
        "S. Shibata",
        "K. Shimahashi",
        "K. Yoshida",
        "H. Zen",
        "Kyoto University",
        "Institute for Advanced Energy",
        "Kyoto",
        "Japan",
        "The stability of electron beam parameters such as position",
        "energy etc. is very crucial for stable FEL operation. In Kyoto University MIR-FEL facility (KU-FEL)",
        "fluctuation of beam position and energy is caused by external fluctuations",
        "such as the fluctuation in the cathode temperature of the thermionic RF-gun due to the back-streaming electrons",
        "fluctuation of RF phase and amplitude",
        "fluctuations of room and water temperatures",
        "electric noises and so on. To monitor electron beam movement",
        "we have already developed BPM system consisting of a 4-button electrode type BPM",
        "a heterodyne detector",
        "and CAMAC ADC in KU-FEL. By using this BPM system we have observed some correlations between external fluctuations and the beam position movements. In this conference",
        "we will present the developed BPM system as well as the beam feedback system for stable KU-FEL operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme019.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME020",
      "title": "Alignment Plan and Survey Results of the Equipment for J-PARC 3 GeV RCS",
      "authors": [
        "N. Tani",
        "H. Hotchi",
        "J. Kamiya",
        "M. Kinsho",
        "O. Takeda",
        "M. Yamamoto",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "Misalignment of several millimeters of the magnets of J-PARC 3GeV RCS in both horizontal and vertical directions was caused by the Tohoku Region Pacific Coast Earthquake on March 11",
        "2011. As the result of orbit calculation showed that the beam loss was acceptable for beam operation at 300kW",
        "beam operation with the current placement has been implemented. Realignment of the equipment will be carried out from August to December in 2013. Survey carried out in the summer of 2013 found out misalignment of ceramic vacuum ducts therefore their positioning is necessary. In this paper",
        "these measurement result and latest alignment plan for J-PARC 3GeV RCS are reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme020.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME021",
      "title": "Development of CO2 Laser Optical Enhancement Cavity for a Laser-Compton X-ray Source",
      "authors": [
        "K. Ando",
        "A. Endo",
        "K. Sakaue",
        "T. Takeichi",
        "M. Washio",
        "Waseda University",
        "Tokyo",
        "Japan",
        "We have been developing a laser-Compton X-ray source using optical enhancement cavity. We have studied 1um pulse laser storage in optical cavity and use for the experiments. Usage of 10um laser for optical enhancement cavity will increase the X-ray energy region of one laser-Compton X-ray source",
        "so that we decided to develop the optical cavity for CO2 laser. We have designed external optical cavity for CO2 laser commercially available optics and verified the enhancement of CO2 laser in external optical cavity",
        "and measured fundamental parameters such as finesse",
        "matching efficiency",
        "and enhancement factor. We have already achieved 540 of finesse",
        "43 of enhancement",
        "and tested non-planer cavity",
        "which storages two circular polarization separately. In this conference",
        "we will report the design and experimental results of CO2 laser storage cavity and also some future prospects."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme021.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME022",
      "title": "Overview of the CSNS/RCS LLRF Control System",
      "authors": [
        "X. Li",
        "W. Long",
        "H. Sun",
        "C.L. Zhang",
        "F.C. Zhao",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The CSNS/RCS RF system consists of 8 ferrite-loaded RF cavities (h=2)",
        "each with individual digital LLRF control electronics. The injection and extraction energy of the beam are 80MeV and 1.6GeV respectively with a repetition rate of 25Hz. The RF system is designed to provide the maximum RF voltage of 165kV. The RF frequency range is from 1.02MHz at injection to 2.44MHz at extraction. The CSNS/RCS LLRF control system is based on FPGA",
        "and composed of 7 control loops to achieve required acceleration voltage amplitude and phase regulation. A number of prototype and the first formal system have been completed and tested. In this paper we present an overview of the LLRF control system",
        "and some operational results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme022.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME023",
      "title": "Study of the Vibration of the AC Dipole and Magnetic Measurement Girder for CSNS/RCS",
      "authors": [
        "R.H. Liu",
        "L. Kang",
        "H. Qu",
        "G.Y. Wang",
        "H.J. Wang",
        "J. S. Zhang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The dipole magnet of the China Spallation Neutron Source Rapid-cycling Synchrotron (RCS) will be operated at a 25Hz sinusoidal alternating current which causes severe vibration. The vibration will influence the long-term safety and reliable operation of the magnet. By taking the magnet and magnetic measurement girder as a specific model system",
        "a method for analyzing and studying the dynamic characteristic of the system is put forward by combining theoretical calculation with experimental testing. And the ctive vibration of magnet is different with passive vibration which was causes by ground vibration",
        "so a new isolator was designed to decrease the vibratory force and avoid the resonance phenomenon."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME024",
      "title": "Gaussian Spectrum Fiber Laser Pulses Generated in an All-normal-dispersion Cavity",
      "authors": [
        "Y. You",
        "W.-H. Huang",
        "C.-X. Tang",
        "L.X. Yan",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "H. Shimizu",
        "J. Urakawa",
        "KEK",
        "Ibaraki",
        "Japan",
        "In this paper",
        "we reported generating a broad bandwidth Gaussian shape spectrum fiber laser pulse directly in an all-normal dispersive cavity. Pulse-shaping is based on spectral filtering. The spectrum has a ~20 nm 20-dB spectrum bandwidth and it is different from the typical spectrum",
        "of steep edge and two spikes. The Gaussian spectrum is preferred since it can be dechirped to transform-limited pulsed duration. The pulse duration corresponds to this kind of spectrum is ~315fs",
        "and pulse energy is up to~9nJ",
        "with a repetition rate of 18.9MHz."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme024.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME025",
      "title": "The Surveying Data Processing of Control Network based on HLS Upgrade",
      "authors": [
        "W. Wang",
        "X.Y. He",
        "P. Wang",
        "S.F. Xu",
        "Q.Y. Yao",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "The paper introduces the data processing procedure of control network based on the HLS upgrade. The Spatial Analyzer developed by New River Kinematics was used to adjust the data of surveying",
        "In order to check the correctness of the adjustment result",
        "The MAA developed by IHEP was also employed to make three-dimensional adjustment as well as plane adjustment done by SURVEY adding elevation adjustment by"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme025.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME027",
      "title": "Analysis of Tidal Effects on Measurement Accuracy of HLS",
      "authors": [
        "S.F. Xu",
        "X.Y. He",
        "P. Wang",
        "W. Wang",
        "Q.Y. Yao",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "HLS* is mainly used in survey and high-accuracy alignment in particle accelerator. Monitoring the earth tides is primarily introduced in this paper. Based on the earth tide theory and the ocean load effects on the planet earth",
        "the tidal effects on a hydrostatic leveling system is analyzed. Finally",
        "the local ground deformation is obtained",
        "and the current research establish a foundation for the further study."
      ],
      "institutions": [],
      "abstract": "HLS-hydrostatic levelling system",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme027.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME032",
      "title": "Development Status of SINAP Timing System",
      "authors": [
        "M. Liu",
        "D.K. Liu",
        "C.X. Yin",
        "L.Y. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "After successful implementation of SINAP timing solution at Pohang Light Source in 2011",
        "the development of SINAP timing system version-II was finished by the end of 2012. The hardware of version-II is based on Virtex-6 FPGA chip",
        "and bidirectional event frame transfer is realized in a 2.5Gbps fiber network. In event frame",
        "data transfer functionality substitutes for distributed bus. The structure of timing system is also modified",
        "where a new versatile EVO could be configured as EVG",
        "FANOUT and EVR with optical outputs. Besides standard VME modules",
        "we designed PLC-EVR as well",
        "which is compatible with Yokogawa F3RP61 series. Based on brand new hardware architecture",
        "the jitter performance of SINAP timing system version-II is improved remarkably."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme032.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME033",
      "title": "Status of SSRF Fast Orbit Feedback System",
      "authors": [
        "C.X. Yin",
        "B.C. Jiang",
        "L.Y. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "As a 3rd generation light source",
        "Shanghai Synchrotron Radiation Facility (SSRF) is pushing the requirement of beam stability to sub-micron in the range of DC to 100Hz. A fast orbit feedback system was designed and implemented to satisfy this requirement. In this paper",
        "the layout of SSRF fast orbit feedback system",
        "the structure of its electronics system and its hardware and software subsystems are described. The current status of SSRF fast orbit feedback system is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme033.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME034",
      "title": "Motion Control of the Mirror Chamber",
      "authors": [
        "Z.H. Zhang",
        "L.F. Zheng",
        "SSRF",
        "Shanghai",
        "People's Republic of China",
        "W.H. Jia",
        "P. Liu",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "The initial beamlines of SSRF have several mirror chambers. The motion mechanism of the mirror chamber consists of six step motors. Three vertical motors are used to achieve the height translation",
        "the roll adjustment and the pitch adjustment. Two horizontal motors are used to achieve the horizon translation and the yaw adjustment. The mirror bending is achieved by a single motor. Except the bending",
        "every motion needs two or three motors to work simultaneously. The VME systems are used in the control system. The EPICS (Experimental Physics and Industrial Control System) toolkits [1] are adopted to develop the control software. This paper describes how to use motor records",
        "transform records and the EPICS database linking mechanism to form soft loops",
        "which solve the difficulties of the complex motions perfectly. The system has been successfully applied in the mirror chambers at SSRF."
      ],
      "institutions": [
        "Funding: Shanghai Institute of Applied Physics (SINAP), CAS, Shanghai 201800, P. R. China"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme034.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME035",
      "title": "Overview of the RF Synchronization System for the European XFEL",
      "authors": [
        "K. Czuba",
        "D. Sikora",
        "Ł. Zembala",
        "Warsaw University of Technology",
        "Institute of Electronic Systems",
        "Warsaw",
        "Poland",
        "J. Branlard",
        "F. Ludwig",
        "H. Schlarb",
        "H.C. Weddig",
        "DESY",
        "Hamburg",
        "Germany",
        "One of the most important requirements for the European XFEL RF system is to assure a very precise RF field stability within the accelerating cavities. The required amplitude and phase stability equals respectively dA/A <3·10-5",
        "dphi<0.01 deg @ 1.3GHz in the injector and dA/A<10-3",
        "dphi <0.1 deg @1.3GHz in the main LINAC section. Fulfilling such requirements for the 3.4 km long facility is a very challenging task. Thousands of electronic and RF devices must be precisely phase synchronized by means of harmonic RF signals. We describe the proposed architecture of the RF Master Oscillator and the Phase Reference Distribution System designed to assure high precision and reliability. A system of RF cable based interferometers supported by femtosecond-stable optical links will be used to distribute RF reference signals with required short and long term phase stability. We also present test results of prototype devices performed to validate our concept."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme035.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME036",
      "title": "The Development of LLRF System at PAL",
      "authors": [
        "K.-H. Park",
        "H.S. Han",
        "Y.-G. Jung",
        "D.E. Kim",
        "H.-G. Lee",
        "H.S. Suh",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "J.-S. Chai",
        "Y.S. Lee",
        "SKKU",
        "Suwon",
        "Republic of Korea",
        "POSTECH",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "The PAL has been developing the low level radio frequency (LLRF) system. The required field stabilities of the LLRF system are within ±0.75% in amplitude and 0.35° in phase in a cavity. All the hardware including RF front–end",
        "FPGA with peripherals such as ADC",
        "DAC",
        "Oscillator and digital interface were assembled. The sub-modules for the RF signal processing were written by VHDL and integrated to test at the local facility. The macroblaze software processor was implemented to make the system simple in interfacing to peripherals and to secure flexibility later. This paper described the microblaze processor which was ported into the"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme036.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME037",
      "title": "Fast Orbit Feedback at Taiwan Photon Source",
      "authors": [
        "A. Bardorfer",
        "P. Leban",
        "I-Tech",
        "Solkan",
        "Slovenia",
        "P.C. Chiu",
        "K.T. Hsu",
        "C.H. Kuo",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Low latency",
        "distributed",
        "Fast Orbit Feedback (FOFB) application",
        "based on singular value decomposition",
        "entirely implemented in FPGA",
        "has been developed for the Taiwan Photos Source (TPS). The FOFB utilizes the latest Libera Brilliance+ units for measuring beam position and the Gigabit Data eXchange (GDX) modules",
        "which take care of global orbit distribution via 6.5 Gbit/s fiber optic or passive Cu links",
        "and provide a large orbit data history buffer. The magnet correction in a matrix form of M = V . PI( S-1 . UT . ( Golden-Orbit ) ) is calculated entirely in FPGA",
        "using a massively parallel approach and sent to the magnet power supplies via 2.5 Gbit/s link. The entire FOFB calculation is distributed over 48 GDX modules and the system allows for synchronous (on/off/pause) FOFB control via external input signal. The latencies of 60 ns per BPM for orbit distribution",
        "1.5 us for FOFB calculation and 1.5 us for magnet data transmission have been measured at TPS test installation in November 2012. The expected total communication and FOFB calculation latency in the TPS final configuration (168 BPMs) is expected to stay within 15-20 us range."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme037.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME038",
      "title": "Slow Orbit Feedback and Beam Stability at ALBA",
      "authors": [
        "J. Marcos",
        "M. Muñoz",
        "CELLS-ALBA Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "ALBA is a 3GeV 3rd generation synchrotron radiation source built nearby Barcelona providing service to users since May 2012. During all this period",
        "a Slow Orbit Feedback system (SOFB) has been running during users’ operation in order to deliver a stable photon beam to the Beamlines. The system employs 88 out of the 104 Beam Position Monitors (BPMs) available at ALBA and 88 horizontal and vertical correctors. In addition",
        "since the middle of the year (July 2012)",
        "the reading of the X-Ray BPM (XBPM) for one of the Front Ends",
        "with a Bending Magnet as a source",
        "has also been included in the correction loop. In this paper we summarize the performance of the SOFB system. Besides",
        "we also present data corresponding to the evolution along the year of the XBPM readings for several Front Ends that have a planar Insertion Device (ID) as a source. The analyzed XBPMs are not included in the orbit correction loop",
        "and consequently they supply information regarding the long term stability of ALBA Storage Ring."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme038.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME040",
      "title": "Investigation to Reduce Power Overhead Required in  Superconducting RF Cavity Field Control",
      "authors": [
        "R. Zeng",
        "S. Molloy",
        "A. Sunesson",
        "ESS",
        "Lund",
        "Sweden",
        "Lund University",
        "Lund",
        "Sweden",
        "A power overhead of more than 25% is usually required in RF field control of klystron drived superconducting cavity",
        "since it is much easier to implement feild control in a linear region of klystron where it is far below saturation. It however results in a reduced efficiency and more power consumption. Within ESS project it places very high demands on energy efficiency",
        "which leads to stringent requirements on power overhead required in RF field control. Investigation on power overhead reduction in RF field control has been carried out at ESS and related simulation has been done. In this paper we will look at how close we can implement field control to the klystron saturation and discuss if it is possible to make RF field control the RF field with 10% overhead."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme040.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME041",
      "title": "The Distance from CERN to LNGS",
      "authors": [
        "M.A. Jones",
        "I. Efthymiopoulos",
        "D.P. Missiaen",
        "CERN",
        "Geneva",
        "Switzerland",
        "Obviously the distance between the CNGS Target at CERN and the LNGS Opera experiment cannot be measured directly and in fact requires the combination of three independent sets of measurements: two to link underground reference points at each site to corresponding points on the surface; and a third to link the surface points at both sites. Until the Opera results raised questions about the speed at which neutrinos travelled",
        "the main alignment concern for the CNGS beamline had been an orientation problem -to ensure that the beamline arrived to within ~100 m of its target at LNGS. GPS measurements at the two sites",
        "and the use of gyro-theodolite measurements in the tunnel at CERN",
        "ensured that the absolute alignment of the beamline was established to the required accuracy. New determinations of the links between the surface and the tunnel were not considered necessary until interest grew in the distance between the sites",
        "at which point additional measurement campaigns were organised in order to further reduce the uncertainty in the distance. Details of all these campaigns and the distance estimates will be given."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme041.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME042",
      "title": "Modelling and Studies for a Wideband Feedback System for Mitigation of Transverse Single Bunch Instabilities",
      "authors": [
        "K.S.B. Li",
        "W. Höfle",
        "G. Rumolo",
        "CERN",
        "Geneva",
        "Switzerland",
        "J.M. Cesaratto",
        "J.E. Dusatko",
        "J.D. Fox",
        "M.T.F. Pivi",
        "K.M. Pollock",
        "C.H. Rivetta",
        "O. Turgut",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "As part of the LHC injector upgrade a wideband feedback system is under study for mitigation of coherent single bunch instabilities. This type of system may provide a generic way of shifting the instability threshold to regions that are currently inaccessible",
        "thus",
        "boosting the brightness of future beams. To study the effectiveness of such systems",
        "a numerical model has been developed that constitutes a realistic feedback system including real transfer functions for pickup and kicker",
        "realistic N-tap FIR and IIR filters as well as noise and saturation effects. Simulations of SPS cases have been performed with HeadTail to evaluate the feedback effectiveness in the presence of electron clouds and TMCI. Some results are presented addressing bandwidth limitations",
        "noise issues and amplifier power requirements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme042.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME043",
      "title": "Performance of the LHC Transverse Damper with Bunch Trains",
      "authors": [
        "W. Höfle",
        "F. Dubouchet",
        "G. Kotzian",
        "D. Valuch",
        "CERN",
        "Geneva",
        "Switzerland",
        "In 2012 the LHC has operated for Physics with bunch trains at 50 ns spacing. Tests have been performed with the nominal design bunch spacing of 25 ns. The transverse damper has been an essential element to provide beam stability for the multi-bunch beam with up to 1380 bunches used at 50 ns spacing. We report on the experience gained with 50 ns spacing and the improvements in the signal processing tested for the future 25 ns operation. The increase in bandwidth required for 25 ns spacing constituted a particular challenge. The response of the system was carefully measured and the results used to digitally pre-distort the drive signal to compensate for a drop in gain of the power system for higher frequencies. The bunch-by-bunch data collected from the feedback signal path provided valuable information during the 2012 Physics run that can be further explored for beam diagnostics purposes and instability analysis in the future. Performance estimates are given for the 7 TeV run planned for 2015",
        "at 25 ns bunch spacing."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme043.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME044",
      "title": "Generation of Controlled Losses in Milisecond Timescale with Transverse Damper in LHC",
      "authors": [
        "M. Sapinski",
        "T. Baer",
        "V. Chetvertkova",
        "B. Dehning",
        "W. Höfle",
        "A. Priebe",
        "R. Schmidt",
        "D. Valuch",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [],
      "abstract": "A controlled way of generating of beam losses is required in order to investigate the quench limits of the superconducting magnets in the LHC. This is especially difficult to achieve for losses with millisecond duration. A series of experiments using the transverse damper system has proven that such a fast loss can be obtained even in the case of rigid 4 TeV beams. This paper describes the optimisation of beam parameters and transverse damper waveform required to mimic fast loss scenarios and reports on extensive tracking simulations undertaken to fully understand the time and spatial structure of these losses. The application of this method to the final quench tests is also presented.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme044.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME045",
      "title": "Development and Validation of a Multipoint Based Laser Alignment System for CLIC",
      "authors": [
        "G. Stern",
        "J. Kemppinen",
        "F. Lackner",
        "H. Mainaud Durand",
        "D. Piedigrossi",
        "J. Sandomierski",
        "M. Sosin",
        "CERN",
        "Geneva",
        "Switzerland",
        "A. Geiger",
        "S. Guillaume",
        "ETH",
        "Zurich",
        "Switzerland",
        "Alignment is one of the major challenges within CLIC study",
        "since all accelerator components have to be aligned with accuracy up to 10 μm over sliding windows of 200 m. So far",
        "the straight line reference concept has been based on stretched wires coupled with Wire Positioning Sensors. This concept should be validated through inter-comparison with an alternative solution. This paper proposes an alternative concept where laser beam acts as straight line reference and optical shutters coupled with cameras visualise the beam. The principle was first validated by a series of tests using low-cost components. Yet",
        "in order to further decrease measurement uncertainty in this validation step",
        "a high-precision automatised micrometric table and reference targets have been added to the setup. The paper presents the results obtained with this new equipment",
        "in terms of measurement precision. In addition",
        "the paper gives an overview of first tests done at long distance (up to 53 m)",
        "having emphasis on beam divergence."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME046",
      "title": "Alignment Challenges for a Future Linear Collider",
      "authors": [
        "H. Mainaud Durand",
        "D.P. Missiaen",
        "G. Stern",
        "CERN",
        "Geneva",
        "Switzerland",
        "The preservation of ultra-low emittances in the main linac and Beam Delivery System area is one of the main challenges for linear colliders. This requires alignment tolerances never achieved before at that scale",
        "down to the micrometre level. As a matter of fact",
        "in the LHC",
        "the goal for the smoothing of the components was to obtain a 1σ deviation with respect to a smooth curve of 0.15 mm in a 150 m long sliding window",
        "while for the CLIC project for example",
        "it corresponds to 10 micrometres over a sliding window of 200m in the Beam Delivery System area. Two complementary strategies are being studied to fulfill these requirements: the development and validation of long range alignment systems to propagate precision and accuracy over a few hundreds of metres and short range alignment systems over a few metres. The studies undertaken",
        "with associated test setups and the latest results will be detailed",
        "as well as their application for the alignment of both CLIC and ILC colliders."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME047",
      "title": "Identification of Sources of Orbital Distortions in Corrector Space",
      "authors": [
        "M. Böge",
        "M. Aiba",
        "A. Saa Hernandez",
        "A. Streun",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Since modern ring and linear accelerator based light sources feature fast orbit feedback (FOFB) systems which transform orbital oscillations in beam position monitor (BPM) space into corrector (C) space over a wide frequency range",
        "most perturbations can be directly analyzed utilizing the C pattern. In C space the localization of sources of distortions is facilitated since the large (per unit phase) number of BPMs and Cs involved provides a good spatial resolution. Applications of this technique include the beam-assisted girder alignment where changes in the C pattern are interactively analyzed while girder positions are remotely altered or the beam-based alignment of quadrupole/BPM pairs where the variation of C values as the result of quadrupole variations are observed. In both cases large oscillations in BPM space are completely surpressed by the FOFB leading to well controlled and stable conditions during the measurement."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme047.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME048",
      "title": "Adjusting and Calibration Method for TPS Laser PSD System",
      "authors": [
        "M.L. Chen",
        "J.-R. Chen",
        "P.S.D. Chuang",
        "H.C. Ho",
        "K.H. Hsu",
        "D.-G. Huang",
        "W.Y. Lai",
        "C.-S. Lin",
        "C.J. Lin",
        "H.C. Lin",
        "H.M. Luo",
        "S.Y. Perng",
        "P.L. Sung",
        "T.C. Tseng",
        "H.S. Wang",
        "M.H. Wu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Tsing Hua University",
        "Hsinchu",
        "Taiwan",
        "Laser PSD positioning system is a part of the TPS girder auto-alignment system and is designed for aligning and positioning the straight-section girders of TPS storage ring. Although the components of Laser PSD system are fabricated",
        "assembling and adjusting precisely in advance",
        "the accuracy of Laser PSD system is still influenced by girder fabricating quality",
        "assembling errors and moving errors by transportation. For system correction",
        "Laser beam positions on four sets of PSDs are formulized as an equation and calibrated with Laser tracker ultimately. According to the PSD calibration formula",
        "the two girders of 18m long straight-section can be aligned and positioned within 20um by comparing with Laser tracker. This paper describes the assembly",
        "installation and calibration process of Laser PSD system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme048.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME049",
      "title": "An Application of Laser Position Sensing Detector for Magnet Centralizing System",
      "authors": [
        "C.-S. Lin",
        "J.-R. Chen",
        "M.L. Chen",
        "P.S.D. Chuang",
        "H.C. Ho",
        "K.H. Hsu",
        "D.-G. Huang",
        "C.K. Kuan",
        "W.Y. Lai",
        "C.J. Lin",
        "H.C. Lin",
        "H.M. Luo",
        "S.Y. Perng",
        "P.L. Sung",
        "T.C. Tseng",
        "H.S. Wang",
        "M.H. Wu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Tsing Hua University",
        "Hsinchu",
        "Taiwan",
        "Taiwan Photon Source (TPS) project has been proposed to create a 3GeV synchrotron light source. The designated ultra-low emittance of this new light source requires high precision positioning of storage ring magnets. The alignment of all magnets is very importance since it directly affects the closed orbit of electron beams. Previously",
        "conventional on-site alignment of the magnets was mainly relying on the theodolite performance. The cumulated errors could be in the order of 0.1mm. In this paper",
        "a new alignment scheme is proposed to enhance the on-site alignment of magnets for TPS project. To achieve the high precision requirements",
        "a device possessing the advantages of expansion mandrel in conjunction with Position Sensing Detector (PSD) is proposed. The development of this alignment device is anticipated to provide a better mechanism to properly align the centers of the both quadrupole and sextupole magnets on girder with less than 30μm positioning errors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme049.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME050",
      "title": "Alignment Design and Status of Taiwan Photon Source",
      "authors": [
        "W.Y. Lai",
        "J.-R. Chen",
        "M.L. Chen",
        "P.S.D. Chuang",
        "H.C. Ho",
        "K.H. Hsu",
        "D.-G. Huang",
        "C.K. Kuan",
        "C.-S. Lin",
        "C.J. Lin",
        "H.C. Lin",
        "H.M. Luo",
        "S.Y. Perng",
        "P.L. Sung",
        "T.C. Tseng",
        "H.S. Wang",
        "M.H. Wu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Tsing Hua University",
        "Hsinchu",
        "Taiwan",
        "Taiwan Photon Source (TPS) is a new 3-GeV ring with characteristics of great brightness and small emittance",
        "at present under construction at National Synchrotron Radiation Research Center (NSRRC) Taiwan. The positioning of the magnets is highly sensitive to alignment errors",
        "and the entire building will be constructed half underground at depth 12 m relative to Taiwan Light Source (TLS) for stability reasons; for these reasons the survey and alignment work is confined and difficult. To position magnets precisely and quickly",
        "a highly accurate auto-tuning girder system combined with a survey network was designed to accomplish the alignment tasks. The survey network includes a preliminary Global Positioning System (GPS) network and a laser tracking network. The position data from the survey network define a basis for the system of motorized girders to auto-tune and to improve the accuracy. The detailed survey and alignment design",
        "installation process is described in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme050.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME052",
      "title": "LLRF Characterisation of the Daresbury International Cryomodule",
      "authors": [
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "P.A. Corlett",
        "A.J. Moss",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The 2-cavity Superconducting RF (SRF) Linac cryomodule of the Accelerators and Lasers in Combined Experiments (ALICE) located at Daresbury Laboratory will be replaced by a new International ERL Cryomodule in early 2013. The improved 7-cell",
        "1.3 GHz SRF cavities will be characterised and compared with the original 9-cell cavities. Tests will be performed by driving the cavities by a VCO-PLL loop so that Q measurements",
        "microphonics sensitivity and Lorentz force detuning can be analysed. A digital LLRF system using the"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme052.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME053",
      "title": "Latest Performance Results from the FONT 5 Intra Train Beam Position Feedback System at ATF",
      "authors": [
        "M.R. Davis",
        "D.R. Bett",
        "N. Blaskovic Kraljevic",
        "P. Burrows",
        "G.B. Christian",
        "Y.I. Kim",
        "C. Perry",
        "JAI",
        "Oxford",
        "United Kingdom",
        "R. Apsimon",
        "B. Constance",
        "A. Gerbershagen",
        "CERN",
        "Geneva",
        "Switzerland",
        "A prototype ultra-fast beam-based feedback system for deployment in single-pass beamlines",
        "such as a future lepton collider (ILC or CLIC) or a free-electron laser",
        "has been fabricated and is being tested in the extraction and final focus lines of the Accelerator Test Facility (ATF) at KEK."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme053.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME054",
      "title": "Girder Alignment in the Diamond Storage Ring",
      "authors": [
        "M. Apollonio",
        "R. Bartolini",
        "W.J. Hoffman",
        "A.J. Rose",
        "A. Thomson",
        "Diamond",
        "Oxfordshire",
        "United Kingdom",
        "JAI",
        "Oxford",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "A model of the Diamond Storage Ring describing the misalignment of its 74 girders in terms of displacements and rotations is used to predict the orbit distortions and corrector magnet strengths needed for a zero orbit. Using the data from a survey we compare the effect of a pure magnet misalignment with the natural orbit of the machine. A test with a displaced girder meant to produce a reduction in corrector strength is introduced. Comparison with data obtained from the actual move of the girder is presented and discussed.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme054.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME055",
      "title": "Investigation of Source Point Instabilities in Dipole Magnet Based Beamlines",
      "authors": [
        "M. Apollonio",
        "R. Bartolini",
        "Diamond",
        "Oxfordshire",
        "United Kingdom",
        "JAI",
        "Oxford",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "At Diamond the source point in the second dipole of the Double Bend Achromats can vary due the lack of adjacent BPMs constraining angle and position of the electron beam at the dipole. We have implemented a code based on our AT model to predict the effects of a corrector strength change and compared our predictions to data both from a beamline and from our pinhole cameras. We discuss the possibility of interfacing the code to a ray tracing routine in order to infer beam spot changes in the downstream beamline and suggest a procedure to restore the original source point.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme055.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME056",
      "title": "Application of Z-transform to Noise Response Modeling  of a Bunch-by-bunch Feedback System",
      "authors": [
        "C. Yao",
        "N.P. Di Monte",
        "A.J. Scaminaci",
        "H. Shang",
        "ANL",
        "Argonne",
        "USA",
        "The APS storage ring has an electron beam energy of 7 GeV and a single current of up to 16 mA. Transverse beam instability is corrected by a combination of chromatic correction and bunch-by-bunch feedback system. Noises produced in the pickup circuits is processed and transferred to the beam the same as a beam signal",
        "which contributes to beam motion when the loops are closed. By analyzing the input data stream of the feedback system",
        "one can passively obtain useful information",
        "such as the tunes",
        "loop stability",
        "noise spectrum",
        "etc. This approach has been reported by J. Klute and D. Teytelman. We implemented a passive and continuous tune monitoring process at the APS storage ring. In order to understand the underlying principle",
        "we applied z-transform analysis to the noise-response model of a bunch-by-bunch feedback system. Our analysis shows a clear relationship between the spectrum of the noise response and the open-loop response of the beam. The noise-response model can also be applied to other areas",
        "such as stability and noise analysis of a bunch-by-bunch feedback system. This report presents our analysis and some experimental data."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme056.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME057",
      "title": "Commission of the Drive Laser System for Advanced Superconducting Test Accelerator",
      "authors": [
        "J. Ruan",
        "M.D. Church",
        "D.R. Edstrom",
        "Jr",
        "T.R. Johnson",
        "J.K. Santucci",
        "Fermilab",
        "Batavia",
        "USA",
        "Currently an advanced superconducting test accelerator (ASTA) is being built at Fermilab. The accelerator will consist of a photo electron gun",
        "injector",
        "ILC-type cryomodules",
        "multiple downstream beam lines for testing cryomodules and carrying advanced accelerator researches. In this paper we will report the commissioning and the drive laser system for this facility. It consists of a fiber laser system properly locked to the master frequency",
        "a regen-amplifier",
        "several power amplifier and final wavelength conversion stage. We will also report the characterization of the whole laser system and the performance of the laser system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme057.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME058",
      "title": "Integrated System Modeling Analysis of a Multi-cell Deflecting-mode Cavity in Cryogenic Operation",
      "authors": [
        "Y.-M. Shin",
        "M.D. Church",
        "J. Ruan",
        "Fermilab",
        "Batavia",
        "USA",
        "Over the past decade",
        "multi-cell deflecting (TM110) mode cavities have been employed for experiments on six-dimensional phase-space beam manipulation *",
        "**",
        "***",
        "****",
        "****** at the A0 Photo-Injector Lab (16 MeV) in Fermilab and their extended applications with vacuum cryomodules are currently scheduled at the Advanced Superconducting Test Accelerator (ASTA) user facility (> 50 MeV). Despite the successful test results",
        "the cavity",
        "however",
        "demonstrated limited RF performance during liquid nitrogen (LN2) ambient operation that was inferior to theoretic prediction. We thus fully inspected the cavity design with theoretical calculation (based on Panofsky-Wenzel theorem) combined with RF simulations. Also",
        "we are extensively developing an integrated computational tool with comprehensive system analysis capacity to solve complex thermodynamics and mechanical stresses of a high-Q deflecting-mode cryomodule. We will benchmark simulation analysis result with experimental data from high power RF tests in Fermilab. Successfully developed modeling tool will be potentially used for prompt assessment on RF performance of vacuum-cryomodules.",
        "* D. A. Edwards",
        "LINAC 2002  ** Y.-E Sun",
        "PRTAB 2004  *** P. Piot"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme058.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME059",
      "title": "A 4 GS/sec  Instability Feedback Processing System for Intra-bunch Instabilities",
      "authors": [
        "J.E. Dusatko",
        "J.M. Cesaratto",
        "J.D. Fox",
        "J.J. Olsen",
        "K.M. Pollock",
        "C.H. Rivetta",
        "O. Turgut",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "CERN",
        "Geneva",
        "Switzerland",
        "We present the architecture and implementation overview of a proof-of-principle digital signal processing system developed to study control of Electron-Cloud and Transverse Mode Coupling Instabilities (TMCI) in the CERN SPS. This system is motivated by intensity increases planned as part of the High Luminosity LHC upgrade. It is based on a reconfigurable processing architecture which samples intra-bunch motion and applies correction signals at a 4GSa/s rate",
        "allowing multiple samples across a single 2ns SPS bunch. This initial demonstration system is a rapidly developed prototype consisting of both commercial and custom-designed hardware that implements feedback control on a single bunch. It contains a high speed ADC and DAC",
        "capable of sampling at up to 4GSa/s",
        "with a 16-tap FIR control filter for each bunch sample slice. Other system features include a timing subsystem to synchronize the sampling to the injection and the bunch 1 markers",
        "the capability of generating arbitrary time domain signals to drive the bunch and diagnostic functions including a snapshot memory for ADC data. This paper describes the design",
        "construction and operational experience of this system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme059.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME060",
      "title": "First Results and Analysis of the Performance of a 4 GS/s Intra-bunch Vertical Feedback System at the SPS",
      "authors": [
        "J.M. Cesaratto",
        "J.E. Dusatko",
        "J.D. Fox",
        "J.J. Olsen",
        "K.M. Pollock",
        "C.H. Rivetta",
        "O. Turgut",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "H. Bartosik",
        "W. Höfle",
        "G. Kotzian",
        "U. Wehrle",
        "CERN",
        "Geneva",
        "Switzerland",
        "We present experimental measurements taken from SPS machine development studies with an intra-bunch feedback channel. These studies use a digital signal processing system to implement general-purpose control algorithms on multiple samples across a single SPS bunch ( for ease of synchronization with the SPS RF frequency a sampling frequency of 3.2 GS/sec. is implemented). These initial studies concentrate on single-bunch motion",
        "and study the vertical betatron motion as the feedback control is varied. The studies are focused on validating simulation models of the beam dynamics with feedback. Time and frequency domain results include excitation and damping of intra-bunch motion with positive and negative feedback. We present an overview of the challenges of intra-bunch feedback",
        "and highlight methods to time-align the pickup and kicker signals within the closed-loop feedback channel."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme060.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME061",
      "title": "A Wideband Slotted Kicker Design for SPS Transverse Intra-bunch Feedback",
      "authors": [
        "J.M. Cesaratto",
        "J.D. Fox",
        "C.H. Rivetta",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "D. Alesini",
        "A. Drago",
        "A. Gallo",
        "F. Marcellini",
        "M. Zobov",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "CERN",
        "Geneva",
        "Switzerland",
        "Control and mitigation of transverse beam instabilities caused by electron cloud and TMCI will be essential for the SPS to meet the beam intensity demands for the HL-LHC upgrade. A wideband intra-bunch feedback method is in development",
        "based on a 4 GS/s data acquisition and processing",
        "and with a back end frequency structure extending to 1 GHz. A slotted type kicker",
        "similar to those used for stochastic cooling",
        "has been considered as the terminal element of the feedback chain. It offers the most promising deflecting structure characteristics to meet the system requirements in terms of bandwidth",
        "shunt impedance",
        "and beam coupling impedance. Different types of slotted structures have been explored and simulated",
        "including a ridged waveguide and coaxial type waveguide. In this paper we present our findings and the conceptual design of a vertical SPS wideband kicker consistent with the stay clear",
        "vacuum",
        "frequency band coverage",
        "and peak shunt impedance requirements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme061.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME062",
      "title": "Short-Pulse Ti:Sapphire Laser System for Photocathode Research at SLAC",
      "authors": [
        "W.J. Corbett",
        "A. Brachmann",
        "R.N. Coffee",
        "A.R. Fry",
        "S. Gilevich",
        "N. Hartmann",
        "W. Helml",
        "P. Hering",
        "E.N. Jongewaard",
        "D. Kelley",
        "J.R. Lewandowski",
        "W. Polzin",
        "J. Sheppard",
        "P. Stefan",
        "T. Vecchione",
        "S.P. Weathersby",
        "W.E. White",
        "M. Woods",
        "F. Zhou",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "A photo-cathode research laboratory has been constructed at SLAC to test and characterize the spare LCLS electron gun. At the heart of the laboratory is a dual-purpose Ti:Sapphire oscillator/regen laser that can deliver either a 2.5ps",
        "760nm beam to the photocathode gun or a 35fs",
        "800nm beam to prototype diagnostics for the LCLS. The objective of the photocathode research is to definitively identify ‘recipes’ for high-reliability cathode processing resulting in high quantum efficiency and low beam emittance. The LCLS diagnostics program is presently aimed at developing spectral-encoding systems for shot-by-shot pulse arrival time measurements at the 10fs level. In this paper we review the Ti:Sapphire laser system and report on status of the photocathode and diagnostics programs."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme062.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME063",
      "title": "Progress Report on Development of a 5-μm Drive Laser for Dielectric Laser Acceleration",
      "authors": [
        "G. Xu",
        "I. Jovanovic",
        "S.F. Wandel",
        "Penn State University",
        "University Park",
        "Pennsylvania",
        "USA",
        "PBPL",
        "Los Angeles",
        "USA",
        "P.D. Hoang",
        "P. Musumeci",
        "B.D. O'Shea",
        "J.B. Rosenzweig",
        "UCLA",
        "Los Angeles",
        "USA",
        "A.Y. Murokh",
        "A.G. Ovodenko",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A simple and robust ultrafast",
        "high-peak-power 5-μm laser source for pumping a dielectric photonic structure for high-gradient electron acceleration has been designed and is being constructed. The use of long wavelength drive lasers can mitigate the problem of dielectric structure breakdown caused by multiphoton ionization. In addition",
        "structure fabrication requirements are relaxed",
        "and greater energy can be stored in the structure. The 5-μm laser source consists of two components: (1) a type-II-beta-barium borate-based 2-μm optical parametric amplifier (OPA) as a pump source",
        "and (2) a type-I-zinc-germaniu-phosphate-based 5-μm OPA to produce mJ-class",
        "<100 fs pulses. Our supercontinuum seeded two-stage 2-μm OPA is pumped by a Ti:sapphire amplifier and produces pulse energy of ~1.4 mJ with a pulse duration of 42 fs (~6 optical cycles). Carrier-envelope phase (CEP) stabilization is passively established for 2 μm pulses in our OPA design. An modified design of seed pulse generation for the 5-μm OPA based on several cascaded parametric processes can also result in CEP-stable operation for 5-μm amplified pulses."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme063.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPME064",
      "title": "Recent Development on Beam-based Alignment in RHIC",
      "authors": [
        "J. Beebe-Wang",
        "J.M. Ziegler",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "During the 2012 polarized proton and heavy ion runs",
        "we continued the efforts on beam-based alignment (BBA) of quadrupoles in RHIC. A complete set of BBA data of triplet quadrupoles in all interaction regions of RHIC was obtained. In addition",
        "the measurement procedures and data analysis were improved and the corresponding codes were developed. Here we report on the results of BBA measurements",
        "analysis",
        "and corrections. The model sensitivity",
        "the measurement repeatability",
        "and the BBA accuracy limitations are also discussed. As a continuing effort",
        "we also present application code that is under development for future BBA operations in RHIC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/wepme064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/wepme064.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/wepme064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEPME064",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 56,
  "scrape_time": "2025-10-10 21:36:17"
}