{
  "session_info": {
    "id": "MOOB",
    "name": "MOOB - Overview and Commissioning",
    "url": "https://proceedings.jacow.org/ibic2021/html/moob.htm"
  },
  "papers": [
    {
      "paper_id": "MOOB01",
      "title": "Ultra-Fast Line-Camera KALYPSO for fs-Laser-Based Electron Beam Diagnostics",
      "authors": [
        "M.M. Patil",
        "E. Bründermann",
        "M. Caselle",
        "S.A. Chilingaryan",
        "T. Dritschler",
        "A. Ebersoldt",
        "S. Funkner",
        "A. Kopmann",
        "A.-S. Müller",
        "M.J. Nasse",
        "G. Niehues",
        "M. Reissig",
        "J.L. Steinmann",
        "M. Weber",
        "C. Widmann",
        "KIT",
        "Karlsruhe",
        "Germany",
        "A very common bottleneck to study short electron bunch dynamics in accelerators is a detection scheme that can deal with high repetition rates in the MHz range. The KIT electron storage ring KARA (Karlsruhe Research Accelerator) is the first storage ring with a near-field single-shot electro-optical (EO) bunch profile monitor installed for the measurement of electron bunch dynamics in the longitudinal phase-space. Using electro-optical spectral decoding (EOSD) it is possible to imprint the bunch profile on chirped laser pulses subsequently read out by a spectrometer and a camera. However",
        "commercially available cameras have a drawback in their acquisition rate",
        "which is limited to a few hundred kHz. Hence",
        "we have developed KALYPSO",
        "an ultra-fast line camera capable of operating in the MHz regime. Its modular approach allows the installation of several sensors e.g. Si",
        "InGaAs",
        "PbS",
        "PbSe to cover a wide range of spectral sensitivities. In this contribution",
        "an overview of the EOSD experimental setup and the detector system installed for longitudinal bunch studies will be presented."
      ],
      "institutions": [
        "Funding: This work is supported by BMBF project 05K19VKD (Federal Ministry of Education and Research), DFG-funded Doctoral School \"KSETA\""
      ],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/moob01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/moob01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/moob01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-MOOB01",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOB02",
      "title": "Recommissioning of the CERN Injector Complex Beam Instrumentation",
      "authors": [
        "CERN",
        "Meyrin",
        "Switzerland",
        "During the last two years",
        "the CERN injector complex has been completely renovated with the aim of providing high intensity and smaller emittance beams to the LHC. A new Linac providing H− has been constructed and major upgrades in the Proton Synchrotrons (PS Booster ring",
        "PS ring and Super PS ring) have been performed. A full suite of new beam diagnostics has been implemented and commissioned. This includes fast wire scanners",
        "beam gas ionization monitors",
        "quadrupolar pick-ups and diamond beam loss detectors. New radiation-hard beam position monitoring system was also successfully deployed in the SPS. This talk will present an overview of the performance of the newly built instruments."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/moob02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/moob02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/moob02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-MOOB02",
      "page_number": "7",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOB03",
      "title": "Overview of RAON Beam Instrumentation System and Construction Status of the Low-Energy Linac",
      "authors": [
        "Y.S. Chung",
        "G.D. Kim",
        "J.W. Kwon",
        "H.J. Woo",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "Korea University Sejong Campus",
        "Sejong",
        "Republic of Korea",
        "RAON is a heavy ion accelerator for researches using Rare Isotopes (RI) as a major research facility in Korea. RAON uses both In-flight Fragmentation and Isotope Separation On-Line methods to provide various RI beams. The ultimate goal of the driver Linac of RAON is to accelerate uranium and proton beams up to 200 MeV/u and 600 MeV",
        "with a maximum beam currents of 8.3 pA and 660 pA",
        "respectively. After 9 years of RAON construction",
        "commissioning of the low-energy Linac front-end system that consists of 14.5 GHz ion source",
        "low energy beam transport",
        "a 500 keV/u radio frequency quadrupole",
        "and medium energy beam transport has been carried out since late 2020. And beam injection to the low-energy superconducting Linac is planned to start in December 2021. Here",
        "we introduce RAON beam instrumentation and diagnostics systems as well as the construction status of the low-energy Linac."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/moob03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/moob03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/moob03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-MOOB03",
      "page_number": "13",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOB04",
      "title": "Summary of the ARIES Workshop on Materials and Engineering Technologies for Particle Accelerator Beam Diagnostic Instruments",
      "authors": [
        "GSI",
        "Darmstadt",
        "Germany",
        "University of Oxford",
        "Oxford",
        "United Kingdom",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "O.R. Jones",
        "R. Veness",
        "CERN",
        "Meyrin",
        "Switzerland",
        "G. Kube",
        "K. Wittenburg",
        "DESY",
        "Hamburg",
        "Germany",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "ARIES* is an EU-sponsored programme for accelerator research and innovation. An international Workshop was held online as part of this programme in June 2021 on the topic of ’Materials and Engineering Technologies for Particle Accelerator Beam Diagnostic Instruments’. The aim of the Workshop was to bring together instrument designers",
        "experts and industry and research groups to review the state of the art in the field",
        "present designs and discuss future challenges",
        "whilst also developing and strengthening collaborations between groups. There were sessions covering ’Instrument design and operation’",
        "’Novel materials and applications’ and ’New technology and components’ over the three half-days of the on-line meeting. This paper will review the key topics presented at the workshop along with a summary of discussions held and proposed directions for future studies."
      ],
      "institutions": [],
      "abstract": "* https://aries.web.cern.ch Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/moob04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/moob04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/moob04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-MOOB04",
      "page_number": "16",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:39:49"
}