{
  "session_info": {
    "id": "TUPFDV",
    "name": "TUPFDV - Tuesday Poster Fundamental Development and Research",
    "url": "https://proceedings.jacow.org/srf2021/html/tupfdv.htm"
  },
  "papers": [
    {
      "paper_id": "TUPFDV001",
      "title": "Effect of Heating Rate on Recrystallization in Rolled Multicrystals of Pure Niobium",
      "authors": [
        "T.R. Bieler",
        "D. Kang",
        "Michigan State University",
        "East Lansing",
        "Michigan",
        "USA",
        "R. Rodríguez-Desconocido",
        "M. Terol-Sánchez",
        "UPM",
        "Madrid",
        "Spain",
        "N. Fleming",
        "C. McKinney",
        "Z.L. Thune",
        "K. Zheng",
        "MSU",
        "East Lansing",
        "USA",
        "Niowave",
        "Inc.",
        "Lansing",
        "Michigan",
        "USA",
        "The performance of niobium cavities in superconducting radiofrequency particle accelerators requires nearly defect-free inner surfaces. While methods to obtain smooth inner surfaces are established",
        "the role of metallurgical defects on superconducting performance is also important",
        "as defects such as grain boundaries and dislocations are known to trap flux that dissipates energy and reduces efficiency. Variable microstructure and texture gradients may account for the observed variability in cavity performance",
        "so it is hypothesized that the texture and microstructure gradients originate from the large grain size of ingots",
        "whose influence is not completely erased in the process of making sheet metal. To examine the evolution of microstructure and texture gradients",
        "the crystal orientations present in a cylindrical cap rolled to ~90% reduction were heat treated. Initial crystal orientations were measured before rolling",
        "and before and after slow and rapid heating rate vacuum heat treatments."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/tupfdv001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/tupfdv001.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/tupfdv001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-TUPFDV001",
      "page_number": "396",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFDV002",
      "title": "SIMS Sample Holder and Grain Orientation Effects",
      "authors": [
        "J.W. Angle",
        "M.J. Kelley",
        "Virginia Polytechnic Institute and State University",
        "Blacksburg",
        "USA",
        "M.J. Kelley",
        "E.M. Lechner",
        "A.D. Palczewski",
        "C.E. Reece",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "NCSU AIF",
        "Raleigh",
        "North Carolina",
        "USA",
        "SIMS analyses for ’N-doped’ materials are becoming increasingly important. A major hurdle to acquiring quantitative SIMS results for these materials is the uncertainty of instrument calibration due to changes in sample height either from sample topography or from the sample holder itself. The CAMECA sample holder design allows for many types of samples to be analyzed. However",
        "the cost is that the holder faceplate can bend",
        "introducing uncertainty into the SIMS results. Here we designed and created an improved sample holder which is reinforced to prevent faceplate deflection and thereby reduce uncertainty. Simulations show that the new design significantly reduces deflection from 10 µm to 5 nm. Measurements show a reduction of calibration (RSF) uncertainty from this source from 4.1% to 0.95%. Grain orientation has long been suspected to affect RSF determination as well. A bicrystal implant standard consisting of [111] and [001] grains were repeatedly rotated 15° in between analyses. It was observed that 20% of the analyses performed on [111] grains exhibited anomalously high RSF values likely due to the changing of the grain normal with respect to the primary Cs+ beam."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/tupfdv002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/tupfdv002.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/tupfdv002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-TUPFDV002",
      "page_number": "401",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFDV004",
      "title": "A SIMS Approach for the Analysis of Furnace Contamination",
      "authors": [
        "J.W. Angle",
        "M.J. Kelley",
        "Virginia Polytechnic Institute and State University",
        "Blacksburg",
        "USA",
        "M.J. Kelley",
        "E.M. Lechner",
        "A.D. Palczewski",
        "C.E. Reece",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "NCSU AIF",
        "Raleigh",
        "North Carolina",
        "USA"
      ],
      "institutions": [],
      "abstract": "Detection of surface contamination for SRF material is difficult due to the miniscule quantities and near atomic resolution needed. Visual inspection of samples known to have experienced surface contamination were found to have inconsistent nitride coverage after nitrogen doping. EBSD analysis suggest that nitride suppression tends to be most prevalent when deviating from the [111] and [001] zone axes. XPS suggested that tin was present as a contaminant on the surface with SIMS mass spectra also confirming its presence. SIMS depth profiles show a depletion of nitrogen content as well as an increase in car-bon content for contaminated samples. reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/tupfdv004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/tupfdv004.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/tupfdv004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-TUPFDV004",
      "page_number": "406",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFDV006",
      "title": "Dynamics of One-Side Multipactor on Dielectrics",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "Breakdown of dielectric RF windows is an important issue for particle accelerators and high-power RF sources. One of the generally considered reasons for the RF windows failure is the multipactor effect on dielectric surface. The multipactor may be responsible for excessive heating of dielectric and discharge of charges that accumulated in ceramic due to secondary emission. In this study the comprehensive self-consistent PIC simulations with space charge effect were performed in order to better understand the dynamic of one-side multipactor development and floating potential on dielectric induced by the emission. The important correlations between the multipactor parameters at saturation and the secondary emission properties of dielectric and the applied RF field parameters were found and are reported in the paper.",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/tupfdv006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/tupfdv006.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/tupfdv006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-TUPFDV006",
      "page_number": "411",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPFDV007",
      "title": "Surface Impedance of Nb₃Sn and YBa₂Cu₃O_{7-δ} in High Magnetic Fields",
      "authors": [
        "N. Pompeo",
        "A. Alimenti",
        "E. Silva",
        "K. Torokhtii",
        "Università degli Studi Roma III",
        "Roma",
        "Italy",
        "G. Celentano",
        "V. Pinto",
        "F. Rizzo",
        "ENEA C.R. Frascati",
        "Frascati (Roma)",
        "Italy",
        "UNIGE",
        "Geneva",
        "Switzerland",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "New potential rf applications of superconductors emerged with the need to operate in high dc magnetic fields (up to 16 T) where vortex motion dictates the response: the beam screen coating of the Future Circular Collider (FCC) [1] and haloscopes",
        "i.e. rf cavities for the axions detection [2]. However",
        "very few data are available in the required regimes. We present in this work measurements of the surface impedance Z up to 12 T on bulk Nb3Sn and YBCO thin films grown by different techniques. The measurements are performed with a dielectric loaded resonator operating at 15 GHz. We obtained the vortex motion resistivity and extracted the high frequency vortex motion parameters [3]: the depinning frequency",
        "the flux-flow resistivity and the pinning constant",
        "as well as their temperature and field dependences. Substantial differences are highlighted in the high frequency pinning properties of the studied materials",
        "providing useful information on possible improvements in view of applications. A comparison with the results obtained in the microwave frequency range at lower fields (up to 1 T) is given.",
        "[1] S. Calatroni",
        "IEEE Trans. Appl. Supercond.",
        "vol. 26 p. 3500204",
        "2016.  [2] D. Alesini et al.",
        "Phys. Rev. D",
        "vol. 99",
        "p. 101101",
        "2019. [3] J.I. Gittleman and B. Rosenblum",
        "Phys. Rev. Lett.",
        "vol. 16",
        "p.734",
        "1966."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/tupfdv007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/tupfdv007.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/tupfdv007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-TUPFDV007",
      "page_number": "416",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFDV008",
      "title": "Instrumentation R&D for the Studies of SRF Thin-Film Structures at KEK and Kyoto University",
      "authors": [
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "H. Hayano",
        "H. Ito",
        "R. Katayama",
        "T. Kubo",
        "T. Saeki",
        "KEK",
        "Ibaraki",
        "Japan",
        "Y. Iwashita",
        "Y. Kuriyama",
        "Kyoto University",
        "Research Reactor Institute",
        "Osaka",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "We have been developing SRF instrumentations by which the effective lower critical magnetic field Hc1",
        "eff of superconducting-material sample is evaluated through the method of the third-order harmonic voltage measurement mainly for the studies of new SRF thin-film structures. Recently",
        "the quad coil system",
        "which enables us to measure four samples simultaneously in a single batch of an experiment",
        "has been developed. In order to study the creation of thin-film structures inside the SRF cavity",
        "we developed 3-GHz-shaped coupon cavities and an XT-map system for the performance tests of 3 GHz cavities. This article reports the details of these works."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/tupfdv008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/tupfdv008.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/tupfdv008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-TUPFDV008",
      "page_number": "421",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFDV010",
      "title": "New Recipes to Optimize the Niobium Oxide Surface From First-Principles Calculations",
      "authors": [
        "N. Sitaraman",
        "T. Arias",
        "Z. Baraissov",
        "M.M. Kelley",
        "D.A. Muller",
        "Cornell University",
        "Ithaca",
        "New York",
        "USA",
        "M. Liepe",
        "R.D. Porter",
        "Z. Sun",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The properties of niobium oxide are of critical importance for a wide range of topics",
        "from the behavior of nitrogen during infusion treatments",
        "to the nucleation of Nb3Sn",
        "to the superconducting properties of the surface. However",
        "the modeling of the oxide is often much simplified",
        "ignoring the variety of niobium oxide phases and the extremely different properties of these phases in the presence of impurities and defects. We use density functional theory (DFT) to investigate how electrochemical treatments and gas infusion procedures change the properties of niobium oxide",
        "and to investigate how these properties could be optimized for Nb3Sn nucleation and for niobium SRF performance."
      ],
      "institutions": [
        "Funding: This work was supported by the U.S. National Science Foundation under Award No. PHY-1549132, the Center for Bright Beams"
      ],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/tupfdv010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/tupfdv010.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/tupfdv010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-TUPFDV010",
      "page_number": "426",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 7,
  "scrape_time": "2025-10-11 03:03:56"
}