{
  "session_info": {
    "id": "THOAB2",
    "name": "THOAB2 - Contributed Oral Presentations (Applications of Accelerators)",
    "url": "https://proceedings.jacow.org/IPAC2013/html/thoab2.htm"
  },
  "papers": [
    {
      "paper_id": "THOAB201",
      "title": "Development of the Dielectric Wall Accelerator",
      "authors": [
        "A. Zografos",
        "T. Brown",
        "C. Cohen-Jonathan",
        "C. Hettler",
        "F. Huang",
        "V. Joshkin",
        "K. Leung",
        "M. Moyers",
        "Y.K. Parker",
        "D. Pearson",
        "M. Rougieri",
        "CPAC",
        "Livermore",
        "CA",
        "USA",
        "R&M Technical Enterprises",
        "Pleasanton",
        "California",
        "USA",
        "The Compact Particle Accelerator Corporation has developed an architecture to produce pulsed proton bunches that will be suitable for proton beam therapy. The Dielectric Wall Accelerator engineering prototype includes a RFQ injection system with a pulsed kicker to select the desired proton bunches and a linear accelerator incorporating a High Gradient Insulator with stacked transmission to produce the required voltage. The transmission lines are switched with solid state laser driven optical switches. A computational model has been developed that is in very good agreement with the experimental results. The system is presently achieving accelerating gradients of approximately 15 MeV/m. The computational model has been used to design the next generation system that will achieve 25 MeV/m by early 2013. This paper will discuss the status of the apparatus",
        "the basic elements of the computational model",
        "experimental results and comparison to the model predictions. In addition",
        "the paper will present concepts for proton therapy systems that incorporate the Dielectric Wall Accelerator and fully leverage its features to achieve clinical requirements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thoab201_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thoab201.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thoab201_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THOAB201",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THOAB202",
      "title": "Secondary Neutron Production from Patients during Hadron Therapy and their Radiation Risks: the Other Side of Hadron Therapy",
      "authors": [
        "University of Erlangen-Nuernberg",
        "Erlangen",
        "Germany",
        "We were the first to calculate and measure the neutron produced from patients during therapy with bremsstrahlung",
        "and estimated their radiation doses *. This neutron output would be lot higher with hadrons due to their larger cross sections. There is no reliable/ useful data on this subject. Using the experimental neutron production data from different body elements",
        "we have estimated the fluence and energies of these neutrons from tissue under irradiation with different hadrons. Our results indicate that at least 4.2 neutrons",
        "with energies greater than 5 MeV",
        "are produced for every C-ion of 400 MeV/u energy incident on tissue. This number reduces to 3",
        "1.4 and 0.3 respectively at C-energies of 300",
        "200 and 100 MeV /u. For protons these numbers are estimated to be 0.05",
        "0.2 and 0.4 per proton of energies 100",
        "200 and 300 MeV respectively. There would be even more neutrons with energies lesser than 5 MeV. The doses to some organs have been estimated",
        "which are not negligible. A “Compromise optimum energy” concept is suggested. But extreme caution is highly recommend before treating patients with hadrons",
        "especially children and younger people who still have many years to live.",
        "* P.Allen and M.A Chaudhri",
        "Phys. Med. Biol. 33 (1988) 1017"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thoab202_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thoab202.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thoab202_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THOAB202",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THOAB203",
      "title": "MeV/100kW Electron Linear Accelerator Driver of the NSC KIPT Neutron Source",
      "authors": [
        "A.Y. Zelinsky",
        "N. Ayzatsky",
        "O. Bezditko",
        "I.M. Karnaukhov",
        "V.A. Kushnir",
        "V. Mitrochenco",
        "NSC/KIPT",
        "Kharkov",
        "Ukraine",
        "Y.L. Chi",
        "X.W. Dai",
        "C.D. Deng",
        "M. Hou",
        "X.C. Kong",
        "R.L. Liu",
        "W.B. Liu",
        "C. Ma",
        "G. Pei",
        "S. Pei",
        "H. Song",
        "S. Wang",
        "J.B. Zhao",
        "Z.S. Zhou",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "ANL",
        "Argonne",
        "USA",
        "In NSC KIPT",
        "Kharkov",
        "Ukraine a neutron source based on a subcritical assembly driven by a 100MeV/100kW electron linear accelerator will be constructed. This neutron source is an USA (ANL)-Ukraine (KIPT) Joint project",
        "and its Accelerator will be designed and constructed by Institute of High Energy Physics (IHEP)",
        "China. The design and construction of such a Accelerator with high average beam current and low beam power losses is a technical challenging task. In the paper",
        "the main accelerator features and current status are under discussion."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/thoab203_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/thoab203.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/thoab203_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-THOAB203",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 21:39:15"
}