{
  "session_info": {
    "id": "TUXAUD",
    "name": "TUXAUD - Electron Cooling II",
    "url": "https://proceedings.jacow.org/cool2015/html/tuxaud.htm"
  },
  "papers": [
    {
      "paper_id": "TUXAUD01",
      "title": "First Operation of the Heidelberg Cryogenic Storage Ring CSR for Low-Energy Collision Measurements With Molecular Ion Beams",
      "authors": [
        "MPI-K",
        "Heidelberg",
        "Germany",
        "The cryogenic storage ring CSR** has performed its first cryogenic beamtime in the first half of 2015. All vacuum chambers and ion optics of the electrostatic ring of 35 m circumference were cooled well below 10 K. Positive and negative ion beams were stored with energies of 60 keV at storage time constants that exceeded 2000 s in some cases. In the extremely low residual gas pressures",
        "products of collisional beam loss reactions became in many cases unobservable. Laser-induced photodetachment was observed from various atomic and molecular ions including O-",
        "OH-",
        "CH+",
        "(Co2)-",
        "(Ag2)-",
        "(Co3)-. Photodetachment signals were used to monitor the ion beam lifetime. Populations of rotational levels in OH− were monitored by photodetachment near threshold with a tunable laser. Radiative cooling of the OH− ions was tracked over >5 min when more than 90% of the ions were found in the J=0 state. Schottky signals of the ions were monitored over similar time intervals",
        "indicating a slow increase of the momentum spread of the ions. Ion beam energies at CSR will reach up to 300 keV·q and a photocathode electron cooler is being installed for phase space cooling and collision experiments***.",
        "* Presented by Andreas Wolf for the CSR team  ** R. von Hahn et al.",
        "Nucl. Instrum. Methods B 269",
        "871 (2011). \r *** C. Krantz et al.",
        "J. Phys. Conf. Proc. 300",
        "122010 (2011)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/tuxaud01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/tuxaud01.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/tuxaud01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-TUXAUD01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXAUD02",
      "title": "Project of Electron Cooler for NICA",
      "authors": [
        "I.N. Meshkov",
        "E.V. Ahmanova",
        "A.G. Kobets",
        "O. Orlov",
        "V.I. Shokin",
        "A.A. Sidorin",
        "S. Yakovenko",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "M.N. Kokurkin",
        "N.Yu. Lysov",
        "Allrussian Electrotechnical Institute",
        "Moskow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The problems of development of high energy electron coolers are discussed on the basis of the existing experience. Necessities of electron cooling application to NICA collider are considered and the project parameters of the electron cooler at NICA collider are presented. Electron cooler of the NICA Collider is under design and development of its elements at JINR. It will provide the formation of an intense ion beam and maintain it in the electron energy range of 0.5'2.5 MeV. To achieve the required energy of the electrons all the elements of the Cooler are placed in the tanks filled with sulfur hexafluoride (SF6) gas under pressure of 6 atm. For testing the Cooler elements the test bench «Recuperator» is used and upgraded. The results of testing of the prototypes of the Cooler elements and the present stage of the technical design of the Cooler are described in this paper.",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/tuxaud02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/tuxaud02.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/tuxaud02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-TUXAUD02",
      "page_number": "82",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXAUD03",
      "title": "ERL Cooling Ring Concepts for the MEIC",
      "authors": [
        "S.V. Benson",
        "Y.S. Derbenev",
        "D. Douglas",
        "F.E. Hannon",
        "F. Marhauser",
        "R.A. Rimmer",
        "C. Tennant",
        "H. Wang",
        "H. Zhang",
        "Y. Zhang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The MEIC design at Jefferson Lab will collide electrons in a storage ring with ions in a separate ring. In order to enhance the luminosity",
        "the ions must be cooled in a cooling channel. The required current and charge necessary to cool the ions is on the order of 200 mA and 420 pC at an electron energy as high as 55 MeV. This is too high for a DC accelerator such as a pelletron and so the electron beam must be provided by an Energy Recovery Linac (ERL). This presentation will discuss two options for such an ERL and show some early results of modeling and simulation for these designs. At least at the highest energy",
        "the beam quality seems to be good enough to provide a reasonable cooling rate for the ions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/tuxaud03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/tuxaud03.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/tuxaud03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-TUXAUD03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXAUD04",
      "title": "Conceptual Design of the HIAF Electron Cooling System",
      "authors": [
        "L.J. Mao",
        "W.P. Chai",
        "J. Li",
        "P. Li",
        "X.M. Ma",
        "G.D. Shen",
        "L.N. Sheng",
        "M.T. Tang",
        "J.W. Xia",
        "T.L. Yan",
        "J.C. Yang",
        "X.D. Yang",
        "D.Y. Yin",
        "Y.J. Yuan",
        "H. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "A new accelerator complex HIAF is under design at IMP Lanzhou to provide intense primary and radioactive ion beams for nuclear physics",
        "atomic physics and applied researches. The key parts of HIAF are the booster ring which is used to accumulated heavy ions and the spectrometer ring which can be used as platform for nuclear and atomic physics experiments. A magnetized electron cooling device is supposed to be used in the booster ring for decreasing the transverse emittance of injected beams. Meanwhile",
        "a magnetized electron cooling device together with a ultra-low temperature electron target are also considered to be equipped in the spectrometer ring. In this paper",
        "the conceptual design and main parameters of the electron cooling devices are presented",
        "and the instabilities of cooled high intensity heavy-ion beams are discussed preliminarily."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/tuxaud04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/tuxaud04.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/tuxaud04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-TUXAUD04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:20:38"
}