{
  "session_info": {
    "id": "THPF",
    "name": "THPF - Thursday Posters",
    "url": "https://proceedings.jacow.org/IPAC2015/html/thpf.htm"
  },
  "papers": [
    {
      "paper_id": "THPF001",
      "title": "Tomography of Horizontal Phase Space Distribution of a Slow Extracted Proton Beam in the MedAustron High Energy Beam Transfer Line",
      "authors": [
        "ATI",
        "Vienna",
        "Austria",
        "CERN",
        "Geneva",
        "Switzerland",
        "EBG MedAustron",
        "Wr. Neustadt",
        "Austria",
        "MedAustron is a synchrotron based hadron therapy and research center in Wiener Neustadt",
        "Austria",
        "which currently is under commissioning for the first patient treatment. The High Energy Beam Transfer Line (HEBT) consists of mul- tiple functional modules amongst which the phase-shifter- stepper PSS* is the most important module located where the dispersion from the synchrotron is zero and upstream of the switching magnet to the first irradiation room. The PSS is used to control the beam size for the downstream modules and for this scope rotates the beam in horizontal phase space by adjusting the phase advance. This functionality is used in this study to measure beam profiles for multiple phase space angles which act as input for a tomographic reconstruction. Simulation and measurement results are presented.",
        "* M. Benedikt et al",
        "A new concept for the control of a slow-extracted beam in a line with rotational optics",
        "Nuclear Instruments and Methods in Physics Research Section A",
        "Vol 430",
        "Issues 2–3",
        "1999"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf001.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF002",
      "title": "Space Charge Effect Estimation for Synchrotrons with Third-order Resonant Extraction",
      "authors": [
        "M.T.F. Pivi",
        "A. Garonnapresenter",
        "EBG MedAustron",
        "Wr. Neustadt",
        "Austria",
        "In proton and ion storage rings using the third-order resonance extraction mechanism",
        "beam particles are slowly extracted from the ring when reaching the resonance stop-band. Typically at beam injection",
        "the horizontal tune is set to a value close to the resonance value. The tune is then moved towards the resonance value to trigger beam extraction in a controlled way. The tune shift generated by space charge forces needs to be taken into account. For this",
        "the incoherent space-charge tune shift for protons of the MedAustron accelerator main ring has been evaluated. This has been performed by multi-particle tracking using an optics model based on MADX",
        "considering a realistic Gaussian beam distribution and exact non-linear space charge electric field forces. The MedAustron accelerator is in the beam commissioning phase and is planned to start medical commissioning at the end of 2015."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf002.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF003",
      "title": "BEST 70P Cyclotron Factory Test",
      "authors": [
        "V. Sabaiduc",
        "T. Boiesan",
        "M. Carlson",
        "D. Du",
        "F.S. Grillet",
        "R.R. Johnson",
        "F.S. Labrecque",
        "B.F. Milton",
        "L. AC. Piazza",
        "R. Ruegg",
        "V. Ryjkov",
        "W. Stazyk",
        "K. Suthanthiran",
        "S. Talmor",
        "B.A. Versteeg",
        "J. Zhu",
        "BCSI",
        "Vancouver",
        "BC",
        "Canada",
        "T. Evans",
        "J. Harris",
        "N. Matte",
        "J. Panama",
        "P. Zanetti",
        "Best Theratronics Ltd.",
        "Ottawa",
        "Ontario",
        "Canada",
        "Best Cyclotron Systems Inc (BCSI) designed and manufactured a 70MeV compact cyclotron for radioisotope production and research applications. The cyclotron undergone exhaustive factory testing that has been successfully completed at Best Theratronics facility in Ottawa",
        "Canada. The first 70MeV cyclotron has been build for the INFN-LNL laboratory in Legnaro",
        "Italy. The cyclotron has external negative hydrogen ion source",
        "four radial sectors with two dees in opposite valleys",
        "cryogenic vacuum system and simultaneous beam extraction on opposite lines. The beam intensity is 700μA with variable extraction energy between 35 and 70MeV. We are reporting the factory acceptance testing results confirming the individual cyclotron systems performance and beam acceleration to 1MeV probe. Detail measurements of each system stability and performance have been taken as well as full characterisation of beam acceleration through the injection line and on to the 1MeV probe. The"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf003.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF005",
      "title": "The SARAF-LINAC Project for SARAF-Phase 2",
      "authors": [
        "CEA/DSM/IRFU",
        "France",
        "D. Berkovits",
        "J. Luner",
        "J. Rodnizki",
        "Soreq NRC",
        "Yavne",
        "Israel",
        "P. Bertrand",
        "M. Di Giacomo",
        "R. Ferdinand",
        "GANIL",
        "Caen",
        "France",
        "P. Brédy",
        "G. Ferrand",
        "P. Girardot",
        "F. Gougnaud",
        "M. Jacquemet",
        "A. Mosnier",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "SNRC and CEA collaborate to the upgrade of the SARAF Accelerator to 5 mA CW 40 MeV deuteron and proton beams (Phase 2). This paper presents the reference design of the SARAF-LINAC Project including a four-vane 176 MHz RFQ",
        "a MEBT and a superconducting linac made of four five-meter cryomodules housing 26 superconducting HWR cavities and 20 superconducting solenoids. The first two identical cryomodules house low-beta (βopt = 0.091)",
        "280 mm long (flange to flange)",
        "176 MHz HWR cavities",
        "the two identical last cryomodules house high-beta (βopt = 0.181)",
        "410 mm long",
        "176 MHz",
        "HWR cavities. The beam is focused with superconducting solenoids located between cavities housing steering coils. A BPM is placed upstream each solenoid."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf005.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF006",
      "title": "Design and Manufacturing Status of the IFMIF-LIPAC SRF LINAC",
      "authors": [
        "CEA",
        "Pontfaverger-Moronvilliers",
        "France",
        "N. Bazin",
        "A. Bruniquel",
        "P. Charon",
        "P. Gastinel",
        "P. Hardy",
        "H. Jenhani",
        "J. Neyret",
        "O. Piquet",
        "J. Relland",
        "N. Sellami",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "S. Chel",
        "G. Devanz",
        "G. Disset",
        "V.M. Hennion",
        "B. Renard",
        "CEA/DSM/IRFU",
        "France",
        "D. Gex",
        "G. Phillips",
        "F4E",
        "Germany",
        "D. Regidor",
        "F. Toral",
        "CIEMAT",
        "Madrid",
        "Spain",
        "The IFMIF accelerator aims to provide an accelerator-based D-Li neutron source to produce high intensity high energy neutron flux for testing of candidate materials for use in fusion energy reactors. The first phase of the project",
        "called EVEDA (Engineering Validation and Engineering Design Activities) aims at validating the technical options by constructing an accelerator prototype",
        "called LIPAc (Linear IFMIF Prototype Accelerator) whose construction has begun. It is a full scale of one of the IFMIF accelerator from the injector to the first cryomodule. The cryomodule contains all the necessary equipment to transport and accelerate a 125 mA deuteron beam from an input energy of 5 MeV up to output energy of 9 MeV. It consists of a horizontal vacuum tank approximately 6 m long",
        "3 m high and 2.0 m wide",
        "and includes 8 superconducting HWRs working at 175 MHz and at 4.45 K for beam acceleration. 8 Power Couplers provide RF power to the cavities up to 70 kW CW in the LIPAc case and 200 kW CW in the IFMIF case",
        "with 8 Solenoid Packages acting as focusing elements. This paper gives an overview of the progress",
        "achievements and status of the IFMIF SRF LINAC."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf006.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF007",
      "title": "Optimization of Multi-turn Injection into a Heavy-Ion Synchrotron using Genetic Algorithms",
      "authors": [
        "S. Appel",
        "O. Boine-Frankenheim",
        "GSI",
        "Darmstadt",
        "Germany",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "For heavy-ion synchrotrons an efficient multi-turn injection (MTI) from the injector linac is crucial in order to reach the specified currents using the available machine acceptance. The beam loss during the MTI must not exceed the limits determined by machine protection and vacuum requirements. Especially for low energy and intermediate charge state ions",
        "the beam loss can cause a degradation of the vacuum and a corresponding reduction of the beam lifetime. In order to optimize the MTI a genetic algorithm based optimization is used to simultaneously minimize the loss and maximize the multiplication factor (e.g. stored currents in the synchrotron). The effect of transverse space charge force on the MTI has also been taken into account. The optimization resulted in injection parameters",
        "which promise a significant improvement of the MTI performance for intense beams in the SIS18 synchrotron at GSI."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf007.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF008",
      "title": "U28+ Intensity Record Applying a H2-Gas Stripper Cell",
      "authors": [
        "W.A. Barth",
        "A. Adonin",
        "Ch.E. Düllmann",
        "M. Heilmannpresenter",
        "R. Hollinger",
        "E. Jäger",
        "J. Khuyagbaatar",
        "J. Krier",
        "H. Vormann",
        "A. Yakushev",
        "GSI",
        "Darmstadt",
        "Germany",
        "HIM",
        "Mainz",
        "Germany",
        "Meeting the FAIR science requirements higher beam intensity has to be achieved in the present GSI-accelerator complex. An advanced upgrade program for the UNILAC aimed to meet the FAIR requirements. Stripping is a key technology for all heavy ion accelerators. For this an extensive research and development program was carried out to optimize for high brilliance heavy ion operation. After upgrade of the supersonic N2-gas jet",
        "implementation of high current foil stripping and preliminary investigation of H2 gas jet operation",
        "recently a newly developed H2 gas cell uses a pulsed gas regime synchronized with arrival of the beam pulse. An obviously enhanced stripper gas density as well as a simultaneously reduced gas load for the pumping system result in an increased stripping efficiency",
        "while the beam emittance remains the same. A new record intensity (7.8 emA) for U28+ beams at 1.4 MeV/u has been achieved applying the pulsed high density H2 stripper target",
        "while the MeVVa ion source with a newly developed extraction system delivered a high intensity U4+ beam. The experimental results will be presented in detail."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf008.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF009",
      "title": "Pumping Properties of Cryogenic Surfaces in SIS100",
      "authors": [
        "L.H.J. Bozyk",
        "O.K. Kester",
        "P.J. Spiller",
        "GSI",
        "Darmstadt",
        "Germany",
        "F. Chill",
        "O.K. Kester",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "The synchrotron SIS100 of the planned FAIR facility will provide heavy ion beams of highest intensities. The required low charge states are subject to enhanced charge exchange processes in collisions with residual gas molecules. Therefore",
        "highest vacuum quality is crucial for a reliable operation and minimal beam loss. The generation of the required low gas densities relies on the pumping capabilities of the cryogenic beam pipe walls. Most typical gas components in ultra high vacuum are bound by cryocondensation at LHe temperatures",
        "resulting in ultimate low pressures with almost infinite pumping capacity. Hydrogen can not be crycondensated to acceptable low pressures. But if the surface coverage is sufficiently low",
        "it can get bound by cryoadsorption. The pumping capabilities of cryogenic walls for Hydrogen have been investigated for SIS100-like conditions. The measurement results have been used in dynamic vacuum simulations at heavy ion operation. The simulation results are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf009.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF010",
      "title": "Simulation and Experimental Investigation of Heavy Ion Induced Desorption from Cryogenic Targets",
      "authors": [
        "Ch. Maurer",
        "D.H.H. Hoffmann",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "L.H.J. Bozykpresenter",
        "H. Kollmus",
        "Ch. Maurer",
        "P.J. Spiller",
        "GSI",
        "Darmstadt",
        "Germany",
        "Heavy-ion impact induced gas desorption is the key process that drives beam intensity limiting dynamic vacuum losses. Minimizing this effect",
        "by providing low desorption yield surfaces",
        "is an important issue for maintaining a stable ultra high vacuum during operation with medium charge state heavy ions. For room temperature targets",
        "investigation shows a scaling of the desorption yield with the beam's near-surface electronic energy loss",
        "i.e. a decrease with increasing energy*",
        "**. An optimized material for a room temperature ion-catcher has been found. But for the planned superconducting heavy-ion synchrotron SIS100 at the FAIR accelerator complex",
        "the ion catcher system has to work in a cryogenic environment. Desorption measurements with the prototype cryocatcher for SIS100 showed an unexpected energy scaling***",
        "which needs to be explained. Understanding this scaling might lead to a better suited choice of material",
        "resulting in a lower desorption yield. Here",
        "new experimental results will be presented along with insights gained from gas dynamics simulations.",
        "* H. Kollmus et al.",
        "AIP Conf. Proc. 773",
        "207 (2005))  ** E. Mahner et al.",
        "Phys. Rev. ST Accel. Beams 14",
        "050102 (2011) *** L.H.J. Bozyk",
        "H. Kollmus",
        "P.J. Spiller",
        "Proc. of IPAC 2012",
        "p. 3239"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf010.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF011",
      "title": "Status of the FAIR Proton Linac",
      "authors": [
        "R. M. Brodhage",
        "M. Kaiser",
        "W. Vinzenz",
        "M. Vossberg",
        "GSI",
        "Darmstadt",
        "Germany",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "For the research program with cooled antiprotons at FAIR a dedicated 70 MeV",
        "70 mA proton injector is required. The main acceleration of this room temperature linac will be provided by six CH cavities operated at 325 MHz. Within the last years",
        "the assembly and tuning of the first power prototype was finished. The cavity was tested with a preliminary aluminum drift tube structure",
        "which was used for precise frequency and field tuning. Afterwards",
        "the final drift tube structure has been welded inside the main tanks and the galvanic copper plating has taken place at GSI workshops. This paper will report on the recent advances with the prototype as well as on the current status of the overall p-Linac project."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf011.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF012",
      "title": "Status of the High Energy Beam Transport System for FAIR",
      "authors": [
        "F. Hagenbuck",
        "L.H.J. Bozyk",
        "S. Damjanovic",
        "A. Krämer",
        "B. Merk",
        "C. Mühle",
        "S. Ratschow",
        "B.R. Schlei",
        "P.J. Spiller",
        "B. Walasek-Höhne",
        "H. Welker",
        "C. Will",
        "GSI",
        "Darmstadt",
        "Germany",
        "The overall layout of the High Energy Beam Transport (HEBT) System of the Facility for Antiproton and Ion Research (FAIR)* did not change since its last presentation in 2008**. All necessitated adaptions as for example due to the introduction of the Modularized Start Version (MSV",
        "module 0-3) of FAIR*** could be smoothly implemented. In the meanwhile the HEBT system is in its realisation phase with the procurement of its main components in progress. In the following adaptions of the system layout not yet covered in ** are summarized and an overview of the technical system design and procurement status are presented.",
        "* FAIR Baseline Technical Report (FBTR)",
        "GSI 2006  ** S. Ratschow et al.",
        "Proc. of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf012.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF013",
      "title": "UNILAC Proton Injector Operation for FAIR",
      "authors": [
        "M. Heilmann",
        "A. Adonin",
        "S. Appel",
        "W.A. Barth",
        "P. Gerhard",
        "F. Heymach",
        "R. Hollinger",
        "W. Vinzenz",
        "H. Vormann",
        "S. Yaramyshev",
        "GSI",
        "Darmstadt",
        "Germany",
        "HIM",
        "Mainz",
        "Germany"
      ],
      "institutions": [
        "The pbar physics program at the Facility for Antiproton and Ion Research (FAIR) requires a high number of cooled pbars per hour. The FAIR proton injector with coupled CH-cavities will provide for a high intensity (35 mA) pulsed 70 MeV proton beam at a repetition rate of 4 Hz. The recent heavy ion UNIversal Linear Accelerator (UNILAC) at GSI is able to deliver proton as well as heavy ion beams for injection into the FAIR-synchrotrons. Recently GSI UNILAC could provide for a two orders of magnitude higher proton beam current in routine operation. A hydrocarbon beam (CH3) from the MUCIS ion source was accelerated inside High Current Injector and cracked in a supersonic nitrogen gas jet into stripped protons and carbon ions. A new proton beam intensities record (3 mA) could be achieved during machine experiments in October 2014. Potentially up to 25% of the FAIR proton beam performance is achievable at a maximum UNILAC beam energy of 20 MeV and a repetition rate of 4 Hz. The UNILAC can be used as a high performance proton injector for initial FAIR-commissioning and as a redundant option for the first FAIR-experiments."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF014",
      "title": "MHz High Power RF Coupler for the CH-Cavities of the FAIR p-LINAC",
      "authors": [
        "F. Maimone",
        "R. M. Brodhagepresenter",
        "M. Kaiser",
        "W. Vinzenz",
        "M. Vossberg",
        "GSI",
        "Darmstadt",
        "Germany",
        "In order to supply the input RF power to the Cross-bar H-mode (CH) cavities of the p-LINAC for FAIR an inductive RF coupler has been studied. The designed RF coupler",
        "and its water cooled inductive loop",
        "has to withstand up to a 3 MW pulsed power (at 325 MHz). At GSI a prototype has been manufactured and tests were performed. The prototype of the designed high power RF coupler is presented together with the results of the coupling measurements at the CH-prototype cavity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf014.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF015",
      "title": "Status of the FAIR Heavy Ion Synchrotron Project SIS100",
      "authors": [
        "P.J. Spiller",
        "U. Blell",
        "L.H.J. Bozyk",
        "J. Ceballos Velasco",
        "T. Eisel",
        "E.S. Fischer",
        "O.K. Kester",
        "H.G. König",
        "H. Kollmus",
        "V. Kornilov",
        "P. Kowina",
        "J.P. Meier",
        "A. Mierau",
        "C. Mühle",
        "C. Omet",
        "D. Ondreka",
        "N. Pyka",
        "H.R. Ramakers",
        "P. Rottländer",
        "C. Roux",
        "P. Schnizer",
        "St. Wilfert",
        "GSI",
        "Darmstadt",
        "Germany",
        "The procurements of major technical components for the heavy ion synchrotron SIS100 are progressing. Especially the production of the long lead items",
        "the main superconducting dipole and quadrupole magnets and the main Rf systems could be started. The system layout for the injection system and the specifications for all injection devices has been completed. In parallel",
        "the Digital Mock-Up (DMU) and design for major extraction components has been developed. Certain technical challenges observed during the acceptance tests of First of Series (FOS) components and risks and their mitigation will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf015.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF017",
      "title": "Design Studies for the Proton-Linac RFQ for FAIR",
      "authors": [
        "M. Vossberg",
        "R. M. Brodhage",
        "M. Kaiser",
        "F. Maimone",
        "W. Vinzenz",
        "S. Yaramyshev",
        "GSI",
        "Darmstadt",
        "Germany",
        "The planned 27 m long Proton-Linac (P-LINAC) for FAIR (Facility for Antiproton and Ion Research) comprises a RFQ (Radio-Frequency Quadrupole) and 6 CH-cavities to accelerate a 70 mA proton beam up to 70 MeV. The FAIR Proton-Linac starts with a 325.2 MHz",
        "from 95keV to 3 MeV RFQ accelerator. The main RFQ for this Proton-Linac will be a 4-Vane RFQ. RF analytics with varying and constant transverse focusing strengt for the electrode parameters will be used. CST simulations will help to find cavity parameters for the working frequency. This paper presents the main cavity designs concepts and CST simulation results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf017.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF018",
      "title": "Simulation Studies of Plasma-based Charge Strippers",
      "authors": [
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "Calculations on the charge state distributions in different charge stripping media are presented. The main focus of this work is the width and peak efficiency of the final charge state distribution. For equal number densities fully-stripped plasma stripping media achieve much higher charge states than gas stripping media of the same nuclear charge. This is due to the reduced electron capture rates of free target electrons compared to bound target electrons. Furthermore",
        "targets with low nuclear charge like hydrogen achieve higher charge states than targets with high nuclear charge like nitrogen in the case of both a plasma and a gas target. Equal final mean charge states can thus be achieved with lower density for plasmas and targets with low nuclear charge. The widths of the charge state distributions are very similar",
        "slightly smaller for plasmas due to the different scaling of the dielectronic recombination rate. In comparison with calculations and measurements published in literature this work underestimates the width of targets with higher nuclear charge like",
        "e.g.",
        "nitrogen gas. This is mainly due to the omission of multiple loss processes in the presented calculations. In the future we intend to expand the methods and models used in this work to improve the agreement with different measurements on charge state distributions in plasmas and gases."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf018.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF019",
      "title": "Status and First Measurement Results for a High Gradient CH-Cavity",
      "authors": [
        "A. Almomani",
        "U. Ratzinger",
        "IAP",
        "Frankfurt am Main",
        "Germany"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf019.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF020",
      "title": "Upgrade of the HSI-RFQ at GSI to Fulfill the FAIR Requirements",
      "authors": [
        "M. Baschke",
        "H. Podlech",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "GSI",
        "Darmstadt",
        "Germany",
        "In Darmstadt/Germany the existing accelerator facility GSI is expanding to one of the biggest joint research projects worldwide: FAIR",
        "a new antiproton and ion research facility with so far unmatched intensities and quality. The existing accelerators will be used as pre-accelerators and therefor need to be upgraded. In a first step the 36 MHz-HSI-RFQ for high current beams will get new electrodes to fulfill the FAIR requirements. First simulation results for capacity and multipole momentums will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf020.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF021",
      "title": "Structural, Mechanical and RF Measurements on the Superconducting 217 MHz CH Cavity for the CW Demonstrator at GSI",
      "authors": [
        "F.D. Dziuba",
        "M. Amberg",
        "M. Basten",
        "M. Busch",
        "H. Podlech",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "M. Amberg",
        "K. Aulenbacher",
        "W.A. Barth",
        "S. Mickat",
        "HIM",
        "Mainz",
        "Germany",
        "IKP",
        "Mainz",
        "Germany",
        "W.A. Barth",
        "S. Mickat",
        "GSI",
        "Darmstadt",
        "Germany",
        "Together with the new horizontal cryomodule and two superconducting (sc) 9.5 T solenoids the sc 217 MHz Crossbar-H-mode (CH) cavity represents the continuous wave (cw) demonstrator and brings sc rf technology to GSI. A reliable operability of the sc CH cavity is one major goal of the demonstrator project. Furthermore",
        "the successful beam operation of the demonstrator will be a milestone on the way to a new sc cw linac at GSI for a competitive production of Super Heavy Elements (SHE) in the future. The production of the cryomodule and the solenoids is almost finished while the cavity has been completed except for the helium vessel. In this paper structural mechanical as well as related rf measurements on the sc 217 MHz CH cavity are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf021.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF022",
      "title": "Design of the 325 MHz 4-Rod RFQ for the FAIR Proton Linac",
      "authors": [
        "B. Koubek",
        "H. Podlechpresenter",
        "A. Schempp",
        "IAP",
        "Frankfurt am Main",
        "Germany"
      ],
      "institutions": [],
      "abstract": "Investigations on the 325 MHz 4-rod RFQ prototype for the FAIR proton linac have confirmed the feasibility of a 4-rod RFQ to work at frequencies above 300 MHz. This RFQ will accelerate protons from 95 keV to 3 MeV within a length of 3.3 m and will be powered by a 2.5 MW klystron. The mechanical and rf design of this RFQ are presented in this paper. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf022.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF023",
      "title": "Massless Beam Separation System for Intense Ion Beams",
      "authors": [
        "O. Payir",
        "M. Droba",
        "O. Meusel",
        "D. Noll",
        "U. Ratzinger",
        "P.P. Schneider",
        "C. Wiesner",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "The ExB chopper* in the Low Energy Beam Transport (LEBT) section of the accelerator-driven neutron source FRANZ** will form the required pulses with a repetition rate of 257 kHz out of the primary 120 keV",
        "50 mA DC proton beam. A following beam separation system will extract the deflected beam out of the beamline and minimize the thermal load by beam losses in the vacuum chamber. To further avoid an uncontrolled production of secondary particles",
        "a novel massless septum system is designed for the beam separation. The septum system consists of a static C-magnet with optimized pole shapes",
        "which will extract the beam with minimal losses",
        "and a magnetic shielding tube",
        "which will shield the transmitted pulsed beam from the fringing field of the dipole. The magnetic field and the beam transport properties of the system were numerically investigated. A main deflection field of about 250 mT was achieved",
        "whereas the fringing field was reduced to below 0.3 mT on the beam axis at 60 mm distance from the dipole. With this settings",
        "the beam was numerically transported through the system with minimal emittance growth. Manufacturing of the septum system has started.",
        "* Wiesner",
        "C.",
        "et al. \"Chopping High-Intensity Ion Beams at FRANZ\""
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF024",
      "title": "LEBT Dynamics and RFQ Injection",
      "authors": [
        "P.P. Schneider",
        "M. Droba",
        "O. Meusel",
        "H. Niebuhr",
        "D. Noll",
        "O. Payir",
        "H. Podlech",
        "A. Schempp",
        "C. Wiesner",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "The Low Energy Beam Transport (LEBT) section at the accelerator-driven neutron source FRANZ* consists of four solenoids",
        "two of which match the primary proton beam into the chopper. The remaining two solenoids are intended to prepare the beam for injection into the RFQ. In the first commissioning phase",
        "the LEBT successfully transported a 14 keV He beam at low intensities**. In the current commissioning phase",
        "the beam energy is increased to the RFQ injection energy of 120 keV. In the upcoming step",
        "the intensity will be increased from 2 mA to 50 mA. Beam dynamics calculations include effects of different source emittances",
        "position and angle offsets and the effects of space charge compensation levels. In addition",
        "the behavior of the undesired hydrogen fractions",
        "H2+ and H3+",
        "and their influence on the performance within the RFQ is simulated.",
        "* Meusel",
        "O.",
        "et al. \"FRANZ–Accelerator Test Bench And Neutron Source\"",
        "MO3A03",
        "LINAC 2012. ** Wiesner",
        "C.",
        "et al. \"Chopping High-Intensity Ion Beams at FRANZ\""
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf024.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF025",
      "title": "Beam Dynamics for the SC CW Heavy Ion LINAC at GSI",
      "authors": [
        "M. Schwarz",
        "M. Amberg",
        "M. Basten",
        "F.D. Dziuba",
        "H. Podlech",
        "U. Ratzinger",
        "R. Tiede",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "M. Amberg",
        "K. Aulenbacher",
        "M. Miski-Oglu",
        "HIM",
        "Mainz",
        "Germany",
        "W.A. Barth",
        "V. Gettmann",
        "M. Heilmann",
        "S. Mickat",
        "A. Orzhekhovskaya",
        "S. Yaramyshev",
        "GSI",
        "Darmstadt",
        "Germany",
        "For future experiments with heavy ions near the coulomb barrier within the SHE (super-heavy elements) research project a multi-stage R&D program of GSI",
        "HIM and IAP is currently in progress*. It aims at developing a superconducting (sc) continuous wave (cw) LINAC with multiple CH cavities as key components downstream the High Charge Injector (HLI) at GSI. The beam dynamics concept is based on EQUUS (equidistant multigap structure) constant-beta cavities. Advantages of its periodicity are a high simulation accuracy",
        "easy manufacturing and tuning with minimized costs as well as a straightforward energy variation. The next milestone will be a full performance beam test of the first LINAC section",
        "comprising two solenoids and a 15-gap CH cavity inside a cryostat (Demonstrator).",
        "*W. Barth et al.",
        "‘‘Further R&D for a new Superconducting cw Heavy Ion LINAC@GSI''"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf025.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF026",
      "title": "Development of a 325 MHz Ladder-RFQ of the 4-Rod Type",
      "authors": [
        "M. Schütt",
        "U. Ratzinger",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "GSI",
        "Darmstadt",
        "Germany",
        "For the research program with cooled antiprotons at FAIR a dedicated 70 MeV",
        "70 mA proton injector is required. In the low energy section",
        "between the Ion Source and the main linac an RFQ will be used. The 325 MHz RFQ will accelerate protons from 95 keV to 3.0 MeV. This particular high frequency for an RFQ creates difficulties",
        "which are challenging in developing this cavity. In order to define a satisfactory geometrical configuration for this resonator",
        "both from the RF and the mechanical point of view",
        "different designs have been examined and compared. Very promising results have been reached with a ladder type RFQ",
        "which has been investigated since 2013. We present recent 3D simulations of the general layout and of a complete cavity demonstrating the power of a ladder type RFQ as well as measurements of a 0",
        "8 m prototype RFQ",
        "which was manufactured in late 2014 and designed for RF power and vacuum tests. We will outline a possible RF layout for the RFQ within the new FAIR proton injector and highlight the mechanical advantages."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf026.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF027",
      "title": "Ten Gap Model of a New Alvarez DTL Cavity at GSI",
      "authors": [
        "A. Seibel",
        "O.K. Kester",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "X. Du",
        "L. Groening",
        "S. Mickat",
        "GSI",
        "Darmstadt",
        "Germany",
        "In order to meet the challenges of the FAIR project at GSI requiring highest beam intensities an upgrade of the existing Universal Linear Accelerator (UNILAC) is planned. The 108 MHz cavities will be replaced by new rf-structures of the same frequency. Simulations are done to improve the rf-properties. The geometry of the drift tubes is to be changed to a smoother curvature to reach a homogeneous surface field distribution and higher shunt impedances. To check the necessity of cooling channels",
        "simulations on the temperature distribution at the drift tubes and stems are conducted. A test bench for low power rf-measurements with a 10 gap aluminum model (scale 1:3) is under construction. The modular mechanical design of the model will allow probing experimentally a wide range of drift tube and stem geometries. With the bead pull method the electrical field distribution will be measured as well as the field stability with respect to parasitic modes. Additionally",
        "appropriate locations along the cavity to place fixed and dynamic rf-frequency tuners will be determined."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf027.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF028",
      "title": "Conceptual Design of a Novel RFQ for Medical Accelerators",
      "authors": [
        "R. Cee",
        "E. Feldmeier",
        "Th. Haberer",
        "A. Peters",
        "T.W. Winkelmann",
        "HIT",
        "Heidelberg",
        "Germany",
        "At the Heidelberg Ion Beam Therapy Centre HIT we operate a 4-rod RFQ as first stage of a 7 MeV/u injector linac followed by an IH-DTL. During the first years of patient treatment the injector performance was perfectly adequate",
        "even though the transmission of the linac remained below the theoretical expectations. New developments in dose delivery technology already realised or to come in the future increase the demand on higher beam intensities which will finally result in shorter irradiation times. As measurements performed at our test bench have confirmed that there is a margin for higher transmissions especially for the RFQ we are currently preparing for a new RFQ design. While keeping the original design parameters",
        "the new RFQ should be optimised with respect to the transmission of beams from different ion sources such as electron cyclotron resonance or electron beam ion sources. All parts of the RFQ will be put up for discussion including electrodes",
        "stems",
        "tank and the integrated rebuncher. The design work will profit from new concepts that have evolved at our own and other medical heavy ion facilities in operation and from the progress modern simulation tools have run through."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf028.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF029",
      "title": "Preparation of an Ion Source for an Extra Low Energy Synchrotron",
      "authors": [
        "R. Gebel",
        "O. Felden",
        "R. Maier",
        "S. Mey",
        "D. Prasuhn",
        "FZJ",
        "Jülich",
        "Germany",
        "ELENA* is a compact ring for cooling and further deceleration of 5.3 MeV antiprotons delivered by the CERN Antiproton Decelerator (AD) down to 100 keV. Because of the long AD cycle of 100 s",
        "it is foreseen to use a source for protons and H− with a kinetic energy of 100 keV for commissioning and start-ups. The source",
        "designed to provide 0.2 to 2.0μsec pulses with 3x107 ions",
        "is based on a proven multicusp volume source used at the COSY/Jülich** injector cyclotron. The source and its auxiliaries were refurbished",
        "upgraded to ±100 keV operation at the Forschungszentrum Jülich and have been set in operation at CERN in April 2015 for first tests of new equipments."
      ],
      "institutions": [
        "* V. Chohan [ed.], ELENA ring and its Transfer Lines – Design Report  Geneva 2014, DOI 10.5170/CERN-2014-002  ** R. Maier Nucl. Instr. Meth. A 390 (1997) P.1."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf029.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF030",
      "title": "Antiproton Acceleration and Deceleration in the HESR",
      "authors": [
        "B. Lorentz",
        "T. Katayama",
        "A. Lehrach",
        "R. Maier",
        "D. Prasuhn",
        "R. Stassen",
        "H. Stockhorst",
        "R. Tölle",
        "FZJ",
        "Jülich",
        "Germany",
        "The High Energy Storage Ring (HESR) is a part of the future Facility for Antiproton and Ion Research (FAIR) in Darmstadt. The ring is used for hadron physics experiments with a pellet target and the PANDA detector",
        "and will supply antiprotons of momenta from 1.5 GeV/c to 15 GeV/c. To cover the whole energy range a flexible adjustment of transition energy and the corresponding gamma-t value is foreseen. For Injection and Accumulation of Antiprotons delivered from the CR at a momentum of 3.8 GeV/c (gamma=4.2)",
        "the HESR optics will be tuned to gamma-t=6.2. For deceleration down to a momentum of 1.5 GeV/c this optic is suitable as well. Stochastic cooling at an intermediate energy is required to avoid beam losses caused by adiabatic growth of the beam during deceleration. For acceleration to 8 GeV/c (gamma=8.6) the optics will be changed after accumulation of the antiproton beam to gamma-t=14.6. For momenta higher than 8 GeV/c the beam will be debunched at 8 GeV/c",
        "optics will be changed to gamma-t=6.2",
        "and after adiabatic rebunching the beam will be accelerated to 15 GeV/c (gamma=16). Simulations show the feasibility of the described procedures with practically no beam losses."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf030.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF031",
      "title": "Towards an RF Wien-Filter for EDM Experiments at COSY",
      "authors": [
        "S. Mey",
        "R. Gebel",
        "FZJ",
        "Jülich",
        "Germany",
        "The JEDI Collaboration (Jülich Electric Dipole Moment (EDM) Investigations) is developing tools for the measurement of permanent EDMs of charged",
        "light hadrons in storage rings. The Standard Model predicts unobservably small values for the EDM",
        "but a non-vanishing EDM can be detected by measuring a tiny build-up of vertical polarization in a beforehand horizontally polarized beam. This technique requires a spin tune modulation by an RF Dipole without any excitation of beam oscillations. In the course of 2014",
        "a prototype RF ExB-Dipole has been successfully commissioned and tested. To determine the characteristics of the device",
        "the force of a radial magnetic field is canceled out by a vertical electric one. In this configuration",
        "the dipole fields form a Wien-Filter that directly rotates the particles' polarization vector. We verified that the device can be used to continuously flip the vertical polarization of a 970 MeV(c deuteron beam without exciting any coherent beam oscillations. For a first EDM Experiment",
        "the RF ExB-Dipole in Wien-Filter Mode is going to be rotated by 90° around the beam axis and will be used for systematic investigations of sources for false EDM signals."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf031.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF032",
      "title": "Spin Tracking Simulations Towards Electric Dipole Moment Measurements at COSY",
      "authors": [
        "M. Rosenthal",
        "A. Lehrach",
        "FZJ",
        "Jülich",
        "Germany",
        "A. Lehrach",
        "M. Rosenthal",
        "RWTH",
        "Aachen",
        "Germany",
        "A strong hint for physics beyond the Standard Model would be achieved by direct measurements of charged particles' Electric Dipole Moments (EDMs). Measurements in magnetic storage rings using a resonant spin interaction of a radiofrequency Wien filter are proposed and needs to be scrutinized. Therefore",
        "the calculation of phase space transfer maps for time-varying fields has been implemented into an extensions for the software framework COSY INFINITY. Benchmarking with measured data and analytical estimates for rf solenoid induced spin resonances are in good agreement. The dependence of polarization oscillation damping on the solenoid frequency could be confirmed. First studies of the rf Wien filter method reveal systematic limitations: Uncorrected Gaussian distributed misalignments of the COSY lattice quadrupoles with a standard deviation of 0.1 mm generate a similar buildup as an EDM of 5·10-19 e cm using this method."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf032.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF033",
      "title": "The First Operation of 56 MHz SRF Cavity in RHIC",
      "authors": [
        "Q. Wu",
        "S.A. Belomestnykh",
        "I. Ben-Zvi",
        "M. Blaskiewicz",
        "L. DeSanto",
        "D. Goldberg",
        "M. Harvey",
        "T. Hayes",
        "G.T. McIntyre",
        "K. Mernick",
        "P. Orfin",
        "S.K. Seberg",
        "F. Severino",
        "K.S. Smith",
        "R. Than",
        "A. Zaltsman",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A 56 MHz superconducting RF cavity has been designed",
        "fabricated and installed in the Relativistic Heavy Ion Collider (RHIC). The cavity operated at 4.4 K with a “quiet helium source” to isolate the cavity from environmental acoustic noise. The cavity is a beam driven quarter wave resonator. It is detuned and damped during injection and acceleration cycles and is brought to operation only at store energy. For a first test operation",
        "the cavity voltage was stabilized at 300 kV with full beam current. Within both Au + Au and asymmetrical Au + He3 collisions",
        "luminosity improvement was detected from direct measurement",
        "and the hourglass effect was reduced. One higher order mode (HOM) coupler was installed on the cavity. We report in this paper on our measurement of a broadband HOM spectrum excited by the Au beam."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf033.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF034",
      "title": "Injection Kicker for HESR at FAIR using Semi-Conductor Switches",
      "authors": [
        "R. Tölle",
        "N. Bongers",
        "F.M. Esser",
        "R. Gebel",
        "S. Hamzic",
        "H. Jagdfeld",
        "F. Klehr",
        "B. Laatsch",
        "L. Reifferscheidt",
        "M. Retzlaff",
        "L. Semke",
        "H. Soltner",
        "H. Stockhorst",
        "FZJ",
        "Jülich",
        "Germany",
        "S. Antoine",
        "W. Beeckman",
        "P. Bocher",
        "O. Cosson",
        "P. Jivkov",
        "D. Ramauge",
        "Sigmaphi",
        "Vannes",
        "France",
        "The High Energy Storage Ring for Antiprotons is going to be built at FAIR in Darmstadt on the extended GSI campus. It will receive the antiprotons via the Collector Ring (CR). Using a barrier bucket",
        "the circulating particles will be compressed into one half of the circumference. New particles have to be injected into the remaining half. Thus rise and fall time must not exceed 220 ns each with a flat top of 500 ns. A kick angle of 6.4 mrad is required at 13 Tm magnetic rigidity. The system must allow pole reversal for injection of positively charged particles. With a voltage lower than 40 kV a semi-conductor based pulser is going to be realized. Boundary conditions and the status of preparatory work are described. Simulation results and available measurements are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf034.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF035",
      "title": "Stripping of High Intensity Heavy-Ion Beams in a Pulsed Gas Stripper Device at 1.4 MeV/u",
      "authors": [
        "P. Scharrer",
        "W.A. Barth",
        "Ch.E. Düllmann",
        "J. Khuyagbaatar",
        "HIM",
        "Mainz",
        "Germany",
        "W.A. Barth",
        "M. Bevcic",
        "Ch.E. Düllmann",
        "L. Groening",
        "K.P. Horn",
        "E. Jäger",
        "J. Khuyagbaatar",
        "J. Krier",
        "A. Yakushev",
        "GSI",
        "Darmstadt",
        "Germany",
        "Mainz University",
        "Mainz",
        "Germany",
        "As part of an injector system for FAIR",
        "the GSI UNILAC has to meet high demands in terms of beam brilliance at a low duty factor. To accomplish this goal an extensive upgrade program has started. To increase the beam intensity behind the UNILAC",
        "it is aimed to increase the efficiency of the 1.4 MeV/u gas stripper. A modification of the stripper setup was developed to replace the N2-jet with a pulsed gas injection",
        "synchronized with the transit of the beam pulse. The pulsed gas injection lowers the gas load for the differential pumping system",
        "rendering possible the use of other promising gas targets. In recent measurements the performance of the modified setup was tested using an 238U-beam with various stripper media",
        "including H2",
        "He",
        "and N2. The data provide a systematic basis for an improved understanding of slow heavy ions passing through gaseous media. The stripping performance of the current N2-jet was excelled by using H2 at increased gas densities",
        "enabled by the new pulsed gas cell."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf035.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF036",
      "title": "Compact Cyclotron for 35 MeV Protons and 8 AMeV of H2+",
      "authors": [
        "A. Calanna",
        "L. Calabretta",
        "INFN/LNS",
        "Catania",
        "Italy",
        "T. Boiesan",
        "R.R. Johnson",
        "L. AC. Piazza",
        "V. Sabaiduc",
        "BCSI",
        "Vancouver",
        "BC",
        "Canada",
        "The design characteristics and parameters of a compact cyclotron able to accelerate H− ions up to an energy of 35 MeV and H2+ ions up to an energy of 8 AMeV are presented. This cyclotron is a 4 sector machine and its special feature is the possibility to modify the profiles of the sector hills to allow for the acceleration of the two different species. When equipped with two RF cavities and operated in harmonic mode 4",
        "it accelerates the H− beam",
        "which is extracted by stripping. The resulting proton beam is used for the commercial goal of radioisotope production. On the other hand",
        "when equipped with four RF cavities",
        "also operated in harmonic mode 4",
        "it accelerates a high intensity H2+ beam that is of interest for the IsoDAR* experiment. Here",
        "the presented cyclotron takes on the role of a prototype for the central region design of the final IsoDAR* cyclotron (60 A MeV H2+). By increasing the number of cavities",
        "the energy gain per turn as well as the vertical focusing along the first orbit are increased",
        "thereby optimizing the acceptance. Moreover",
        "to minimize space-charge effects",
        "the injection energy of H2+ is raised to 70 keV compared to the H− injection energy of 40 keV."
      ],
      "institutions": [],
      "abstract": "arXiv:1307.2949 Whitepaper on the DAEδALUS Program. The DAEδALUS Collaboration reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf036.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF037",
      "title": "Upgrade of the LNS Superconducting Cyclotron",
      "authors": [
        "A. Calanna",
        "L. Calabretta",
        "G. Cuttone",
        "G. Dagostino",
        "D. Rifuggiato",
        "INFN/LNS",
        "Catania",
        "Italy",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "MIT/PSFC",
        "Cambridge",
        "Massachusetts",
        "USA",
        "The superconducting cyclotron of the LNS-INFN has been working for about 20 years delivering ion beams from proton to gold in the wide energy range from 15 AMeV to 80 AMeV. The beam extraction is performed by means of two electrostatic deflectors and a set of magnetic channels. Recently",
        "the experiment NUMEN has been proposed to study the nuclear matrix element for the double beta decay . The requirements on target are light ion beams (A<30)",
        "with an energy range of 15-60 AMeV and a beam power of 1-5 kW. To achieve this goal we have studied the feasibility of extraction by stripping through the existing extraction channel with an increased transversal section. In addition",
        "a new extraction channel has been designed to increase as much as possible the number of the extracted ions and energies. To allow the realization of these new channels",
        "a new superconducting magnet is needed. The major changes and the expected performances for the upgraded cyclotron",
        "as well as the state-of-art of the design",
        "are here presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf037.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF038",
      "title": "RIB Transport and Selection for the SPES Project",
      "authors": [
        "M. Comunian",
        "L. Bellan",
        "A. Pisent",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "INFN/LNS",
        "Catania",
        "Italy",
        "The SPES project",
        "at Legnaro National Laboratories (LNL) in Italy",
        "is a RIB ISOL facility for the production and acceleration of “neutron-rich” radioactive ion beams. The beam dynamics of the re-accelerator part is presented with the focus on the preselection and transfer to the charge breeder device and from this device to the CW RFQ used as injector to the LNL linac ALPI."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf038.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF039",
      "title": "Stability Studies for J-PARC Linac Upgrade to 50 mA/400 MeV",
      "authors": [
        "Y. Liu",
        "T. Maruta",
        "KEK/JAEA",
        "Ibaraki-Ken",
        "Japan",
        "K. Futatsukawa",
        "T. Miyao",
        "KEK",
        "Ibaraki",
        "Japan",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "J-PARC linac applies the Equi-partitioning (EP) setting as the base-line design. And it is the first machine to adopt this approach at the design stage. EP condition is a natural solution for avoiding emittance exchange between transverse and longitudinal planes. At J-PARC linac it is also possible to explore off-EP settings. One of the motivations could be a lattice with relaxed envelope for mitigating the intra-beam stripping (IBSt) effects in high current H− beam. During and after the energy upgrade in Jan.",
        "2014 and beam current upgrade in Oct.",
        "2014",
        "experiments were carried out to study the stability and emittance evolution for the EP and off-EP settings with high current H− beam at J-PARC linac for better choices of lattice and better understanding."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf039.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF040",
      "title": "Recent Progress of the Beam Commissioning in J-PARC Linac",
      "authors": [
        "T. Maruta",
        "Y. Liupresenter",
        "KEK/JAEA",
        "Ibaraki-Ken",
        "Japan",
        "K. Futatsukawa",
        "T. Miyao",
        "KEK",
        "Ibaraki",
        "Japan",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "J-PARC linac iis replaced the front-end in the summer shutdown in year 2014 to extend the maximum peak current to 50 mA from 30 mA. By the combination with the energy upgrade conducted in year 2013",
        "it becomes possible to achieve the design beam energy of 133 kW",
        "which is corresponding to 1 MW at the extraction of 3 GeV Rapid Cycling Sychrotron (RCS). The beam commissioning after the replacement started at Sep./27",
        "and we can successfully accelerate the beam at peak current of 30 mA and 50 mA. In this presentation",
        "we introduce the resent progress of the beam commissioning of the J-PARC linac."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf040.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF042",
      "title": "Rectlinear Cooling Scheme for Bright Muon Sources",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A fast cooling technique is described that simultaneously reduces all six phase-space dimensions of a charged particle beam. In this process",
        "cooling is accomplished by reducing the beam momentum through ionization energy loss in absorbers and replenishing the momentum loss only in the longitudinal direction rf cavities. In this work we describe its main features and describe the main results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf042.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF043",
      "title": "Preliminary Studies of Laser-assisted H− Stripping at 400 MeV",
      "authors": [
        "P.K. Saha",
        "H. Harada",
        "M. Kinsho",
        "T. Maruta",
        "K. Okabe",
        "M. Yoshimotopresenter",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "KEK",
        "Ibaraki",
        "Japan",
        "Conventional H− stripping injection by using solid stripper foils in high intensity accelerators has many limitations concerning foil scattering beam losses",
        "short lifetime of the foil including unexpected and rapid foil failure due to overheating of the foil. It is not only an issue for reliable machine operation but also for facility maintenance. In the 3-GeV RCS of J-PARC",
        "the residual radiation level is extremely high not only near the injection area but also the used foil itself including the foil holder even at the present operation with one third of the designed 1 MW beam power. As an alternate method",
        "later-assisted stripping of 1 GeV H− beam has been intensively studied at SNS in Oak Ridge. The preparation for the next experiment is underway to demonstrate a three orders of magnitude improvement as compared to the earlier experiment. It is important to extend these studies for the lower H− beam energies. In the same framework as in the SNS",
        "laser stripping for the J-PARC H− beam energy of 400 MeV has been studied in the present work. The real challenges and feasibilities at this lower energy are discussed in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf043.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF044",
      "title": "Status of the J-PARC 3 GeV RCS",
      "authors": [
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "Beam injection energy of the RCS in J-PARC was increased from 181 MeV to 400 MeV",
        "and user operation with beam energy of 300 kW for both the MLF and the MR was performed with high availability from February to Jun in 2014. Beam losses during beam injection period was decreased by reduction of space charge effect due to increase of beam injection energy. Since an ion source and an RFQ of the LINAC are replaced to realize 1 MW beam power at the RCS in summer maintenance period",
        "injection beam peak current was increased from 30 mA to 50 mA. User operation was restarted from November with beam power of 300 kW. The beam power for user operation will be gradually increased after getting radiation safety permission from government. High intensity beam study was also performed and it was successfully to accelerate beam of 770 kW equivalent without beam loss except foil scattering loss. In this beam study it was cleared issues to realize 1MW operation in the RCS. Status of user operation and issues to realize high power operation in the RCS are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf044.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF045",
      "title": "Simulation Study of Muon Acceleration using RFQ for a New Muon g-2 Experiment at J-PARC",
      "authors": [
        "Y. Kondo",
        "K. Hasegawa",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "University of Tokyo",
        "Tokyo",
        "Japan",
        "T. Mibe",
        "M. Otanipresenter",
        "N. Saito",
        "KEK",
        "Tsukuba",
        "Japan",
        "A new muon g-2 experiment is planning at J-PARC. In this experiment",
        "ultra cold muons will be generated and accelerated using a linear accelerator. As the first accelerating structure",
        "an RFQ will be used. We are planning to use a spare RFQ of the J-PARC linac for the first acceleration test. We present simulation studies of this acceleration test. A design study of a muon dedicated RFQ is also shown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF046",
      "title": "Operation of the RHIC Injector Chain with Ions from EBIS",
      "authors": [
        "C.J. Gardner",
        "J.G. Alessi",
        "E.N. Beebe",
        "I. Blackler",
        "M. Blaskiewicz",
        "J.M. Brennan",
        "K.A. Brown",
        "J.J. Butler",
        "C. Carlson",
        "W. Fischer",
        "D.M. Gassner",
        "D. Goldberg",
        "T. Hayes",
        "H. Huang",
        "P.F. Ingrassia",
        "J.P. Jamilkowski",
        "N.A. Kling",
        "J.S. Laster",
        "D. Maffei",
        "M. Mapes",
        "I. Marneris",
        "G.J. Marr",
        "A. Marusic",
        "D.R. McCafferty",
        "K. Mernick",
        "M.G. Minty",
        "J. Morris",
        "C. Naylor",
        "S. Nemesure",
        "S. Perez",
        "A.I. Pikin",
        "D. Raparia",
        "T. Roser",
        "P. Sampson",
        "J. Sandberg",
        "V. Schoefer",
        "F. Severino",
        "T.C. Shrey",
        "K.S. Smith",
        "D. Steski",
        "P. Thieberger",
        "J.E. Tuozzolo",
        "B. Van Kuik",
        "A. Zaltsman",
        "K. Zeno",
        "W. Zhang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Since 2012 gold and all other ions for the RHIC injector chain have been provided by an Electron Beam Ion Source (EBIS). The source is followed by an RFQ",
        "a short Linac",
        "and a 30 m transport line. These components replace the Tandem van de Graaff and associated 840 m transfer line. They provide ions at 2 MeV per nucleon (kinetic energy) for injection into the AGS Booster. The setup and operation of Booster and AGS with various ions from the new source are reviewed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF047",
      "title": "New Series of RFQ Vane Shapes",
      "authors": [
        "Y. Iwashita",
        "Y. Fuwa",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "New series of RFQ vane shapes are under investigation by introducing more terms in addition to the two term potential. Because they can incorporate with the feature of the trapezoidal shape modulation with less multipole components",
        "higher acceleration efficiency is expected. The simulation study will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf047.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF049",
      "title": "The Simulation and Manufacture of the Room Temperature Cross-bar H Type Drift Tube Linac",
      "authors": [
        "China Institute of Atomic Energy",
        "Beijing",
        "People's Republic of China",
        "SCU",
        "Chengdu",
        "People's Republic of China",
        "The room temperature Cross-bar H Type Drift Tube Linac (CH-DTL) is one of the candidate acceleration structures working in CW mode. In order to optimize the parameters",
        "the 3 dimensional electromagnetic field of the CH-DTL cavity is simulated. The method of parameter sweeping with constraint variable is better than the method of parameter sweeping with only one variable during the optimization. In order to simplify the manufacture",
        "the drift tube surface can be designed as spherical shape. The effective shunt impedance of the CH-DTL cavity with cylinder end cup is better than that with cone cup."
      ],
      "institutions": [
        "Funding: This work is supported by the National Natural Science Foundation of China (NSFC)."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf049.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF050",
      "title": "Applications of Beam Parameter Measurements  in Transport Lines at CSNS",
      "authors": [
        "Z.P. Li",
        "L. Huang",
        "Y. Li",
        "J. Peng",
        "S. Wang",
        "IHEP",
        "Beijing",
        "People's Republic of China"
      ],
      "institutions": [],
      "abstract": "Several XAL-based applications for parameter measurements in Medium Energy Beam Transport line (MEBT) and Linac to Ring Beam Transport line (LRBT) at China Spallation Neutron Source (CSNS) have been developed. Algorithms and functions of these applications are introduced in this paper. Real Machine tests are carried out in the MEBT commissioning. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf050.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF051",
      "title": "Beam-based Alignment Simulation on Transport Line of CSNS",
      "authors": [
        "Y. Li",
        "Y.W. An",
        "L. Huang",
        "W.B. Liu",
        "S. Wang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The China Spallation Neutron Source (CSNS) is a high beam power proton machine which needs high precise alignment. Compared to traditional optical alignment",
        "the beam-based alignment (BBA) technique can implement higher precise alignment. This technique with two implementations is applied to the transport line of CSNS to get the transverse misalignments of beam position monitor (BPM) and quadrupole magnet by measuring BPM data under different conditions. The corresponding control system application programs were developed based on CSNS/XAL platform. The result shows the fitted result is consistent with the input result."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf051.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF054",
      "title": "XAL Development for CSNS/RCS Commissioning",
      "authors": [
        "Y.W. An",
        "L. Huang",
        "W.B. Liu",
        "Y.D. Liu",
        "S. Wang",
        "Y. Wei",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "As a key component of the China Spallation Neutron Source (CSNS) Project",
        "the Rapid Cycling Synchrotron (RCS) accumulates and accelerates the proton beam from 80MeV to 1.6GeV for extracting and striking the target with a repetition rate of 25Hz. A high level application programming framework code called XAL",
        "based on Java Language with a well-performance online model",
        "initially developed at the Spallation Neutron Source (SNS)",
        "has been installed as a part of control system via connection to EPICS for CSNS. Much of the applications have been initially established such as Tune Scan",
        "Tune Monitor",
        "Orbit Response Matrix Measurement",
        "RCS Orbit Display",
        "and Beta Function Measurement for preparing CSNS/RCS commissioning are showed in this paper."
      ],
      "institutions": [
        "Funding: Work supported by the National Natural Science Fund Committee, contract 11405189."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf054.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF055",
      "title": "Status of the Superconducting Cavity Development at IHEP for the CADS Linac",
      "authors": [
        "F.S. He",
        "J.P. Dai",
        "J. Dai",
        "X. Huang",
        "L.H. Li",
        "Z.Q. Li",
        "Q. Ma",
        "Z.H. Mi",
        "B. Ni",
        "W.M. Pan",
        "X.H. Peng",
        "T. Qi",
        "P. Sha",
        "G.W. Wang",
        "Q.Y. Wang",
        "Z. Xue",
        "X.Y. Zhang",
        "G.Y. Zhao",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "H. Huang",
        "H.Y. Lin",
        "Institute of High Energy Physics (IHEP)",
        "Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "IHEP (Institute of High Energy Physics) is developing a CW 10MeV proton injector and part of the 25MeV main linac for the CADS project. 14 SRF (superconducting radio frequency) spoke-012 cavities for the injector",
        "as well as 6 SRF spoke-021 cavities for the main linac are to be beam commissioned before middle of 2016; meanwhile",
        "VT (vertical test) of two more types of prototype cavities are to be finished with 2015",
        "for the future phases of the project. In this paper",
        "the VT statistics of 10 spoke012 cavities",
        "4 spoke021 cavities",
        "and a 5-cell β0.82 elliptical cavity are reported; the cavity performance during beam commissioning of the TCM (test cryomodule) is reported as well."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf055.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF057",
      "title": "Beam Commissioning of C-ADS Injector-I RFQ Accelerator",
      "authors": [
        "C. Meng",
        "J.S. Cao",
        "Y.Y. Du",
        "H. Geng",
        "T.M. Huang",
        "R.L. Liu",
        "H.F. Ouyang",
        "W.M. Pan",
        "S. Pei",
        "H. Shi",
        "Y.F. Sui",
        "J.L. Wang",
        "S.C. Wang",
        "F. Yan",
        "Q. Ye",
        "L. Yu",
        "Y. Zhao",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The C-ADS accelerator is a CW (Continuous-Wave) proton linac with 1.5 GeV in beam energy",
        "10 mA in beam current",
        "and 15 MW in beam power. C-ADS Injector-I accelerator is a 10-mA 10-MeV CW proton linac",
        "which uses a 3.2-MeV normal conducting 4-Vane RFQ and superconducting single-spoke cavities for accelerating. The frequency of RFQ accelerator is 325 MHz. The test stand composed of an ECR ion source",
        "LEBT",
        "RFQ",
        "MEBT and beam dump have been installed and the first stage of beam commissioning have been finished at IHEP in 2014 mid-year. At 90% duty factor",
        "we got 11 mA proton beam at RFQ exit with 90% beam transmission efficiency",
        "while 95% beam transmission efficiency at 70% duty factor. The energy after RFQ was measured by TOF method with FCTs. The transverse emittance measured by double-slits emittance meter was 0.135 π mm-mrad",
        "which of detailed data analysis will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf057.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF059",
      "title": "RHIC Electron Lenses Upgrades",
      "authors": [
        "X. Gu",
        "Z. Altinbas",
        "S. Binello",
        "D. Bruno",
        "M.R. Costanzo",
        "K.A. Drees",
        "W. Fischer",
        "D.M. Gassner",
        "M. Harvey",
        "J. Hock",
        "K. Hock",
        "Y. Luo",
        "A. Marusic",
        "K. Mernick",
        "C. Mi",
        "R.J. Michnoff",
        "T.A. Miller",
        "M.G. Minty",
        "A.I. Pikin",
        "G. Robert-Demolaize",
        "T. Samms",
        "V. Schoefer",
        "T.C. Shrey",
        "Y. Tan",
        "R. Than",
        "P. Thieberger",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "ESRF",
        "Grenoble",
        "France",
        "In the Relativistic Heavy Ion Collider (RHIC) 100 GeV polarized proton run in 2015[1]",
        "two electron lenses [2] were used for the first time to partially compensate for the head-on beam-beam effect. Here",
        "we describe the design of the current electron lens",
        "detailing the hardware modifications made after the 2014 commissioning run with heavy ions. A new electron gun with 15-mm diameter cathode is characterized. The electron beam transverse profile was measured using a YAG screen and fitted with a Gaussian distribution. During operation",
        "the overlap of the electron and proton beams was achieved using the electron backscattering detector in conjunction with an automated orbit control program."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf059.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF060",
      "title": "The Simulation Study of Space Charge Effects for CSNS Linac",
      "authors": [
        "Y. Yuan",
        "L. Huangpresenter",
        "J. Peng",
        "S. Wang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "China Spallation Neutron Source (CSNS) is a high intensity accelerator based facility. Its accelerator consists of an H− injector and a proton Rapid Cycling Synchrotron. The injector includes the front end and linac. The RFQ accelerates the beam to 3MeV",
        "and then DTL accelerates it to 80MeV. The space charge effect is the most important cause of emittance growth and beam loss due to the low beam energy and the high peak current. The paper performed simulation studies on the space charge effects at the LINAC by using three-dimensional code IMPACT-Z. The emittance evolution is studied in the point of view of the singe-particle dynamics and multi-particle dynamics with different peak beam current. The effect of mismatch is studied by simulation",
        "and the emittance growth with different mismatch factor are given."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf060.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF062",
      "title": "CADS 650 MHz β=0.63 Elliptical Cavity Study",
      "authors": [
        "L.J. Wen",
        "Y. He",
        "Y.M. Li",
        "S.H. Zhang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "The China Accelerator Driven Sub-critical System (CADS) is a high intensity proton facility to dispose of nuclear waste and generate electric power. CADS is based on 1.5 GeV",
        "10mA CW superconducting (SC) linac as a driver. The high-energy section of the linac is composed of two families of SC elliptical cavities which are designed for the geometrical beta 0.63 and 0.82. In this paper",
        "the 650 MHz β=0.63 SC elliptical cavity was studied",
        "including cavity optimization",
        "multipacting",
        "high order modes (HOM) and generator RF power calculation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf062.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF069",
      "title": "The Early Results of the Vertical Test for β=0.12 HWR at RISP",
      "authors": [
        "G.-T. Park",
        "H.J. Chapresenter",
        "H.C. Jung",
        "H. Kim",
        "W.K. Kim",
        "Y.J.K. Kim",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "At RISP",
        "we are planning to perform the vertical test of the β=0.12 half wave resonator. We report our progress on the preparation of the test including the cryogenic system",
        "the RF system",
        "the control and data acquisition system",
        "and the radiation shields. We had the first few occaaisions of the cool down and various measurements at a low gradient. Out preliminary result on the Q0-Eacc excitation curve will be given."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf069.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF069",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF070",
      "title": "Prototyping Progress of SSR1 Single Spoke Resonator for RAON",
      "authors": [
        "H.J. Cha",
        "H. Kim",
        "H.J. Kim",
        "W.K. Kim",
        "G.-T. Park",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "The fabrication of prototypes for four different types of superconducting cavities (QWR",
        "HWR",
        "SSR1",
        "and SSR2) for the Korean heavy ion accelerator",
        "“RAON” is in progress. In this presentation",
        "we report the current status of the SSR1 cavity (β=0.3 and f=325 MHz) prototype fabrication based on the technical designs. The simulation results on the target frequency determination for the clamp-up test of the prototype are also given."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf070.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF070",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF072",
      "title": "Beam Optics of RISP Linac using Dynac Code",
      "authors": [
        "J.-H. Jang",
        "I.S. Hong",
        "H. Jang",
        "D. Jeon",
        "H. Jinpresenter",
        "H.J. Kim",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "The RISP (Rare Isotope Science Project) is developing a superconducting linac which accelerates uranium beams up to 200MeV/u with the beam power of 400kW. The linac consists of an injector which includes an ECR ion source and an RFQ",
        "and superconducting cavities which include QWR (Quarter Wave Resonator)",
        "HWR (Half Wave Resonator)",
        "and SSR (Single Spoke Resonator). Up to HWR",
        "two charge state beams will be accelerated to achieve the required beam current and then five charge state beams will be used to obtain the higher acceleration efficiency. In this work",
        "we performed the beam optics calculation by using a beam dynamics code DYNAC in order to study a possibility of the code as an online model. We compared the results with the calculation in the baseline design by TRACK code."
      ],
      "institutions": [
        "Funding: This work was supported by the Rare Isotope Science Project of Institute for Basic Science funded by Ministry of Science, ICT and Future Planning."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf072_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf072.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf072_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF072",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF073",
      "title": "Progress of the RAON Heavy Ion Accelerator Project",
      "authors": [
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "Construction of the RAON heavy ion accelerator facility is under way in Korea that includes both the In-flight Fragment (IF) and Isotope Separation On-Line (ISOL) facilities to support cutting-edge researches in various science fields. Prototyping and testing of major components are proceeding including 28 GHz ECR ion source",
        "RFQ",
        "superconducting cavities",
        "cryomodules",
        "superconducting magnets. Superconducting magnets of 28 GHz ECR ion source are fabricated and tested. First article of prototype superconducting cavities are delivered that were fabricated through domestic vendors and tested at TRIUMF. Prototype HTS(High Tc Superconducting) magnets is in progress. Progress report of the RAON accelerator systems is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf073.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF073",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF074",
      "title": "Progress on Superconducting Linac for the RAON Heavy Ion Accelerator",
      "authors": [
        "H.J. Kim",
        "H.C. Jung",
        "W.K. Kimpresenter",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "The RISP (Rare Isotope Science Project) has been proposed as a multi-purpose accelerator facility for providing beams of exotic rare isotopes of various energies. It can deliver ions from proton to Uranium. Proton and Uranium beams are accelerated upto 600 MeV and 200 MeV/u respectively. The facility consists of three superconducting linacs of which superconducting cavities are independently phased. Requirement of the linac design is especially high for acceleration of multiple charge beams. In this paper",
        "we present the RISP linac design",
        "the prototyping of superconducting cavity and cryomodule."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf074.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF074",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF075",
      "title": "Proton Beam of 2 MeV 1.6 mA on a Tandem Accelerator with Vacuum Insulation",
      "authors": [
        "S.Yu. Taskaev",
        "D.A. Kasatov",
        "A.S. Kuznetsov",
        "A.N. Makarov",
        "I.M. Shchudlo",
        "I.N. Sorokin",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf075.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF075",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF076",
      "title": "Thermal and Structural Analysis of the 72.75 MHz LINCE RFQ",
      "authors": [
        "A.K. Orduz",
        "A. Berjillos",
        "C. Bonțoiu",
        "J.A. Dueñas",
        "I. Martel",
        "University of Huelva",
        "Huelva",
        "Spain",
        "AVS",
        "Elgoibar",
        "Spain"
      ],
      "institutions": [],
      "abstract": "The 72.75 MHz LINCE RFQ is designed to function at room temperature. Effective operation of the RFQ cavity requires efficient water cooling in order to dissipate significant resistive power non-uniformly distributed on the copper walls and vanes. This amounts to about 10 kWfor one 0.5m long RFQ section. Cylindrical cooling channels have been designed and optimized by varying their diameter and position in order to minimize the frequency shift generated by thermal displacements. The article reports results of power loss simulations coupled with electromagnetic modelling studies and their consequences on the RFQ performance in terms of resonant frequency and thermal deformations. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf076.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF076",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF077",
      "title": "Proposal for a 72.75 MHz RFQ for the LINCE Accelerator Complex",
      "authors": [
        "A.K. Orduz",
        "A. Berjillos",
        "C. Bonțoiu",
        "J.A. Dueñas",
        "I. Martel",
        "University of Huelva",
        "Huelva",
        "Spain",
        "AVS",
        "Elgoibar",
        "Spain"
      ],
      "institutions": [],
      "abstract": "The low-energy part of the LINCE facility can be based on a 72.75MHz normal-conducting RFQ designed to give a 450 keV/u boost for A/Q=7 ions in about 5m length. The vanes have been electromagnetically designed to accommodate dedicated RF windows producing effective separation of the RFQ modes in an octagonal-shaped resonance chamber. This article outlines the optimization of the quality factor of the cavity by using numerical methods for electromagnetic calculations. Experimental results of RF test carried out on a prototype are also discussed. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf077.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF077",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF078",
      "title": "Effect of the Field Maps on the Beam Dynamics of the ESS Drift Tube Linac",
      "authors": [
        "R. De Prisco",
        "M. Eshraqi",
        "Y.I. Levinsen",
        "R. Miyamoto",
        "E. Sargsyan",
        "ESS",
        "Lund",
        "Sweden",
        "Lund University",
        "Lund",
        "Sweden"
      ],
      "institutions": [],
      "abstract": "In the beam dynamic design and modelling of the European Spallation Source (ESS) Drift Tube Linac (DTL) simplified models have been used for the focusing and accelerating structures. Since the high current requires precise control of the beam to minimise the losses it is useful to analyse the beam dynamics by using accurate field maps of the focusing and accelerating structures. In this paper the effects of the 3D-field maps on the beam dynamics of the ESS DTL are presented. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf078.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF078",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF079",
      "title": "A Planning and Scheduling System for the ESS Accelerator Project",
      "authors": [
        "L. Lari",
        "M.J. Conlon",
        "H. Danared",
        "L. Gunnarsson",
        "G. Jacobsson",
        "M. Jakobsson",
        "M. Lindroos",
        "E. Tanke",
        "J.G. Weisend",
        "ESS",
        "Lund",
        "Sweden",
        "P. Bonnal",
        "L. Lari",
        "CERN",
        "Geneva",
        "Switzerland",
        "Constructing a large",
        "international research infrastructure is a complex task",
        "especially when a large fraction of the equipment is delivered as in-kind contributions. A mature project management approach is essential to lead the planning and construction to deliver scientifically and technically. The purpose of this paper is to present how the ESS accelerator project is managed in terms of planning and scheduling from the design phase until commissioning",
        "keeping time",
        "budgets and resources constraints",
        "as well as creating and maintaining a strong and trust-based partnership with the external contributors."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf079_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf079.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf079_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF079",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF080",
      "title": "Status of the ESS Accelerator Construction Project",
      "authors": [
        "M. Lindroos",
        "H. Danared",
        "R. Garoby",
        "D.P. McGinnis",
        "E. Tanke",
        "ESS",
        "Lund",
        "Sweden",
        "The European spallation source is now under construction just outside in Lund in Sweden. The driver is a 5 MW linac operating at a duty factor of 4% and at 2 GeV. The detailed design of the buildings is just being completed",
        "and the casting of the accelerator tunnel has started. The accelerator design is getting mature with the major parts under prototyping. A challenging aspect of the project is the large percentage of in-kind contributions. For the accelerator this is now reaching 47% percent in pre commitments by institutes and universities in the ESS member states. We will in this paper give an overview of the ESS accelerator design",
        "the status of prototyping and the organization of the in-kind accelerator construction project."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf080.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF080",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF081",
      "title": "On the Suitability of a Solenoid Horn for the ESS Neutrino Superbeam",
      "authors": [
        "M. Olvegård",
        "T.J.C. Ekelöf",
        "R.J.M.Y. Ruber",
        "V.G. Ziemann",
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "CERN",
        "Geneva",
        "Switzerland",
        "The European Spallation Source (ESS)",
        "now under construction in Lund",
        "Sweden",
        "offers unique opportunities for experimental physics",
        "not only in neutron science but potentially in particle physics. The ESS neutrino superbeam project plans to use a 5 MW proton beam from the ESS linac to generate a high intensity neutrino superbeam",
        "with the final goal of detecting leptonic CP-violation in an underground megaton Cherenkov water detector. The neutrino production requires a second target station and a complex focusing system for the pions emerging from the target. The normal-conducting magnetic horns that are normally used for these applications cannot accept the 2.86 ms long proton pulses of the ESS linac",
        "which means that pulse shortening in an accumulator ring would be required. That",
        "in turn",
        "requires H− operation in the linac to accommodate the high intensity. As an attractive alternative",
        "we investigate the possibility of using superconducting solenoids for the pion focusing. This solenoid horn system needs to also separate positive and negative pion charge as completely as possible",
        "in order to generate separately neutrino and anti-neutrino beams. We present here progress in the study of such a solenoid horn."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf081_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf081.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf081_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF081",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF082",
      "title": "Considerations on the Fast Pulsed Magnet Systems for the 2 GeV Beam Transfer from the CERN PSB to PS",
      "authors": [
        "T. Kramer",
        "J.L. Abelleirapresenter",
        "W. Bartmann",
        "J. Borburgh",
        "L. Ducimetière",
        "L.M.C. Feliciano",
        "B. Goddard",
        "L. Sermeus",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [
        "Within the scope of the LIU project the CERN PS Booster to PS beam transfer will be modified to match the requirements for the future 2 GeV proton beam energy upgrade. The paper describes considerations on the PSB extraction and recombination kickers as well as on the injection kicker(s) into the PS. Different schemes of an injection into the PS have been outlined in the past and are reviewed under the aspect of individual transfer kicker rise and fall time performances. Recent measurements on the recombination kickers are presented and subsequently homogenous rise and fall time requirements in the whole PSB to PS transfer chain are presented. The baseline option for the PS injection kicker(s) is outlined and compared to the previously presented concepts."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf082_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf082.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf082_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF082",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF083",
      "title": "Painting Schemes for CERN PS Booster H− Injection",
      "authors": [
        "J.L. Abelleira",
        "W. Bartmann",
        "E. Benedetto",
        "C. Bracco",
        "G.P. Di Giovanni",
        "V. Forte",
        "M. Kowalska",
        "M. Meddahi",
        "B. Mikulec",
        "G. Rumolo",
        "CERN",
        "Geneva",
        "Switzerland",
        "Université Blaise Pascal",
        "Clermont-Ferrand",
        "France",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "The present 50-MeV proton injection into the PS Booster will be replaced by a H− charge exchange injection at 160 MeV to be provided by Linac 4. The higher energy will allow producing beams at higher brightness. A set of kicker magnets (KSW) will move the beam across the stripping foil to perform phase space painting in the horizontal plane to reduce space charge effects. The PSB must satisfy the different users with very different beams in terms of emittance and intensity. Therefore",
        "the KSW waveforms must be adapted for each case to meet the beam characteristics while minimizing beam losses. Here we present the results of the simulations performed to optimise the injection system. A detailed analysis of the different painting schemes is discussed",
        "including the effect of the working point on the painted beam",
        "and variations in the offset of the injected beam."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf083_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf083.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf083_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF083",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF084",
      "title": "ProTec - A Normal-conducting Cyclinac for Proton Therapy Research and Radioisotope Production",
      "authors": [
        "R. Apsimon",
        "G. Burt",
        "S. Pitman",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "CERN",
        "Geneva",
        "Switzerland",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "The ProTec cyclinac proposes the use of a 24 MeV high-current cyclotron to inject protons into a normal-conducting linac pulsed at up to 1 kHz to give energies up to 150 MeV. As well as being able to produce radioisotopes such as 99mTc",
        "the cyclinac can also provide protons at higher energy with beam properties relevant for proton therapy research. In this paper we present a comparison of linac designs in which S-band structures are used at lower energies",
        "prior to injection into a high-gradient X-band structure; issues such as beam capture and transmission are evaluated."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf084_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf084.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf084_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF084",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF085",
      "title": "Beam Commissioning of Linac4 up to 12 MeV",
      "authors": [
        "V.A. Dimov",
        "E. Belli",
        "G. Bellodi",
        "J.-B. Lallement",
        "A.M. Lombardi",
        "CERN",
        "Geneva",
        "Switzerland",
        "IPM",
        "Tehran",
        "Iran",
        "CERN Linac4 is made of a 3 MeV front end including a 45 keV source",
        "a 3 MeV Radio Frequency Quadrupole (RFQ) and a fast chopper",
        "followed by a 50 MeV Drift Tube Linac (DTL)",
        "a 100 MeV Cell-Coupled Drift Tube Linac (CCDTL) and a 160 MeV Pi-Mode Structure (PIMS). The Linac4 beam commissioning is performed in 6 stages of increasing energy. Movable beam diagnostics benches",
        "with various instruments",
        "are used at each step to allow the detailed characterisation of operational parameters that will play a key role in the overall future performance. The first three stages of the commissioning",
        "up to 12 MeV beam energy",
        "have been completed at the end of 2014. The RFQ and the chopper line at 3 MeV",
        "as well as the first tank of the DTL at 12 MeV were fully characterised",
        "using permanent diagnostic instruments and a movable diagnostic bench equipped with a spectrometer",
        "a slit-grid emittance meter",
        "a Bunch Shape Monitor",
        "Beam Position Monitors and a laser-emittance device. This paper reports on the strategy and the results of the commissioning up to 12 MeV. It also presents the validation of the set-up strategy",
        "which is essential for the next stages of commissioning."
      ],
      "institutions": [],
      "abstract": "M. Yarmohammadi Satri reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf085_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf085.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf085_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF085",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF086",
      "title": "A New Hardware Design for PSB Kicker Magnets (KSW) for the 35 mm Transverse Painting in the Horizontal Plane",
      "authors": [
        "L.M.C. Feliciano",
        "C. Bracco",
        "L. Ducimetière",
        "T. Fowler",
        "G. Gräwer",
        "R. Noulibos",
        "L. Sermeus",
        "W.J.M. Weterings",
        "C. Zannini",
        "CERN",
        "Geneva",
        "Switzerland",
        "The changeover from Linac2 to Linac4 in CERN’s injector chain will allow increasing the injection energy into the PS Booster from 50 MeV to 160 MeV. Transverse phase space painting will be performed in the horizontal plane",
        "by means of four stacks of four KSW kicker magnets. The KSW magnets are located outside the injection region and will produce a 35 mm closed orbit bump",
        "with falling amplitude during the injection to accomplish transverse phase space painting to the required emittance. New magnets with two different types of coils are being built using the existing design. The magnets are made of two halves",
        "which are assembled together around a vacuum ceramic chamber. In order to reduce the beam impedance",
        "the ceramic chamber is internally coated by a thin titanium layer. A new multiple-linear waveform generator has been developed to provide the high flexibility in the KSW kicker magnets current decay to fulfil the requirements of all the different users (LHC",
        "nTOF",
        "ISOLDE",
        "CNGS",
        "etc.)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf086_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf086.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf086_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF086",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF087",
      "title": "New Shaving Scheme for Low-Intensity Beams in the CERN PS Booster and Feasibility at 160 MeV",
      "authors": [
        "M. Kowalska",
        "E. Benedetto",
        "V. Fortepresenter",
        "B. Mikulec",
        "G. Rumolo",
        "CERN",
        "Geneva",
        "Switzerland",
        "Université Blaise Pascal",
        "Clermont-Ferrand",
        "France",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "The PS Booster is the first synchrotron in the CERN proton accelerator chain",
        "serving all downstream machines. As part of the LHC Injector Upgrade Project",
        "the PSB injection energy will increase from 50 MeV to 160 MeV and a new H− charge-exchange injection scheme will be implemented. Beam losses are a concern due to the increased injection energy",
        "and mitigation scenarios are under investigation. On the other hand it is desirable for low-intensity beams to have the possibility to precisely tailor sub-micron beam emittances through controlled scraping (transverse shaving process) towards a suitable aperture restriction. Challenges are the higher activation potential of the beam and the smaller transverse beam sizes around 160 MeV as compared to 63 MeV",
        "at which the shaving is presently done. This paper describes the proposal of a new shaving scheme",
        "more robust with respect to the steering errors and the choice of the working point",
        "which localizes the scraping losses on the main PS Booster aperture restriction. The robustness of the new method",
        "together with the results of simulations and measurements are discussed for the current (50 MeV) and future (160 MeV) situation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf087_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf087.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf087_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF087",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF088",
      "title": "CERN PS Booster Upgrade and LHC Beams Emittance",
      "authors": [
        "E. Benedetto",
        "J.L. Abelleira",
        "C. Bracco",
        "V. Fortepresenter",
        "B. Mikulec",
        "G. Rumolo",
        "CERN",
        "Geneva",
        "Switzerland",
        "Université Blaise Pascal",
        "Clermont-Ferrand",
        "France",
        "By increasing the CERN PS Booster injection energy from 50 MeV to 160 MeV",
        "the LHC Injector Upgrade Project aims at producing twice as brighter beams for the LHC. Previous measurements showed a linear dependence of the transverse emittance with the beam intensity and space-charge simulations confirmed the linear scaling. This paper is discussing in detail the dependence on the longitudinal emittance and on the choice of the working point",
        "with a special attention to the H− injection process and to the beam dynamics in the first 5 ms",
        "during the fall of the injection chicane bump."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf088_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf088.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf088_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF088",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF089",
      "title": "Beam Transfer to the FCC-hh Collider from a 3.3 TeV Booster in the LHC Tunnel",
      "authors": [
        "W. Bartmann",
        "M.J. Barnes",
        "M.A. Fraserpresenter",
        "B. Goddard",
        "W. Herr",
        "J. Holma",
        "V. Kain",
        "T. Kramer",
        "M. Meddahi",
        "A. Milanese",
        "R. Ostojić",
        "L.S. Stoel",
        "J.A. Uythoven",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "Transfer of the high brightness 3.3 TeV proton beams from the High Energy Booster (HEB) to the 100 TeV centre-of-mass proton collider in a new tunnel of 80–100 km circumference will be a major challenge. The extremely high stored beam energy means that machine protection considerations will constrain the functional design of the transfer",
        "for instance in the amount of beam transferred",
        "the kicker rise and fall times and hence the collider filling pattern. In addition the transfer lines may need dedicated insertions for passive protection devices. The requirements and constraints are described",
        "and a first concept for the 3.3 TeV beam transfer between the machines is outlined. The resulting implications on the parameters and design of the various kicker systems are explored",
        "in the context of the available technology. The general features of the transfer lines between the machines are described",
        "with the expected constraints on the collider layout and insertion lengths."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf089_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf089.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf089_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF089",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF090",
      "title": "Status and Plans for the Upgrade of the CERN PS Booster",
      "authors": [
        "K. Hanke",
        "D. Aguglia",
        "M.E. Angoletta",
        "W. Bartmann",
        "C. Bedel",
        "E. Benedetto",
        "S. Bertolasi",
        "C. Bertone",
        "J. Betz",
        "T.W. Birtwistle",
        "A. Blas",
        "J. Borburgh",
        "C. Bracco",
        "A.C. Butterworth",
        "E. Carlier",
        "S. Chemli",
        "P. Dahlen",
        "A. Dallocchio",
        "G.P. Di Giovanni",
        "T. Dobers",
        "A. Findlay",
        "R. Froeschl",
        "A. Funken",
        "S. Gabourin",
        "J.L. Grenard",
        "D. Grenier",
        "J. Hansen",
        "D. Hay",
        "J.-M. Lacroix",
        "P. Le Roux",
        "L.A. Lopez Hernandez",
        "C. Martin",
        "A. Masi",
        "B. Mikulec",
        "Y. Muttoni",
        "A. Newborough",
        "D. Nisbet",
        "M.R. Obrecht",
        "M.M. Paoluzzi",
        "S. Pittet",
        "B. Puccio",
        "J. Tan",
        "J. Vollaire",
        "W.J.M. Weterings",
        "CERN",
        "Geneva",
        "Switzerland",
        "CERN’s Proton Synchrotron Booster (PSB) is undergoing a major upgrade program in the frame of the LHC Injectors Upgrade (LIU) project. During the first long LHC shutdown (LS1) some parts of the upgrade have already been implemented",
        "and the machine has been successfully re-commissioned. More work is planned for the upcoming end-of-year technical stops",
        "notably in 2016/17",
        "while most of the upgrade is planned to take place during the second long LHC shutdown (LS2). We report on the upgrade items already completed and commissioned",
        "the first Run 2 beam performance and give a status of the ongoing design and integration work."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf090_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf090.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf090_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF090",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF091",
      "title": "Detailed Studies of Beam Induced Scrubbing in the CERN-SPS",
      "authors": [
        "G. Iadarola",
        "H. Bartosik",
        "T. Bohl",
        "B. Goddard",
        "G. Kotzian",
        "K.S.B. Li",
        "L. Mether",
        "G. Rumolo",
        "M. Schenk",
        "E.N. Shaposhnikova",
        "M. Taborelli",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the framework of the LHC Injectors Upgrade (LIU) program",
        "it is foreseen to take all the necessary measures to avoid electron cloud effects in the CERN-SPS. This can be achieved by either relying on beam induced scrubbing or by coating the vacuum chambers with intrinsically low Secondary Electron Yield (SEY) material over a large fraction of the ring. To clearly establish the potential of beam induced scrubbing",
        "and to eventually decide between the two above options",
        "an extensive scrubbing campaign is taking place at the SPS. Ten days in 2014 and two full weeks in 2015 are devoted to machine scrubbing and scrubbing qualification studies. This paper summarizes the main findings in terms of scrubbing efficiency and reach so far",
        "addressing also the option of using a special doublet beam and its implication for LHC."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf091_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf091.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf091_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF091",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF092",
      "title": "European Spallation Source Lattice Design Status",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "H. Danared",
        "R. De Prisco",
        "M. Eshraqi",
        "R. Miyamoto",
        "M. Muñoz",
        "A. Ponton",
        "E. Sargsyan",
        "ESS",
        "Lund",
        "Sweden",
        "S.P. Møller",
        "H.D. Thomsen",
        "ISA",
        "Aarhus",
        "Denmark",
        "The European Spallation Source will offer an unprecedented beam power for spallation sources of 5 MW. The accelerator will deliver a proton beam of 62.5 mA peak current and 2.0 GeV onto the spallation target. Since the technical design report (TDR) was published in 2013",
        "work has continued to further optimize the accelerator design. We report on the advancements in lattice design optimizations after the TDR to improve performance and flexibility",
        "and reduce cost of the ESS accelerator."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf092_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf092.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf092_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF092",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF093",
      "title": "Status of the LHC Injectors Upgrade (LIU) Project at CERN",
      "authors": [
        "M. Meddahi",
        "J. Coupard",
        "H. Damerau",
        "A. Funken",
        "S.S. Gilardoni",
        "B. Goddard",
        "K. Hanke",
        "L. Kobzeva",
        "A.M. Lombardi",
        "D. Manglunki",
        "S. Mataguez",
        "B. Mikulec",
        "G. Rumolo",
        "E.N. Shaposhnikova",
        "M. Vretenar",
        "CERN",
        "Geneva",
        "Switzerland",
        "CERN is currently carrying out an ambitious improvement programme of the full LHC Injectors chain in order to enable the delivery of beams with the challenging HL-LHC parameters. The LHC Injectors Upgrade project coordinates this massive upgrade program",
        "and covers a new linac (Linac4 project) as well as upgrades to the Proton Synchrotron Booster",
        "the Proton Synchrotron and Super Proton Synchrotron. The heavy ion injector chain is also included",
        "adding the Linac3 and Low Energy Ion Ring to the list of accelerators concerned. The performance objectives and roadmap of the main upgrades will be presented",
        "including the work status and outlook. The machine studies and milestones during LHC Run 2 will be discussed and a preliminary Long Shutdown 2 installation planning given. Finally",
        "for the LHC Run 3",
        "the beam performance across the full injector chain after all the upgrades will be estimated and the required commissioning stages outlined."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf093_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf093.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf093_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF093",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF094",
      "title": "Possible Reuse of the LHC as a 3.3 TeV High Energy Booster for Hadron Injection into the FCC-hh Collider",
      "authors": [
        "B. Goddard",
        "W. Bartmann",
        "M. Benedikt",
        "W. Herr",
        "M. Lamont",
        "P. Lebrun",
        "M. Meddahipresenter",
        "A. Milanese",
        "M. Solfaroli Camillocci",
        "L.S. Stoel",
        "CERN",
        "Geneva",
        "Switzerland",
        "One option for the injector into a 100 TeV centre-of-mass energy frontier proton collider (FCC-hh) in a new tunnel of 80–100 km circumference is to reuse a suitably modified LHC as 3.3 TeV High Energy Booster (HEB). The changes that would be required to the existing LHC insertions are described",
        "including the types and numbers of new magnets and circuits. The limitations on the maximum LHC ramp rate and minimum cycle time discussed. The key question of the minimum FCC filling time achievable with technically possible upgrades is examined",
        "together with the issues of decommissioning for the elements which would need to be removed from the machine. The potential performance reach of the modified LHC as 3.3 TeV HEB is quantified",
        "and implications for FCC-hh discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf094_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf094.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf094_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF094",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF095",
      "title": "Limits on Failure Scenarios for Crab Cavities in the HL-LHC",
      "authors": [
        "A. Santamaría García",
        "H. Burkhardt",
        "A. Macpherson",
        "K.N. Sjobak",
        "D. Wollmann",
        "B. Yee-Rendón",
        "CERN",
        "Geneva",
        "Switzerland",
        "DCI-UG",
        "León",
        "Mexico",
        "CINVESTAV",
        "Mexico City",
        "Mexico",
        "The High Luminosity (HL) LHC upgrade aims for a tenfold increase in integrated luminosity compared to the nominal LHC",
        "and for operation at a levelled luminosity of 5 1034 cm-2.s-1",
        "which is five times higher than the nominal LHC peak luminosity. Crab Cavities (CCs) are planned to compensate the geometric luminosity loss created by the increased crossing angle by rotating the bunch",
        "allowing quasi head-on collisions at the Interaction Points (IP). The CCs work by creating transverse kicks",
        "and their failure may have short time constants comparable to the reaction time of the Machine Protection System (MPS)",
        "producing significant coherent betatron oscillations and fast emittance growth. Simulations of CC failure modes have been carried out with the tracking code SIXTRACK",
        "using the newly added functionality called DYNK",
        "which allows to dynamically change the attributes of the CCs. We describe these simulations and discuss early",
        "preliminary results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf095_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf095.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf095_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF095",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF096",
      "title": "Origin of the Damage to the Internal High Energy Beam Dump in the CERN SPS",
      "authors": [
        "V. Kain",
        "K. Cornelis",
        "B. Goddard",
        "M. Lamont",
        "I.V. Leitao",
        "R. Losito",
        "C. Maglioni",
        "M. Meddahi",
        "F. Pasdeloup",
        "G.E. Steelepresenter",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "The high energy beam dump in the SPS has to deal with beams from 105 to 450 GeV/c and intensities of up to 4 ×1013 protons. An inspection during the last shutdown revealed significant damage to the Al section of the dump block. This paper summarizes the results of the analysis revealing the most likely cause of the damage to the beam dump. The implications for future SPS operation will also be briefly discussed",
        "together with the short-term solution put in place."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf096_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf096.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf096_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF096",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF097",
      "title": "Feasibility Study of a New SPS Beam Dump System",
      "authors": [
        "F.M. Velotti",
        "J.L. Abelleira",
        "M.J. Barnes",
        "C. Bracco",
        "E. Carlier",
        "F. Cerutti",
        "K. Cornelis",
        "R. Folch",
        "B. Goddard",
        "V. Kain",
        "M. Meddahi",
        "R.F. Morton",
        "J.A. Osborne",
        "F. Pasdeloup",
        "V. Senaj",
        "G.E. Steele",
        "J.A. Uythoven",
        "H. Vincke",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN Super Proton Synchrotron (SPS) presently uses an internal beam dump system with two separate blocks to cleanly dispose of low and high energy beams. In view of the increased beam power and brightness needed for the LHC Injector Upgrade project for High Luminosity LHC (HL-LHC)",
        "the performance of this internal beam dump system has been reviewed for future operation. Different possible upgrades of the beam dumping system have been investigated. The initially considered solution for the SPS Beam Dump System is to design a new",
        "dedicated external system",
        "with a dump block in a shielded cavern separated from the machine ring. Unfortunately this solution is not feasible with the present technology. In this paper",
        "the design requirements and the possible solutions are investigated",
        "including considering a new internal beam dump in the Long Straight Section 5 (LSS5)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf097_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf097.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf097_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF097",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF098",
      "title": "SPS-to-LHC Transfer Lines Loss Map Generation Using PyCollimate",
      "authors": [
        "EPFL",
        "Lausanne",
        "Switzerland",
        "W. Bartmann",
        "C. Bracco",
        "M.A. Fraser",
        "B. Goddard",
        "V. Kain",
        "M. Meddahi",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Transfer Lines (TL) linking the Super Proton Synchrotron (SPS) to the Large Hadron Collider (LHC) are both equipped with a complete collimation system to protect the LHC against mis-steered beams. During the setting up of these collimators",
        "their gaps are positioned to nominal values and the phase-space coverage of the whole system is checked using a manual validation procedure. In order to perform this setting-up more efficiently and more reliably",
        "the simulated loss maps of the TLs will be used to validate the collimator positions and settings. In this paper",
        "the simulation procedure for the generation of TL loss maps is described",
        "and a detailed overview of the new scattering routine (pycollimate) is given. Finally",
        "the results of simulations benchmark with another scattering routine are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf098_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf098.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf098_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF098",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF099",
      "title": "Upgrade of the SPS Ion Injection System",
      "authors": [
        "J.A. Uythoven",
        "J. Borburgh",
        "E. Bravin",
        "S. Burger",
        "E. Carlier",
        "J.-M. Cravero",
        "L. Ducimetière",
        "S.S. Gilardoni",
        "B. Goddard",
        "J. Hansen",
        "E.B. Holzer",
        "M. Hourican",
        "T. Kramer",
        "F.L. Maciariello",
        "D. Manglunki",
        "F.-X. Nuiry",
        "A. Perillo Marcone",
        "G.E. Steele",
        "F.M. Velottipresenter",
        "H. Vincke",
        "CERN",
        "Geneva",
        "Switzerland",
        "As part of the LHC Injectors Upgrade Project (LIU) the injection system into the SPS will be upgraded for the use with ions. The changes will include the addition of a Pulse Forming Line parallel to the existing PFN to power the kicker magnets MKP-S. With the PFL a reduced magnetic field rise time of 100 ns should be reached. The missing deflection strength will be given by two new septum magnets MSI-V",
        "to be installed between the existing septum MSI and the kickers MKP-S. A dedicated ion dump will be installed downstream of the injection elements. The parameter lists of the elements and studies concerning emittance blow-up coming from the injection system are presented. The feasibility of the 100 ns kicker rise time and the small ripple of the septum power converter are presented. Material studies of the ion dump are presented together with the radiation impact."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf099_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf099.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf099_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF099",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF100",
      "title": "Status of the ESSnuSB Accumulator",
      "authors": [
        "E.H.M. Wildner",
        "B.J. Holzer",
        "M. Martini",
        "Y. Papaphilippou",
        "H.O. Schönauer",
        "CERN",
        "Geneva",
        "Switzerland",
        "T.J.C. Ekelöf",
        "M. Olvegård",
        "R.J.M.Y. Ruber",
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "ESS",
        "Lund",
        "Sweden",
        "The European Spallation Source (ESS) is a research center based on the world's most powerful neutron source currently under construction in Lund",
        "Sweden. 2.0 GeV",
        "2.86 ms long proton pulses at 14 Hz are produced for the spallation facility (5MW on target). The possibility to pulse the linac at higher frequency to deliver",
        "in parallel with the spallation neutron production",
        "a very intense",
        "cost effective",
        "high performance neutrino beam. Short pulses on the target require an accumulator ring. The optimization of the accumulator lattice to store these high intensity beams from the linac (1.1x1015 protons per pulse) has to take into account the space available on the ESS site",
        "transport of H− beams (charge exchange injection)",
        "radiation and shielding needs. Space must be available in the ring for collimation and an RF system for the extraction gap and loss control. We present the status of the accumulator for ESS neutrino facility."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf100_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf100.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf100_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF100",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF101",
      "title": "Design of a Proton Travelling Wave Linac with a Novel Tracking Code",
      "authors": [
        "EPFL",
        "Lausanne",
        "Switzerland",
        "TERA",
        "Novara",
        "Italy",
        "A. Grudiev",
        "A. Latina",
        "CERN",
        "Geneva",
        "Switzerland",
        "A non-relativistic proton linac based on high gradient backward travelling wave accelerating structures was designed using a novel dedicated 3D particle tracking code. Together with the specific RF design approach adopted",
        "the choice of a 2.9985 GHz backward travelling wave (BTW) structure with 150° RF phase advance per cell was driven by the goal of reaching an accelerating gradient of 50 MV/m",
        "which is more than twice that achieved so far. This choice dictated the need to develop a new code for tracking charged particles through travelling wave structures which were never used before in proton linacs. Nevertheless",
        "the new code has the capability of tracking particles through any kind of accelerating structure",
        "given its real and imaginary electromagnetic field map. This project opens a completely new field in the design of compact linacs for proton therapy",
        "possibly leading to cost-effective and widespread single room facilities for cancer treatment."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf101.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF101",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF102",
      "title": "Verification of the Neutron Mirror Capabilities in MCNPX via Gold Foil Measurements at the EIGER Instrument Beamline at the Swiss Spallation Neutron Source (SINQ)",
      "authors": [
        "R.M. Bergmann",
        "U. Filges",
        "S.H. Forss",
        "E. Rantsiou",
        "D. Reggiani",
        "T. Reiss",
        "U. Stuhr",
        "V. Talanov",
        "M. Wohlmuther",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The EIGER triple-axis thermal neutron spectrometer beamline contains “supermirror” neutron guides",
        "which preferentially reflect low-energy neutrons toward the EIGER spectrometer that come from the ambient temperature",
        "light water neutron source in SINQ. Gold foil measurements have been performed at the EIGER beamline in 2013. This process can be modeled from incident proton to thermal neutron exiting the EIGER beamline by using the neutron mirror capabilities of MCNPX",
        "which should be more accurate than simulations with simplified neutron source distributions and geometry representations. The supermirror reflectivity parameters have been measured previously and are used in MCNPX 2.7.0 to reproduce the activity measured from the gold foil irradiation",
        "verifying the neutron mirror modeling capabilities in MCNPX 2.7.0."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf102.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF102",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF103",
      "title": "Current Status of the SANAEM RFQ Accelerator Beamline",
      "authors": [
        "G. Turemen",
        "B. Yasatekin",
        "Ankara University",
        "Faculty of Sciences",
        "Ankara",
        "Turkey",
        "Y. Akgun",
        "A.S. Bolukdemir",
        "TAEK",
        "Ankara",
        "Turkey",
        "SNRTC",
        "Ankara",
        "Turkey",
        "A. Bozbey",
        "A. Sahin",
        "TOBB ETU",
        "Ankara",
        "Turkey",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "S. Ogur",
        "V. Yildiz",
        "Bogazici University",
        "Bebek / Istanbul",
        "Turkey",
        "S. Oz",
        "A. Ozbey",
        "H. Yildiz",
        "Istanbul University",
        "Istanbul",
        "Turkey",
        "UCI",
        "Irvine",
        "California",
        "USA",
        "IZTECH",
        "Izmir",
        "Turkey",
        "The design and production of the proton beamline of SPP",
        "which aims to educate accelerator physicists and serve as particle accelerator technologies test bench",
        "continues at TAEK-SANAEM as a multi-phase project. For the first phase",
        "the 20 keV protons will be accelerated to 1.3 MeV by a single piece RFQ. Currently",
        "the beam current and stability tests are ongoing for the Inductively Coupled Plasma ion source and the measured magnetic field maps of the Low Energy Beam Transport solenoids are being matched to the RFQ acceptance with various beam configurations of the ion source by using computer simulations. The production of the RFQ cavity was started by using high grade aluminum material which will be subsequently coated by Copper to reduce the RF losses. The installation of the low energy diagnostics box was also completed. On the RF side",
        "the development of the hybrid power supply based on solid state and tetrode amplifiers continues. All RF transmission components are already produced with the exception of the circulator and the power coupling antenna which are in the manufacture and design phases",
        "respectively. The acceptance tests of the produced RF components are ongoing. This work summarizes the design",
        "production and test phases of the above mentioned SPP proton beamline components."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf103.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF103",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF104",
      "title": "Design of a Scaled High Duty Factor High Current Negative Penning Surface Plasma Source",
      "authors": [
        "D.C. Faircloth",
        "S.R. Lawrie",
        "T. Rutter",
        "M. Whitehead",
        "T. Wood",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "The Front End Test Stand (FETS) at the Rutherford Appleton Laboratory (RAL) requires a 60 mA",
        "2 ms",
        "50 Hz H− beam. The present source can only deliver the current and pulse length requirements at 25 Hz. At 50 Hz there is too much droop in the beam current. To rectify this",
        "a scaled source is being developed. This paper details the new source design and the experiments conducted that are guiding the design."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf104_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf104.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf104_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF104",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF105",
      "title": "Status of the RAL Front End Test Stand",
      "authors": [
        "A.P. Letchford",
        "M.A. Clarke-Gayther",
        "M. Dudman",
        "D.C. Faircloth",
        "S.R. Lawrie",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "S.M.H. Alsari",
        "M. Aslaninejad",
        "J.K. Pozimski",
        "P. Savage",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "University of Warwick",
        "Coventry",
        "United Kingdom",
        "G.E. Boorman",
        "A. Bosco",
        "S.M. Gibson",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "R.T.P. D'Arcy",
        "S. Jolly",
        "UCL",
        "London",
        "United Kingdom",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The Front End Test Stand (FETS) under construction at RAL is a demonstrator of front end systems for future high power proton linacs. Possible applications include a linac upgrade for the ISIS spallation neutron source",
        "new future neutron sources",
        "accelerator driven sub-critical systems",
        "high energy physics proton drivers etc. Designed to deliver a 60mA H-minus beam at 3MeV with a 10% duty factor",
        "FETS consists of a high brightness surface plasma ion source",
        "magnetic solenoid low energy beam transport (LEBT)",
        "4-vane 324MHz radio frequency quadrupole and medium energy beam transport (MEBT) containing a high speed beam chopper and non-destructive laser diagnostics. This paper describes the current status of the project and future plans."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf105_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf105.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf105_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF105",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF106",
      "title": "Review of Linac Upgrade Options for the ISIS Spallation Neutron Source",
      "authors": [
        "D.C. Plostinar",
        "C.R. Prior",
        "G.H. Rees",
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The ISIS Spallation Neutron Source at Rutherford Appleton Laboratory has recently celebrated 30 years of neutron production. However",
        "with increasing demand for improved reliability and higher beam power it has become clear that a machine upgrade is necessary in the medium to long term. One of the upgrade options is to replace the existing 70 MeV H− injector. In this paper we review the ongoing upgrade programme and highlight three linac upgrade scenarios now under study. The first option is to keep the existing infrastructure and replace the current linac with a higher frequency",
        "more efficient machine. This would allow energies in excess of 100 MeV to be achieved in the same tunnel length. A second option is to replace the current linac with a new 180 MeV linac",
        "requiring a new tunnel. A third option is part of a larger upgrade scenario and involves the construction of an 800 MeV superconducting linac."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf106_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf106.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf106_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF106",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF107",
      "title": "Quality and Stability Studies of the Beams in the ELENA Ring Transfer Lines",
      "authors": [
        "J.R. Hunt",
        "O. Karamyshev",
        "J. Resta-Lópezpresenter",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "J.R. Hunt",
        "O. Karamyshev",
        "J. Resta-Lópezpresenter",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The Extra Low ENergy Antiproton (ELENA) ring will provide seven different experiments at CERN with cooled beams of low energy (~100 keV) antiprotons. As a result",
        "a system of transfer lines is being designed to ensure that each experiment receives a beam with its required properties. In this contribution",
        "particle tracking simulations using MADX are performed to explore the effects on the beam quality and orbit stability of different lattice imperfections",
        "such as element misalignment",
        "electric field and matching errors. The tolerances on the actual values of these quantities are obtained as a guide for the construction of the transfer lines."
      ],
      "institutions": [
        "Funding: Work supported by the EU under Grant Agreement 624854 and the STFC Cockcroft Institute core Grant No. ST/G008248/1."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf107_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf107.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf107_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF107",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF108",
      "title": "EBIS Charge Breeder at ANL and its Integration into ATLAS",
      "authors": [
        "A. Perry",
        "A. Barcikowski",
        "G.L. Cherry",
        "C. Dickerson",
        "B. Mustapha",
        "P.N. Ostroumovpresenter",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "An Electron Beam Ion Source charge breeder (EBIS-CB) has been developed to breed CARIBU radioactive beams at ATLAS and is in the final stages of off-line commissioning. Within the next year",
        "the EBIS-CB will replace the existing ECR charge breeder to increase the intensity and improve the purity of reaccelerated radioactive ion beams. Integration of the new EBIS-CB requires: a. Building a compact fully electrostatic low energy beam transport line (LEBT) from CARIBU to the EBIS-CB that satisfies the spatial constraints and ensures the successful ion seeding into the EBIS trap. b. Modifications to the existing ATLAS LEBT to purify the EBIS beams by q/A selection and accommodate the injection of the charge bred ions into ATLAS. In this paper",
        "we will describe the beam line design and present beam dynamics simulation results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf108_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf108.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf108_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF108",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF110",
      "title": "Offline Testing of the CARIBU EBIS Charge Breeder",
      "authors": [
        "C. Dickerson",
        "S.A. Kondrashev",
        "P.N. Ostroumov",
        "R.C. Vondrasek",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "In 2015 an electron beam ion source (EBIS) will be installed at the ATLAS facility to charge breed radioactive beams from the Californium Rare Isotope Breeder Upgrade (CARIBU). Currently an ECR ion source is used to charge breed CARIBU beams. The EBIS will provide beams with much less contamination and higher breeding efficiencies. In preparation for its installation at ATLAS the EBIS has been successfully commissioned offline. The EBIS was configured in the offline facility to closely mimic the conditions expected in the ATLAS installation",
        "so commissioning results should be representative of its performance with CARIBU. The EBIS breeding efficiency was tested with pulses of 133Cs1+ from a surface ionization source",
        "and for multiple operational modes maximum breeding efficiencies greater than 25% could be achieved. After transmission losses the total efficiency of the system was 15-20%. The contaminants were expectedly very low for a UHV system with nominal pressures of ~1 – 3 x 10-10 Torr."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf110_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf110.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf110_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF110",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF112",
      "title": "A New Beam Injection Scheme for the Fermilab Booster",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Here we present an improved beam injection scheme for the Fermilab Booster. The beam is injected on the deceleration part of the standard sinusoidal magnetic ramp and beam capture takes place almost immediately after the injection process",
        "before the beam is fully de-bunched. During the entire capture process we impose in a changing field with changing from negative to zero to positive values. Our simulations clearly showed that this method of beam capture is more efficient to preserve longitudinal beam emittance at the early part of the acceleration cycle and helps to keep the required rf voltage to an optimal value of 15% lower than the current operational values. As a result of the reduced emittance growth at the early part of the Booster cycle we observe reduced required rf power on a typical Booster cycle by ~30%",
        "which is quite important from the point of rf power requirements during the Booster operation. Further",
        "we investigate snap bunch rotation at extraction to provide beam with lower to the MI/RR to improve the proton beam slip-stacking efficiency."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf112_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf112.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf112_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF112",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF113",
      "title": "Energy Spread of the Proton Beam in the Fermilab Booster at Its Injection Energy",
      "authors": [
        "C.M. Bhat",
        "B.E. Chase",
        "S. Chaurize",
        "F.G. Garcia",
        "W. Pellico",
        "K. Seiya",
        "T. Sullivan",
        "A.K. Triplett",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "We have measured the total energy spread (99% energy spread) of the Booster beam at its injection energy of 400 MeV by three different methods - 1) creating a notch of about 40 nsec wide in the beam immediately after multiple turn injection and measuring the slippage time required for high and low momentum particles for a grazing touch in line-charge distribution",
        "2) injecting partial turn beam and letting it to debunch",
        "and 3) comparing the beam profile monitor data with predictions from MAD simulations for the 400 MeV injection beam line. The measurements are repeated under varieties of conditions of RF systems in the ring and in the beam transfer line."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf113_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf113.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf113_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF113",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF116",
      "title": "PIP-II Status and Strategy",
      "authors": [
        "S.D. Holmes",
        "P. Derwent",
        "V.A. Lebedev",
        "C.S. Mishra",
        "D.V. Mitchell",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Proton Improvement Plan-II (PIP-II) is the centerpiece of Fermilab’s plan for upgrading the accelerator complex to establish the leading facility in the world for particle physics research based on intense proton beams. PIP-II has been developed to provide 1.2 MW of proton beam power at the start of operations of the Long Baseline Neutrino Experiment (LBNE)",
        "while simultaneously providing a platform for eventual extension of LBNE beam power to >2 MW and enabling future initiatives in rare processes research based on high duty factor/higher beam power operations. PIP-II is based on the construction of a new",
        "800 MeV",
        "superconducting linac",
        "augmented by improvements to the existing Booster",
        "Recycler",
        "and Main Injector complex. PIP-II is currently in the development stage with an R&D program underway targeting the front end and superconducting rf acceleration technologies. This paper will describe the status of the PIP-II conceptual development",
        "the associated technology R&D programs",
        "and the strategy for project implementation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf116_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf116.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf116_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF116",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF118",
      "title": "Fermilab Booster Injection Upgrade to 800 MeV for PIP-II",
      "authors": [
        "D.E. Johnson",
        "V.A. Lebedev",
        "I.L. Rakhno",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Fermilab is proposing to build an 800 MeV superconducting linac which will be used to inject H− ions into the existing Booster synchrotron as part of the proposed PIP-II project. The injection energy of the Booster will be raised from the current 400 MeV to 800 MeV. Transverse phase space painting will be required due to the small linac transverse emittance (emitring/emitlinac ~ 10) and low average linac current of 2 mA. The painting is also helpful with reduction of beam distributions resulting in a reduction of space charge effects. The injection will require approximately 300 turns corresponding to a ~ 0.5 ms injection time. A factor of seven increase in injected beam power (relative to present operation) requires an injection waste beam absorber. The paper describes the requirements for the injection insert",
        "itsdesign",
        "and plans for transverse painting."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf118_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf118.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf118_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF118",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF119",
      "title": "Transfer Line Design for PIP-II Project",
      "authors": [
        "A. Vivoli",
        "J. Hunt",
        "D.E. Johnsonpresenter",
        "V.A. Lebedev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The recent U.S. Particle Physics Community P5 report encouraged the realization of the Proton Improvement Plan II (PIP-II) project to support future neutrino programs in the United States. PIP-II includes the construction of a new 800 MeV H− Superconducting (SC) Linac at Fermilab and an upgrade of its current accelerator complex mostly focused on upgrades of the Booster and Main Injector synchrotrons. The SC Linac will initially operate in pulsed mode at 20 Hz. The design should be compatible with upgrades to CW mode and higher energy. A new transport line will connect the Linac to the Booster. This line has to provide adequate collimation and be instrumented for beam parameter measurements. In addition",
        "to support beam based Linac energy stabilization",
        "the line should provide a mechanism to redirect the beam from the dump to the Booster within one pulse. In this paper we present the design of the transport line developed to meet the above requirements. Tracking simulations results are reported to confirm the validity of the design."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf119_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf119.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf119_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF119",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF120",
      "title": "Design of the LBNF Beamline",
      "authors": [
        "V. Papadimitriou",
        "R. Andrews",
        "J. Hylen",
        "T.R. Kobilarcik",
        "G.E. Krafczyk",
        "A. Marchionni",
        "C.D. Moore",
        "P. Schlabach",
        "S. Tariq",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Long Baseline Neutrino Facility (LBNF) will utilize a beamline located at Fermilab to carry out a compelling research program in neutrino physics. The facility will aim a wide band neutrino beam toward underground detectors placed at the SURF Facility in South Dakota",
        "about 1",
        "300 km away. The main elements of the facility are a primary proton beamline and a neutrino beamline. The primary proton beam (60-120 GeV) will be extracted from the MI-10 section of Fermilab’s Main Injector. Neutrinos are produced after the protons hit a solid target and produce mesons which are subsequently focused by magnetic horns into a 204m long decay pipe where they decay into muons and neutrinos. The parameters of the facility were determined taking into account the physics goals",
        "spacial and radiological constraints and the experience gained by operating the NuMI facility at Fermilab. The initial proton beam power is expected to be 1.2 MW",
        "however the facility is designed to be upgradeable to 2.4 MW. We discuss here the design status and the associated challenges as well as plans for improvements before baselining the facility."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf120_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf120.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf120_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF120",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF121",
      "title": "Out of Time Beam Extinction in the Mu2e Experiment",
      "authors": [
        "E. Prebys",
        "S.J. Werkema",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Mu2e Experiment at Fermilab will search for the conversion of a muon to an electron in the field of an atomic nucleus with unprecedented sensitivity. The experiment requires a beam consisting of proton bunches approximately 200ns FW long",
        "separated by 1.7 microseconds",
        "with no out-of-time protons at the 10-10 fractional level. Satisfying this \"extinction\" requirement is very challenging. Simulations show that the formation of the bunches will result in an extinction of roughly 10-5. The remaining extinction will be accomplished by a system of resonant magnets and collimators",
        "configured such that only in-time beam is delivered to the experiment."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf121_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf121.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf121_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF121",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF122",
      "title": "The Status of MICE Step IV",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "INFN-Napoli",
        "Napoli",
        "Italy",
        "Muon (μ) beams of low emittance provide the basis for the intense",
        "well-characterised neutrino beams of the Neutrino Factory and for lepton-antilepton collisions at energies of up to several TeV at the Muon Collider. The International Muon Ionization Cooling Experiment (MICE) will demonstrate ionization cooling; the technique by which it is proposed to reduce the μ phase-space volume. In a cooling channel",
        "the μ beam traverses a material (the absorber) in which it looses energy",
        "then replaced longitudinally by RF cavities. The net effect is to reduce transverse emittance(transverse cooling). MICE is being constructed in a series of Steps. At Step IV",
        "MICE will study the properties of liquid hydrogen and lithium hydride that affect cooling. A solenoidal spectrometer will measure emittance up and downstream of the absorber vessel",
        "where a focusing coil will focus muons. The construction of Step IV at RAL is well advanced towards scheduled completion early in 2015. Its status will be described together with a summary of the performance of the principal components. Plans for the commissioning and operation and the Step IV measurement programme will be described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf122_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf122.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf122_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF122",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF123",
      "title": "Modeling Proton- and Light Ion-Induced Reactions at Low Energies in the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf123_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf123.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf123_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF123",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF124",
      "title": "Energy Deposition and Radiological Studies for the LBNF Hadron Absorber",
      "authors": [
        "I.L. Rakhno",
        "N.V. Mokhov",
        "I.S. Tropin",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "Results of optimization energy deposition and radiological studies performed for the LBNF hadron absorber system are presented. The model of the LBNF complex starting from the beam extraction from the Main Injector and primary beam line through the pion-production target",
        "focusing horns",
        "target chase",
        "decay channel",
        "hadron absorber system with its beam instrumentation and civil infrastructure – all with corresponding radiation shielding – was developed using the ROOT-based geometry option in the"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf124_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf124.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf124_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF124",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF125",
      "title": "MARS Tracking Simulations for the Mu2e Slow Extracted Proton Beam",
      "authors": [
        "V.P. Nagaslaev",
        "I.L. Rakhnopresenter",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "Particle tracking taking into account interactions with fields and materials is necessary for proper evaluation of the resonant extraction losses and geometry optimization for the extraction beam line. This paper describes the tracking simulations for the Mu2e Resonant Extraction and discusses the geometry choices made based on these simulations. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf125_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf125.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf125_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF125",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF126",
      "title": "PXIE Low Energy Beam Transport Commissioning",
      "authors": [
        "L.R. Prost",
        "M.L. Alvarez",
        "R. Andrews",
        "J.-P. Carneiro",
        "R.T.P. D'Arcy",
        "B.M. Hanna",
        "V.E. Scarpine",
        "A.V. Shemyakinpresenter",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "UCL",
        "London",
        "United Kingdom",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "The Proton Improvement Plan II at Fermilab is a program of upgrades to the injection complex [1]. At its core is the design and construction of a CW-compatible",
        "pulsed H− superconducting RF linac. To validate the concept of the front-end of such machine",
        "a test accelerator (a.k.a. PXIE) is under construction [2]. It includes a 10 mA DC",
        "30 keV H− ion source",
        "a 2m-long LEBT",
        "a 2.1 MeV CW RFQ",
        "followed by a MEBT that feeds the first of 2 cryomodules taking the beam energy to ~25 MeV",
        "and a High Energy Beam Transport section (HEBT) that takes the beam to a dump. The ion source and LEBT",
        "which includes 3 solenoids",
        "several clearing electrodes/collimators and a chopping system",
        "have been built",
        "installed",
        "and commissioned to full specification parameters. This report presents the outcome of our commissioning activities",
        "including phase-space measurements at the end of the beam line under various neutralization schemes obtained by changing the electrodes’ biases and chopper parameters."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf126_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf126.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf126_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF126",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF127",
      "title": "Scheme for a Low Energy Beam Transport with a Non-neutralized Section",
      "authors": [
        "A.V. Shemyakin",
        "L.R. Prost",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "A Low Energy Beam Transport (LEBT) line is the part of a modern ion accelerator between an ion source (IS) and a Radio-Frequency Quadrupole (RFQ). Typically",
        "it includes 1-3 solenoidal lenses for focusing and relies on transport dynamics with nearly complete beam space charge neutralization over the entire length of the LEBT. In this paper",
        "we discuss the possibility and rationality of imposing un-neutralized transport in the portion of the LEBT adjacent to the RFQ. For estimations",
        "we will use the parameters from PXIE",
        "a test accelerator presently being constructed at Fermilab."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf127_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf127.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf127_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF127",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF128",
      "title": "Accelerator Physics and Technology Research Toward Future Multi-MW Proton Accelerators",
      "authors": [
        "V.D. Shiltsev",
        "P. Hurh",
        "A. Romanenko",
        "A. Valishev",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Recent P5 report indicated the accelerator-based neutrino and rare decay physics research as a centrepiece of the US domestic HEP program. Operation",
        "upgrade and development of the accelerators for the near-term and longer-term particle physics program at the Intensity Frontier face formidable challenges. Here we discuss accelerator physics and technology research toward future multi-MW proton accelerators."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf128_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf128.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf128_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF128",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF129",
      "title": "The MICE Demonstration of Lonization Cooling",
      "authors": [
        "J. Pasternak",
        "C. Hunt",
        "J.-B. Lagrange",
        "K.R. Long",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "Imperial College of Science and Technology",
        "London",
        "United Kingdom",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "INFN-Napoli",
        "Napoli",
        "Italy",
        "R. Preece",
        "J.S. Tarrant",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [
        "Muon beams of low emittance provide the basis for the intense, well-characterised neutrino beams necessary to elucidate the physics of flavour at the Neutrino Factory and to provide lepton-antilepton collisions at energies of up to several TeV at the Muon Collider. The International Muon Ionization Cooling Experiment (MICE) will demonstrate ionization cooling, the technique by which it is proposed to reduce the phase-space volume occupied by the muon beam at such facilities. In an ionization-cooling channel, the muon beam passes through a material (the absorber) in which it loses energy. The energy lost is then replaced using RF cavities. The combined effect of energy loss and re-acceleration is to reduce the transverse emittance of the beam (transverse cooling). A major revision of the scope of the project was carried out over the summer of 2014. The revised project plan, which has received the formal endorsement of the international MICE Project Board and the international MICE Funding Agency Committee, will deliver a demonstration of ionization cooling by September 2017. In the revised configuration a central lithium-hydride absorber provides the cooling effect. The magnetic lattice is provided by the two superconducting focus coils and acceleration is provided by two 201 MHz single-cavity modules. The phase space of the muons entering and leaving the cooling cell will be measured by two solenoidal spectrometers. All the superconducting magnets for the ionization cooling demonstration are available at the Rutherford Appleton Laboratory and the first single-cavity prototype is under test in the MuCool Test Area at Fermilab. The design of the cooling demonstration experiment will be described together with a summary of the performance of each of its components. The cooling performance of the revised configuration will also be presented."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf129_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf129.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf129_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF129",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF131",
      "title": "Beam Studies for the Proton Improvement Plan (PIP) - Reducing Beam Loss at the Fermilab Booster",
      "authors": [
        "K. Seiya",
        "C.M. Bhat",
        "D.E. Johnson",
        "V.V. Kapin",
        "W. Pellico",
        "C.-Y. Tanpresenter",
        "R. Tesarek",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Fermilab Booster is being upgraded under the Proton Improvement Plan (PIP) to be capable of providing a proton flux of 2.25·1017 protons per hour. The intensity per cycle will remain at the present operational 4.3·1012 protons per pulse",
        "however the Booster beam cycle rate is going to be increased from 7.5 Hz to 15 Hz. One of the biggest challenges is to maintain the present beam loss power while the doubling the beam flux. Under PIP",
        "there has been a large effort in beam studies and simulations to better understand the mechanisms of the beam loss. The goal is to reduce it by half by correcting and controlling the beam dynamics and by improving operational systems through hardware upgrades. This paper is going to present the recent beam study results and status of the Booster operations."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf131_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf131.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf131_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF131",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF133",
      "title": "Textured-Powder BI-2212 Ag Wire Technology Development",
      "authors": [
        "P.M. McIntyre",
        "J.N. Kellamspresenter",
        "J.M. Vandergrifft",
        "Texas A&M University",
        "College Station",
        "Texas",
        "USA",
        "Oxford Instruments",
        "Semiconductor Systems",
        "Carteret",
        "New Jersey",
        "USA",
        "SupraMagnetics",
        "Inc.",
        "Plantsville",
        "Connecticut",
        "USA",
        "PSI",
        "Villigen",
        "Villigen",
        "Switzerland",
        "Progress is reported in developing textured-powder Bi-2212 cores as a new approach to Bi-2212/Ag wire tech-nology. The process builds upon earlier work in which Bi-2212 fine powder can be highly textured in its a-b plane orientation and fabricated into square-cross-section bars. The current work concerns an Enhanced Textured Powder (ETP) process",
        "in which silver nanopowder is homogeneously mixed with the Bi-2212 powder. We report studies of the effect of the addition on the phase dynamics near melt temperature. ETP cores are being prepared for compounding into a billet to fabricate multi-filament wire."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf133_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf133.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf133_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF133",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF134",
      "title": "Magnet Design and Synchrotron Damping Considerations for a 100 TeV Hadron Collider",
      "authors": [
        "P.M. McIntyre",
        "S. Assadi",
        "J. Gerity",
        "T.L. Mann",
        "A. Sattarov",
        "Texas A&M University",
        "College Station",
        "Texas",
        "USA",
        "DCI-UG",
        "León",
        "Mexico",
        "PSI",
        "Villigen",
        "Villigen",
        "Switzerland",
        "Hypertech Research",
        "Inc.",
        "Columbus",
        "USA"
      ],
      "institutions": [
        "A conceptual design is presented for a 100 TeV hadron collider based upon a 4.5 T NbTi cable-in-conduit dipole technology. It incorporates a side radiation channel to extract synchrotron radiation from the beam channel so that it does not produce limitations from heating on a beam liner or gas load limits on collider performance. Synchrotron damping can be used to support ‘bottom-up’ stacking to sustain maximum luminosity in the collisions."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf134_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf134.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf134_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF134",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF135",
      "title": "Optimization of Orbits, SRF Acceleration, and Focusing Lattice for a Strong-Focusing Cyclotron",
      "authors": [
        "K.E. Melconian",
        "S. Assadi",
        "J. Gerity",
        "J.N. Kellams",
        "P.M. McIntyre",
        "A. Sattarov",
        "Texas A&M University",
        "College Station",
        "Texas",
        "USA",
        "PSI",
        "Villigen",
        "Villigen",
        "Switzerland",
        "The strong-focusing cyclotron is a high-current proton/ion accelerator in which superconducting rf cavities are used to provide enough energy gain per turn to fully separate orbits",
        "and arc-shaped beam transport channels are located in the sector dipole aperture to provide strong focusing of all orbits. An optimization method has been devised by which the orbit separations can be adjusted to provide sufficient separation while maintaining isochronicity on all orbits. The transport optics of the FD lattice is also optimized to provide stable transport and to lock the betatron tunes to a favorable value over the full range of acceleration."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf135_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf135.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf135_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF135",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF136",
      "title": "Beam Dynamics Optimization of FRIB Folding Segment 1 with Single-type Re-buncher Cryomodule",
      "authors": [
        "Z.Q. He",
        "M. Ikegami",
        "F. Marti",
        "T. Xu",
        "Y. Zhang",
        "Q. Zhao",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "FRIB is using a charge stripper in folding segment 1 to increase the number of charge states of particles to enhance the acceleration efficiency. To control possible emittance growth after the charge stripper",
        "the 3-dimensional on-stripper beam size should be as small as possible. The original 2-cavity-HWR (HWR stands for half wave resonator) rebuncher cryomodule is responsible for the longitudinal focusing before stripper. In order to accept and transport the beam downstream to linac segment 2",
        "another kind of 3-cavity-QWR (QWR stands for quarter wave resonator) rebuncher cryomodule is baselined after the stripper. However",
        "two kinds of cryomodules would increase the cost in design",
        "therefore would be quite inefficient. In this paper",
        "the FRIB lattice with only single-type 4-cavity-QWR rebuncher cryomodule in folding segment 1 is discussed. Positions of lattice elements are adjusted to accommodate the new type of cryomodule. Beam dynamics is optimized to meet the on-stripper beam requirement. The lattice is then adjusted and rematches."
      ],
      "institutions": [
        "Funding: The work is supported by the U.S. National Science Foundation under Grant No. PHY-11-02511, and the U.S. Department of Energy Office of Science under Cooperative Agreement DE-SC0000661."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf136_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf136.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf136_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF136",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF137",
      "title": "Beam Dynamics Effects of High Order Multipoles in Non-Axisymmetric Superconducting RF Cavities",
      "authors": [
        "Z.Q. He",
        "J. Wei",
        "Y. Zhang",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Non-axisymmetric superconducting RF cavities have been widely used in accelerator facilities. Because of the geometry",
        "electric and magnetic multipole components",
        "including steering terms",
        "quadrupole terms",
        "and higher order terms",
        "would arise and have potential effects on beam dynamics. In this paper",
        "we start with a simple linac periodic structure to study the effects of higher order terms. The action is defined as a figure of merit to quantify the effects. After that",
        "we move to a more realistic situation of FRIB linac segment 1 (LS1). Multipole terms of quarter wave resonators (QWRs) are firstly calculated using multipole expansion scheme. Then",
        "the scheme is tested using the FRIB linac lattice with QWRs",
        "and the effects of higher order terms on FRIB LS1 are estimated."
      ],
      "institutions": [
        "Funding: The work is supported by the U.S. National Science Foundation under Grant No. PHY-11-02511, and the U.S. Department of Energy Office of Science under Cooperative Agreement DE-SC0000661."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf137_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf137.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf137_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF137",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF139",
      "title": "Nonlinear Optics of Solenoid Magnets",
      "authors": [
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Solenoid magnets are often employed for focusing in low energy beam transport lattices in the front-end of a machine. We derive a relatively simple analytic formula for the nonlinear angular focusing kick imparted to particles traversing the solenoid. Few approximations are made. The formula suggests that for beam transport",
        "little can be done to reduce nonlinearities in solenoid-type magnets other than take a simple design without abrupt changes as a function of axial coordinate and appropriately choose the aspect ratio (characteristic bore radius over axial length) of the magnet system and the beam filling factor within the aperture to limit nonlinear effects. Illustrative applications of the formula characterize nonlinear focusing effects in iron-free and iron type solenoid magnets."
      ],
      "institutions": [
        "Funding: Work supported by the U.S. Department of Energy Office of Science under Cooperative Agreement DE-SC0000661 and the National Science Foundation under Grant No. PHY-1102511."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf139_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf139.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf139_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF139",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF140",
      "title": "Unique Accelerator Integration Features of the Heavy Ion CW Driver Linac at FRIB",
      "authors": [
        "Y. Yamazaki",
        "N.K. Bultman",
        "A. Facco",
        "M. Ikegami",
        "F. Marti",
        "G. Pozdeyev",
        "J. Wei",
        "Y. Zhang",
        "Q. Zhao",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The FRIB driver linac is a front runner for the future high power hadron linacs",
        "making a full use of CW",
        "superconducting acceleration from very low β. Accelerator Driven Nuclear Waste Transmutation System (ADS)",
        "International Fusion Material Irradiation Facility (IFMIF)",
        "Project-X type proton accelerators for high energy physics and others may utilize the technologies developed for the design",
        "construction",
        "commissioning and power ramp up of the FRIB linac. Although each technology has been already well developed individually (except for charge stripper)",
        "their integration is another challenge. In addition",
        "extremely high Bragg peak of uranium beams (several thousand times as high as that of proton beams) gives rise to one of the biggest challenges in many aspects. This report summarizes these challenges and their mitigations",
        "emphasizing the commonly overlooked features."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf140_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf140.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf140_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF140",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF141",
      "title": "Design of a Compact All-Permanent Magnet ECR Ion Source Injector for ReA at MSU NSCL",
      "authors": [
        "A.N. Pham",
        "P. Glennon",
        "A. Lajoie",
        "D. Lawton",
        "D. Leitner",
        "G. Machicoane",
        "J. Ottarson",
        "M. Portillo",
        "J. Wenstrom",
        "NSCL",
        "East Lansing",
        "Michigan",
        "USA",
        "The design of a compact all-permanent magnet electron cyclotron resonance (ECR) ion source injector for the ReAccelerator Facility (ReA) at the Michigan State University (MSU) National Superconducting Cyclotron Laboratory (NSCL) is currently being carried out. The ECR ion source injector will augment the electron beam ion trap (EBIT) charge breeder as an off-line stable ion beam injector for the ReA linac. The objective of the ECR ion source injector will be to provide CW beams of heavy ions from hydrogen to masses up to 136Xe within the ReA charge-to-mass ratio (Q/A) operational range from 0.2 to 0.5. The ECR ion source will be mounted on a high-voltage platform that can be adjusted to provide the required 12 keV/u injection energy into a room temperature radio-frequency quadrupole (RFQ) for further acceleration. The beam line consists of a 30 kV tetrode extraction system",
        "mass analyzing section",
        "and optical matching section for injection into the existing ReA Low Energy Beam Transport (LEBT) line. The design of the ECR ion source and the associated beam line are discussed."
      ],
      "institutions": [
        "Funding: Work supported by Michigan State University and the National Science Foundation Grant PHYS-1102511."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf141_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf141.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf141_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF141",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF142",
      "title": "High Intensity Source of He Negative Ions",
      "authors": [
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "JLab",
        "Newport News",
        "Virginia",
        "USA"
      ],
      "institutions": [
        "He- ion can be formed by an attachment of additional electron to the excited metastable 23S1 He atom. Electron affinity in this metastable He- ion is A=0.08 eV with excitation energy 19.8 eV. Production of He- ions is difficult because the formation probability is very small but destruction probability is very high. Efficiency of He- ions generation was improved by using of an alkali vapor targets for charge exchange He- sources. Low current He- beams were used in tandem accelerators for research and technological diagnostics (Rutherford scattering). The development of high-intensity high-brightness arc-discharge ion sources at the Budker Institute of Nuclear Physics (BINP) has opened up an opportunity for efficient production of more intense and more brighter He- beam which can be used for alpha particles diagnostics in a fusion plasma and for realization of a new type of a polarized 3He− ion source. This report discusses the high intense He- beams production and a polarized 3He− ion source based on the large difference of extra-electron auto-detachment lifetimes of the different 3He− ion hyperfine states."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf142_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf142.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf142_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF142",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF143",
      "title": "Saddle Antenna RF Ion Sources for Efficient Positive and Negative Ions Production",
      "authors": [
        "V.G. Dudnikov",
        "R.P. Johnson",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "B. Han",
        "S.N. Murray",
        "T.R. Pennisi",
        "C. Piller",
        "M. Santana",
        "M.P. Stockli",
        "R.F. Welton",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Existing RF Surface Plasma Sources (SPS) for accelerators have specific efficiencies for H+ and H− ion generation ~3-5 mA/cm2 kW",
        "where about 50 kW of RF power is typically needed for 50 mA beam current production. The Saddle Antenna (SA) SPS described here was developed to improve H− ion production efficiency",
        "reliability and availability. In SA RF ion source the efficiency of positive ion generation in the plasma has been improved to 200 mA/cm2 kW. After cesiation",
        "the current of negative ions to the collector was increased from 1 mA to 10 mA with RF power ~1.5 kW in the plasma (6 mm diameter emission aperture) and up to 30 mA with ~4 kW RF. Continuous wave (CW) operation of the SA SPS has been tested on the test stand. The general design of the CW SA SPS is based on the pulsed version. Some modifications were made to improve the cooling and cesiation stability. CW operation with negative ion extraction was tested with RF power up to 1.8 kW from the generator (~1.2 kW in the plasma) with production up to Ic=7 mA. Long term operation was tested with 1.2 kW from the RF generator (~0.8 kW in the plasma) with production of Ic=5 mA",
        "Iex ~15 mA (Uex=8 kV",
        "Uc=14 kV)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf143_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf143.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf143_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF143",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF144",
      "title": "Analysis of FEL-based CeC Amplification at High Gain Limit",
      "authors": [
        "G. Wang",
        "Y.C. Jing",
        "V. Litvinenko",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "An analysis of CeC amplifier based on 1D FEL theory was previously performed with exact solution of the dispersion relation",
        "assuming electrons having Lorentzian energy distribution *. At high gain limit",
        "the asymptotic behavior of the FEL amplifier can be better understood by Taylor expanding the exact solution of the dispersion relation with respect to the detuning parameter **. In this work",
        "we make quadratic expansion of the dispersion relation for Lorentzian energy distribution * *** and investigate how longitudinal space charge and electrons’ energy spread affect the FEL amplification process.",
        "* G. Wang",
        "PhD Thesis",
        "SUNY Stony Brook",
        "2008.  ** G. Stupakov",
        "M.S. Zolotorev",
        "Comment on “Coherent Electron Cooling”",
        "PRL 110 (2013) 269503. *** E.L. Saldin",
        "E.A. Schneidmiller",
        "M.V. Yurkov",
        "The Physics of Free Electron Lasers",
        "1999."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf144_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf144.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf144_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF144",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF146",
      "title": "Spin Coherence Time Lengthening of a Polarized Deuteron Beam Using Sextupole FieldsFields",
      "authors": [
        "UNIFE",
        "Ferrara",
        "Italy",
        "The measurement of a non-zero electric dipole moment (EDM) aligned along the spin of sub-atomic particles would probe new physics beyond the standard model. It has been proposed to search for the EDM of charged particles using a storage ring and a longitudinally polarized beam. The EDM signal would be a rotation of the polarization from the horizontal plane toward the vertical direction as a consequence of the radial electric field always present in the particle frame. This experiment requires ring conditions that can ensure a lifetime of the in-plane polarization (spin coherence time",
        "SCT) up to 1000 s. At the COoler SYnchrotron (COSY) located at the Forschungszentrum Jülich",
        "the JEDI collaboration has begun to examine the effects of emittance and momentum spread on the SCT of a polarized deuteron beam at 0.97 GeV/c. The set of data presented here shows how second-order effects from emittance and momentum spread of the beam affect the lifetime of the horizontal polarization of a bunched beam. It has been observed that sextupole fields can correct for depolarizing sources and increase the spin coherence time up to hundreds of seconds while setting the chromaticities equal to zero."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf146_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf146.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf146_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF146",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF147",
      "title": "Increasing the Beam Brightness of a Duoplasmatron Proton Ion Source",
      "authors": [
        "Y.K. Batygin",
        "I.N. Draganic",
        "C.M. Fortgang",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "The LANSCE accelerator facility operates with two independent ion injectors for H+ and H− particle beams. The H+ ion beam is formed using a duoplasmatron source followed by a 750 keV Cockroft-Walton accelerating column. Formation of an optimal plasma meniscus is an important feature for minimizing beam emittance and maximizing beam brightness. An experimental study was performed to determine optimal conditions of extracted H+ beam for maximizing beam brightness. Study was based on measurements of beam emittance versus variable beam current and extraction voltage. Measurements yielded 0.52 as the best ratio of beam perveance to Child - Langmuir perveance for maximizing beam brightness. As a result of optimization",
        "beam brightness was increased by a factor of 2."
      ],
      "institutions": [
        "Funding: Work supported by the United States Department of Energy, National Nuclear Security Agency, under contract DE-AC52-06NA25396"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf147_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf147.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf147_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF147",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF148",
      "title": "LANSCE H+ RFQ Status",
      "authors": [
        "R.W. Garnett",
        "Y.K. Batygin",
        "C.A. Chapman",
        "I.N. Draganic",
        "C.M. Fortgang",
        "S.S. Kurennoy",
        "R.C. McCrady",
        "J.F. O'Hara",
        "E.R. Olivas",
        "L. Rybarcyk",
        "H.R. Salazar",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Kress GmbH",
        "Biebergemuend",
        "Germany",
        "B. Koubek",
        "A. Schempp",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "The LANSCE linear accelerator at Los Alamos National Laboratory provides H− and H+ beams to several user facilities that support Isotope Production",
        "NNSA Stockpile Stewardship",
        "and Basic Energy Science programs. These beams are initially accelerated to 750 keV using Cockcroft-Walton (CW) based injectors that have been in operation for over 37 years. To reduce long-term operational risks and to realize future beam performance goals for LANSCE we are completing fabrication of a 4-rod Radio-Frequency Quadrupole (RFQ) and design of an associated beam transport line that together will eventually become the modern injector replacement for the existing obsolete H+ injector system. A similar H− system is also planned for future implementation. An update on the status and progress of the project will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf148_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf148.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf148_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF148",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF149",
      "title": "Electromagnetic Modeling of 4-Rod RFQ Tuning",
      "authors": [
        "S.S. Kurennoy",
        "L. Rybarcyk",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Modern codes make possible detailed 3D electromagnetic modeling of RFQ accelerators. We have recently analyzed two 201.25-MHz 4-rod RFQs – one commissioned at FNAL and a new design for LANL – with CST Studio using imported manufacturer CAD files*. The RFQ electromagnetic analysis with MicroWave Studio (MWS) was followed by beam dynamics modeling with Particle Studio as well as other multi-particle codes. Here we apply a similar approach to study the process of RFQ tuning in 3D CST models. In particular",
        "the results will be used to better understand tuning the voltage flatness along the new LANL 4-rod RFQ.",
        "* S.S. Kurennoy"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf149_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf149.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf149_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF149",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPF150",
      "title": "D Electromagnetic and Beam Dynamics Modeling of the LANSCE Drift-Tube Linac",
      "authors": [
        "S.S. Kurennoy",
        "Y.K. Batygin",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "The LANSCE drift-tube linac (DTL) accelerates the proton or H− beam to 100 MeV. It consists of four tanks containing tens of drift tubes and post-couplers; for example",
        "tank 2 is almost 20 m long and has 66 cells. We have developed 3D models of full tanks [1] in the DTL with CST Studio to accurately calculate the tank modes",
        "their sensitivity to post-coupler positions and tilts",
        "tuner effects",
        "and RF-coupler influence. Electromagnetic analysis of the DTL tank models is performed using MicroWave Studio (MWS). The full-tank analysis allows tuning the field profile of the operating mode and adjusting the frequencies of the neighboring modes within a realistic CST model. Beam dynamics is modeled with Particle Studio for bunch trains with realistic initial beam distributions using the MWS-calculated and tuned RF fields and quadrupole magnetic fields to determine the output beam parameters and locations of particle losses.",
        "* S.S. Kurennoy"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thpf150_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thpf150.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thpf150_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THPF150",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 125,
  "scrape_time": "2025-10-10 20:34:58"
}