{
  "session_info": {
    "id": "MOIXB",
    "name": "MOIXB - Monday Plenary",
    "url": "https://proceedings.jacow.org/IBIC2014/html/moixb.htm"
  },
  "papers": [
    {
      "paper_id": "MOIXB1",
      "title": "Welcome to the 2014 International Beam Instrumentation Conference",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "The chairperson welcomes participants to Monterey for the 3rd IBIC and opens the conference.",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/moixb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/moixb1.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/moixb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOIXB1",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOIXB2",
      "title": "Technical Developments in Support of Accelerator-Based Science at SLAC",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA"
      ],
      "institutions": [
        "Recent recommendations from the Basic Energy Science Advisory Committee (BESAC) and the Particle Physics Project Prioritization Panel (P5) will have a significant long-term impact on accelerator development at SLAC. Most importantly, in summer 2013 BESAC recommended the number of FEL photon beam-lines in the 0.2 to 4 KeV range be increased substantially. This recommendation resulted in the proposal (LCLS-II), now accepted, to build a new 4 GeV CW superconducting linac in the same housing as the existing SLAC LCLS linac. The LCLS-II project involves contributions from several US partner-labs and is now in full-swing. BESAC also supported fully integrating the two FEL-linacs so that photon beam-line equipment could be used for either the high energy low-repetition rate beam or the moderate energy very high-repetition rate beam. The P5 report, on the other hand, strongly supported US involvement in the proposed International Linear Collider development, based in Japan. Both projects rely on the L-band superconducting RF technology under development for the last 25 years. The talk will report on recent technical developments and describe plans for future work."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/moixb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/moixb2.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/moixb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOIXB2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOIXB3",
      "title": "Superconducting Spectrometers for X-ray Beamline Applications and Cosmology",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Superconducting detectors have grown in scale and sensitivity",
        "and now can greatly improve both measurements of the cosmic microwave background and x-ray spectroscopy at x-ray light sources. Superconducting x-ray spectrometers provide high spectral resolution along with high photon-collection efficiency at x-ray light sources (more than two orders of magnitude higher than provided by gratings) and simultaneous measurement of the full spectrum in each pixel. They operate by measuring a temperature pulse from the absorption of individual x-rays. The temperature pulse is sensed by a superconducting film and amplified by a superconducting amplifier. The development of multiplexed superconducting amplifiers has enabled the construction of arrays of pixels. Kilopixel x-ray calorimeter arrays are planned for both synchrotron and free-electron-laser beamlines",
        "and technology development is underway to scale to megapixel arrays",
        "which would allow nearly 2*pi solid angle coverage and extremely high count rates. Similarly",
        "the temperature and polarization of the cosmic microwave background (CMB) can be determined by measuring a temperature change induced by cosmic microwave background photons from a millimeter-wave telescope. The BICEP-2 experiment at the South Pole recently reported the most sensitive measurement to date of the polarization of the CMB with superconducting detectors",
        "and the first detection of a curl",
        "or \"B-mode\" pattern in the polarization of the CMB at degree angular scales. Primordial B-mode polarization is the distinctive signature of gravitational waves from inflation at the energy scale of Grand Unification",
        "but additional non-primordial sources of B-mode polarization also exist",
        "including polarized dust and gravitational lensing. I will describe the role of superconducting detectors in x-ray light source measurements",
        "in the BICEP-2 experiment",
        "and also their use in efforts to further understand B-mode signals in the CMB."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/moixb3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/moixb3.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/moixb3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOIXB3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:55:35"
}