{
  "session_info": {
    "id": "MOOCA",
    "name": "MOOCA - Contributed Oral Presentations, Accelerator Technology",
    "url": "https://proceedings.jacow.org/ipac2017/html/mooca.htm"
  },
  "papers": [
    {
      "paper_id": "MOOCA1",
      "title": "High Efficiency Klystrons Using the COM Bunching Technique",
      "authors": [
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "Moscow University of Finance & Law",
        "Moscow",
        "Russia",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "L-3",
        "Williamsport",
        "Pennsylvania",
        "USA",
        "CERN",
        "Geneva",
        "Switzerland",
        "Future large-scale particle accelerators",
        "for example",
        "the Future Circular Collider (FCC)",
        "the Compact Linear Collider (CLIC) and the International Linear Collider (ILC)",
        "will require significant RF drive power on the order of 100 MW. Thus",
        "an RF source with high efficiency is preferable to minimise the overall power required. Klystrons represent an attractive RF source",
        "with the current state of the art operating at efficiencies of up to 70%. Such devices feature monotonic bunching",
        "where at the output cavity",
        "a number of electrons will not be in the main bunch",
        "and instead will be present in the anti-bunch",
        "and therefore not contributing to the output power. Therefore",
        "novel bunching methods",
        "such as the Core Oscillation Method (COM)",
        "are worthy of investigation. By allowing the core of the electron beam to bunch and de-bunch between successive cavities",
        "the number of electrons contained in the final bunch can increase",
        "and therefore improve the efficiency of the device. Numerical simulation of klystrons featuring COM will be presented",
        "with efficiencies of up to 85% being predicted thus far."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/mooca1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/mooca1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/mooca1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-MOOCA1",
      "page_number": "37",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOCA2",
      "title": "First Results From New Single-Cell Nb3Sn Cavities Coated at Cornell University",
      "authors": [
        "D.L. Hall",
        "J.J. Kaufman",
        "M. Liepe",
        "R.D. Porter",
        "J. Sears",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Cavities coated with Nb3Sn at Cornell University demonstrate quality factors of >1010 at 4.2 K",
        "outperforming equivalent niobium cavities by a factor of >30 at these bath temperatures. These quality factors have been maintained up to fields of 17-18 MV/m without significant Q-slope. Recently",
        "new single-cell cavities have been added to the Cornell Nb3Sn programme in an effort to improve statistics and allow further exploration of the available parameter space. In this paper we report on the first results of these new cavities",
        "as well as the latest performance from other cavities already in use on the programme. Furthermore",
        "continuing work to optimise the coating procedure is reported on",
        "and the latest understanding of the ideal coating profile is discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/mooca2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/mooca2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/mooca2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-MOOCA2",
      "page_number": "40",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOCA3",
      "title": "Amorphous Carbon Thin Film Coating of the SPS Beamline: Evaluation of the First Coating Implementation",
      "authors": [
        "M. Van Gompel",
        "P. Chiggiato",
        "P. Costa Pinto",
        "P. Cruikshank",
        "C. Pasquino",
        "J. Perez Espinos",
        "A. Sapountzis",
        "M. Taborelli",
        "W. Vollenberg",
        "CERN",
        "Geneva",
        "Switzerland",
        "As part of the LHC Injector Upgrade (LIU) project",
        "the Super Proton Synchrotron (SPS) must be upgraded in order to inject in the LHC 25 ns bunch spaced beams of higher intensity. To mitigate the Electron Multipacting (EM) phenomenon in the SPS",
        "CERN developed thin film carbon coatings with a low Secondary Electron Yield (SEY). The development went from coating small samples",
        "up to coating of 6 m long vacuum chambers directly installed in the magnets. To deposit the low SEY amorphous carbon (aC) film on the vacuum chamber inner wall of SPS ring components",
        "a modular hollow cathode train was designed. The minimization of the logistical impact requires a strategy combining in-situ and ex-situ coating",
        "depending on the type of components. To validate the implementation strategy of the aC thin films and the in-situ coating process along the 7 km long SPS beamline",
        "approximately 2 cells of B-type bending dipoles and 9 focussing quadrupoles are foreseen to be treated with the aC coating during the Extended Year End Technical Stop (EYETS) 2016-2017. We will discuss the coating technique and evaluate both the implementation process and the resulting coating performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/mooca3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/mooca3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/mooca3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-MOOCA3",
      "page_number": "44",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:42:36"
}