{
  "session_info": {
    "id": "WEPBA",
    "name": "WEPBA - Poster Session",
    "url": "https://proceedings.jacow.org/PAC2013/html/wepba.htm"
  },
  "papers": [
    {
      "paper_id": "WEPBA01",
      "title": "Noise Reduction using Filters on Turn-by-Turn LHC Orbits to Obtain Magnetic Errors with the Action and Phase Jump Analysis Method",
      "authors": [
        "A.C. Garcia-Bonilla",
        "J.F. Cardona",
        "UNAL",
        "Bogota D.C",
        "Colombia",
        "The Action and Phase Jump (APJ) analysis had been successfully used to obtain magnetic errors in RHIC from orbit data",
        "and preliminary studies using this method has been done in the LHC. Analyses in the LHC show significantly higher noise levels than for the RHIC case due to a bigger bandwidth of the LHC BPMs. Efforts to reduce the noise level like taking advantage of the thousands of turns provided by the LHC BPM system (in contrast with the few orbits used in RHIC) have been done",
        "but there is still a possibility to reduce it further by using filters. In this work",
        "we describe the design of a band-pass filter on LHC simulated orbits. Normal and skew quadrupole errors (A1 and B1) are introduced in the lattice and recovered after multiple turns of the particles",
        "using the APJ analysis. Gaussian and uniform noise were added to the orbits and the band-pass filter was applied to them. Results show that the band-pass filter around the accelerator tunes reduces significantly the uncertainty on the determination of A1 and B1",
        "when the filter is optimized by changing its bandwidth. This optimization as well as other trials like the use of a low-pass filter are presented in this work."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba01.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA01",
      "page_number": "883",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA02",
      "title": "Possible Observation of Transverse Laser Cooled Ultimate Cold Ion Beam in S-LSR*",
      "authors": [
        "Kyoto University",
        "Kyoto",
        "Japan",
        "M. Nakao",
        "A. Noda",
        "T. Shirai",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "Gunma University",
        "Heavy-Ion Medical Research Center",
        "Maebashi-Gunma",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "JAEA/TARRI",
        "Gunma-ken",
        "Japan",
        "Transverse laser cooling is pursued at an ion storage/cooler ring",
        "S-LSR",
        "Kyoto University. An RF bunched Mg+ beam was cooled transversely through synchro-betatron resonance coupling by a co-propagating laser. We investigated peaks of the synchrotron oscillation spectroscopically so that we can observe it stably. Oscillation signals from a parallel-plate pickup were observed by a spectrum analyzer. We also observed the coherent synchrotron modes. As the beam temperature decreases",
        "the ion beam would be in space charge limited region. According to the computer simulation",
        "in the case the beam turns to be space charge limited",
        "the disappearance of peaks of the synchrotron oscillation is expected. We would like to propose a capability of detecting space charge limited region by observation of such a frozen synchrotron oscillation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba02.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA02",
      "page_number": "886",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA04",
      "title": "Luminosity Estimation and Beam Phase Space Analysis at VEPP-2000",
      "authors": [
        "A.L. Romanov",
        "I. Koop",
        "E. Perevedentsev",
        "D.B. Shwartz",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Luminosity is the main output of colliders",
        "so it is very important to measure it with speed and accuracy. VEPP-2000 has 16 beam profile monitors (BPM) which use CCD-cameras to register synchrotron light in the visible spectrum. Two luminosity estimation methods are presented",
        "both based on beam size analysis. Although the luminosity measurements by particle detectors CMD-3 and SND are slow and have low statistical accuracy for low beam currents",
        "their data can be used to test new faster methods. Additionally",
        "an attempt of the phase space tomography is presented using the simulated BPM measurements of the particle distribution in a strongly non-gaussian beam."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba04.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA04",
      "page_number": "889",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA05",
      "title": "Combining Multiple BPM Measurements for Precession AC Dipole Bump Closure",
      "authors": [
        "P. Oddo",
        "M. Bai",
        "W.C. Dawson",
        "J. Kewisch",
        "Y. Makdisi",
        "C. Pai",
        "P.H. Pile",
        "T. Roser",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "For the RHIC spin flipper to achieve a rotating field",
        "it requires operating five AC dipoles as a pair of closed orbit bumps. One key requirement is to minimize the remnant AC dipole driven betatron oscillation outside of the spin flipper by 50dB. In the past",
        "due to its inherent sensitivity",
        "a single pickup with a direct-diode detector (3D) and dynamic signal analyzer (DSA) were used to measure bump closure by measuring the remnant oscillations. This however proved to be inadequate",
        "as the betatron phase advance between the AC dipoles is non-zero. A method of combining multiple BPMs into a sensitive measure of bump closure has been developed and will be tested during RHIC polarized proton operation in 2013. This technique as well as the experimental results will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba05.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA05",
      "page_number": "892",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA06",
      "title": "Stripline Beam Impedance",
      "authors": [
        "A. Blednykh",
        "W.X. Cheng",
        "S. Krinsky",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "We discuss Lambertson and Shafer formalisms for the longitudinal and transverse beam impedances of a stripline. The required characteristic impedances and the geometric factors are determined by the solution of Laplace’s equation in 2-dimensions",
        "which we find using the 2-D POISSON code. Lambertson’s equations are compared with numerical results obtained using the 3-D electromagnetic simulation code GdfidL. Good agreement is found at low frequencies. The results differ at high frequencies",
        "since the analytic results do not take into account the existence of higher-order modes (HOM’s) in structures with and without smooth transitions. We then present a discussion of the stripline kicker being built for the bunch-by-bunch transverse feedback system for the NSLS-II storage ring."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba06.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA06",
      "page_number": "895",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA07",
      "title": "Longitudinal Wakefield for an Axisymmetric Collimator",
      "authors": [
        "A. Blednykh",
        "S. Krinsky",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "We consider the longitudinal point-charge wakefield",
        "w(s)",
        "for an axisymmetric collimator having inner radius b",
        "outer radius d",
        "inner length g and taper length L. The taper angle <image011.png> is defined by <image012.png> . Using the electromagnetic simulation code ECHO",
        "we explore the dependence of the wakefield on a collimator’s geometric parameters over a wide range of profiles: from small-angle tapers to step-function transitions. The point-charge wakefield is determined using an approximation introduced by Podobedov and Stupakov. We have found it useful to exhibit the wakefield as a function of the scaled variable<image013.png>. For small taper angles",
        "our results illustrate the satisfaction of the longitudinal scaling found by Stupakov",
        "Bane and Zagorodnov; and for larger taper angles",
        "the breaking of this longitudinal scaling is clearly depicted. The use of the scaled variable <image014.png> turns out to be especially well suited to describing the wakefield for a collimator with step-function profile <image015.png>."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba07.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA07",
      "page_number": "898",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA08",
      "title": "Wake Fields due to Wall Roughness for Realistic Surfaces",
      "authors": [
        "A.V. Fedotov",
        "I. Pinayev",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "Wake fields due to the wall roughness of the vacuum chamber can catch up to the bunch causing energy spread and emittance growth. Several theoretical models were developed in the past which showed rather different importance of this effect. Some models suggest that wake field due to the wall roughness can be minimized if the vacuum chamber surface can be characterized by a large aspect ratio of the surface roughness (characteristic length to the height of surface bumps). To explore these effects several surfaces were measured * and direct numerical simulations were performed for such realistic surfaces. Here we discuss results of such direct simulations for real surface data and compare them with expectations based on analytic models. * Surface measurements used in these studies were performed by P. Takacs from the Instrumentation Division of BNL.",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba08.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA08",
      "page_number": "901",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA09",
      "title": "Changes in Electron Cloud Density with Beam Conditioning at CesrTA",
      "authors": [
        "J.P. Sikora",
        "J.A. Crittenden",
        "D.O. Duggins",
        "Y. Li",
        "X. Liu",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "We compare measurements of electron cloud (EC) buildup in uncoated and TiN-coated aluminum vacuum chambers as a function of integrated beam dose up to 1140 amp-hours. The EC density in newly installed bare aluminum chambers increases with beam dose",
        "while the EC density in the TiN-coated chambers decreases with dose under the same beam conditions. Several techniques are used to monitor EC buildup. These include shielded pickups that measure the flux of cloud electrons onto the beampipe wall",
        "and a TE wave resonance technique that measures the EC density within the volume of the beam-pipe. These measurements were made at the Cornell Electron Storage Ring",
        "which has been reconfigured as a test accelerator CesrTA",
        "providing positron and electron beams with energies ranging from 2 GeV to 5 GeV and a variety of bunch train configurations."
      ],
      "institutions": [
        "Funding: This work is supported by the US National Science Foundation PHY-0734867, PHY-1002467, and the US Department of Energy DE-FC02-08ER41538, DE-SC0006505."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba09.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA09",
      "page_number": "904",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA12",
      "title": "D Toroidal Field Multipoles for Curved Accelerator Magnets",
      "authors": [
        "L.N. Brouwer",
        "S. Caspi",
        "D. Robin",
        "W. Wan",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Curved magnets producing continuously rotating field multipoles along the length of the bend can provide strong and continuous transverse focusing",
        "making them of interest for accelerator systems such as compact ion beam gantries and synchrotron light sources. Evaluating the utility of such rotating multipole systems requires an accurate description of field behavior for beam physics calculations. This paper presents a helical scalar potential solution in 3D toroidal harmonics relevant to boundary conditions on the surface of a torus. The resulting fields are evaluated for a curved helical quadrupole channel to illustrate field rotation and the effect of magnet curvature."
      ],
      "institutions": [
        "Funding: Director, Office of Science, High Energy Physics, and U.S. Department of Energy under contract No. DE-AC02-05CH11231 National Science Foundation under grant No. DGE 1106400."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba12.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA12",
      "page_number": "907",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA13",
      "title": "Retrieval of Effective Parameters of Metamaterials for Accelerator and Vacuum Electron Device Applications",
      "authors": [
        "Z. Duan",
        "J.S. Hummelt",
        "M.A. Shapiro",
        "R.J. Temkin",
        "MIT/PSFC",
        "Cambridge",
        "Massachusetts",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba13.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA13",
      "page_number": "910",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA14",
      "title": "Simulation of Wakefields from an Electron Bunch in a Metamaterial Waveguide",
      "authors": [
        "M.A. Shapiro",
        "J.S. Hummelt",
        "B.J. Munroe",
        "R.J. Temkin",
        "MIT/PSFC",
        "Cambridge",
        "Massachusetts",
        "USA",
        "MIT",
        "Cambridge",
        "Massachusetts",
        "USA",
        "A metamaterial waveguide is proposed for application in a linear accelerator. The waveguide walls are made of a metamaterial that includes complementary split-ring resonators. In such a metamaterial waveguide",
        "the TM-like mode exists and can be excited by the electron bunch. A complementary split-ring resonator is formed by slots in a metallic plate",
        "therefore",
        "this metamaterial waveguide is easy to build. This makes it possible to use in high frequency linear accelerators. The metamaterial waveguide is coupled to single mode rectangular waveguides which can be connected to a microwave network for coupling power into or out of the waveguide. One attractive application of the proposed metamaterial waveguide is in electron beam bunch diagnostics. The metamaterial waveguide is designed using HFSS. The wakefield simulations are carried out using the CST Particle Studio code. The simulations are done for a single bunch as well as for a train of bunches to model the experiment. In this experiment",
        "it is proposed to use the beam line of the Haimson Research Corporation/MIT linear accelerator operating at the frequency of 17.14 GHz."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba14.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA14",
      "page_number": "913",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA15",
      "title": "Ribbon Electron Beam Source for Bunched Beam Profile Monitor and Tomography",
      "authors": [
        "V.G. Dudnikov",
        "A. Dudas",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Ribbon electron beam source with a strip cathode has been designed",
        "fabricated and tested. Image of the ribbon electron beam with width up to 15 cm has been registered on the luminescent screen. This ribbon beam can be used for the large proton bunch profile monitoring in the Spallation Neutron Source (SNS) proton storage ring (PSR). Advanced beam diagnostics are essential for high performance accelerator beam production and for reliable accelerator operation. It is important to have noninvasive diagnostics which can be used continuously with intense beams of accelerated particles. In a novel proposed device for realization of electron probe tomography a strip cathode is used for ribbon electron beam formation instead of a scanning of pencil beam used in the previous electron probe bunch profile monitors. With this device it is possible to develop almost ideal tomography diagnostics of bunches in linear accelerators and in circular accelerators and storage rings."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba15.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA15",
      "page_number": "916",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA16",
      "title": "Possible Experiments on Wave Function Localization Due to Compton Scattering",
      "authors": [
        "V.V. Danilov",
        "A.V. Aleksandrov",
        "J. Galambos",
        "T.V. Gorlov",
        "Y. Liu",
        "A.P. Shishlo",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Fermilab",
        "Batavia",
        "USA",
        "The reduction of a particle’s wave function in the process of radiation or light scattering is a longstanding problem. Its solution will give a clue on processes that form",
        "for example",
        "wave functions of electrons constantly emitting synchrotron radiation quanta in storage rings. On a more global scale",
        "it may shed light on wave function collapse due to the process of measurement. In this paper we consider various experimental options using Fermilab electron beams and a possible electron beam from the SNS linac and lasers to detect electron wave function change due to Compton scattering."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba16.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA16",
      "page_number": "919",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA17",
      "title": "Measurement of Non-Linear Insert Magnets",
      "authors": [
        "F.H. O'Shea",
        "R.B. Agustsson",
        "A.Y. Murokh",
        "E. Spranza",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "S. Nagaitsev",
        "A. Valishev",
        "Fermilab",
        "Batavia",
        "USA",
        "Fermilab's Integrable Optics Test Accelerator (IOTA) is an electron storage ring designed for testing advanced accelerator physics concepts",
        "including implementation of nonlinear integrable beam optics and experiments on optical stochastic cooling. In this report we describe the contribution of RadiaBeam Technologies to the IOTA project which includes nonlinear magnet engineering",
        "production and measurement."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba17.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA17",
      "page_number": "922",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA18",
      "title": "Performance of Planar Radiator in the Radiabeam-IAC Experiment",
      "authors": [
        "A.V. Smirnov",
        "R.B. Agustsson",
        "S. Boucher",
        "J.J. Hartzell",
        "S. Storms",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "IAC",
        "Pocatello",
        "IDAHO",
        "USA",
        "Planar gratings structure for generation of mm-sub-mm wavelength long-range wakefields is analyzed. The rugged",
        "side-open",
        "slow wave structure can sustain substantial beam loading including long multi-bunch trains up to CW operation. Electromagnetic performance of the structure is characterized numerically vs. experiment with emphasis to application to flat beams. It is shown that such an electrically wide",
        "wavelength-gap structure can operate at significantly reduced tolerances whereas substantial flatness of the wakefield can be obtained at essentially non-flat eigenmode profile."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba18.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA18",
      "page_number": "925",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA19",
      "title": "Wakefield Calculations for Septum Magnet in LCLS-II",
      "authors": [
        "K.L.F. Bane",
        "T.O. Raubenheimer",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "In LCLS-II",
        "a fast kicker and Lambertson-type septum magnet will be installed just upstream of the undulator region",
        "in order to allow electron bunches to be directed to either of two undulators. In the envisioned scenario both undulators receive bunches with the same current profile and the same energy which will be between 7–13.5 GeV. The kicker is used to separate the two trajectories vertically in the septum by 7 mm and thus the high current beams travel close to septum metallic walls and the short-range resistive wall wakefields can become a limitation. This paper will analyze the impact of the longitudinal and transverse wakefields on the LCLS-II performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba19.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA19",
      "page_number": "928",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPBA20",
      "title": "New Technique to Measure the Emittance of Beams with Space Charge",
      "authors": [
        "K. Poor Řežaei",
        "R.B. Fiorito",
        "R.A. Kishek",
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "Characterization of the transverse phase space of electron beams with space charge is an important requirement for high brightness particle accelerators. We present a novel technique to measure the transverse rms emittance. The method uses the beam divergence",
        "measured",
        "e.g. with optical transition radiation interferometry*",
        "and the beam radius",
        "obtained by imaging the beam",
        "to determine the cross correlation term and thus all the terms in the equation for the rms emittance. The experimental data is obtained with a lens-drift-screen setup similar to what is used in a quadrupole scan. However",
        "the analysis of the scan data is unique. It involves taking the cross-correlation term as a control variable in a procedure which matches the beam envelop radius and its derivative calculated from the envelope equation",
        "with the measured radius and divergences at the screen. A linear space charge model is used in the envelope equations",
        "hence the errors in the measurement relate to the nonuniformity of the beam transverse distribution. The technique is tested using simulated data.",
        "* R. B. Fiorito",
        "et al.",
        "“Interference of diffraction and transition radiation and its application as a beam divergence diagnostic",
        "” Phys. Rev. ST Accel. Beams",
        "Vol. 9",
        "pp. 052802",
        "(2006)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/wepba20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/wepba20.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/wepba20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEPBA20",
      "page_number": "931",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 17,
  "scrape_time": "2025-10-11 01:47:32"
}