{
  "session_info": {
    "id": "TUCOXBS",
    "name": "TUCOXBS - WG2: ERL beam dynamics and instrumentation",
    "url": "https://proceedings.jacow.org/erl2019/html/tucoxbs.htm"
  },
  "papers": [
    {
      "paper_id": "TUCOXBS01",
      "title": "Beam Halo in Energy Recovery Linacs",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "The beam halo mitigation is a very important challenge for reliable and safe operation of a high energy machine. Since Energy Recovery Linacs (ERLs) are known to produce high energy electron beams of high virtual power and high density",
        "the beam halo and related beam losses should be properly mitigated to avoid a direct damage of the equipment",
        "an unacceptable increase in the vacuum pressure",
        "a radiation activation of the accelerator components etc. To keep the operation stable",
        "one needs to address all possible beam halo formation mechanisms",
        "including those unique to each machine that can generate beam halo. Present report is dedicated to the beam halo related activities at the Compact ERL at KEK",
        "and our operational experience with respect to the beam halo."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/tucoxbs01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/tucoxbs01.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/tucoxbs01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-TUCOXBS01",
      "page_number": "23",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCOXBS03",
      "title": "Beam Dynamics Layout of the MESA ERL",
      "authors": [
        "F. Hug",
        "K. Aulenbacher",
        "D. Simon",
        "C.P. Stoll",
        "S.D.W. Thomas",
        "KPH",
        "Mainz",
        "Germany",
        "GSI",
        "Darmstadt",
        "Germany",
        "HIM",
        "Mainz",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The MESA project is currently under construction at Johannes Gutenberg-Universität Mainz. It will be used for high precision particle physics experiments in two different operation modes: external beam (EB) mode (0.15 mA; 155 MeV) and energy recovery (ERL) mode (1 mA; 105 MeV). The recirculating main linac follows the concept of a double sided accelerator design with vertical stacking of return arcs. Up to three recirculations are possible. Acceleration is done by four TESLA/XFEL 9-cell SRF cavities located in two modified ELBE cryomodules. Within this contribution the recirculation optics for MESA will be presented. Main goals are achieving best energy spread at the experimental setups in recirculating ERL and non-ERL operation and providing small beta-functions within the cryomodules for minimizing HOM excitation at high beam currents.",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/tucoxbs03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/tucoxbs03.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/tucoxbs03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-TUCOXBS03",
      "page_number": "28",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCOXBS04",
      "title": "The LHeC ERL - Optics and Performance Optimizations",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The LHeC 60 GeV ERL baseline design features a racetrack composed of two linacs",
        "completed with 6 return arcs",
        "including vertical spreaders and recombines at the arcs ends. Here",
        "we consider a design strategy aiming at ’downsizing’ the ERL e.g. to 50 GeV",
        "while preserving its performance in terms of synchrotron radiation effects. This results in a significant reduction of accelerator components. The optimization explores tuning of each arc",
        "which takes into account the impact of synchrotron radiation at different energies. At the highest energy",
        "it is crucial to minimize the emittance dilution; therefore",
        "the cells are tuned to minimize the dispersion in the bending sections",
        "as in a theoretical minimum emittance lattice. At the lowest energy",
        "one compensates for the bunch elongation with a negative momentum compaction setup which",
        "additionally",
        "contains the beam size. The intermediate energy arcs are tuned to a double bend achromat lattice",
        "offering a compromise between isochronicity and emittance dilution. Finally",
        "a feasibility of a ’dogbone’ ERL is discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-ERL2019-",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/tucoxbs04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/tucoxbs04.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/tucoxbs04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-TUCOXBS04",
      "page_number": "34",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUCOXBS05",
      "title": "Beam Timing and Cavity Phasing",
      "authors": [
        "R.M. Koscica",
        "N. Banerjee",
        "G.H. Hoffstaetter",
        "W. Lou",
        "G.T. Premawardhana",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "In a multi-pass Energy Recovery Linac (ERL)",
        "each cavity must regain all energy expended from beam acceleration during beam deceleration. The beam should also achieve specific energy targets during each loop that returns it to the linac. To satisfy the energy recovery and loop requirements",
        "one must specify the phase and voltage of cavity fields",
        "and one must control the beam flight times through the return loops. Adequate values for these parameters can be found by using a full scale numerical optimization program. If symmetry is imposed in beam time and energy during acceleration and deceleration",
        "the number of parameters needed decreases",
        "simplifying the optimization. As an example",
        "symmetric models of the Cornell BNL ERL Test Accelerator (CBETA) are considered. Energy recovery results from recent CBETA single-turn tests are presented",
        "as well as multi-turn solutions that satisfy CBETA optimization targets of loop energy and zero cavity loading."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/tucoxbs05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/tucoxbs05.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/tucoxbs05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-TUCOXBS05",
      "page_number": "39",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-11 08:38:40"
}