{
  "session_info": {
    "id": "TUZE",
    "name": "TUZE - Beam Dynamics",
    "url": "https://proceedings.jacow.org/napac2022/html/tuze.htm"
  },
  "papers": [
    {
      "paper_id": "TUZE1",
      "title": "Experimental Phase-Space Tracking of a Single Electron in a Storage Ring",
      "authors": [
        "A.L. Romanov",
        "J.K. Santucci",
        "G. Stancari",
        "A. Valishev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "This paper presents the results of the first ever experimental tracking of the betatron and synchrotron phases for a single electron in the Fermilab’s IOTA ring. The reported technology makes it is possible to fully track a single electron in a storage ring",
        "which requires tracking of amplitudes and phases for both",
        "slow synchrotron and fast betatron oscillations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuze1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuze1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuze1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUZE1",
      "page_number": "329",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZE2",
      "title": "Nonlinear Optics from Off-Energy Closed Orbits",
      "authors": [
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "Among several techniques used to characterize and correct the non-linear optics of a storage ring",
        "NOECO (Non-linear optics from Off-Energy Closed Orbits) is the natural expansion of the well-known scheme LOCO for quadrupoles. This approach is based on measuring an orbit response matrix at an off-nominal energy and it is valid for chromatic sextupoles. In this contribution the method [1] will be presented as deployed for the MAX IV 3 GeV ring."
      ],
      "institutions": [],
      "abstract": "[1] https://link.aps.org/doi/10.1103/PhysRevAccelBeams.23.102803",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuze2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuze2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuze2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUZE2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUZE3",
      "title": "Optimizing the Discovery of Underlying Nonlinear Beam Dynamics",
      "authors": [
        "L.A. Pocher",
        "T.M. Antonsen",
        "L. Dovlatyan",
        "I. Haber",
        "P.G. O’Shea",
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "One of the DOE-HEP Grand Challenges identified by Nagaitsev et al. relates to the use of virtual particle accelerators for beam prediction and optimization. Useful virtual accelerators rely on efficient and effective methodologies grounded in theory",
        "simulation",
        "and experiment. This paper uses an algorithm called Sparse Identification of Nonlinear Dynamical systems (SINDy)",
        "which has not previously been applied to beam physics. We believe the SINDy methodology promises to simplify the optimization of accelerator design and commissioning",
        "particularly where space charge is important. We show how SINDy can be used to discover and identify the underlying differential equation system governing the beam moment evolution. We compare discovered differential equations to theoretical predictions and results from the PIC code WARP modeling. We then integrate the discovered differential system forward in time and compare the results to data analyzed in prior work using a Machine Learning paradigm called Reservoir Computing. Finally",
        "we propose extending our methodology",
        "SINDy for Virtual Accelerators (SINDyVA)",
        "to the broader community’s computational and real experiments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuze3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuze3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuze3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUZE3",
      "page_number": "335",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZE4",
      "title": "Particle-in-Cell Simulations of High Current Density Electron Beams in the Scorpius Linear Induction Accelerator",
      "authors": [
        "S.E. Clark",
        "Y.-J. Chen",
        "J. Ellsworth",
        "A.T. Fetterman",
        "C.N. Melton",
        "W.D. Stem",
        "LLNL",
        "Livermore",
        "USA",
        "Particle-in-cell (PIC) simulations of a high current density (I > 1 kA)",
        "and highly relativistic electron beam (E ~ 2-20 MeV) in the Scorpius Linear Induction Accelerator (LIA) are presented. The simulation set consists of a 3D electrostatic/magnetostatic simulation coupled to a 2D XY slice solver that propagates the beam through the proposed accelerator lattice for Scorpius",
        "a next-generation flash X-ray radiography source. These simulations focus on the growth of azimuthal modes in the beam (e.g. Diocotron instability) that arise when physical ring distributions manifest in the beam either due to electron optics or solenoidal focusing and transport. The saturation mechanism appears to lead to the generation of halo particles and conversion down to lower mode numbers as the width of the ring distribution increases. The mode growth and saturation can contribute to the generation of hot spots on the target as well possible azimuthal asymmetries in the radiograph. Simulation results are compared to linear theory and tuning parameters are investigated to mitigate the growth of azimuthal modes in the Scorpius electron beam.",
        "* LLNL-ABS-830595",
        "Approved for public release. Distribution Unlimited."
      ],
      "institutions": [
        "Funding: This work was performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuze4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuze4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuze4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUZE4",
      "page_number": "339",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZE5",
      "title": "Studies of Ion Beam Heating by Electron Beams",
      "authors": [
        "S. Seletskiy",
        "A.V. Fedotov",
        "D. Kayran",
        "BNL",
        "Upton",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "Presence of an electron beam created by either electron coolers or electron lenses in an ion storage ring is associated with an unwanted emittance growth (heating) of the ion bunches. In this paper we report experimental studies of the electron-ion heating in the Low Energy RHIC electron Cooler (LEReC).",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuze5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuze5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuze5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUZE5",
      "page_number": "343",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZE6",
      "title": "Studies of Ion Instability Using a Gas Injection System",
      "authors": [
        "J.R. Calvey",
        "M. Borland",
        "L. Emery",
        "P.S. Kallakuri",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Ion trapping occurs when a negatively charged beam ionizes residual gas inside an accelerator vacuum chamber",
        "and the resulting ions become trapped in the beam potential. Trapped ions can cause a variety of undesirable effects",
        "including coherent instability and incoherent emittance growth. Because of the challenging emittance and stability requirements of next generation light sources",
        "ion trapping is a serious concern. To study this effect at the present APS",
        "a gas injection system was designed and installed at two different locations in the ring. The system creates a controlled and localized pressure bump of nitrogen gas",
        "so the resulting ion instability can be studied. Measurements were taken under a wide variety of beam conditions",
        "using a spectrum analyzer",
        "pinhole camera",
        "and bunch-by-bunch feedback system. The feedback system was also used to perform grow-damp measurements",
        "allowing us to measure the growth rate of individual unstable modes. This paper will present some of the results of these experiments. Simulations using the IONEFFECTS element in the particle tracking code elegant will also be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuze6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuze6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuze6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUZE6",
      "page_number": "347",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:17:28"
}