{
  "session_info": {
    "id": "WEYB",
    "name": "WEYB - Invited Oral Presentation, Beam Instrumentation and Feedback",
    "url": "https://proceedings.jacow.org/IPAC2014/html/weyb.htm"
  },
  "papers": [
    {
      "paper_id": "WEYB01",
      "title": "Large Dynamic Range Beam Diagnostics for High Average Current Electron LINACs",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "A number of applications is envisioned now for CW electron LINACs with high average current. A few examples are: driver-accelerators for the next generation of high average brightness SR sources",
        "energy recovery LINACs to be used for frontier research in particle physics - search for dark matter candidate particles",
        "industrial and defense applications. An average beam power of MWs is considered for such applications. Such machines will be required to operate simultaneously with high beam power and peak brightness comparable to the brightest electron beams generated in pulsed LINACs. Combining the high current advantages of storage rings and high peak brightness of LINACs will require such understanding and control of the beam dynamics that 10-6 fraction of the beam current is taken in to account and controlled during the beam tuning. To make this possible a number of large dynamic range (LDR) (~10+6) beam diagnostics is under development and test at JLab FEL. Transverse and longitudinal LDR beam profile measurements can be used for LDR measurements of the phase space distribution and its evolution through the accelerator."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/weyb01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/weyb01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/weyb01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEYB01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 20:44:30"
}