{
  "session_info": {
    "id": "WEODB1",
    "name": "WEODB1 - Contributed Oral Presentations (Synchrotron Light Sources and FELs)",
    "url": "https://proceedings.jacow.org/IPAC2013/html/weodb1.htm"
  },
  "papers": [
    {
      "paper_id": "WEODB101",
      "title": "X-ray Spectra and Peak Power Control with iSASE",
      "authors": [
        "J. Wu",
        "F.-J. Decker",
        "Y. Feng",
        "J. Krzywinski",
        "H. Loos",
        "A.A. Lutman",
        "A. Marinelli",
        "H.-D. Nuhn",
        "C. Pellegrini",
        "D.F. Ratner",
        "D.H. Zhang",
        "D. Zhu",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "We report the first measurement of spectral line-width reduction in a self-amplified spontaneous emission (SASE) X-ray free-electron laser (FEL) obtained by introducing repeated delays of the electron bunch with respect to the radiation field pulse. The improved longitudinal coherence obtained by this method reduces the intensity spiking effect characteristic of a SASE FEL. The electron-photon delays introduced along the FEL undulator mix the spikes phase and amplitude",
        "increasing the cooperation length and generating a smaller bandwidth than in the conventional SASE mode of operation of an FEL. We call this mode of operation",
        "based on repeated electron-photon delays",
        "‘‘improved SASE'' (iSASE). We also show with theoretical and simulation analysis that in the iSASE mode it is possible to choose the separation and magnitude of the delays to obtain a nearly transform limited X-ray pulse. This analysis is carried out using a time dependent",
        "one-dimensional model and with GENESIS numerical simulation",
        "including three-dimensional effects."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weodb101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weodb101.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weodb101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEODB101",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEODB102",
      "title": "Generating Polarization Controllable FELs at Dalian Coherent Light Source",
      "authors": [
        "T. Zhang",
        "H.X. Deng",
        "D. Wang",
        "Z.T. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "D.X. Dai",
        "G.R. Wu",
        "X.M. Yang",
        "W.Q. Zhang",
        "DICP",
        "Dalian",
        "People's Republic of China",
        "The property of the FEL polarization is of great importance to the user community. FEL pulses with ultra-high intensity and flexible polarization control ability will absolutely open up new scientific realms. In this paper",
        "several polarization control approaches are presented to investigate the great potential on Dalian coherent light source",
        "which is a government-approved novel FEL user facility with the capability of wavelength continuously tunable in the EUV regime of 50-150 nm. The numerical simulations show that both circularly polarized FELs with highly modulating frequency and 100 microjoule level pulse energy could be generated at Dalian coherent light source*.",
        "*T. Zhang",
        "et al.",
        "FEL Polarization Control Studies on Dalian Coherent Light Source",
        "Chinese Physics C",
        "2013",
        "to be published."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weodb102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weodb102.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weodb102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEODB102",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEODB103",
      "title": "Current Status of PAL-XFEL Project",
      "authors": [
        "H.-S. Kang",
        "J.H. Han",
        "T.-H. Kang",
        "C. Kim",
        "D.E. Kim",
        "S.H. Kim",
        "I.S. Ko",
        "H.-S. Lee",
        "K.-H. Park",
        "S.J. Park",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "The PAL-XFEL is a 0.1-nm hard X-ray FEL construction project which started from 2011 with a total budget of 400 M$. The PAL-XFEL is designed to have three hard X-ray undulator lines at the end of 10-GeV linac and a dog-leg branch line at 3 GeV point for two soft X-ray undulator lines. The three-bunch compressor lattice (3-BC) is chosen to have large flexibility of operation",
        "making it possible to operate soft X-ray FEL undulator line simultaneously and independently from hard X-ray FEL line. Self seeding to achieve the FEL radiation bandwidth of below 5x10-5 is baseline for the hard X-ray FEL line. Polarization control will be available by using the PU + EPU layout for the soft X-ray FEL line. The overview of the project with current status is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weodb103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weodb103.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weodb103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEODB103",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 21:26:12"
}