{
  "session_info": {
    "id": "MOZB",
    "name": "MOZB - Invited Oral Presentations, Novel Particle Sources and Acceleration Techniques",
    "url": "https://proceedings.jacow.org/ipac2017/html/mozb.htm"
  },
  "papers": [
    {
      "paper_id": "MOZB1",
      "title": "First Results with the Novel Peta-Watt Laser Acceleration Facility in Dresden",
      "authors": [
        "U. Schramm",
        "D. Albach",
        "C. Bernert",
        "S. Bock",
        "F. Brack",
        "J. Branco",
        "M.H. Bussmann",
        "J.P. Couperus",
        "A.D. Debus",
        "C. Eisenmann",
        "M. Garten",
        "R. Gebhardt",
        "S. Grams",
        "U. Helbig",
        "A. Huebl",
        "A. Irman",
        "A. Köhler",
        "J.M. Krämer",
        "S. Kraft",
        "F. Kroll",
        "J. Metzkes",
        "L. Obst",
        "R.G. Pausch",
        "M. Rehwald",
        "H.P. Schlenvoigt",
        "M. Siebold",
        "K. Steiniger",
        "O. Zarini",
        "K. Zeil",
        "Helmholtz-Zentrum Dresden-Rossendorf (HZDR)",
        "Institute of Radiation Physics",
        "Dresden",
        "Germany",
        "T. Kluge",
        "M. Kuntzsch",
        "U. Lehnert",
        "M. Löser",
        "P. Michel",
        "R. Sauerbrey",
        "HZDR",
        "Dresden",
        "Germany",
        "Applications of laser plasma accelerated particle beams ranging from driving of light sources to radiation therapy require the scaling of beam energy and charge as well as reproducible operating conditions. Both issues have motivated the development of novel table-top class Petawatt laser systems (e.g.",
        "30J pulse energy in 30fs) with unprecedented pulse control",
        "here represented by the Draco-PW system recently commissioned at HZDR Dresden. First results will be presented on laser wakefield electron acceleration where in the beam loading regime high bunch charges in the nC range could be efficiently accelerated with good beam quality",
        "and on proton acceleration where pulsed magnet beam transport ensured depth dose distributions allowing for tumor irradiation in animal models."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/mozb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/mozb1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/mozb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-MOZB1",
      "page_number": "48",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOZB2",
      "title": "Stable Electron Beams by Laser Wakefield Acceleration (LWFA) and the ImPACT Program in Japan",
      "authors": [
        "Osaka University",
        "Suita",
        "Osaka",
        "Japan",
        "A laser wakefield acceleration (LWFA) research that aims at table-top sized free-electron laser (FEL) under the ImPACT program in Japan will be reviewed. LWFA is expected to be a novel scheme for accelerating electron beams beyond GeV-class energy with compact devices. In recent studies",
        "the pointing stability of the electron beams from LWFA has been dramatically improved by plasma-micro-optics (PMO) that is plasma device functioning as a focusing and optical-guiding tool for intense laser pulses. The PMO enables electron beams to be precisely controlled and/or transported by the beam-optics of conventional accelerators. With these techniques a staging LWFA has been demonstrated successfully",
        "and high quality quasi-mono-energetic beams below the 100 MeV range are produced with good repeatability as an injector. Sub-GeV electron beams are also produced with a 4 mm-booster laser wakefield. These results will be presented and discussed. A future experimental site at SPRING-8/RIKEN is being prepared for the exclusive use of the laser-driven FEL. The plans towards a test area on the laser-driven FEL at SPRING-8 /RIKEN will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/mozb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/mozb2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/mozb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-MOZB2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 19:42:38"
}