{
  "session_info": {
    "id": "THCPL",
    "name": "THCPL - Systems Engineering, Collaborations and Project Management",
    "url": "https://proceedings.jacow.org/icalepcs2017/html/thcpl.htm"
  },
  "papers": [
    {
      "paper_id": "THCPL01",
      "title": "Speaking of Diversity",
      "authors": [
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Historically",
        "attendance at the International Conference on Accelerator and Large Experimental Physics Control Systems has not been particularly diverse in terms of gender or race. In fact",
        "the lack of diversity amongst the attendees was noted during the closing session of the 2015 conference by an invited speaker from outside the accelerator community. Informal discussion and observations support the assertion that our conference attendance reflects the diversity of the broader accelerator controls workforce. Facing very low participation of women in our field and even lower minority representation",
        "it is important to examine this issue as studies point to the importance of diverse work groups to spark innovation and creativity as catalysts to solving difficult problems. This paper will discuss diversity and inclusion in the disciplines that comprise the accelerator controls workforce",
        "including background",
        "barriers and strategies for improvement."
      ],
      "institutions": [],
      "abstract": "Talk as video stream: https://youtu.be/94u5LpJ7DzY",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thcpl01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thcpl01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thcpl01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THCPL01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCPL02",
      "title": "Highlights of the European Ground System - Common Core Initiative",
      "authors": [
        "ESA/ESOC",
        "Darmstadt",
        "Germany",
        "ESA-ESTEC",
        "Noordwijk",
        "The Netherlands",
        "The European Ground System Common Core (EGS-CC) initiative is now materializing. The goal of the this initiative is to define",
        "build and share a software framework and implementation that will be used as the main basis for pre- and post- launch ground systems (Electrical Ground Support Equipment and Mission Control System) of future European space projects. The initiative is in place since year 2011 and is being led by the European Space Agency as a formal collaboration of the main European stakeholders in the space systems control domain",
        "including European Space National Agencies and European Prime Industry. The main expected output of the EGS-CC initiative is a core system which can be adapted and extended to support the execution of pre- and post-launch Monitoring and Control operations for all types of missions and throughout the complete life-cycle of space projects. This presentation will introduce the main highlights of the EGS-CC initiative",
        "its governance principles",
        "the fundamental concepts of the resulting products and the challenges that the team is facing."
      ],
      "institutions": [],
      "abstract": "Talk as video stream: https://youtu.be/xguMZe2WuKE",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thcpl02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thcpl02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thcpl02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THCPL02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCPL03",
      "title": "A Success-History Based Learning Procedure to Optimize Server Throughput in Large Distributed Control Systems",
      "authors": [
        "Y. Gao",
        "T.G. Robertazzi",
        "Stony Brook University",
        "Stony Brook",
        "New York",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Stony Brook University",
        "Computer Science Department",
        "Stony Brook",
        "New York",
        "USA",
        "Large distributed control systems typically can be modeled by a hierarchical structure with two physical layers: Console Level Computers (CLCs) and Front End Computers (FECs). The controls system of the Relativistic Heavy Ion Collider (RHIC) consists of more than 500 FECs",
        "each acting as a server providing services to a potentially unlimited number of clients. This can lead to a bottleneck in the system. Heavy traffic can slow down or even crash a system",
        "making it momentarily unresponsive. One mechanism to circumvent this is to transfer the heavy communications traffic to more robust higher performance servers",
        "keeping the load on the FEC low. In this work",
        "we study this client-server problem from a different perspective. We introduce a novel game theory model for the problem",
        "and formulate it into an integer programming problem. We point out its difficulty and propose a heuristic algorithms to solve it. Simulation results show that our proposed schemes efficiently manage the client-server activities",
        "and result in a high server throughput and a low crash probability."
      ],
      "institutions": [],
      "abstract": "Talk as video stream: https://youtu.be/veLaGGNTs8w",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thcpl03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thcpl03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thcpl03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THCPL03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCPL04",
      "title": "SKA Synchronization and Timing Local Monitor Control - Software Design Approach",
      "authors": [
        "National Centre for Radio Astrophysics",
        "Tata Institute of Fundamental Research",
        "Pune",
        "India",
        "University of Manchester",
        "Manchester",
        "United Kingdom",
        "The Square Kilometre Array (SKA) is a global project that aims to build a large radio telescope in Australia and South Africa with around 100 organizations in 20 countries engaged in its detailed design. The Signal and Data Transport (SaDT) consortium",
        "includes the software and hardware necessary for the transmission of data and information between elements of SKA",
        "and the Synchronization and Timing (SAT) system provides frequency and clock signals. The SAT local monitoring and control system (SAT. LMC) monitors and controls the SAT system. SAT. LMC has its team members distributed across India",
        "South Africa and UK. This paper discusses the systems engineering methods adopted by SAT. LMC on interface design with work packages owned by different organizations",
        "configuration control of design artefacts",
        "and quality control through intermediate releases",
        "design assumptions and risk management. The paper also discusses the internal SAT. LMC team communication model",
        "cross culture sensitivity and leadership principles adopted to keep the project on track and deliver quality design products whilst staying flexible to the changes in the overall SKA program."
      ],
      "institutions": [],
      "abstract": "R.E. Braddockpresenter Talk as video stream: https://youtu.be/RxwQUrOkK94",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thcpl04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thcpl04.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thcpl04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THCPL04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCPL05",
      "title": "TANGO Heads for Industry",
      "authors": [
        "A. Götz",
        "R. Bourtembourg",
        "J.M. Chaize",
        "T.M. Coutinho",
        "V. Michel",
        "J.L. Pons",
        "P.V. Verdier",
        "ESRF",
        "Grenoble",
        "France",
        "NEXEYA Systems",
        "La Couronne",
        "France",
        "3controls",
        "Kraków",
        "Poland",
        "HZG",
        "Geesthacht",
        "Germany",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Prevac",
        "Rogow",
        "Poland",
        "JYSE",
        "Grenoble",
        "France",
        "The TANGO Controls Framework* continues to mature and be adopted by new sites and applications. This paper will describe how TANGO has moved closer to industry with the creation of startups and addressing industrial use cases. It will describe what progress has been made since the last ICALEPCS in 2015 to ensure the sustainability of TANGO for scientific and industrial users. It will present TANGO web based technologies and the deployment of TANGO in the cloud. Furthermore it will describe how the community has re-organised itself to fund and improve code sharing",
        "documentation",
        "code quality assurance and maintenance."
      ],
      "institutions": [],
      "abstract": "* http://tango-controls.org Talk as video stream: https://youtu.be/O-_",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thcpl05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thcpl05.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thcpl05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THCPL05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCPL06",
      "title": "Sustaining the National Ignition Facility (NIF) Integrated Computer Control System (ICCS) over its Thirty Year Lifespan",
      "authors": [
        "B.T. Fishler",
        "Y.W. Abed",
        "A.I. Barnes",
        "G.K. Brunton",
        "C.M. Estes",
        "M.A. Fedorov",
        "M.S. Flegel",
        "A.P. Ludwigsen",
        "V.J. Miller Kamm",
        "M. Paul",
        "R.K. Reed",
        "E.A. Stout",
        "E.F. Wilson",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "The National Ignition Facility (NIF) is the world's largest and most energetic laser experimental facility with 192 beams capable of delivering 1.8 megajoules and 500-terawatts of ultraviolet light to a target. Officially commissioned as an operational facility on March 21",
        "2009",
        "NIF is expected to conduct research experiments thru 2039. The 30-year lifespan of the control system presents several challenges in meeting reliability",
        "availability",
        "and maintainability (RAM) expectations. As NIF continues to expand on its experimental capabilities",
        "the control system's software base of 3.5 million lines of code grows with most of the legacy software still in operational use. Supporting this software is further complicated by technology life cycles and turnover of senior experienced staff. This talk will present lessons learned and new initiatives related to technology refreshes",
        "risk mitigation",
        "and changes to our software development and test methodology to ensure high control system availability for supporting experiments throughout NIF's lifetime."
      ],
      "institutions": [
        "Funding: U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344"
      ],
      "abstract": "Talk as video stream: https://youtu.be/lSrpMzlHKpM",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/thcpl06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/thcpl06.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/thcpl06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-THCPL06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-10 18:17:50"
}