{
  "session_info": {
    "id": "WEOA",
    "name": "WEOA - Wednesday Contributed Oral Session A",
    "url": "https://proceedings.jacow.org/medsi2020/html/weoa.htm"
  },
  "papers": [
    {
      "paper_id": "WEOA01",
      "title": "CAD Integration for PETRA-IV",
      "authors": [
        "B. List",
        "L. Hagge",
        "M. Hüning",
        "D. Miller",
        "P.-O. Petersen",
        "DESY",
        "Hamburg",
        "Germany",
        "The PETRA-IV next-generation synchrotron radiation source planned at DESY is currently in preparation as successor of PETRA-III",
        "with a completely new accelerator and a new experimental hall",
        "while existing buildings",
        "tunnels and experimental beamlines will be retained where possible. The Technical Design Report is due to be completed by the end of 2022. A CAD integration model has been set up for the complete accelerator and photon science complex. It combines the contributions of all relevant trades",
        "the accelerator components",
        "supply infrastructure",
        "installations",
        "frames",
        "tunnels and buildings",
        "and the design of the campus. The CAD model structure is aligned with the project’s part breakdown structure (PBS) and the Work Breakdown Structure (WBS) to facilitate integration with systems engineering and reflect responsibility within the project organization. Within the model",
        "it is possible to switch between different levels of detail for space allocation (DG1 - \"black box\")",
        "interface definition (DG2 - \"grey box\") and detailed design (DG3 - \"white box\")",
        "separating layout from design",
        "while ensuring their consistency. Placement of accelerator components is directly governed by the lattice through direct access to spreadsheet data",
        "allowing fast design changes after a lattice update and ensuring consistency between mechanical and lattice design. The resulting model will support the complete facility lifecycle",
        "from layout and design to fabrication",
        "installation and operation. The presentation explains the tasks and requirements of the CAD integration process and uses examples to explain the structure and the modeling methodology of the CAD integration model."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/weoa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/weoa01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/weoa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEOA01",
      "page_number": "215",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOA02",
      "title": "Design of Girders on the New Upgrade Lattice at Soleil",
      "authors": [
        "J.L. Giorgetta",
        "A. Lestrade",
        "A. Mary",
        "K. Tavakoli",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "The current girder set of SOLEIL features 4 girder types weighing from 1.85 t to 3 t",
        "with a respective mass payload varying from 4.1 t to 8 t and lengths from 2.40 m to 4.80 m. The smaller size of magnets used for the present version of the SOLEIL upgrade allows a dramatic size and weight reduction of the magnet-girder assemblies. On the other hand",
        "the number of magnets and girders has increased by a factor of 3",
        "implying longer alignment and installation operations. Another constraint is due to the high compactness of the new lattice causing some limitations and access restrictions in the area between girders and tunnel wall. Several setups involving a number of girders from 116 to 212",
        "various magnet layouts and binding systems have been studied. Dynamic and thermal performances have been evaluated by FEA analysis. This approach gives to accelerator physicists the performance of each solution",
        "and thus a great versatility in the choice of the best setup in terms of dynamic and thermal stability. Alignment constraints",
        "installation schedule reducing \"dark time\" period and economic considerations have also been taken into account during all the design phase."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/weoa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/weoa02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/weoa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEOA02",
      "page_number": "218",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOA03",
      "title": "Updated High Heat Load Front-Ends for SLS 2.0",
      "authors": [
        "D.M. Just",
        "C. Pradervand",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The Swiss Light Source (SLS) at the Paul Scherrer Institut (PSI) in Switzerland will undergo from 2021 to 2024 an upgrade named SLS 2.0 to increase brightness and coherence. This upgrade will have a significant impact on the existing front-ends. Due to the proven reliability and good concept",
        "we plan a refurbishment strategy for all front-end (FE) components where possible. New source points for all beam-lines – resulting in shifts both lateral and tangential",
        "newly developed insertion devices and bending magnets as well as spatial restrictions due to the multi bend achromat (MBA) design challenges this strategy. We demonstrate how we plan to deal with these challenges for the case of high heat load FEs. We will address how the acceptance of the FE was chosen due flux and power calculations of the insertion device and the design and thermal analysis of a novel primary aperture. The adaptions that will be made to the tungsten blade X-Ray beam positioning monitors (W-XBPM) and modifications on the photon shutter will be discussed. Furthermore",
        "we will take a brief excursion on how we want to organize the refurbishment during the shutdown period of the upgrade."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/weoa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/weoa03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/weoa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEOA03",
      "page_number": "221",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 23:27:37"
}