{
  "session_info": {
    "id": "TUYMH",
    "name": "TUYMH - Colliders",
    "url": "https://proceedings.jacow.org/rupac2016/html/tuymh.htm"
  },
  "papers": [
    {
      "paper_id": "TUYMH01",
      "title": "Status of the Future Circular Collider Study",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "Following the 2013 update of the European Strategy for Particle Physics",
        "the international Future Circular Collider (FCC) Study has been launched by CERN as host institute",
        "to design an energy frontier hadron collider (FCC-hh) in a new 80-100 km tunnel with a centre-of-mass energy of about 100 TeV",
        "an order of magnitude beyond the LHC's",
        "as a long-term goal. The FCC study also includes the design of a 90-350 GeV high-luminosity lepton collider (FCC-ee) installed in the same tunnel",
        "serving as Higgs",
        "top and Z factory",
        "as a potential intermediate step",
        "as well as an electron-proton collider option (FCC-he). The physics cases for such machines will be assessed and concepts for experiments will be developed in time for the next update of the European Strategy for Particle Physics by the end of 2018. The presentation will summarize the status of machine designs and parameters and discuss the essential technical components to be developed in the frame of the FCC study. Key elements are superconducting accelerator-dipole magnets with a field of 16 T for the hadron collider and high-power",
        "high-efficiency RF systems for the lepton collider. In addition the unprecedented beam power presents special challenges for the hadron collider for all aspects of beam handling and machine protection. First conclusions of geological investigations and implementation studies will be presented. The status of the FCC collaboration and the further planning for the study will be outlined."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/tuymh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/tuymh01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/tuymh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-TUYMH01",
      "page_number": "34",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYMH02",
      "title": "The High Luminosity LHC Project at CERN: Status, Perspectives, Plans",
      "authors": [
        "B. Di Girolamo",
        "O.S. Brüning",
        "L. Rossi",
        "CERN",
        "Geneva",
        "Switzerland",
        "The High Luminosity LHC (HL-LHC) is a novel configuration of the Large Hadron Collider",
        "aiming at increasing the luminosity by a factor five or more above the nominal LHC design",
        "to allow increasing the integrated luminosity in the high luminosity experiments ATLAS and CMS from the 300 fb-1 of the LHC original design up to 3000 fb-1 or more. For this reason around 1.2 km of the current LHC accelerator will be modified with a bigger aperture and higher focusing power magnets. This contribution will discuss the present status of the project",
        "the perspectives",
        "the baseline configurations and the options for the project construction and implementation",
        "likewise the roadmap for meeting the deadline defined by the CERN research plans."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/tuymh02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/tuymh02.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/tuymh02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-TUYMH02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUYMH03",
      "title": "Recommissioning and Perspectives  of VEPP-2000 Complex",
      "authors": [
        "Yu. A. Rogovsky",
        "V.V. Anashin",
        "D.E. Berkaev",
        "A.S. Kasaev",
        "E. Kenzhebulatov",
        "I. Koop",
        "A.A. Krasnov",
        "G.Y. Kurkin",
        "A.N. Kyrpotin",
        "A.P. Lysenko",
        "S.V. Motygin",
        "E. Perevedentsev",
        "V.P. Prosvetov",
        "A.V. Semenov",
        "A.I. Senchenko",
        "P.Yu. Shatunov",
        "Y.M. Shatunov",
        "D.B. Shwartz",
        "A.N. Skrinsky",
        "I.M. Zemlyansky",
        "Yu.M. Zharinov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "NSU",
        "Novosibirsk",
        "Russia",
        "VEPP-2000 is electron-positron collider exploiting the novel concept of round colliding beams. After three seasons of data taking in the whole energy range of 160-1000 MeV per beam it was stopped in 2013 for injection chain upgrade. The linking to the new BINP source of intensive beams together with booster synchrotron modernization provides the drastic luminosity gain at top energy of VEPP-2000. Recomissioning status",
        "fist results and perspectives of the VEPP-2000 complex will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-RuPAC2016-",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/tuymh03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/tuymh03.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/tuymh03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-TUYMH03",
      "page_number": "39",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-11 02:31:53"
}