{
  "session_info": {
    "id": "WEAM1HA",
    "name": "WEAM1HA - Electron Cooling III (low energy)",
    "url": "https://proceedings.jacow.org/COOL2013/html/weam1ha.htm"
  },
  "papers": [
    {
      "paper_id": "WEAM1HA01",
      "title": "Challenges of Beam Cooling at Low Energy",
      "authors": [
        "MPI-K",
        "Heidelberg",
        "Germany",
        "Stored low-energy ion beams find increasing application in studies of chemical physics and molecular collisions",
        "using positive and negative molecular ions. Mostly electrostatic ion storage rings are used and attempts of beam cooling were so far restricted to few exceptional cases. Moreover",
        "storage of antiprotons at low energy opens up new experimental possibilities",
        "where efficient beam cooling is strongly desired. In these applications",
        "the beam energies range down to some keV. The options to realize phase-space cooling in this regime of slow ion beams will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/COOL2013/talks/weam1ha01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/COOL2013/papers/weam1ha01.pdf",
      "poster_url": "https://proceedings.jacow.org/COOL2013/posters/weam1ha01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2013-WEAM1HA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEAM1HA02",
      "title": "Influence of Electron Energy Detuning on the Lifetime and Stability of Ion Beam in CSRm",
      "authors": [
        "X.D. Yang",
        "G.H. Li",
        "J. Li",
        "X.M. Ma",
        "L.J. Mao",
        "T.L. Yan",
        "D.Y. Yin",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "The energy spread of electron beam artificially was increased with the help of the detuning system in the electron cooler. The Influence of electron energy detuning on maximum accumulated intensity",
        "the lifetime and stability of ion beam were experimentally investigated with the beam of 3.7MeV/u 112Sn35+ in CSRm. The lifetime was derived from the signals of ion beam intensity from DCCT varying with time",
        "and the instability was observed by mean of the longitudinal frequency signals from Schottky probe. The experiments results show that no significant influence of electron energy detuning on the maximum accumulated intensity and lifetime. Due to the limitation of beam intensity from injector",
        "the space charge limitation and saturation condition was not approached",
        "and the obvious evidence for instability suppression by the detuning has not observed in such detuning frequency range."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/COOL2013/talks/weam1ha02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/COOL2013/papers/weam1ha02.pdf",
      "poster_url": "https://proceedings.jacow.org/COOL2013/posters/weam1ha02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2013-WEAM1HA02",
      "page_number": "84",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAM1HA03",
      "title": "Cooling Activities at the TSR Storage Ring",
      "authors": [
        "M. Grieser",
        "R. Bastert",
        "K. Blaum",
        "A. Wolf",
        "MPI-K",
        "Heidelberg",
        "Germany",
        "KEK",
        "Ibaraki",
        "Japan",
        "In ring experiments at the heavy ion storage ring",
        "using a reaction microscope",
        "require highly charged bunched ion beams with bunch length below 5 ns. Small longitudinal ion profiles can be obtained by bunching the ion beam with electron cooling. The measured short bunch lengths are determined by the space charge limit. To over come the space charge limit and to further minimize the bunch lengths",
        "the TSR was operated at a momentum compaction factor 1.57",
        "a mode in which the revolution frequency at higher energies decreased. During this beam time",
        "self-bunching of the ion beam was observed for the first time in the TSR. To provide highly charge ions at the TSR deceleration is required. Deceleration experiments are mainly carried out with 12C6+ ions to investigate the behavior and evolution of the beam during deceleration. To explore the deceleration cycle",
        "12C6+ ions are decelerated from 73.3 MeV to 9.77 MeV. To achieve this low energy two cooling steps at the initial and final beam energies are applied. Electron pre-cooling results in a dense ion beam where IBS has to be taken into account to describe the development of the beam size during deceleration."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/COOL2013/talks/weam1ha03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/COOL2013/papers/weam1ha03.pdf",
      "poster_url": "https://proceedings.jacow.org/COOL2013/posters/weam1ha03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2013-WEAM1HA03",
      "page_number": "89",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:22:05"
}