{
  "session_info": {
    "id": "TUPFI",
    "name": "TUPFI - Poster Session",
    "url": "https://proceedings.jacow.org/IPAC2013/html/tupfi.htm"
  },
  "papers": [
    {
      "paper_id": "TUPFI001",
      "title": "High Luminosity LHC Matching Section Layout vs Crab Cavity Voltage",
      "authors": [
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "A. Chancé",
        "J. Payet",
        "CEA/DSM/IRFU",
        "France",
        "R. De Maria",
        "S.D. Fartoukh",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the framework of the HL-LHC Upgrade project we present a new possible variant for the layout of the LHC matching section located in the high luminosity insertions. This layout is optimized to reduce the demand on the voltage of the crab cavities",
        "while substantially improving the optics squeeze-ability",
        "both in ATS [1] and non-ATS mode. These new layout will be described in details together with its performance figures in terms of mechanical acceptance",
        "chromatic properties and optics flexibility. [1] S. Fartoukh",
        "‘’An Achromatic Telescopic Squeezing (ATS) Scheme for LHC Upgrade’’",
        "in proceedings of"
      ],
      "institutions": [
        "Funding: The research leading to these results has received funding from the European Commission under the FP7 project HiLumi LHC, GA no. 284404, co-funded by the DoE, USA and KEK, Japan."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi001.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI002",
      "title": "Electron Cloud and Scrubbing Studies for the LHC",
      "authors": [
        "Naples University Federico II",
        "Science and Technology Pole",
        "Napoli",
        "Italy",
        "G. Arduini",
        "V. Baglin",
        "H. Bartosik",
        "C.O. Domínguez",
        "J.F. Esteban Müller",
        "G. Iadarola",
        "G. Rumolo",
        "E.N. Shaposhnikova",
        "L.J. Tavian",
        "F. Zimmermann",
        "CERN",
        "Geneva",
        "Switzerland",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "CINVESTAV",
        "Mexico City",
        "Mexico",
        "Electron cloud build-up resulting from beam-induced multipacting is one of the major limitations for the operation of the LHC with beams with close bunch spacing. Electron clouds induce unwanted pressure rise",
        "heat loads on the beam screens of the superconducting magnets and beam instabilities. Operation with bunch spacing of 50 ns in 2011 and 2012 has required decreasing the Secondary Electron Yield of the beam screens below the multipacting threshold for beams with this bunch spacing. This was achieved by continuous electron bombardment induced by operating the machine with high intensity beams with 50 and 25 ns spacing during dedicated periods at injection energy (450 GeV) and at top energy (3.5 and 4 TeV). The evolution of the Secondary Electron Yield during these periods",
        "at different sections of the machine",
        "can be estimated by pressure",
        "heat load and by bunch-by-bunch RF stable phase measurements. The experimental information on the scrubbing process will be discussed and a possible “scrubbing strategy” to allow the operation with 50ns and 25ns beams after the Long Shutdown in 2013-2014 will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi002.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI003",
      "title": "The Accelerator Design of Muon g-2 Experiment at J-PARC",
      "authors": [
        "S. Artikova",
        "F. Naito",
        "M. Yoshida",
        "KEK",
        "Ibaraki",
        "Japan",
        "New muon g-2 experiment at J-PARC is aimed to improve the precise measurement of the muon g-2. In this experiment",
        "the ultra-cold muons created in the muonium target region is reaccelerated to around 300MeV/c in momentum (210 MeV kinetic energy) to then be injected into the muon g-2 storage ring to measure the decay products depending on the muon spin. The linac has advantage over circular accelerators to shorten the reacceleration time in the limited life time of muon. The muon linac consists of the initial acceleration (to 0.01 of v/c)",
        "bunching section (0.01 to 0.08 of v/c)",
        "low beta section (0.08 to 0.3 of v/c)",
        "middle beta section (0.3 to 0.7 of v/c) and high beta section (0.7 to 0.94 of v/c). As a part of the design consideration of this linac",
        "we mainly present the simulation result of initial acceleration and further acceleration of muons with RFQ. An electric field is used to extract the ultra-cold muons from the laser ionization region and RF field is used to create some bunches and to accelerate to higher energies."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi003.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI004",
      "title": "Longitudinal Manipulation to Obtain and Keep the Low Emittance and High Charge Electron Beam for SuperKEKB Injector",
      "authors": [
        "M. Yoshida",
        "N. Iida",
        "T. Natsui",
        "Y. Ogawa",
        "S. Ohsawa",
        "H. Sugimoto",
        "L. Zang",
        "X. Zhou",
        "KEK",
        "Ibaraki",
        "Japan",
        "The design strategy of SuperKEKB is based on the.nano-beam scheme. The dynamic aperture decreases due to the very small beta function at the interaction point. Thus the injector upgrade is required to obtain the low emittance and high charge beam corresponding to the short beam life and small injection acceptance. The required beam parameters are 5 nC",
        "20 mm mrad and 4 nC",
        "6 mm mrad for the electron and positron respectively. For the electron beam",
        "we installed new photocathode RF-Gun with the focusing electric field and temporal adjusting laser system. Further the projected emittance dilution in the LINAC is an important issue for the low emittance injection. The longitudinal bunch length and shape is an important key to avoid the space charge effect and emittance dilution. The longitudinal manipulation using the temporal adjusting laser system and the bunch compression will be presented. Further the longitudinal bunch measurement will be also presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi004.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI005",
      "title": "Synchrotron-Radiation Photon Distribution for Highest Energy Circular Colliders",
      "authors": [
        "CINVESTAV",
        "Mérida",
        "Mexico",
        "G. Dugan",
        "D. Sagan",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "CERN",
        "Geneva",
        "Switzerland",
        "At high energies",
        "beam-induced synchrotron radiation is an important source of heating",
        "beam-related vacuum pressure increase",
        "and primary photoelectrons",
        "which can give rise to an electron cloud. The photon distribution along the beam pipe wall is a key input to codes such as ECLOUD and PyECLOUD",
        "which model the electron cloud build-up. For future high-energy colliders",
        "like TLEP or SHE-LHC",
        "photon stops and antechambers are considered in order to facilitate cooling and vacuum pressure control. We use the Synrad3D code developed at Cornell to simulate the photon distribution for the LHC."
      ],
      "institutions": [
        "Funding: Acknowledgements to CINVESTAV, CERN and EPLANET project."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi005.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI009",
      "title": "NICA project at JINR",
      "authors": [
        "G.V. Trubnikov",
        "N.N. Agapov",
        "E.D. Donets",
        "V.V. Fimushkin",
        "E.V. Gorbachev",
        "A. Govorov",
        "E.V. Ivanov",
        "V. Karpinsky",
        "V.D. Kekelidze",
        "H.G. Khodzhibagiyan",
        "A.D. Kovalenko",
        "K.A. Levterov",
        "V.A. Matveev",
        "I.N. Meshkov",
        "V.A. Mikhailov",
        "V. Monchinsky",
        "S. Romanov",
        "N. Shurkhno",
        "A.O. Sidorin",
        "V. Slepnev",
        "A.V. Smirnov",
        "A. Sorin",
        "N.D. Topilin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "O.I. Brovko",
        "A.V. Butenko",
        "E.E. Donets",
        "A.V. Eliseev",
        "O.S. Kozlov",
        "A.V. Philippov",
        "N.V. Semin",
        "A. Tuzikov",
        "V. Volkov",
        "JINR/VBLHEP",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The Nuclotron-based Ion Collider fAcility (NICA) is a new accelerator complex being constructed at JINR aimed to provide the collider experiments with ion-ion (Au79+) and ion-proton collisions at the energy range of 1-4.5 GeV/n and also the collisions of polarized proton-proton and deuteron-deuteron beams. Progress in the project realization is reported.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi009.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI010",
      "title": "The LHCb Online Luminosity Control and Monitoring",
      "authors": [
        "R. Alemany-Fernandez",
        "F. Follin",
        "R. Jacobsson",
        "CERN",
        "Geneva",
        "Switzerland",
        "The online luminosity control consists of an automatic slow real-time feedback system controlled by specific LHCb software",
        "which communicates directly with a LHC software application. The LHC application drives a set of corrector magnets to adjust the transversal beam overlap at the LHCb interaction point in order to keep the instantaneous luminosity aligned to the target luminosity provided by the experiment. It was proposed and tested first in July 2010",
        "and it has been in routine operation during the first two years of physics luminosity data taking",
        "2011 and 2012. This paper describes the operational performance of the LHCb experiment and the LHC accelerator during the luminosity control of the experiment",
        "the accounting of the recorded luminosity and dead time of the detector",
        "and analyses the beam stability during the adjustment of the transverse beam overlap at the interaction point."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi010.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI011",
      "title": "Study and Operational Implementation of a Tilted Crossing Angle in LHCb",
      "authors": [
        "R. Alemany-Fernandez",
        "F. Follin",
        "B.J. Holzer",
        "D. Jacquet",
        "R. Versteegen",
        "J. Wenninger",
        "CERN",
        "Geneva",
        "Switzerland",
        "The current crossing angle scheme at LHCb interaction point (horizontal crossing angle and vertical beam separation) prohibits the use of the LHCb dipole positive polarity for 25 ns bunch spacing operation since the beam separation at the first parasitic encounter is very small inducing unwanted beam encounters. To overcome this limitation a different crossing angle scheme was proposed in 2007 by W. Herr and Y. Papaphilippou. The new schema implies a vertical external crossing angle that together with the horizontal internal crossing angle",
        "from the LHCb dipole and its three compensator magnets",
        "defines a new tilted crossing and separation plane providing enough beam separation at the parasitic encounters. This paper summarizes the feasibility study of the new crossing scheme",
        "the implementation in routine operation and analyzes the beam stability during the building up of the tilted crossing plane."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi011.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI012",
      "title": "HL-LHC: Integrated Luminosity and Availability",
      "authors": [
        "A. Apollonio",
        "M. Jonker",
        "R. Schmidt",
        "B. Todd",
        "S. Wagner",
        "D. Wollmann",
        "M. Zerlauth",
        "CERN",
        "Geneva",
        "Switzerland",
        "The objective of LHC operation is to optimise the output for particle physics by maximising the integrated luminosity. An important constraint comes from the event pile–up for one bunch crossing that should not exceed 140 events per bunch crossing. With bunches every 25 ns the luminosity for data taking of the experiments should therefore not exceed 5*1034 s−1cm-2. For the optimisation of the integrated luminosity it is planned to design HL-LHC for much higher luminosity than acceptable for the experiments and to limit the initial luminosity by operating with larger beam size at the collision points. During the fill",
        "the beam size will be slowly reduced to keep the luminosity constant. The gain from luminosity levelling depends on the average length of the fills. Today",
        "with the LHC operating at 4 TeV",
        "most fills are terminated due to equipment failures",
        "resulting in an average fill length of about 5 h. In this paper we discuss the expected integrated luminosity for HL-LHC as a function of fill length and time between fills",
        "depending on the expected MTBF of the LHC systems with HL-LHC parameters. We derive an availability target for HL-LHC and discuss steps to achieve this."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi012.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI013",
      "title": "LHC Long Shutdown: A Parenthesis for a Challenge",
      "authors": [
        "K. Foraz",
        "M. Arnaud",
        "M.B.M. Barberan Marin",
        "C. Bedel",
        "M. Bernardini",
        "J. Coupard",
        "J. Etheridge",
        "H. Gaillard",
        "S. Grillot",
        "E. Paulat",
        "A.-L. Perrot",
        "CERN",
        "Geneva",
        "Switzerland",
        "After three fruitful years of operation",
        "the LHC will enter a long shutdown. Major works will be implemented to allow running safely at 7TeV/beam. The LHC superconducting circuits will be consolidated; mitigation measures will be carried out to reduce the single event effects occurrence in the frame of the Radiation To Electronics mitigation project (R2E); all the equipment will be fully maintained. In parallel",
        "numerous consolidation and upgrade activities will be performed all around the 27km ring. The schedule has been optimized in order to reduce the length of the shutdown (LS1) to 22 months (including hardware commissioning). The organization of the works is therefore essential to ensure a safe and reliable plan. This paper introduces the various activities to be performed and presents the schedule and the preparation process",
        "including the operational safety aspects."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI014",
      "title": "",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi014.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI015",
      "title": "Study of the IR2 and IR8 Squeezeability for HL-LHC Upgrade",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "CERN",
        "Geneva",
        "Switzerland",
        "The paper presents the results of the study of different optics configurations which allow to reach smaller beta functions at the IP2 and IP8 in the framework of the HL-LHC project. The variants at collision energies must be compatible with the ATS* scheme which provides small beta function at the IP1 and IP5 or provide low beta function for Alice and LHCb during ion operatations. The ones at injection must satisfy injection transfer lines and aperture constraints. The final goal is to find the overlap between the phase advances of all the configuration for IR2 and IR8 respectively",
        "in order to mainting the LHC working point without rematching the remaining insertions.",
        "* S. Fartoukh",
        "‘’An Achromatic Telescopic Squeezing (ATS) Scheme for LHC Upgrade’’",
        "in proceedings of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi015.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI016",
      "title": "Optimization of Triplet Quadrupoles Field Quality for the LHC High Luminosity Lattice at Collision Energy",
      "authors": [
        "Y. Nosochkov",
        "Y. Cai",
        "M.-H. Wang",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "R. De Maria",
        "S.D. Fartoukh",
        "M. Giovannozzi",
        "E. McIntosh",
        "CERN",
        "Geneva",
        "Switzerland",
        "For the high luminosity upgrade of the LHC (HL-LHC)",
        "the beta functions at two interaction points (IP) will be significantly reduced compared to the nominal LHC lattice. This will result in much higher peak beta functions in the inner triplet (IT) quadrupoles adjacent to these IPs. The consequences are a larger beam size in these quadrupoles",
        "higher IT chromaticity",
        "and stronger effects of the IT field errors on dynamic aperture (DA). The IT chromaticity will be compensated using the Achromatic Telescopic Squeezing scheme*. The increased IT beam size will be accommodated by installing large aperture Nb3Sn superconducting quadrupoles with 150 mm coil diameter. The field error tolerances in these magnets must satisfy the required acceptable DA while being reasonably close to realistically achievable field quality. Evaluation of the IT field errors was performed for the LHC upgrade layout version"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi016.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI017",
      "title": "Evaluation of Field Quality for Separation Dipoles and Matching Section Quadrupoles for the LHC High Luminosity Lattice at Collision Energy",
      "authors": [
        "Y. Nosochkov",
        "Y. Cai",
        "M.-H. Wang",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "R. De Maria",
        "S.D. Fartoukh",
        "M. Giovannozzi",
        "E. McIntosh",
        "CERN",
        "Geneva",
        "Switzerland",
        "The high luminosity upgrade of the LHC (HL-LHC) lattice requires new larger aperture magnets to be installed in the low-beta interaction regions (IRs). These include Nb3Sn superconducting (SC) triplet quadrupoles",
        "Nb-Ti SC separation dipoles D1 and D2",
        "and SC Q4 quadrupoles. The upgrade significantly reduces the beta functions at these IRs",
        "producing higher beta functions and larger beam size in these magnets",
        "and requiring a larger aperture. The high beta functions also increase the impact of high order field errors in these new magnets on dynamic aperture (DA). Therefore",
        "to maintain an acceptable DA",
        "new specifications for the magnet field quality are required. Since the IR error effects at collision are dominated by the triplets",
        "their field quality has been studied and specified first*. As a next step",
        "the field errors were added to the D1 and D2 dipoles and Q4 quadrupoles while maintaining the triplet errors to specifications. The impact of the errors on DA has been determined in long term tracking simulations using SixTrack. The optimized field error specifications for the D1",
        "D2 and Q4 magnets are presented.",
        "* Y. Nosochkov",
        "Y. Cai",
        "M-H. Wang",
        "S. Fartoukh",
        "M. Giovannozzi",
        "R. de Maria",
        "E. McIntosh",
        "“Optimization of Triplet Field Quality for the LHC High Luminosity Lattice at Collision Energy”",
        "IPAC 2013."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi017.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI018",
      "title": "A Simplified Magnetic Field Tapering and Target Optimisation for the Neutrino Factory Capture System",
      "authors": [
        "I. Efthymiopoulos",
        "S.S. Gilardoni",
        "O.M. Hansen",
        "G. Prior",
        "CERN",
        "Geneva",
        "Switzerland",
        "University of Oslo",
        "Oslo",
        "Norway",
        "University of Canterbury",
        "Christchurch",
        "New Zealand",
        "In the Neutrino Factory",
        "a 4 MW proton beam with a kinetic energy between 5 and 15 GeV interacts with a liquid mercury jet target in order to produce pions that will decay to muons",
        "which in turn decay to neutrinos. The baseline-capturing layout consists of a series of solenoids producing a tapered magnetic field from 20 T",
        "near the target",
        "down to 1.5 T at the entrance of the drift section where the captured pions decay into muons to produce a useful beam for the machine. In our alternative layout the magnetic field is rapidly squeezed from 20 T to 1.5T using only three solenoids. This layout showed to produce similar performance",
        "having the advantage being simpler and could potentially be made more robust to radiation. Here we report on further optimization studies taking into account the complete path and shape fluctuations of the Hg-jet."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi018.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI019",
      "title": "Magnet Misalignment Studies for the Front-end of the Neutrino Factory",
      "authors": [
        "G. Prior",
        "I. Efthymiopoulos",
        "CERN",
        "Geneva",
        "Switzerland",
        "D.V. Neuffer",
        "P. Snopok",
        "Fermilab",
        "Batavia",
        "USA",
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "In the Neutrino Factory Front-End the muon beam coming from the interaction of a high-power (4 MW) proton beam on a mercury jet target",
        "is transformed through a buncher",
        "a phase rotator and an ionization cooling channel before entering the downstream acceleration system. The muon Front-End channel is densely packed with solenoid magnets",
        "normal conducting radio-frequency cavities and absorber windows (for the cooling section). The tolerance to the misalignment of the different components has to be determined in order on one hand to set the limits beyond which the performance of the Front-End channel would be degraded; on the other hand to optimize the design and assembly of the Front-End cells such that the component alignment can be checked and corrected for where crucial for the performance of the channel. In this paper we will show the results of the simulations of the Front-End channel performance where different components such as magnets",
        "cavities have been randomly shifted or rotated. Detailed simulations have been done in G4BeamLine*. * T. J. Roberts et al. G4BeamLine 2.06 (2010) http://g4beamline.muonsinc.com/"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi019.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI020",
      "title": "Towards a Symmetric Momentum Distribution in the Muon Ionization Cooling Experiment",
      "authors": [
        "University of Oslo",
        "Oslo",
        "Norway",
        "DPNC",
        "Genève",
        "Switzerland",
        "I. Efthymiopoulos",
        "O.M. Hansen",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [
        "The Muon Ionization Cooling Experiment (MICE) is under development at Rutherford Appleton Laboratory (UK). It's a proof-of-principle experiment for ionization cooling, which is a prerequisite for a future Neutrino Factory(NF) or a Muon Collider. The muon beam is designed to have a symmetrical momentum distribution in the cooling channel of the NF. In the MICE beamline pions are captured by a quadrupole triplet, then pion momentum is selected by dipole 1 (D1) after which the pions decay to muons in the decay solenoid. After the decay solenoid, the muon beam momentum is selected by dipole 2 (D2), the beam is focused in two quadrupole triplets and is finally characterized by a set of detectors. By doing a D1-scan of the currents, where the optics parameters are scaled according to the pion momentum, from 238-450 MeV/c the muon momentum distribution is changed. In this paper simulation results from G4Beamline and real data from MICE are presented and compared."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi020.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI021",
      "title": "FLUKA Energy Deposition Studies for the HL-LHC",
      "authors": [
        "L.S. Esposito",
        "F. Cerutti",
        "E. Todesco",
        "CERN",
        "Geneva",
        "Switzerland",
        "The LHC upgrade",
        "planned in about ten years from now",
        "is envisaged to accumulate up to 3000 fb-1 integrated luminosity by running at a peak luminosity of 5 x 1034 cm-2 s−1*. In order to reach such an ambitious goal",
        "the high luminosity insertions need a major redesign implying a 150 mm aperture low-beta Inner Triplet",
        "a superconducting D1 and new quadrupoles in the Matching Section. Energy deposition studies show that degradation of the coil insulator represents the most challenging issue from the radiation impact point of view. We propose a suitable shielding consisting of a beam screen with several mm tungsten absorbers at mid-planes to guarantee not to exceed a few ten MGys. This will also allow a good margin with respect to the risk of radiation induced quenches.",
        "O. Brüning",
        "L. Rossi",
        "\"High Luminosity Large Hadron Collider: A description for the European Strategy Preparatory Group",
        "\" CERN ATS 2012-236."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi021.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI022",
      "title": "Power Load from Collision Debris on the LHC Point 8 Insertion Magnets Implied by the LHCb Luminosity Increase",
      "authors": [
        "L.S. Esposito",
        "F. Cerutti",
        "A. Lechner",
        "A. Mereghetti",
        "A.A. Patapenka",
        "V. Vlachoudis",
        "CERN",
        "Geneva",
        "Switzerland",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "JIPNR-Sosny NASB",
        "Minsk",
        "Belarus",
        "LHCb is aiming to upgrade its goal peak luminosity up to a value of 2 1033 cm-2 s−1 after LS2. We investigate the collision debris impact on the machine elements by extensive FLUKA simulations",
        "showing that the present machine layout is substantially compatible with such a luminosity goal. In particular the installation of a TAS (Target Absorber ofSecondaries",
        "installed in front of the final focus Q1-Q3 quadrupole triplet in the LHC high luminosity insertions) turns out not to be necessary on the basis of the expected peak power deposition in the Q1 superconducting coils. A warm protection may be desirable to further reduce heat load and dose on the D2 recombination dipole",
        "due to the absence of the TAN (Target Absorber of Neutrals",
        "present in Point 1 and 5)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi022.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI023",
      "title": "Optics Design and Lattice Optimisation for the HL-LHC",
      "authors": [
        "B.J. Holzer",
        "R. De Maria",
        "S.D. Fartoukh",
        "CERN",
        "Geneva",
        "Switzerland",
        "R. Appleby",
        "S. Kelly",
        "M.B. Thomas",
        "L.N.S. Thompson",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "CEA",
        "Gif-sur-Yvette",
        "France",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "A. Faus-Golfe",
        "J. Resta",
        "IFIC",
        "Valencia",
        "Spain",
        "K.M. Hock",
        "M. Korostelev",
        "L.N.S. Thompson",
        "A. Wolski",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "CEA/DSM/IRFU",
        "France",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "The luminosity upgrade project of the LHC collider at CERN is based on a strong focusing scheme to reach smallest beam sizes at the collision points. Depending on the available magnet technology (Nb3Sn or NbTi) a number of beam optics has been developed to define the specifications for the new super conducting quadrupoles. In the context of the optics matching new issues have been addressed and new concepts have been used: Quadrupole strength flexibility and chromatic corrections have been studied",
        "as well as the influence of quadrupole fringe fields. The lattice has been optimised including the needs of the foreseen crab cavities and the transition between injection and low β optics had to guarantee smooth gradient changes over a wide range of β* values. Tolerances on misalignments and power converter ripple have been re-evaluated. Finally the combination of the quadrupole strengths in the high luminosity matching sections with those in the neighboring sectors is explained",
        "a key concept of the ATS to reach smallest β* values. This paper presents the results obtained within the HiLumi collaboration Task 2.2 and summarises the main parameters of the project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI024",
      "title": "Influence of the Ats Optics on Intra-Beam Scattering for HL-LHC",
      "authors": [
        "M. Schaumann",
        "R. Bruce",
        "J.M. Jowett",
        "CERN",
        "Geneva",
        "Switzerland",
        "RWTH",
        "Aachen",
        "Germany",
        "In the future High Luminosity (HL-)LHC the influence of intra-beam scattering (IBS) will be stronger than in the present LHC",
        "because of higher bunch intensity",
        "small emittance and new optics. The new ATS-optics scheme modifies the lattice in the arcs around the main interaction points (IP) to provide β* values as small as 0.15m in the IP",
        "however those modifications affect the IBS growth rates. In this paper proton IBS emittance growth rates are calculated with MADX and the Collider Time Evolution (CTE) program for two ATS-optics versions",
        "different settings of the crossing angles and required corrections and various beam conditions at injection (450 GeV) and collision (7 TeV) energy. CTE simulations of the expected luminosity",
        "intensity",
        "emittance and bunch length evolution during fills are also presented"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi024.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI025",
      "title": "Bunch-by-Bunch Analysis of the LHC Heavy-Ion Luminosity",
      "authors": [
        "M. Schaumann",
        "J.M. Jowett",
        "CERN",
        "Geneva",
        "Switzerland",
        "After the first run in 2010",
        "the LHC continued its heavy-ion operation with collisions of lead nuclei in late 2011. The beam dynamics of those high intensity lead beams are strongly influenced by intra-beam scattering (IBS)",
        "especially on the injection plateau. Each batch injected from the SPS spends a different time at injection",
        "introducing significant changes from batch to batch. Within the batches there is an even larger spread imprinted by the SPS injection plateau. This results in a spread of the luminosity produced in each bunch crossing. The particle losses during collisions are dominated by nuclear electromagnetic processes",
        "leading to a non-exponential intensity decay during the fill and short luminosity lifetime at 3.5 Z TeV. The luminosity",
        "emittance",
        "intensity and bunch length evolution of the 2011 run was analysed bunch-by-bunch and compared with simulations. Based on this analysis",
        "estimates of the potential luminosity performance at 6.5 Z TeV",
        "after the present shutdown",
        "are given."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi025.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI026",
      "title": "Investigations of the LHC Emittance Blow-Up during the 2012 Proton Run",
      "authors": [
        "Uni HH",
        "Hamburg",
        "Germany",
        "G. Arduini",
        "P. Baudrenghien",
        "J. Emery",
        "A. Guerrero",
        "W. Höfle",
        "V. Kain",
        "M. Lamont",
        "T. Mastoridis",
        "F. Roncarolo",
        "M. Sapinski",
        "M. Schaumann",
        "R.J. Steinhagen",
        "G. Trad",
        "D. Valuch",
        "CERN",
        "Geneva",
        "Switzerland",
        "About 30 % of the potential luminosity performance is lost through the different phases of the LHC cycle",
        "mainly due to transverse emittance blow-up. Measuring the emittance growth is a difficult task with high intensity beams and changing energies. Improvements of the LHC transverse profile instrumentation helped to study various effects. A breakdown of the growth through the different phases of the LHC cycle is given as well as a comparison with the data from the LHC experiments for transverse beam size. In 2012 a number of possible sources and remedies have been studied. Among these are intra beam scattering",
        "50 Hz noise and the effect of the transverse damper gain. The results of the investigations are summarized in this paper. Requirements for transverse profile instrumentation for post LHC long shutdown operation to finally tackle the emittance growth are given as well."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi026.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI027",
      "title": "Energy Deposition Studies for Fast Losses during LHC Injection Failures",
      "authors": [
        "A. Lechner",
        "A. Alnuaimi",
        "C. Bracco",
        "F. Cerutti",
        "A. Christov",
        "L.S. Esposito",
        "N.V. Shetty",
        "V. Vlachoudis",
        "CERN",
        "Geneva",
        "Switzerland",
        "Several instances of injection kicker magnet (MKI) failures have occurred in the first years of LHC operation",
        "leading to misinjections or to accidental kicks of circulating bunches. In a few cases",
        "MKI modules imparted a partial or an increased beam deflection",
        "resulting in grazing bunch impact on beam-intercepting devices and consequently leading to significant secondary showers to downstream accelerator elements. In this study",
        "we investigate different failure occurrences where miskicked bunches were incident on the injection beam stopper (TDI) and on one of the auxiliary injection collimators (TCLIB)",
        "respectively. FLUKA shower calculations were performed to quantify the energy deposition in superconducting magnets. Different sections of the LHC insertion regions 2 and 8 were studied",
        "including the separation dipole and the inner triplet downstream of the TDI as well as matching section and dispersion suppressor adjacent to the TCLIB. The obtained results are evaluated in view of quench and damage limits."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi027.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI028",
      "title": "Beam Losses Through the LHC Operational Cycle in 2012",
      "authors": [
        "G. Papotti",
        "A.A. Gorzawski",
        "M. Hostettler",
        "R. Schmidt",
        "CERN",
        "Geneva",
        "Switzerland",
        "We review the losses through the nominal LHC cycle for physics operation in 2012. The loss patterns are studied and categorized according to timescale",
        "distribution",
        "time in the cycle",
        "which bunches are affected",
        "whether coherent or incoherent. Possible causes and correlations are identified",
        "e.g. to machine parameters or instability signatures. A comparison with losses in the previous years of operation is also shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi028.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI029",
      "title": "Luminosity Lifetime at the LHC in 2012 Proton Physics Operation",
      "authors": [
        "M. Hostettler",
        "G. Papotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "In 2012",
        "the LHC was operated at 4 TeV flat top energy with beam parameters that allowed exceeding a peak instantaneous luminosity of 7500 (ub*s)-1 and a total of 23 fb-1 integrated luminosity in the ATLAS and CMS experiments. This paper elaborates on the evolution of the LHC luminosity and luminosity lifetime during proton physics fills and through the year 2012. Bunch to bunch differences and the impact of different machine settings are highlighted."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi029.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI030",
      "title": "LHC Machine Developments in 2011-12",
      "authors": [
        "G. Papotti",
        "R.W. Aßmann",
        "F. Zimmermann",
        "CERN",
        "Geneva",
        "Switzerland",
        "In 2011 and 2012 LHC machine development (MD) sessions were performed during dedicated slots of beam time. These MD studies were scheduled and planned well in advance. Study topics reflected the previously agreed priorities",
        "such as further optimizing machine performance",
        "exploring beam parameters beyond design targets",
        "assessing machine limitations",
        "testing new concepts and machine settings",
        "preparing future LHC running in view of the 2013/14 LHC shutdown and the re-commissioning of the LHC at nominal beam energy in 2014/15. We describe the planning",
        "preparation",
        "execution",
        "review",
        "and documentation of these LHC beam studies and highlight some key results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi030.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI031",
      "title": "Effect of Collision Pattern in the LHC on the Beam Stability: Requirements from Experiments and Operational Considerations",
      "authors": [
        "W. Herr",
        "G. Arduini",
        "R. Giachino",
        "E. Métral",
        "G. Papotti",
        "T. Pieloni",
        "CERN",
        "Geneva",
        "Switzerland",
        "X. Buffat",
        "N. Mounet",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Coherent instabilities of bunches in the LHC bunch train can be observed when the tune spread from beam-beam interactions becomes insufficient to ensure Landau damping. In particular these effects are seen on bunches with a reduced number of beam-beam interactions due to their collision pattern. Furthermore",
        "such a reduction of the necessary stability can occur during the processes when the beams are prepared for collisions or during the optimization procedure. We discuss the observations and possible countermeasures",
        "in particular alternatives to the existing beam manipulation processes where such a situation can occur."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi031.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI032",
      "title": "Observation of Instabilities in the LHC due to Missing Head-on Beam-beam Interactions",
      "authors": [
        "W. Herr",
        "G. Arduini",
        "R. Giachino",
        "E. Métral",
        "G. Papotti",
        "T. Pieloni",
        "CERN",
        "Geneva",
        "Switzerland",
        "X. Buffat",
        "N. Mounet",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "We report the observation of coherent instabilities on individual bunches out of the LHC bunch train. These instabilities occured spontaneously after several hours of stable beam while in other cases they were related to the application of a small transverse beam separation during a luminosity optimization. Only few bunches were affected",
        "depending on there collision scheme and following various tests we interprete these instabilities as a sudden loss of Landau damping when the tune spread from the beam-beam interaction became insufficient."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi032.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI033",
      "title": "Colliding During the Squeeze and β* Leveling in the LHC",
      "authors": [
        "EPFL",
        "Lausanne",
        "Switzerland",
        "W. Herr",
        "M. Lamont",
        "T. Pieloni",
        "S. Redaelli",
        "J. Wenninger",
        "CERN",
        "Geneva",
        "Switzerland",
        "While more challenging operationally",
        "bringing the beams into collisions during the β squeeze rather than after presents some advantages. The large tune spread arising from the non-linearity of head-on beam-beam interactions can damp impedance-driven instabilities much more efficiently than external non-linearity such as octupoles presently used in operation. Moreover",
        "colliding during the squeeze allows to level the luminosity",
        "optimizing the pile-up in the experiments without changing the longitudinal distribution of collisions. Operational issues are discussed and experimental results from the LHC are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi033.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI034",
      "title": "Observations of Two-beam Instabilities during the 2012 LHC Physics Run",
      "authors": [
        "EPFL",
        "Lausanne",
        "Switzerland",
        "G. Arduini",
        "X. Buffat",
        "R. Giachino",
        "W. Herr",
        "M. Lamont",
        "N. Mounet",
        "E. Métral",
        "G. Papotti",
        "B. Salvant",
        "J. Wenninger",
        "CERN",
        "Geneva",
        "Switzerland",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "During the 2012 run coherent beam instabilities have been observed in the LHC at 4 TeV",
        "during the betatron squeeze and in collision for special filling patterns. Several studies to characterize these instabilities have been carried out during operation and in special dedicated experiments. In this paper we summarize the observations collected for different machine parameters and the present understanding of the origin of these instabilities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi034.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI035",
      "title": "Head-on and Long range Beam-beam Interactions in the LHC: Effective Tune Spread and Beam Stability due to Landau Damping",
      "authors": [
        "EPFL",
        "Lausanne",
        "Switzerland",
        "W. Herr",
        "N. Mounet",
        "E. Métral",
        "T. Pieloni",
        "CERN",
        "Geneva",
        "Switzerland",
        "We discuss the Landau damping of coherent instabilities in the presence of betatron tune spread. This tune spread can originate from dedicated non-linear magnets such as octupoles",
        "or through the beam-beam interaction. In the latter case we have to distinguish the contribution from head-on and parasitic beam-beam interactions and the collision pattern of different bunches plays an important role. The interplay of these sources of tune spread and the resulting stability is discussed for the case of the LHC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi035.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI036",
      "title": "Observation of Beam Instabilities with Very Tight Collimation",
      "authors": [
        "H. Burkhardt",
        "N. Mounet",
        "T. Pieloni",
        "CERN",
        "Geneva",
        "Switzerland",
        "We report about the observation of instabilities in the LHC in special runs with high β* and very tight collimation down to 2 σ which increases the transverse impedance significantly. The losses appeared primarily on the highest intensity",
        "non-colliding bunches which can be interpreted as evidence for insufficient Landau damping. We describe the beam conditions",
        "observations and possible explanations for the observed effects."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi036.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI037",
      "title": "Collimation Down to 2 Sigma in Special Physics Runs in the LHC",
      "authors": [
        "H. Burkhardt",
        "S. Jakobsen",
        "S. Redaelli",
        "B. Salvachua",
        "G. Valentino",
        "CERN",
        "Geneva",
        "Switzerland",
        "We report on observations with collimation very close to the beam. Primary collimators were moved in small steps down to 2 σ from the beam axis to allow for measurements of very forward proton scattering in special high-beta runs in the LHC. We studied the reduction in intensity as a function of collimator position which provides information about the halo shape. After scraping at 2 σ",
        "collimators were retracted to 2.5 σ. This allowed for measurements of very forward proton-proton scattering with roman pot detectors at 3 σ from the beam axis at acceptable background levels for about an hour. Good background conditions were restored by another scraping with primary collimators at 2 σ. Beam lifetimes and halo repopulation times were found to be sufficiently long to allow for several hours of data taking between scraping in a single LHC fill."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi037.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI038",
      "title": "Operation of the Betatron Squeeze at the LHC",
      "authors": [
        "S. Redaelli",
        "X. Buffat",
        "M. Lamont",
        "G.J. Müller",
        "M. Solfaroli Camillocci",
        "R. Tomás",
        "J. Wenninger",
        "CERN",
        "Geneva",
        "Switzerland",
        "TU Dresden",
        "Dresden",
        "Germany",
        "The betatron squeeze is one of the most delicate operational phases at the large Hadron collider as it entails changes of optics performed at top energy",
        "with full intensities. Appropriate software was developed to handle the squeeze",
        "which ensured an efficient commissioning down to a β* of 60 cm and a smooth operation. Several optics configurations could be commissioned and put in operation for physics. The operational experience of the LHC runs from 2010 until 2012 is presented and the overall performance reviewed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi038.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI039",
      "title": "Optics Performance of the LHC During the 2012 Run",
      "authors": [
        "P. Skowroński",
        "T. Bach",
        "M. Giovannozzi",
        "A. Langner",
        "Y.I. Levinsen",
        "E.H. Maclean",
        "T. Persson",
        "S. Redaelli",
        "T. Risselada",
        "M. Solfaroli Camillocci",
        "R. Tomás",
        "G. Vanbavinckhove",
        "CERN",
        "Geneva",
        "Switzerland",
        "The University of Texas at Austin",
        "Austin",
        "USA",
        "ESS",
        "Lund",
        "Sweden",
        "Chalmers University of Technology",
        "Chalmers Tekniska Högskola",
        "Gothenburg",
        "Sweden"
      ],
      "institutions": [],
      "abstract": "During 2012 the LHC was operating at 4TeV with beta star at ATLAS and CMS interaction points of 0.6m. During dedicated machine studies the nominal LHC optics was also setup with beta star of 0.4m. A huge effort was put into the optics commissioning leading to a record low peak beta-beating of around 7%. We describe the correction procedures and discuss the measurement results.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi039.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI040",
      "title": "Experimental Verification of the CLIC Two-Beam Acceleration Technology  in CTF3",
      "authors": [
        "P. Skowroński",
        "A. Andersson",
        "J. Barranco",
        "B. Constance",
        "R. Corsini",
        "S. Döbert",
        "A. Dubrovskiy",
        "W. Farabolini",
        "E. Ikarios",
        "R.L. Lillestøl",
        "T. Persson",
        "F. Tecker",
        "CERN",
        "Geneva",
        "Switzerland",
        "CEA/DSM/IRFU",
        "France",
        "National Technical University of Athens",
        "Athens",
        "Greece",
        "M. Jacewicz",
        "A. Palaia",
        "R.J.M.Y. Ruber",
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "University of Oslo",
        "Oslo",
        "Norway",
        "Chalmers University of Technology",
        "Chalmers Tekniska Högskola",
        "Gothenburg",
        "Sweden",
        "The Compact Linear Collider (CLIC) International Collaboration is pursuing an extensive R&D program towards a multi-TeV electron-positron collider. In particular",
        "the development of two beam acceleration technology is the focus of the CLIC test facility CTF3. In this paper we summarize the most recent results obtained at CTF3: the results of the studies on the drive beam generation are presented",
        "the achieved two beam acceleration performance is reported and the measured break-down rates and related observations are summarized. The stability of deceleration process performed over 13 subsequent modules and the comparison of the obtained results with the theoretical expectations are discussed. We also outline and discuss the future experimental program."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi040.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI041",
      "title": "Operating the LHC Off-momentum for p-Pb Collisions",
      "authors": [
        "R. Versteegen",
        "R. Bruce",
        "J.M. Jowett",
        "A. Langner",
        "Y.I. Levinsen",
        "E.H. Maclean",
        "M.J. McAteer",
        "T. Persson",
        "S. Redaelli",
        "B. Salvachua",
        "P. Skowroński",
        "M. Solfaroli Camillocci",
        "R. Tomás",
        "G. Valentino",
        "J. Wenninger",
        "CERN",
        "Geneva",
        "Switzerland",
        "JAI",
        "Oxford",
        "United Kingdom",
        "The University of Texas at Austin",
        "Austin",
        "USA",
        "Chalmers University of Technology",
        "Chalmers Tekniska Högskola",
        "Gothenburg",
        "Sweden",
        "University of Malta",
        "Information and Communication Technology",
        "Msida",
        "Malta",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The first high-luminosity p-Pb run at the LHC took place in January-February 2013 at an energy of 4 Z TeV per beam. The RF frequency difference of proton and Pb is about 60 Hz for equal magnetic rigidities",
        "which means that beams move slightly to off-momentum",
        "non-central",
        "orbits during physics when frequencies are locked together. The resulting optical perturbations (\"beta-beating\") restrict the available aperture and required a special correction. This was also the first operation of the LHC with low beta in all four experiments and required a specific collimation set up. Predictions from offline calculations of beta-beating correction are compared with measurements during the optics commissioning and collimator set up."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi041.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI042",
      "title": "Beam Parameters and Luminosity Time Evolution for an 80-km VHE-LHC",
      "authors": [
        "C.O. Domínguez",
        "F. Zimmermann",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Very High Energy LHC (VHE-LHC) is a recently proposed proton-proton collider in a new 80-km tunnel. With a dipole field of 15-20 T it would provide a collision energy of 76-100 TeV c.m. We discuss the VHE-LHC beam parameters and compute the time evolution of luminosity",
        "beam current",
        "emittances",
        "bunch length",
        "and beam-beam tune shift during a physics store. The results for VHE-LHC are compared with those for HE-LHC",
        "a 33-TeV (20-T field) collider located in the existing LHC tunnel."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi042.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI043",
      "title": "Matching Antisymmetric Arc Optics to Symmetric Interaction Region",
      "authors": [
        "J.L. Abelleira",
        "F. Zimmermann",
        "CERN",
        "Geneva",
        "Switzerland",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "Considering a generic double-ring collider",
        "we discuss the matching from an antisymmetric optics in the arcs to a symmetric optics in the interaction region (IR) by means of an antisymmetric matching section (MS). As an example",
        "we present an application to the LHC",
        "for which a symmetric IR with extremely flat beams is under study."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi043.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI044",
      "title": "LHC Optics with Crab-waist Collisions and Local Chromatic Correction",
      "authors": [
        "J.L. Abelleira",
        "S. Russenschuck",
        "F. Zimmermann",
        "CERN",
        "Geneva",
        "Switzerland",
        "C. Milardi",
        "M. Zobov",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "We report the status of the optics design for a local chromatic correction with extremely-flat beams at the LHC. Together with a Large Piwinski angle",
        "this optics opens up the possibility of crab-waist collisions at the LHC",
        "for which a new layout of the LHC insertion region (IR) is needed. We present a complete optics and discuss the parameters of the final \"double-half\" quadrupole."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi044.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI045",
      "title": "Electron-cloud Maps for LHC Scrubbing Optimization",
      "authors": [
        "C.O. Domínguez",
        "F. Zimmermann",
        "CERN",
        "Geneva",
        "Switzerland",
        "Electron-cloud maps as alternative to detailed build-up simulations have already been applied in the past for a few accelerators",
        "e.g. RHIC and the LHC at 7 TeV. We here report a first application of maps to optimize the \"beam scrubbing\" of the LHC arcs at injection energy: Maps are used to efficiently determine the optimum bunch filling pattern which maximizes the electron flux on the chamber wall",
        "while respecting constraints on the central cloud density to ensure beam stability. In addition",
        "new features have been explored",
        "e.g. by introducing thresholds which divide regions where either linear maps or cubic maps best describe the build-up and the decay of an electron cloud. In the near future we plan to extend the map formalism to individual slices in a dipole file in order to represent the vertical \"stripes\"."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI046",
      "title": "The MICE Experiment",
      "authors": [
        "DPNC",
        "Genève",
        "Switzerland",
        "Ionization Cooling is the only practical solution to preparing high brilliance muon beams for a neutrino factory or muon collider. MICE is under development at the Rutherford Appleton Laboratory (UK). It is characterized by exquisite emittance determination by 6D measurement of individual particles",
        "a cooling section comprising 23 MV of acceleration at 200 MHz and 3 liquid hydrogen absorbers totaling 1m of liquid hydrogen on the path of 140-240 MeV/c muons. The beam has already been commissioned successfully and first measurements of beam emittance performed. We are setting up for the final high precision emittance determination and the measurements of cooling in Li Hydrogen. The design offers opportunities to observe cooling with various absorbers and several optics configurations. Results will be compared with detailed simulations of cooling channel performance to ensure full understanding of the cooling process. Progress towards the full cooling experiment with RF re-acceleration will also be reported.",
        "Submitted by the MICE speakers bureau  hoping for a contributed oral  to be give by the spokesperson",
        "prof. A. Blondel"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI049",
      "title": "Studies of 10 GeV Decay Ring Design for the International Design Study of the Neutrino Factory",
      "authors": [
        "D.J. Kelliher",
        "C.R. Prior",
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "N. Bliss",
        "N.A. Collomb",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A. Kurup",
        "J. Pasternak",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "Due to the discovery of large θ13 the final muon storage energy in the baseline solution of International Design Study for the Neutrino Factory (IDS-NF) has been set at 10 GeV. A new racetrack design has been produced for the decay ring to meet this requirement. The details of lattice design and the beam dynamics calculations are discussed. The feasibility of the injection system for both positive and negative muons into the ring is explored in details.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi049.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI051",
      "title": "Optics Transition between Injection and Collision Optics for the HL-LHC Upgrade Project",
      "authors": [
        "M. Korostelev",
        "A. Wolski",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "R. De Maria",
        "S.D. Fartoukh",
        "CERN",
        "Geneva",
        "Switzerland",
        "M. Korostelev",
        "A. Wolski",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Plans for the luminosity upgrade of the LHC collider at CERN (HL-LHC) are based on implementation of magnets with larger apertures in the interaction regions",
        "together with the ATS [*] technique to reach very low values of the beta function at the collision points. The transition from injection to collision optics will be carried out in two stages",
        "and will involve varying the strengths of the quadrupoles within the straight sections. Solutions for the optics transition have to meet a variety of challenging constraints",
        "including constraints on the phase advances and Twiss parameters throughout the straights involved in the transition",
        "specified minimum and maximum strengths of the quadrupoles",
        "etc. Moreover",
        "to minimize the time taken for the transition",
        "the variation of the quadrupole strengths should be as smooth as possible",
        "especially for the strongest quadrupoles. Avoiding changes of slope as much as possible will also minimize hysteresis effects in the super-conducting matching quadrupoles participating to the process. This paper presents one possible solution for the optics transition",
        "calculated for the HLLHCv1.0 version of the optics and layout of the HL-LHC.",
        "* S. Fartoukh",
        "\"An Achromatic Telescopic Squeezing (ATS) Scheme for LHC Upgrade\"",
        "in proceedings of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi051.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI053",
      "title": "Transient Beam Loading Effects in Gas-filled RF Cavities for a Muon Collider",
      "authors": [
        "M. Chung",
        "A.V. Tollestrup",
        "K. Yonehara",
        "Fermilab",
        "Batavia",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "A gas-filled RF cavity can be an effective solution for the development of a compact muon ionization cooling channel. One possible problem expected in this type of cavity is the dissipation of significant RF power through the beam-induced plasmas accumulated inside the cavity (plasma loading). In addition",
        "for the higher muon beam intensity",
        "the effects of the beam itself on the cavity fields in the accelerating mode are non-negligible (beam loading). These beam-cavity interactions induce a transient phase which may be very harmful to the beam quality. In this study",
        "we estimate the transient voltage in a gas-filled RF cavity with both the plasma and conventional beam loading and discuss their compensation methods."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi053.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI054",
      "title": "MICE Spectrometer Solenoid Magnetic Field Measurements",
      "authors": [
        "Fermilab",
        "Batavia",
        "USA",
        "The Muon Ionisation Cooling Experiment (MICE) is designed to demonstrate ionization cooling in a muon beam. Its goal is to measure a 10% change in transverse emittance of a muon beam going through a prototype Neutrino Factory cooling channel section with a 1% accuracy",
        "corresponding to an absolute measurement accuracy of 0.1%. To measure the emittance",
        "MICE uses two solenoidal spectrometers. The Spectrometer Solenoids are designed to have 4 T solenoidal fields",
        "uniform at 3 per mil level in the tracking volumes. Analysis of magnetic field measurements of the Spectrometer Solenoids will be discussed",
        "and results of extracting precise coil positions",
        "angles",
        "and coil radius measurements for input into magnet models will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi054.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI055",
      "title": "Stochastic Injection Scenarios and Performance for NuSTORM",
      "authors": [
        "Fermilab",
        "Batavia",
        "USA",
        "Indiana University",
        "Bloomington",
        "Indiana",
        "USA",
        "At Fermilab",
        "we are developing NuSTORM (Neutrinos from STORed Muons)",
        "a neutrino beam from muon decay in a long straight section of a storage ring. The baseline design for NuSTORM uses what was called “stochastic injection”. In that method",
        "high-energy protons on a nuclear target produce pions that are directed by a chicane into a straight section of the storage ring. Pions that decay within that straight section can provide lower-energy muons that are within the circulating acceptance of the storage ring. This decay acceptance enables injection for multiple storage ring turns without kickers",
        "and muon accumulation can be reasonably high. The design of a muon storage ring with pion injection is described and simulations of acceptance are discussed. Alternative injection approaches are also discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi055.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI056",
      "title": "A Muon Collider as a Higgs Factory",
      "authors": [
        "D.V. Neuffer",
        "Y.I. Alexahin",
        "M.A. Palmer",
        "Fermilab",
        "Batavia",
        "USA",
        "Muons. Inc.",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Because muons connect directly to a standard-model Higgs particle in s-channel production",
        "a muon collider would be an ideal device for precision measurement of the mass and width of a Higgs-like particle",
        "and for further exploration of its production and decay properties. The LHC has seen evidence for a 126 GeV Higgs particle",
        "and a muon collider at that energy could be constructed. Parameters of a high-precision muon collider are presented and the necessary components and performance are described. An important advantage of the muon collider approach is that the spin precession of the muons will enable energy measurements at extremely high accuracy (E/E to 10-6 or better). Extension to a higher-energy higher-luminosity device is also discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi056.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI057",
      "title": "Muon Accelerators for the Next Generation of High Energy Physics Experiments",
      "authors": [
        "M.A. Palmer",
        "S. Brice",
        "A.D. Bross",
        "D.S. Denisov",
        "E. Eichten",
        "R.J. Lipton",
        "D.V. Neuffer",
        "Fermilab",
        "Batavia",
        "USA",
        "Muons. Inc.",
        "USA",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Virginia Polytechnic Institute and State University",
        "Blacksburg",
        "USA",
        "D.M. Kaplan",
        "P. Snopok",
        "Illinois Institute of Technology",
        "Chicago",
        "Illinois",
        "USA",
        "H.G. Kirk",
        "R.B. Palmer",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Muon accelerator technology offers a unique and very promising avenue to a facility capable of producing high intensity muon beams for neutrino factory and multi-TeV lepton collider applications. The goal of the US Muon Accelerator Program is to provide an assessment",
        "within the next 6 years",
        "of the physics potential and technical feasibility of such a facility. This talk will describe the physics opportunities that are envisioned",
        "along with the R&D efforts that are being undertaken to address key accelerator physics and technology questions."
      ],
      "institutions": [
        "Funding: Work supported by the U.S. Department of Energy and the U.S. National Science Foundation"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi057.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI058",
      "title": "Simulation of Beam-induced Gas Plasma in High Gradient RF Field for Muon Colliders",
      "authors": [
        "K. Yonehara",
        "M. Chung",
        "A.V. Tollestrup",
        "Fermilab",
        "Batavia",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "R.P. Johnson",
        "T.J. Roberts",
        "Muons. Inc.",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "SBU",
        "Stony Brook",
        "USA",
        "There is a strong limit of available RF gradient in a vacuum RF cavity under magnetic fields because the magnetic field enhances a dark current density due to electron focusing and increases probability of an electric breakdown. This limits the cooling performance. A dense hydrogen gas filled RF cavity can break this limit because the gas acts as a buffer of dark current. However",
        "RF power loading due to a beam-induced plasma in a dense gas filled RF cavity (plasma loading effect) is crucial to design the practical cavity. Experiment shows that the plasma loading can be mitigated in denser hydrogen gas and by doping a small amount of electronegative gas in the cavity. A complicate plasma chemical reaction should be dominated in such a dense hydrogen gas condition. A beam-induced plasma is simulated by taking into account the plasma chemistry to reproduce the condition by using the supercomputer at LBNL. We will also investigate the space charge effect in a dense gas in this effort."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi058.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI059",
      "title": "Summary of Dense Hydrogen Gas Filled RF Cavity Tests for Muon Acceleration",
      "authors": [
        "K. Yonehara",
        "M. Chung",
        "M.R. Jana",
        "M.A. Leonova",
        "A. Moretti",
        "A.V. Tollestrup",
        "Fermilab",
        "Batavia",
        "USA",
        "B.T. Freemire",
        "P.M. Hanlet",
        "Y. Torun",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "Muons. Inc.",
        "USA",
        "Dense hydrogen gas filled RF cavity has a great potential to accelerate a large phase space muon beam in a strong magnetic field. The concept of novel RF cavity has been demonstrated by using an intense proton beam at Fermilab. The experimental result was agreed extremely well with the conventional dilute plasma physic. Based on the model",
        "the beam-induced plasma in the gas filled RF cavity could be controlled by adding a small amount of electronegative gas in dense hydrogen gas. Overview of these experiments will be shown in this presentation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi059.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI060",
      "title": "Complete Muon Cooling Channel Design and Simulations",
      "authors": [
        "C. Y. Yoshikawa",
        "C.M. Ankenbrandt",
        "R.P. Johnson",
        "Muons. Inc.",
        "USA",
        "Y.S. Derbenev",
        "V.S. Morozov",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "D.V. Neuffer",
        "K. Yonehara",
        "Fermilab",
        "Batavia",
        "USA",
        "Considerable progress has been made in developing promising subsystems for muon beam cooling channels to provide the extraordinary reduction of emittance required for an Energy-Frontier Muon Collider",
        "but lacks an end-to-end design. Meanwhile",
        "the recent discovery of a Higgs-like boson has created interest in the High Energy physics community for a Higgs Factory to investigate its properties and verify whether it is Standard Model or beyond. We present principles and tools to match emittances between and within muon beam cooling subsystems that may have different characteristics. The Helical Cooling Channel (HCC)",
        "which combines helical dipoles and a solenoid field",
        "allows a general analytic approach to guide designs of transitions from one set of cooling channel parameters to another. These principles and tools will be applied to design a complete cooling channel that would be applicable to a Higgs Factory and an Energy Frontier Muon Collider."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi060.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI061",
      "title": "Preliminary Design of a Higgs Factory μ+μ- Storage Ring",
      "authors": [
        "A.V. Zlobin",
        "Y.I. Alexahin",
        "V.V. Kapin",
        "V.V. Kashikhin",
        "N.V. Mokhov",
        "I.S. Tropin",
        "Fermilab",
        "Batavia",
        "USA",
        "A Muon Collider offers unique possibilities for studying the recently found Higgs boson. Higgs bosons can be produced in reasonable amounts in the s-channel",
        "so that the colliding muon beam energy of just 62.5GeV is required. Precision direct measurements of the Higgs boson mass and width is possible due to absence of brems- and beam-strahlung. At the same time",
        "there are difficulties specific to muon colliders: relatively large beam emittance which necessitates quite small beta-function values (~ a few cm) at the interaction point in order to obtain sufficiently high luminosity",
        "as well as superconducting magnet and detector protection from showers generated by muon decay products. Due to these factors",
        "the required aperture of the final focus quadrupoles is very large (up to 0.5 m) posing challenging engineering constraints as well as beam dynamics issues with fringe fields. The first results of a complex approach to these problems in the Higgs Factory collider design are presented which promise luminosities in excess of 1031 cm-2s−1 with a 4 MW proton driver."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi061.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI062",
      "title": "Operational Results of the LHC Luminosity Monitors until LS1",
      "authors": [
        "A. Ratti",
        "S.C. Hedges",
        "J. Jones",
        "H.S. Matis",
        "M. Placidi",
        "W.C. Turner",
        "V.K. Vytla",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "E. Bravin",
        "F. Roncarolo",
        "CERN",
        "Geneva",
        "Switzerland",
        "ESS",
        "Lund",
        "Sweden",
        "The monitors for the high luminosity regions in the LHC have been operating since 2009 to optimize the LHC's luminosity. The devices are gas ionization chambers inside the neutral particle absorber 140 m from the interaction point and monitor showers produced by high energy neutral particles from the collisions. They have the ability to resolve the bunch-by-bunch luminosity as well as to survive the extreme level of radiation in the nominal LHC operation. The devices have operated on a broad range of luminosity",
        "from the initial 1028 until the levels well beyond 1033 reached in 2012. We present operational results of the device during proton and lead ion operations until LS1",
        "which include runs at 40 MHz bunch rate and with p-Pb collisions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi062.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI063",
      "title": "Electromagnetic Coupling between High Intensity LHC Beams and the Synchrotron Radiation Monitor Light Extraction System",
      "authors": [
        "F. Roncarolo",
        "W. Andreazza",
        "A. Bertarelli",
        "E. Bravin",
        "F. Caspers",
        "M. Garlaschè",
        "A. Goldblatt",
        "J-J. Gras",
        "O.R. Jones",
        "T. Lefèvre",
        "E. Métral",
        "A.A. Nosych",
        "B. Salvant",
        "G. Trad",
        "R. Veness",
        "C. Vollinger",
        "M. Wendt",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN LHC is equipped with two Synchrotron Radiation Monitor systems used to characterise transverse and longitudinal beam distributions. Since the end of the 2011 LHC run the light extraction system",
        "based on a retractable mirror",
        "has suffered deformation and mechanical failure that is correlated to the increase in beam intensity. Temperature probes have associated these observations to a strong heating of the mirror support with a dependence on the longitudinal bunch length and shape",
        "indicating the origin as electromagnetic coupling between the beam and the structure. This paper combines all this information with the aim of characterising and improving the system in view of its upgrade during the current LHC shutdown. Beam-based observations are presented along with electromagnetic and thermomechanical simulations and complemented by laboratory measurements",
        "including the study of the RF properties of different mirror bulk and coating materials."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi063.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI064",
      "title": "Beam Induced Plasma Dynamics in a High Pressure Gas-Filled RF Test Cell for use in a Muon Cooling Channel",
      "authors": [
        "B.T. Freemire",
        "P.M. Hanlet",
        "Y. Torun",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "M. Chung",
        "M.R. Jana",
        "M.A. Leonova",
        "A. Moretti",
        "T.A. Schwarz",
        "A.V. Tollestrup",
        "K. Yonehara",
        "Fermilab",
        "Batavia",
        "USA",
        "Politecnico di Torino",
        "Torino",
        "Italy",
        "Muons. Inc.",
        "USA",
        "Filling an RF cavity with a high pressure gas prevents breakdown when the cavity is place in a multi-Tesla external magnetic field. The choice of hydrogen gas provides the additional benefit of cooling a beam of muons. A beam of particles traversing the cavity",
        "be it muons or protons",
        "ionizes the gas",
        "creating an electron-ion plasma which absorbs energy from the cavity. The ionization rate can be calculated from a beam intensity measurement. Energy loss measurements indicate the loading per RF cycle per electron-ion pair range from 10-18 to 10-16 Joules in pure hydrogen",
        "and 10-20 to 10-18 Joules when hydrogen is doped with dry air. The addition of an electronegative gas (oxygen) has been observed to reduce the lifetime of ionization electrons in the cavity to below 1 nanosecond. Additionally",
        "the recombination rate of electrons and hydrogen ions has been measured to be on the order of 10-6 cubic centimeters per second. The recombination mechanism and hydrogen ion species",
        "along with the three-body attachment process of electrons to oxygen",
        "will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi064.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI064",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI065",
      "title": "Muon Ionization Cooling Experiment Step VI",
      "authors": [
        "Illinois Institute of Technology",
        "Chicago",
        "Illinois",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "The Muon Ionization Cooling Experiment (MICE) is a demonstration experiment to prove the viability of cooling a beam of muons for use in a Neutrino Factory and Muon Collider. The ultimate Step VI configuration of the MICE cooling channel",
        "a section of the one proposed in the Neutrino Factory Study II",
        "will demonstrate a 10% reduction in transverse beam emittance measured at the level of 1%. This requires measuring emittance to 0.1%. This measurement will be made using all beam line elements present in the MICE Step IV configuration with the addition of two low-Z absorber modules and two RF-Coupling Coil (RFCC) modules. The RFCC modules each contain four normal-conducting low frequency (201 MHz) RF cavities with a guiding magnetic field provided by a large diameter coupling coil. Each of these cavities will require approximately 1 MW of RF power in a 1 ms pulse at a rate of 1 Hz. The experiment can explore a variety of combinations of momentum",
        "beta function",
        "magnetic field flip or non-flip configurations that will prove precious in the design of future cooling channels. The current status and progress toward Step VI are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi065.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI066",
      "title": "Muon Ionization Cooling Experiment Step VI",
      "authors": [
        "Illinois Institute of Technology",
        "Chicago",
        "Illinois",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "In the Muon Ionization Cooling Experiment (MICE) the transverse emittance of the muon beam is reduced (muon cooling) by passing it through low-Z material",
        "then through RF cavities to compensate for the energy loss. Transverse emittance reduction of the muon beam will be demonstrated for the first time in MICE Step IV configuration using liquid Hydrogen absorbers as well as a variety of solid absorbers. Current status and efforts towards Step IV are summarized",
        "including hardware fabrication and testing",
        "Monte Carlo simulations",
        "track reconstruction algorithms."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi066.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI067",
      "title": "Energy Deposition and Shielding Study of the Front End for the Neutrino Factory",
      "authors": [
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "Fermilab",
        "Batavia",
        "USA",
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "In the Neutrino Factory and Muon Collider muons are produced by firing high energy protons onto a target to produce pions. The pions decay to muons which are then accelerated. This method of pion production results in significant background from protons and electrons",
        "which may result in heat deposition on superconducting materials and activation of the machine preventing manual handling. In this paper we discuss the design of a secondary particle handling system. The system comprises a solenoidal chicane that filters high momentum particles",
        "followed by a proton absorber that reduces the energy of all particles",
        "resulting in the rejection of low energy protons that pass through the solenoid chicane. We detail the design and optimization of the system",
        "its integration with the rest of the muon front end",
        "and energy deposition and shielding analysis in"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi067.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI068",
      "title": "High Power Tests of Alumina in High Pressure RF Cavities for Muon Ionization Cooling Channel",
      "authors": [
        "University of Chicago",
        "Chicago",
        "Illinois",
        "USA",
        "G. Flanagan",
        "R.P. Johnson",
        "F. Marhauser",
        "J.H. Nipper",
        "Muons. Inc.",
        "USA",
        "M.A. Leonova",
        "A. Moretti",
        "M. Popovic",
        "A.V. Tollestrup",
        "K. Yonehara",
        "Fermilab",
        "Batavia",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "It is important to make a compact muon ionization cooling channel to increase the cooling efficiency (muon survival rate",
        "cooling decrement",
        "etc). A proposed scheme to reduce the radial size of RF cavities at a given resonance frequency is to insert a dielectric material into the RF cavity. In vacuum cavities",
        "however",
        "dielectric materials are extremely susceptible to breakdown in high power conditions. High-pressure hydrogen gas has been shown to inhibit breakdown events in RF cavities in strong magnetic fields. An experiment has been designed to test surface breakdown of alumina in RF cavities. A structure has been designed to maximize the parallel field parallel to the surface while bringing the cavity into a desired frequency range (800-810MHz). Alumina is tested in this configuration under high power conditions. The experimental result will be shown in this presentation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi068.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI069",
      "title": "Influence of Proton Beam Emittances on Particle Production off a Muon Collider Target",
      "authors": [
        "X.P. Ding",
        "D.B. Cline",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "J.S. Berg",
        "H.G. Kirk",
        "H. K. Sayed",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "PU",
        "Princeton",
        "New Jersey",
        "USA",
        "N. Souchlas",
        "R.J. Weggel",
        "Particle Beam Lasers",
        "Inc.",
        "Northridge",
        "California",
        "USA",
        "A free-mercury-jet or a free-gallium-jet is considered for the pion-production target at a Muon Collider or Neutrino Factory. Based on a simple Gaussian incident proton beams with an infinitely large Courant-Snyder β parameters",
        "we have previously optimized the geometric parameters of the target to maximize particle production initiated by incoming protons with kinetic energies (KE) between 2 and 16 GeV by using the"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi069.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI069",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI073",
      "title": "Design of Magnets for the Target and Decay Region of a Muon Collider/Neutrino Factory Target",
      "authors": [
        "R.J. Weggel",
        "N. Souchlas",
        "Particle Beam Lasers",
        "Inc.",
        "Northridge",
        "California",
        "USA",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "H.G. Kirk",
        "H. K. Sayed",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "PU",
        "Princeton",
        "New Jersey",
        "USA",
        "The target and decay region of a Muon Collider/Neutrino Factory transports pions and muons in a superconducting solenoid channel that must be protected from radiation damage secondary particles produced by the 4-MW proton beam. For this",
        "He-gas-cooled tungsten beads will be arrayed inside the magnet coils",
        "which leads to large coil radii and high stored magnetic energy (~3 GJ). The design of the superconducting coils",
        "and the tungsten shielding for the ~ 50-m-long target and decay region is reviewed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi073.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI073",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI074",
      "title": "Design of the Final Focus of the Proton Beam for a Neutrino Factory",
      "authors": [
        "J. Pasternak",
        "M. Aslaninejad",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "Fermilab",
        "Batavia",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "PU",
        "Princeton",
        "New Jersey",
        "USA",
        "The ~ 8-GeV",
        "4-MW proton beam that drives a Neutrino Factory has a nominal 50-Hz macropulse structure with 2-3 micropulses ~ 100 ns apart. The nominal geometric beam emittance is 5 micron",
        "and the desired rms beam radius at the liquid-metal-jet target is 1.2 mm. A quadrupole-triplet focusing system to deliver this beam spot is described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi074.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI074",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI075",
      "title": "Optimizing Muon Capture and Transport for a Neutrino Factory/Muon Collider Front End",
      "authors": [
        "H. K. Sayed",
        "J.S. Berg",
        "H.G. Kirk",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "PU",
        "Princeton",
        "New Jersey",
        "USA",
        "In the baseline scheme of the Neutrino Factory/Muon Collider a muon beam from pion decay is produced by bombarding a liquid-mercury-jet target with a 4-MW pulsed proton beam. The target is embedded in a high-field solenoid magnet that is followed by a lower field Decay Channel. The adiabatic variation in solenoid field strength along the beam near the target performs an emittance exchange that affects the performance of the downstream Buncher",
        "Phase Rotator",
        "and Cooling Channel. An optimization was performed using"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi075.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI075",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI076",
      "title": "First RHIC Collider Test Operation at 2.5GeV Beam Energy",
      "authors": [
        "C. Montag",
        "L. A. Ahrens",
        "M. Bai",
        "J. Beebe-Wang",
        "I. Blackler",
        "M. Blaskiewicz",
        "J.M. Brennan",
        "K.A. Brown",
        "D. Bruno",
        "R. Connolly",
        "T. D'Ottavio",
        "K.A. Drees",
        "W. Fischer",
        "C.J. Gardner",
        "X. Gu",
        "M. Harvey",
        "T. Hayes",
        "L.T. Hoff",
        "H. Huang",
        "R.L. Hulsart",
        "J.S. Laster",
        "C. Liu",
        "Y. Luo",
        "G.J. Marr",
        "A. Marusic",
        "F. Méot",
        "K. Mernick",
        "R.J. Michnoff",
        "M.G. Minty",
        "J. Morris",
        "S. Nemesure",
        "V.H. Ranjbar",
        "G. Robert-Demolaize",
        "T. Roser",
        "V. Schoefer",
        "F. Severino",
        "T.C. Shrey",
        "K.S. Smith",
        "S. Tepikian",
        "J.E. Tuozzolo",
        "M. Wilinski",
        "A. Zaltsman",
        "K. Zeno",
        "W. Zhang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "To search for the critical point in the QCD phase diagram",
        "RHIC needs to operate at a set of low gold beam energies between 2.5 and 20 GeV per nucleon. During run 12",
        "first successful collider operation at the lowest energy of 2.5 GeV per nucleon was achieved. We present the challenges and achieved results",
        "and discuss possible future upgrades and improvements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi076.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI076",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI077",
      "title": "Commissioning Progress of the RHIC Electron Lenses",
      "authors": [
        "W. Fischer",
        "Z. Altinbas",
        "M. Anerella",
        "M. Blaskiewicz",
        "D. Bruno",
        "W.C. Dawson",
        "D.M. Gassner",
        "X. Gu",
        "R.C. Gupta",
        "K. Hamdi",
        "J. Hock",
        "L.T. Hoff",
        "R.L. Hulsart",
        "A.K. Jain",
        "P.N. Joshi",
        "R.F. Lambiase",
        "Y. Luo",
        "M. Mapes",
        "A. Marone",
        "R.J. Michnoff",
        "T.A. Miller",
        "M.G. Minty",
        "C. Montag",
        "J.F. Muratore",
        "S. Nemesure",
        "D. Phillips",
        "A.I. Pikin",
        "S.R. Plate",
        "P.J. Rosas",
        "L. Snydstrup",
        "Y. Tan",
        "C. Theisen",
        "P. Thieberger",
        "J.E. Tuozzolo",
        "P. Wanderer",
        "S.M. White",
        "W. Zhang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "In polarized proton operation",
        "the RHIC performance is limited by the head-on beam-beam effect. To overcome these limitations two electron lenses were installed and are under commissioning. One lens uses a newly manufactured superconducting solenoid",
        "in the other lens the spare superconducting solenoid of the BNL Electron Beam Ion Source is installed to allow for propagation of the electron beam. (This spare magnet will be replaced by the same type of superconducting magnet that is also used in the other lens during the 2013 shut-down.) We give an overview of the commissioning configuration of both lenses",
        "and report on first results in commissioning the hardware and electron beam. We also report on lattice modifications needed to adjust the phase advance between the beam-beam interactions and the electron lenses",
        "as well as upgrades to the proton instrumentation for the commissioning."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi077.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI077",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI078",
      "title": "Measurement of the Total Cross Section of Uranium-uranium Collisions at a Center-of-mass Energy of 192.8 GeV per Nucleon-pair",
      "authors": [
        "W. Fischer",
        "A.J. Baltz",
        "M. Blaskiewicz",
        "K.A. Drees",
        "D.M. Gassner",
        "Y. Luo",
        "M.G. Minty",
        "P. Thieberger",
        "M. Wilinski",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "RAS/INR",
        "Moscow",
        "Russia",
        "Heavy ion cross sections totaling several hundred barns have been calculated previously for the Relativistic Heavy Ion Collider (RHIC) and the Large Hadron Collider (LHC). These total cross sections are more than an order of magnitude larger than the geometric ion-ion cross sections",
        "primarily due to Bound-Free Pair Production (BFPP) and Electro-Magnetic Dissociation (EMD). Apart from a general interest in verifying the calculations experimentally",
        "an accurate prediction of the losses created in the heavy ion collisions is of practical interest for the LHC",
        "where some collision products are lost in cryogenically cooled magnets and have the potential to quench these magnets. In the 2012 RHIC run uranium ions collided with each other at a center-of-mass energy of 192.8 GeV per nucleon-pair with nearly all beam losses due to collisions. This allows for the measurement of the total cross section and a comparison with calculations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi078.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI078",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI079",
      "title": "A Proposed “Delay Line” for Hadron Beams in RHIC",
      "authors": [
        "N. Tsoupas",
        "V. Litvinenko",
        "V. Ptitsyn",
        "D. Trbojevic",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "A “delay line” has been proposed to be installed in the Blue ring of the RHIC to accommodate collisions of asymmetric nuclei. The delay line can also be used in the e-RHIC accelerator to accommodate electron hadron collisions at various energies. We will present the layout and the optics of the delay line and we will discuss the energy range that asymmetric collisions can be performed in the RHIC collider.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi079_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi079.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi079_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI079",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI081",
      "title": "Progress with Coherent Electron Cooling Proof-Of-Principle Experiment",
      "authors": [
        "I. Pinayev",
        "S.A. Belomestnykh",
        "I. Ben-Zvi",
        "K.A. Brown",
        "J.C. Brutus",
        "L. DeSanto",
        "A. Elizarov",
        "C. Folz",
        "D.M. Gassner",
        "Y. Hao",
        "R.L. Hulsart",
        "Y.C. Jing",
        "D. Kayran",
        "R.F. Lambiase",
        "V. Litvinenko",
        "G.J. Mahler",
        "M. Mapes",
        "W. Meng",
        "R.J. Michnoff",
        "T.A. Miller",
        "M.G. Minty",
        "P. Orfin",
        "A. Pendzick",
        "F. Randazzo",
        "T. Rao",
        "T. Roser",
        "J. Sandberg",
        "B. Sheehy",
        "J. Skaritka",
        "K.S. Smith",
        "L. Snydstrup",
        "R. Than",
        "R.J. Todd",
        "J.E. Tuozzolo",
        "G. Wang",
        "D. Weiss",
        "M. Wilinski",
        "W. Xu",
        "A. Zaltsman",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "G.I. Bell",
        "J.R. Cary",
        "K. Paul",
        "B.T. Schwartz",
        "S.D. Webb",
        "Tech-X",
        "Boulder",
        "Colorado",
        "USA",
        "C.H. Boulware",
        "T.L. Grimm",
        "R. Jecks",
        "N. Miller",
        "Niowave",
        "Inc.",
        "Lansing",
        "Michigan",
        "USA",
        "M.A. Kholopov",
        "P. Vobly",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "We conduct proof-of-the-principle experiment of coherent electron cooling (CEC)",
        "which has a potential to significantly boost luminosity of high-energy",
        "high-intensity hadron colliders. In this paper",
        "we present the progress with experimental equipment including the first tests of the electron gun and the magnetic measurements of the wiggler prototype. We describe current design status as well as near future plans."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi081_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi081.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi081_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI081",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI082",
      "title": "RHIC Performance for FY2012 Heavy Ion Run",
      "authors": [
        "Y. Luo",
        "J.G. Alessi",
        "M. Bai",
        "E.N. Beebe",
        "J. Beebe-Wang",
        "I. Blackler",
        "M. Blaskiewicz",
        "J.M. Brennan",
        "K.A. Brown",
        "D. Bruno",
        "J.J. Butler",
        "R. Connolly",
        "T. D'Ottavio",
        "K.A. Drees",
        "A.V. Fedotov",
        "W. Fischer",
        "C.J. Gardner",
        "D.M. Gassner",
        "X. Gu",
        "Y. Hao",
        "M. Harvey",
        "T. Hayes",
        "L.T. Hoff",
        "H. Huang",
        "P.F. Ingrassia",
        "J.P. Jamilkowski",
        "N.A. Kling",
        "M. Lafky",
        "J.S. Laster",
        "C. Liu",
        "D. Maffei",
        "Y. Makdisi",
        "M. Mapes",
        "G.J. Marr",
        "A. Marusic",
        "F. Méot",
        "K. Mernick",
        "R.J. Michnoff",
        "M.G. Minty",
        "C. Montag",
        "J. Morris",
        "C. Naylor",
        "S. Nemesure",
        "A.I. Pikin",
        "P.H. Pile",
        "V. Ptitsyn",
        "D. Raparia",
        "G. Robert-Demolaize",
        "T. Roser",
        "P. Sampson",
        "J. Sandberg",
        "V. Schoefer",
        "C. Schultheiss",
        "F. Severino",
        "T.C. Shrey",
        "K.S. Smith",
        "S. Tepikian",
        "P. Thieberger",
        "D. Trbojevic",
        "J.E. Tuozzolo",
        "B. Van Kuik",
        "G. Wang",
        "M. Wilinski",
        "A. Zaltsman",
        "K. Zeno",
        "S.Y. Zhang",
        "W. Zhang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "In the 2012 RHIC heavy ion run",
        "we collided 96.4~GeV U-U ions and 100~GeV Cu-Au ions for the first time in RHIC. The new pre-injector with the electron-beam ion source (EBIS) was used to provide ions for RHIC ion collisions for the first time. By adding the horizontal cooling",
        "the powerful 3-D stochastic cooling largely enhanced the luminosity. With the double bunch merging in the Booster and AGS",
        "the bunch intensities of Cu and Au ions in RHIC surpassed their projections. Both PHENIX and STAR detectors reached their integrated luminosity goals for the U-U and Cu-Au collisions. In this article we review the machine improvement and performance in this run."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi082_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi082.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi082_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI082",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI083",
      "title": "Simulation Study of Head-on Beam-beam Compensation with Realistic RHIC Lattices",
      "authors": [
        "Y. Luo",
        "M. Bai",
        "W. Fischer",
        "C. Montag",
        "V.H. Ranjbar",
        "S. Tepikian",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "We performed numerical simulations to study the effects of head-on beam-beam compensation with the realistic RHIC lattices. To better cancel the beam-beam resonance driving terms during half beam-beam compensation operation",
        "the betatron phase advances between the interaction point IP8 and the center of the electron lens should be multiples of pi. for this purpose two shunt power supplies were added to the main quadrupole circuit buses in the arc between them. For the realistic beam-beam compensation lattices",
        "the integer tunes are (27",
        "29) for the Blue ring and (29",
        "30) for the Yellow ring. The betatron phase advances between IP8 and the e-lens are (8pi",
        "11pi) in the Blue ring and (11pi",
        "9pi) in the Yellow ring. Recent simulation results will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi083_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi083.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi083_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI083",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI084",
      "title": "RHIC Polarized Proton Operation for 2013",
      "authors": [
        "V.H. Ranjbar",
        "L. A. Ahrens",
        "E.C. Aschenauer",
        "M. Bai",
        "J. Beebe-Wang",
        "M. Blaskiewicz",
        "J.M. Brennan",
        "K.A. Brown",
        "D. Bruno",
        "R. Connolly",
        "T. D'Ottavio",
        "K.A. Drees",
        "Y. Dutheil",
        "W. Fischer",
        "C.J. Gardner",
        "J.W. Glenn",
        "X. Gu",
        "M. Harvey",
        "T. Hayes",
        "H. Huang",
        "R.L. Hulsart",
        "A.I. Kirleis",
        "J.S. Laster",
        "C. Liu",
        "Y. Luo",
        "Y. Makdisi",
        "G.J. Marr",
        "A. Marusic",
        "F. Méot",
        "K. Mernick",
        "R.J. Michnoff",
        "M.G. Minty",
        "C. Montag",
        "J. Morris",
        "S. Nemesure",
        "P.H. Pile",
        "A. Poblaguev",
        "V. Ptitsyn",
        "G. Robert-Demolaize",
        "T. Roser",
        "W.B. Schmidke",
        "V. Schoefer",
        "F. Severino",
        "T.C. Shrey",
        "D. Smirnov",
        "K.S. Smith",
        "D. Steski",
        "S. Tepikian",
        "D. Trbojevic",
        "N. Tsoupas",
        "J.E. Tuozzolo",
        "G. Wang",
        "M. Wilinski",
        "K. Yip",
        "A. Zaltsman",
        "A. Zelenski",
        "K. Zeno",
        "S.Y. Zhang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "UCR",
        "Riverside",
        "California",
        "USA",
        "The 2013 operation of the Relativistic Heavy Ion Collider (RHIC) marks the second year of running under the RHIC II era. Additionally this year saw the implementation of several important upgrades designed to push the intensity frontier. Two new E-lenses have been installed",
        "along with a new lattice designed for the E-lens operation. A new polarized proton source which generates about factor of 2 more intensity was commissioned as well as a host of RF upgrades from a new longitudinal damper",
        "Landau cavity in RHIC to a new low level RF and new harmonic structure for the AGS. We present an overview of the challenges and results from this years run."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi084_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi084.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi084_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI084",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI086",
      "title": "A Tapered Six Dimensional Cooling Lattice for a Muon Collider",
      "authors": [
        "D. Stratakis",
        "R.C. Fernow",
        "R.B. Palmer",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "Designs for Neutrino Factories and Muon Colliders use ionization cooling to reduce the emittance of the muon beam prior to acceleration. Two lattices based on the original RFOFO ring design representing different configurations of the magnetic field are considered. One is with a flip magnetic field and one with a non-flip magnetic field configuration that is used to eliminate for possible space-charge effects. The details of the G4Beamline tracking studies of both channels are presented and compared to the independent ICOOL code.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi086_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi086.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi086_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI086",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI087",
      "title": "Alternative Muon Cooling Options based on Particle-Matter-Interaction for a Neutrino Factory",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "CERN",
        "Geneva",
        "Switzerland",
        "D.V. Neuffer",
        "P. Snopok",
        "Fermilab",
        "Batavia",
        "USA",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Illinois Institute of Technology",
        "Chicago",
        "Illinois",
        "USA",
        "An ionization cooling channel is a tightly spaced lattice containing absorbers for reducing the momentum of the muon beam",
        "rf cavities for restoring the momentum and strong solenoids for focusing the beam. Such a lattice is an essential feature of most designs for Neutrino Factories and Muon Colliders. Here",
        "we explore three different approaches for designing ionization cooling channels with periodic solenoidal focusing. Key parameters such as the engineering constraints that are arising from the length and separation between the solenoidal coils are systematically examined. In addition",
        "we propose novel approaches for reducing the peak magnetic field inside the rf cavities by using either a magnetic shield system or a bucked coils configuration. Our lattice designs are numerically examined against two independent codes: The ICOOL and G4BL code. The feasibility of our proposed cooling channels to muon accelerators is examined by applying the proposed lattices to the front-end of a Neutrino Factory."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi087_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi087.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi087_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI087",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPFI088",
      "title": "Space-charge Studies for Ionization Cooling Lattices",
      "authors": [
        "D. Stratakis",
        "R.B. Palmer",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "LLNL",
        "Livermore",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "Intense muon beams provide a promising solution to a variety of applications ranging from nanotechnology to nuclear detections systems and from medical sciences to high energy physics. Production of such intense beam requires the beam to be cooled and ionization cooling via particle matter interaction is considered one of the most practical methods. Here a theoretical and numerical study on space-charge effects on such ionization cooling channels is presented. We show that space-charge can strongly affect the design of muon cooling systems by limiting their minimum cooling rate. Space-charge compensation solutions are discussed and the minimum cooling emittance as a function of the beam charge and pulse width is identified.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupfi088_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupfi088.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupfi088_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPFI088",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 76,
  "scrape_time": "2025-10-10 21:19:15"
}