{
  "session_info": {
    "id": "TUYAS01",
    "name": "TUYAS01 - WG2:Physics and Detectors",
    "url": "https://proceedings.jacow.org/eefact2022/html/tuyas01.htm"
  },
  "papers": [
    {
      "paper_id": "TUYAS0102",
      "title": "High Precision TPC Detection Technology R&D for the High Luminosity Z Physics at CEPC",
      "authors": [
        "L.W. Yu",
        "Y. Chang",
        "H.L. Dai",
        "H.R. Qipresenter",
        "X. She",
        "J. Zhang",
        "IHEP",
        "People’s Republic of China",
        "A few years",
        "the Circular Electron Positron Collider (CEPC) was proposed as a Higgs and high luminosity Z factory in China. The baseline design of a detector concept consists of a tracking system",
        "which is a high precision (about 100 micrometers) spatial resolution Time Projection Chamber (TPC) as the main tracking device in very large 3D volume. TPC detection technology requires longitudinal time resolution of about 100 ns and the physics goals require PID resolution of very good separation power with cluster counting to be considered. A number of critical issues are still remaining regarding the TPC research. The simulation and PID resolution show TPC technology potential to extend Z at the high luminosity. In this talk",
        "we will present the feasibility and status of high precision TPC as the main track detector for CEPC. A smaller prototype TPC has been developed with a drift length of 500 mm",
        "gaseous chamber",
        "20000V field-cage",
        "the low power consumption FEE electronics and DAQ have been commissioned and some studies have been finished. Some updated experimental results including the spatial resolution",
        "the gas gain",
        "the laser track reconstruction and dE/dx will be reported."
      ],
      "institutions": [
        "Funding: National Natural Science Foundation of China (Grant NO.: 11975256) and National Natural Science Foundation of China (Grant NO.: 11535007)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/tuyas0102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/tuyas0102.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/tuyas0102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-TUYAS0102",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUYAS0103",
      "title": "MgB₂ Conductors for Future Detector Magnets",
      "authors": [
        "R. Musenich",
        "S. Farinonpresenter",
        "INFN Genova",
        "Genova",
        "Italy",
        "Since 1978",
        "when the CELLO magnet was manufactured",
        "superconducting detector magnets have been wound using NbTi based",
        "aluminium stabilised conductors. However",
        "other choices are possible and Magnesium Diboride (MgB2) could be an attractive alternative. Due to its characteristics",
        "MgB2 is suitable for low field applications as detector magnets. Magnets wound with MgB2 conductors can be operated at relatively high temperature",
        "between 10 K and 20 K",
        "therefore increasing the cryogenics efficiency in terms of both refrigerator performance and indirect cooling (higher thermal conductivity of materials). Efficiency is not the only advantage in using MgB2 instead of NbTi: higher operating temperature and higher temperature margin lead to higher enthalpy margin",
        "with higher stability respect to quench triggering disturbances. In addition",
        "MgB2 is much cheaper respect to High Temperature Superconductors but more expensive than NbTi. However",
        "cost comparison between Al stabilised NbTi magnets and MgB2 magnets must be made taking into account the entire fabrication process. R&D is necessary to develop the conductor. Detector magnet design must be rethought based on MgB2 conductor features."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/tuyas0103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/tuyas0103.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/tuyas0103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-TUYAS0103",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUYAS0104",
      "title": "Flavour Physics at Future e⁺e⁻ Colliders",
      "authors": [
        "Brown University",
        "Providence",
        "USA",
        "Recently",
        "the outstanding flavor physics potential at Tera-Z has also been investigated. The rich phenomenology of flavored final states offers a complementary way to understand the SM better and scrutinize the physics beyond the Standard Model (BSM) other than through electroweak precision measurements. In this talk",
        "I will give a brief phenomenological overview of the flavor physics program at future circular ee colliders as a Tera-Z plus and some recent progress."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/tuyas0104_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/tuyas0104.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/tuyas0104_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-TUYAS0104",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-11 08:34:43"
}