{
  "session_info": {
    "id": "MOPSPP",
    "name": "MOPSPP - Poster Session",
    "url": "https://proceedings.jacow.org/erl2017/html/mopspp.htm"
  },
  "papers": [
    {
      "paper_id": "MOPSPP001",
      "title": "Study of Microbunching Instability in MESA",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp001.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP002",
      "title": "Development of an ERL RF Control System",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp002.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP003",
      "title": "RF Performance and Beam Parameter Measurement of the 2nd 3.5 Cell SRF Gun for ELBE",
      "authors": [
        "A. Arnold",
        "M. Freitag",
        "P.N. Lu",
        "P. Murcek",
        "H. Vennekate",
        "R. Xiang",
        "HZDR",
        "Dresden",
        "Germany",
        "G. Ciovati",
        "P. Kneisel",
        "L. Turlington",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "In May 2014 the 1st superconducting photo injector (SRF gun) at HZDR was replaced by a new gun",
        "featuring a new resonator and cryostat. The intention for this upgrade was to reach higher beam energy",
        "higher bunch charge and lower emittance at the same time in order to serve user experiments at the superconducting CW accelerator ELBE. In our contribution we will report on the commissioning of the SRF gun by presenting a full set of RF performance results as well as detailed beam parameter measurements up to a bunch charge of 300 pC. Additionally",
        "we will present the results of the first two user experiments (neutron and THz generation) that demonstrated the reliability of this gun concept.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp003.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP004",
      "title": "Investigation of K2CsSb Photocathodes",
      "authors": [
        "V. Bechthold",
        "K. Aulenbacher",
        "M.A. Dehn",
        "S. Friederich",
        "IKP",
        "Mainz",
        "Germany",
        "HIM",
        "Mainz",
        "Germany",
        "The interest in multi alkali antimonide photocathodes",
        "e.g. K2CsSb",
        "for future ERL projects like BERLinPro (Berlin Energy Recovery Linac Prototype) and MESA (Mainz Energy-Recovering Superconducting Accelerator) has grown in recent years. In particular for the case of RF-sources the investigation of the time response is of great importance. In Mainz we are able to synthesize these kinds of photocathodes and investigate their pulse response at 1 picosecond level using a radio frequency streak method. We present on the one hand the cathode plant which is used for synthesizing the multi alkali antimonide photocathodes and on the other hand first measurements showing pulse responses of K2CsSb at 400 nm laser wavelength. Furthermore",
        "an analyzing chamber has been installed",
        "which allows investigation of lifetime under laser heating and in-situ measurements of the work function using a UHV Kelvin Probe."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-ERL2017-",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp004.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP004",
      "page_number": "4",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP005",
      "title": "The Small Thermalized Electron Source at Mainz (STEAM)",
      "authors": [
        "S. Friederich",
        "K. Aulenbacher",
        "IKP",
        "Mainz",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The Small Thermalized Electron Source at Mainz (STEAM) is a photoelectron source which will be operated using NEA GaAs excited near its band gap with an infrared laser wavelength to reach smallest emittances. CST simulations indicate that emittance growth due to vacuum space charge effects can be controlled up to bunch charges of several tens of pC. The goal of the project is to demonstrate that the intrinsical high brightness can still be achieved at such charges. The current status will be presented. reference for this paper ※ https://doi.org/10.18429/JACoW-ERL2017-",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp005.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP005",
      "page_number": "9",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP006",
      "title": "SPOCK - a Triode DC Electron Gun With Variable Extraction Gradient",
      "authors": [
        "L.M. Hein",
        "K. Aulenbacher",
        "V. Bechthold",
        "M.A. Dehn",
        "S. Friederich",
        "C. Matejcek",
        "IKP",
        "Mainz",
        "Germany",
        "The electron source concept SPOCK (Short Pulse Source at KPH) is a 100kV DC source design with variable extraction gradient. Due to its triode inspired design the extraction gradient can be reduced for e.g. investigations of cathode physics",
        "but also enhanced to mitigate space charge effects. In the framework of the MESA-Project (Mainz Energy-Recovering Superconducting Accelerator) its design has been further optimized to cope with space charge dominated electron beams. Although it injects its electron beams directly into the LEBT matching section",
        "which excludes any adjustments of the electron spin",
        "the source SPOCK will allow higher bunch charges than the MESA standard source."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-ERL2017-",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp006.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP006",
      "page_number": "13",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP007",
      "title": "Beam Dynamics and Collimation Following MAGIX at MESA",
      "authors": [
        "B. Ledroit",
        "K. Aulenbacher",
        "IKP",
        "Mainz",
        "Germany",
        "The Mainz Energy-recovering Superconducting Accelerator (MESA) will be an electron accelerator allowing operation in energy-recovery linac (ERL) mode. After the beam hits the target at the MESA Internal Gas Target Experiment (MAGIX)",
        "the beam is phase shifted and recirculated back into the linac sections. These will transfer the kinetic beam energy back to the RF-field by deceleration of the beam and allow for high beam power with low RF-power input. Since most of the beam does not interact with the target",
        "the beam will mostly just pass the target untouched. However",
        "a fraction of the scattered electrons may be in the range outside the accelerator and detector acceptances and therefore cause malicious beam dynamical behavior in the linac sections or even damage to the machine. The goal of this work is to determine the beam behavior upon target passage by simulation and experiment and to protect the machine with a suitable collimation system. The present status of the investigations is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-ERL2017-",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp007.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP007",
      "page_number": "17",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP008",
      "title": "Low Energy Beam Transport System for MESA",
      "authors": [
        "C. Matejcek",
        "K. Aulenbacher",
        "S. Friederich",
        "L.M. Hein",
        "IKP",
        "Mainz",
        "Germany",
        "An important part of the new accelerator MESA (Mainz Energy recovering Superconducting Accelerator) is the low energy beam transport system connecting the 100 keV electron source with the injector accelerator. Here the spin manipulation and the bunch preparation for the injector accelerator take place. Due to the low energy",
        "space charge will be an challenging issue in this part. Therefore",
        "start-to-end simulations were done with a combination of the two particle dynamics codes PARMELA* and CST**. At the moment",
        "a test setup is being built up to check the functionality of devices and compare the beam parameters with the simulation. Here the focus lies on the bunch preparation system because at this part we expect high impact of the space charge by reason of the necessary bunch compression. The advance of the test setup",
        "the simulations and measurements done so far will be shown."
      ],
      "institutions": [],
      "abstract": "* Phase and Radial Motion in Ion Linear Accelerators ** Computer Simulation Technology reference for this paper ※ https://doi.org/10.18429/JACoW-ERL2017-",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp008.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP008",
      "page_number": "20",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP009",
      "title": "Beam Break Up Simulations for the MESA Accelerator",
      "authors": [
        "C.P. Stoll",
        "F. Hug",
        "D. Simon",
        "IKP",
        "Mainz",
        "Germany",
        "MESA is a recirculating superconducting accelerator under construction at Johannes Gutenberg-Universität Mainz. It will be operated in two different modes: the first is the external beam (EB) mode",
        "where the beam is dumped after being used at the experiment. The required beam current in EB mode is 150 µA with polarized electrons at 155 MeV. In the second operation mode MESA will be run as an energy recovery linac (ERL) with an unpolarized beam of 1 mA at 105 MeV. In a later construction stage of MESA the achievable beam current in ERL-mode shall be upgraded to 10 mA. To understand the behavior of the superconducting cavities under recirculating operation with high beam currents simulations of beam breakup have to be performed. Current results for transverse beam break up calculations and simulations with Beam Instability (bi) code are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-ERL2017-",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp009.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP009",
      "page_number": "26",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP011",
      "title": "Resonant Coherent Diffraction Radiation System at KEK-cERL",
      "authors": [
        "Y. Honda",
        "A. Aryshev",
        "T. Miyajima",
        "T. Obina",
        "R. Ryukou",
        "M. Shimada",
        "R. Takai",
        "N. Yamamoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "Coherent radiation from a short bunched electron beam has been expected to be a high power source in THz regime. Especially the feature of the modern energy recovery linac is suitable for a high averaged power source. We propose to test an advanced scheme of resonantly exciting coherent diffraction radiation in an optical cavity. By stimulating the radiation in a multi-bunch beam",
        "highly enhanced radiation power can be extracted. This system can excite all the cavity longitudinal modes at the same time",
        "it can be a broadband source. We are preparing an experimental setup to test the resonant radiation in the cERL at KEK.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp011.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP012",
      "title": "Identification of Ion Bombardment Area on the Photocathode After 900 µA CW Beam Operation at cERL",
      "authors": [
        "M. Yamamoto",
        "Y. Honda",
        "X.J. Jin",
        "T. Miyajimapresenter",
        "T. Obina",
        "KEK",
        "Ibaraki",
        "Japan",
        "e-JAPAN IT Co. Ltd",
        "Hitachi",
        "Japan",
        "Toshiba",
        "Yokohama",
        "Japan",
        "QST",
        "Tokai",
        "Japan",
        "Tohoku University",
        "Research Center for Electron Photon Science",
        "Sendai",
        "Japan",
        "Compact-ERL (cERL) which is under development as an ERL demonstration machine at KEK succeeded in stable supply of CW beam exceeding 900 uA from a GaAs photocathode mounted on a DC-gun in March 2016. In the case of high current beam operation",
        "the ions generated by collision of the beam and the residual molecules on the beam axis is increase and its flow back to the electron gun. As a result",
        "the quantum efficiency (QE) of the photocathode decreases due to ion bombardment is the main factor of determining the cathode lifetime. After the CW operation of the accumulated extracted charge of ~10 Coulomb",
        "steady decrease in QE due to ion bombardment has not yet been clearly confirmed. In order to analyze the area damaged by ion bombard",
        "2D QE distribution (QE map) measurement system was newly installed in the cathode preparation system. From QE map analysis before and after the CW operation",
        "we confirmed two types of QE decrease. The area about 2 mm diameter near the center of the photocathode that the QE recovery is insufficient by the reactivation process is presumed the damage by ion bombardment.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp012.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP013",
      "title": "Proposal of Sharing 6-GeV Class CW Superconducting Linac With ILC and High Brilliance X-ray Light Source",
      "authors": [
        "M. Shimada",
        "M. Yamamoto",
        "K. Yokoya",
        "KEK",
        "Ibaraki",
        "Japan",
        "QST",
        "Tokai",
        "Japan",
        "We propose sharing of the 6-GeV class CW superconducting linac with ILC and X-ray light source. ILC utilizes it for the positron source and the two boosters for the 5-GeV damping ring. The conventional positron source",
        "which is based on a collision of the multi-GeV electron with the target",
        "was chosen to lengthen the macro-pulse duration for avoiding the heat loading. In this proposal",
        "the CW linac realizes the long macro-pulse duration beam operation of the positron beam as well as the electron for collision with the target. Simultaneously",
        "the CW linac can used as the 5-GeV booster of the polarized electron beam at the same bunch pattern. Because of the low average current of beams of ILC",
        "the CW linac have enough ability to accelerate/decelerate the high quality electron beam for the high brilliant X-ray light source such as 6-GeV class ERL light source and XFELO. Each electron beam has different injection energy",
        "injects at the different merger and accelerates at the different RF phase. Therefore",
        "the electron energies are different at the end of the CW linac and it makes the simultaneous operation possible.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp013.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP015",
      "title": "Development of a Multialkali Photocathode DC Gun for High Current Operation",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp015.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP015",
      "page_number": "29",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP016",
      "title": "Discharge Mechanism of Ultra-High Vacuum Gap Derived From the HV Conditioning Result of the cERL DC-Gun",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "QST",
        "Tokai",
        "Japan",
        "Tohoku University",
        "Research Center for Electron Photon Science",
        "Sendai",
        "Japan",
        "Development of a high brightness electron beam source is indispensable for realizing high repetition X-FEL and CW EUV-FEL as a next generation light source. The high voltage (HV) DC-gun that realized acceleration voltage of > 500 kV and electric field of > 5 MV/m is one of the candidates. In order to stably DC-gun operation",
        "the HV conditioning process is an essential step as preparation of DC-gun operation. The HV conditioning was carried out on compact-ERL (cERL) electron gun and clarified the following four points. i) The voltage at which discharge stops (discharge stop voltage) exists",
        "ii) The discharge stop voltage increases almost continuously with the number of discharges",
        "iii) The gas released at the occurrence of discharge is almost proportional to the difference between the discharge start voltage and the discharge stop voltage",
        "iv) The hold-off time of the voltage is very long under the discharge stop voltage. We focused on the electron stimulated desorption (ESD) phenomenon occurring at the anode can explain these phenomena in a consistent and considered the mechanism of discharge generation in DC field and HV conditioning progression in ultrahigh vacuum (UHV).",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "N. Nishimoripresenter N. Nishimoripresenter reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp016.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPSPP017",
      "title": "Energy Distribution and Work Function Measurements for Metal Photocathodes With Measured Levels of Surface Roughness",
      "authors": [
        "T.S. Beaver",
        "L.B. Jones",
        "B.L. Militsyn",
        "T.C.Q. Noakes",
        "R. Valizadeh",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/mopspp017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/mopspp017.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/mopspp017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-MOPSPP017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 15,
  "scrape_time": "2025-10-10 17:05:11"
}