{
  "session_info": {
    "id": "TUYE",
    "name": "TUYE - Computing and Data Science for Acc Sys",
    "url": "https://proceedings.jacow.org/napac2022/html/tuye.htm"
  },
  "papers": [
    {
      "paper_id": "TUYE1",
      "title": "Coulomb Crystals in Storage Rings for Quantum  Information Science",
      "authors": [
        "BNL",
        "Upton",
        "New York",
        "USA",
        "A. Aslam",
        "S. Biedron",
        "T.B. Bolin",
        "C. Gonzalez-Zacarias",
        "S.I. Sosa Guitron",
        "UNM-ECE",
        "Albuquerque",
        "USA",
        "SBU",
        "Stony Brook",
        "USA",
        "Stony Brook University",
        "Stony Brook",
        "New York",
        "USA",
        "Quantum information science is a growing field that promises to take computing into a new age of higher performance and larger scale computing as well as being capable of solving problems classical computers are incapable of solving. The outstanding issue in practical quantum computing today is scaling up the system while maintaining interconnectivity of the qubits and low error rates in qubit operations to be able to implement error correction and fault-tolerant operations. Trapped ion qubits offer long coherence times that allow error correction. However",
        "error correction algorithms require large numbers of qubits to work properly. We can potentially create many thousands (or more) of qubits with long coherence states in a storage ring. For example",
        "a circular radio-frequency quadrupole",
        "which acts as a large circular ion trap and could enable larger scale quantum computing. Such a Storage Ring Quantum Computer (SRQC) would be a scalable and fault tolerant quantum information system",
        "composed of qubits with very long coherence lifetimes."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuye1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuye1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuye1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUYE1",
      "page_number": "296",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYE2",
      "title": "Next Generation Computational Tools for the Modeling and Design of Particle Accelerators at Exascale",
      "authors": [
        "A. Huebl",
        "R. Lehé",
        "C.E. Mitchell",
        "J. Qiang",
        "R.D. Ryne",
        "R.T. Sandberg",
        "J.-L. Vay",
        "LBNL",
        "Berkeley",
        "USA",
        "Particle accelerators are among the largest",
        "most complex devices. To meet the challenges of increasing energy",
        "intensity",
        "accuracy",
        "compactness",
        "complexity and efficiency",
        "increasingly sophisticated computational tools are required for their design and optimization. It is key that contemporary software take advantage of the latest advances in computer hardware and scientific software engineering practices",
        "delivering speed",
        "reproducibility and feature composability for the aforementioned challenges. A new open source software stack is being developed at the heart of the Beam pLasma Accelerator Simulation Toolkit (BLAST) by LBNL and collaborators",
        "providing new particle-in-cell modeling codes capable of exploiting the power of GPUs on Exascale supercomputers. Combined with advanced numerical techniques",
        "such as mesh-refinement",
        "and intrinsic support for machine learning",
        "these codes are primed to provide ultrafast to ultraprecise modeling for future accelerator design and operations.",
        "[1] J.-L. Vay",
        "A. Huebl",
        "et al",
        "Phys. Plasmas 28",
        "023105 (2021)  [2] J.-L. Vay",
        "A. Huebl",
        "et al",
        "J. Instr. 16",
        "T10003 (2021) [3] A. Myers",
        "et al (incl. A. Huebl)",
        "Parallel Comput. 108",
        "102833 (2021)"
      ],
      "institutions": [
        "Funding: Work supported by the Exascale Computing Project (17-SC-20-SC), a collaborative effort of the U.S. DOE SC and the NNSA, resources of NERSC, and by LBNL LDRD under DOE Contract DE-AC02-05CH11231."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuye2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuye2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuye2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUYE2",
      "page_number": "302",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYE3",
      "title": "An Open-Source Based Data Management and Processing Framework on a Central Server for Scientific Experimental Data",
      "authors": [
        "A. Liu",
        "J.R. Callahan",
        "S. Poddar",
        "W. Si",
        "Euclid TechLabs",
        "Solon",
        "Ohio",
        "USA",
        "AJS Smartech LLC",
        "Naperville",
        "TX",
        "USA",
        "The ever-expanding size of accelerator operation and experimental data including those generated by electron microscopes and beamline facilities renders most proprietary software inefficient at managing data. The Findability",
        "Accessibility",
        "Interoperability",
        "and Reuse (FAIR) principles of digital assets require a convenient platform for users to share and manage data on. An open-source data framework for storing raw data and metadata",
        "hosting databases",
        "and providing a platform for data processing and visualization is highly desirable. In this paper",
        "we present an open-source",
        "infrastructure-independent data management software framework",
        "named by Euclid-NexusLIMS",
        "to archive",
        "register",
        "record",
        "visualize and process experimental data. The software was targeted initially for electron microscopes",
        "but can be widely applied to all scientific experimental data."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuye3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuye3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuye3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUYE3",
      "page_number": "307",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYE4",
      "title": "Machine Learning for Anomaly Detection and Classification in Particle Accelerators",
      "authors": [
        "I. Lobach",
        "M. Borland",
        "K.C. Harkay",
        "N. Kuklev",
        "A. Sannibale",
        "Y. Sun",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "We explore the possibility of using a Machine Learning (ML) algorithm to identify the source of occasional poor performance of the Particle Accumulator Ring (PAR) and the Linac-To-PAR (LTP) transport line",
        "which are parts of the injector complex of the Advanced Photon Source (APS) at Argonne National Lab. The cause of reduced injection or extraction efficiencies may be as simple as one parameter being out of range. Still",
        "it may take an expert considerable time to notice it",
        "whereas a well-trained ML model can point at it instantly. In addition",
        "a machine expert might not be immediately available when a problem occurs. Therefore",
        "we began by focusing on such single-parameter anomalies. The training data were generated by creating controlled perturbations of several parameters of PAR and LTP one-by-one",
        "while continuously logging all available process variables. Then",
        "several ML classifiers were trained to recognize certain signatures in the logged data and link them to the sources of poor machine performance. Possible applications of autoencoders and variational autoencoders for unsupervised anomaly detection and for anomaly clustering were considered as well."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuye4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuye4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuye4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUYE4",
      "page_number": "311",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYE5",
      "title": "Multiobjective Optimization of the LCLS-II Photoinjector",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "T.H. Chang",
        "S.T.P. Hudson",
        "J.M. Larson",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Stanford University",
        "Stanford",
        "California",
        "USA",
        "Genetic algorithms and particle swarm optimization are currently the most widely used optimization algorithms in the accelerator physics community. These algorithms can take many evaluations to find optimal solutions for one machine prototype. In this work",
        "the LCLS-II photoinjector is optimized with three optimization algorithms: a genetic algorithm",
        "a surrogate based algorithm",
        "and a multi-start scalarization method. All three algorithms were able to optimize the photoinjector",
        "with various trade-offs for each method discussed here."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuye5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuye5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuye5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUYE5",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUYE6",
      "title": "High-Fidelity Simulations and Machine Learning for Accelerator Design and Optimization",
      "authors": [
        "MIT",
        "Cambridge",
        "Massachusetts",
        "USA",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Computation has become a critically important tool for particle accelerator design and optimization. Thanks to massively parallel codes running on high-performance clusters",
        "we can now accurately predict emergent properties of particle ensembles and non-linear collective effects",
        "and use machine learning (ML) for analysis and to create \"virtual twins\" of accelerator systems. Here",
        "we will present the IsoDAR experiment in neutrino physics as an example. For it",
        "we have developed a compact and cost-effective cyclotron-based driver to produce very high-intensity beams. The system will be able to deliver cw proton currents of 10 mA on target in the energy regime around 60 MeV. 10 mA is a factor of 10 higher than commercially available machines. This increase in current is possible due to longitudinal-radial coupling through space charge",
        "an effect dubbed \"vortex motion\". We will discuss the high-fidelity OPAL simulations performed to simulate this effect in the IsoDAR cyclotron and predict beam losses due to halo formation. We will present uncertainty quantification for this design and we will show our study to optimize the IsoDAR injector RFQ using ML."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuye6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuye6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuye6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUYE6",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:15:59"
}