{
  "session_info": {
    "id": "TUSH3",
    "name": "TUSH3 - Speakers' Corner",
    "url": "https://proceedings.jacow.org/icalepcs2017/html/tush3.htm"
  },
  "papers": [
    {
      "paper_id": "TUSH302",
      "title": "uSOP: An Embedded Linux Board for the Belle2 Detector Controls",
      "authors": [
        "G. Tortone",
        "A. Anastasio",
        "V. Izzo",
        "INFN-Napoli",
        "Napoli",
        "Italy",
        "A. Aloisio",
        "F. Di Capua",
        "R. Giordano",
        "University of Naples",
        "Napoli",
        "Italy",
        "INFN-Roma1",
        "Rome",
        "Italy",
        "roma3",
        "Rome",
        "Italy",
        "Control systems for scientific instruments and experiments would benefit from hardware and software platforms that provide flexible resources to fulfill various installation requirements. uSOP is a Single Board Computer based on ARM processor and Linux operating system that makes it possible to develop and deploy easily various control system frameworks (EPICS",
        "Tango) supporting a variety of different buses (I2C",
        "SPI",
        "UART",
        "JTAG)",
        "ADC",
        "General Purpose and specialized digital IO. In this work we present a live demo of a uSOP board",
        "showing a running IOC for a simple control task. We also describe the deployment of uSOP as a monitoring system architecture for the Belle2 experiment",
        "presently under construction at the KEK Laboratory (Tsukuba",
        "Japan)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/tush302_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/tush302.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/tush302_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-TUSH302",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUSH303",
      "title": "Managing your Timing System as a Standard Ethernet Network",
      "authors": [
        "A. Wujek",
        "G. Daniluk",
        "M.M. Lipinski",
        "CERN",
        "Geneva",
        "Switzerland",
        "GNUDD",
        "Pavia",
        "Italy",
        "White Rabbit (WR) is an extension of Ethernet which allows deterministic data delivery and remote synchronization of nodes with accuracies below 1 nanosecond and jitter better than 10 ps. Because WR is Ethernet",
        "a WR-based timing system can benefit from all standard network protocols and tools available in the Ethernet ecosystem. This paper describes the configuration",
        "monitoring and diagnostics of a WR network using standard tools. Using the Simple Network Management Protocol (SNMP)",
        "clients can easily monitor with standard monitoring tools like Nagios",
        "Icinga and Grafana e.g. the quality of the data link and synchronization. The former involves e.g. the number of dropped frames; The latter concerns parameters such as the latency of frame distribution and fibre delay compensation. The Link Layer Discovery Protocol (LLDP) allows discovery of the actual topology of a network. Wireshark and PTP Track Hound can intercept and help with analysis of the content of WR frames of live traffic. In order to benefit from time-proven",
        "scalable",
        "standard monitoring solutions",
        "some development was needed in the WR switch and nodes."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2017/talks/tush303_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2017/papers/tush303.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2017/posters/tush303_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2017-TUSH303",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 18:17:11"
}