{
  "session_info": {
    "id": "WEYAS01",
    "name": "WEYAS01 - WG11: RF",
    "url": "https://proceedings.jacow.org/eefact2022/html/weyas01.htm"
  },
  "papers": [
    {
      "paper_id": "WEYAS0102",
      "title": "Recent Progress with the LHC Crab Cavities",
      "authors": [
        "CERN",
        "Meyrin",
        "Switzerland",
        "The HL-LHC requires beam crabbing to recover geometric luminosity loss from the nonzero crossing angle at the two high luminosity interaction points. A first demonstration experiment of crabbing with hadron beams was successfully carried out with high energy protons in 2018 with two double quarter wave cavities. Several beam physics experiments were performed since to characterize the cavity performance and operational aspects which are briefly summarized in this paper. In parallel",
        "two RF dipole crab cavities used for the compensation in the horizontal plane were recently manufactured and being assembled into a cryomodule for beam tests in 2024. This paper will highlight the main production sequence of the RF dipole preparations and summarize the recent status of the series production for HL-LHC at CERN and collaborating institutes."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/weyas0102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/weyas0102.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/weyas0102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-WEYAS0102",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEYAS0104",
      "title": "Thin Films Activities within the IFAST Program",
      "authors": [
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France"
      ],
      "institutions": [],
      "abstract": "Now that bulk Nb technology has reached it full maturity, improving SRF technology demands that new materials need to be developed. For reasons explained in the talk, all next generation SRF materials will be in the form of thin films. The IFAST project has the ambition to coordinate European activities on that topic, not only throughout its own program (that will be presented here), but also by keeping in touch with all actors worldwide, with the hope of developing a more efficient collaborative actions, in a limited funding context. In this talk, we will present the challenges presented by the development of new thin films materials, each developed for tailored applications and the main research direction proposed by the thin film community.",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/weyas0104_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/weyas0104.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/weyas0104_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-WEYAS0104",
      "page_number": "159",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 08:35:12"
}