{
  "session_info": {
    "id": "THCAMH",
    "name": "THCAMH - Synchrotron radiation sources and free electron laser",
    "url": "https://proceedings.jacow.org/rupac2018/html/thcamh.htm"
  },
  "papers": [
    {
      "paper_id": "THCAMH01",
      "title": "Siberian Circular Photons Source \"SKIF\". Project review.",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The main problem of the Siberian Synchrotron and Terahertz Radiation Center (SSTRC) is absence of the modern light source. In spite of intensive exploring of SR beams and SR analytic techniques of the SSTRC by a large number of user groups",
        "the SR parameters of the currently used beams strongly restrict capability of the used techniques. Budker INP has rich experience and technologies for developing and building complex accelerator facilities. Moreover",
        "the unique scientific environment of the SSTRC provides a high demand for modern light source in the Novosibirsk Scientific Center only. Thus",
        "the creation of the new light source is highly relevant issue. After analysis of the user requirements and modern accelerator approaches for design of magnetic lattice for high brightness light source the Budker team proposed an option of the magnetic structure of a new light source for Novosibirsk Scientific Center. The project was named \"SKIF\". Current report describes the main parameters for the proposed light source as well as common design of the accelerator complex",
        "magnetic structure of the main ring and buster accelerator. The preliminary scedule and systems cost analysis are included."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/thcamh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/thcamh01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/thcamh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-THCAMH01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THCAMH02",
      "title": "Solitary and Shock Waves in Free and Magnetized Quasi-neutral Laser Induced Plasmas",
      "authors": [
        "IFIN-HH",
        "Bucharest - Magurele",
        "Romania",
        "Starting from the Vlasov-Maxwell equations describing the dynamics of various species in a free quasi-neutral plasma",
        "an exact relativistic hydrodynamic closure for a special type of water-bag distributions satisfying the Vlasov equation has been derived. It has been shown that the set of equations for the macroscopic hydrodynamic variables coupled to the wave equations for the self-consistent electromagnetic field is equivalent to the Vlasov-Maxwell system. In the case of magnetized quasi-neutral plasma",
        "the hydrodynamic substitution has been used to derive the hydrodynamic equations for the plasma density and current velocity",
        "coupled to the wave equations for the self-consistent electromagnetic fields. Based on the method of multiple scales",
        "a system comprising a vector nonlinear Schrodinger equation for the transverse envelopes of the self-consistent plasma wakefield",
        "coupled to a scalar nonlinear Schrodinger equation for the electron current velocity envelope for free plasma",
        "has been derived. In the case of magnetized plasma",
        "it has been shown that the whistler wave envelopes of the three basic modes satisfy a system of three coupled nonlinear Schrodinger equations. Numerical examples for typical plasma parameters have been presented",
        "which demonstrate the relevance of the results thus obtained to the so-called shock laser-plasma acceleration. In addition",
        "it has been shown that in the case of magnetized plasma",
        "the whistler waves facilitate the transverse confinement considerably."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/thcamh02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/thcamh02.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/thcamh02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-THCAMH02",
      "page_number": "88",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 02:21:46"
}