{
  "session_info": {
    "id": "TUOPMA",
    "name": "TUOPMA - Accelerators",
    "url": "https://proceedings.jacow.org/medsi2018/html/tuopma.htm"
  },
  "papers": [
    {
      "paper_id": "TUOPMA01",
      "title": "Status of the European XFEL Photon Beam Systems",
      "authors": [
        "XFEL. EU",
        "Schenefeld",
        "Germany",
        "The European XFEL",
        "a fourth generation Free-Electron-Laser facility in Hamburg area (Germany)",
        "start-ed user operation in September 2017. In full operation the novel facility will produce at MHz repetition rate coherent femtosecond pulses with unprecedented brilliance in the energy range from 250 eV to 25 keV. The facility comprises of a linear accelerator and three photon beamlines:"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/tuopma01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/tuopma01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/tuopma01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-TUOPMA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUOPMA02",
      "title": "Mechanical Engineering for SCLF Accelerator",
      "authors": [
        "L. Yin",
        "R.B. Deng",
        "H.W. Du",
        "X. Hu",
        "Z. Jiang",
        "Y. Liu",
        "S. Sun",
        "W. Zhang",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "The Shanghai Coherent Light Facility (SCLF) is a hard X-ray free electron laser facility under construction. It is designed to deliver photons from 400eV to 25keV at a repetition rate as high as 1MHz based on an 8GeV superconducting LINAC. The radiator section consists of two variable gap undulator lines and one superconducting undulator line. The main accelerator locates in the 3km tunnel",
        "with 30m underground depths. The mechanical engineering",
        "including the vibration on site ground and in the underground tunnel",
        "the consideration of the tunnel sedimentation monitoring and compensation",
        "as well as the structure design of the main components and it's support are described in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/tuopma02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/tuopma02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/tuopma02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-TUOPMA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUOPMA03",
      "title": "Development of the new UE38 Undulator for the Athos Beamline in SwissFEL",
      "authors": [
        "H. Jöhri",
        "M. Calvi",
        "M. Hindermann",
        "L. Huber",
        "A. Keller",
        "M. Locher",
        "T. Schmidt",
        "X. Wang",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "For the next beamline",
        "we will profit from the experience of the U15 undulator development",
        "but there are new requirements",
        "because it will be a polarized undulator with a period of 38mm. We are developing a new arrangement of the drives",
        "a further development of the magnet keepers and a vacuumpipe with only 0.2mm of wall thickness. A rough overview was given at Medsi 2016",
        "together with the talk of the U15 Undulator. Meentime",
        "the UE38 is in production and the talk will present the actual status and the lessons we learned during development and the fabrication: - Realization of vacuumchamber with 0.2mm wall thickness - Supportstructure for the vacuumchamber - Precision of manufacturing - Precision of assembling - Design of Magnetkeeper: Differential screw",
        "forces",
        "stiffness"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/tuopma03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/tuopma03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/tuopma03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-TUOPMA03",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOPMA04",
      "title": "Apple II Insertion Devices Made at MAXIV",
      "authors": [
        "A. Thiel",
        "M. Ebbeni",
        "H. Tarawneh",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "At present five Apple II insertion devices were made and installed at MAX IV",
        "three of them in the 1.5GeV-ring",
        "and two in the 3GeV-ring. The assembly of the last one of a total number of six Apple II undulators made at MAX IV is currently going on. The undulators have period lengths of 48mm (two devices)",
        "53mm",
        "58mm",
        "84mm and 95.2mm. The operational gap range of the 3GeV devices is between 11mm and 150mm",
        "the range of the 1.5GeV devices is 14mm to 150mm. Structural analysis was applied to assure a minimum deflection of the main frame and the magnet array girders. The main frame is made of nodular cast iron",
        "while the girders are made of aluminium alloy. In order to optimize the magnetic tuning the position of the magnet keepers can be adjusted by wedges. The undulators were fiducialized before the installation in the ring tunnel and were aligned in the straight section using their magnetic centre as reference. All MAX IV made undulators have three feet with vertical adjustment and separate horizontal adjusters. This paper describes the design",
        "assembly",
        "shimming and installation of the MAX IV Apple II devices in more detail."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/tuopma04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/tuopma04.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/tuopma04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-TUOPMA04",
      "page_number": "6",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOPMA05",
      "title": "Updates on the Storage Ring Vacuum System for Spring-8-II",
      "authors": [
        "S. Takahashi",
        "T. Bizen",
        "M. Oishi",
        "K. Tamura",
        "Y. Taniuchi",
        "JASRI/SPring-8",
        "Hyogo",
        "Japan",
        "JASRI",
        "Hyogo",
        "Japan",
        "At SPring-8",
        "aiming at the realization of upgrade project (SPring-8-II)",
        "development of hardware in each sub-system has been energetically advanced. Furthermore",
        "a test half-cell construction is underway and scheduled for completion in this summer",
        "so that interference between sub-systems and consistency in the alignment strategy could be confirmed. As for the vacuum system",
        "development of a 12-m-long integrated vacuum chamber (12m-LIC) made of stainless steel and discrete photon absorbers with compact design are important keys to the success. The straight chamber was fabricated from several parts",
        "mainly formed by roll-forming",
        "and unitized by means of LBW according to proper longitudinal sections. Then",
        "they will be integrated into the 12m-LIC with the bending chamber",
        "photon absorbers and other vacuum components including transport gate valves at both ends. There are two kinds of photon absorbers",
        "horizontal and vertical insertion types",
        "both of which are equipped with scattering blocking structure. The configuration of the absorbing body was designed so as not to generate the plastic deformation with the heat transfer coefficient distribution calculated by CFD analysis."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/tuopma05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/tuopma05.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/tuopma05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-TUOPMA05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUOPMA06",
      "title": "Status of the ESRF EBS Storage Ring Engineering and Construction",
      "authors": [
        "P. Marion",
        "J.C. Biasci",
        "T. Brochard",
        "L. Eybert",
        "L. Goirand",
        "ESRF",
        "Grenoble",
        "France",
        "In the frame of its Extremely Brilliant Source (EBS) upgrade",
        "the ESRF is preparing the replacement of its existing storage ring by a new ring based on a 7-bend achromat lattice enabling to reduce the electron beam horizontal emittance by a factor 30. The project involves challenging engineering requirements due to the large number of magnets",
        "space constraints and specified geometrical precision. In order to validate the feasibility of this very compact assembly with real parts",
        "a Mock-up of a complete EBS cell was assembled in 2017. The preparation of fully equipped girders with all components assembled",
        "aligned and tested was started in October 2017 and is progressing as a rate of 3 per week. The main technical achievements and issues encountered during manufacturing of magnets",
        "girders",
        "chambers and absorbers will be presented",
        "together with an outline of the planned dismantling and installation phases",
        "scheduled from December 2018. This presentation is given on behalf of the ESRF EBS engineering team: J-C Biasci",
        "J Borrel",
        "T Brochard",
        "F Cianciosi",
        "D Coulon",
        "Y Dabin",
        "L Eybert",
        "L Goirand",
        "M Lesourd",
        "N Louis",
        "T Mairs",
        "B Ogier",
        "J Pasquaud",
        "P Van Vaerenbergh",
        "F Villar."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/tuopma06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/tuopma06.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/tuopma06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-TUOPMA06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUOPMA07",
      "title": "RF Fingers for the New ESRF-EBS Storage Ring",
      "authors": [
        "T. Brochard",
        "P.M. Brumund",
        "L. Goirand",
        "J. Pasquaud",
        "S.M. White",
        "ESRF",
        "Grenoble",
        "France",
        "In the new ESRF-EBS (Extremely Brilliant Source) storage ring vacuum chambers assembly",
        "with a reduced aperture and the new omega shape",
        "RF fingers are a key component to ensure good vacuum conditions and reach the best possible machine performance. As a result",
        "dedicated efforts were put into producing a more compact more robust more reliable and easier to assemble RF finger design for the new machine. The work was done in parallel on the beam coupling impedance reduction",
        "which have a direct impact on the electron beam lifetime",
        "and on the mechanical aspect with FEA validation and geometry optimization. Many test have been made",
        "in a mechanical laboratory",
        "including high resolution 3D computed tomography images in order to measure the electrical contact",
        "and also in the existing ESRF storage ring with the electron beam",
        "to validate the final design before launching the series production"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/tuopma07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/tuopma07.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/tuopma07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-TUOPMA07",
      "page_number": "11",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOPMA08",
      "title": "Deformable RF Fingers with Axial Extension",
      "authors": [
        "S.K. Sharma",
        "F.A. DePaola",
        "F.C. Lincoln",
        "J.L. Tuozzolo",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "RF fingers in a bellows assembly provide electrical continuity for the image current between adjacent vacuum chambers. They are required to absorb all misalignments between the two chambers while minimizing abrupt changes in the beam aperture. In addition",
        "during bake-outs of the chambers the fingers are required to accommodate their large thermal expansions. The latter is achieved either by having a sliding-contact finger design or a deformable finger design. In this paper we describe a version of the deformable finger design which permits large compression",
        "significant misalignments and axial extension. A novel method of fingers' fabrication",
        "FE analysis and test results are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/tuopma08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/tuopma08.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/tuopma08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-TUOPMA08",
      "page_number": "15",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 8,
  "scrape_time": "2025-10-10 23:32:10"
}