{
  "session_info": {
    "id": "MOPCAV",
    "name": "MOPCAV - Monday Poster Cavities",
    "url": "https://proceedings.jacow.org/srf2021/html/mopcav.htm"
  },
  "papers": [
    {
      "paper_id": "MOPCAV001",
      "title": "Cavity Production and Testing of the First C75 Cryomodule for CEBAF",
      "authors": [
        "G. Ciovati",
        "G. Cheng",
        "E. Daly",
        "G.K. Davis",
        "M.A. Drury",
        "J.F. Fischer",
        "D. Forehand",
        "K. Macha",
        "F. Marhauser",
        "E.A. McEwen",
        "A.L.A. Mitchell",
        "A.V. Reilly",
        "R.A. Rimmer",
        "S. Wang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The CEBAF cryomodule rework program was updated over the last few years to increase the energy gain of refurbished cryomodules to 75 MeV. The concept recycles the waveguide end-groups from original CEBAF cavities fabricated in the 1990s and replaces the five elliptical cells in each with a new optimized cell shape fabricated from large-grain",
        "ingot Nb material. Eight cavities were fabricated at Research Instruments",
        "Germany",
        "and two cavities were built at Jefferson Lab. Each cavity was processed by electropolishing and tested at 2.07 K. The best eight cavities were assembled into ’cavity pairs’ and re-tested at 2.07 K",
        "before assembly into the cryomodule. All but one cavity in the cryomodule were within 10% of the target accelerating gradient of 19 MV/m with a quality factor of 8·109. The performance limitations were field emission and multipacting."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav001.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV001",
      "page_number": "250",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPCAV002",
      "title": "Shape Evolution of C75 Large-Grain Niobium Half-Cells During Cavity Fabrication",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The largely anisotropic deformation of large-grain Nb discs during deep drawing into half-cells poses a challenge for achieving a desired shape accuracy. Two 5-cell cavities for the C75 CEBAF cryomodule rework program have been fabricated at Jefferson Lab from large-grain Nb discs directly sliced from an ingot. The shape of the inner surface of eight half-cells has been inspected using a FARO Edge laser scanner during the fabrication process and compared to the reference shape. On average",
        "approximately 63% of the half-cell inner surface was found to be within 0.1 mm of the reference shape and ~90% to be within 0.2 mm",
        "after the final equator machining. Several 5-cell C75 cavities have also been fabricated at Research Instruments",
        "Germany",
        "and measurements of the shape accuracy using a Zeiss 3D coordinate measuring machine gave similar results. One half-cell was measured both at Research Instruments and Jefferson Lab for comparison."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav002.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV002",
      "page_number": "255",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPCAV004",
      "title": "Mechanical Properties of Directly Sliced Medium Grain Niobium for 1.3 GHz SRF Cavity",
      "authors": [
        "A. Kumar",
        "K. Abe",
        "T. Dohmae",
        "S. Michizono",
        "T. Saeki",
        "Y. Watanabe",
        "A. Yamamoto",
        "M. Yamanaka",
        "KEK",
        "Ibaraki",
        "Japan",
        "A. Fajardo",
        "N. Lannoy",
        "ATI",
        "Albany",
        "Oregon",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "BSCE",
        "Yorktown",
        "Virginia",
        "USA",
        "At KEK",
        "research is being conducted to manufacture cost-effective 1.3 GHz superconducting radio frequency cavities based on the fine grain (FG) and large grain (LG) Niobium (Nb) materials. Medium grain (MG) Nb has been proposed and developed as an alternative to the FG and LG Nb",
        "being expected to have better mechanical stability with a cost-effective and clean manufacturing approach. MG Nb has an average grain size of 200 - 300 µm",
        "which is approximately 100 times smaller than the LG Nb",
        "however",
        "there are occasional grains as large as 1-2 mm. As such",
        "it is expected to have isotropic properties rather than the anisotropic properties of LG Nb. In this paper",
        "we will outline the mechanical properties of the directly sliced high RRR MG Nb material (manufactured by ATI)",
        "and a comparative study will be presented with respect to FG and LG Nb. Moreover",
        "the viability of MG Nb for the global high-pressure regulation for 1.3 GHz SRF cavity will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav004.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV004",
      "page_number": "259",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPCAV005",
      "title": "Status of SNS Proton Power Upgrade SRF Cavities Production Qualification",
      "authors": [
        "P. Dhakal",
        "E. Daly",
        "G.K. Davis",
        "J.F. Fischer",
        "D. Forehand",
        "N.A. Huque",
        "A.L.A. Mitchell",
        "P.D. Owen",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "M.P. Howell",
        "S.-H. Kim",
        "J.D. Mammosser",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "The Proton Power Upgrade project at Oak Ridge National Lab’s Spallation Neutron Source (SNS PPU) currently being constructed will double the proton beam power from 1.4 to 2.8 MW by adding 7 additional cryomodules",
        "each contains four six-cell high beta (\\beta = 0.81) superconducting radio frequency cavities. The cavities were built by Research Instruments",
        "Germany",
        "with all the cavity processing done at the vendor site",
        "including electropolishing as the final active chemistry step. All 28 cavities needed for 7 cryomodules were delivered to Jefferson Lab",
        "ready to be tested. The cryogenic RF qualifications and helium vessel welding were done at Jefferson Lab. The performance largely exceed the requirements",
        "and greatly exceeded the performance of the original SNS cavity production series. Here",
        "we present the summary of RF test on production cavities to this date.",
        "This manuscript has been authored by Jefferson Science Associates",
        "LLC under U.S. DOE Contract No. DE-AC05-06OR23177."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav005.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV005",
      "page_number": "265",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPCAV006",
      "title": "High-Q/High-G R&D at KEK Using 9-Cell TESLA-Shaped Niobium Cavities",
      "authors": [
        "R. Katayama",
        "A. Araki",
        "H. Ito",
        "E. Kako",
        "T. Konomi",
        "S. Michizono",
        "M. Omet",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "We will report on the current progress of High-Q/High-G R&D using three 1.3 GHz 9-cell TESLA shape niobium superconducting cavities at the High Energy Accelerator Research Organization (KEK). These cavities are made of bulk niobium of fine grain material with RRR >300 and have been annealed at 900 degrees for 3 hours. The cavity performances were evaluated at the Superconducting RF Test Facility at KEK (KEK-STF) after 2-step bake (70-75°C 4 h + 120°C 48 h)",
        "electropolishing at low temperature",
        "and fast cooling procedure were applied to these cavities. In this study",
        "obtained results will be compared with the baseline measurement for the standard recipe at KEK."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav006.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV006",
      "page_number": "268",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPCAV008",
      "title": "CiADS and HIAF Superconducting Cavity Development Status and the Transition to Production Stage",
      "authors": [
        "M. Xu",
        "H. Guo",
        "Y. He",
        "S.C. Huang",
        "Y.L. Huang",
        "T.C. Jiang",
        "C.L. Li",
        "L.B. Liu",
        "S.H. Liu",
        "T. Liu",
        "S.M. Shanab",
        "T. Tan",
        "Y. Tao",
        "Y.Q. Wan",
        "F.F. Wang",
        "R.X. Wang",
        "Z.J. Wang",
        "P.R. Xiong",
        "J.C. Yang",
        "Z.Q. Yang",
        "S.H. Zhang",
        "S.X. Zhang",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "FZJ",
        "Jülich",
        "Germany",
        "Two accelerators facilities",
        "China initiative Accelerator Driven Sub-critical System (CiADS) and High Intensity heavy-ion Accelerator Facility (HIAF)",
        "co-funded by the China central and local government",
        "is being designed and constructed at Huizhou city",
        "Guangdong Province. The Institute of Modern Physics(IMP)",
        "Chinese Academy of Science is responded for constructing and operating the facility. CiADS’s mission is to demonstrate the principle and technical of employing high power protons to transit fission nuclear plant wastes. HIAF is defined as a nuclear structure research facility. The two linacs contains six types",
        "totally 233 superconducting cavities",
        "will be constructed in recent three years. Stable production rate and reliable surface processing will be the main challenges. This paper reports the cavity design",
        "prototype status and massive production plan and status."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav008.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV008",
      "page_number": "273",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPCAV009",
      "title": "A New Process for Nitrogen Doping of Niobium Cavities",
      "authors": [
        "Omega Physics",
        "St Gildas de Rhuys",
        "France",
        "Nitrogen-doping of Niobium cavities is now well known and industrialization of this process is emerging. However",
        "the current process",
        "based on thermal treatment in Nitrogen atmosphere leads to various inaccuracies (what is the concentration of Nitrogen in the Nb material? Penetration depth",
        "created phases",
        "…) and some post-treatment like chemical-mechanical polishing of the inner surface. This work presents a new and more accurate patented process based on nitrogen ion beam implantation into the inner surface of Nb cavities. Ion implantation is a well-known",
        "controlled",
        "accurate and reproducible process that does not require post-treatment. For these reasons",
        "the industrialization of Nitrogen-doping Nb cavities will be improved through ion implantation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav009.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV009",
      "page_number": "276",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPCAV010",
      "title": "Design of a HOM-Damped 166.6 MHz Compact Quarter-Wave β=1 Superconducting Cavity for High Energy Photon Source",
      "authors": [
        "X.Y. Zhang",
        "J. Dai",
        "L. Guo",
        "T.M. Huang",
        "Z.Q. Li",
        "Q. Ma",
        "F. Meng",
        "Z.H. Mi",
        "P. Zhang",
        "H.J. Zheng",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "Superconducting cavities with low RF frequencies and heavy damping of higher order modes (HOM) are desired for the main accelerator of High Energy Photon Source (HEPS)",
        "a 6 GeV synchrotron light source promising ultralow emittance currently under construction in Beijing. A compact 166.6 MHz superconducting cavity was proposed adopting a quarter-wave β=1 geometry. Based on the successful development of a proof-of-principle cavity",
        "a HOM-damped 166.6 MHz compact superconducting cavity was subsequently designed. Ferrite damper was installed on the beam pipe to reduce HOM impedance below stringent threshold of coupled-bunch instabilities. Being compact",
        "RF field heating on the cavity vacuum seal was carefully examined against quenching the NbTi flange. The cavity was later dressed with helium vessel and the tuning mechanism was also realized. Excellent RF and mechanical properties were eventually achieved. Finally",
        "the two-cavity string was designed to ensure smooth transitions among components and proper shielding of synchrotron light. This paper presents a complete design of a fully dressed HOM-damped low-frequency β=1 superconducting cavity for HEPS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav010.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV010",
      "page_number": "278",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPCAV011",
      "title": "Fabrication Process of Single Spoke Resonator Type-2 (SSR2) for RISP",
      "authors": [
        "M.O. Hyun",
        "J. Joo",
        "H.C. Jung",
        "Y. Kim",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "Rare Isotope Science Project (RISP) in the Institute of Basic Science (IBS)",
        "South Korea",
        "is now constructing superconducting linear accelerator 3 (SCL3) for low-energy beam experiment and also making prototypes of superconducting cavity",
        "RF power coupler",
        "tuner",
        "and cryomodule of superconducting (SC) linear accelerator 2 (SCL2) for high-energy beam experiment. Single spoke resonator type-1 (SSR1) and type-2 (SSR2) superconducting cavities are now on the prototyping stage. This paper explains about SSR2 fabrication process from press-forming to electron beam welding (EBW) with RRR300 niobium sheets."
      ],
      "institutions": [
        "Funding: This paper was supported by the Rare Isotope Science Project (RISP), which is funded by the Ministry of Science and ICT (MSIT) and National Research Foundation (NRF) of the Republic of Korea."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav011.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV011",
      "page_number": "283",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPCAV012",
      "title": "Fabrication of 1.3 GHz SRF Cavities Using Medium Grain Niobium Discs Directly Sliced from Forged Ingot",
      "authors": [
        "T. Dohmae",
        "K. Abe",
        "H. Inoue",
        "A. Kumar",
        "S. Michizono",
        "T. Saeki",
        "K. Umemori",
        "Y. Watanabe",
        "A. Yamamoto",
        "M. Yamanaka",
        "K. Yoshida",
        "KEK",
        "Ibaraki",
        "Japan",
        "A. Fajardo",
        "N. Lannoy",
        "ATI",
        "Albany",
        "Oregon",
        "USA",
        "JLab",
        "Newport News",
        "USA",
        "Medium grain (MG) niobium disc which is directly sliced from forged ingot is newly investigated for the cavity material. An effective cost reduction can be achieved using MG niobium since rolling process which is necessary for typical niobium sheet can be skipped during MG niobium production. Grain size of MD niobium is 200-300 um which is much smaller than large grain (LG) niobium directly sliced from melted niobium ingot. Hence",
        "the formability of MG niobium is expected to be much better than LG niobium. KEK has started fabrication of cavity using MG niobium. In this talk",
        "characteristic of MG niobium during fabrication will be reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav012.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV012",
      "page_number": "287",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPCAV013",
      "title": "LCLS-II-HE Vertical Acceptance Testing Plans",
      "authors": [
        "J.T. Maniscalco",
        "S. Aderhold",
        "J.D. Fuerst",
        "D. Gonnella",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "T.T. Arkan",
        "M. Checchin",
        "J.A. Kaluzny",
        "S. Posen",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "J. Hogan",
        "A.D. Palczewski",
        "C.E. Reece",
        "K.M. Wilson",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "LCLS-II-HE has performance requirements similar to but generally more demanding than those of LCLS-II",
        "with an operating gradient of 21 MV/m (up from 16 MV/m in LCLS-II) and tighter restrictions on field emission and multipacting. In this paper",
        "we outline the requirements for the 1.3 GHz cavities and the plans for qualification of these cavities by vertical test. We discuss lessons learned from LCLS-II and highlight the changes implemented in the vertical test procedure for the new project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav013.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV013",
      "page_number": "291",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPCAV014",
      "title": "The Development of a Prototype Fundamental Power Coupler for CiADS and HIAF Half Wave Resonators",
      "authors": [
        "T.C. Jiang",
        "F. Bai",
        "Y. He",
        "Z.Q. Lin",
        "Y.Q. Wan",
        "R.X. Wang",
        "Z.J. Wang",
        "M. Xu",
        "S.H. Zhang",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "More than 100 Half-wave resonators (HWR) will be adopted for China Initiative Accelerator Driven Sys-tem (CiADS) and High Intensity heavy-ion Accelerator Facility (HIAF) at IMP. Each HWR cavity equips with one variable coupling",
        "dual-warm-ceramic fundamen-tal power coupler (FPC). The FPC should be able to transmit up to 30 kW in CW mode. This paper will give an overview of the RF design of the 162.5 MHz CW power coupler. The coupler employs two warm ceram-ics in a 50 Ω coaxial line to ensure operation relia-bility. The results of thermal and thermomechanical will also be reported. Two prototype couplers have been fabricated and the RF measurements with low RF power were carried out."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav014.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV014",
      "page_number": "295",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPCAV015",
      "title": "Development of QWRS for the Future Upgrade of JAEA Tandem Superconducting Booster",
      "authors": [
        "Y. Kondo",
        "H. Kabumoto",
        "M. Matsuda",
        "JAEA",
        "Ibaraki-ken",
        "Japan",
        "T. Dohmae",
        "E. Kako",
        "H. Sakai",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "H. Harada",
        "J. Kamiya",
        "K. Moriya",
        "J. Tamura",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "The Japan Atomic Energy Agency (JAEA) tandem booster is one of the pioneering superconducting heavy ion linac in the world. It consists of 40 QWRs with an operation frequency of 130 MHz and βopt=0.1",
        "and has potential to accelerate various ions up to Au to 10 MeV/u. The user operation was started in 1994",
        "however",
        "it has been suspended since the Great East Japan Earthquake in 2011. Recently",
        "we started activities to investigate and improve the performance of the QWR cavities towards the restart of the tandem booster. In addition",
        "design work of new lower beta cavities to improve the acceleration efficiency of heavier ions such as Uranium has been launched. Now we are surveying some operation frequencies and types of cavities including multi-gap QWR with use of electro-magnetic simulation of the cavities. In this work",
        "the current status of the R&D program for the JAEA tandem facility is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav015.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV015",
      "page_number": "299",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPCAV016",
      "title": "HOM Couplers and RF Antennas for HL-LHC Crab Cavities: Developments for Manufacturing",
      "authors": [
        "S. Barrière",
        "S. Atieh",
        "B. Bulat",
        "R. Calaga",
        "S.J. Calvo",
        "O. Capatina",
        "T. Demazierepresenter",
        "G. Favre",
        "A. Gallifa Terricabras",
        "M. Garlasché",
        "J.-M. Geisser",
        "J.A. Mitchell",
        "E. Montesinos",
        "F. Motschmann",
        "P. Naisson",
        "R. Ninet",
        "L. Prever-Loiri",
        "L.R.A. Renaglia",
        "K. Scibor",
        "N. Villanti",
        "CERN",
        "Meyrin",
        "Switzerland",
        "Superconducting RF crab cavities are being manufactured as part of the HL-LHC upgrade at CERN. Amongst its related ancillaries",
        "radiofrequency HOM (High Order Modes) suppressors and field antennas are essential for reaching nominal performance during operation with high energy beams",
        "as they monitor and control the electromagnetic fields in the cavities. Several concepts of such equipment have been engineered and manufactured",
        "for both design validation and RF performance assessment. The following paper highlights manufacturing process definition",
        "its challenges and the assembly strategies focusing on the ongoing RFD prototypes for the SPS beam tests. Specific tooling development and test campaigns are also described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/mopcav016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/mopcav016.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/mopcav016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPCAV016",
      "page_number": "303",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 14,
  "scrape_time": "2025-10-11 03:02:00"
}