{
  "session_info": {
    "id": "THIOC",
    "name": "THIOC - Technical R&D - Overall performances II",
    "url": "https://proceedings.jacow.org/SRF2013/html/thioc.htm"
  },
  "papers": [
    {
      "paper_id": "THIOC01",
      "title": "Low Beta Cavity Development for an ATLAS Intensity Upgrade",
      "authors": [
        "M.P. Kelly",
        "Z.A. Conway",
        "S.M. Gerbick",
        "M. Kedzie",
        "S.H. Kim",
        "R.C. Murphy",
        "B. Mustapha",
        "P.N. Ostroumov",
        "T. Reid",
        "ANL",
        "Argonne",
        "USA",
        "The set of seven new 72 MHz quarter wave SC (QWR) cavities has been completed and is being installed in the ATLAS heavy-ion accelerator at Argonne. The aim is to provide at least 17.5 MV accelerating potential with large acceptance and minimal beam losses for high intensity ion beams. The cavity electromagnetic design uses optimizations not used before with QWR including a large taper on both the inner and outer conductors in order to reduce surface fields and make efficient use of space along the beam line. Electropolishing (EP) on the finished cavities with integral helium jacket and no demountable RF joints has been performed",
        "and is the first for any low beta SC cavity. This type of EP",
        "adapted from Argonne systems for the linear collider effort",
        "appears to have a large benefit in terms of the average quench field which range between 103-165 mT for five QWR tested to date. Cavity residual resistances at the proposed operating point of ~70 mT are low",
        "clustering close to a value of ~2nOhm. Additional technical details including the almost exclusive use of wire EDM for niobium fabrication and a new CW 4 kW RF power coupler are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/thioc01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/thioc01.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/thioc01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-THIOC01",
      "page_number": "850",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THIOC02",
      "title": "High Power CW Tests of cERL Main-Linac Cryomodule",
      "authors": [
        "H. Sakai",
        "K. Enami",
        "T. Furuya",
        "M. Satoh",
        "K. Shinoe",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "JAEA",
        "Ibaraki-ken",
        "Japan",
        "A main linac cryomodule have been constructed for Compact ERL project. It contains two 9-cell cavities",
        "mounted with HOM absorbers and input couplers. After cavity string assembly",
        "they were installed into the vacuum vessel of the cryomodule. It was placed inside radiation shield of cERL and connected to a refrigerator system. The cryomodule was successfully cooled down to 2K and low power and high power measurements were carried out."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/thioc02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/thioc02.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/thioc02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-THIOC02",
      "page_number": "855",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THIOC03",
      "title": "Superconducting Photonic Band Gap Structures for High-Current Applications",
      "authors": [
        "E.I. Simakov",
        "S. Arsenyev",
        "W.B. Haynes",
        "S.S. Kurennoy",
        "D.Y. Shchegolkov",
        "N.A. Suvorova",
        "T. Tajima",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "C.H. Boulware",
        "T.L. Grimm",
        "Niowave",
        "Inc.",
        "Lansing",
        "Michigan",
        "USA"
      ],
      "institutions": [],
      "abstract": "We present the results of recent design and testing of several 2.1 GHz superconducting rf (SRF) photonic band gap (PBG) resonators. PBG cells have great potential for outcoupling long-range wakefields in SRF accelerator structures without affecting the fundamental accelerating mode. Using PBG structures in superconducting particle accelerators will allow operation at higher frequencies and moving forward to significantly higher beam luminosities thus leading towards a completely new generation of colliders for high energy physics. Here we report the results of our efforts to fabricate 2.1 GHz PBG cells with round and elliptical rods and to test them with high power at liquid helium temperatures. Two PBG cells with round rods were tested in spring of 2012 and achieved accelerating gradients of 15 MV/m at 2 Kelvin. Two PBG cells with elliptical rods will be tested in summer of 2013.",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/thioc03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/thioc03.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/thioc03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-THIOC03",
      "page_number": "860",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THIOC04",
      "title": "Demonstration of RF Stabilities in STF 9-cell Cavities Aiming for the Near Quench Limit Operation",
      "authors": [
        "Sokendai",
        "Ibaraki",
        "Japan",
        "T. Matsumoto",
        "S. Michizono",
        "T. Miura",
        "KEK",
        "Ibaraki",
        "Japan",
        "In preparation of ILC an operation of two superconducting cavities controlled by digital LLRF techniques at different gradients (16 MV/m",
        "24 MV/m) with flat flattops and a 6.4 mA beam was demonstrated",
        "which is only possible by PkQL control (individual setting of driving power and loaded Q per cavity). The vector sum stabilities were ΔA/A = 0.009%rms and Δφ = 0.009°rms. Since in ILC the cavity gradient spread is large (31.5 MV/m±20%) the required range of loaded Q values is 3·106 to 107. High loaded Q operation with a 6.1 mA beam at 2·107 was demonstrated. The stabilities were ΔA/A = 0.008%rms and Δφ = 0.014°rms. Furthermore a near klystron operation within 5% of saturation was performed with a 6.2 mA beam. The stabilities were ΔA/A = 0.010%rms and Δφ = 0.009°rms."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/SRF2013/talks/thioc04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/SRF2013/papers/thioc04.pdf",
      "poster_url": "https://proceedings.jacow.org/SRF2013/posters/thioc04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2013-THIOC04",
      "page_number": "865",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-11 04:17:56"
}