{
  "session_info": {
    "id": "MOZMH",
    "name": "MOZMH - Modern trends in accelerators",
    "url": "https://proceedings.jacow.org/rupac2016/html/mozmh.htm"
  },
  "papers": [
    {
      "paper_id": "MOZMH01",
      "title": "CEPC-SppC Accelerator Status",
      "authors": [
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "In this talk we will give a bird view of the status Circular Electron Positron Collider (CEPC). The scientific goal and the collider design goal of CECP are described. The luminosity potentail of Super Proton-Proton Collider (SPPC) in the same tunnel of CEPC are also provided. The optimization of parameter designs for CEPC with different energies",
        "machine lengthes",
        "single ring and crab-waist collision partial double ring options",
        "etc. have been given systimatically. The machine lattice design philosophy and conrete lattice design are given. The corresponding SC RF system designs corresponding to different machine options are presented. Key issues for technology R&D",
        "possible time schedule and international collaboration are addressed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/mozmh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/mozmh01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/mozmh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-MOZMH01",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOZMH02",
      "title": "Resent Advances with Crystal Deflectors at the U-70 Synchrotron - Status and Prospects",
      "authors": [
        "IHEP",
        "Moscow Region",
        "Russia",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "The report overviews recent results of activity in implementing crystal deflectors to extract proton and ion beams for the fixed-target experiments at the U-70 synchrotron of IHEP of NRC Kurchatov Institute. The results of experimental observation of characteristic X-ray radiation excited by extracted proton and ion beams are presented as well."
      ],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/mozmh02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/mozmh02.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/mozmh02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-MOZMH02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOZMH03",
      "title": "Search for the Charged Particle Electric Dipole Moments in Storage Rings",
      "authors": [
        "FZJ",
        "Jülich",
        "Germany",
        "The idea of searching for the electric dipole moment (EDM) of proton and deuteron using polarized beams in a storage ring was originally proposed at Brookhaven National Laboratory (BNL)",
        "USA. Currently",
        "the Jülich Electric Dipole moment Investigations (JEDI) collaboration develops the conceptual design of such a ring specifically for the search of the deuteron electrical dipole moment (dEDM). The idea is that the oscillation of the spin due to a possible finite electric dipole moment is separated from the influence of the magnetic dipole moment (MDM)",
        "and the spin behavior indicates the existence of dEDM. In connection with this problem",
        "two questions arise: (i) how to create conditions for maximum growth of the total EDM signal of all particles in the beam bunch",
        "and (ii) how to differentiate the EDM signal from the induced MDM signal. For the design of such a ring",
        "we need to address three major challenges: - the ring lattice should meet the conditions of beam stability",
        "and it has to have incorporated straight sections to accommodate the accelerating station",
        "equipment for injection and extraction of the beam",
        "a polarimeter",
        "and sextupoles; - the polarization lifetime of the beam must be around ~1000 seconds; - systematic errors have to be minimized to eliminate the induced fake EDM signal. In my contribution",
        "I will present the current status of the project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2016/talks/mozmh03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2016/papers/mozmh03.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2016/posters/mozmh03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2016-MOZMH03",
      "page_number": "6",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-11 02:29:57"
}