{
  "session_info": {
    "id": "TUZB",
    "name": "TUZB - Invited Oral Presentations, Accelerator Technology",
    "url": "https://proceedings.jacow.org/ipac2016/html/tuzb.htm"
  },
  "papers": [
    {
      "paper_id": "TUZB01",
      "title": "High Power Proton Beam Targets: Technological Evolution, Current Challenges, and the Future",
      "authors": [
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "This talk reviews the history of proton beam target development and the current challenges associated with the operation of high power beam targets. Beyond providing high power proton beams",
        "accelerator facilities must also engineer robust targets to accept the load and satisfy mission needs. Recently some high power facilities are limited by target operations",
        "rather than accelerator capabilities. The outlook for targets for future high power facilities is also considered."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tuzb01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tuzb01.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tuzb01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUZB01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZB02",
      "title": "Challenge of In-vacuum and Cryogenic Undulator Technologies",
      "authors": [
        "J.C. Huang",
        "C.-H. Chang",
        "C.H. Chang",
        "T.Y. Chung",
        "C.-S. Hwang",
        "C.K. Yang",
        "Y.T. Yu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "An in-vacuum undulator (IVU) opens the utilization of high-brilliance X-rays in the medium energy storage rings. The development of a short-period undulator with low phase error becomes important to bring X-ray into a new unprecedented brilliant light source in an ultimate storage ring (USR). NdFeB or PrFeB cryogenic permanent magnet undulators (CPMUs) with a short period have been developed worldwide to obtain high brilliance of undulator radiation. A CPMU has high resistance against beam-induced heat load and allow to operate at a narrow gap. In a low emittance or ultimate storage ring",
        "not only the performance of an undulator but the choice of the lattice functions is very important to obtain high bril-liance of synchrotron radiation. The optimum betatron functions and zero dispersion function shall be given for a straight section at IVU/CPMUs. In this paper",
        "the relevant factors and design issues for IVU/CPMU will be discussed. Many technological challenges of a short-period undulator associated with beam induced-heat load",
        "phase errors",
        "and the deformation of in-vacuum girders will also be presented herein."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tuzb02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tuzb02.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tuzb02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUZB02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 20:06:15"
}