{
  "session_info": {
    "id": "THPB",
    "name": "THPB - Poster Session",
    "url": "https://proceedings.jacow.org/srf2017/html/thpb.htm"
  },
  "papers": [
    {
      "paper_id": "THPB002",
      "title": "Role of Nitrogen on Hydride Nucleation in Pure Niobium by First Principles Calculations",
      "authors": [
        "P. Garg",
        "I. Adlakha",
        "K.N. Solanki",
        "Arizona State University",
        "Tempe",
        "USA",
        "S. Balachandran",
        "P.J. Lee",
        "NHMFL",
        "Tallahassee",
        "Florida",
        "USA",
        "Michigan State University",
        "East Lansing",
        "Michigan",
        "USA",
        "It is known that formation and growth of Nb hydride degrades superconducting radio frequency (SRF) properties of Nb cavities and the treatments that reduce H concentration improve quality factor. Recently it is has also been shown that addition of N through doping or infusion improves the quality factor. Thus",
        "we probe role of N addition in Nb on hydride precipitation and stability through first principles calculations & compared with coupon samples. In presence of N",
        "energetic preference for H to occupy interstitial sites in the vicinity of N is reduced. Furthermore",
        "presence of N forces H to occupy interstitial octahedral site instead of a tetrahedral site. The thermodynamic stability of hydride is decreased in the presence of N in Nb.The quantum insights using charge transfer and density of states show a strong tendency of N to accumulate charge",
        "thereby decreasing the bond strength of neighboring Nb and H atoms. These atomic scale results explain the lesser tendency of surface hydride formation in SRF Nb cavities in presence of N. These results are consistent with metallographic examination of N-treated Nb coupons",
        "which show suppressed hydride formation near N-treated surface."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb002.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB002",
      "page_number": "741",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB003",
      "title": "An Innovative Design of a Flexible Temperature-mapping System",
      "authors": [
        "M. Ge",
        "F. Furuta",
        "M. Liepe",
        "P.J. Pamel",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "A temperature-mapping (T-Map) system is an essential tool for fundamental SRF research as it provides spatial information of RF power dissipation and so allows localizing hot-spots on a cavity surface at cryogenic temperatures. However",
        "the temperature sensors are mounted on rigid boards in most current systems",
        "so each can only work for one specific cavity size and shape. In this paper",
        "we proposed a flexible design",
        "which allows this temperature mapping system to work for different cavity shapes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb003.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB003",
      "page_number": "746",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB004",
      "title": "Impact of the Duration of Low Temperature Doping on Superconducting Cavity Performance",
      "authors": [
        "P.N. Koufalis",
        "F. Furuta",
        "J.J. Kaufman",
        "M. Liepe",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Low temperature treatments of superconducting cavities in a low pressure ambient atmosphere have been shown to introduce a 'Q-rise' up to moderate surface fields and an overall increase in quality factor. However",
        "the effect of varying the doping time at a fixed temperature on cavity performance has not been systematically examined. We present results of such an investigation for cavities prepared at 120 and 160 C in a continuously flowing low pressure atmosphere for various amounts of time. We show that the introduction of impurities to the RF penetration layer can improve cavity performance and investigate the relationship between electron mean free path and the temperature-dependent component of the surface resistance."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb004.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB004",
      "page_number": "750",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB005",
      "title": "Design Updates on Cavity to Measure Suppression of Microwave Surface Resistance by DC Magnetic Fields",
      "authors": [
        "J.T. Maniscalco",
        "M. Liepe",
        "R.D. Porter",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Our research has shown good agreement between experimental measurements of the anti-Q-slope in niobium SRF cavities and predictions from a recent theoretical model of the suppression of the microwave surface resistance with applied RF field. To confirm that this mechanism is indeed what causes the anti-Q-slope in impurity-doped niobium",
        "it will be necessary to measure the theory's prediction that the same effect may be achieved by applying a constant (i.e. DC) magnetic field parallel to the RF surface. This will also allow for systematic studies of the proposed fundamental effect of the anti-Q-slope and of the behavior of the anti-Q-slope for many surface preparations and alternative materials",
        "since it provides a cleaner measurement by eliminating the counteracting quasiparticle overheating and the complexifying oscillation of the screening currents. In this report we give an update on work at Cornell to design and build a coaxial cavity to measure this effect."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb005.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB005",
      "page_number": "754",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB007",
      "title": "Nitrogen Infusion R&D on Single Cell Cavities at DESY",
      "authors": [
        "M. Wenskat",
        "D. Reschke",
        "J. Schaffran",
        "DESY",
        "Hamburg",
        "Germany",
        "University of Hamburg",
        "Institut für Experimentalphysik",
        "Hamburg",
        "Germany",
        "A first series of single cell cavities underwent the \"Nitrogen Infusion\" treatment at DESY. Samples",
        "which were in the furnace together with the cavities",
        "underwent a series of SEM/EDX measurements and showed some unexpected structures. In parallel",
        "the cavity performance deteriorated after the treatment. The furnace pressure and temperature and the residual gases during the treatment were analyzed and the possible cause for the deterioration has been found. Steps to prevent this deterioration in following treatments are discussed and first results are shown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb007.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB007",
      "page_number": "759",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB017",
      "title": "Investigation of Trapped Magnetic Flux in Superconducting Niobium Samples with Neutron Radiography",
      "authors": [
        "O. Kugeler",
        "T. Junginger",
        "J. Knobloch",
        "M.M. Krzyzagorski",
        "J.M. Köszegi",
        "L. Riik",
        "W. Treimer",
        "R.F. Ziesche",
        "HZB",
        "Berlin",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The dynamics of flux expulsion in Nb samples during superconducting transition has been investigated with neutron radiography. Aiming at a reduction of the trapped flux with respect to obtaining a small residual resistance it was attempted to influence the expulsion by applying external AC magnetic fields. The results of these experiments are presented.",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb017.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB017",
      "page_number": "762",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPB018",
      "title": "Towards the Perfect Meissner State: A Magneto-Optical Study on Competing Pinning Centers in Niobium",
      "authors": [
        "J.M. Köszegi",
        "J. Knobloch",
        "O. Kugeler",
        "HZB",
        "Berlin",
        "Germany"
      ],
      "institutions": [],
      "abstract": "Over the past years trapped magnetic flux has emerged as a main limiting factor of high quality factors in SRF cavities. Several studies investigated how the ambient magnetic field can be minimized or how the flux expulsion during the phase transition can be improved. We now present a study that targets the pinning centers which allow for the flux to remain inside the superconductor in the first place. Using magneto-optical imaging we were able to not only measure the amount of trapped flux but in addition we managed to image its distribution with a resolution below 10μm and correlate it with electron backscatter diffraction maps. As a result we found that the grain boundaries did not play a major role as pinning centers nor did the crystal orientation influence the amount of trapped flux signifi-cantly. Niobium hydrides which formed during the cool down to cryogenic temperatures however were found to enhance trapping. reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb018.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB018",
      "page_number": "766",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB019",
      "title": "Simulation of the Thermoelectrically Generated Magnetic Field in a SC Nine-cell Cavity",
      "authors": [
        "J.M. Köszegi",
        "J. Knobloch",
        "O. Kugeler",
        "HZB",
        "Berlin",
        "Germany",
        "Several studies showed that thermocurrents generate a magnetic field in a horizontal cavity test assembly or cryomodul",
        "which may get trapped during the superconducting phase transition. The trapped flux causes additional dissipation during operation and can therefore significantly degrade the cavity's quality factor. We simulated the distribution of the generated magnetic field for different temperature distributions and compared the results to experimental findings. Furthermore",
        "the impact of a growing superconducting area was investigated. The simulations complement the experimental studies because measurements were only feasible with a limited number of probes and restricted to selected locations and orientations. The simulations allow to analyze this data in the context of the whole system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb019.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB019",
      "page_number": "771",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB021",
      "title": "Trial of Nitrogen Infusion and Nitrogen Doping by Using J-PARC Furnace",
      "authors": [
        "T. Konomi",
        "T. Dohmae",
        "Y. Hori",
        "E. Kakopresenter",
        "T. Kubo",
        "G.-T. Park",
        "H. Sakai",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "J. Kamiya",
        "K. Takeishi",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "ULVAC",
        "Inc.",
        "Tsukuba",
        "Japan",
        "KEK has been carrying out SRF cavity developments toward higher Q-values and higher accelerating gradients. In the past nitrogen-doping was tested using the KEK furnaces",
        "but it did not succeed. This time nitrogen infusion and nitrogen doping are tested using the J-PARC's furnace",
        "which has an oil-free pumping system and is mainly pumped by a 10000 L/s cryopump and three 3000 L/s turbo pumps. Nitrogen pressure is controlled by a variable leak valve and an additional turbo pump. To avoid performance degradation during heat treatment",
        "flanges of cavities are covered by Nb caps and foils. Nitrogen infusion at 120 degrees was applied to a single cell cavity and cavity performance was measured by vertical tests after HPR and assembly. Nitrogen doping at 800 degrees is also applied to another single cell cavity. After applying EP and HPR",
        "vertical tests were carried out. Nb samples were also installed into the furnace during heat treatment. Surfaces are analyzed by SIMS and XPS. In this presentation",
        "we report procedure of nitrogen infusion and doping",
        "vertical test results and results of surface analysis."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb021.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB021",
      "page_number": "775",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB024",
      "title": "Investigation on Depth Profiling of Niobium Surface Composition and Work Function of SRF Cavities",
      "authors": [
        "A.D. Wu",
        "L. Chen",
        "Q.W. Chu",
        "H. Guo",
        "Y. He",
        "Y.M. Li",
        "F. Pan",
        "L. Yang",
        "S.H. Zhang",
        "H.W. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "The niobium samples were prepared by different surface treatments that commonly applied for the superconducting RF cavities preparation",
        "as the following of electrochemical polishing",
        "the buffered chemical polishing and high temperature annealing. In order to understand the property of niobium surface",
        "especially the relationship between the composition and the work function value",
        "the X-ray and ultraviolet photoelectron spectra depth profiling has been studied. The intensity photoelectrons signals of O1s",
        "C1s and the Nb3d were identified for composition of the niobium oxide and the hydrocarbon contamination. And the work function of sample surface was measured via the means of the ultraviolet photoelectron spectra band width. To make a depth profiling",
        "the sputtering of Argon ions was used to remove surface material gradually under by control the sputtering times. The results shown that the value of work function strongly depends on the chemical composition."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb024.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB024",
      "page_number": "779",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB025",
      "title": "A Crystal Plasticity Study on Influence of Dislocation Mean Free Path on Stage II Hardening in Nb Single Crystals",
      "authors": [
        "T. Maiti",
        "A. Chakrabarty",
        "P. Eisenlohr",
        "MSU",
        "East Lansing",
        "USA",
        "T.R. Bielerpresenter",
        "D. Kang",
        "Michigan State University",
        "East Lansing",
        "Michigan",
        "USA",
        "Constitutive models based on thermally-activated stress-assisted dislocation kinetics have been successful in predicting deformation behavior of crystalline materials",
        "particularly in face-centered cubic (fcc) metals. In body-centered cubic (bcc) metals",
        "success has been more or less limited",
        "owing to ill-defined nature of slip planes and non-planar spreading of 1/2\\hkl<111> screw dislocation cores. As a direct consequence of this",
        "bcc metals show a strong dependence of flow stress on temperature and strain rate",
        "and violation of Schmid law. We present high-resolution full-field crystal plasticity simulations of single crystal Niobium under tensile loading with an emphasis on multi-stage hardening",
        "orientation dependence",
        "and non-Schmid behavior. A dislocation density-based constitutive model with storage and recovery rates derived from Discrete Dislocation Dynamics is used to model strain hardening in stage II. The influence of dislocation mean free path and initial dislocation content on stage II hardening is simulated and compared with in-situ tensile experiments."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb025.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB025",
      "page_number": "783",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB026",
      "title": "Investigation of the Effect of Strategically Selected Grain Boundaries on Superconducting Properties of SRF Cavity Niobium",
      "authors": [
        "M. Wang",
        "T.R. Bieler",
        "Michigan State University",
        "East Lansing",
        "Michigan",
        "USA",
        "S. Balachandran",
        "P.J. Lee",
        "NHMFL",
        "Tallahassee",
        "Florida",
        "USA",
        "S. Chetri",
        "A. Polyanskii",
        "ASC",
        "Tallahassee",
        "Florida",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "High purity Nb is commonly used for fabricating SRF cavities due to its high critical temperature and its formability. However",
        "microstructural defects such as dislocations and grain boundaries in niobium can serve as favorable sites for pinning centers of magnetic flux that can degrade SRF cavity performance. In this study",
        "two bi-crystal niobium samples extracted from strategically selected grain boundaries were investigated for the effect of grain misorientation on magnetic flux behavior. Laue X-ray and EBSD-OIM crystallographic analyses were used to characterize grain orientations and orientation gradients. Cryogenic Magneto-Optical Imaging (MOI) was used to directly observe magnetic flux penetration at about 5-8 K. Flux penetration was observed along one of the grain boundaries",
        "as well as along a low angle boundary that was not detected prior to MOI imaging. Hydride scars on the sample surface after MOI were examined using atomic force microscopy (AFM) analysis. The relationships between dislocation content",
        "cryo-cooling",
        "flux penetration and grain boundaries are examined."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb026.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB026",
      "page_number": "787",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB027",
      "title": "Characterization of Microstructural Defects in SRF Cavity Niobium using Electron Channeling Contrast Imaging",
      "authors": [
        "M. Wang",
        "T.R. Bieler",
        "D. Kang",
        "Michigan State University",
        "East Lansing",
        "Michigan",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Although the quality factor of niobium cavities has improved",
        "performance variability arises from microstructural defects such as dislocations and grain boundaries that can trap magnetic flux",
        "block heat transfer",
        "and perturb superconducting currents. Microstructural defect evolution is compared in four samples extracted from a 2.8 mm thick large-grain niobium slice",
        "with tensile axes chosen to generate desired dislocation structures during deformation. The four samples are 1) as-extracted",
        "2) extracted and annealed",
        "3) extracted and then deformed to 40% strain",
        "and 4) extracted",
        "annealed at 800 °C 2 hours",
        "and deformed to 40% strain. Electron Channeling Contrast Imaging (ECCI) was performed on all samples to characterize initial dislocation density",
        "dislocation structure evolution due to annealing and deformation",
        "and related to the mechanical behavior observed in stress-strain curves. The orientation evolution and geometrically necessary dislocation (GND) density were characterized with electron backscattered diffraction (EBSD) maps. Fundamental understanding of dislocation evolution in niobium is necessary to develop models for computational cavity design."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb027.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB027",
      "page_number": "792",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB028",
      "title": "Flux Pinning Study of OTIC Niobium Material",
      "authors": [
        "S. Chen",
        "J.K. Hao",
        "L. Lin",
        "K.X. Liu",
        "S.W. Quan",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "The performance of superconducting cavities is influenced by the trapped flux during the cooling down through critical temperature",
        "especially for nitrogen doped cavities which are more sensitive to flux trapping. We have investigated the flux trapping of OTIC niobium samples with different grain size. Samples were prepared and heat treated at 800°C and 900°C",
        "followed with different surface removal by BCP. A series of measurements",
        "including MPMS",
        "TOF-SIMS",
        "were carried out on the niobium samples. The results and analysis will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb028.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB028",
      "page_number": "797",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB029",
      "title": "XPS Studies of Nitrogen Doping Nb Samples before and after GCIB Etching",
      "authors": [
        "Z.Q. Yang",
        "X.Y. Lu",
        "W.W. Tan",
        "D.Y. Yang",
        "Y. Yang",
        "J. Zhao",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "The surface chemical composition of nitrogen doping Nb samples used for the fabrication of superconducting radio frequency (SRF) cavities",
        "followed by the subsequent successive EP with different amounts of material removal",
        "has been studied by XPS. The chemical composition of Nb",
        "O",
        "C and N was presented before and after Gas Cluster Ion Beams (GCIB) etching. No signals of bad superconducting nitrides NbNx was found in any doped and un-doped samples before etching. However",
        "in the depth range greater than 30nm",
        "the content of N elements is below the XPS detection precision scope even in the samples directly after nitrogen doping treatment."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb029.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB029",
      "page_number": "802",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB030",
      "title": "Direct Observation of Hydrides Formation of Nitrogen Doping Nb Samples",
      "authors": [
        "Z.Q. Yang",
        "X.Y. Lu",
        "W.W. Tan",
        "D.Y. Yang",
        "Y. Yang",
        "J. Zhao",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Direct observation of hydrides precipitates formation on both nitrogen doped and un-doped Nb samples at 80K has been carried out using Scanning Electron Microscope (SEM) with Cold Stand. We have found that",
        "under our experimental conditions",
        "when the subsequent EP removal is less than 7μm",
        "the amounts of hydrides formed on the surface of doped samples can be effectively reduced. When the subsequent material removal is larger than 9μm",
        "the amounts of precipitated hydrides increased with the EP removal. When the EP removal is 7-9μm",
        "the amounts of hydrides can still be effectively reduced. Also",
        "more hydrides were precipitated on the surface of un-doped samples. The amounts of hydrides of doped samples may be reduced to varying degrees with different amounts of material removal."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb030.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB030",
      "page_number": "805",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB031",
      "title": "Magnetic Properties of Nitrogen Doping Niobium Samples",
      "authors": [
        "Z.Q. Yang",
        "X.Y. Lu",
        "W.W. Tan",
        "D.Y. Yang",
        "Y. Yang",
        "J. Zhao",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Nitrogen doping study on Niobium samples used for the fabrication of superconducting radio frequency (SRF) cavities was carried out. The samples' surface treatments were attempted to replicate that of the cavities",
        "which included heavy electropolishing (EP)",
        "nitrogen doping and the subsequent successive EP with different amounts of material removal. The magnetization curves of both doped and un-doped samples have been measured",
        "from which the lower critical field Hffp (First Flux Penetration",
        "ffp) and upper critical field Hc2 was extracted. The thermodynamic critical field Hc",
        "superheating field Hsh and superconducting parameters of samples with different treatments was calculated from the determined reversible magnetization curves. Hsh of doped samples is obviously smaller than that of un-doped samples",
        "which may be a possible reason for the reduction of achievable accelerating gradient in SRF niobium cavities after nitrogen doping treatments."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb031.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB031",
      "page_number": "809",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB034",
      "title": "Development of High Purity Niobium Components and Cavities for SRF Accelerator",
      "authors": [
        "T. Nagata",
        "H. Masui",
        "S. Shinozawa",
        "ULVAC",
        "Inc",
        "Chiba",
        "Japan",
        "H. Inoue",
        "E. Kako",
        "M. Yamanaka",
        "KEK",
        "Ibaraki",
        "Japan",
        "ULVAC",
        "Inc.",
        "Tsukuba",
        "Japan",
        "Comprehensive cavity fabrication process from Niobium ingot was investigated. In order to purify ingots",
        "A 600 kW electron beam furnace was introduced in ULVAC. It makes possible the stable quality of Niobium sheets and tubes. In evaluation of chemical components",
        "mechanical properties",
        "and RRR of our materials",
        "all the value satisfies the ASTM Type 5 (superconducting grade) specification. In this study",
        "we performed the trial manufacturing of welding-type and seamless-type cavities were made of our high purity Niobium ingots (RRR > 300). Accelerating gradient over 40 MV/m was shown in both cavities. We also tried to manufacture a 3-cell seamless cavity as scale up study. A seamless tube with a length of 830 mm",
        "an inner diameter of 131 mm and a thickness of 3.5 mm was prepared. We succeed in direct forming from tube to cavity shape by using a hydroforming process. Cavity surface could be smoother than that of single cell cavity caused by small crystal grain size."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb034.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB034",
      "page_number": "814",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB035",
      "title": "High Power Testing of the First ESS SPOKE Cavity Package",
      "authors": [
        "H. Li",
        "A.K. Bhattacharyya",
        "L. Hermansson",
        "M. Jobs",
        "R.J.M.Y. Ruber",
        "R. Santiago Kern",
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "The first double spoke cavity for the ESS project was tested with high power in the HNOSS cryostat at the FREIA Laboratory. This cavity is designed for 325.21MHz",
        "pulsed mode with 14 Hz repetition rate",
        "up to a peak power of 360 kW. The qualification of the cavity package in a horizontal test",
        "involving a superconducting spoke cavity",
        "a fundamental power coupler (FPC)",
        "LLRF system and RF station",
        "represents an important verification before the module assembly. This paper presents the test configuration",
        "RF conditioning history and first high power performance of this cavity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb035.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB035",
      "page_number": "817",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB036",
      "title": "Fundamental SIMS Analyses for Nitrogen-enriched Niobium",
      "authors": [
        "J. Tuggle",
        "M.J. Kelley",
        "Virginia Polytechnic Institute and State University",
        "Blacksburg",
        "USA",
        "M.J. Kelley",
        "U. Pudasaini",
        "The College of William and Mary",
        "Williamsburg",
        "Virginia",
        "USA",
        "M.J. Kelley",
        "A.D. Palczewski",
        "C.E. Reece",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "NCSU AIF",
        "Raleigh",
        "North Carolina",
        "USA"
      ],
      "institutions": [],
      "abstract": "In order to fully understand nitrogen addition techniques it is vital to have a full understanding of the material, including the content, location, and speciation of nitrogen contained in the treated Nb. In this work Secondary Ion Mass Spectrometry (SIMS) is used to elucidate content and location. Dynamic SIMS nitrogen analysis is reported, for the first time, for \"as-received\" cavity grade niobium from three separate suppliers. In addition, a number of method and instrumental issues are discussed including depth resolution, detection limit, and quantification. reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb036.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB036",
      "page_number": "821",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB037",
      "title": "Cavity Fundamental Mode and Beam Interaction in CEPC Main Ring",
      "authors": [
        "D.J. Gong",
        "J. Gao",
        "D. Wang",
        "J.Y. Zhai",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Circular electron positron collider (CEPC) is design as a particle factory for Higgs",
        "W and Z. The preliminary study is undertaken for CEPC cavity fundamental mode and beam interaction in this paper. The baseline of CEPC is DR scheme",
        "the alternative is the APDR scheme. Beam loading effects and the corresponding longitudinal beam dynamics of both CEPC DR and APDR are elaborated in this article. The phase shift and voltage decrease are calculated by the analytic formula and the program. Furthermore",
        "the longitudinal coupled-bunch instability is also studied. At last",
        "the RF parameters are calculated for CEPC 100km APDR",
        "in order to match the machine parameters and relieve the beam loading effects."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb037.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB037",
      "page_number": "825",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB038",
      "title": "Local Magnetometer: First Critical Field Measurement of Multilayer Superconductors",
      "authors": [
        "M. Aburas",
        "C.Z. Antoinepresenter",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "CEA/DRF/IRFU",
        "Gif-sur-Yvette",
        "France",
        "S-I-S (Superconductor-Insulator-Superconductor) nanometric superconducting multilayers have been proposed by Gurevich* to increase the maximum accelerating field of Nb RF cavities. This enhancement of HC1 may be done by coating Nb with thin layers of thickness less than the penetration depth. Therefore",
        "it is necessary to find a particular tool",
        "which allows us measuring HC1 directly. In fact",
        "DC magnetometers (e.g. magnetometer SQUID) are largely used for magnetic measurements but these last are strongly influenced by orientation",
        "edge and shape effects",
        "especially in the case of superconductor thin films. For that reason",
        "we developed at Saclay facilities a specific local magnetic measurement of first critical field HC1. The principle of our local magnetometer is based on the third-harmonic voltage method purposed by Claassen**",
        "which is very useful to estimate the first critical field HC1 of superconducting multilayer samples with nondestructive and contactless",
        "but more importantly",
        "without demagnetization effects***. This paper will present the evolution of the magnetometer to overcome all types of difficulties.",
        "* A. Gurevich",
        "Appl. Phys. Lett. 88",
        "012511 (2006)  ** J. H. Claassen et al.",
        "Review of Scientific Instruments 62",
        "996 (1991)  *** M. Aurino et al.",
        "Journal of Applied Physics 98",
        "123901 (2005)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb038.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB038",
      "page_number": "830",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB040",
      "title": "SRF Theory Developments from the Center for Bright Beams",
      "authors": [
        "D. Liarte",
        "T. Arias",
        "M. Liepe",
        "J.P. Sethna",
        "N. Sitamaran",
        "Cornell University",
        "Ithaca",
        "New York",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "A.R. Pack",
        "M.K. Transtrum",
        "Brigham Young University",
        "Provo",
        "USA",
        "We present theoretical studies of SRF materials from the Center for Bright Beams. First",
        "we discuss the effects of disorder",
        "inhomogeneities",
        "and materials anisotropy on the maximum parallel surface field that a superconductor can sustain in an SRF cavity",
        "using linear stability in conjunction with Ginzburg-Landau and Eilenberger theory. We connect our disorder mediated vortex nucleation model to current experimental developments of Nb3Sn and other cavity materials. Second",
        "we use time-dependent Ginzburg-Landau simulations to explore the role of inhomogeneities in nucleating vortices",
        "and discuss the effects of trapped magnetic flux on the residual resistance of weakly-pinned Nb3Sn cavities. Third",
        "we present first-principles density-functional theory (DFT) calculations to uncover and characterize the key fundamental materials processes underlying the growth of Nb3Sn. Our calculations indicate that the observed tin-depleted regions may be the direct result of an exothermic reaction between Nb3Sn and Nb at the growing Nb/Nb3Sn interface. We suggest new growth protocols to mitigate the formation of tin depleted regions."
      ],
      "institutions": [
        "Funding: This work was supported by the US National Science Foundation under Award OIA-1549132, the Center for Bright Beams."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb040.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB040",
      "page_number": "835",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB041",
      "title": "Cavity Quench Studies in Nb3Sn Using Temperature Mapping and Surface Analysis of Cavity Cut-outs",
      "authors": [
        "D.L. Hall",
        "M. Liepe",
        "R.D. Porter",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "P. Cueva",
        "D. Liarte",
        "D.A. Muller",
        "J.P. Sethna",
        "Cornell University",
        "Ithaca",
        "New York",
        "USA",
        "Previous experimental studies on single-cell Nb3Sn cavities have shown that the cause of quench is isolated to a localised defect on the cavity surface. Here",
        "cavity temperature mapping has been used to investigate cavity quench behaviour in an Nb3Sn cavity by measuring the temperature at the quench location as the RF field approaches the quench field. The heating profile observed at the quench location prior to quench appears to suggest quantised vortex entry at a defect. To investigate further",
        "the quench region has been removed from the cavity and analysed using SEM methods. These results are compared to theoretical models describing two vortex entry defect candidates: regions of thin-layer tin-depleted Nb3Sn on the cavity surface that lower the flux entry field",
        "and grain boundaries acting as Josephson junctions with a lower critical current than the surrounding material. A theoretical model of layer growth developed using density functional theory is used to discuss alterations to the coating process that could mitigate the formation of such defects."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb041.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB041",
      "page_number": "840",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB042",
      "title": "Field-dependence of the Sensitivity to Trapped Flux in Nb3Sn",
      "authors": [
        "D.L. Hall",
        "M. Liepe",
        "R.D. Porter",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "D. Liarte",
        "J.P. Sethna",
        "Cornell University",
        "Ithaca",
        "New York",
        "USA",
        "The amount of residual resistance gained per unit of trapped flux ' referred to as the trapped flux sensitivity ' in Nb3Sn cavities has been found to be a function of the amplitude of the RF field. This behaviour is consistent with a scenario in which the trapped vortex dynamics are described by collective weak pinning. A model has been developed to describe this",
        "and results in the observed linear dependence of trapped flux sensitivity with RF field. The model is used to discuss cavity preparation methods that might suppress this dependence",
        "which would reduce the trapped flux requirements necessary to operate an Nb3Sn cavity at simultaneous high quality factors and accelerating gradients."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb042.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB042",
      "page_number": "844",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB043",
      "title": "Effects of Chemical Treatments on the Surface Roughess and Surface Magnetic Field Ehancement of Niobium-3 Tin Films for Superconducting Radio-Frequency Cavities",
      "authors": [
        "R.D. Porter",
        "F. Furuta",
        "D.L. Hall",
        "M. Liepe",
        "J.T. Maniscalco",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Current niobium-3 tin (Nb3Sn) films produced via vapor diffusion have rougher surfaces than typical electropolished niobium surfaces causing significantly enhancement of the surface magnetic fields. Reducing surface roughness of Nb3Sn surfaces may be necessary to achieve higher gradient accelerator cavities with high Q. Previous work at Cornell has shown the impact of several chemical treatments on the surface roughness of Nb3Sn films; however",
        "it had not been evaluated how the changes in surface roughness impact the surface magnetic field enhancement. In this paper we present simulations of the surface field enhancement of oxipolished Nb3Sn",
        "which was shown to be effective at reducing the surface roughness of Nb3Sn. The surface magnetic field enhancement data is compared to those of unetched Nb3Sn to find that the surface magnetic field enhancement (and surface roughness) has been roughly halved."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb043.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB043",
      "page_number": "848",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB044",
      "title": "Update on Sample Host Cavity Design Work for Measuring Flux Entry and Quench Field",
      "authors": [
        "R.D. Porter",
        "M. Liepe",
        "J.T. Maniscalco",
        "R.A. Strauss",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA"
      ],
      "institutions": [
        "Current state-of-the-art Niobium superconducting radio-frequency (SRF) accelerator cavities have reached surface magnetic field close to the theoretical maximum set by the superheating field. Further increasing accelerating gradients will require new superconducting materials for accelerator cavities that are capable of supporting higher surface magnetic fields. This necessitates measuring the quench fields of new materials in high power RF fields. Previous work at Cornell University has used electromagnetic simulations to optimize the shape of a dipole mode sample host cavity such that the surface magnetic fields on the sample are high compared to the energy inside the cavity and the surface magnetic field on the rest of the cavity. In this paper we present an update of the design that includes how to mount samples in the cavity and the addition of a low field chamber."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb044.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB044",
      "page_number": "851",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB048",
      "title": "Double Cathode Configuration for the Nb Coating of HIE-ISOLDE Cavities",
      "authors": [
        "NCP",
        "Islamabad",
        "Pakistan",
        "A. Awais",
        "A.J.G. Lunt",
        "G.J. Rosaz",
        "A. Subletpresenter",
        "M. Taborelli",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Quarter Wave Resonator (QWR) cavities for HIE-ISOLDE project at CERN have entered their ending phase of production. Some R&D is still required to improve the uniformity of the Nb layer thickness on the cavity surface. In order to improve this behaviour one approach which has been proposed is to replace the single cathode with a double cathode and test the suitability of different deposition techniques. With this change it is possible to control the plasma and power distribution separately for the inner and outer part of cavity and thereby potentially improve film uniformity throughout the cavity and coating duration. In this study a comparison between the deposition rates obtained using a single cathode and a double cathode using Direct Current (DC)-bias diode sputtering",
        "DC-magnetron sputtering (DCMS) and Pulsed DC-magnetron sputtering (PDCMS) is presented. The morphology of the thin film samples were compared using Focused Ion Beam (FIB) cross section milling and Scanning Electron Microscopy (SEM) analysis."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb048.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB048",
      "page_number": "854",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPB052",
      "title": "Error Analysis of Surface Resistance Fits to Experimental Data",
      "authors": [
        "S. Keckert",
        "J. Knobloch",
        "O. Kugeler",
        "HZB",
        "Berlin",
        "Germany",
        "Superconducting material properties such as energy gap",
        "mean free path or residual resistance are commonly extracted by fitting experimental surface resistance data. Depending on the measurement setup",
        "both",
        "temperature range and the number of points are limited. In order to obtain significant results",
        "systematic as well as statistical uncertainties have to be taken into account. In this contribution different classes of errors and their impact on systematic and statistical deviations of the fitted parameters are discussed. In particular",
        "past measurements have yielded contradictory conclusions that",
        "we believe",
        "result from the use of insufficient data in the necessary temperature range. Furthermore",
        "this study is applied to the boundary conditions of the Quadrupole Resonator and its measurement accuracy."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb052.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB052",
      "page_number": "859",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPB053",
      "title": "Surface Resistance Characterization of Nb3Sn Using the HZB Quadrupole Resonator",
      "authors": [
        "S. Keckert",
        "J. Knobloch",
        "O. Kugeler",
        "HZB",
        "Berlin",
        "Germany",
        "D.L. Hall",
        "M. Liepe",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Nb3Sn is a very promising candidate material for future SRF cavities. With a critical temperature more than twice as the one of bulk niobium",
        "higher operational temperatures with still lower surface resistance are theoretically possible. A sample prepared by Cornell University was characterized towards its SRF properties using the HZB Quadrupole Resonator. In comparison to a coated cavity this device enables SRF measurements at an extended parameter space (frequency",
        "temperature and RF field) and easy access to physical quantities such as critical field and penetration depth. In this contribution we present surface resistance and RF critical field measurements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb053.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB053",
      "page_number": "863",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPB054",
      "title": "Advanced Method to Extract the Surface Resistance From Q0 Measurements",
      "authors": [
        "R. Kleindienst",
        "S. Keckert",
        "J. Knobloch",
        "O. Kugelerpresenter",
        "HZB",
        "Berlin",
        "Germany",
        "The quality factor of an RF cavity and the surface resistance are typically related with a constant geometry factor. The implicit assumption made is that the surface resistance is field independent",
        "which is however not observed experimentally in superconducting cavities. The approximation error due to this assumption becomes larger the less homogeneous the magnetic field distribution along the cavity walls is. In this paper we calculate the surface resistance error for different cavity types. An iterative method to correct for this error is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb054.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB054",
      "page_number": "867",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPB055",
      "title": "Plasma-enhanced ALD System for SRF Cavity",
      "authors": [
        "S. Kato",
        "H. Hayano",
        "KEK",
        "Ibaraki",
        "Japan",
        "A remote PEALD (Plasma-enhanced Atomic Layer Deposition) system which would offer a high conformality and a low deposition temperature has been being developed for deposition of NbN on an SRF cavity. The deposition equipment consists of a deposition chamber",
        "a remote plasma exciter",
        "a precursor supply system",
        "vacuum pumps",
        "a quartz crystal microbalance (QCM) as a film growth rate meter",
        "a detoxifying system and a safety system. An RF frequency of 13.56MHz was used for the inductively coupled plasma exciter of a reactant gas. The whole equipment is in a draft booth for operation safety. For ALD of an SRF cavity",
        "the ALD system allows us to easily replace the deposition chamber with a single cell Nb cavity. The prepared precursors are tris[ethylmethylamido][tert-butylimido] niobium (TBTEMN) and trimethylaluminium (TMA). Ammonia",
        "hydrogen and water are also prepared as reactants. We will report the ALD system design and result of the NbN deposition on sample coupons which are analysed with SEM",
        "EDX and XPS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb055.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB055",
      "page_number": "870",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB057",
      "title": "Investigation of Nucleation Stage in Diffusion Coating of Nb3Sn on Nb",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Nb3Sn has the potential to improve properties of SRF cavities",
        "such as the gradients and the working tempera-tures. Institute of Modern Physics has launched its Nb3Sn thin film coated SRF cavity project in 2016. Samples have been successfully coated to study the process of tin vapor diffusion. The main part of the deposition system is a tube furnace",
        "which working temperature can reach 1100°C. Basic material characterization of the Sn-Nb film will be presented in this work."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb057.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB057",
      "page_number": "873",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB058",
      "title": "R&D of Thin Film Coating on Superconductors",
      "authors": [
        "Y. Iwashita",
        "H. Tongu",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "H. Hayano",
        "T. Kubo",
        "T. Saeki",
        "KEK",
        "Ibaraki",
        "Japan",
        "Kyoto University",
        "Research Reactor Institute",
        "Osaka",
        "Japan",
        "Utsunomiya University",
        "Utsunomiya",
        "Japan",
        "Multilayer thin film coating is a promising technology to enhance performance of superconducting cavities. Until recently",
        "principal parameters to achieve the sufficient performance had not been known",
        "such as the thickness of each layer. We proposed a method to deduce a set of the parameters to exhibit a good performances. In order to verify the scheme",
        "we are trying to make some experiments on the subject at Kyoto. The sample preparation and the test setup for the measurement apparatus will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb058.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB058",
      "page_number": "877",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB059",
      "title": "Simulation and Measurements of Crab Cavity HOMs and HOM Couplers for HL-LHC",
      "authors": [
        "J.A. Mitchell",
        "T.J. Jones",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "R. Apsimon",
        "G. Burt",
        "N.C. Shipman",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "I. Ben-Zvi",
        "S. Verdú-Andrés",
        "B. P. Xiao",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "R. Calaga",
        "A. Castilla",
        "A. Macpherson",
        "N.C. Shipman",
        "A. Zwozniak",
        "CERN",
        "Geneva",
        "Switzerland",
        "T. Powers",
        "H. Wang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Two Superconducting Radio-Frequency (SRF) crab cavities are foreseen for the High Luminosity LHC (HL-LHC) upgrade. Preliminary beam tests of the Double Quarter Wave (DQW) crab cavity will take place in the Super Proton Synchrotron (SPS) in 2018. For damping of the cavity's Higher Order Modes (HOMs) the DQW has three identical on-cell",
        "superconducting HOM couplers. The couplers are actively cooled by liquid heluim. In this paper",
        "electromagnetic simulations of the HOMs and HOM couplers are presented. A novel approach to pre-installation spectral analysis of the HOM couplers is then presented",
        "detailing both simulated and measured data. Measurements of the cavity HOMs at warm and in Vertical Test Facilities (VTFs) at both JLAB and CERN are detailed",
        "comparing the measured characteristics of each mode to that of the simulated data-sets. Finally",
        "the measured cavity data is compared with the test box measurements to see by what extent any reduction in damping can be predicted."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb059.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB059",
      "page_number": "881",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPB061",
      "title": "Effect Of Dislocations On the Thermal Conductivity Of Superconducting Nb",
      "authors": [
        "P. Xu",
        "N.T. Wright",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "Michigan State University",
        "East Lansing",
        "Michigan",
        "USA",
        "The thermal conductivity of Niobium (Nb) often experiences a local maximum (a phonon peak) at a temperature between 1.8 and 3 K. While the magnitude of the phonon peak has been shown to be related to the dislocation density and may be influenced by manufacturing processes",
        "little has been discussed as to the temperature at which the peak occurs. In examining these phenomena",
        "it has been determined that more explicit accounting of phonon–dislocation scattering in a popular model better represents the thermal conductivity at temperatures colder than 3 K. Scaled sensitivity coefficients show this term to have similar influence as the phonon-electron and phonon-boundary scattering terms. Results using the enhanced model also show an apparent threshold of dislocation density below which there is little contribution to the thermal conductivity of Nb."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb061.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB061",
      "page_number": "886",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB066",
      "title": "Introducing the Vertical High-temperature UHV Furnace of the  S-DALINAC for Future Cavity Material Studies",
      "authors": [
        "R. Grewe",
        "L. Alff",
        "M. Arnold",
        "J. Conrad",
        "S. Flege",
        "M. Major",
        "N. Pietralla",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "IKP",
        "Mainz",
        "Germany",
        "Since 2005 the Institute for Nuclear Physics in Darmstadt operates a high temperature UHV furnace for temperatures of up to 1750°C. It has been used several times for hydrogen bake-out of the SRF cavities of the S-DALINAC with proven success. In 2013",
        "studies at FNAL have shown that cavities treated with nitrogen reached an up to four times higher q-factor*. The cavities are exposed to N2 at 850°C at the end of the H2 bake-out. A thin layer of normalconducting hexagonal niobium nitride (NbN) forms at the surface which is removed by electropolishing while the higher quality factors are attributed to the N2 diffusion into the bulk Nb. At temperatures from 1300°C to 1700°C a thin layer of the superconducting cubic phase of NbN can be observed",
        "e.g. delta-phase NbN**",
        "which has a higher critical field and higher critical temperature and thus is very intereresting for applications for SRF cavities***. The UHV furnace has been prepared for future treatments of Nb samples and cavities in a N2 atmosphere at high temperatures for research on cubic NbN. The material properties of the samples will be analyzed at the ATFT group at the Department for Material Sciences of TU Darmstadt.",
        "*Grasselino et al.",
        "Superconducting Science and Technology",
        "2013  **Hennessey et al.",
        "Oxidation of Metals",
        "1992 ***Martienssen et al.",
        "Springer Handbook of Condensed Matter and Materials Data",
        "2005"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb066.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB066",
      "page_number": "891",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPB069",
      "title": "Surface Studies of Nb3Sn Coated Samples Prepared under Different Coating Conditions",
      "authors": [
        "U. Pudasaini",
        "M.J. Kelley",
        "The College of William and Mary",
        "Williamsburg",
        "Virginia",
        "USA",
        "G.V. Eremeev",
        "M.J. Kelley",
        "C.E. Reece",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "M.J. Kelley",
        "J. Tuggle",
        "Virginia Polytechnic Institute and State University",
        "Blacksburg",
        "USA",
        "The promise of better performance and significant cost reduction make Nb3Sn-coated Nb SRF cavities an attractive option when compared to traditional Nb SRF cavities. Historically",
        "the vapor diffusion technique for coating Nb cavities with Nb3Sn has proven to be the most successful",
        "and is currently practiced in several research facilities with minor variations. Using modern characterization tools",
        "we examined the Nb3Sn coating prepared in different systems and/or under different conditions. Identically prepared high RRR (~ 300) Nb samples were coated using existing standard protocols at different coating facilities. The microstructure and composition of Nb3Sn coatings were found to be similar when examined with scanning electron microscopy (SEM) and energy dispersive X-ray spectroscopy (EDS). Atomic force microscopy (AFM) was performed on each sample and the topographies of the samples were then compared in terms of power spectral densities (PSDs). Secondary ion mass spectrometry (SIMS) depth profiles revealed trace amounts of Ti in some of the samples."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb069.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB069",
      "page_number": "894",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB070",
      "title": "Electrochemical Finishing Treatment of Nb3Sn Diffusion-coated Niobium",
      "authors": [
        "U. Pudasaini",
        "M.J. Kelley",
        "The College of William and Mary",
        "Williamsburg",
        "Virginia",
        "USA",
        "G.V. Eremeev",
        "M.J. Kelley",
        "C.E. Reece",
        "H. Tian",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Nb3Sn cavities are now routinely prepared by depositing few micron thick Nb3Sn coatings on Nb cavities using tin vapor diffusion process. For the¬¬ case of niobium there is a significant improvement after electropolishing (EP)",
        "but electrochemical finishing treatment on Nb3Sn coatings has not been studied. Controlled removal of the first few layers could lead to a smoother and cleaner surface that is conducive to better RF performance. Several samples",
        "which were coated with Nb3Sn by vapor diffusion process in a JLab sample chamber",
        "were used to explore polishing parameters",
        "such as I-V characteristics",
        "removal rate",
        "topography",
        "etc. Preliminary results from the first runs are discussed here."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb070.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB070",
      "page_number": "900",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB075",
      "title": "GaN-based Photocathodes for High Brightness Electron Beams",
      "authors": [
        "M. Schumacher",
        "X. Jiang",
        "M. Vogel",
        "University Siegen",
        "Siegen",
        "Germany",
        "Prospective light sources requires photocathodes with high quantum efficiency (QE)",
        "long lifetime and minimized thermal emittance. One promising candidate meeting the aforementioned specifications is GaN. Due to its wide band gap (Eg = 3",
        "4 eV)",
        "GaN can be excited by UV-light sources. Its thermal and chemical stability are added bonuses. In the framework of the present activity",
        "the synthesis of GaN films on Si",
        "Cu",
        "Mo and Nb by means of rf magnetron sputtering is proposed. In this context",
        "Ga",
        "GaAs and GaN are suitable source material candidates",
        "which are sputtered in a nitrogen/argon plasma discharge. The conductivity as well as the band-gap of the corresponding films can be modified by dopants like Mg and In",
        "respectively. Standard materials science characterization techniques such as SEM",
        "EDX",
        "XRD or XPS are used to explore the growth mechanism of GaN alongside with a morphological and chemical examination. To assess and optimize the performance of the photocathode the abovementioned requirements are tested in an in-situ setup. In addition to the project outline",
        "first experimental results of GaN coatings synthesized based on a GaAs source sputtered in pure N2 are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb075.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB075",
      "page_number": "906",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB076",
      "title": "Carbon-based Coatings for Electron Cloud Mitigation in SRF Photocathodes",
      "authors": [
        "M. Vogel",
        "X. Jiang",
        "C. Schlemper",
        "University Siegen",
        "Siegen",
        "Germany",
        "During the past three years",
        "we developed a coating along with a corresponding in-situ characterization process in order to realize SRF-gun surfaces featuring low secondary electron yield (SEY). Important aspects that have been accounted for are the homogeneity and adhesion of the coatings deposited on the cylindrical SRF-gun mantle. Furthermore",
        "the correlation between SEY and crystallinity",
        "morphology",
        "and contamination was studied in detail. The SEY maximum can be tuned between 1.5 and less than 0.7 depending on the deposition conditions. In this work",
        "we recap the results and present a general strategy for the effective mitigation of electron cloud multiplication."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb076.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB076",
      "page_number": "910",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPB077",
      "title": "Design Study of Mushroom Shaped Cavity for Evaluation of RF Critical Magnetic Field of Thin-film Superconductor",
      "authors": [
        "Utsunomiya University",
        "Utsunomiya",
        "Japan",
        "KEK",
        "Ibaraki",
        "Japan",
        "Center for Optical Research and Education",
        "Utsunomiya University",
        "Utsunomiya",
        "Japan",
        "For future accelerator",
        "superconducting RF cavity has high gradient of 45 MV/m or more is demanded. To obtain such a higher gradient",
        "there has been proposed a method of increasing an RF critical magnetic field of the cavity inner surface by coating of multi-layer thin-film superconductor. Their thickness is close to the London penetration depth. By producing a multilayer film structure in cavity inner surface",
        "it is believed to improve the RF critical magnetic field",
        "and to connect directly to high gradient. To demonstrate a creation of a thin film on a surface of Nb samples",
        "an RF cavity with a thin film coated Nb sample is needed to measure the RF critical field of the sample. To adapt it to the cavity",
        "to cool to cryogenic temperature and to establish the sample to supply the RF power",
        "it is necessary to design a cavity to produce a strong RF magnetic field parallel to the surface of the thin film sample. We designed a mushroom shaped cavity made of Nb and input coupler. Resonant frequency is 5.2 GHz by calculation. We calculated the resonant frequency and the field distribution",
        "compared with the measured values for the model cavity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb077.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB077",
      "page_number": "914",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB078",
      "title": "Fabrication of Large-area MgB2 Films on Copper Substrates",
      "authors": [
        "X. Guo",
        "K.X. Liu",
        "Z. Ni",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Q. Feng",
        "C. Yang",
        "Peking University",
        "Beijing",
        "People's Republic of China",
        "Magnesium diboride (MgB2) is a promising candidate material for SRF cavities because of its higher transition temperature and critical field compared with niobium. To meet the demand of RF test devices",
        "the fabrication of large-area MgB2 films on metal substrates is needed. In this work",
        "MgB2 films with 50-mm diameter were fabri-cated on Cu substrates by using an improved HPCVD setups at Peking University. The transition temperatures of MgB2 film on Cu substrate and with Mo buffer layer on Cu substrate are 36.2 K and 36.5 K",
        "respectively. The fabrication processes",
        "surface morphology",
        "superconduct-ing properties of these large-area MgB2 films are present-ed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb078.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB078",
      "page_number": "917",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB079",
      "title": "Simulations of RF Field-induced Thermal Feedback in Niobium and Nb3Sn Cavities",
      "authors": [
        "J. Ding",
        "D.L. Hallpresenter",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Cornell University",
        "Ithaca",
        "New York",
        "USA",
        "Thermal feedback is a known limitation for SRF cavities made of low-purity niobium",
        "as the increased losses at higher temperature described by BCS theory create a feedback mechanism that can eventually result in a runaway effect and associated cavity quench. In a similar manner",
        "niobium cavities coated with Nb3Sn may also be subject to increased losses from thermal feedback",
        "as Nb3Sn is possessed of a much lower thermal conductivity than niobium",
        "although this effect will be mitigated by the thin film nature of the coating. In order to better understand the degree to which thermal feedback plays a role in the performance of Nb3Sn cavities",
        "it is necessary to understand how the various components of the problem play a role in the outcome. In this paper",
        "we present the first results from simulations performed at Cornell University that model RF induced thermal feedback in both conventional niobium cavities and niobium cavities coated with a thin film of Nb3Sn. The impacts of layer thickness",
        "niobium substrate thermal conductivity",
        "and trapped flux on the performance of the cavity are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb079_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb079.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb079_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB079",
      "page_number": "920",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPB080",
      "title": "Measurement of Frequency, Temperature, RF Field Dependent Surface Resistance Using Superconducting Half Wave Cavity",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "S.U. De Silva",
        "J.R. Delayen",
        "H. Park",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "A theory of surface resistance of superconductor was rigorously formulated by Bardeen",
        "Cooper",
        "Schrieffer more than 50 years ago. Since then the accelerator community has been used the theory as a guideline to improve the surface resistance of the superconducting cavity. It has been observed that the surface resistance is dependent on frequency",
        "temperature and rf field strength",
        "and surface preparation. To verify these dependences",
        "a well-controlled study is required. Although many different types of cavities have been tested",
        "the typical superconducting cavities are built for specific frequencies of their application. They do not provide data other than at its own frequency. A superconducting half wave cavity is a cavity that enables us to collect the surface resistance data across frequencies of interest for particle accelerators and evaluate preparation techniques. This paper will present the design of the half wave cavity",
        "its electromagnetic mode characteristics and experimental results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SRF2017-",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/thpb080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/thpb080.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/thpb080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-THPB080",
      "page_number": "925",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 45,
  "scrape_time": "2025-10-11 03:46:29"
}