{
  "session_info": {
    "id": "WEM3",
    "name": "WEM3 - Mini orals with poster",
    "url": "https://proceedings.jacow.org/ICALEPCS2015/html/wem3.htm"
  },
  "papers": [
    {
      "paper_id": "WEM301",
      "title": "Timing Systems for ATNF Telescopes",
      "authors": [
        "CASS",
        "Epping",
        "Australia",
        "CSIRO ATNF",
        "Epping",
        "Australia",
        "Radio Telescopes require precise time and timing signals for accurate telescope pointing",
        "synchronisation of signal processing instrumentation and offline manipulation of observation data. We provide an overview of the timing system in use at our observatories; briefly describing the main features of the hardware",
        "firmware and software."
      ],
      "institutions": [],
      "abstract": "Slides WEM301 [0.568 MB] Poster WEM301 [0.468 MB] reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2015/talks/wem301_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2015/papers/wem301.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2015/posters/wem301_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2015-WEM301",
      "page_number": "660",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEM303",
      "title": "Virtualisation within the Control System Environment at the Australian Synchrotron",
      "authors": [
        "C.U. Felzmann",
        "N. Hobbs",
        "A. C. Starritt",
        "SLSA",
        "Clayton",
        "Australia",
        "Virtualisation technologies significantly improve efficiency and availability of computing services while reducing the total cost of ownership. Real-time computing environments used in distributed control systems require special consideration when it comes to server and application virtualisation. The EPICS environment at the Australian Synchrotron comprises more than 500 interconnected physical devices; their virtualisation holds great potential for reducing risk and maintenance. An overview of the approach taken by the Australian Synchrotron",
        "the involved hardware and software technologies as well as the configuration of the virtualisation eco-system is presented",
        "including the challenges",
        "experiences and lessons learnt."
      ],
      "institutions": [],
      "abstract": "Slides WEM303 [1.236 MB] Poster WEM303 [0.963 MB] reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2015/talks/wem303_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2015/papers/wem303.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2015/posters/wem303_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2015-WEM303",
      "page_number": "664",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEM304",
      "title": "Status Monitoring of the EPICS Control System at the Canadian Light Source",
      "authors": [
        "G. Wright",
        "M. Bree",
        "CLS",
        "Saskatoon",
        "Saskatchewan",
        "Canada",
        "The CLS uses the EPICS Distributed Control System (DCS) for control and feedback of a linear accelerator",
        "booster ring",
        "electron storage ring",
        "and numerous x-ray beamlines. The number of host computers running EPICS IOC applications has grown to 200",
        "and the number of IOC applications exceeds 700. The first part of this paper will present the challenges and current efforts to monitor and report the status of the control system itself by monitoring the EPICS network traffic. This approach does not require any configuration or application modification to report the currently active applications",
        "and then provide notification of any changes. The second part will cover the plans to use the information collected dynamically to improve upon the information gathered by process variable crawlers for an IRMIS database",
        "with the goal to eventually replace the process variable crawlers."
      ],
      "institutions": [],
      "abstract": "Slides WEM304 [0.550 MB] Poster WEM304 [1.519 MB] reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2015/talks/wem304_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2015/papers/wem304.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2015/posters/wem304_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2015-WEM304",
      "page_number": "667",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEM305",
      "title": "LabVIEW Interface for MADOCA II with Key-Value Stores in Messages",
      "authors": [
        "T. Matsumoto",
        "Y. Furukawa",
        "Y. Hamada",
        "T. Matsushita",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "MADOCA II is a next generation of the Message And Database Oriented Control Architecture (MADOCA) and a message driven distributed control framework as in MADOCA",
        "but several functions such as control on Windows and messaging with variable-length data were implemented by using ZeroMQ. A prototype of LabVIEW interface was also developed with a VI library of ZeroMQ and implemented into our control system at SPring-8 since 2013",
        "as presented at last ICALEPCS meeting. However",
        "it is recognized that the interface should be very easy to use to be spread for wide LabVIEW usage. In this paper",
        "a new redesigned LabVIEW interface is presented. In the new interface",
        "messages and variable-length data such as image data can be managed with key-value stores. Applications for client program and equipment management server can be easily constructed. The VIs are based on a dynamic link library (DLL) developed using C++ language. Therefore",
        "the upgrade on the interface is easily carried out with the replacement of DLL. The DLL can be also used from other languages such as Python and C++. The adoption of a new LabVIEW interface into our facility such as control of experimental stations is planned."
      ],
      "institutions": [],
      "abstract": "Slides WEM305 [0.660 MB] Poster WEM305 [0.732 MB] reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2015/talks/wem305_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2015/papers/wem305.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2015/posters/wem305_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2015-WEM305",
      "page_number": "669",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEM307",
      "title": "Custom Hardware Platform Based on Intel Edison Module",
      "authors": [
        "D. Pedretti",
        "D. Bortolato",
        "F. Gelain",
        "M.G. Giacchini",
        "D. Marcato",
        "M. Montis",
        "S. Pavinato",
        "J.A. Vásquez",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "M.A. Bellato",
        "R. Isocrate",
        "INFN- Sez. di Padova",
        "Padova",
        "Italy",
        "The Computer-on-Module approach makes cutting edge technology easily accessible and lowers the entry barriers to anyone prototyping and developing embedded systems. Furthermore",
        "it is possible to add all the system specific functionalities to the generic PC functions which are readily available in an off-the-shelf core module reducing the time to market and enhancing the creativity of system engineers. The purpose of this paper is to show a custom hardware platform based on the tiny and low power Intel Edison Compute Module",
        "which uses a 22nm Intel processing core and contains connectivity elements to ensure device-to-device and device-to-cloud connectivity. The Intel Edison carrier board designed is expected to act as a local intelligent node",
        "a readily available custom EPICS*",
        "** IOC for extending the control reach to small appliances in the context of the SPES project. The board acts as an Ethernet to RS232/RS422 interface translator with Power-Over-Ethernet supply and network booting as key features of this platform. The x86 architecture of the Edison makes standard Linux software deployment straightforward. Currently the board is in prototyping stage."
      ],
      "institutions": [],
      "abstract": "*http://www.aps.anl.gov/epics**http://www.lnl.infn.it/~epics Slides WEM307 [1.051 MB] Poster WEM307 [2.499 MB] reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2015/talks/wem307_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2015/papers/wem307.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2015/posters/wem307_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2015-WEM307",
      "page_number": "673",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEM308",
      "title": "A Multi-Modal Human-Machine-Interface for Accelerator Operation and Maintenance Applications",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "The advent of advanced mobile",
        "gaming and augmented reality devices provides users with novel interaction modalities. Today's accelerator control applications do not provide features like speech",
        "finger and hand gesture recognition or even gaze detection. Their look-and-feel and handling are typically optimized for mouse-based interactions and are not well suited for the specific requirements of more complex interaction modalities. This paper describes the conceptual design and implementation of an intuitive single-user",
        "multi-modal human-machine interface for accelerator operation and maintenance applications. The interface seamlessly combines standard actions (mouse)",
        "actions associated with 2D single/multi-finger gestures (touch sensitive display) and 3D single/multi-finger and hand gestures (motion controller)",
        "and spoken commands (speech recognition system). It will be an integral part of the web-based",
        "platform-neutral Web2cToGo framework belonging to the Web2cToolkit suite and will be applicable for desktop and notebook computers",
        "tablet computers and smartphones",
        "and even see-through augmented reality glasses."
      ],
      "institutions": [],
      "abstract": "Slides WEM308 [0.323 MB] Poster WEM308 [0.820 MB] reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2015/talks/wem308_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2015/papers/wem308.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2015/posters/wem308_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2015-WEM308",
      "page_number": "677",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEM309",
      "title": "A Graphical Tool for Viewing and Interacting with a Control System",
      "authors": [
        "J. Forsberg",
        "V.H. Hardion",
        "D.P. Spruce",
        "MAX-lab",
        "Lund",
        "Sweden",
        "This paper presents a graphical interface for displaying status information and enabling user interaction with the Tango based control system for the MAX IV synchrotron. It focuses on bringing an intuitive view of the whole system",
        "so that operators can quickly access the controls for any hardware based on its physical location. The view is structured into different layers that can be selectively shown",
        "and various live updated information can be displayed in the form of e.g. colour or text. Panning and zooming is supported",
        "as well as invoking commands. The interface is defined by an SVG drawing which can be edited without programming expertise. Since our system is based on modern web technologies",
        "it can be run as a web service accessible by standard browsers",
        "but it can also be integrated in GUI applications."
      ],
      "institutions": [],
      "abstract": "Slides WEM309 [2.325 MB] Poster WEM309 [0.917 MB] reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2015/talks/wem309_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2015/papers/wem309.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2015/posters/wem309_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2015-WEM309",
      "page_number": "681",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEM310",
      "title": "How Cassandra Improves Performances and Availability of HDB++ Tango Archiving System",
      "authors": [
        "R. Bourtembourg",
        "J.L. Pons",
        "P.V. Verdier",
        "ESRF",
        "Grenoble",
        "France",
        "The TANGO release 8 led to several enhancements",
        "including the adoption of the ZeroMQ library for faster and lightweight event-driven communication. Exploiting these improved capabilities",
        "a high performance",
        "event-driven archiving system",
        "named Tango HDB++*",
        "has been developed. Its design gives the possibility to store archiving data into Apache Cassandra: a high performance scalable NoSQL distributed database",
        "providing High Availability service and replication",
        "with no single point of failure. HDB++ with Cassandra will open up new perspectives for TANGO in the era of big data and will be the starting point of new big data analytics/data mining applications",
        "breaking the limits of the archiving systems which are based on traditional relational databases. This paper describes the current state of the implementation and our experience with Apache Cassandra in the scope of the Tango HDB++ project. It also gives some performance figures and use cases where using Cassandra with Tango HDB++ is a good fit."
      ],
      "institutions": [
        "* HDB++ project is the result of a collaboration between the Elettra synchrotron (Trieste) and the European Radiation Synchrotron Facility (Grenoble)"
      ],
      "abstract": "Slides WEM310 [1.897 MB] Poster WEM310 [2.446 MB] reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2015/talks/wem310_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2015/papers/wem310.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2015/posters/wem310_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2015-WEM310",
      "page_number": "685",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 8,
  "scrape_time": "2025-10-10 18:22:34"
}