{
  "session_info": {
    "id": "THPSM",
    "name": "THPSM - Poster Session",
    "url": "https://proceedings.jacow.org/PAC2013/html/thpsm.htm"
  },
  "papers": [
    {
      "paper_id": "THPSM01",
      "title": "Ion-irradiation Response of Gafchromic Films and their Application to the Measurement of the Transverse Beam Intensity Distribution",
      "authors": [
        "Y. Yuri",
        "I. Ishibori",
        "T. Ishizaka",
        "S. Okumura",
        "T. Yuyama",
        "JAEA/TARRI",
        "Gunma-ken",
        "Japan",
        "The response of radiochromic films",
        "Gafchromic HD-810 and EBT2",
        "was investigated using MeV-class proton and heavy-ion beams to apply the films to a measurement technique of the transverse beam intensity distribution at an azimuthally-varying-field cyclotron of Japan Atomic Energy Agency. The optical density of the films was increased linearly with the particle fluence of the beam in a low-fluence region. The linear-response range of the fluence was strongly dependent on ion species as well as on the film type. By analyzing the film response to absorbed dose with linear energy transfer",
        "it was found that the sensitivity of the film was decreased for heavy-ion beams. An approximate formula was given for the practical fluence range of the Gafchromic film HD-810 on an arbitrary ion beam. The present technique with the use of the two types of Gafchromic films enables us to measure the intensity distribution of a large-area ion beam handily in a wide fluence range. Using the technique",
        "we measured the relative intensity distribution of a large-area ion beam focused with multipole magnets and evaluated its size and uniformity."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm01.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSM02",
      "title": "Simulation of X-band Linac Neutron Source",
      "authors": [
        "University of Tokyo",
        "Tokyo",
        "Japan",
        "K. Dobashi",
        "T. Fujiwara",
        "M. Uesaka",
        "The University of Tokyo",
        "Nuclear Professional School",
        "Ibaraki-ken",
        "Japan",
        "Accuthera Inc.",
        "Kawasaki",
        "Kanagawa",
        "Japan",
        "In Tokyo University",
        "there is a plan of development of electron linac neutron source because the research reactor “Yayoi” was decommissioned and a new neutron source is required. This linac will be introduced in the core of the reactor",
        "so measurement of nuclear fuel materials can be expected. The application of this research is to measure more accurate nuclear data of some atomic fuel materials. It is necessary for analyzing debris in Fukushima 1st nuclear power plant. 30 MeV X-band linac is used and neutrons are generated by interactions between bremsstrahlung x-rays and materials. In this research",
        "the thermal electron gun",
        "the buncher and the target for the linac are optimized for generating as many neutrons as possible. Uranium can be used as target materials",
        "so high neutron flux was gained from the calculation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm02.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSM03",
      "title": "Direct Diagnostic Technique for a High Intensity Laser Based on Laser Compton Scattering",
      "authors": [
        "R. Sato",
        "A. Endo",
        "K. Nonomura",
        "K. Sakaue",
        "M. Washio",
        "Y. Yoshida",
        "Waseda University",
        "Tokyo",
        "Japan",
        "In laser produced plasma (LPP) EUV source",
        "high intensity pulse CO2 laser is essential for plasma generation. To achieve high conversion efficiency and stable EUV power",
        "we would like to measure laser profile in collision point and make feedback system. There is no way to directly measure high intensity lasers profile. Therefore",
        "we have been developing laser profiler based on laser Compton scattering. Laser profile can be measured by scanning focused electron beam while measuring Compton signal. We use compact electron accelerator based on Cs-Te photocathode RF gun at WASEDA university. Electron beam is focused by Solenoid lens. We simulated beam size using GPT",
        "obtained beam size of 10 μm rms. We measured beam size by GAFCHROMIC FILM HD 810. We have succeeded in observing minimum beam size of about 20 μm rms. In this conference",
        "we will report result of simulation",
        "beam size measurements",
        "and the present progress."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm03.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSM04",
      "title": "Conceptual Physics Design for the China-ADS Linac",
      "authors": [
        "J.Y. Tang",
        "P. Cheng",
        "H. Geng",
        "Z. Guo",
        "Z. Li",
        "C. Meng",
        "H.F. Ouyang",
        "S. Pei",
        "B. Sun",
        "J.L. Sun",
        "F. Yan",
        "Z. Yang",
        "C. Zhang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Y. He",
        "Y. Yang",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "The China-ADS project was launched in 2011 to pursue the R&D on key technologies towards a final demonstration facility with the capability of more than 1000 MW thermal power. The driver linac is defined to be 1.5 GeV in energy",
        "10 mA in current and in CW operation mode. It employs the superconducting structures except the RFQs. To meet the extremely high reliability and availability",
        "the linac is designed with much installed margin and fault tolerance",
        "including hot-spare injectors and local compensation method for key element failures. The accelerator complex consists of two parallel 10-MeV injectors",
        "a joint medium-energy beam transport line",
        "a main linac and a high-energy beam transport line. The conceptual accelerator physics design including beam dynamics studies with multiparticle simulations is presented here."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm04.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM04",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSM08",
      "title": "THz Band Horn Antennas Design",
      "authors": [
        "T.V. Bondarenko",
        "S.M. Polozov",
        "A.Yu. Smirnov",
        "MEPhI",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The report is concerned with the development of the irradiating antenna for THz radiation source. These sources are becoming widespread as sources for high power THz for various applications. The THz radiation is irradiated by relativistic high brightness electron beam traveling through the Cherenkov decelerating capillary channel. Antennas are built horn antennas type with circular and rectangular cross-sections. Irradiating antennas are constructed directly to the open end of the capillary channel and are used for the THz radiation directivity enhancement after passing through the capillary output. The investigation of the horns directivities were performed using the far-field analysis of the emerging radiation. The antennas were also investigated to perform low values of reflected power.",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm08.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM08",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSM10",
      "title": "Analysis of Propagated Effects in Proton Depth-Dose Distribution Curves Due To Initial Beam Energy Spread",
      "authors": [
        "P.A. Posocco",
        "M. Aslaninejad",
        "J.F. Piech",
        "S. Zalel",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "Proton therapy treatment planning uses depth-dose distribution curves of single initial beam energies to create Spread spread Out Bragg Peaks (SOBP). These are used to target specific regions in the body. However",
        "the initial energy spread of the beams leads to an uncertainty in beam energy",
        "affecting the dose distribution. In this paper",
        "previous work (M. Aslaninejad et al.",
        "2011: 189–196) on the depth-dose distribution of proton beams using inelastic-collision cross sections of liquid water is extended into use with chromatic beams. The effect of the initial energy spread on depth-dose distribution curves",
        "the distal dose and the SOBP are discussed. Limits on beam energy spread are suggested."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm10.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM10",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSM11",
      "title": "A Novel Solution for FFAG Proton Gantries",
      "authors": [
        "J. Pasternak",
        "M. Aslaninejad",
        "P.R.N. Holland",
        "P.A. Posocco",
        "G.W. Walton",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "In the recent years FFAG gantries have been studied for medical applications",
        "but none has so far been realised. The FFAG solution would reduce the complexity of beam line set-up",
        "its weight and therefore the cost of the rotating support",
        "in particular for heavy ions. The Imperial College London is using the experience gained in the Pamela Project and in the design and commissioning of EMMA to work on a solution of a non-scaling FFAG gantry",
        "which fulfills the full requirements for the spot scanning - parallel beam treatment technique",
        "and provides an easy interface to the upstream accelerator. The preliminary results will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm11.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM11",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSM12",
      "title": "A Ready-to-use Application of Laser-Plasma Accelerators using Gabor Lenses",
      "authors": [
        "J.K. Pozimski",
        "M. Aslaninejad",
        "N. Dover",
        "Z. Najmudin",
        "R.M. Nichols",
        "P.A. Posocco",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "A realistic particle distribution for a proton beam generated by laser-plasma interaction is required in order to simulate its transport through a Gabor lens system intended for use in radiobiology experiments. A stack of radiochromic films were exposed to a laser-driven proton beam of 25 MeV at the Vulcan Petawatt Experiment at Rutherford Lab and subsequently analysed to find the energy deposited per film and therefore the energy spectrum of the beam. Combined with the information on the radial profile of the dose in the films",
        "it was possible to generate an idealised particle distribution. This distribution was sampled and used as a realistic proton source in a simulation through the Gabor lens system published at IPAC’13",
        "scaled down to 4 MeV to fit the radiobiology experiment requirements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm12.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM12",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSM13",
      "title": "Characterisation of Nitrogen Clusters and Gas Jet Targets Under Varied Nozzle Geometries",
      "authors": [
        "C. Hughes",
        "N. Dover",
        "Z. Najmudin",
        "P.A. Posocco",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "Gas jets are widely used for targets in laser-plasma driven article acceleration experiments. Optimising the mechanism requires tailored gas jet density profiles. Therefore",
        "high density gas profiles have been investigated and characterised using different types of nozzles: sonic",
        "supersonic",
        "slit and supersonic slit. Gas jet profile optimisation was examined using nozzles of different diameters while varying gas pressure between 0 and 100 bar and valve opening duration. Gas jets produced by the nozzles were characterised using an optical probe laser. The gas jet density profile was measured through interferometry which was captured using a CCD camera. A second camera was used to record the Rayleigh scattering from the laser to confirm the presence clustering in nitrogen at high pressures."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm13.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM13",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSM14",
      "title": "Construction and Testing of the Dual Slot Resonance Linac",
      "authors": [
        "N. Barov",
        "R.H. Miller",
        "D.J. Newsham",
        "Far-Tech",
        "Inc.",
        "San Diego",
        "California",
        "USA",
        "The dual slot resonance linac (DSRL) is a novel method of providing enhanced coupling to a coupled cavity linac system",
        "resulting in very strong coupling. For the 11-cell",
        "2856 MHz structure described here",
        "the accelerator mode bandwidth exceeds 700 MHz",
        "about an order of magnitude greater than many traditional side-coupled and axis-coupled linacs. The strong coupling promotes phase and amplitude stabilization",
        "and offers decreased sensitivity to fabrication errors. We describe the construction",
        "tuning",
        "and RF conditioning of the prototype structure."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm14.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM14",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSM16",
      "title": "Design of a Compact X-Band Linac Structure for KAERI-RTX-ISU Medical Cyberknife Project",
      "authors": [
        "C.F. Eckman",
        "T. Downer",
        "IAC",
        "Pocatello",
        "IDAHO",
        "USA",
        "A. Andrews",
        "P. Buaphad",
        "Y. Kim",
        "ISU",
        "Pocatello",
        "Idaho",
        "USA",
        "Recently",
        "the Advanced Accelerator and Ultrafast beam Lab (AAUL) at Idaho State University (ISU)",
        "has been developing an X-band linac for the medical CyberKnife project by collaborating with Korean Atomic Energy Re- search Institute (KAERI) and Radiation Technology eXcellence (RTX) [1–3]. The medical CyberKnife is essentially an X-band linac",
        "which is attached to a robotic arm for precise cancer treatment. The X-band linac has considerable advantages in cancer treatment over C-band or other RF linacs",
        "partly due to its compact size and light weight. These qualities make the X-band linac easier to attach to a robotic arm",
        "thus making it more maneuver- able. Other advantages include a higher accelerating gradient and a higher shunt impedance. Since high mobility is necessary for precise cancer treatment",
        "the compact X-band RF linac was selected for the CyberKnife project. This paper describes detailed design processes of the X-band linac structure",
        "which was done with 2D SUPERFISH and 3D CST MICROWAVE STUDIO (CST MWS) electromagnetic simulation programs."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm16.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM16",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSM19",
      "title": "Compact Scheme for Laser-free THz-Sub-THz Source",
      "authors": [
        "RadiaBeam",
        "Santa Monica",
        "USA"
      ],
      "institutions": [],
      "abstract": "Undulator-free schemes based on resonant Cherenkov radiation in a small insertion device driven by a few MeV RF electron injector and alpha-magnet are considered. S- and C-band RF guns are compared to X-band multi-cell microlinac. Preference is given to planar radiator and wide quasi-flat sub-ps bunches that can be obtained with alpha magnet. It is shown that up to a millijoule of sub-THz energy can be produced within a macropulse.",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm19.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM19",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPSM21",
      "title": "Adaptation of the ISIS Induction-Cell Driver to a Low-Impedance X-Pinch Driver",
      "authors": [
        "R.V. Shapovalov",
        "W. Beezhold",
        "V.I. Dimitrov",
        "R.B. Spielman",
        "IAC",
        "Pocatello",
        "IDAHO",
        "USA",
        "We summarize the work done to design a system to non-destructively convert the Idaho State Induction System (ISIS) induction cell driver (ICD) to a low impedance pulse power driver for x-pinch applications. The simulation results show that such a driver can supply about 300-kA peak current with about 70-ns rise time (10-90%). However",
        "simulations also show that the negative reflective wave is formed",
        "which can cause the destruction of the ISIS ICD’s pulse forming line (PFL). Particular attention was taken to simulate the effect of misfire of one of the PFLs. To reduce the amplitude of this destructive wave",
        "high power damping resistors should be placed after the output of each PFL. This would result in the maximum current achievable by this driver to be limited to about 200-kA peak value."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/thpsm21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/thpsm21.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/thpsm21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-THPSM21",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 13,
  "scrape_time": "2025-10-11 01:55:54"
}