{
  "session_info": {
    "id": "TH2A",
    "name": "TH2A - Beams / Electron Accelerators & Applications",
    "url": "https://proceedings.jacow.org/linac2016/html/th2a.htm"
  },
  "papers": [
    {
      "paper_id": "TH2A01",
      "title": "The Linac Laser Notcher for the Fermilab Booster",
      "authors": [
        "D.E. Johnson",
        "K.L. Duel",
        "M.H. Gardner",
        "T.R. Johnson",
        "D. Slimmer",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "PriTel",
        "Inc.",
        "Naperville",
        "USA",
        "Optical Engines",
        "Inc.",
        "Colorado Springs",
        "USA",
        "In synchrotron machines",
        "the beam extraction is accomplished by a combination of septa and kicker magnets which deflect the beam from an accelerator into another. Ideally the kicker field must rise/fall in between the beam bunches. However",
        "in reality",
        "an intentional beam-free time region (aka \"notch\") is created on the beam pulse to assure that the beam can be extracted with minimal losses. In the case of the Fermilab Booster",
        "the notch is created in the ring near injection energy by the use of fast kickers which deposit the beam in a shielded collimation region within the accelerator tunnel. With increasing beam power it is desirable to create this notch at the lowest possible energy to minimize activation. The Fermilab Proton Improvement Plan (PIP) initiated an R&D project to build a laser system to create the notch within a linac beam pulse at 750 keV. This talk will describe the concept for the laser notcher and discuss our current status",
        "commissioning results",
        "and future plans."
      ],
      "institutions": [],
      "abstract": "Slides TH2A01 [15.170 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/linac2016/talks/th2a01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/linac2016/papers/th2a01.pdf",
      "poster_url": "https://proceedings.jacow.org/linac2016/posters/th2a01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2016-TH2A01",
      "page_number": "710",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TH2A02",
      "title": "Results From the Laserwire Emittance Scanner and Profile Monitor at CERN's Linac4",
      "authors": [
        "T. Hofmann",
        "U. Raich",
        "F. Roncarolo",
        "CERN",
        "Geneva",
        "Switzerland",
        "G.E. Boorman",
        "A. Bosco",
        "S.M. Gibson",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "G.E. Boorman",
        "A. Bosco",
        "S.M. Gibson",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "A novel",
        "non-invasive",
        "H− laser-wire scanner has been tested during the beam commissioning of CERN's new Linac4. Emittance measurements were performed at beam energies of 3 and 12 MeV with this new device and were found to closely match the results of conventional slit-grid methods. In 2015",
        "the configuration of this laser-wire scanner was substantially modified. In the new setup the electrons liberated by the photo-detachment process are deflected away from the main beam and focused onto a single crystal diamond detector that can be moved in order to follow the laser beam scan. The beam profiles measured with the new laser-wire setup at 50 MeV",
        "80 MeV and 107 MeV are in good agreement with the measurements of nearby SEM grids and wire-scanners. The design of the final laser-wire scanner for the full 160 MeV beam energy will also be presented. In Linac4 two independent laser-wire devices will be installed in the transfer line to the BOOSTER ring. Each device will be composed of two parts: one hosting the laser-wire and the electron detector and the second hosting the segmented diamond detector used to acquire the transverse profiles of the H0 beamlets."
      ],
      "institutions": [],
      "abstract": "Slides TH2A02 [3.164 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/linac2016/talks/th2a02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/linac2016/papers/th2a02.pdf",
      "poster_url": "https://proceedings.jacow.org/linac2016/posters/th2a02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2016-TH2A02",
      "page_number": "715",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TH2A03",
      "title": "Complete Transverse 4D Beam Characterization for Ions Beams at Energies of Few MeV/u",
      "authors": [
        "M.T. Maier",
        "X. Du",
        "P. Gerhard",
        "L. Groening",
        "S. Mickat",
        "H. Vormann",
        "GSI",
        "Darmstadt",
        "Germany",
        "Measurement of the ion beam rms-emittances is done through determination of the second order beam moments. For time being the moments quantifying the amount of inter-plane coupling",
        "as <xy'> for instance",
        "have been accessible to measurements just for very special cases of ions at energies below 200 keV/u using pepperpots. This talk presents successful measurements of all inter-plane coupling moments at 1 to 11 MeV/u. From first principles the used methods are applicable at all ion energies. The first campaign applied skewed quadrupoles in combination with a regular slit/grid emittance measurement device. The second campaign used a rotatable slit/grid device in combination with regular quadrupoles."
      ],
      "institutions": [],
      "abstract": "Slides TH2A03 [17.343 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/linac2016/talks/th2a03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/linac2016/papers/th2a03.pdf",
      "poster_url": "https://proceedings.jacow.org/linac2016/posters/th2a03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2016-TH2A03",
      "page_number": "720",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 22:53:29"
}