{
  "session_info": {
    "id": "FRKL",
    "name": "FRKL - Keynote Session V",
    "url": "https://proceedings.jacow.org/icalepcs2021/html/frkl.htm"
  },
  "papers": [
    {
      "paper_id": "FRKL01",
      "title": "Laser Ion Accelerator and Its Applications",
      "authors": [
        "PKU",
        "Beijing",
        "People’s Republic of China",
        "The concept of laser plasma acceleration was first proposed by Tajima and Dawson in 1979",
        "and was soon extended from accelerating electrons with gas targets to accelerating ions with solid targets. It is considered as a promising candidate for future compact accelerator and radiation source. Laser ion acceleration is a very high gradient explosive process’when an ultrahigh-intensity laser irradiates on a solid target",
        "the established acceleration field can exceed TV/m",
        "accelerating ions to high energy within tens of micron distance. The laser-driven pulsed high-current ion sources may enable significant advances in many fields",
        "such as tumor therapy",
        "proton radiograph",
        "warm dense matter and fast ignition of fusion cores. In this presentation",
        "we will introduce several main acceleration mechanisms and the latest research progress of laser ion acceleration. We will also introduce some frontier developments of laser proton accelerator in Peking University. With the support of the Ministry of Science and Technology of China",
        "a prototype of proton radiotherapy system based on PW (10  15 W) laser accelerator is under construction."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/frkl01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/frkl01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/frkl01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-FRKL01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:07:32"
}