{
  "session_info": {
    "id": "THOBB",
    "name": "THOBB - Contributed Oral Presentations, Accelerator Technology",
    "url": "https://proceedings.jacow.org/IPAC2014/html/thobb.htm"
  },
  "papers": [
    {
      "paper_id": "THOBB01",
      "title": "Pursuing the Origin and Remediation of Low Q0 observed in the Original CEBAF Cryomodules",
      "authors": [
        "R.L. Geng",
        "J.F. Fischer",
        "C.E. Reece",
        "A.V. Reilly",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "F.S. He",
        "Y.M. Li",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "We report on results of a new investigation into the Q0 degradation phenomenon observed in original CEBAF cavities when assembled into cryomodules. As a result",
        "the RF dissipation losses increased by roughly a factor of two. The origin of the degradation",
        "first observed in 1994",
        "has remained unresolved up to current period",
        "despite much effort. Recently",
        "a new investigation has been launched",
        "taking advantage of the latest cryomodule to undergo refurbishment. Systematic measurements are conducted with respect to the magnetic shielding effects of the double-layer shields and the magnetic properties of various components within the inner shield. This resulted in the new discovery of strongly magnetized strut springs as a major source of remnant magnetic flux near a cavity inside of all magnetic shielding. New springs with superior magnetic properties have been found",
        "evaluated and implemented into the current cryomodule. In this contribution",
        "we will review the data accumulated so far. Options for complete Q0 preservation of assembled cavities and possible Q0 remediation for those 330 cavities already installed in CEBAF will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/thobb01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/thobb01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/thobb01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-THOBB01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THOBB02",
      "title": "Superconducting Cavity Cryomodule Designs for the Next Generation of CW Linacs: Challenges and Options",
      "authors": [
        "T.H. Nicol",
        "Y.O. Orlov",
        "T.J. Peterson",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The designs of nearly all superconducting RF (SRF) linacs over the last several years",
        "with one notable exception being CEBAF at Jefferson Lab",
        "have assumed pulsed beam operation with relatively low duty factors. These include the XFEL at DESY",
        "the ILC",
        "the original configuration for Project X at Fermilab",
        "as well as several others. Recently proposed projects",
        "on the other hand",
        "including the LCLS-II at SLAC",
        "the newly configured low and medium energy sections for Project X",
        "and FRIB at Michigan State",
        "to name a few",
        "assume continuous wave or CW operation on quite a large scale with ambitious gradients and cavity performance requirements. This has implications in the cavity design as well as in many parts of the overall cryomodule due to higher dynamic heat loads in the cavities themselves and higher heat loads in the input and high-order-mode (HOM) couplers. Piping internal to the cryomodule",
        "the effectiveness of thermal intercepts",
        "the size of integrated heat exchangers",
        "and many other aspects of the overall design are also affected. This paper will describe some of these design considerations as we move toward the next generation of accelerator projects."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/thobb02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/thobb02.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/thobb02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-THOBB02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THOBB03",
      "title": "Novel Device for In-situ Thick Coatings of Long, Small Diameter Accelerator Vacuum Tubes",
      "authors": [
        "A. Hershcovitch",
        "M. Blaskiewicz",
        "J.M. Brennan",
        "W. Fischer",
        "C.J. Liaw",
        "W. Meng",
        "R.J. Todd",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A.X. Custer",
        "A.A. Dingus",
        "M.Y. Erickson",
        "N.Z. Jamshidi",
        "R.R. Laping",
        "H.J. Poole",
        "PVI",
        "Oxnard",
        "California",
        "USA",
        "To alleviate the problems of unacceptable ohmic heating and of electron clouds",
        "a 50 cm long cathode magnetron mole was fabricated and successfully operated to copper coat an assembly containing a full-size stainless steel cold bore RHIC magnet tubing connected to two types of RHIC bellows",
        "to which two additional RHIC tubing pipes were connected. To increase cathode lifetime",
        "movable magnet package was developed",
        "and thickest possible cathode was made",
        "with rather challenging target to substrate distance of less than 1.5 cm. The magnetron is mounted on a carriage with spring loaded wheels that successfully crossed bellows and adjusted for variations in vacuum tube diameter",
        "while keeping the magnetron centered. Electrical power and cooling water are fed through a motorized spool driven umbilical cabling system",
        "which is enclosed in a flexible braided metal sleeve. Optimized process to ensure excellent adhesion was developed. Coating adhesion of 10 μm Cu surpassed all industrial tests; exceeded maximum capability of a 12 kg pull test fixture. Details of experimental setup for coating two types of bellows and a full-scale magnet tube sandwiched between them will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/thobb03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/thobb03.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/thobb03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-THOBB03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 20:48:25"
}