{
  "session_info": {
    "id": "WEOCB",
    "name": "WEOCB - Contributed Oral Presentations, Medical Accelerators and Applications",
    "url": "https://proceedings.jacow.org/PAC2013/html/weocb.htm"
  },
  "papers": [
    {
      "paper_id": "WEOCB1",
      "title": "Diagnostic Proton Computed Tomography Using Laser-Driven Ion Acceleration",
      "authors": [
        "K.E. Woods",
        "S. Boucher",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "V.A. Bashkirov",
        "R.W. Schulte",
        "LLU/MC",
        "Loma Linda",
        "California",
        "USA",
        "The University of Texas at Austin",
        "Austin",
        "Texas",
        "USA",
        "Although the growing utilization of computed tomography (CT)-based imaging has led to major advances in diagnostic capabilities",
        "it has also resulted in higher cumulative radiation doses to patients. In order to fully exploit the benefits of high-resolution diagnostic CT scans while minimizing the risks of radiation-induced cancer",
        "the realization of low-dose CT is crucial. Recent research has shown that the use of protons",
        "rather than X-rays",
        "for CT has the potential to greatly reduce the radiation dose delivered to the patient without reducing image quality. RadiaBeam Technologies",
        "in collaboration with the Loma Linda University Medical Center and the University of Texas at Austin",
        "is proposing the development of a proton CT scanner utilizing laser-driven ion acceleration (LDIA) techniques. The initial design of this system is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/weocb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/weocb1.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/weocb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEOCB1",
      "page_number": "770",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOCB2",
      "title": "Next Generation of Radiobiology Experiments",
      "authors": [
        "P.A. Posocco",
        "S.H. Tsang",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "The Imperial College of Science",
        "Technology and Medicine",
        "London",
        "United Kingdom",
        "Proton Therapy (PT) is a well-established cancer treatment",
        "which has helped more than 10’000 patients in the world in the last year alone. The outcomes are very positive and for most patients PT yields much better results in terms of morbidity and tumour control than conventional Radio Therapy",
        "because with protons it is possible to control more precisely the energy deposition inside the tumour. However",
        "the understanding of the interaction between radiation and cells is fundamental to fully exploit this aspect",
        "and therefore in-vitro and in-vivo experiments comparing the effect of protons and photons need to be carried out. In this paper we will critically explore the options provided by the research groups and facilities operating in this field and we will be compiling a list of desiderata for the next generation of accelerators used for these experiments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/weocb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/weocb2.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/weocb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-WEOCB2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 01:45:56"
}