{
  "session_info": {
    "id": "MOZLR",
    "name": "MOZLR - Invited Plenary - Session 3",
    "url": "https://proceedings.jacow.org/HB2014/html/mozlr.htm"
  },
  "papers": [
    {
      "paper_id": "MOZLR07",
      "title": "Accelerator Challenges of Hadron Linacs and the Facility for Rare Isotope Beams - Extending High Beam Power from Protons to Heavy Ions",
      "authors": [
        "J. Wei",
        "N.K. Bultman",
        "F. Casagrande",
        "C. Compton",
        "K.D. Davidson",
        "B. Drewyor",
        "A. Facco",
        "F. Feyzi",
        "P.E. Gibson",
        "T . Glasmacher",
        "L.T. Hoff",
        "K. Holland",
        "M. Ikegami",
        "M.J. Johnson",
        "S. Jones",
        "S.M. Lidia",
        "G. Machicoane",
        "F. Marti",
        "S.J. Miller",
        "D. Morris",
        "J.A. Nolen",
        "S. Peng",
        "J. Popielarski",
        "L. Popielarski",
        "G. Pozdeyev",
        "T. Russo",
        "K. Saito",
        "T. Xu",
        "Y. Yamazaki",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "K. Dixon",
        "V. Ganni",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "M.P. Kelly",
        "J.A. Nolen",
        "P.N. Ostroumov",
        "ANL",
        "Argonne",
        "USA",
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "During the past decades",
        "linac-based neutron-generating facilities like SNS",
        "J-PARC",
        "and LEDA advanced the frontier of proton beam power by an order of magnitude to 1 MW level. The Facility for Rare Isotope Beams (FRIB) driver linac currently under construction at Michigan State University will advance the frontier of heavy-ion beam power by more than two-order-of-magnitudes to 400 kW. FRIB will accelerate high intensity beams",
        "proton to uranium",
        "up to 200MeV/u. The accelerator system includes many cutting edge technologies that can provide a basis for this talk which will discuss how these current developments may lead to the next generation of very high intensity machines",
        "including looking forward to projects such as the CADS",
        "ESS",
        "IFMIF",
        "SARAF",
        "and"
      ],
      "institutions": [
        "Funding: Work supported by the U.S. Department of Energy Office of Science under Cooperative Agreement DE-SC0000661 and the National Science Foundation under Grant No. PHY-1102511."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HB2014/talks/mozlr07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HB2014/papers/mozlr07.pdf",
      "poster_url": "https://proceedings.jacow.org/HB2014/posters/mozlr07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2014-MOZLR07",
      "page_number": "12",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOZLR08",
      "title": "Heavy Ion Synchrotrons - Beam Dynamics Issues and Dynamic Vacuum Effects",
      "authors": [
        "GSI",
        "Darmstadt",
        "Germany",
        "Although to a certain extent also used to accelerate heavy ions",
        "most of the existing synchrotrons have been designed and developed for Proton acceleration. There is only a quite small number of synchrotrons which have been optimized for heavy ion operation. In most cases such machines suffer from a missing powerful injector which enables the accumulation of intense heavy ion beams. Therefore",
        "even those few heavy ion synchrotrons are often operated only with light ions and Protons. In general",
        "the missing high injector current for heavy ion synchrotrons requires accumulation and stacking techniques",
        "which make use of a large fraction of the machine acceptance and finally lead to beams with large emittances and filling factors. Such systematic issues and their technical and beam dynamics implications typical for heavy ion synchrotrons will be summarized and presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HB2014/talks/mozlr08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HB2014/papers/mozlr08.pdf",
      "poster_url": "https://proceedings.jacow.org/HB2014/posters/mozlr08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2014-MOZLR08",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOZLR09",
      "title": "Heavy-ion Cyclotron Gymnastics and Associated Beam Dynamics Issues",
      "authors": [
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "Isochronous cyclotrons have been indispensable tools of nuclear physics research for nearly 50 years because they are suited to obtain energetic heavy ions with sufficient intensity in spite of its compactness and relatively low construction costs. The heavy-ion cyclotron will be a potential candidate for a driver accelerator in future high-intensity heavy-ion facilities such as the “second-generation” radioactive beam facilities. Success of the heavy-ion cyclotron in the future strongly depends on available beam intensity obtained under moderate construction costs. In my presentation",
        "after a brief introduction of fundamentals related to the heavy-ion cyclotron",
        "several beam-intensity-limiting factors will be discussed for the cyclotron of separate sector type",
        "laying much emphasis on longitudinal space charge effect and its influence on beam extraction. Although the space charge effect strongly depends on ion energy",
        "we will cover the energy range of 0.7 ~ 345 MeV/nucleon based on our experiences on the design studies for and the operation of the ring cyclotrons currently working at RIKEN Radioactive Beam Factory."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HB2014/talks/mozlr09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HB2014/papers/mozlr09.pdf",
      "poster_url": "https://proceedings.jacow.org/HB2014/posters/mozlr09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2014-MOZLR09",
      "page_number": "18",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOZLR10",
      "title": "Intensity or Brightness Limitations of Cyclotrons and FFAGs",
      "authors": [
        "TRIUMF",
        "Canada's National Laboratory for Particle and Nuclear Physics",
        "Vancouver",
        "Canada",
        "From both simulations and measurements",
        "it is known that at sufficiently high charge per bunch",
        "the bunches in an isochronous cyclotron undergo a vortex effect whose ultimate result is that the bunches reshape into circularly-symmetric distributions in the radial-longitudinal plane. This state cannot exist for arbitrarily high charge since at some point the space charge force will overwhelm the cyclotron's radial magnetic focusing. We apply envelope equation (or ‘‘second moment'') formalism to determine (a) the particle motion frequencies (b) the self-consistent size",
        "or turn width",
        "and (c) the upper limit for the bunch charge for a given size of the bunch. This work is partly a review of work by Sacherer",
        "Kleeven",
        "and Bertrand-Ricaud",
        "and partly a synthesis of those works. Some comparisons are made to published data for the PSI high intensity cyclotrons and new data from the TRIUMF cyclotron."
      ],
      "institutions": [
        "Funding: TRIUMF receives federal funding via a contribution agreement through the National Research Council of Canada."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HB2014/talks/mozlr10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HB2014/papers/mozlr10.pdf",
      "poster_url": "https://proceedings.jacow.org/HB2014/posters/mozlr10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2014-MOZLR10",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:13:28"
}