{
  "session_info": {
    "id": "MOYE",
    "name": "MOYE - Accelerator Technology",
    "url": "https://proceedings.jacow.org/napac2022/html/moye.htm"
  },
  "papers": [
    {
      "paper_id": "MOYE2",
      "title": "LCLS-II HE vCM Test Results: Newly Developed N-Doping Treatment and Plasma Processing",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "This talk presents the results of the LCLS-II HE verification cryomodule (vCM)",
        "which aimed at verifing that the cryomodule is capable to meet the project specification (Q0=2.7·1010 at 21 MV/m) with the newly developed nitrogen doping treatment. The test also carried out detailed studies on multipacting processing optimization and Q-factor quench degradation. Plasma processing was also carried out in four out of eight cavities in the cryomodule",
        "showing its effectiveness in eliminating multipacting. These studies will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/moye2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/moye2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/moye2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOYE2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOYE3",
      "title": "Experiments on a Conduction Cooled Superconducting Radio Frequency Cavity with Field Emission Cathode",
      "authors": [
        "Y. Ji",
        "R. Dhuley",
        "C.J. Edwards",
        "J.C.T. Thangaraj",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "V. Korampally",
        "D. Mihalcea",
        "O. Mohsen",
        "P. Piot",
        "I. Salehinia",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "To achieve Ampere-class electron beam accelerators the pulse delivery rate need to be much higher than the typical photo injector repetition rate of the order of a few kilohertz. We propose here an injector which can",
        "in principle",
        "generate electron bunches at the same rate as the operating RF frequency. A conduction-cooled superconducting radio frequency (SRF) cavity operating in the CW mode and housing a field emission element at its region of high axial electric field can be a viable method of generating high-repetition-rate electron bunches. In this paper",
        "we report the development and experiments on a conduction-cooled Nb3Sn cavity with a niobium rod intended as a field emitter support. The initial experiments demonstrate ~0.4 MV/m average accelerating gradient",
        "which is equivalent of peak gradient of 3.2 MV/m. The measured RF cavity quality factor is 1.4 × 108 slightly above our goal. The achieved field gradient is limited by the relatively low input RF power and by the poor coupling between the external power supply and the RF cavity. With ideal coupling the field gradient can be as high as 0.6 MV/m still below our goal of about 1 MV/m"
      ],
      "institutions": [
        "Funding: The project is supported by DOE HEP Accelerator Stewardship award to Fermilab and Northern Illinois University"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/moye3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/moye3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/moye3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOYE3",
      "page_number": "16",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOYE4",
      "title": "Diagnoses and Repair of a Crack in the Drift Tube LINAC Accelerating Structure at LANSCE",
      "authors": [
        "W.C. Barkley",
        "D.A. Bingham",
        "M.J. Borden",
        "J.A. Burkhart",
        "D.J. Evans",
        "J.T.M. Lyles",
        "J.P. Montross",
        "J.F. O’Hara",
        "B.J. Roller",
        "M. Sanchez Barrueta",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Many were perplexed at the inability of Module 3 at LANSCE to operate at peak power and duty factor while running production beam. During the 2018 production run",
        "the DTL began to intermittently break down",
        "leading to a series of root cause investigations. These analyses included eliminating the usual suspects: vacuum leak",
        "debris in tank",
        "driveline window",
        "power coupler",
        "etc. The throttling back of repetition rate from 120 to 60 Hz allowed continued production with a diminished beam",
        "one that reduced neutron flux to three experimental areas. During the annual shutdown in 2019",
        "a more thorough investigation involving the use of x-ray detection",
        "high-resolution cameras and IR detection through site glass windows was performed. After a tenacious search",
        "a 30 cm long crack was discovered in a weld at one of the ion pump port grates. Inaccessibility for welding from the outside and in a confined space",
        "non-intrusive repairs were tried first but were unsuccessful. Ultimately",
        "an expert welder entered the tank to weld the crack under unfamiliar welding conditions. This paper describes the diagnoses",
        "non-intrusive solutions and ultimate repair of the crack in the accelerating structure."
      ],
      "institutions": [
        "Funding: Work supported by the United States Department of Energy, National Nuclear Security Agency, under contract DE-AC52-06NA25396"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/moye4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/moye4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/moye4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOYE4",
      "page_number": "19",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOYE5",
      "title": "In Situ Plasma Processing of Superconducting Cavities at JLab",
      "authors": [
        "T. Powers",
        "N.C. Brock",
        "T.D. Ganey",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Jefferson Lab has an ongoing R&D program in plasma processing which is close to going into production processing in the CEBAF accelerator. Plasma processing is a common technique for removing hydrocarbons from surfaces",
        "which increases the work function and reduces the secondary emission coefficient. Unlike helium processing which relies on ion bombardment of the field emitters",
        "plasma processing uses free oxygen produced in the plasma to break down the hydrocarbons on the surface of the cavity. The initial focus of the effort was processing C100 cavities by injecting RF power into the HOM coupler ports. Results from processing cryomodule in the cryomodule test bunker as well as vertical test results will be presented. We plan to start processing cryomodules in the CEBAF tunnel within the next year. The goal will be to improve the operational gradients and the energy margin of the linacs. This work will describe the systems and methods used at JLAB for processing cavities using an argon oxygen gas mixture. Before and after plasma processing results will also be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/moye5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/moye5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/moye5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOYE5",
      "page_number": "22",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOYE6",
      "title": "Spin-Polarized Electron Photoemission and Detection Studies",
      "authors": [
        "A.C. Rodriguez Alicea",
        "R. Palai",
        "University of Puerto Rico",
        "Rio Piedras Campus",
        "San Juan",
        "Puerto Rico",
        "O. Chubenko",
        "S.S. Karkare",
        "Arizona State University",
        "Tempe",
        "USA",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "The experimental investigation of new photocathode ma- terials is time-consuming",
        "expensive",
        "and difficult to accom- plish. Computational modelling offers fast and inexpensive ways to explore new materials",
        "and operating conditions",
        "that could potentially enhance the efficiency of polarized electron beam photocathodes. We report on Monte-Carlo simulation of electron spin polarization (ESP) and quantum efficiency (QE) of bulk GaAs at 2",
        "77",
        "and 300 K using the data obtained from Density Functional Theory (DFT) cal- culations at the corresponding temperatures. The simulated results of ESP and QE were compared with reported exper- imental measurements",
        "and showed good agreement at 77 and 300 K."
      ],
      "institutions": [
        "Funding: Brookhaven National Laboratory and the Department of Energy of United States under contract No. DE-SC0012704 Also, the Center for Bright Beams, NSF award PHY-1549132."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/moye6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/moye6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/moye6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOYE6",
      "page_number": "26",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-11 00:09:22"
}