{
  "session_info": {
    "id": "WEOAMA",
    "name": "WEOAMA - Precision Mechanics",
    "url": "https://proceedings.jacow.org/medsi2018/html/weoama.htm"
  },
  "papers": [
    {
      "paper_id": "WEOAMA01",
      "title": "The Status of the New High-Dynamic DCM for Sirius",
      "authors": [
        "R.R. Geraldes",
        "R.M. Caliari",
        "G.B.Z.L. Moreno",
        "L. Sanfelici",
        "M. Saveri Silva",
        "H.C.N. Tolentino",
        "H. Westfahl Jr.",
        "LNLS",
        "Campinas",
        "Brazil",
        "T.A.M. Ruijl",
        "R.M. Schneider",
        "MI-Partners",
        "Eindhoven",
        "The Netherlands",
        "The monochromator is known to be one of the most critical optical elements of a synchrotron beamline",
        "since it directly affects the beam quality with respect to energy and position. Naturally",
        "the new 4th genera-tion machines",
        "with their small emittances",
        "start to bring higher stability performance requirements",
        "in spite of factors as high power loads and variations",
        "high radiation levels",
        "ultra-high vacuum compatibility and vibration sources. In response to that",
        "an innova-tive concept of a high-dynamic vertical DCM (Double Crystal Monochromator) with angular range between 3 and 60 degrees (equivalent to 2.3 to 38 keV with Si(111)) has been developed at the Brazilian Synchro-tron Light Laboratory. A highly repeatable dynamic system",
        "with servo control bandwidth of 250 Hz",
        "has been achieved and will be installed at Sirius macromo-lecular crystallography beamline ' MANACA ' still in 2018. The complete offline results of the in-vacuum cryocooled high-dynamic DCM",
        "showing stability between crystals around 15 nrad RMS up to 2.5 kHz",
        "even during the Bragg angle motion for flyscans",
        "are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weoama01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weoama01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weoama01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEOAMA01",
      "page_number": "147",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAMA02",
      "title": "Sample Stabilization for Tomography Experiments in Presence of Large Plant Uncertainty",
      "authors": [
        "T. Dehaeze",
        "C.G.R.L. Collette",
        "PML",
        "Liège",
        "Belgium",
        "ULB - FSA - SMN",
        "Bruxelles",
        "Belgium",
        "T. Dehaeze",
        "M. Magnin-Mattenet",
        "ESRF",
        "Grenoble",
        "France",
        "A new low emittance lattice storage ring is under construction at the ESRF. In this new instrument",
        "an upgraded end station for ID31 beamline must allow to position the samples along complex trajectories with a nanometer precision. In order to reach these requirements",
        "samples have to be mounted on high precision stages",
        "combining a capability of large stroke",
        "spin motion",
        "and active rejection of disturbances. First",
        "the end station will be presented with the associated requirements. However",
        "the precision is limited by thermal expansion and various imperfections that are not actively compensated. Our approach is to add a Nano Active Stabilization System (NASS) which is composed of a 6DoF Stewart platform and a 6 DoF metrology system. A 3D model of the end station updated with experimental data is developed. As the mass of the samples may vary by up to two orders of magnitudes",
        "robust control strategies are required to address such plant uncertainty. The proposed control strategy are presented and applied on the developed model by conducting time domain simulations of tomography experiment in presence of instrumentation noise and system uncertainty."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weoama02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weoama02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weoama02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEOAMA02",
      "page_number": "153",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAMA03",
      "title": "High-Accuracy Small Roll Angle Measurement Method Based on Dual-Grating Diffraction Heterodyne Interferometer",
      "authors": [
        "S. Tang",
        "M. Li",
        "H. Liang",
        "W.F. Sheng",
        "J. Yang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Small roll angle (ROLL) is an crucial parameter for the motion performances of ultra-precision guide way often applied in fine mechanics and instruments of synchrotron radiation",
        "such as long trace profiler (LTP). However",
        "it is difficult to be measured by conventional methods including interferometer and autocollimator owing to their low sensitivities in axial direction. There is an orthogonal dilemma between measured direction and angular displacement plane for ROLL measurement. Therefore",
        "a novel method based on dual-grating diffraction heterodyne interferometer is presented",
        "which uses the combining scheme of diffraction grating and heterodyne interferometer to overcome the orthogonal problem. Moreover",
        "the design of differential structure with dual-grating and grating interferometer instead of pure interferometer",
        "is adopted to improve the practicability against the environment",
        "e. g. air fluctuation",
        "inconstant rotation center. It has inherited advantages of high-resolution up to 2nrad",
        "high sampling rate up to 50kHz",
        "and contactless by mathematical modeling and analysis. So",
        "theoretcial and experimental verifications are both implemented to its validation."
      ],
      "institutions": [
        "Funding: The work is supported by National Natural Science Foundation of China, NSFC (Grant No. 61505213)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weoama03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weoama03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weoama03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEOAMA03",
      "page_number": "163",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAMA04",
      "title": "The Design of Exactly-Constrained X-Ray Mirror Systems for Sirius",
      "authors": [
        "R.R. Geraldes",
        "G.V. Claudianopresenter",
        "V.Z. Ferreira",
        "L. Sanfelici",
        "A. Sikorski",
        "M.S. Souza",
        "H.C.N. Tolentino",
        "L.M. Volpe",
        "H. Westfahl Jr.",
        "LNLS",
        "Campinas",
        "Brazil",
        "The first set of Sirius beamlines is expected to start operating in early 2019. Regarding X-ray mirror sys-tems",
        "a single design concept has been possible thanks to the standardization of side-bounce fixed-shape mirrors. To preserve the extreme quality of both the mirror figures and the source",
        "the main design targets were minimizing mechanical and thermal distortions in the mirrors while maximizing mechanical and thermal stabilities. A deterministic high-resolution exactly-constrained flexure-based mirror support provides pitch tuning within 100 nrad and resonances above 150 Hz",
        "while dealing with clamping and thermal ex-pansion effects. The adopted cooling strategy was indirect cryocooling via cryostats",
        "drastically minimiz-ing thermal gradients and distortions in the mirrors",
        "decoupling vibration sources and simplifying cooling circuits. Finally",
        "a 5-degree-of-freedom granite bench",
        "based on high-resolution levellers and air-bearing solutions",
        "support the vacuum chamber",
        "on which the internal mechanics is stiffly mounted. The specifica-tions",
        "design and partial results are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weoama04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weoama04.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weoama04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEOAMA04",
      "page_number": "173",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAMA05",
      "title": "FE Model of a Nanopositioning Flexure Stage for Diagnosis of Trajectory Errors",
      "authors": [
        "S.P. Kearney",
        "D. Shu",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The Advanced Photon Source Upgrade project includes upgrading several beamlines",
        "which desire nanopositioning and fly-scan capabilities. A step towards achieving this is through the use of flexure stages with minimal trajectory errors. Typically",
        "parasitic motion is on the order of micrometer-level displacements and tens of microradian-level rotations [1]. The cause of such errors is difficult to diagnosis due to the scale and complexity of the overall mechanism. Therefore",
        "an FE model of a flexure pivot nanopositioning stage with centimeter-level travel range [1",
        "2] has been developed to aid in trajectory error diagnosis. Previous work used an FE model and relative error analysis to quantify the effects of assembly error on trajectory errors [3]. Relative error analysis was used due to the difficulty in validating a complex FE model. This study develops an experimentally validated FE model of a single joint to quantify the expected error in the full FE model. The full model is then compared experimentally to the flexure stage to assess the model accuracy and diagnosis trajectory errors.",
        "* D. Shu",
        "et al. In Proc. SPIE",
        "vol. 10371",
        "2017.  ** U.S. Patent granted No. 8",
        "957",
        "567",
        "D. Shu",
        "S. Kearney",
        "and C. Preissner",
        "2015.  *** S. Kearney and D. Shu. In Proc. SPIE",
        "vol. 10371",
        "2017."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weoama05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weoama05.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weoama05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEOAMA05",
      "page_number": "179",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAMA06",
      "title": "Concepts and Instrumentation for Scanning Free X-ray Emission Spectroscopy",
      "authors": [
        "D. Grötzsch",
        "R.G. Gnewkow",
        "B. Kanngießer",
        "W. Malzer",
        "C.S. Schlesiger",
        "Technische Universität Berlin",
        "Berlin",
        "Germany",
        "Helmut Fischer GmbH",
        "Sindelfingen",
        "Germany",
        "S.D. DeBeer",
        "S.P. Peredkov",
        "MPI CEC",
        "Mülheim an der Ruhr",
        "Germany",
        "X-ray Emission spectroscopy is a common tool for the study of the electronic structure of chemical compounds*",
        "** and a widely used technic at synchrotron facilities. There are two different principles. Johansson spectrometers with scanning excitation energy rely on highly precise motorized axes",
        "whereas polychromatic Von Hamos spectrometers don't need the scanning modus. We present different von Hamos Spectrometer concepts and instruments dedicated for synchrotron and laboratory use. The presentation includes everything from the idea",
        "planning",
        "development",
        "design and mounting to the commissioning",
        "alignment and first operation. Furthermore we found a common solution for both different excitations",
        "synchrotron and laboratory sources with respect to reliable energy alignment. The requirements to the mechanics",
        "especially positioning devices which are both commercial and self-developed will also be explained.",
        "*C.J. Pollock",
        "S. DeBeer",
        "Accounts of Chemical Research",
        "48",
        "2967",
        "(2015)  **C.J. Pollock",
        "M.U. Delgado-Jaime",
        "M. Atanasov",
        "F. Neese",
        "S. DeBeer",
        "J. of the American Chemical Society 136",
        "9453 (2014)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weoama06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weoama06.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weoama06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEOAMA06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-10 23:40:47"
}