{
  "session_info": {
    "id": "TUOAB",
    "name": "TUOAB - Contributed Oral Presentations, Accelerator Technology",
    "url": "https://proceedings.jacow.org/PAC2013/html/tuoab.htm"
  },
  "papers": [
    {
      "paper_id": "TUOAB1",
      "title": "Advances in Photocathode Technology at Cornell University",
      "authors": [
        "Cornell University",
        "Ithaca",
        "New York",
        "USA",
        "I.V. Bazarov",
        "L.E. Boulet",
        "M. Brown",
        "L. Cultrera",
        "B.M. Dunham",
        "N. Erickson",
        "G. Gabriel",
        "A. Kim",
        "B. Lillard",
        "T.P. Moore",
        "C. Nguyen",
        "W.J. Schaff",
        "K.W. Smolenski",
        "H. Wang",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Beam brightness from modern day photoinjectors is limited by the photocathode. A multifaceted photocathode development program has been undertaken at Cornell University with a goal to develop the ultimate photocathode which has high quantum efficiency",
        "low mean transverse energy",
        "quick response time and a long lifetime. Positive affinity cathodes like CsK2Sb and NaK2Sbhave been grown using different kinds of alkali metal sources (alkali-azide and pure metal)",
        "characterized and tested in the Cornell-ERL photoinjector. Novel layered structures of various III-V semiconductors like GaAs and AlGaAs grown using Molecular Beam Epitaxy and activated to negative electron affinity using Cs and NF3 are also being investigated. Surface and photoemission diagnostics like Auger spectroscopy",
        "LEED",
        "RHEED and the 2D-electron energy analyzers have been connected in vacuum to the photocathode growth and preparation chambers to fully characterize the surface and emission properties of the materials grown. A Monte Carlo based simulation has also been developed to predict photoemission from layered semiconductor structures and help design novel structures to optimize the photoemission properties."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/tuoab1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/tuoab1.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/tuoab1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-TUOAB1",
      "page_number": "391",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOAB2",
      "title": "Continued Development and Testing of Carbon Nanotube Cathodes at Radiabeam",
      "authors": [
        "J.J. Hartzell",
        "R.B. Agustsson",
        "S. Boucher",
        "L. Faillace",
        "A.Y. Murokh",
        "A.V. Smirnov",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "W.A. Hubbard",
        "C. Regan",
        "UCLA",
        "Los Angeles",
        "USA",
        "RadiaBeam Technologies is developing carbon nanotube (CNT) based field emission cathodes for DC-pulsed and radio-frequency electron sources. CNT cathodes offer simple operation",
        "have demonstrated high current densities",
        "and can maintain low thermal emittance due to their ability to emit at room temperature. The experimental results of high-voltage and lifetime testing of CNT cathodes are presented. There is also a brief summary of a planned experiment in a dual-frequency RF gun. Additionally",
        "some of the challenges posed by the fabrication and handling of the CNT cathodes are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/tuoab2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/tuoab2.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/tuoab2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-TUOAB2",
      "page_number": "394",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 01:35:37"
}