{
  "session_info": {
    "id": "MOA1",
    "name": "MOA1 - Muon I",
    "url": "https://proceedings.jacow.org/cool2017/html/moa1.htm"
  },
  "papers": [
    {
      "paper_id": "MOA12",
      "title": "The Muon Ionization Cooling Experiment",
      "authors": [
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "The Muon Ionization Cooling Experiment (MICE) is designed to demonstrate a measurable reduction in muon beam emittance due to ionization cooling. This demonstration will be an important step in establishing the feasibility of muon accelerators for particle physics. The emittance of a variety of muon beams is measured before and after a \"cooling cell\"",
        "allowing the change in the phase-space distribution due to the presence of an absorber to be measured. Two solenoid spectrometers are instrumented with high-precision scintillating-fibre tracking detectors (Trackers) before and after the cooling cell which measure the normalized emittance reduction. Data has been taken since the end of 2015 to study several beams of varying momentum and input emittance as well as three absorber materials in the cooling cell",
        "over a range of optics. The experiment and an overview of the analyses are described here."
      ],
      "institutions": [],
      "abstract": "Slides MOA12 [23.988 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2017/talks/moa12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2017/papers/moa12.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2017/posters/moa12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2017-MOA12",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOA13",
      "title": "Measurement of Phase Space Density Evolution in MICE",
      "authors": [
        "DPNC",
        "Genève",
        "Switzerland",
        "Belgrade Institute of Physics",
        "Belgrade",
        "Serbia",
        "The Muon Ionization Cooling Experiment (MICE) collaboration will demonstrate the feasibility of ionization cooling",
        "the technique proposed for a future muon storage ring or collider. The muon beam parameters are measured particle-by-particle",
        "before and after a cooling cell",
        "using high precision scintillating-fibre trackers in a solenoidal field. The position and momentum reconstruction of individual muons in MICE allows for the development of several alternative figures of merit in addition to beam emittance. Contraction of the phase-space volume occupied by the sample",
        "or equivalently the increase in phase-space density at its core",
        "is an unequivocal cooling signature. Single-particle amplitude",
        "defined as a weighted distance to the sample centroid",
        "can be used to probe the change in the density in the core of the beam. Alternatively",
        "non-parametric statistics provides reliable methods to estimate the entire phase-space density distribution and reconstruct probability contours. The aforementioned techniques are robust to transmission losses and sample non-linearities",
        "making them ideal candidates to perform a cooling measurement in MICE. Preliminary results are presented here."
      ],
      "institutions": [],
      "abstract": "D. M. Maleticpresenter Submitted by the MICE speakers bureau. If accepted, a member of the collaboration will be selected to present the contribution Slides MOA13 [1.926 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2017/talks/moa13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2017/papers/moa13.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2017/posters/moa13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2017-MOA13",
      "page_number": "6",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 17:19:35"
}