{
  "session_info": {
    "id": "WECD",
    "name": "WECD - Contributed Talk in Wednesday-D",
    "url": "https://proceedings.jacow.org/IBIC2012/html/wecd.htm"
  },
  "papers": [
    {
      "paper_id": "WECD01",
      "title": "Operation of a Single Pass, Bunch-by-bunch x-ray Beam Size Monitor for the CESR Test Accelerator Research Program",
      "authors": [
        "N.T. Rider",
        "M.G. Billing",
        "M. P. Ehrlichman",
        "M.A. Palmer",
        "D.P. Peterson",
        "D. L. Rubin",
        "J.P. Shanks",
        "K.G. Sonnad",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "KEK",
        "Ibaraki",
        "Japan",
        "The CESR Test Accelerator (CesrTA) program targets the study of beam physics issues relevant to linear collider damping rings and other low emittance storage rings. This endeavor requires new instrumentation to study the beam dynamics along trains of ultra low emittance bunches. A key element of the program has been the design",
        "commissioning and operation of an x-ray beam size monitor capable",
        "on a turn by turn basis",
        "of collecting single pass measurements of each individual bunch in a train over many thousands of turns. This new instrument utilizes custom",
        "high bandwidth amplifiers and digitization hardware and firmware to collect signals from a linear InGaAs diode array. The instrument has been optimized to allow measurements with 3x109 to 1x1011 particles per bunch. This paper reports on the operational capabilities of this instrument",
        "improvements for its performance",
        "and the methods utilized in data analysis. Examples of key measurements which illustrate the instrument's performance are presented. This device demonstrates measurement capabilities applicable to future high energy physics accelerators and light sources."
      ],
      "institutions": [
        "Funding: This work is supported by the US National Science Foundation PHY-0734867, PHY-1002467, and the US Department of Energy DE-FC02-08ER41538, DE-SC0006505."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/wecd01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/wecd01.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/wecd01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-WECD01",
      "page_number": "585",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:03:55"
}