{
  "session_info": {
    "id": "WEPP",
    "name": "WEPP - Wednesday Poster Session",
    "url": "https://proceedings.jacow.org/ECRIS2012/html/wepp.htm"
  },
  "papers": [
    {
      "paper_id": "WEPP02",
      "title": "Relationship of Performance and RF Resonance Modes",
      "authors": [
        "T. Hattori",
        "A. Kitagawa",
        "M. Muramatsu",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "RLNR",
        "Tokyo",
        "Japan",
        "The performance of Electron Cyclotron Resonance (ECR) ion source depends on the operation frequency",
        "the magnetic mirror field",
        "the maltipole field",
        "the mirror ratio",
        "the ECR zone and others. We studied the relationship of performance and operation frequency in ECR ion source (HiECR-3). The performance (beam intensity of Ar9+ ion) was measured according to change of frequency from 9.7 to 11.7 GHz in fixed magnetic field of HiECR ion source. We measured resonant frequencies of plasma chamber of HiECR ion source in condition of no plasma (current of mirror coils is zero). The data of intensity of Ar9+ related to measured resonant frequencies. Their resonant modes were checked with a 3D electromagnetic simulator (High Frequency Structure Simulator). As a result",
        "it became clear that the performance of the ion source depends on electric-field distribution of the RF resonant mode."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP02",
      "page_number": "121",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP03",
      "title": "Plasma Instability in the Afterglow of ECR Discharge Sustained in a Mirror Trap",
      "authors": [
        "I. Izotov",
        "A. Mansfeld",
        "V. Skalyga",
        "V. Zorin",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "T. Grahn",
        "T. Kalvas",
        "H. A. Koivisto",
        "J.P.O. Komppula",
        "P. Peura",
        "O.A. Tarvainen",
        "V. Toivanen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "A number of studies have been devoted to the investigations of plasma decay in ECR heated discharges confined in a mirror magnetic trap. The motivation of this work is to study plasma instabilities causing perturbations of ion current during the plasma decay. Present work is devoted to time-resolved diagnostics of non-linear effects observed during the afterglow plasma decay of an 14 GHz Electron Cyclotron Resonance Ion Source (ECRIS) at JYFL operated in pulsed mode. Plasma instabilities causing perturbations of extracted ion current during the decay were observed and studied. It is shown that these perturbations are associated with precipitation of high energy electrons along the magnetic field lines and strong bursts of bremsstrahlung emission. The effect of ion source settings on the onset of the observed instabilities was investigated. Based on the experimental data and estimated plasma properties it is assumed that the instabilities are of cyclotron type. The conclusion is supported by a comparison to other type of plasma devices (SMIS 37",
        "IAP RAS) exhibiting similar characteristics but operating in a different plasma confinement regime."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP03",
      "page_number": "125",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP08",
      "title": "Emittance Measurements for U Ion Beams Produced from RIKEN 28 GHz SC-ECRIS",
      "authors": [
        "K. Ozeki",
        "Y. Higurashi",
        "T. Nakagawa",
        "J. Ohnishi",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "In order to investigate the ion optical parameters of the beam line of RIKEN 28 GHz SC-ECR ion source into the new heavy ion linac (RILAC II)",
        "we measured the emittance of the heavy ion beams form RIKEN 28 GHz SC-ECR ion source. In the test experiments",
        "we observed that the emittance of the U35+ beam was ~100 π·mm·mrad (4 rms emittance)",
        "which is smaller than the acceptance of the accelerator (~160 π·mm·mrad). The emittance with 28 GHz was almost same as that with 18 GHz and independent on the injected RF power (1~2 kW). The size of emittance increased with decreasing the charge state. We also measured the emittance of U and oxygen ions under the same condition. In this experiment we observed that the emittance of oxygen ions was always larger than the U ion beam for same M/q. In this contribution",
        "we report the experimental results for emittance measurement of highly charged U",
        "Xe and O ions from RIKEN 28 GHz SC-ECR ion source in detail."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp08.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP08",
      "page_number": "130",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP13",
      "title": "Development Update of the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp13.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP13",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP14",
      "title": "An Advanced Injection System of Light Ions (AISLI) for Dielectric Wall Accelerator",
      "authors": [
        "S.X. Peng",
        "J. Chen",
        "J.E. Chen",
        "Z.Y. Guo",
        "P.N. Lu",
        "H.T. Ren",
        "Y. Xu",
        "J. Zhao",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "The dielectric wall accelerator (DWA) is a kind of acceleration system that has the ability to accelerate any charge to mass ratio particle with high electric field gradients up to 400 MV/m and very compact dimension",
        "for example d 30 mm x 50 mm. To demonstrate the high gradient tiny acceleration system",
        "a comparable 50 mA/40 keV pulsed H+ converge beam injector is required. Based on the experimental results obtained on the test bench",
        "a six electrodes injector was developed at Peking University (PKU). In this paper we will describe the preliminary experimental results as well as the details of the new compact injector which named as An Advanced Injector System of Light Ions (AISLI)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp14.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP14",
      "page_number": "136",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP15",
      "title": "Metal Ion Beam Production with Improved Evaporation Ovens",
      "authors": [
        "K. Tinschert",
        "R. Lang",
        "J. Mäder",
        "F. Maimone",
        "J. Roßbach",
        "GSI",
        "Darmstadt",
        "Germany",
        "Most of the ion beams delivered by the ECR ion sources at the GSI accelerator facilities are produced from materials in the solid state",
        "which must be transformed into the gaseous state to feed the plasma. The well established method of thermal evaporation has been used by means of two types of resistively heated ovens for metals and solid compounds. The main goal of development is to improve their versatility in terms of lifetime",
        "durability",
        "efficiency",
        "and extended temperature range. Recent investigations and developments include the use of alternative materials for oven components. The main focus has been on the further development of the high temperature oven. A modular construction with improved mechanical dimensional accuracy for more precise and easier mounting has been established. Its optimization for stable long time operation has been continued leading to a lifetime of 6 days for evaporation of Ti at 1750°C. Furthermore the temperature limit could be extended to 2300°C. In addition to the improvements in evaporation technology the technique of microwave frequency tuning could be successfully applied for metal ion operation leading to enhanced ion beam intensities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp15.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP15",
      "page_number": "140",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP16",
      "title": "Experimental Studies on the ALISES Ion Source at CEA Saclay",
      "authors": [
        "O. Tuske",
        "O. Delferrière",
        "Y. Gauthier",
        "R. Gobin",
        "F. Harrault",
        "J.L. Jannin",
        "CEA/DSM/IRFU",
        "France",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "The ALISES ion source was originally designed to reduce beam emittance at RFQ entrance by shortened the length of the LEBT. A wide opened magnetic coil at ground potential produces the fringe field needed for the ECR heating at 2.45 GHz frequency. The first part describes the commissioning of the source: Penning discharges inside the accelerating column make the high voltage power supply collapse. Experimental tests with kapton films while discharges occur",
        "and simulations with OPERA-3D code have shown great similarities to detect the location of those discharges and allow us to make the ion source work. The second part of this paper will present the result of low intensity light ion beam production versus the plasma chamber length and radius. Those very preliminary tests give us indications to reduce the ion source dimensions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp16.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP16",
      "page_number": "143",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP17",
      "title": "A Multi-Sample Changer Coupled to an ECR Source for AMS Experiments",
      "authors": [
        "R.C. Vondrasek",
        "T. Palchan",
        "R.C. Pardo",
        "C.E. Peters",
        "M.A. Power",
        "R.H. Scott",
        "ANL",
        "Argonne",
        "USA"
      ],
      "institutions": [
        "A project using Accelerator Mass Spectrometry (AMS) at the ATLAS facility to measure neutron capture rates on a wide range of actinides in a reactor environment is underway. This project will require the measurement of a large number of samples previously irradiated in the Advanced Test Reactor at Idaho National Laboratory. The AMS technique at ATLAS is based on production of highly-charged positive ions in an electron cyclotron resonance ion source (ECRIS) followed by acceleration in the ATLAS linac. The sample material is introduced into the plasma via laser ablation. This should limit the dependency of material feed rates upon the source material composition as well as minimize cross-talk between samples. A new multi-sample changer has been constructed allowing rapid changes between samples. The sample changer has 20 positions and is capable of moving from one sample to the next in one minute. Details of the sample changer design and operation will be presented."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/wepp17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/wepp17.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/wepp17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-WEPP17",
      "page_number": "146",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 8,
  "scrape_time": "2025-10-10 17:29:35"
}