{
  "session_info": {
    "id": "MOIYGD",
    "name": "MOIYGD - Invited Orals: Novel Particle Sources and Acceleration Techniques",
    "url": "https://proceedings.jacow.org/ipac2022/html/moiygd.htm"
  },
  "papers": [
    {
      "paper_id": "MOIYGD1",
      "title": "Progress in Developing an Accelerator on a Chip",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Stanford University",
        "Stanford",
        "California",
        "USA",
        "University of Erlangen-Nuremberg",
        "Erlangen",
        "Germany",
        "Acceleration of particles in photonic structures fabricated using semiconductor manufacturing techniques and driven by ultrafast solid state lasers is a new and promising approach to developing future generations of compact particle accelerators. Substantial progress has been made in this area in recent years",
        "fueled by a growing international collaboration of universities",
        "national laboratories",
        "and companies. Performance of these micro-accelerator devices is ultimately limited by laser-induced material breakdown limits",
        "which can be substantially higher for optically driven dielectrics than for radio-frequency metallic cavities traditionally used in modern particle accelerators",
        "allowing for 1 to 2 order of magnitude increase in achievable accelerating fields. The lasers required for this approach are commercially available with moderate (microJoule class) pulse energies and repetition rates in the MHz regime. We summarize progress to date and outline potential near-term applications and offshoot technologies."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/moiygd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/moiygd1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/moiygd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-MOIYGD1",
      "page_number": "16",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOIYGD2",
      "title": "Recent Progress of Compact LAser Plasma Accelerator at Peking University",
      "authors": [
        "PKU",
        "Beijing",
        "People’s Republic of China",
        "Usually large energy spread and shot-to-shot stability are the bottlenecks of laser accelerator in applications. Recently proton beam with energies less than 10 MeV",
        "<1% energy spread",
        "several to tens of pC charge can be stably produced and transported in Compact LAser Plasma Accelerator (CLAPA) at Peking University. The CLAPA beam line is an object-image point analysing system",
        "which ensures the transmission efficiency and energy selection accuracy for proton beams with initial large divergence angle and energy spread. A spread-out Bragg peak (SOBP) is produced with high precision beam control",
        "which is essential for cancer therapy. Other primary application experiments based on laser-accelerated proton beam have also been carried out",
        "such as FLASH irradiation",
        "Laser Ion trace probe",
        "proton radiograph",
        "stress testing for tungsten",
        "irradiation of semiconductor sensor to simulate the space irradiation environment and so on."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/moiygd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/moiygd2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/moiygd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-MOIYGD2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 18:33:46"
}