{
  "session_info": {
    "id": "MOZD",
    "name": "MOZD - Photon Sources and Electron Accelerators",
    "url": "https://proceedings.jacow.org/napac2022/html/mozd.htm"
  },
  "papers": [
    {
      "paper_id": "MOZD1",
      "title": "Commissioning of LCLS-II",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "The LCLS-II is a CW FEL based on a 4 GeV SRF linac. Commissioning of the CW Electron Gun and SRF linac was begun during the winter of 2022 with expectations of 1st light during Summer 2022. Results will be presented.",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mozd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mozd1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mozd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOZD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOZD2",
      "title": "Preliminary Study of a High Gain THz FEL in a Recirculating Cavity",
      "authors": [
        "A.C. Fisher",
        "P. Musumeci",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "The THz gap is a region of the electromagnetic spectrum where high average and peak power radiation sources are scarce while at the same time scientific and industrial applications are growing in demand. Free-electron laser coupling in a magnetic undulator is one of the best options for radiation generation in this frequency range",
        "but slippage effects require the use of relatively long and low current electron bunches to drive the THz FEL",
        "limiting amplification gain and output peak power. Here we use a circular waveguide in a 0.96 m strongly tapered helical undulator to match the radiation and e-beam velocities",
        "allowing resonant energy extraction from an ultrashort 200 pC 5.5 MeV electron beam over an extended distance. E-beam energy measurements",
        "supported by energy and spectral measurement of the THz FEL radiation",
        "indicate an average energy efficiency of ~ 10%",
        "with some particles losing > 20% of their initial kinetic energy."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mozd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mozd2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mozd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOZD2",
      "page_number": "30",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOZD3",
      "title": "Development of Two-Color Sub-Femtosecond Pump/Probe Techniques with X-Ray Free-Electron Lasers",
      "authors": [
        "Z.H. Guo",
        "P.L. Franz",
        "Stanford University",
        "Stanford",
        "California",
        "USA",
        "D.B. Cesar",
        "J.P. Cryan",
        "T.D.C. Driver",
        "J.P. Duris",
        "Z. Huang",
        "K. Larsen",
        "S. Li",
        "A. Marinelli",
        "J.T. O’Neal",
        "R. Robles",
        "N.S. Sudar",
        "A.L. Wang",
        "Z. Zhang",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "We report the generation of GW-level attosecond pump/probe pulse pairs with tunable sub-femtosecond delays at the Linac Coherent Light Source (LCLS). The attosecond 370 eV pump pulse is first generated via the Enhanced Self-Amplified Spontaneous Emission (ESASE) method",
        "then the attosecond 740 eV probe pulse is produced by re-amplifying the electron beam microbunching after the magnetic chicane. Due to the harmonic amplification",
        "the minimal delay between pump-probe pulse pairs (limited by slippage between the light field and the electron bunch) can be shorter than 1 femtosecond. We use the angular streaking technique to measure temporal delays between pump/probe pulse pairs at multiple beamline configurations. When the delay chicane is turned off",
        "the averaged delay is increased by ~150 attoseconds by adding one undulator module for probe pulses. Long delays can be set up by turning the delay chicane on. These experimental results are in agreement with start-to-end XFEL simulations. Looking toward future experiments",
        "our sub-femtosecond pump/probe technique can be applied to observe electronic charge dynamics in molecular systems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mozd3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mozd3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mozd3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOZD3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOZD4",
      "title": "Uncertainty Quantification of Beam Parameters in a Linear Induction Accelerator Inferred from Bayesian Analysis of Solenoid Scans",
      "authors": [
        "M.A. Jaworski",
        "D.C. Moir",
        "S. Szustkowski",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "[1] P.W. Allison",
        "\"Beam dynamics equations for xtr",
        "\" Los Alamos Technical Report LA-UR-01-6585. November 2001."
      ],
      "institutions": [
        "Linear induction accelerators (LIAs) such as the DARHT at Los Alamos National Laboratory make use of the beam envelope equation to simulate the beam and design experiments. Accepted practice is to infer beam parameters using the solenoid scan technique with optical transition radiation (OTR) beam profiles. These scans are then analyzed with an envelope equation solver to find a solution consistent with the data and machine parameters (beam energy, current, magnetic field, and geometry). The most common code for this purpose with flash-radiography LIAs is xtr [1]. The code assumes the machine parameters are perfectly known and that beam profiles will follow a normal distribution about the best fit and solves by minimizing a chi-square-like metric. We construct a Bayesian model of the beam parameters allowing maching parameters, such as solenoid position, to vary within reasonable uncertainty bounds. Posterior distribution functions are constructed using Markov-Chain Monte Carlo (MCMC) methods to evaluate the accuracy of the xtr solution uncertainties and the impact of finite precision in measurements."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mozd4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mozd4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mozd4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOZD4",
      "page_number": "34",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOZD5",
      "title": "ERL-Based Compact X-Ray FEL",
      "authors": [
        "F. Lin",
        "V.S. Morozov",
        "ORNL RAD",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "J. Guo",
        "Y. Zhang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "We propose to develop an energy-recovery-linac (ERL)-based X-ray free-electron laser (XFEL). Taking advantage of the demonstrated high-efficiency energy recovery of the beam power in the ERL",
        "the proposed concept offers the following benefits: i) recirculating the electron beam through high-gradient superconducting RF (SRF) cavities shortens the linac",
        "ii) energy recovery in the SRF linac saves the klystron power and reduces the beam dump power",
        "iii) the high average beam power produces a high average photon brightness. In addition",
        "such a concept has the capability of delivering optimized high-brightness CW X-ray FEL performance at different energies with simultaneous multipole sources. In this paper",
        "we will present the preliminary results on the study of feasibility",
        "optics design and parameter optimization of such a device."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mozd5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mozd5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mozd5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOZD5",
      "page_number": "37",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOZD6",
      "title": "Accelerator Physics Lessons from CBETA, the First Multi-Turn SRF ERL",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The Cornell-BNL ERL Test Accelerator (CBETA) has been designed",
        "constructed",
        "and commissioned in a collaboration between Cornell and BNL. It focuses on energy-saving measures in accelerators",
        "including permanent magnets",
        "energy recovery",
        "and superconductors; it has thus been referred to as a green accelerator. CBETA has become the world’s first Energy Recovery Linac (ERL) that accelerates through multiple turns and then recovers the energy in SRF cavities though multiple decelerating turns. The energy is then available to accelerate more beam. It has also become the first accelerator that operates 7 beams in the same large-energy aperture Fixed Field Alternating-gradient (FFA) lattice. The FFA is constructed of permanent combined function magnets and transports energies of 42",
        "78",
        "114",
        "and 150 MeV simultaneously. Accelerator physics lessons from the commissioning period will be described and applications of such an accelerator from hadron cooling to EUV lithography and from nuclear physics to a compact Compton source will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/mozd6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/mozd6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/mozd6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOZD6",
      "page_number": "41",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:09:52"
}