{
  "session_info": {
    "id": "MOPF",
    "name": "MOPF - Monday posters in foyer",
    "url": "https://proceedings.jacow.org/IBIC2014/html/mopf.htm"
  },
  "papers": [
    {
      "paper_id": "MOPF02",
      "title": "RHIC-Style IPMs in the Brookhaven AGS",
      "authors": [
        "R. Connolly",
        "W.C. Dawson",
        "J.M. Fite",
        "H. Huang",
        "S.E. Jao",
        "W. Meng",
        "R.J. Michnoff",
        "S. Tepikian",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [
        "Beam profiles in the two storage rings of the Relativistic Heavy-Ion Collider (RHIC) at Brookhaven National Lab (BNL) are measured with ionization profile monitors (IPMs). An IPM measures the distribution of electrons produced by beam ionization of background gas. These detectors have been developed at BNL in a program that began in 1996. The current detectors are a design from 2009. During the 2012 shutdown we refurbished the 2009 prototype detector and installed it in the Alternating-Gradient Synchrotron (AGS) for horizontal profiles. The commissioning tests were successful and in 2013 we built a new IPM for vertical profiles. In addition we placed coils on the backlegs of the permanent-magnet dipoles for beta-function measurements. This paper describes the AGS IPMs and shows data from the detector commissioning."
      ],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf02.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF02",
      "page_number": "39",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF03",
      "title": "NSLSII Photon Beam Position Monitor ElectronicsTesting and Results",
      "authors": [
        "A.J. Della Penna",
        "M.A. Maggipinto",
        "J. Mead",
        "O. Singh",
        "K. Vetter",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "Simulated and real beam data has been taken using the new NSLSII Photon BPM electronics. The electrometer design can measure currents as low as 10’s of nanoamps and has an ability to measure a current as high as 300mA. The 4 channel design allows for internal calibration and has both a Negative and Positive bias ability. Preliminary bench testing results has shown excellent resolution. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf03.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF03",
      "page_number": "42",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF04",
      "title": "RHIC Injection Transport Beam Emittance Measurements",
      "authors": [
        "Duke University",
        "Durham",
        "North Carolina",
        "USA",
        "D.M. Gassner",
        "M.G. Minty",
        "S. Tepikian",
        "P. Thieberger",
        "N. Tsoupas",
        "C.M. Zimmer",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The Alternating Gradient Synchrotron (AGS)-to-Relativistic Heavy Ion Collider (RHIC) transfer line",
        "abbreviated AtR",
        "is an integral component for the transfer of proton and heavy ion bunches from the AGS to RHIC. In this study",
        "using 23.8 GeV proton beams",
        "we focused on factors that may affect the accuracy of emittance measurements that provide information on the quality of the beam injected into RHIC. The method of emittance measurement uses fluorescent screens in the AtR. The factors that may affect the measurement are: background noise",
        "calibration",
        "resolution",
        "and dispersive corrections. Ideal video Offset (black level",
        "brightness) and Gain (contrast) settings were determined for consistent initial conditions in the Flag Profile Monitor (FPM) application. Using this information",
        "we also updated spatial calibrations for the FPM using corresponding fiducial markings and sketches. Resolution error was determined using the Modulation Transfer Function amplitude. To measure the contribution of the beam’s dispersion",
        "we conducted a scan of beam position and size at relevant Beam Position Monitors (BPMs) and Video Profile Monitors (VPMs",
        "or “flags”) by varying the extraction energy with a scan of the RF frequency in the AGS. The combined effects of these factors resulted in slight variations in emittance values",
        "with further analysis suggesting potential discrepancies in the current model of the beam line’s focusing properties. In the process of testing various contributing factors",
        "a system of checks has been established for future studies",
        "providing an efficient",
        "standardized",
        "and reproducible procedure that might encourage greater reliance on the transfer line’s emittance and beam parameter measurements.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf04.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF04",
      "page_number": "45",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF05",
      "title": "Instrumentation for the Proposed Low Energy RHIC Electron Cooling Project with Energy Recovery",
      "authors": [
        "D.M. Gassner",
        "A.V. Fedotov",
        "R.L. Hulsart",
        "D. Kayran",
        "V. Litvinenko",
        "R.J. Michnoff",
        "T.A. Miller",
        "M.G. Minty",
        "I. Pinayev",
        "M. Wilinski",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "There is a strong interest in running RHIC at low ion beam energies of 7.7-20 GeV/nucleon [1]; this is much lower than the typical operations with 100 GeV/nucleon. The primary motivation for this effort is to explore the existence and location of the critical point on the QCD phase diagram. Electron cooling can increase the average integrated luminosity and increase the length of the stored lifetime. A cooling system is being designed that will provide a 30 – 50 mA electron beam with adequate quality and an energy range of 1.6 – 5 MeV. The cooling facility is planned to be inside the RHIC tunnel. The injector will include a 704 MHz SRF gun",
        "a 704 MHz 5-cell SRF cavity followed by a normal conducting 2.1 GHz cavity. Electrons from the injector will be transported to the Yellow RHIC ring to allow electron-ion co-propagation for ~20 m",
        "then a 180 degree U-turn electron transport so the same electron beam can similarly cool the Blue ion beam. After the cooling process with electron beam energies of 1.6 to 2 MeV",
        "the electrons will be transported directly to a dump. When cooling with higher energy electrons between 2 and 5 MeV",
        "after the cooling process",
        "they will be routed through the acceleration cavity again to allow energy recovery and less power deposited in the dump. Special consideration is given to ensure overlap of electron and ion beams in the cooling section and achieving the requirements needed for cooling. The instrumentation systems described will include current transformers",
        "beam position monitors",
        "profile monitors",
        "an emittance slit station",
        "recombination and beam loss monitors.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf05.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF05",
      "page_number": "49",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF07",
      "title": "Construction and Operational Performance of a Horizontally Adjustable Beam Profile Monitor at NSLS-II",
      "authors": [
        "B.N. Kosciuk",
        "A. Blednykh",
        "S. Seletskiy",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The NSLS-II Synchrotron Light Source is a 3 GeV electron storage ring currently in the early stages of commissioning at Brookhaven National Laboratory. In order to observe the electron beam cross section in the injection region",
        "a specially designed",
        "horizontally adjustable beam profile monitor was installed at the downstream end of the injection septum. It allows the profiles of the injected",
        "bumped and single turn beam to be viewed and measured. In this presentation",
        "we discuss the final design",
        "construction challenges",
        "and operational performance of this novel device."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf07.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF07",
      "page_number": "55",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPF08",
      "title": "Beam Profile Measurements in the RHIC Electron Lens using a Pinhole Detector and YAG Screen",
      "authors": [
        "T.A. Miller",
        "M.R. Costanzo",
        "W. Fischer",
        "B. Frak",
        "D.M. Gassner",
        "X. Gu",
        "A.I. Pikin",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The electron lenses installed in RHIC are equipped with two independent transverse beam profiling systems",
        "namely the Pinhole Detector and YAG screen. A small Faraday cup",
        "with a 0.2mm pinhole mask",
        "intercepts the electron beam while a pre-programmed routine automatically raster scans the beam across the detector face. The collected charge is integrated",
        "digitized and stored in an image type data file that represents the electron beam density. This plungeable detector shares space in the vacuum chamber with a plunging YAG:Ce crystal coated with aluminum. A view port at the downstream extremity of the Collector allows a GigE camera",
        "fitted with a zoom lens",
        "to image the crystal and digitize the profile of a beam pulse. Custom beam profiling software has been written to import both beam image files (pinhole and YAG) and fully characterize the transverse beam profile. The results of these profile measurements are presented here along with a description of the system and operational features.",
        "* W. Fischer",
        "et al",
        "\"… head-on beam-beam compensation in RHIC\"",
        "ICFA (BB3013)",
        "CERN (2013). **T. Miller",
        "et al",
        "“… eLens  pin-hole detector and YAG…“",
        "BIW2012",
        "Newport News",
        "VA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf08.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF08",
      "page_number": "59",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPF09",
      "title": "Absolute Beam Emittance Measurements at RHIC Using Ionization Profile Monitors",
      "authors": [
        "M.G. Minty",
        "R. Connolly",
        "C. Liu",
        "T. Summers",
        "S. Tepikian",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "In this report we present studies of and measurements from the RHIC ionization profile monitors (IPMs). Improved accuracy in the emittance measurements has been achieved by (1) continual design enhancements over the years",
        "(2) application of channel-by-channel offset corrections and gain calibrations in the beam profile measurements and (3) use of measured beta functions at the locations of the IPMs. The removal of systematic errors in the emittance measurements was confirmed by the convergence of all four planes of measurement (horizontal and vertical planes of both the Blue and Yellow beams) to a common value during beam operations with stochastic cooling. Consistency with independent measurements (luminosity-based using zero degree counters) at the colliding beam experiments STAR and PHENIX was demonstrated."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf09.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF09",
      "page_number": "64",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPF10",
      "title": "A Compact In-Air X-Ray Detector for Vertical Beam Size Measurement at ALBA",
      "authors": [
        "A.A. Nosych",
        "U. Iriso",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "An in-air x-ray detector (IXD) was developed for ALBA to study the residual x-rays after traversing the 35mm copper crotch absorbers. The device prototype is placed in-air after such absorber",
        "mounted flush with the vacuum pipe. The remaining x-rays (above 120 keV) generate a visible footprint if they impinge upon a sensitive enough scintillator. We are using a Cerium doped PreLude 420 (LuYSiO:Ce) screen",
        "and the image is observed with a simple optics system mounted on a commercial CCD camera. This measurement allows evaluating the vertical electron beam size with exposure times in the order of seconds. Similar instruments are used at ESRF and ANKA storage rings. This paper presents the results of the first measurements with IXD and describes its potential to be used as a full diagnostics tool for the 3 GeV storage ring of ALBA.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf10.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF10",
      "page_number": "69",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF13",
      "title": "Wire Scanner Installation into the MicroTCA Environment for the European XFEL",
      "authors": [
        "T. Lensch",
        "A. Delfs",
        "V. Gharibyan",
        "I. Krouptchenkov",
        "D. Nölle",
        "M. Pelzer",
        "H. Tiessen",
        "M. Werner",
        "K. Wittenburg",
        "DESY",
        "Hamburg",
        "Germany",
        "The European XFEL (E-XFEL) is a 4th generation synchrotron radiation source currently under construction in Hamburg. The 17.5 GeV superconducting accelerator will provide photons simultaneously to several user stations [*]. For the transverse beam profile measurement in the high energy sections Wire Scanners are used as an essential part of the accelerator diagnostic system",
        "providing the tool to measure small beam size in an almost nondestructive manner. The scanners will be operated in a fast mode",
        "starting from a trigger the wire will be accelerated to 1 m/s and hitting about 100 bunches out of the long bunch train of E-XFEL within a single macropulse. Slow scans with single bunches are also possible. In the first stage 12 stations are planned to be equipped with Wire Scanners where each station consists of two motion units (horizontal and vertical plane). The new concept uses linear servo motors for the motion of the wires and a new mechanical design has been developed at DESY [**]. This paper describes the electronics developments for the motion part of these Wire Scanners and the integration into the MicroTCA environment.",
        "[*] \"XFEL Technical Design Report\"",
        "DESY 2006-097",
        "http://xfel.desy.de  [**] \"OVERVIEW ON E-XFEL STANDARD ELECTRON BEAM DIAGNOSTICS\"",
        "D.Nölle",
        "BIW 2010",
        "Santa Fe"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf13.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF13",
      "page_number": "73",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPF14",
      "title": "Vertical Beam Size Measurement at CesrTA Using Diffraction Radiation",
      "authors": [
        "L.M. Bobb",
        "T. Aumeyr",
        "P. Karataev",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "T. Aumeyr",
        "P. Karataev",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "M.G. Billing",
        "J.V. Conway",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "E. Bravin",
        "T. Lefèvre",
        "S. Mazzoni",
        "H. Schmickler",
        "CERN",
        "Geneva",
        "Switzerland",
        "Over recent years the first Diffraction Radiation (DR) beam size monitor has been tested on a circular machine. At CesrTA",
        "Cornell University",
        "USA",
        "the sensitivity and limitations of the DR monitor for vertical beam size measurement has been investigated. DR emitted from 1 and 0.5 mm target apertures was observed at 400 and 600 nm wavelengths. In addition",
        "interference between the DR signals emitted by the target and mask has been observed. In this report",
        "we present the recent observations and discuss areas for improvement."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf14.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF14",
      "page_number": "77",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPF15",
      "title": "Status of and Future Plans for the CERN",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf15.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF15",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPF16",
      "title": "CERN-SPS Wire Scanner Impedence and Wire Heating Studies",
      "authors": [
        "E. Piselli",
        "O.E. Berrig",
        "F. Caspers",
        "B. Dehning",
        "J. Emery",
        "M. Hamani",
        "J. Kuczerowski",
        "B. Salvant",
        "R.S. Sautier",
        "R. Veness",
        "C. Vuitton",
        "C. Zannini",
        "CERN",
        "Geneva",
        "Switzerland",
        "This article describes a study performed on one of the SPS vertical rotational wire scanners in order to investigate the breakage of the wire",
        "which occurred on several occasions during the last year of operation. The thermionic emission current of the wire was measured to evaluate temperature changes",
        "and was observed to rise significantly as the wire approached the ultimate LHC beam in the SPS",
        "indicating the possibility of strong coupling between the beam’s electromagnetic field and the wire. Different laboratory measurements",
        "complemented by CST Microwave Studio simulations",
        "have therefore been performed to try and understand the RF modes responsible for this heating. These results are presented here",
        "along with the subsequent modifications adopted on all of the operational SPS wire scanners."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf16.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF16",
      "page_number": "88",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPF17",
      "title": "Methods for Measuring the Transverse Beam Profile in the ESS High Intensity Beam",
      "authors": [
        "C. Roose",
        "I. Dolenc Kittelmann",
        "A. Jansson",
        "ESS",
        "Lund",
        "Sweden",
        "The European Spallation Source (ESS)",
        "currently under construction",
        "consists of a partly superconducting linac which will deliver a 2 GeV",
        "5MW proton beam to a rotating tungsten target. Beam transverse profile monitors are required in order to insure that the lattice parameters are set and the beam emittance is matched. Due to the high intensity of the beam and the constraint to perform non-disturbing measurements",
        "non-invasive techniques have to be developed. The non-invasive profile monitors chosen for the ESS are based on the interaction of the beam with the residual gas. Two different devices are developed",
        "one utilises the fluorescence process",
        "the other one the ionisation process. The paper presents their latest preliminary developments.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf17.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF17",
      "page_number": "93",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF19",
      "title": "Design of a Profile Monitor with 12 Inches of Actuation for FRIB",
      "authors": [
        "S. Rodriguez Esparza",
        "G. Kiupel",
        "I.N. Nesterenko",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Actuated diagnostics present additional challenges that static diagnostics devices do not such as alignment",
        "stability",
        "and incorporating an appropriate drive mechanism. These challenges become even more apparent as the actuaded length increases. At the Facility for Rare Isotope Beams (FRIB) we plan on using a number of actuated diagnostics devices including a Profile Monitor (AKA: Wire Scanner) with 12 inches of actuation. The Profile Monitor uses tungsten wires to traverse the beam pipe aperture to measure the beam intensity with respect to it’s location in the X-Y plane. This paper will detail the design of the 12 inch Profile Monitor and how it is able to overcome the stability",
        "alignment",
        "and drive issues that come with the 12 inches of actuation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf19.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF19",
      "page_number": "97",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPF20",
      "title": "Diagnosing NSLS-II: A New Advanced Synchrotron Light Source",
      "authors": [
        "Y. Hu",
        "L.R. Dalesio",
        "O. Singh",
        "H. Xu",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "NSLS-II",
        "the successor to NSLS (National Synchrotron Light Source) at Brookhaven National Lab",
        "is scheduled to be open to users worldwide by 2015 as a world-class advanced synchrotron light source because of its unique features: its half-mile-circumference (792 m) Storage Ring provides the highest beam intensity (500 mA) at medium-energy (3 GeV) with sub-nm-rad horizontal emittance (down to 0.5 nm -rad) and diffraction-limited vertical emittance at a wavelength of 1 Å (<8 pm-rad). As the eyes of NSLS-II accelerators to observe fascinating particle beams",
        "beam diagnostics and controls systems are designed to monitor and diagnose the electron beam quality so that NSLS-II could be tuned up to reach its highest performance. The design and implementation of NSLS-II diagnostics and controls are described. Preliminary commissioning results of NSLS-II accelerators",
        "including Linac",
        "Booster",
        "and Storage Ring",
        "are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf20.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF20",
      "page_number": "100",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPF22",
      "title": "Simultaneous Operation of Two FEL Undulator Beamlines at FLASH",
      "authors": [
        "S. Ackermann",
        "V. Ayvazyan",
        "B. Faatz",
        "E. Hass",
        "K. Klose",
        "S. Pfeiffer",
        "M. Scholz",
        "S. Schreiber",
        "DESY",
        "Hamburg",
        "Germany",
        "The FLASH FEL User Facility at DESY (Hamburg) is driven by a Photocathode RF gun and superconducting RF structures",
        "producing up to 800 electron bunches per train with a repetition rate of 10 Hz. Because not all user experiments need the full pulse train (8000 FEL pulses per second)",
        "part of the electron bunches can be deflected into a second beamline",
        "which can simultaneously deliver FEL pulses with different parameters to a second user experiment. To realize this possibility",
        "the FLASH facility has been upgraded with a second undulator line and a second experimental Hall. In this contribution",
        "we will present the new layout of the FLASH facility and the first results to operate it with different parameter sets. We will show present results achieved during the commissioning of the new beamline. Finally",
        "we will give an outlook of further commissioning plans and user operation.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "S. Ackermann for the FLASH II Team reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf22.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF22",
      "page_number": "103",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF27",
      "title": "Simulation and First Results of the ELBE SRF Gun II",
      "authors": [
        "P.N. Lu",
        "A. Arnold",
        "U. Lehnert",
        "P. Murcek",
        "J. Teichert",
        "H. Vennekate",
        "R. Xiang",
        "HZDR",
        "Dresden",
        "Germany",
        "In Rossendorf",
        "a 3 and one half cell cavity SRF photo injector has been installed",
        "which promises to accelerate the electron beam to 9 MeV in 0.5 meter. The gun is expected to operate both in the 13 MHz mode with a bunch charge of 77 pC",
        "or in the 500 kHz mode",
        "with a 1 nC charge. The simulation presented in this contribution includes particle tracking in the new cavity itself with the ASTRA code",
        "and in the bunch transport line in the ELBE beam lines with the elegant code. The measured profile and time structure of the UV laser on the cathode are utilized to specify the electron bunch parameters. Then a single bunch of electrons is tracked in the cavity field that was calculated by Superfish",
        "with space charge effects considered. From the exit of the cavity",
        "the electron bunch has a relatively high energy so we ignore the space charge effect there and apply elegant to track the particles through the magnet elements and accelerator modules. The main purpose of this simulation is to find the optimized parameters for different beam transport tasks. As a first experimental result of the photoinjector",
        "energy and phase space measurement will be also presented in the paper. Both the slit mask and the quadrupole scan methods are applied to measure the beam emittance. An obvious progression will be to compare the results from this gun with those from the ELBE SRF gun I.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf27.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF27",
      "page_number": "106",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF28",
      "title": "Beam Diagnostics and Timing Monitoring for SuperKEKB Injector Linac",
      "authors": [
        "F. Miyahara",
        "K. Furukawa",
        "R. Ichimiya",
        "N. Iida",
        "M. Ikeno",
        "H. Kaji",
        "M. Satoh",
        "M. Shoji",
        "T. Suwada",
        "M. Tanaka",
        "Y. Yano",
        "KEK",
        "Ibaraki",
        "Japan",
        "EJIT",
        "Hitachi",
        "Ibaraki",
        "Japan",
        "The SuperKEKB injector linac has multiple operation modes for the electron beam injection into 3 separate rings",
        "SuperKEKB HER",
        "PF (Photon Factory) Ring and PF-AR",
        "and the positron beam injection into the damping ring and the SuperKEKB LER. The operation modes can be switched every 20 milli-second with arbitrary order. The beam parameters such as charge",
        "energy and emittance are different for each of the rings. Moreover",
        "the bunch charge of the electron beam",
        "5nC",
        "is 5 times higher and the emittance of ~10 mm•mrad is 30 times lower than those of the KEKB injector. Thus",
        "development of BPM readout system with a wide dynamic range and installation of optical fiber detector with a good S/N ratio for the wire scanners and bunch-length monitor have been performed. For stable operation of the linac",
        "many timing signals have to be monitored as well. To that end we have developed 32-bit multi-hit time-to-digital converters (TDCs) with 1-ns resolution. The first beam tests of those systems are reported in this paper.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf28.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF28",
      "page_number": "110",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPF30",
      "title": "Diagnostics of the TPS Booster Synchrotron for Beam Commissioning",
      "authors": [
        "K.T. Hsu",
        "J. Chen",
        "Y.-S. Cheng",
        "P.C. Chiu",
        "S.Y. Hsu",
        "K.H. Hu",
        "C.H. Huang",
        "C.H. Kuo",
        "D. Lee",
        "C.Y. Liao",
        "C.Y. Wu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Booster synchrotron for the Taiwan photon source project is in commissioning. Diagnostics which consist of screen monitors",
        "intensity monitors",
        "beam position monitors",
        "tune monitors",
        "visible light synchrotron radiation monitors and radiation-sensing field-effect transistors are integrated with accelerator control system. Integration and functionality check were done recently. Details of these diagnostics and preliminary test results will be summarized in this report."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf30.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF30",
      "page_number": "114",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPF31",
      "title": "Overview of Beam Instrumentation Activities for SwissFEL",
      "authors": [
        "R. Ischebeck",
        "R. Abela",
        "F. Ardana-Lamas",
        "V.R. Arsov",
        "R. Baldinger",
        "H.-H. Braun",
        "M. Calvi",
        "R. Ditter",
        "C. Erny",
        "F. Frei",
        "R. Ganter",
        "I. Gorgisyan",
        "C.P. Hauri",
        "S. Hunziker",
        "P.N. Juranic",
        "B. Keil",
        "W. Koprek",
        "R. Kramert",
        "D. Llorente Sancho",
        "F. Löhl",
        "F. Marcellini",
        "G. Marinkovic",
        "B. Monoszlai",
        "G.L. Orlandi",
        "C. Ozkan",
        "L. Patthey",
        "M. Pedrozzi",
        "P. Pollet",
        "M. Radovic",
        "L. Rivkin",
        "M. Roggli",
        "M. Rohrer",
        "V. Schlott",
        "A.G. Stepanov",
        "J. Stettler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "F. Ardana-Lamas",
        "I. Gorgisyan",
        "C.P. Hauri",
        "L. Rivkin",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "DESY",
        "Hamburg",
        "Germany",
        "SwissFEL will provide users with brilliant X-ray pulses in 2017. A comprehensive suite of diagnostics is needed for the initial commissioning",
        "for changes to the operating point",
        "and for feedbacks. The development of instrumentation for SwissFEL is well underway",
        "and solutions have been identified for most diagnostics systems. I will present here an overview of the instrumentation for SwissFEL",
        "and give details on some recent developments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopf31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopf31.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopf31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPF31",
      "page_number": "119",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 20,
  "scrape_time": "2025-10-10 17:56:02"
}