{
  "session_info": {
    "id": "WEPB",
    "name": "WEPB - Wednesday Poster Session (B)",
    "url": "https://proceedings.jacow.org/HIAT2015/html/wepb.htm"
  },
  "papers": [
    {
      "paper_id": "WEPB01",
      "title": "Status Report on the Operation of the RIBF Ring Cyclotrons",
      "authors": [
        "K. Ozeki",
        "T. Dantsuka",
        "M. Fujimaki",
        "T. Fujinawa",
        "N. Fukunishi",
        "H. Hasebe",
        "Y. Higurashi",
        "E. Ikezawa",
        "H. Imao",
        "T. Kageyama",
        "O. Kamigaito",
        "M. Kase",
        "M. Kidera",
        "M. Komiyama",
        "K. Kumagai",
        "T. Maie",
        "M. Nagase",
        "T. Nagatomo",
        "T. Nakagawa",
        "M. Nakamura",
        "J. Ohnishi",
        "H. Okuno",
        "N. Sakamoto",
        "K. Suda",
        "A. Uchiyama",
        "S. Watanabe",
        "T. Watanabe",
        "Y. Watanabe",
        "K. Yamada",
        "H. Yamasawa",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "S. Fukuzawa",
        "M. Hamanaka",
        "S. Ishikawa",
        "K. Kobayashi",
        "R. Koyama",
        "T. Nakamura",
        "M. Nishida",
        "M. Nishimura",
        "J. Shibata",
        "N. Tsukiori",
        "K. Yadomi",
        "SHI Accelerator Service Ltd.",
        "Tokyo",
        "Japan",
        "CNS",
        "Saitama",
        "Japan",
        "Operational status of four ring cyclotrons (RRC",
        "fRC",
        "IRC",
        "SRC) from August 2014 to July 2015 is reported. We are engaging in the improvements and adjustments for increasing beam intensities year after year",
        "and maintenances for the stabilization of beam supply. In these contributions",
        "we will report the past performances of accelerated beams",
        "statistics of operational and tuning time on corresponding period",
        "as well as failures and copings with them.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb01.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB01",
      "page_number": "191",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB02",
      "title": "Electron-Beam-Driven RI Separator for SCRIT at RIKEN RI Beam Factory",
      "authors": [
        "T. Ohnishi",
        "S. Ichikawa",
        "M. Wakasugi",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "The electron-beam-driven RI separator for SCRIT (ERIS)* was constructed for the SCRIT (Self-Confinement RI Target) electron scattering facility** at RIKEN RI Beam Factory",
        "and it is employed to produce low-energy",
        "high-quality",
        "and high-intensity RI beams used for the electron scattering of unstable nuclei. In ERIS",
        "the photofission of uranium driven by an electron beam is used for RI production",
        "and the estimated production rate of fission products is 2.2*1011 fissions/s with 30-g uranium and a 1-kW electron beam. The RI production in ERIS has been operated since 2013. Uranium carbide is used as the production target",
        "and it is obtained by the carbothermal reduction of uranium oxide in presence of carbon. The obtained disk was approximately 1 mm in a thickness and 18 mm in a diameter. The average mass concentration of uranium in the disk was estimated as 3.4 g/cm3. Recently",
        "we improved the efficiency of release from the production target and that of transport from the target. As a result",
        "the rate of 132Sn was 2.6*105 atoms/s with 15-g uranium and a 10-W electron beam. In this paper",
        "we report improvements and the present status of ERIS.",
        "* T. Ohnishi et. al: Nucl. Instr. Meth. B317",
        "357(2013). ** M. Wakasugi et. al: Nucl. Instr. Meth. B317",
        "668(2013).",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb02.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB02",
      "page_number": "194",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB03",
      "title": "Acceleration Scheme of Radioactive Ion Beam with HIMAC and its Injector Linac",
      "authors": [
        "A. Noda",
        "S. Hojo",
        "K. Katagiri",
        "M. Nakao",
        "E. Noda",
        "K. Noda",
        "A. Sugiura",
        "K. Suzuki",
        "T. Wakui",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "MPI-K",
        "Heidelberg",
        "Germany",
        "For the purpose of simultaneous real-time observation of irradiation effects in the patients body during a heavy ion cancer treatment",
        "the capability of acceleration of radioactive ion beam such as 11C has been investigated where an ISOL based ion source combined with a cyclotron was assumed. According to recent development of a single charged 11C ion source and its charge breeder*",
        "it becomes to be important to estimate the intensities attainable by acceleration of such radioactive beam with the use of HIMAC and its injector quantitatively taking the beam dynamics into account. In the present paper",
        "phase space matching of the secondary produced radioactive 11C ion beam is investigated among the ion source",
        "injector linac and HIMAC synchrotron",
        "referring to the ISOLDE system at CERN.",
        "*: K. Katagiri et al.",
        "Contribution to this Sympojium.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb03.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB03",
      "page_number": "197",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB05",
      "title": "Pushing the Intensity Envelope at the ATLAS Linac",
      "authors": [
        "B. Mustapha",
        "C. Dickerson",
        "M.R. Hendricks",
        "P.N. Ostroumov",
        "R.C. Pardo",
        "R.H. Scott",
        "G.P. Zinkann",
        "ANL",
        "Argonne",
        "USA",
        "The ATLAS linac at Argonne National Laboratory has recently been upgraded for higher beam intensity and transport efficiency. Following the installation of the new RFQ",
        "we have performed a high-intensity run using a 40Ar8+ beam. A beam current of 7 pμA was successfully injected and accelerated in the RFQ and the first superconducting section of the linac to an energy of 1.5 MeV/u. Since then",
        "a new superconducting module was installed in the Booster section of the linac replacing three old cryomodules of split-ring resonators. The split-rings are known to cause excessive beam steering leading to beam loss which limits the maximum current in ATLAS. We are planning a second run to try to push the beam current higher and farther into the linac. The ultimate goal is to accelerate 10 pμA to the Booster exit at 5 MeV/u. Among the limitations encountered in the first run are the large beam emittance at the ECR source and the beam loss in the LEBT. The results of these attempts will be presented and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [
        "Funding: This work was supported by the U.S. Department of Energy under Contract No. DE-AC02-06CH11357. This research used resources of ANL's ATLAS facility, which is a DOE Office of Science User Facility."
      ],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb05.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB05",
      "page_number": "200",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB06",
      "title": "Optimization Design of the RFQ Trapezoidal Electrode",
      "authors": [
        "C.X. Li",
        "Y. He",
        "Z.J. Wang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "In order to reduce the length of a deuteron beam RFQ",
        "trapezoidal modulation is used in the last 3-meter-long section. Because there is no existing tested design procedure fitting for designing this type of unconventional structure",
        "a VBA code used for designing trapezoidal modulation RFQ electrode was developed. VBA is an effective and efficient tool for completing repetitive work. So it can be used to design repetitive analogous cells of electrode of RFQ or DTL or other periodic acceleration structures. By using this VBA code",
        "cell length and the exit energy can be obtained accurately. The feasibility and accuracy of this method have been validated by beam dynamics simulation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb06.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB06",
      "page_number": "203",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPB07",
      "title": "The Quality Assurance and Acceptance System of Niobium Material for RAON Cavities",
      "authors": [
        "M.J. Joung",
        "Y. Jung",
        "H.J. Kim",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "The QAAS (Quality Assurance and Acceptance System) of superconducting material for RAON's cavities has been set up. The subject was selected by how the part is affected by RF (Radio Frequency) in the cavity operation at cryo-temperature. The QAAS consist of property analysis and checking the surface condition. Each step has criteria its own to pass the assurance and acceptance system. The method to analyze the properties and to inspect the niobium surface was described. The certificates were classified by RRR values of Nb pieces due to distribution of RRR value. The Nb properties slightly different by RRR values",
        "so we will set a bunch of niobium pieces for one specific cavity with Nb pieces having similar RRR value.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb07.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB07",
      "page_number": "206",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB08",
      "title": "Study of Electrode Configuration of the Four Beam IH-RFQ Linac",
      "authors": [
        "S. Ikeda",
        "T. Shibuya",
        "TIT",
        "Tokyo",
        "Japan",
        "RLNR",
        "Tokyo",
        "Japan",
        "The multi-beam acceleration method",
        "which is technique for accelerating low energy",
        "high intensity",
        "heavy ion beams by accelerating multiple beams to decreasing the space charge effect",
        "and integrating these beams by a beam funneling system [1]. Working towards the commercialization of this method",
        "at the Tokyo Institute of Technology we have been developing a 4 beam IH-RFQ linac. As part of the design work for the 4 beam IH-RFQ linac",
        "we evaluated the cell parameters of the RFQ electrodes using a RFQ design code and a beam dynamics simulation code. Also",
        "we evaluated the RF properties of several electrode layouts using a three dimensional electromagnetic simulation code. This paper reports on the results.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb08.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB08",
      "page_number": "209",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB10",
      "title": "Linac Options for the Ion Injector of MEIC",
      "authors": [
        "J. Guo",
        "Y. Zhang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "In the current baseline design of the Medium-energy Electron-Ion Collider (MEIC) proposed by Jefferson Lab",
        "a green field ion injector complex is composed of several ion sources",
        "one linac with charge stripper",
        "and one booster ring. The original linac design contains a short warm front end and a long SRF section with QWR/HWR cavities",
        "capable of accelerating H− to 285 MeV or Pb67+ to 100 MeV/u. Such a linac is a major cost driver of the project",
        "despite that the required duty factor of this linac is very low. In this paper",
        "we will compare alternative options for this ion linac",
        "including the possibilities to lower the linac energy and choose a warm linac.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb10.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB10",
      "page_number": "212",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB11",
      "title": "Charge State Selective Ion Beam Acceleration with RFQ Linac",
      "authors": [
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "T. Kanesue",
        "M. Okamura",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "DPIS (Direct Plasma Injection Scheme) is one of the effective methods for high-intensity heavy ion beam acceleration. In DPIS",
        "ions are extracted from laser-produced plasma at the entrance of an RFQ linac. The plasma generated by high power density laser irradiation consists of multiple charge state ions",
        "therefore",
        "the ions with different charge states are simultaneously injected into an RFQ. In an RFQ",
        "ions whose charge state is comparable with that of ions desired for acceleration are captured by RF bucket. To prevent the unneeded ions from being accelerated",
        "we investigated the beam dynamics in an RFQ and performed the particle tracking simulation. The simulation result shows that the discontinuous transition of the synchronous phase inhibits the acceleration of the unneeded ions without significant loss of desired ions. To validate the designed cell parameter via oncoming beam test",
        "we fabricated the new 4-rod RFQ vanes for carbon 5+ acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb11.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB11",
      "page_number": "216",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB13",
      "title": "Thermo-Mechanical Calculations for the SPES RFQ",
      "authors": [
        "L. Ferrari",
        "A. Palmieripresenter",
        "A. Pisent",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "Within the SPES project at INFN-LNL a new injection line will be built at INFN LNL in order to transport and match the RIBs to the existing ALPI superconducting linac. This line includes a new RFQ that will operate in a CW mode (100% duty factor) at the operating frequency of 80MHz. The RFQ is composed of 6 modules about 1.2 m long each. Each module is in turn basically composed of a Stainless Steel Tank (AISI LN 304) and four OFE Copper Electrodes. A copper layer will be electrodeposited on the tank inner surface and a spring joint between tank and electrode is used in order to seal the RF. Moreover",
        "the electrodes are equipped with two brazed SS inserts in order to allow coupling with the tank. In order to remove the RF power (about 100 kW) as well as to allow frequency control during high power operation for a given cooling channel layout",
        "a set of thermo-structural simulations was performed",
        "whose input data were the RF Power densities calculated with 2D and 3D codes. In this paper the analytical and numerical methods used",
        "as well as the main outcomes of these studies are presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb13.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB13",
      "page_number": "219",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB14",
      "title": "Heavy-Ion Beam Acceleration at RIKEN for the Super-Heavy Element Search",
      "authors": [
        "E. Ikezawa",
        "M. Fujimaki",
        "Y. Higurashi",
        "O. Kamigaito",
        "M. Kase",
        "M. Komiyama",
        "T. Nakagawa",
        "K. Ozeki",
        "N. Sakamoto",
        "K. Suda",
        "A. Uchiyama",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "K. Kaneko",
        "T.O. Ohki",
        "K. Oyamada",
        "M. Tamura",
        "H. Yamauchi",
        "Y.A. Yusa",
        "SHI Accelerator Service Ltd.",
        "Tokyo",
        "Japan",
        "The RIKEN heavy ion linac (RILAC) is composed of a variable-frequency Wideröe linac",
        "an 18 GHz ECR ion source",
        "a variable-frequency folded-coaxial radio frequency quadrupole linac (FC-RFQ) as a pre-injector",
        "and a Charge-State Multiplier system (CSM) as a booster. The operation of RILAC was started to supply heavy ion beams for experiments in 1981. The 18 GHz ECR ion source and the FC-RFQ were installed in 1996. The CSM was installed in 2000. The maximum beam energy",
        "boosted by the CSM",
        "is 6.0 MeV/nucleon. A GAs-filled Recoil Isotope Separator (GARIS) was moved from the E1 experiment room of the RRC to the No. 1 target room of the RILAC in 2000. In RIKEN Nishina center",
        "the experiment on the super-heavy element (Z=113) search was carried out at RILAC from September 2003 to October 2012. As a result",
        "three events for Z=113 have been successfully observed. The heavy-ion beam acceleration at RIKEN for the super-heavy element search will be reported.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb14.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB14",
      "page_number": "222",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB15",
      "title": "The Cost Optimization Studies of the Superconducting Linac",
      "authors": [
        "Y. Tao",
        "W.L. Chen",
        "C. Feng",
        "Y. He",
        "H. Jia",
        "P. Jiang",
        "S.H. Liu",
        "W.S. Wang",
        "Z.J. Wang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "*High power superconducting linac develops fast recently with the strong demand from research and application. The cost and scale of the projects increase with the energy and beam power. For the superconducting linac",
        "the choice of beta family is the key point to determine the effective acceleration efficiency of the whole facility. The Particle swarm optimization algorithm (PSO) is proposed to optimize the TTF value of the cavities to increase the acceleration efficiency. The project cost considering main hardware price is the final objective to evaluate the choice of beta family. The C-ADS lianc is used as an example to demonstrate the application of the new method. The optimization process and results are presented in the paper.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb15.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB15",
      "page_number": "225",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB16",
      "title": "Conceptual Design of LEBT for C-ADS Linac Accelerator",
      "authors": [
        "W.L. Chen",
        "Y. He",
        "H. Jia",
        "Y. Tao",
        "Z.J. Wang",
        "Q. Wu",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "*In order to avoid the hybrid ions like H2+",
        "H3+ injecting into the RFQ and the residual gas H2 tracing through the RFQ which may lead the RFQ cavity performance degradation",
        "we present the conceptual design of the Low Energy Beam Transport (LEBT) for the China Accelerator Driven Sub-Critical reactor system (C-ADS) accelerator. The LEBT",
        "consisting of one bending magnet and three solenoids and four short-drift sections",
        "match the CW proton beam with 35KeV and 10mA to the entrance of a radio frequency quadrupole (RFQ). This bending LEBT can easily separate the unwanted ions. With the edge angles and one quadrupole to correct the beam asymmetry causing by the bending magnet",
        "the simulation results meet the RFQ entrance requirements.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb16.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB16",
      "page_number": "228",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB17",
      "title": "Status of Superconducting Quarter Wave Resonator Development at MHI",
      "authors": [
        "T. Yanagisawa",
        "H. Hara",
        "A. Miyamoto",
        "K. Sennyu",
        "MHI",
        "Hiroshima",
        "Japan",
        "E. Kako",
        "H. Nakai",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "O. Kamigaito",
        "H. Okuno",
        "K. Ozeki",
        "N. Sakamoto",
        "K. Suda",
        "Y. Watanabe",
        "K. Yamada",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "Mitsubishi Heavy Industries Ltd. (MHI)",
        "Takasago",
        "Japan",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "MHI's activities for development of Superconducting Quarter Wave Resonator (QWR) are reported. MHI has experiences of developments and fabrications of several superconducting ellipse cavities. And now MHI is developing the superconducting QWR for heavy ion accelerators. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb17.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB17",
      "page_number": "231",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB19",
      "title": "Laser Ablation Ion Source for Highly Charge-State Ion Beams",
      "authors": [
        "Department of Energy Sciences",
        "Tokyo Institute of Technology",
        "Yokohama",
        "Japan",
        "S. Takano",
        "K. Takayama",
        "I. Yamane",
        "KEK",
        "Ibaraki",
        "Japan",
        "TIT",
        "Yokohama",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "Acceleration experiments of gaseous heavy ions delivered from the ECR ion source are in progress in the KEK Digital Accelerator(KEK-DA)*.　KEK Laser ablation ion source (KEK-LAIS) has been developed to generate highly ionized metal ions and fully ionized carbon ions since 2012**. Basic parameters such as a charge-state spectrum",
        "momentum spectrum",
        "spatial distribution of the plasma current",
        "extracted ion beam current",
        "and emittance have been obtained. Since diffusion of a laser ablated plasma is known to be controlled by magnetic guiding fields***",
        "these parameters are measured as a function of solenoid guide fields and its length. Meanwhile",
        "10Hz continuous ablation plasma experiment",
        "which is a crucial trial for accelerator applications",
        "will be carried out with a newly developed moving target. The stability in accelerator beam parameters such as the pulse width and intensity is confirmed. At the conference",
        "the extraction of heavy ion beams from the LAIS and post acceleration will be also discussed",
        "including beam optics through the low energy beam transport line to the KEK-DA.",
        "* K. Takayama et al.",
        "Phys. Rev. ST-AB 17 (2014) 010101.  ** N.Munemoto et al.",
        "Rev. Sci. Inst. 85",
        "02B922 (2014). *** M. Okamura et al.",
        "Rev. Sci. Inst. 81",
        "02A510 (2010).",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb19.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB19",
      "page_number": "234",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB20",
      "title": "Development of the New DECRIS-PM Ion Source",
      "authors": [
        "A.A. Efremov",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "ITT-Group",
        "Moscow",
        "Russia",
        "Super-heavy-element factory is under development at the Flerov Laboratory for Nuclear Reactions",
        "JINR",
        "Dubna. The factory will include DC-280 cyclotron",
        "which will be equipped with two 100 kV high voltage platforms. All-permanent magnet ECRIS will be installed on one of the platforms. The request for the source is a production of medium mass ions with A/q=4/7.5 such as 48Ca8+. Results of the detailed design of the DECRIS-PM ion source will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb20.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB20",
      "page_number": "238",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPB21",
      "title": "New Dual-Type Electron Cyclotron Resonance Ion Source for Universal Source on Synthesized Ion Beams",
      "authors": [
        "Y. Kato",
        "T. Iida",
        "F. Sato",
        "Osaka University",
        "Graduate School of Engineering",
        "Osaka",
        "Japan",
        "A new concept on magnetic field of plasma production and confinement has been proposed to enhance efficiency of an electron cyclotron resonance (ECR) plasma for broad and dense ion beam source under the low pressure.* We make this source a part of new dual-type ion source for the first stage. We are also constructing the large bore second stage for synthesizing ions",
        "extraction and beam analysis. We investigate feasibility and hope to realize the device which has wide range operation window in a single device to produce many kinds of ion beams",
        "e.g.",
        "from multiply charged",
        "to molecular",
        "cluster ions",
        "nanotube",
        "fullerenes",
        "including impurities trapped as Fe@C60",
        "etc",
        "as like to universal source based on ECR ion source (ECRIS). We consider to being necessary to device that is available to individual operations with different plasma parameters",
        "and then obtain concept of dual ECRIS from relevant previous works. We conduct both of ion beams analysis and investigation of plasma parameters on produced plasmas. We describe construction of the new dual-type ion source based on ECRIS with wide operation window for aiming at producing synthesized ion beams as can be a universal source.",
        "*Y. Kato et al.",
        "Pro."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb21.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB21",
      "page_number": "241",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB22",
      "title": "Supply of Metallic Beams from RIKEN 18-GHz ECRIS Using Low-Temperature Oven",
      "authors": [
        "K. Ozeki",
        "Y. Higurashi",
        "M. Kidera",
        "T. Nakagawa",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "In the RIKEN 18-GHz electron cyclotron resonance ion source",
        "the practical use of low-temperature oven was achieved for the supply of metallic beams. At the RIKEN Radioisotope Beam Factory",
        "Ca-48 beam is one of the important beams",
        "as a primary beam to produce the secondary beam of neutron-rich medium-heavy nuclei. In order to enhance the intensity and stability of Ca-48 beam",
        "we newly introduced a low-temperature oven and so-called \"hot liner.\" A mixture of CaO and Al powders was placed into the crucible of the oven and heated to produce metallic calcium by a reductive reaction. We succeeded in high-intensity and stable supply of Ca-48 beam",
        "as well as the reduction of material consumption rate. In addition",
        "we succeeded in the supply of Zn-70 beam using the low-temperature oven. In supplying Zn-70 beam",
        "only the ZnO powder was placed into the crucible",
        "and the hot liner was not used. In this contribution",
        "the configuration of low-temperature oven",
        "the effect of the hot liner",
        "the supply situations of Ca-48 and Zn-70 beams for a long-term experiment",
        "and the attempts to supply other metallic beams using the low-temperature oven will be reported.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb22.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB22",
      "page_number": "244",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB23",
      "title": "Development of Electron Cyclotron Resonance Ion Sources for Carbon-Ion Radiotherapy",
      "authors": [
        "National Institute of Radiological Sciences",
        "Chiba",
        "Japan",
        "A.G. Drentje",
        "A. Kitagawa",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "Compact ECR ion sources have been developed for high energy carbon-ion radiotherapy (C-ion RT). Three compact ECR ion sources have been developed as the prototype at NIRS. The first ion source was used the microwave of 2.45 GHz to reduce the construction cost of the source as much as possible. This ion source could not obtain enough intensity of C2+ because there were problems in microwave injection and beam extraction system. The second and third ion sources",
        "named Kei and Kei2",
        "solved these problems. The structure of Kei and Kei2 were similar",
        "however Kei2 improved on the magnetic field configuration. The beam intensity of 0.26 mA and 0.78 mA for C4+ were obtained by Kei and by Kei2",
        "respectively. All of later C-ion RT facilities in Japan",
        "the Gunma University Heavy Ion Medical Center",
        "the Saga Heavy Ion Medical Accelerator in Tosu",
        "and the Ion-beam Radiation Oncology Center in Kanagawa",
        "installed copies of Kei2 and named them KeiGM",
        "KeiSA",
        "and KeiGM3. On the other hand",
        "the original Kei2 have been installed in the HIMAC at NIRS and produces carbon beams for experimental use. Developments and some improvements of these Kei-series ECR ion sources will be reported.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb23.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB23",
      "page_number": "247",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB24",
      "title": "Development of an Online Emittance Monitor for Low Energy Heavy Ion Beams",
      "authors": [
        "V. Tzoganis",
        "O. Kamigaito",
        "M. Kase",
        "T. Nagatomo",
        "T. Nakagawa",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "V. Tzoganis",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "V. Tzoganis",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "RIKEN's 18 GHz ECR ion source supplies the AVF cyclotron with beams ranging from protons to heavy ions as xenon. From comparison with the use of the RILAC (RIKEN Linear Accelerator) and beam transport simulations it was found that the transport efficiency is much lower. To this extend and with the aim to understand the ECR beam production",
        "beam dynamics and optimize the beam transfer we have developed an emittance monitor based on the pepperpot method. The device is composed of a perforated copper plate",
        "transparent scintillator and a CMOS camera for image capturing. Parameters of interest for scintillator's performance are the light yield and radiation hardness. Quartz was found to be resilient to damage and having linear light emission. A real time algorithm written in LabVIEW manages the data acquisition and the 4D phase space distribution calculation. Provided this information",
        "we can investigate parameters such as inter-plane correlation and emittance dependence on extraction specifications",
        "beam current and the magnetic field in the ion source. In this contribution we are presenting the emittance meter design",
        "algorithm description and a set of typical measurements.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb24.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB24",
      "page_number": "250",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB25",
      "title": "Development of a Buffer Gas-Free Buncher for Low Energy RI Ion Beam",
      "authors": [
        "M. Togasaki",
        "K. Kurita",
        "K. Yamada",
        "Rikkyo University",
        "Tokyo",
        "Japan",
        "M. Hara",
        "T. Ohnishi",
        "M. Wakasugi",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "Nagaoka University of Technology",
        "Nagaoka",
        "Niigata",
        "Japan",
        "In the SCRIT (Self-Confining RI Ion Target) electron scattering facility* at RIKEN RI Beam Factory",
        "we constructed an ISOL-type RI beam generator named ERIS (Electron-beam-driven RI separator for SCRIT)**. ERIS supplys continuous RI ion beam with the energy of 50 keV at maximum. In order to efficiently inject the RI beam into the SCRIT device equipped in an electron storage ring",
        "it is necessary to provide a 500-us pulsed ion beam without deteriorating of a vacuum level of less than 10-7 Pa. Therefore",
        "we are developing a buffer gas-free buncher system working under the ultra-high vacuum based on a linear radiofrequency quadrupole (RFQ) trap. Our idea is to make active use of the fringing field at the entrance and the exit to decelerate and stack ions continuously injected into the buncher. Experiment for the performance study is now going on using the stable 133Cs and 23Na ions. In this paper",
        "we will report the latest status of the development and the study of the buncher.",
        "*M. Wakasugi et. al",
        "Nucl. Instr. Meth. B317",
        "668 (2013)  **T. Ohnishi et. al",
        "Nucl. Instr. Meth. B317",
        "357 (2013)",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb25.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB25",
      "page_number": "253",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB27",
      "title": "Developments of LEBT and Injection Systems for Cyclotrons at RCNP",
      "authors": [
        "T. Yorita",
        "M. Fukuda",
        "K. Hatanaka",
        "K. Kamakura",
        "S. Morinobu",
        "T. Saito",
        "K. Shimada",
        "H. Tamura",
        "H. Ueda",
        "Y. Yasuda",
        "RCNP",
        "Osaka",
        "Japan",
        "Developments of injection systems for cyclotrons at Research Center for Nuclear Physics (RCNP) Osaka University have been carried recently in order to improve the highly intense heavy ions in MeV region for the secondary RI beam",
        "et al. The additional glazer lens on axial injection of AVF cyclotron is one of those and it has been installed for the purpose of increasing beam transmission to the inflector in center region of cyclotron. Another development is additional buncher for the heavy ion injection like Xe beam which requires high voltage in comparison with proton case. Extension of baffle slits on injection line of Ring Cyclotron also has been done to extend the flexibility of injection orbit. Modification of low energy beam transport (LEBT) from 18GHz Superconducting ECR ion source to AVF injection axis also has been carried.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb27.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB27",
      "page_number": "256",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB28",
      "title": "Control of Laser Ablation Plasma by Pulsed Magnetic Field for Heavy Ion Beam Production",
      "authors": [
        "TIT",
        "Yokohama",
        "Japan",
        "M.R. Costanzo",
        "T. Kanesue",
        "R.F. Lambiase",
        "C.J. Liaw",
        "M. Okamura",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "RIKEN",
        "Saitama",
        "Japan",
        "Laser ion source can provide high brightness heavy ion beam. In the source",
        "a plasma produced by a pulsed laser irradiation on a solid material drifts toward the extraction electrode. In the meantime",
        "the plasma expands spatially and its flux density at the extraction point dramatically changes within a beam pulse. To stabilize the variation",
        "we try to control the expanding plasma by applying pulsed magnetic field. So that we may achieve flat or tailored beam current profile. For this purpose",
        "we are designing coils and pulsed circuit and these will be experimentally verified.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb28.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB28",
      "page_number": "259",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPB29",
      "title": "Observation of Sublimation Effect of Mg and Ti Ions at the Hyper-Electron Cyclotron Resonance Ion Source",
      "authors": [
        "H. Muto",
        "Y. Kotaka",
        "S. Kubono",
        "Y. Ohshiro",
        "S. Shimoura",
        "S.-I. Watanabe",
        "H. Yamaguchi",
        "S. Yamaka",
        "CNS",
        "Saitama",
        "Japan",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "M. Kase",
        "S. Kubono",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "K. Kobayashi",
        "M. Nishimura",
        "SHI Accelerator Service Ltd.",
        "Tokyo",
        "Japan",
        "KEK",
        "Ibaraki",
        "Japan",
        "Light intensities of a grating monochromator during plasma chamber baking and 24Mg8+ and 48Ti13+ beam operation were observed at the Hyper-Electron Cyclotron Resonance ion source. During chamber baking almost all light intensities were Fe I and Fe II. However",
        "when MgO or TiO2 rod was inserted into the plasma and the beam operation was started the light intensity spectrum was drastically changed and most of the Fe I and Fe II lights were disappeared and Mg or Ti light intensities were coming out. In this paper we describe vacuum conditions of ECR ion source during chamber baking and beam tuning."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb29.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB29",
      "page_number": "262",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPB30",
      "title": "Optical Design of the EBIS Charge Breeder System for RAON in Korea",
      "authors": [
        "H.J. Son",
        "J.-W. Kim",
        "Y.H. Park",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "UNIST",
        "Ulsan",
        "Republic of Korea",
        "In Korea",
        "a heavy ion accelerator facility called RAON is being designed to produce various rare isotopes under the Rare Isotope Science Project. Electron beam ion source (EBIS) will be used for charge breeding of rare isotope beams in the ISOL system*. The electron beam simulation has been performed from an E-gun cathode to a collector by using TRAK**. The electron beam current is set to be 3A at the beam energy of 20kV",
        "and the electron beam current density can reach up to 500 A/cm2 by maximum magnetic field of about 6T. The breeding time of 132Sn33+ is calculated to be 61ms under these electron beam condition. In case of 133Cs33+",
        "the breeding time is about 67ms. The ion beam simulation has been performed for both injection and extraction operation modes by using TRAK and SIMION***. The ion transport design is based on these simulation results. In the other hand",
        "an acceptance of EBIS system is estimated to be 52πmm·mrad assuming partial overlap with electron beams. If 100% of ion-electron overlap is assumed",
        "the acceptance is 14πmm·mrad. In this work",
        "we will also report simulation results on the charge breeding processes**** in addition to electron and ion beam dynamics.",
        "* Jongwon Kim et al.",
        "Proc. of EBIST'14",
        "AIP Conf. Proc. 1640",
        "38-43 (2015).  ** http://www.fieldp.com/  *** http://www.simion.com/ **** R. Becker et al.",
        "J. Phys.: Conf. Ser. 58 (2007) 443.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wepb30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wepb30.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wepb30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEPB30",
      "page_number": "265",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 25,
  "scrape_time": "2025-10-10 17:39:15"
}