{
  "session_info": {
    "id": "TUXAT01",
    "name": "TUXAT01 - WG3:Optics & Beam Dynamics",
    "url": "https://proceedings.jacow.org/eefact2022/html/tuxat01.htm"
  },
  "papers": [
    {
      "paper_id": "TUXAT0102",
      "title": "Investigation of Arc Region Lattice for the Compatible Modes of CEPC Collider Ring",
      "authors": [
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "The FODO cell structure is chosen to provide a large filling factor of dipoles for the arc region of a circular Higgs factory. For the Higgs and ttbar modes of CEPC collider",
        "the phase advances of each arc cell are 90/90 degrees; For the Z mode",
        "the phase advance was reduced to 60/60 degrees in order to suppress the microwave and transverse mode coupling instability and to increase stable tune area when considering both the beam-beam effect and longitudinal impedance. For the W mode",
        "the phase advance was reduced as Z to increase the stable tune area. Due to the different cell phase advances of Higgs/ttbar and Z/W modes",
        "the sextupole pairs with ’I transportation matrix are no more maintain. Thus",
        "compatible sextupole layout for the should be provide for the Higgs/ttbar and Z/W modes. Two schemes of the arc sextupole layout are investigated for the CEPC collider arc region. One has a period of 5 cells for Higgs/ttbar modes and 7 cells for Z/W modes",
        "which is proposed by FCC-ee. Another one has a period of 11 cells or 23 cells for all the modes. From the view point of single beam dynamics and cost of the sextupole",
        "the two schemes will be investigated and compared."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/tuxat0102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/tuxat0102.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/tuxat0102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-TUXAT0102",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXAT0103",
      "title": "SuperKEKB Optics Tuning and Issues",
      "authors": [
        "H. Sugimoto",
        "H. Koiso",
        "A. Morita",
        "Y. Ohnishi",
        "KEK",
        "Ibaraki",
        "Japan",
        "SuperKEKB is an electron-positron double-ring asymmetric-energy collider at the High Energy Accelerator Research Organization (KEK) in Japan. It adopts a novel collision method named nano-beam scheme to avoid the so-called hourglass effect. In the nano-beam scheme",
        "two beams are squeezed to extremely small sizes at the interaction point and are collided with a large crossing angle between them. Since staring the collision operation in April 2018",
        "numerous machine tunings and beam studies have been performed to improve the machine performance. The highest peak luminosity so far is 4.65 x 1034 cm-2 s-1 reached in June 8th",
        "2022. This record is the world’s highest instantaneous luminosity and is more than 2 times higher than that of the previous KEKB collider. This talk starts with a brief introduction to SuperKEKB ring lattice design. The talk then presents some important topics related to beam optics tuning in the actual machine operation. Major issues to be resolved to boost the machine performance further are also addressed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/tuxat0103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/tuxat0103.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/tuxat0103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-TUXAT0103",
      "page_number": "35",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 08:34:40"
}