{
  "session_info": {
    "id": "THZMS",
    "name": "THZMS - Awards Session",
    "url": "https://proceedings.jacow.org/IPAC2015/html/thzms.htm"
  },
  "papers": [
    {
      "paper_id": "THZMS1",
      "title": "A New Class of Superconducting Structures for the Deflection and Crabbing of Particle Beams",
      "authors": [
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "Recently",
        "superconducting deflecting and crabbing cavities for particle accelerators and colliders have been an area of intense research. The future colliders pushing the energy and luminosity frontiers and particle accelerators with multi-experimental stations have expanded the need of deflecting/crabbing cavities. The current applications in need of such cavities operate at low frequencies and have also specifications with strict dimensional constraints",
        "high operating transverse gradients",
        "and tight impedance budgets. At low operating frequencies the use of standard cavities operating in TM110-like modes has been very challenging. A new type of superconducting deflecting/crabbing structure has been designed that has a wide range of applications. The new rf-dipole cavity operates in a TE11-like mode where several cavities have been fabricated",
        "and tested. The rf performance shows that these structures are capable of operating at high transverse gradients and will be a very attractive deflecting/crabbing cavity for many current applications. At present",
        "a 400 MHz rf-dipole crabbing cavity system is under development to be tested at SPS at LHC as part of the LHC High Luminosity Upgrade."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thzms1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thzms1.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thzms1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THZMS1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THZMS2",
      "title": "Collective Dynamics and Coherent Diagnostics of Microbunched Relativistic Electron Beams",
      "authors": [
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "The generation of microbunching due to collective interactions is a key subject in relativistic electron beams. Often regarded as a parasitic effect",
        "in recent times the use of the microbunching instability has been investigated in the context of generating coherent broadband radiation pulses and coherent electron cooling. In my talk I will review the core topics of my doctoral work. I will begin by describing the three-dimensional kinetic theory of the longitudinal space-charge interactions",
        "which I used to lay the foundations of a fully kinetic treatment of the microbunching instability. I will then present the results of my experimental activity at the Next Linear Collider Test Accelerator of SLAC. In particular I will discuss the generation of coherent broadband photon pulses in a cascaded longitudinal space-charge amplifier",
        "and the use of coherent diffraction imaging techniques for the diagnosis of beam microbunching."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thzms2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thzms2.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thzms2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THZMS2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THZMS3",
      "title": "Superconducting RF (SRF) Accelerators Enter a Golden Age",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Spectacular breakthroughs in SRF cavity performance have launched major successes in SRF-based particle accelerators at major national laboratories. Both the gradient and the Q values of SRF structures have made remarkable strides in the last two decades. When completed",
        "the newly installed accelerators will triple the total installed SRF voltage. The biggest accelerator is the X-ray Free Electron Laser (XFEL) now under construction in Hamburg Germany",
        "based on 800 Niobium. Jefferson Laboratory in Newport News",
        "Va just upgraded the energy of CEBAF by a factor of two using one hundred new cavities. SLAC is upgrading its Linac Coherent Light Source using nearly 300 SRF cavities in 35 cryomodules",
        "half to be constructed at Fermilab and half at Jefferson Lab. Low velocity accelerators for heavy ions are expanding. Argonne has installed record performance upgrade cryomodules. TRIUMF is constructing ARIEL. Spiral II in France is nearing completion and HI-ISOLDE at CERN is getting ready. Michigan Stage University is constructing an accelerator for Nuclear Astrophysics based on 350 low-beta cavities. High intensity proton accelerators are spreading. Starting with the 1.4 Megawatt Spallation Neutron Source at Oak Ridge the European Spallation Source (ESS) has been launched aiming eventually for 5 MW. Fermilab is carrying out R&D on the Proton-Improvement-Plan PIP-II to provide a one MW proton beam with 125 cavities. China and India are planning and protoyping Accelerator Driven Systems (ADS) for Transmutation of Nuclear Waste and power generation from Thorium via non-critical reactors. These and other upcoming projects around the world have launched the “Golden Age of SRF”. Excitement continues about the “800 lb guerrilla” - the International Linear Collider - which will need 16",
        "000 cavities",
        "if built. The next two years will decide its future."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/thzms3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/thzms3.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/thzms3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-THZMS3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 20:33:22"
}