{
  "session_info": {
    "id": "FRXCA",
    "name": "FRXCA - Invited Oral Presentation (Beam Instrumentation and Feedback)",
    "url": "https://proceedings.jacow.org/IPAC2013/html/frxca.htm"
  },
  "papers": [
    {
      "paper_id": "FRXCA01",
      "title": "Progress in Transverse Feedbacks and Related Diagnostics for Hadron Machines",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "Today Hadron Accelerators with high intensity and high brightness beams increasingly rely on transverse feedback systems for the control of instabilities and the preservation of the transverse emittance. With particular emphasis",
        "but not limited",
        "to the CERN Hadron Accelerator Chain the progress made in recent years and the performances achieved are reviewed. Hadron colliders such as the LHC represent a particular challenge as they ask for low noise electronic systems in these feedbacks for acceptable emittance growth. Achievements of the LHC transverse feedback system used for damping injection oscillations and to provide stability throughout the cycle are summarized. This includes its use for abort gap and injection cleaning as well as transverse blow-up for diagnostics purposes. Beyond systems already in operation",
        "advances in technology and modern digital signal processing with increasingly higher digitization rates have made systems conceivable to cure intra-bunch motion. With its capabilities to both acquire beam oscillations and to actively excite motion",
        "transverse feedback systems have a large variety of applications for beam diagnostics purposes."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/frxca01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/frxca01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/frxca01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-FRXCA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 21:48:52"
}