{
  "session_info": {
    "id": "THCOXBS",
    "name": "THCOXBS - WG4: Superconducting RF",
    "url": "https://proceedings.jacow.org/erl2019/html/thcoxbs.htm"
  },
  "papers": [
    {
      "paper_id": "THCOXBS01",
      "title": "Waveguide HOM Loads for High Current Elliptical Cavities",
      "authors": [
        "J. Guo",
        "R.A. Rimmer",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "H.-W. Glock",
        "A.V. Vélez",
        "HZB",
        "Berlin",
        "Germany",
        "Waveguide HOM dampers are widely used in high current RF cavities",
        "as waveguides are natural high pass RF filters and can easily handle high RF power. In this presentation",
        "the author will review a few typical waveguide HOM load designs",
        "especially the recently developed high power HOM loads for BERLinPro and BESSY-VSR. We will report the RF-thermal-mechanical design",
        "fabrication technology",
        "absorber material choice",
        "as well as the testing results of these HOM loads."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/thcoxbs01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/thcoxbs01.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/thcoxbs01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-THCOXBS01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THCOXBS02",
      "title": "Development of HOM Coupler with C-Shaped Waveguide for ERL Operation",
      "authors": [
        "M. Sawamura",
        "R. Hajima",
        "QST",
        "Tokai",
        "Japan",
        "M. Egi",
        "K. Enami",
        "T. Furuya",
        "H. Sakai",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "HOM damping in the superconducting cavities has been becoming increasingly important for high current beam acceleration. Though some HOM damping devices have already been used with success at moderate currents",
        "they have some inherent disadvantages for high current in principle. We have proposed the new type of the HOM coupler using the C-shaped wave guide (CSWG). The CSWG is structured by topologically transforming a rectangular waveguide into coaxial-like structure whose inner and outer conductors are connected with a plate. Similar to the rectangular waveguide",
        "the CSWG has cutoff frequency whose half wave length is approximately equal to the mean circumference. This enables a smaller low-pass filter than the rectangular waveguide. Since the inner conductor can be easily cooled through the plate and the outer conductor",
        "this prevents the connector for HOM power extraction from temperature rising. These characteristics of the CSWG-type HOM coupler can solve the disadvantages of the conventional damping devices. The properties of sufficient HOM damping were confirmed by the measurements with the CSWG-type HOM couplers equipped to the cavity models."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/thcoxbs02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/thcoxbs02.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/thcoxbs02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-THCOXBS02",
      "page_number": "138",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCOXBS05",
      "title": "High Q 704 MHz Cavity Tests at CERN",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "Results from CERN’s bulk niobium high-gradient cavity development program at CERN are presented",
        "with particular focus on evolution of RF performance 704 MHz bulk niobium 5-cell elliptical cavity prototypes originally produced for the Superconducting Proton Linac (SPL) project. Successive cold tests of bare cavities have been used to refine the cavity preparation and testing process",
        "with all steps done in-house at CERN",
        "and reproducible RF performance well above SPL specifications has been achieved. Current performance results are discussed in relation to cavity preparation and cold tests procedures",
        "with reference to direct observables such as expelled flux and thermal gradients during cool down",
        "field emission characteristics",
        "and quench diagnostics. In addition",
        "the processing of raw RF data from single pulse measurements to extract RF performance figures of merit will be presented",
        "offering an alternative approach to assessing RF performance.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/thcoxbs05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/thcoxbs05.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/thcoxbs05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-THCOXBS05",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THCOXBS06",
      "title": "Degradation and Recovery of Cavity Performance in Compact-ERL Injector Cryomodule at KEK",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "After cryomodule assembly and first cool-down tests in 2012",
        "the cERL injector cryomodule has been stably operated with beam for eight years. However",
        "gradual increases of x-ray radiation levels due to field emission were observed during the long term beam operation. High power pulsed RF conditioning as a cure method was firstly applied in the cool-down period in 2016",
        "so that degraded cavity performances have almost recovered up to the previous levels. After that",
        "high power pulsed RF conditioning has been repeatedly carried out as a standard procedure in the beginning of the cool-down periods in 2017-2019. Performance degradation and recovery status during the long term beam operation will be presented in this talk."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/thcoxbs06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/thcoxbs06.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/thcoxbs06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-THCOXBS06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:04:25"
}