{
  "session_info": {
    "id": "WEOBB",
    "name": "WEOBB - Contributed Oral Presentations, Beam Instrumentation and Feedback",
    "url": "https://proceedings.jacow.org/IPAC2014/html/weobb.htm"
  },
  "papers": [
    {
      "paper_id": "WEOBB01",
      "title": "Design and Performance of the Optical Fiber Length Stabilization System for SACLA",
      "authors": [
        "H. Maesaka",
        "T. Ohshima",
        "Y. Otake",
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "JASRI/SPring-8",
        "Hyogo",
        "Japan",
        "The x-ray free electron laser facility",
        "SACLA",
        "requires timing synchronization accuracies of less than 50 fs for acceleration rf components and less than 10 fs for pump-and-probe user experiments. Although a stable timing distribution system with optical fiber cables was constructed*",
        "a timing drift of more than 100 fs has been observed after the transmission of about 100 m**. In order to suppress optical fiber length drift",
        "we developed and installed an optical fiber length stabilization system with a Michelson interferometer. A frequency-stabilized laser with a wavelength of 1.5 um is transmitted together with a timing signal and it is reflected back to the interferometer. The length signal from the interferometer is fed back to a fiber stretcher for fiber length control. A prototype system showed that the length of a 1km-long optical fiber in a feedback loop was stabilized within 0.1 um corresponding to 0.5 fs. From this result",
        "a timing accuracy improvement of pump-and-probe experiments can be expected. In this presentation",
        "the design and basic performance of the optical fiber length stabilization system and the operational experience at SACLA will be reported.",
        "* H. Maesaka et al.",
        "Proceedings of FEL’08",
        "352 (2008).  ** H. Maesaka et al.",
        "Proceedings of FEL’12",
        "325 (2012)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/weobb01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/weobb01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/weobb01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEOBB01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOBB02",
      "title": "Status of Single-shot EOSD Measurement at ANKA",
      "authors": [
        "N. Hiller",
        "A. Borysenko",
        "E. Hertle",
        "V. Judin",
        "B. Kehrer",
        "S. Marsching",
        "A.-S. Müller",
        "M.J. Nasse",
        "M. Schuh",
        "P. Schönfeldt",
        "N.J. Smale",
        "J.L. Steinmann",
        "KIT",
        "Karlsruhe",
        "Germany",
        "P. Peier",
        "B. Steffen",
        "DESY",
        "Hamburg",
        "Germany",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "ANKA is the first storage ring in the world with a near-field single-shot electro-optical (EO) bunch profile monitor. The method of electro-optical spectral decoding (EOSD) uses the Pockels effect to modulate the longitudinal electron bunch profile onto a long",
        "chirped laser pulse passing through an EO crystal. The laser pulse is then analyzed with a single-shot spectrometer and from the spectral modulation",
        "the temporal modulation can be extracted. The setup has a sub-ps resolution (granularity) and can measure down to bunch lengths of 1.5 ps RMS for bunch charges as low as 30 pC. With this setup it is possible to study longitudinal beam dynamics (e. g. microbunching) occurring during ANKA's low-alpha-operation",
        "an operation mode with compressed bunches to generate coherent synchrotron radiation in the THz range. In addition to measuring the longitudinal bunch profile",
        "long-ranging wake-fields trailing the electron bunch can also be studied",
        "revealing bunch-bunch interactions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/weobb02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/weobb02.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/weobb02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEOBB02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOBB03",
      "title": "FEL Dynamics Measured with the X-band Transverse Deflecting Cavity",
      "authors": [
        "P. Krejcik",
        "F.-J. Decker",
        "Y. Ding",
        "Z. Huang",
        "H. Loos",
        "T.J. Maxwell",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "DESY",
        "Hamburg",
        "Germany",
        "We report on measurements of the longitudinal phase space profile of the bunch as it evolves along the length of the LCLS undulator. An x-band transverse deflecting cavity downstream of the undulator makes time resolved energy profile measurements with fs resolution. The electron energy loss mechanism of the FEL process is observed and allows us to reconstruct the temporal profile of the x-ray pulse on a shot by shot basis. We have been able to observe with unprecedented resolution microbunching in the beam and resonant energy loss leading to exponential gain and saturation in the FEL",
        "as well as provide the users with the temporal profile of the x-rays on every shot."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/weobb03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/weobb03.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/weobb03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-WEOBB03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 20:44:33"
}