{
  "session_info": {
    "id": "MOKL",
    "name": "MOKL - Keynote Session I",
    "url": "https://proceedings.jacow.org/icalepcs2021/html/mokl.htm"
  },
  "papers": [
    {
      "paper_id": "MOKL01",
      "title": "Highlights of Accelerator R&D at Shanghai Light Sources Cluster",
      "authors": [
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "In order to establish a world-class photonic science research center",
        "several large-scale facilities including synchrotron radiation light source and free electron lasers had been scheduled at SARI. SSRF had been completed at the end of 2010 and currently in operation as the only third-generation synchrotron radiation source in China. SXFEL-TF has completed and demonstrated EEHG-HGHG mode at the end of 2020. This facility will be upgraded to a EXFEL-UF in 2021. The SHINE project started Infrastructure construction and key instruments development from 2018. Currently the injector tunnel is ready for accelerator installation and commissioning. To ensure the smooth construction of the aforementioned accelerator facilities",
        "the accelerator team has carried out research on a number of key technologies: including superconducting acceleration modules",
        "room temperature high-gradient acceleration technology",
        "advanced undulator technology",
        "and digital beam diagnostics and control technology. This article will briefly introduce the construction and operation of the above-mentioned large scientific facilities",
        "as well as the latest progress of key technology development."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mokl01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mokl01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mokl01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOKL01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:04:07"
}