{
  "session_info": {
    "id": "WEAL",
    "name": "WEAL - Feedback Control, Machine Tuning and Optimization I",
    "url": "https://proceedings.jacow.org/icalepcs2021/html/weal.htm"
  },
  "papers": [
    {
      "paper_id": "WEAL01",
      "title": "Image Processing Alignment Algorithms for the Optical Thomson Scattering Laser at the National Ignition Facility",
      "authors": [
        "A.A.S. Awwal",
        "T.S. Budge",
        "R.R. Leach",
        "R.R. Lowe-Webb",
        "V.J. Miller Kamm",
        "S. Patankar",
        "B.P. Patel",
        "K.C. Wilhelmsen",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "Understanding plasma performance in the world’s largest and most energetic laser facility",
        "the National Ignition Facility (NIF)",
        "is an important step to achieving the goal of inertial confinement fusion in a laboratory setting. The optical Thompson scattering (OTS) laser has been developed to understand the target implosion physics",
        "especially for under-dense plasma conditions. A 5w probe beams can be set up for diagnosing various plasma densities. Just as the NIF laser with 192 laser beams are precisely aligned",
        "the OTS system also requires precision alignment using a series of automated closed loop control steps. CCD images from the OTS laser (OTSL) beams are analyzed using a suite of image processing algorithm. The algorithms provide beam position measurements that are used to control motorized mirrors that steer beams to their defined desired location. In this paper",
        "several alignment algorithms will be discussed with details on how they take advantage of various types of fiducials such as diffraction rings",
        "contrasting squares and circles",
        "octagons and very faint 5w laser beams."
      ],
      "institutions": [
        "Funding: *This work performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344."
      ],
      "abstract": "*This is released as LLNL-ABS-821809",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/weal01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/weal01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/weal01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-WEAL01",
      "page_number": "528",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAL02",
      "title": "A Framework for High Level Machine Automation Based on Behavior Tree",
      "authors": [
        "G. Gaio",
        "P. Cinquegrana",
        "S. Krecic",
        "G. Scalamera",
        "G. Strangolino",
        "F. Tripaldi",
        "M. Trovò",
        "L. Zambon",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "In order to carry out complex tasks on particle accelerators",
        "physicists and operators need to know the correct sequence of actions usually performed through a large number of graphical panels. The automation logics often embedded in the GUIs prevents its reuse by other programs",
        "thus limiting the level of automation a control system can achieve. In order to overcome this limitation we have introduced a new automation framework for shifting the logics from GUIs to server side",
        "where simple tasks can be easily organized",
        "inspected and stacked up to build more complex actions. This tool is based on Behavior Trees (BT) which has been recently adopted in the gaming industry for in-game AI player opponents. They are able to create very complex tasks composed by simple decoupled self-contained tasks (nodes)",
        "regardless how they are implemented. The automation framework has been deployed in the Elettra and FERMI TANGO-based control systems to implement autonomous operations. A dedicated Qt GUI and a web interface allow to inspect the BTs and dynamically go through a tree",
        "visualize the dependencies",
        "monitor the execution and display any running action."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/weal02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/weal02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/weal02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-WEAL02",
      "page_number": "534",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAL03",
      "title": "The Status of Fast Obit Feedback System of HEPS",
      "authors": [
        "P. Zhu",
        "Y.C. He",
        "D.P. Jin",
        "L. Zeng",
        "Y.L. Zhang",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "DNSC",
        "Dongguan",
        "People’s Republic of China",
        "L. Wang",
        "X. Wu",
        "Z.X. Xie",
        "K. Xue",
        "IHEP CSNS",
        "Guangdong Province",
        "People’s Republic of China",
        "In order to further meet the needs of major national strategies and basic scientific research",
        "High Energy Photon Source (HEPS) will be a high-performance fourth-generation synchrotron radiation source in Beijing",
        "which will build more than 90 high-performance beamline stations. In order to ensure the high-performance operation of each beam line",
        "the stability of the beam orbit near the light source output point is extremely important. As one of the key guarantees for the stability of the electron beam orbit",
        "The FOFB system can suppress the beam orbit disturbance within a certain bandwidth to an acceptable range. This article introduces the currently progress of the FOFB system",
        "including: the overall architecture scheme and key technical routes; the substation design following the ATCA mechanical architecture; the BPM data acquisition and high-speed transmission using high-performance Rocket I/O transmission Mechanism; embedded high-performance DSP for fast multiplication calculation to realize SVD",
        "etc. The entire system design is progressing in an orderly manner."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/weal03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/weal03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/weal03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-WEAL03",
      "page_number": "540",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 18:05:57"
}