{
  "session_info": {
    "id": "WEPF",
    "name": "WEPF - Wednesday Poster Session",
    "url": "https://proceedings.jacow.org/IBIC2013/html/wepf.htm"
  },
  "papers": [
    {
      "paper_id": "WEPF01",
      "title": "Alignment of a Nozzle-Skimmer System for a Non Invasive Gas Jet Based Beam Profile Monitor",
      "authors": [
        "V. Tzoganis",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "V. Tzoganis",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A non-invasive gas jet-based beam profile monitor has been developed in the QUASAR Group at the Cockcroft Institute",
        "UK. This shall allow monitoring ultra-low energy",
        "as well as high energy particle beams in a way that causes least disturbance to both",
        "primary beam and accelerator vacuum. In this setup a nozzle-skimmer system is used to generate a thin supersonic curtain-shaped gas jet. However",
        "very small diameters of both",
        "the gas inlet nozzle and subsequent skimmers",
        "required to shape the jet",
        "have caused problems in monitor operation in the past. Here",
        "an image processing based technique is presented which follows after careful manual initial alignment using a laser beam. An algorithm has been implemented in Labview and offers a semi-automated and straightforward solution for all previously encountered alignment issues. The procedure is presented in detail and experimental results are shown."
      ],
      "institutions": [
        "Funding: Work supported by EU under contract 215080, Helmholtz Association and GSI under contract VH-BG-328, STFC under the Cockcroft Institute Core Grant No.ST/G008248/1 and a Liverpool - Riken fellowship."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf01.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF01",
      "page_number": "803",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF03",
      "title": "Scintillating Screen Monitors for Transverse Electron Beam Profile Diagnostics at the European XFEL",
      "authors": [
        "Ch. Wiebers",
        "M. Holz",
        "G. Kube",
        "D. Nölle",
        "G. Priebe",
        "H.-C. Schröder",
        "DESY",
        "Hamburg",
        "Germany",
        "Transverse beam profile diagnostics in modern electron linear accelerators like FELs or injector LINACs are mainly based on optical transition radiation (OTR) as standard technique which is observed in backward direction when a charged particle beam crosses the boundary between two media with different dielectric properties. The experience from modern LINAC based 4th generation light sources shows that OTR diagnostics might fail because of coherence effects in the OTR emission process. As a consequence",
        "for the European XFEL which is currently under construction in Hamburg",
        "transverse beam profile measurements are based on scintillating screen monitors. The LYSO:Ce screens are oriented such that coherent OTR generated at the screen boundaries will be geometrically suppressed. An additional advantage is that the imaging optics operate in Scheimpflug condition thus adjusting the plane of sharp focus with respect to the CCD chip and significantly increasing the apparent depth of field. This report gives an overview of the measuring principle and the monitor setup together with results of laboratory test measurements and a first prototype test at FLASH (DESY",
        "Hamburg)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf03.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF03",
      "page_number": "807",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF04",
      "title": "A New Compact Design of a  Three-Dimensional Ionization Profile Monitor (IPM)",
      "authors": [
        "H.F. Breede",
        "H.-J. Grabosch",
        "M. Sachwitz",
        "L.V. Vu",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "FLASH at DESY in Hamburg is a linear accelerator",
        "which uses superconducting technology to produce soft x-ray laser light ranging from 4.1 to 45 nm. To ensure the operation stability of FLASH",
        "monitoring of the beam is mandatory. Two Ionization Profile Monitors (IPM) detect the lateral x and y position changes. The functional principle of the IPM is based on the detection of particles",
        "generated by interaction of the beam with the residual gas in the beam line. The newly designed IPM enables the combined determination of the horizontal and vertical position as well as the profile. This is made possible by a compact monitor",
        "consisting of a cage in a vacuum chamber",
        "two micro-channel plates (MCP) and two repeller plates with toggled electric fields at the opposite sides of the MCPs. The particles created by the FEL beam",
        "drift in a homogenous electrical field towards the respective MCP",
        "which produces an image of the beam profile on an attached phosphor screen. A camera for each MCP is used for evaluation. This indirect detection scheme operates over a wide dynamic range and allows the detection of the center of gravity and the shape of the beam. The final design is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf04.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF04",
      "page_number": "811",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF05",
      "title": "An Electron Beam Detector for the FLASH II Beam Dump",
      "authors": [
        "F. Perlick",
        "J.D. Good",
        "N. Leuschner",
        "M. Sachwitz",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "G. Kube",
        "M. Schmitz",
        "K. Wittenburg",
        "T. Wohlenberg",
        "DESY",
        "Hamburg",
        "Germany",
        "For the electron absorber at FLASH II a detector is developed to control the position",
        "dimensions and profile of the electron beam. Scintillation light",
        "emitted from a luminescent screen in front of the dump window",
        "is reflected by a mirror",
        "located in 2 m distance from the screen",
        "and passes through a vacuum window. Two different optical systems will be installed redundantly for beam image transfer: a conventional lens-mirror-system and a system using a radiation-hard optical fibre bundle. A CCD camera",
        "located in one and a half meter distance from the beam line",
        "is used for the optical analysis. An experimental setup",
        "where the terms of installation of the components correspond to the FLASH accelerator",
        "has been built up in a lab to coordinate the interaction of the screen with the components of the optical system. It was shown that the resolution of the lens-mirror-system is about one line pair per millimeter. An experiment is set up to test the impact of radiation on the optical qualities of the fibre optic bundle by installing it onto a “radioactive hot spot” at the bunch compressor in the FLASH accelerator."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf05.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF05",
      "page_number": "814",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF06",
      "title": "A Fast Switching Mirror Unit at FLASH",
      "authors": [
        "F. Perlick",
        "J.D. Good",
        "N. Leuschner",
        "A.S. Ontoso",
        "M. Sachwitz",
        "L.V. Vu",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "DESY",
        "Hamburg",
        "Germany",
        "The Free Electron Laser (FLASH) at DESY Hamburg is a linac providing unique experimental opportunities to investigate the atomic structure and the properties of materials",
        "nanoparticles",
        "viruses and cells. At the experimental hall",
        "the incoming FEL beam can be deflected towards five test sites by silicon mirrors mounted into vacuum vessels",
        "of which one is operated in permanent switching mode",
        "allowing the simultaneous use of the light at two different test sites. So far",
        "the entire vacuum vessel with the mirror inside is moved into the beam by a linear motor. This results in high translatory inertia and",
        "to compensate the vessel motion",
        "requires vacuum bellows",
        "which have a limited lifetime especially at higher switching frequencies. Therefore",
        "in the recent design the mirror is shifted by piezo motors operated inside the vessel under ultra-high vacuum conditions. However",
        "temperature measurements revealed that during continuous operation the motor reaches up to 90°C only when exposed to air",
        "necessitating long breaks to allow it to cool. Therefore suitable cooling methods are being investigated to guarantee continuous operation of the motor under ultra-high vacuum conditions."
      ],
      "institutions": [],
      "abstract": "H. Schulte-Schrepping",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf06.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF06",
      "page_number": "818",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF07",
      "title": "Profile Grid Monitor and First Measurement Results at the MedAustron Accelerator",
      "authors": [
        "M. Repovz",
        "A. Gyorgy",
        "A. Kerschbaum",
        "F. Osmic",
        "S.M. Schwarz",
        "EBG MedAustron",
        "Wr. Neustadt",
        "Austria",
        "CERN",
        "Geneva",
        "Switzerland",
        "MedAustron is an ion beam therapy center located in Wiener Neustadt",
        "Austria. The design is based on CERN’s Proton-Ion Medical Machine Study and the project is currently in the installation and commissioning phase. This paper summarizes the design",
        "production and commissioning of MedAustron’s beam profile grid monitor. This monitor measures the beam profile in the low and medium energy beam transfer line where the beam dimensions can be as large as 100 mm. Reasonable position resolution is achieved with a harp consisting of 64 wires per plane and a pitch of up to 1.7 mm. Special effort was needed to produce such harps and bring the signal cables out of the vacuum. As the readout electronics has to cope with DC as well as pulsed beam all 128 wires are acquired simultaneously. This is achieved by integrating the charge during the “flat-top” of the beam pulse and storing it for serial transmission to the back end electronics for conversion. The high accuracy requires calibration of offset and amplification errors for every single channel. A NI PXI FPGA card controls the readout chain. The code for controlling the readout",
        "including the graphical interface",
        "is written in NI LabView."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf07.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF07",
      "page_number": "822",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF09",
      "title": "Profile and Emittance Measurements at the CERN LINAC-4 3 MeV Test Stand",
      "authors": [
        "F. Zocca",
        "E. Bravin",
        "M. Duraffourg",
        "G.J. Focker",
        "D. Gerard",
        "U. Raich",
        "F. Roncarolo",
        "CERN",
        "Geneva",
        "Switzerland",
        "A new 160 MeV H− Linac named Linac-4 will be built at CERN to replace the old 50 MeV proton Linac. The ion source",
        "the 3 MeV RFQ and the medium energy transport (MEBT) hosting a chopper",
        "have been commissioned in a dedicated test stand. Wire grids and wire scanners were used to measure the transverse beam profile and a slit/grid emittance meter was installed on a temporary test bench plugged at the RFQ and MEBT exit in different stages. The emittance meter slit was also used as a scanning scraper able to reconstruct the transverse profile by measuring the transmission with a downstream current transformer. On the same measurement bench",
        "a spectrometer in conjunction with a wire grid allowed measuring the energy spread of the particles. This paper summarizes the measurement results that allowed characterizing the 3 MeV beam and discusses the present understanding of monitor performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf09.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF09",
      "page_number": "826",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF10",
      "title": "Wire Scanner Design for the European Spallation Source",
      "authors": [
        "B. Cheymol",
        "A. Jansson",
        "T.J. Shea",
        "ESS",
        "Lund",
        "Sweden",
        "The European Spallation Source (ESS)",
        "to be built in the south of Sweden",
        "will use a 2 GeV superconducting LINAC to produce the world's most powerful neutron source with a beam power of 5 MW. The beam power is a challenge for interceptive beam diagnostics like wire scanner",
        "the thermal load on intercepting devices implies to reduce the beam power in order to preserve the device integrity. For nominal operation",
        "non-disturbing techniques for profile measurements are planned",
        "while for the commissioning phase",
        "accurate measurements and cross checking",
        "wire scanners will be used. This paper describes the preliminary design of the wire scanner system in the normal conducing LINAC as well as in the superconducting LINAC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf10.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF10",
      "page_number": "830",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF11",
      "title": "Emittance Measurement Using X-Ray Lenses at the ESRF",
      "authors": [
        "F. Ewald",
        "J.C. Biasci",
        "L. Farvacque",
        "K.B. Scheidt",
        "ESRF",
        "Grenoble",
        "France",
        "During the year 2011",
        "X-ray lenses were tested as an alternative way of emittance measurement in the ESRF storage ring. Following these tests it was decided to install a new bending magnet diagnostics beam port dedicated primarily to a permanent emittance measurement using X-ray lens imaging. The new beam port is equipped with a thin (0.6 mm) double CVD diamond window instead of 3 mm aluminium used at the pinhole beam ports. This increases the X-ray transmission",
        "especially at low energies. The imaging and emittance measurement using aluminium lenses is discussed in comparison to the emittance measurement based on pinhole imaging. Although the principle works correctly",
        "the setup presents different practical difficulties",
        "such as low signal intensity and heat load."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf11.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF11",
      "page_number": "833",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF12",
      "title": "Characterisation of Al-Compound Refractive Lenses for X-Rays",
      "authors": [
        "F. Ewald",
        "J.C. Biasci",
        "ESRF",
        "Grenoble",
        "France",
        "We report on measurements of the surface quality (shape) of aluminium compound refractive lenses using a thin collimated X-ray beam from one of our bending magnet diagnostics beam ports. Two types of lenses were tested for overall radius of curvature",
        "surface quality and thickness: commercially available lenses (RWTH Aachen)",
        "and lenses of the same type manufactured at the ESRF. The different surface qualities can be readily discerned with our relatively simple setup. While the technique should be improved for more precise results",
        "it already shows clearly the imperfect surface structure of the ESRF lenses. The image quality of the beam",
        "however",
        "is not affected to a visible extent in our emittance measurement setup at vertical emittances of typically ~ 6 pm."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf12.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF12",
      "page_number": "837",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF14",
      "title": "A New Low Intensity Beam Profile Monitor for",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf14.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF14",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF15",
      "title": "High-Power Tests at CesrTA of X-ray Optics Elements for SuperKEKB",
      "authors": [
        "J.W. Flanagan",
        "A. Arinaga",
        "H. Fukuma",
        "H. Ikeda",
        "KEK",
        "Ibaraki",
        "Japan",
        "A. Lyndaker",
        "D.P. Peterson",
        "N.T. Rider",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "X-ray beam size monitors at SuperKEKB must withstand high",
        "sustained incident power loads. Two prototype optics elements were fabricated and tested at CesrTA",
        "using incident X-ray power densities comparable to those expected at the SuperKEKB LER. One element was based on a silicon substrate",
        "the other a CVD diamond substrate",
        "with each substrate supporting a coded aperture mask pattern in gold on its surface. The diamond substrate mask showed superior performance to the silicon substrate mask",
        "with the the mask pattern on the silicon substrate melting at the highest incident power level tested",
        "where the diamond-substrate mask survived. We will present here the high-power test results",
        "along with analysis of X-ray power absorption and heat transfer in the two prototype elements",
        "and the resulting implications for the design of the optics",
        "beam line and heat sink for SuperKEKB."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf15.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF15",
      "page_number": "844",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF17",
      "title": "Development of a Beam Profile Monitor using a Nitrogen-Molecular Jet for the J-PARC MR",
      "authors": [
        "Y. Hashimoto",
        "Y. Hori",
        "T. Toyama",
        "J-PARC",
        "KEK & JAEA",
        "Ibaraki-ken",
        "Japan",
        "T. Fujisawa",
        "T.M. Murakami",
        "K. Noda",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "T. Morimoto",
        "M. Uota",
        "KEK",
        "Ibaraki",
        "Japan",
        "Kyoto University",
        "Radioisotope Research Center",
        "Kyoto-shi",
        "Japan",
        "In order to measure a beam profile with a wide dynamic range covering the halo region around the core region of intense proton beams",
        "a non-destructive beam profile monitor using a sheeted jet beam of nitrogen molecules as a target has been developed for the beam of the J-PARC main ring (MR)*",
        "**. Two-dimensional detection of the beam core will be performed using de-excitation light of the nitrogen molecule. On the other hand",
        "beam halo will be detected using ionized electrons. In the detection of the electrons",
        "aμchannel plate (MCP) will be used for charge multiplication. To achieve a sensitivity of about 10-6",
        "a phosphor screen will be employed for the anode of the MCP",
        "and its light will be detected by photo-multiplier arrays for position resolving. Thus the beam core and halo will be detected simultaneously in this scheme. In this paper summaries of recent progress on the development are discussed as below: 1) the detection efficiency and accuracy in the measurement of the halo region",
        "2) simulation and experiment results of the high intensity jet beam of 5x10-4 Pa equivalent or more",
        "3) the specific design of the detector head in the collision point for J-PARC MR.",
        "* Y. Hashimoto",
        "et al.",
        "Proc. of IPAC’10",
        "Kyoto",
        "Japan",
        "p.987-989. ** Y. Hashimoto",
        "et al.",
        "Proc. of IBIC’12",
        "Tsukuba",
        "Japan."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf17.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF17",
      "page_number": "848",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF18",
      "title": "Zemax Simulations of Diffraction and Transition Radiation",
      "authors": [
        "T. Aumeyr",
        "P. Karataev",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "L.M. Bobb",
        "B. Bolzon",
        "T. Lefèvre",
        "S. Mazzoni",
        "CERN",
        "Geneva",
        "Switzerland",
        "Diffraction Radiation (DR) and Transition Radiation (TR) are produced when a relativistic charged particle moves in the vicinity of a medium or through a medium respectively. The target atoms are polarised by the electric field of the charged particle",
        "which then oscillate thus emitting radiation with a very broad spectrum. The spatial-spectral properties of DR/TR are sensitive to various electron beam parameters. Several projects aim to measure the transverse (vertical) beam size using DR or TR. This paper reports on how numerical simulations using Zemax can be used to study such a system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf18.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF18",
      "page_number": "852",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF21",
      "title": "Scanning Wire Beam Position Monitor for Alignment of a High Brightness Inverse-Compton X-ray Source",
      "authors": [
        "M.R. Hadmack",
        "E.B. Szarmes",
        "University of Hawaii",
        "Honolulu",
        "HI",
        "USA"
      ],
      "institutions": [
        "The Free-Electron Laser Laboratory at the University of Hawaii has constructed and tested a scanning wire beam position monitor to aid the alignment and optimization of a high spectral brightness inverse-Compton scattering X-ray source. X-rays are produced by colliding the 40 MeV electron beam from a pulsed S-band LINAC with infrared laser pulses from a mode-locked free-electron laser driven by the same electron beam. The electron and laser beams are focused to 60 micron diameters at the interaction point to achieve high scattering efficiency. This wire-scanner allows for high resolution measurements of the size and position of both the laser and electron beams at the interaction point to verify spatial coincidence. Time resolved measurements of secondary emission current allow us to monitor the transverse spatial evolution of the e-beam throughout the duration of a 4 microsecond macropulse while the laser is simultaneously profiled by pyrometer measurement of the occulted infrared beam. Using this apparatus we have demonstrated that the electron and laser beams can be co-aligned with a precision better than 10 microns as required to maximize X-ray yield."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf21.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF21",
      "page_number": "856",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF22",
      "title": "Non Invasive Optical Synchrotron Radiation Monitor Using a Mini-Chicane",
      "authors": [
        "R.B. Fiorito",
        "R.A. Kishek",
        "A.G. Shkvarunets",
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "D. Castronovo",
        "M. Cornacchia",
        "S. Di Mitri",
        "M. Veronese",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "MIT",
        "Middleton",
        "Massachusetts",
        "USA",
        "We are developing a design for a minimally perturbing mini-chicane which utilizes the optical synchrotron radiation (OSR) generated from magnetic bends to measure the rms emittance and other optical parameters of the beam. The beam is first externally focused at the first bend and the OSR generated there is used to image the beam. Subsequently",
        "any pair of bends produces interferences (OSRI) whose visibility can used to determine the beam divergence. The properties of different configuration of bends in the chicane have been analyzed to provide an optimum diagnostic design for a given set of beam parameters which: 1) provides a sufficient number of OSRI fringes to allow a measurement of the beam divergence; 2) minimizes the competing effect of energy spread on the fringe visibility; 3) minimizes the effect of coherent synchrotron radiation and space charge on the beam emittance; and 4) minimizes the effect of compression on the bunch length",
        "as the beam passes through the chicane. Diagnostic designs have been produced for 100-300 MeV beams with a normalized rms emittance of about 1 micron for application to Fermi@Elettra and similar high brightness free electron lasers."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf22.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF22",
      "page_number": "860",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF23",
      "title": "Beam Diagnostics R&D within oPAC",
      "authors": [
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "Optimization of particle accelerators by combining research into beam physics",
        "beam instrumentation",
        "accelerator control systems and numerical simulation studies is the goal of the oPAC project. Supported with 6 Million Euros by the European Union",
        "the network is one of the largest-ever Initial Training Networks. During the project's four year duration 22 fellows will be trained and a very broad international training program",
        "consisting of schools",
        "topical workshops and conferences will be organized by a consortium of currently more than 30 partner institutions. In this contribution",
        "we will give an overview of oPAC's broad beam diagnostics R&D program",
        "comprising absolute beam intensity measurements for low energy beams",
        "beam diagnostics for synchrotron light sources",
        "cyrogenic beam loss monitors",
        "beam halo monitoring and 3D dose measurements as part of intensity modulated radiotherapy treatment. We will also summarize past oPAC events and give an outlook on future events."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf23.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF23",
      "page_number": "864",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF24",
      "title": "Charge Monitors at the Relativistic Electron Gun for Atomic Exploration – REGAE",
      "authors": [
        "H. Delsim-Hashemi",
        "K. Flöttmann",
        "M. Seebach",
        "DESY",
        "Hamburg",
        "Germany",
        "Uni HH",
        "Hamburg",
        "Germany",
        "A new linac is commissioned at DESY mainly as the electron source for femtosecond electron diffraction facility REGAE (Relativistic Electron Gun for Atomic Exploration). REGAE comprises a photo-cathode gun followed by normal conducting 1.5 cell rf-cavity to provide sub pC charge electron-bunches of 2-5 MeV with a coherence length of 30nm. In order to produce and maintain such electron bunches",
        "sophisticated single-shot diagnostics are desired e.g. emittance",
        "energy",
        "energy-spread and bunch-length measurement. There are three methods at REGAE for charge measurement. The most routine method is based on Faraday-cups that are distributed along machine and can provide charge reading down to ~50 fC. The second method",
        "which is non-destructive",
        "is a cavity based antenna that measures beam induced fields. A third method is based on beam-profile measurement diagnostics. By proper calibration of integral intensity that arrives at detector one can measure charges down to fC level. The last method has the potential to reach the limit of few electrons charge when state-of-the-art intensifiers are used in profile monitors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf24.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF24",
      "page_number": "868",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF25",
      "title": "Resonator for Charge Measurement at REGAE",
      "authors": [
        "D. Lipka",
        "J. Lund-Nielsen",
        "M. Seebach",
        "DESY",
        "Hamburg",
        "Germany",
        "A resonator has been developed for the diagnostics of dark current and charge measurements at the European XFEL",
        "FLASH and PITZ. The first induced monopole mode TM01 at 1.3 GHz from charged bunches is used to detect the dark current and charge with high resolution at these accelerators. At REGAE this resonator with electronics is installed to detect the bunch charge because charges below pC are used and this device can resolve it non-destructively. The same electronics as for the dark current and charge measurement is used and the resolution is measured to be 2.3 fC for 200 fC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf25.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF25",
      "page_number": "872",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF26",
      "title": "Test Bench Experiments for Energy Measurement and Beam Loss of ESS-Bilbao",
      "authors": [
        "S. Varnasseri",
        "I. Arredondo",
        "D. Belver",
        "P. Echevarria",
        "M. Eguiraun",
        "ESS Bilbao",
        "Zamudio",
        "Spain",
        "Various test benches have been developed at ESS-Bilbao in order to characterize different beam diagnostics and control systems prior to their installation on various parts of the accelerator. One test bench includes time-of-flight (TOF) characterization for energy measurement using fast current transformers (FCT). Using FCTs for the TOF measurement would allow us to measure accurately the delay between two successive bunched or un-bunched beam pulses of low energy ions. The other test bench includes a beam loss monitoring and interlock system using ACCTs",
        "cRIO and PXI chassis with some acquisition modules and optical fiber link which represent a complete system of beam loss detection",
        "interlock logic and trigger signal transmission. Having an integration on the ACCT output also allows us to measure the beam charge at the location of monitoring. In the test benches the functionality of hardware and software",
        "the logic and required signal specifications like rise time",
        "jitters and delays are measured. An overview of test benches and their measurement results are reported in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf26.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF26",
      "page_number": "876",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF27",
      "title": "Coherent Ultraviolet Radiation Measurements of Laser Induced Bunching in a Seeded FEL",
      "authors": [
        "M. Veronese",
        "A. Abrami",
        "E. Allaria",
        "M. Ferianis",
        "E. Ferrari",
        "M. Trovò",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "ESRF",
        "Grenoble",
        "France"
      ],
      "institutions": [],
      "abstract": "Optimization of the bunching process in a seeded FEL like FERMI@Elettra is an important aspect for machine operation. In this paper we discuss about the power detection of coherent radiation in the UV range as a valuable method for optimizing the bunching induced by the seeding process on the electron beam. Experimental results obtained at FERMI@Elettra are presented here. Measurements of UV coherent transition and diffraction radiation have been used to quantify the bunching produced by the seed laser at lower laser harmonics. The dependence of the laser induced CUVTR signal on various parameters is experimentally studied. Future upgrades and possibilities for bunching measurements at shortest wavelengths are also discussed.",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf27.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF27",
      "page_number": "879",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF28",
      "title": "Longitudinal Beam Diagnostic from a Distributed Electrostatic Pick-Up in CERN’s ELENA Ring",
      "authors": [
        "M.E. Angoletta",
        "F. Caspers",
        "S. Federmann",
        "J.C. Molendijk",
        "P.J. Pascal Jean",
        "F. Pedersen",
        "J. Sanchez-Quesada",
        "L. Søby",
        "M.A. Timmins",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN Extra Low ENergy Antiproton (ELENA) Ring is a new synchrotron that will be commissioned in 2016 to further decelerate the antiprotons coming from CERN’s Antiproton Decelerator (AD). Required longitudinal diagnostics include the intensity measurement for bunched and debunched beam and the measurement of Dp/p for a debunched beam to assess the electron cooling performance. A novel method for the calculation of these parameters is proposed for ELENA",
        "where signals from the twenty electrostatic pick-ups (PU) used for orbit measurements will be combined to improve the signal-to-noise ratio. This requires that the signals be digitally down-converted",
        "rotated and digitally summed so that the many electrostatic PUs will function as a single",
        "distributed PU from to the processing system viewpoint. This method includes some challenges and will not be used as the baseline longitudinal diagnostics for the initial ELENA operation. This paper gives an overview of the hardware and digital signal processing involved",
        "as well as of the challenges that will have to be faced."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf28.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF28",
      "page_number": "883",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF29",
      "title": "The LHC Fast Beam Current Change Monitor",
      "authors": [
        "D. Belohrad",
        "J.M. Belleman",
        "L.K. Jensen",
        "M. Krupa",
        "A. Topaloudis",
        "CERN",
        "Geneva",
        "Switzerland",
        "The modularity of the Large Hadron Collider’s (LHC) machine protection system (MPS) allows for the integration of several beam diagnostic instruments. These instruments have not necessarily been designed to have protection functionality",
        "but MPS can still use them to increase the redundancy and reliability of the machine. The LHC fast beam current change monitor (FBCCM) is an example. It is based on analogue signals from fast beam current transformers (FBCT) used nominally to measure the LHC bunch intensities. The FBCCM calculates the magnitude of the beam signal provided by the FBCT",
        "looks for a change over specific time intervals",
        "and triggers a beam dump interlock if losses exceed an energy-dependent threshold. The first prototype of the FBCCM was installed in the LHC during the 2012-2013 run. The aim of this article is to present the FBCCM system and the results obtained",
        "analyse its current performance and provide an outlook for the final system which is expected to be operational after the long LHC shutdown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf29.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF29",
      "page_number": "887",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF30",
      "title": "System Overview and Preliminary Test Results of the ESS Beam Current Monitor System",
      "authors": [
        "H. Hassanzadegan",
        "A. Jansson",
        "ESS",
        "Lund",
        "Sweden",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "The ESS Linac will include in total 21 Beam Current Monitors",
        "mostly of ACCT type",
        "to measure the average current over the 2.86 ms beam pulse",
        "the pulse charge and the pulse profile. It is also planned to use a few Fast Current Transformers to check the performance of the fast beam choppers with a rise time as short as 10 ns. In addition to the absolute current measurement",
        "the BCM system needs to measure the differential beam current and act on the Machine Interlock System if the difference exceeds some thresholds. The differential current measurement is particularly important in the low energy part of the Linac",
        "where Beam Loss Monitors cannot reliably detect beam losses. This paper gives an overview of the ESS BCM system and presents some preliminary test results with a commercial ACCT and MTCA.4 electronics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf30.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF30",
      "page_number": "891",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF31",
      "title": "A FESA DAQ for Fast Current Transformer in SIS 18",
      "authors": [
        "O. Chorniy",
        "H. Bräuning",
        "T. Hoffmann",
        "H. Reeg",
        "A. Reiter",
        "GSI",
        "Darmstadt",
        "Germany",
        "This contribution presents the development of the data acquisition (DAQ) system for the readout of fast beam current transformers (FCT) as installed in the GSI synchrotron SIS18 and as foreseen in several FAIR ring accelerators. Fast current transformers are reliable devices that offer a large analogue bandwidth and can therefore monitor bunch structures with high resolution. At appropriate sampling rates continuous measurements throughout repeated machine cycles lead to a large amount of raw data. The analysis of those raw data may range from simple bunch parameter calculations to complex longitudinal phase space reconstructions. Consequently",
        "a new DAQ system must be carefully designed to allow for flexible acquisition modes or to allow for data reduction methods in special applications. The aims of the development are discussed and the status of the new DAQ is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf31.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF31",
      "page_number": "894",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF32",
      "title": "Measurement and Control of the Beam Energy for the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf32.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF32",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF33",
      "title": "Measurement and Control of the Beam Intensity for the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf33.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF33",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPF34",
      "title": "Accurate Measurement of Small Electron Beam Currents at the MLS Electron Storage Ring",
      "authors": [
        "R. Klein",
        "G. Brandt",
        "D. Herzog",
        "R. Thornagel",
        "PTB",
        "Berlin",
        "Germany",
        "The PTB",
        "the German metrology institute",
        "utilizes the electron storage ring MLS in Berlin Adlershof for the realization of the radiometric units in ultraviolet and vacuum ultraviolet spectral range. For this purpose the MLS can be operated as a primary source standard of calculable synchrotron radiation with very flexible parameters",
        "especially in terms of electron beam energy and electron beam current. We report on improvements in the measurement of the electron beam current in the nA and pA range. In this range the electron beam current can be very accurately measured by counting the stored electrons."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf34.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF34",
      "page_number": "903",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF35",
      "title": "Current Status of the Schottky Cavity Sensor for the CR at FAIR",
      "authors": [
        "M. Hansli",
        "R. Jakoby",
        "A. Penirschke",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "P. Hülsmann",
        "W. Kaufmann",
        "GSI",
        "Darmstadt",
        "Germany",
        "In this paper the current status of the Schottky Cavity Sensor development for the Collector Ring at FAIR",
        "a dedicated storage ring for secondary particles",
        "rare isotopes",
        "and antiprotons",
        "is presented. Designed for longitudinal and transversal Schottky signals",
        "the Sensor features a pillbox cavity with attached waveguide filters utilizing the Monopole mode at 200 MHz for longitudinal and the Dipole mode at around 330 MHz for transversal Schottky measurements. Separated coupling structures allow for mode-selective coupling to measure the different Schottky planes independently. A ceramic vacuum shielding inside the pillbox is implemented to enable non-hermetic adjustable coupling",
        "tuning devices and waveguide structures. Simulations of the structure with focus on the impact of the coupling structures and the ceramic vacuum shielding on the R-over-Q values and the coupling are presented as well as measurements of a scaled demonstrator including comparisons with the simulations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf35.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF35",
      "page_number": "907",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPF36",
      "title": "X-ray Cherenkov Radiation as a Source for Relativistic Charged Particle Beam Diagnostics",
      "authors": [
        "A.S. Konkov",
        "A.S. Gogolev",
        "A. Potylitsyn",
        "TPU",
        "Tomsk",
        "Russia",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "Recent progress in development of accelerator technology for future linear colliders and X-ray free electron lasers has generated an interest in developing novel diagnostics equipment with resolution surpassing the unique beam parameters. Cherenkov radiation (CR) in the X-ray region in the vicinity of the absorption edges is one of the promising sources for relativistic charged particle beam diagnostics. In this work we have demonstrated CR characteristics in the X-ray region significantly depend on the energy of the emitted photons",
        "because the CR is only generated in the frequency region in the vicinity of the atomic absorption edges",
        "where the well-known Cherenkov condition is work. This peculiarity can be explained by resonance behaviour of the permittivity in the frequency range. It will result in the fact that the CR will stand out of any other types of polarisation radiation both on intensity and shape of angular distribution giving a unique opportunity to apply this phenomenon for charged particle beam diagnostics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/wepf36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/wepf36.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/wepf36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-WEPF36",
      "page_number": "910",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 30,
  "scrape_time": "2025-10-10 18:01:20"
}