{
  "session_info": {
    "id": "MOKAB",
    "name": "MOKAB - Keynote Marian Petre",
    "url": "https://proceedings.jacow.org/ICALEPCS2013/html/mokab.htm"
  },
  "papers": [
    {
      "paper_id": "MOKAB01",
      "title": "Scientific Software Development as a Social Process",
      "authors": [
        "The Open University",
        "Milton Keynes",
        "United Kingdom",
        "Software development is often understood as an engineering process. However",
        "the factors that affect the success of a software development project are often human and social. The social context of software design and development is important: it provides social reinforcement for good practice. Study of high-performing software development teams makes it clear that the interplay between designers plays a crucial part both in nurturing creativity and innovation",
        "and in embedding systematic practice and rigor. This talk will present key observations from empirical studies of expert software development that can be applied usefully to scientific software development. It will discuss why matching development practices to the context and purpose of scientific software can improve both software and scientific outcomes. It will draw on research in order to discuss how communication and collaboration can be fostered",
        "and to identify what works (and what doesn’t work) in building collaboration in software development teams",
        "whether co-located or distributed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/mokab01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/mokab01.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/mokab01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-MOKAB01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:24:13"
}