{
  "session_info": {
    "id": "WECO",
    "name": "WECO - Feedback, Machine Characterization",
    "url": "https://proceedings.jacow.org/ibic2019/html/weco.htm"
  },
  "papers": [
    {
      "paper_id": "WECO01",
      "title": "Characterisation of Closed Orbit Feedback Systems",
      "authors": [
        "DLS",
        "Oxfordshire",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "Closed orbit feedback is applied at nearly all synchrotrons. Detailed investigations continue to be performed on the mathematical modelling of the spatial part (i.e. related to Orbit Response Matrix) and the dynamic part (i.e. the controller). This talk will serve as a summary of the ARIES workshop on closed orbit feedback organized by ALBA in November 2018. Benefits of recent advances compared to the traditional implementations will be highlighted.",
      "presentation_url": "https://proceedings.jacow.org/ibic2019/talks/weco01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2019/papers/weco01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2019/posters/weco01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2019-WECO01",
      "page_number": "479",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECO02",
      "title": "Towards an Adaptive Orbit-Response-Matrix Model for Twiss-Parameter Diagnostics and Orbit Correction at Delta",
      "authors": [
        "S. Koetter",
        "T. Weis",
        "DELTA",
        "Dortmund",
        "Germany",
        "At DELTA",
        "a 1.5-GeV electron storage ring operated by the TU Dortmund University",
        "preliminary tests of an adaptive orbit-response-matrix model were conducted. Closed orbit perturbations corrected by the slow orbit feedback can be buffered and used to update a fit of the bilinear-exponential model with dispersion (BE+d model). This model is a representation of the orbit-response matrix depending on the beta functions",
        "the betatron phases and the tunes in both planes. This work introduces a new fitting recipe to obtain good estimates of the aforementioned quantities and evaluates a BE+d-model represented orbit-response matrix for orbit correction. Numerical studies are shown along with measurement results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2019/talks/weco02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2019/papers/weco02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2019/posters/weco02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2019-WECO02",
      "page_number": "485",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECO03",
      "title": "Tune Computation via Model Fitting to Swept Machine Response Measurement",
      "authors": [
        "M.G. Abbott",
        "G. Rehm",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "At Diamond Light Source we compute the horizontal and vertical tunes by fitting a simple multi-pole resonator model to the measured electron beam frequency response. The transverse (and longitudinal) tune response is measured by sweeping an excitation across the range of possible tune frequencies and synchronously measuring the IQ response. The multi-pole resonator model is a good fit to the measured behaviour",
        "but the fitting process is surprisingly challenging. Problems include noisy measurements",
        "very complex beam responses in the presence of increasing chromaticity",
        "poor data when the beam is close to instability",
        "and a number of challenges with the stability of the algorithm. The tune fitting algorithm now in use at Diamond has been developed and refined over many years. It is finally stable enough to work reliably throughout most beam operating conditions. The algorithm involves alternating peak finding and non-linear fitting",
        "with a fairly naive mathematical approach; the main focus is on providing reliable results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2019/talks/weco03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2019/papers/weco03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2019/posters/weco03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2019-WECO03",
      "page_number": "490",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECO04",
      "title": "Commissioning of the Non-invasive Profile Monitors for the ESS LEBT",
      "authors": [
        "C.A. Thomas",
        "J. Etxeberria",
        "S. Haghtalab",
        "H. Kocevar",
        "N. Milas",
        "R. Miyamoto",
        "T.J. Shea",
        "R. Tarkeshian",
        "ESS",
        "Lund",
        "Sweden",
        "In the Low Energy Beam Transport (LEBT) of the European Spallation Source (ESS) Linac",
        "a specific Non-invasive Profile Monitor (NPM) has been designed to primarily monitor beam position monitor with 100 µm accuracy",
        "and in addition enable beam profile and size measurement. We present the first measurement results using NPM during the commissioning of the LEBT. The measurement results conclude the beam position as well as the angle of the beam. The performance of the measurement is discussed and compared to the required accuracy for the position measurement. In addition",
        "the profile of the beam along the propagation axis is reported",
        "as measured for part or the full pulse transported in the LEBT. The fidelity of the reported profile will be discussed as function of the system sensitivity and image signal to noise ratio."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2019/talks/weco04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2019/papers/weco04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2019/posters/weco04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2019-WECO04",
      "page_number": "495",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:45:13"
}