{
  "session_info": {
    "id": "MOPHO",
    "name": "MOPHO - Poster Session",
    "url": "https://proceedings.jacow.org/PAC2013/html/mopho.htm"
  },
  "papers": [
    {
      "paper_id": "MOPHO01",
      "title": "Creation of Gamma Radiation Using Anihilation of Channeled Positrons in Crystals",
      "authors": [
        "ANSL",
        "Yerevan",
        "Armenia",
        "A possibility of channeling of low-energy (5-20Mev) relativistic positrons with coaxial symmetry around separate crystal axes of negative ions in some types of crystals",
        "is shown. On the example of ionic crystal CsCl is calculated the influence of temperature on the character of effective potential of channeling. The principal causes of positrons de-channeling (the scattering on media electrons and annihilation processes) are investigated in details. The lifetime of a positron in the regime of channeling is estimated at 10-6 sec which is 108-109 times is bigger than at usual cases."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho01.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO01",
      "page_number": "231",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO02",
      "title": "How Acts Plane Wiggler Magnetic Field Inhomogeneity on the Spontaneous Radiation and the Gain",
      "authors": [
        "ANSL",
        "Yerevan",
        "Armenia",
        "A relativistic electron motion in a transversally inhomogeneous magnetic field of a wiggler is shown to consist of fast(undulator) and slow(strophotron) components. By separating fast and slow motions and by averaging equations of motion over fast undulator oscillations",
        "we find spectral intensity of strophotron spontaneous emission in such a system. By solving similarly equations of motion in the presence of an external light wave",
        "we find the gain in a Free-Electron Laser based on the interaction of light with the strophotron mode of the electron motion. Both the strophotron gain and the corresponding intensity of spontaneous emission are shown to be well separated spectrally from the usual undulator parts."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho02.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO02",
      "page_number": "234",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO03",
      "title": "Generation of  Intensive Transition Radiation in Modulated Medium",
      "authors": [
        "ANSL",
        "Yerevan",
        "Armenia",
        "The 3D spin-glass system in the external standing electromagnetic field is considered. It is shown on an example of amorphous quartz",
        "under the influence of a standing microwave field",
        "at its certain parameters",
        "superlattice is created in the medium where difference in values of dielectric constants of neighboring layers can be up to third order. Note that this superlattice exists during the nanosecond however it is sufficient for using it as a radiator for generation of transition radiation by relativistic electrons."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho03.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO03",
      "page_number": "237",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO04",
      "title": "Ultra-Low Emittance Light Source with a Torus-knot Type Accumulator Ring",
      "authors": [
        "A. Miyamoto",
        "S. Sasaki",
        "HSRC",
        "Higashi-Hiroshima",
        "Japan",
        "We proposed a torus knot type synchrotron radiation ring in that the beam orbit does not close in one turn but closes after multiple turns around the ring. This ring is capable to have many straight sections and it is advantageous to installation of many insertion devices. Currently",
        "we are designing a new ring based on the shape of a (11",
        "3) torus knot for our future plan ‘HiSOR-II.’ This ring is mid-low energy light source ring with a beam energy of 700 MeV. It has eleven 3.6-m-long straight sections though the ring diameter is as compact as 15 m. In late years",
        "some compact light source rings achieved very low emittance of several tens of nmrad. However for the ring we propose",
        "the emittance can be reached less than 10 nmrad when the multi-bend scheme is adopted to the arc section. With this ultra-low emittance",
        "the size and divergence of electron beam is smaller than the diffraction limited light in lower energy part of VUV region",
        "and it will be very useful for many synchrotron radiation users' experiments. We present the details of the lattice and the specifications of this ultra-low emittance light source ring having innovatively odd shape."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho04.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO04",
      "page_number": "240",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO05",
      "title": "Coupling and Brightness Considerations for the MAX IV 3 GeV Storage Ring",
      "authors": [
        "S.C. Leemann",
        "M. Eriksson",
        "MAX-lab",
        "Lund",
        "Sweden",
        "It is often suggested that the emittance coupling of a storage ring should be adjusted to the so-called diffraction limit corresponding to the shortest wavelength of interest. For 1 A radiation this leads to a typical requirement of 8 pm rad vertical emittance. In ultralow-emittance storage rings like the MAX IV 3 GeV storage ring this corresponds to a comparably large setting of the emittance coupling (2.5%). This approach",
        "however",
        "does not produce the brightest radiation and needs to be revisited taking into account that overall photon brightness depends on the emittances of the electron beam and the intrinsic photon beam. This paper summarizes an analytic approach to maximizing brightness as a function of emittance coupling while retaining sufficient lifetime. Instead of \"meeting the diffraction limit\"",
        "we further reduce the coupling",
        "thus increasing both the brightness and transverse coherence of the emitted radiation. We derive that reducing the MAX IV 3 GeV storage ring's vertical emittance to 2 pm rad (0.6% coupling) will increase brightness and transverse coherence by almost a factor two while 10 h overall lifetime can still be achieved."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho05.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO05",
      "page_number": "243",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO06",
      "title": "Simulation of Using Orbit Bumps to Test Sextupole Compensation for the Short Pulse X-ray System at the Advanced Photon Source",
      "authors": [
        "M. Borland",
        "V. Sajaev",
        "ANL",
        "Argonne",
        "USA",
        "As part of an ongoing upgrade of the Advanced Photon Source (APS)",
        "a Short Pulse X-ray (SPX) system is being developed based on two sets of crab cavities separated by 180 degrees vertical phase advance. Emittance growth due to incomplete cancellation between the sets of cavities is a concern. Simulations predict that it can be controlled by special adjustment of the sextupoles between the cavities. In order to test these predictions",
        "we can use orbit bumps that reproduce the trajectories of individual particles through the sectors in question. In this paper",
        "we present the results of simulations of such tests",
        "showing the degree to which the emittance growth and other properties of the machine will differ for optimized and unoptimized sextupoles."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho06.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO06",
      "page_number": "246",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO07",
      "title": "A Seven-bend-achromat Lattice as a Potential Upgrade for the Advanced Photon Source",
      "authors": [
        "M. Borland",
        "V. Sajaev",
        "Y. Sun",
        "ANL",
        "Argonne",
        "USA",
        "The Advanced Photon Source (APS) is a 7-GeV storage ring light source that has been in operation since 1996. In that time",
        "the emittance has dropped from 8 nm to 3 nm. The increasing feasibility of multi-bend-achromat lattices (e.g.",
        "the MAX-IV project) promises the possibility of a much greater reduction in emittance. In this paper",
        "we show the design of a symmetric seven-bend-achromat lattice",
        "including linear optics",
        "nonlinear dynamics optimization",
        "magnet requirements",
        "and performance with errors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho07.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO07",
      "page_number": "249",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO08",
      "title": "Various Canting Schemes for Utilizing More Than One Insertion Device in an Insertion Device Straight Section",
      "authors": [
        "V. Sajaev",
        "G. Decker",
        "L. Emery",
        "ANL",
        "Argonne",
        "USA",
        "Presently",
        "APS utilizes one simple canting scheme to separate radiation generated by two insertion devices (IDs) located in the same ID straight section. This scheme is based on triangular horizontal orbit bump with one corrector located between the IDs and orbit distortion limited to the ID straight section only. However",
        "this scheme does not allow for switching between the upstream and downstream devices",
        "nor does it allow for one beamline to accept the combined radiation of both devices. Yet these capabilities are being requested for the future APS Upgrade. In this paper",
        "we describe more advanced canting schemes that allow for these capabilities. The main complication here is that the orbit distortion is required to go through the storage ring magnets thus generating optics errors",
        "which have to be corrected."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho08.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO08",
      "page_number": "252",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO09",
      "title": "New Consideration for Insertion-Device Dipole-Error Perturbation Requirements When Including the Effects of Orbit Feedback",
      "authors": [
        "L. Emery",
        "V. Sajaev",
        "A. Xiao",
        "ANL",
        "Argonne",
        "USA",
        "Insertion devices (IDs) in light sources generally produce small dipole perturbations on the stored beam of a storage ring light source",
        "which is usually compensated by orbit correction. Tougher orbit stability requirements for the Advanced Photon Source Upgrade have led us to revisit the requirements of these magnetic-field errors. When including the effect of orbit correction (including fast orbit feedback)",
        "we realized that the field-error requirements change from a limit in absolute values of magnetic-field error integrals to that of rates of change in magnetic-field error integrals. Some modeling of the combined effect of ramping the strength of an ID with orbit correction will be presented. This new thinking has the potential of greatly alleviating the tuning requirements of insertion devices of all types."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho09.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO09",
      "page_number": "255",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO10",
      "title": "Optics Design and Beam Dynamics Optimization of a Five-bend Achromat Lattice for the Advanced Photon Source Upgrade",
      "authors": [
        "Y. Sun",
        "M. Borland",
        "ANL",
        "Argonne",
        "USA",
        "For the proposed APS upgrade",
        "an ultimate storage ring (USR) with very low emittance has been studied. In this paper",
        "one of the USRs’ lattice design is presented",
        "which is composed of five-bend achromat cells. The linear and non-linear optics are optimized using the MOGA technique. Beam performance and collective effects are also preliminarily evaluated."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho10.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO10",
      "page_number": "258",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO11",
      "title": "Linear Scaling on Choosing a Bunch Compression Ratio for an FEL Driver",
      "authors": [
        "ANL",
        "Argonne",
        "USA",
        "In this paper",
        "a proper initial bunch length as a function of the main RF frequency and RF phase is estimated analytically by several approaches",
        "assuming that no harmonic RF section is needed to linearize the energy modulation introduced during main RF acceleration. Next the upper limit of the bunch compression ratio in a single stage is evaluated analytically. The analytical relations derived on choosing a proper initial bunch length as a function of main RF frequency are confirmed by numerical simulation. These simple limit provide rough estimations and may be beneficial for choosing bunch compression ratios in different stages of an FEL driver",
        "especially in a first stage bunch compression where there is usually a harmonic RF linearization applied."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho11.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO11",
      "page_number": "261",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO12",
      "title": "Simulation of an X-band Hard X-ray FEL with LCLS Injector",
      "authors": [
        "ANL",
        "Argonne",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "In this note",
        "it is briefly discussed the accelerator design and start-to-end 3D macro particles simulation (using {\\small ELEGANT} and {\\small GENESIS}) of an X-band RF driven hard X-ray FEL with LCLS injector. A preliminary design and LiTrack 1D simulation studies were presented before in an older publication~[chris]. In numerical simulations this X-band RF driven hard X-ray FEL achieves/exceeds LCLS-like performance in a much shorter overall length of 350 m",
        "compared with 1200 m in the LCLS case. One key feature of this design is that it may achieve a higher final beam current of 5 kA plus a uniform energy profile",
        "mainly due to the employment of stronger longitudinal wake fields in the last X-band RF linac~[tor]."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho12.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO12",
      "page_number": "264",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO13",
      "title": "Achieving A Quasi Third Order Achromat in APS Upgrade Lattice",
      "authors": [
        "Y. Sun",
        "M. Borland",
        "ANL",
        "Argonne",
        "USA",
        "Next generation storage rings require stronger quadrupole focusing to achieve the very low emittance. Stronger sextupoles (usually at smaller dispersion locations) are then necessary to correct the natural chromaticity and head-tail instability. The geometric and chromatic optics abberations introduced by sextupoles have a large impact on the beam dynamics performance. In this paper",
        "it is discussed how to achieve quasi third order achromat in the APS multi-bend achromat (MBA) lattices. Repetitive identical MBA arc cells with specified phase advance and mirror symmetry are employed. The beam dynamics performance of such a design is compared with a normal design."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho13.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO13",
      "page_number": "267",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO14",
      "title": "Analytical Evaluation of Correlated Timing Jitter Cancellation in a Staged Bunch Compression System",
      "authors": [
        "ANL",
        "Argonne",
        "USA",
        "In this paper",
        "the wake field cancellation scheme on the timing jitter is revisited. The correlated timing jitter effects between the photoinjector laser and linac RF phase are evaluated analytically. It is possible to minimize its impact on the final bunch length (peak current) variation by employing a longer linac with a lower acceleration gradient",
        "between bunch compressor one and two."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho14.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO14",
      "page_number": "270",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO15",
      "title": "X-band FEL Driver Linac Design with Optics Linearization",
      "authors": [
        "ANL",
        "Argonne",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "T.O. Raubenheimer",
        "J. Wu",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "In this paper",
        "a compact hard X-ray FEL design is proposed with a single bunch charge of 250 pC",
        "which is based on all X-band RF acceleration and two stage bunch compression. It eliminates the need of a harmonic RF linearization section by employing optics linearization in its first stage bunch compression. Emittance growth in the horizontal plane due to CSR is investigated and minimized",
        "to be on a similar level with the LCLS. An electron bunch distribution at the linac end is taken as the input for an FEL simulation in GENESIS",
        "with a beam energy of 7 GeV. At an FEL radiation wavelength of 0.15 nm",
        "a saturation length of roughly 40 meters can be achieved by employing an undulator with a period of 1.5 cm. Without tapering",
        "an FEL radiation power above 10 GW is achieved with a photon pulse length of 50 fs",
        "which is LCLS-like performance. The overall length of the accelerator plus undulator is around 250 meters which is much shorter than the LCLS length of 1230 meters."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho15.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO15",
      "page_number": "273",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO17",
      "title": "NSLS II Commissioning Tools",
      "authors": [
        "G.M. Wang",
        "B. Bacha",
        "A. Blednykh",
        "E.B. Blum",
        "W.X. Cheng",
        "J. Choi",
        "L.R. Dalesio",
        "M.A. Davidsaver",
        "J.H. De Long",
        "R.P. Fliller",
        "G. George",
        "W. Guo",
        "K. Ha",
        "H.-C. Hseuh",
        "Y. Hu",
        "W. Louie",
        "M.A. Maggipinto",
        "J. Mead",
        "D. Padrazo",
        "T.V. Shaftan",
        "G. Shen",
        "K. Shroff",
        "O. Singh",
        "Y. Tian",
        "K. Vetter",
        "F.J. Willeke",
        "H. Xu",
        "L. Yang",
        "X. Yang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "P.B. Cheblakov",
        "A.A. Derbenev",
        "A.I. Erokhin",
        "S.M. Gurov",
        "R.A. Kadyrov",
        "S.E. Karnaev",
        "E.A. Simonov",
        "S.V. Sinyatkin",
        "V.V. Smaluk",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "NSLS-II is a state-of-the-art third-generation light source under construction at BNL. As many facilities worldwide",
        "NSLS II uses the EPICS control system to monitor and control all accelerator hardware. CSS is used for simple tasks such as monitoring",
        "display",
        "setting of PVs and browsing the historical data. For more complex accelerator physics applications",
        "a collection of scripts are mainly written in Python. The controls group developed the services",
        "such as channel finder",
        "machine snapshot",
        "data archiving",
        "twiss server",
        "unit conversion etc. This paper will present the tools that we have been using for commissioning."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho17.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO17",
      "page_number": "276",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO19",
      "title": "A Tunable Energy Chirp Correction",
      "authors": [
        "S.P. Antipov",
        "C.-J. Jing",
        "A. Kanareykin",
        "P. Schoessow",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "LETI",
        "Saint-Petersburg",
        "Russia",
        "M.G. Fedurin",
        "C. Swinson",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "W. Gai",
        "A. Zholents",
        "ANL",
        "Argonne",
        "USA"
      ],
      "institutions": [],
      "abstract": "Short (subpicosecond) pulses are central to many of the next generation light source initiatives that are based on linear accelerators. Beam compression is performed by means of a chicane utilizing a correlated linear energy chirp. The small energy chirp is kept as the beam goes through the remaining accelerating stage to compensate for wakefield effects. It is necessary to compensate the residual energy spread before the beam enters the undulator stage. We present here a concept for a passive wakefield device- the wakefield silencer- to perform this compensation. We have recently demonstrated a passive energy chirp correction by self-wakefield at the Brookhaven ATF facility. In this paper we present a progress report on development of these tunable chirp correction devices.",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho19.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO19",
      "page_number": "279",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO20",
      "title": "Demonstration of a Compact High Average Power THz Light Source at the IAC",
      "authors": [
        "Y. Kim",
        "B.L. Berls",
        "K. Folkman",
        "C. O'Neill",
        "J. Ralph",
        "IAC",
        "Pocatello",
        "IDAHO",
        "USA",
        "A. Andrews",
        "P. Buaphad",
        "C.F. Eckman",
        "ISU",
        "Pocatello",
        "Idaho",
        "USA",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "The Idaho Accelerator Center (IAC) has been operating nine low energy accelerators for THz and X-ray light sources",
        "nuclear physics",
        "and medical isotope generation. In November 2012",
        "the IAC and RadiaBeam collaborated to upgrade an IAC 44 MeV L-band RF linac with a chicane bunch compressor and a THz-radiator with periodic copper gratings for the wakefield radiation. In this paper",
        "we report our recent experimental demonstration of a high average power (~ 17 W range in the RF macropulse) sub-THz wakefield radiation from the THz radiator without using any sub-ps laser or undulator."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho20.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO20",
      "page_number": "282",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO22",
      "title": "Pseudo Single Bunch with Adjustable Frequency",
      "authors": [
        "C. Sun",
        "M.P. Hertlein",
        "J. Kirz",
        "M. Marcus",
        "G.J. Portmann",
        "D. Robin",
        "C. Steier",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "We present the concept and results of pseudo single bunch (PSB) operation–a new operational mode at the advanced light source–that can greatly expand the capabilities of synchrotron light sources to carry out dynamics and time-of-flight experiments. In PSB operation",
        "a single electron bunch is displaced transversely from the other electron bunches using a short-pulse",
        "high-repetition-rate kicker magnet. Experiments that require light emitted only from a single bunch can stop the light emitted from the other bunches using a collimator. Other beam lines will only see a small reduction in flux due to the displaced bunch. As a result",
        "PSB eliminates the need to schedule multibunch and timing experiments during different running periods. Furthermore",
        "the time spacing of PSB pulses can be adjusted from milliseconds to microseconds with a novel “kick-and-cancel” scheme",
        "which can significantly alleviate complications of using high-power choppers and substantially reduce the rate of sample damage."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho22.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO22",
      "page_number": "285",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO23",
      "title": "Initial Lattice Design Studies for a Diffraction Limited Upgrade of the Advanced Light Source",
      "authors": [
        "H. Tarawneh",
        "H. Nishimura",
        "D. Robin",
        "C. Steier",
        "C. Sun",
        "W. Wan",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The Advanced Light Source (ALS) at Berkeley Lab has seen many upgrades over the years",
        "keeping it one of the brightest sources for soft x-rays worldwide. Recent developments in magnet technology and lattice design appear to open the door for very large further increases in brightness [1]",
        "particularly by reducing the horizontal emittance",
        "even within the space constraints of the existing tunnel. We are investigating the possibility of a new storage ring lattice that could approach the soft x-ray diffraction limit around 2 keV in both planes within the ALS footprint. This note presents an overview of a candidate lattice for diffraction limited ALS and describes the optimization of the dynamical performance of the lattice. In addition on-axis injection scheme is foreseen for this ring and a candidate lattice for an accumulator ring",
        "which will be built and housed either in the ALS storage ring tunnel or the booster tunnel",
        "is also presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho23.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO23",
      "page_number": "288",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO25",
      "title": "Removal of Residual Chirp in Compressed Beams Using a Passive Wakefield Technique",
      "authors": [
        "M.A. Harrison",
        "G. Andonian",
        "T.J. Campese",
        "P. Frigola",
        "A.Y. Murokh",
        "F.H. O'Shea",
        "M. Ruelas",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The removal of residual chirp in XFELs is of paramount importance for efficient lasing. Although current S-band XFELs remove the unwanted residual chirp using off-crest acceleration after the final bunch compressor",
        "this technique is not possible for XFELs with soft X-ray lines as there are no further accelerating structures. The off-crest dechirping technique is also expensive for future superconducting XFELs. In response",
        "RadiaBeam Systems presents its work",
        "building upon the theoretical work of Bane and Stupakov*",
        "in RF-free residual chirp mitigation using only passive techniques. Beam-induced longitudinal wakefields are produced with opposing corrugated plates which allow for an entirely RF-free chirp removal. Theory",
        "engineering",
        "and experimental results are presented.",
        "* K.L.F. Bane",
        "G. Stupakov",
        "Nucl. Inst. Meth. 690 (2012) 106-110"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho25.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO25",
      "page_number": "291",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHO26",
      "title": "Laser-undulator FEL with Nearly Copropagating Laser Pulse",
      "authors": [
        "R.A. Bosch",
        "J. Bisognano",
        "M.A. Green",
        "K. Jacobs",
        "R. Wehlitz",
        "UW-Madison/SRC",
        "Madison",
        "Wisconsin",
        "USA",
        "T.-C. Chiang",
        "T.J. Miller",
        "University of Illinois",
        "Urbana",
        "USA",
        "J.E. Lawler",
        "D. Yavuz",
        "UW-Madison/PD",
        "Madison",
        "Wisconsin",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "A free-electron laser (FEL) may be obtained by interaction of an electron bunch and a nearly copropagating laser pulse",
        "where the laser pulse is sheared to extend the interaction length. When the angle between the electron beam axis and the propagation direction of the laser pulse greatly exceeds the reciprocal of the relativistic factor",
        "the output radiation is nearly on the axis",
        "and the FEL may be approximated by an axially aligned magnetostatic undulator. For a feasible laser-undulator FEL",
        "we calculate gain using a one-dimensional model",
        "as well as a three-dimensional model that includes degradation from diffraction and electron velocity spread."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopho26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopho26.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopho26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPHO26",
      "page_number": "294",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 22,
  "scrape_time": "2025-10-11 01:32:36"
}