{
  "session_info": {
    "id": "WEYD",
    "name": "WEYD - Advanced Acceleration",
    "url": "https://proceedings.jacow.org/napac2022/html/weyd.htm"
  },
  "papers": [
    {
      "paper_id": "WEYD1",
      "title": "Ultrahigh Energy Electrons From Laser Wakefield Accelerators",
      "authors": [
        "The University of Texas at Austin",
        "Austin",
        "Texas",
        "USA",
        "We report peak electron energies well in excess of 10 GeV from a laser wakefield accelerator. Proof-of-principle experiment have been performed at the Texas Petawatt laser using a 10 cm long gas cell filled with helium gas and seeded by metallic nanoparticles. Greater than 10 GeV electron energies have been observed repeatedly in multiple independent experiments. This results fulfill a major milestones in DOE’s Advanced Accelerator Strategy Report from 2016 and open up the potential of laser wakefield accelerators as high energy machines or as drivers for laser-driven XFELs. Compared with other wakefield acceleration schemes",
        "our scheme is straightforward since it requires only a gas cell and a source of nanoparticles for electron injection. No external guiding or heating mechanisms are employed. The nanoparticle-assisted laser wakefield acceleration can control all the electron beam parameters: charge",
        "energy spread",
        "energy",
        "emittance",
        "and the number of bunches in the beam. Bunch charges are on the order of a few nanocoulomb for the whole beam and in the 100s pC range in the high energy part",
        "an order of magnitude increase over previous results at greater than 5 GeV."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weyd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weyd1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weyd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEYD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEYD2",
      "title": "First Lasing of a Free-Electron Laser With a Compact Beam-Driven Plasma Accelerator",
      "authors": [
        "S. Romeo",
        "M. Galletti",
        "R. Pompili",
        "LNF-INFN",
        "Frascati",
        "Italy",
        "Plasma-based technology promises a revolution in the field of particle accelerators by pushing beams to GeV energies within centimeter distances and enabling the realization of ultra-compact facilities for user applications like Free-Electron Lasers (FEL). Here we report the first experimental evidence of FEL lasing by a compact (3 cm) particle beam-driven plasma accelerator. FEL radiation is observed in the infrared range with typical exponential growth of its intensity over six consecutive undulators. This achievement is based on the technique we recently developed for energy spread control during acceleration in plasma",
        "generating electron bunches with high-quality",
        "comparable with state-of-the-art accelerators. This proof-of-principle experiment represents an important milestone in the use of plasma-based accelerators contributing to the development of next-generation compact machines for user-oriented applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weyd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weyd2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weyd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEYD2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEYD3",
      "title": "Positron Acceleration in Linear, Moderately Non-Linear and Non-Linear Plasma Wakefields",
      "authors": [
        "G.J. Cao",
        "E. Adli",
        "University of Oslo",
        "Oslo",
        "Norway",
        "LOA",
        "Palaiseau",
        "France",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Accelerating particles to high energies with high efficiency and beam quality is crucial in developing accelerator technologies. The plasma acceleration technique",
        "providing unprecedented high gradients",
        "is considered as a promising future technology. While important progress has been made in plasma-based electron acceleration in recent years",
        "identifying a reliable acceleration technique for the positron counterpart would pave the way to a linear e+e− collider for high-energy physics applications. In this work",
        "we show further studies of positron beam quality in moderately non-linear (MNL)* plasma wakefields. With a positron bunch of initial energy 1 GeV",
        "emittance preservation can be achieved in optimised scenarios at 2.38 mm’mrad. In parallel",
        "asymmetric beam collisions at the interaction point (IP) are studied to evaluate the current luminosity reach and provide insight to improvements required for positron acceleration in plasma. It is necessary to scale down the emittance of the positron bunch. In the MNL regime",
        "a positron beam with 238 ’m’mrad level emittance implies compromise in charge or necessity for ultra-short bunches.",
        "* \"Efficiency and beam quality for positron acceleration in loaded plasma wakefields\"",
        "C. S. Hue",
        "G. J. Cao",
        "et.al Phys. Rev. Research 3",
        "043063"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weyd3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weyd3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weyd3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEYD3",
      "page_number": "560",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYD4",
      "title": "Design and Fabrication of a Metamaterial Wakefield Accelerating Structure",
      "authors": [
        "D.C. Merenich",
        "X. Lu",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "D.S. Doran",
        "X. Lu",
        "J.G. Power",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Metamaterials (MTMs) are engineered materials that can show exotic electromagnetic properties such as simultaneously negative permittivity and permeability. MTMs are promising candidates for structure-based wakefield acceleration structures",
        "which can mitigate the impact of radio frequency (RF) breakdown",
        "thus achieving a high gradient. Previous experiments carried out at the Argonne Wakefield Accelerator (AWA) successfully demonstrated MTM structures as efficient power extraction and transfer structures (PETS) from a high-charge drive beam. Here we present the design",
        "fabrication",
        "and cold test of an X-band MTM accelerator structure for acceleration of the witness beam in the two-beam acceleration scheme. The MTM structure design was performed using the CST Studio Suite",
        "with the unit cell and the complete multi-cell periodic structure both optimized for high gradient. Cold test of the fabricated structure shows good agreement with simulation results. Future work includes a beam test at AWA to study the short-pulse RF breakdown physics in the MTM structure",
        "as an important component towards a future compact linear collider based on two-beam acceleration."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weyd4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weyd4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weyd4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEYD4",
      "page_number": "564",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYD5",
      "title": "Highly Spin-Polarized Multi-GeV Sub-Femtosecond Electron Beams Generated From Single-Species Plasma Photocathodes",
      "authors": [
        "Z. Nie",
        "C. Joshi",
        "F. Li",
        "K.A. Marsh",
        "D. Matteo",
        "W.B. Mori",
        "N. Nambu",
        "F.S. Tsung",
        "Y.P. Wu",
        "C. Zhang",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "BNU",
        "Haidian District Beijing",
        "People’s Republic of China",
        "F. Morales",
        "S. Patchkovskii",
        "O. Smirnova",
        "MBI",
        "Berlin",
        "Germany",
        "High-gradient and high-efficiency acceleration in plasma-based accelerators has been demonstrated",
        "showing its potential as the building block for a future collider operating at the energy frontier of particle physics. However",
        "generating and accelerating the required spin-polarized beams in such a collider using plasma-based accelerators has been a long-standing challenge. Here we show that the passage of a highly relativistic",
        "high-current electron beam through a single-species (ytterbium) vapor excites a nonlinear plasma wake by primarily ionizing the two outer 6s electrons. Further photoionization of the resultant Yb2+ ions by a circularly polarized laser injects the 4f14 electrons into this wake generating a highly spin-polarized beam. Combining time-dependent Schrodinger equation simulations with particle-in-cell simulations",
        "we show that a sub-femtosecond",
        "high-current (4 kA) electron beam with up to 56% net spin polarization can be generated and accelerated to 15 GeV in just 41 cm. This relatively simple scheme solves the perplexing problem of producing spin-polarized relativistic electrons in plasma-based accelerators."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weyd5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weyd5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weyd5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEYD5",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEYD6",
      "title": "Design of a PIP-II Era Mu2e Experiment",
      "authors": [
        "M.A. Cummings",
        "R.J. Abrams",
        "R.P. Johnson",
        "T.J. Roberts",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "We propose a design of an upgraded Mu2e experiment for the future Fermilab PIP-II era based on the muon collider front end. The consensus is that such an upgrade should provide a factor of 10 increase in the rate of stopping muons in the experimental target. The current Mu2e design is optimized for 8 kW of protons at 8 GeV. The PIP-II upgrade project is a 250-meter-long CW linac capable of accelerating a 2-mA proton beam to a kinetic energy of 800 MeV (total power 1.6 MW). This would significantly improve the Fermilab proton source to enable next-generation intensity frontier experiments. But using this 800 MeV beam poses challenges to the Mu2E experiment. Bright muon beams generated from sources designed for muon collider and neutrino factory facilities have been shown to generate two orders of magnitude more muons per proton than the current Mu2e production target and solenoid. In contrast to the current Mu2e",
        "the muon collider design has forward-production of muons from the target."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weyd6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weyd6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weyd6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEYD6",
      "page_number": "568",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:21:17"
}