{
  "session_info": {
    "id": "TUPA",
    "name": "TUPA - Tuesday Poster A",
    "url": "https://proceedings.jacow.org/ibic2018/html/tupa.htm"
  },
  "papers": [
    {
      "paper_id": "TUPA01",
      "title": "Pin Diode in a Medical Accelerator - a Proof of Principle and Preliminary Measurements",
      "authors": [
        "A. Pozenel",
        "M. Eichinger",
        "S. Enke",
        "M. Fürtinger",
        "C. Kurfürst",
        "M. Repovž",
        "EBG MedAustron",
        "Wr. Neustadt",
        "Austria",
        "The MedAustron Ion Therapy Center located south of Vienna",
        "Austria",
        "is a cancer treatment facility utilizing a particle therapy accelerator optimized for protons and carbon ions. The beam is injected into the synchrotron",
        "accelerated to the desired speed and extracted to be guid-ed into one of four irradiation rooms. During extraction a certain amount of particles is lost which is measured with a PIN diode. In this paper the measurement method of this system is presented",
        "as well as some measurement attempts documented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/tupa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/tupa01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/tupa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-TUPA01",
      "page_number": "208",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPA02",
      "title": "A Micromegas Based Neutron Detector for the ESS Beam Loss Monitoring",
      "authors": [
        "L. Segui",
        "H. Alves",
        "S. Aune",
        "J. Beltramelli",
        "Q. Bertrand",
        "T. Bey",
        "M. Combet",
        "D. Desforge",
        "F. Gougnaud",
        "T.J. Joannem",
        "M. Kebbiri",
        "C. Lahonde-Hamdoun",
        "P. Le Bourlout",
        "Ph. Legou",
        "O. Maillard",
        "J. Marroncle",
        "V. Nadot",
        "T. Papaevangelou",
        "G. Tsiledakis",
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "I. Dolenc Kittelmann",
        "T.J. Shea",
        "ESS",
        "Lund",
        "Sweden",
        "CEA-DRF-IRFU",
        "France",
        "Beam loss monitors are of high importance in high-intensity hadron facilities where any energy loss can produce damage or/and activation of materials. A new type of neutron BLM have been developed for hadron accelerators aiming to cover the low energy part. In this region typical BLMs based on charged particle detection are not appropriate because the expected particle fields will be dominated by neutrons and photons. Moreover",
        "the photon background due to the RF cavities can produce false beam loss signals. The BLM proposed is based on gaseous Micromegas detectors",
        "designed to be sensitive to fast neutrons and insensitive to photons (X and gamma). In addition",
        "the detectors will be insensitive to thermal neutrons",
        "since part of them will not be directly correlated to beam loss location. The appropriate configuration of the Micromegas operating conditions will allow excellent timing",
        "intrinsic photon background suppression and individual neutron counting",
        "extending thus the dynamic range to very low particle fluxes. The concept of the detectors and the first results from tests in several facilities will be presented. Moreover",
        "their use in the nBLM ESS system will be also discussed"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/tupa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/tupa02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/tupa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-TUPA02",
      "page_number": "211",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPA03",
      "title": "Test of New Beam Loss Monitors for SOLEIL",
      "authors": [
        "N. Hubert",
        "M. El Ajjouri",
        "D. Pédeau",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "Soleil is currently testing new beam loss monitors to replace its pin-diode based existing system. The new detectors are made of plastic scintillators associated with photomultiplier and connected to Libera BLM dedicated electronics. This new detector should provide both fast (turn by turn) and slow (averaged) loss measurements",
        "post mortem capabilities and should be less sensitive to the beam directivity compared to the pin-diodes. Different methods for a relative calibration of the modules are under investigation",
        "either using a diode (LED) or a cesium radioactive source. Calibration results and first measurements with beam are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/tupa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/tupa03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/tupa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-TUPA03",
      "page_number": "215",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPA04",
      "title": "Analysis of Interlocked Events based on Beam Instrumentation Data at J-PARC Linac and RCS",
      "authors": [
        "N. Hayashi",
        "S. Hatakeyama",
        "A. Miura",
        "M. Yoshimoto",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "K. Futatsukawa",
        "T. Miyao",
        "KEK",
        "Ibaraki",
        "Japan",
        "J-PARC is a multi-purpose facility. Accelerator stability is the one of important issues for users of this facility. To realize stable operation",
        "we must collect data on interlocked events and analyze these data to determine the reasons for the occurrence of such events. In J-PARC Linac",
        "data of interlocked events have been recorded using several some beam loss monitors and current monitors",
        "and these data have been are analyzed and classified. In J-PARC RCS",
        "new instrumentation is being introduced to obtain beam position. We discuss the present status and future plans related to this subject."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/tupa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/tupa04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/tupa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-TUPA04",
      "page_number": "219",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPA07",
      "title": "Collimator for Beam Position Measurement and Beam Collimation for Cyclotron",
      "authors": [
        "L.X. Hu",
        "Y. Chen",
        "K.Z. Ding",
        "J. Li",
        "Y. Song",
        "Q. Yang",
        "ASIPP",
        "Hefei",
        "People’s Republic of China",
        "Y.C. Wu",
        "K. Yao",
        "HFCIM",
        "HeFei",
        "People’s Republic of China",
        "In order to restrict the beam dispersion and diffusion at the extraction area of the cyclotron and to detect abnormal beam loss",
        "a beam collimator system has been designed to collimate the beam and to measure its transverse positions. The collimator system is composed of a vacuum cavity",
        "two pairs of beam targets",
        "a set of driving and supporting mechanism",
        "and a measurement and control unit. The beam target with the size determined by the diameter of the beam pipe",
        "the particle energy and beam intensity",
        "will generate current signal during particle deposition. Each pair of beam targets has bilateral blocks which forms a slit in either horizontal or vertical direction. Servo motor and screw rod are used so that the target can reciprocate with the repeatability of less than 0.1mm. The measurement and control system based on LabVIEW can realize the motion control and current measurement of the targets and then calculate the beam transverse positions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/tupa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/tupa07.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/tupa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-TUPA07",
      "page_number": "224",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPA08",
      "title": "Arc Discharge Detectors for the CiADS Superconducting RF Cavities",
      "authors": [
        "Z.P. Xie",
        "Y.K. Ding",
        "J. Liang",
        "H. Liu",
        "Hohai University",
        "Nanjing",
        "People’s Republic of China",
        "Y. He",
        "Y.M. Li",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "Arc discharge due to the electron emission is one of the key issues in the CW superconducting RF(SRF) for the CiADS particle accelerator. Arc discharges can deteriorate the SRF cavities and damage the facility. Monitoring arc discharges is important for the purpose of machine protection. In this paper",
        "an arc discharge detector has been designed to provide fast response upon events of arc discharge using open-source hardware and LabVIEW software. Electronic design techniques are described to enhance the system stability while utilizing the flexibility of embedded electronics. The proposed detector system gives about 700 ns of response time and it employs a LabVIEW based graphic user interface. The system has the capability of detecting the instantaneous arc discharge events in real time. Timestamps of the event will be recorded to assist beam diagnostics. This paper describes the hardware/software implementation and concludes with initial results of tests at CiADS."
      ],
      "institutions": [
        "Funding: Work supported by the National Natural Science Foundation of China (Grant No.11505255, No.91026001) and the Fundamental Research Funds for the Chinese Central Universities(2015B29714)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/tupa08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/tupa08.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/tupa08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-TUPA08",
      "page_number": "228",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPA09",
      "title": "The Monte Carlo Simulation for the Radiation Protection in a Nozzle of HUST-PTF",
      "authors": [
        "Y.C. Yu",
        "H.D. Guo",
        "Y.Y. Hu",
        "X.Y. Li",
        "Y.J. Lin",
        "P. Tan",
        "L.G. Zhang",
        "HUST",
        "Wuhan",
        "People’s Republic of China",
        "Nozzle is the core component in proton therapy machine",
        "which is closest to the patient and is necessary to consider the radiation impacts on patients and machine. The ionization chamber and the range shifter in active scanning nozzle are the main devices in the beam path that affect the proton beam and produce secondary particles during the collision",
        "causing damage to the patients and machine. In this paper",
        "the spatial distribution of energy deposited in all regions",
        "the distribution of the secondary particles of 70-250MeV proton beam in the nozzle in Huazhong University of Science and Technology Proton Therapy Facility(HUST-PTF) are studied with Monte Carlo software FLUKA in order to provide reference for radiation shielding design. Six types of materials commonly used today as range shifters are analyzed in terms of the influence on radiation",
        "so that the most suitable material will be selected."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/tupa09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/tupa09.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/tupa09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-TUPA09",
      "page_number": "232",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPA14",
      "title": "Beam Loss Monitoring in the ISIS Synchrotron Main Dipole Magnets",
      "authors": [
        "D.M. Harryman",
        "S.A. Fisher",
        "W.A. Frank",
        "B. Jones",
        "A. Perticapresenter",
        "D.W. Posthuma de Boer",
        "C.C. Wilcox",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Beam loss monitoring at the ISIS Neutron and Muon Source is primarily carried out with the use of gas ionisation chambers filled with argon. These chambers are 3 to 4m long and are positioned around the inside of the synchrotron as well as along the ISIS Linac and Extracted Proton Beamlines (EPBs). To achieve finer spatial resolution a programme has been implemented to install six scintillator Beam Loss Monitors (BLMs)",
        "each 300 mm long",
        "inside each of the ten main dipole magnets. Using these scintillator BLMs the accelerator can be fine-tuned during set-up to reduce areas of beam loss that were previously unseen or hard to characterise. As the installation programme comes to an end",
        "this paper will review: the installation of the scintillator BLMs",
        "the electronic hardware and software used to control them",
        "and the initial measurements that have been taken using them."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/tupa14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/tupa14.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/tupa14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-TUPA14",
      "page_number": "236",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPA15",
      "title": "Adaptive Collimator Design for Future Particle Accelerators",
      "authors": [
        "T.R. Furness",
        "S. Fletcher",
        "J.F. Williamson",
        "University of Huddersfield",
        "Huddersfield",
        "United Kingdom",
        "A. Bertarelli",
        "F. Carra",
        "L. Gentini",
        "M. Pasquali",
        "S. Redaelli",
        "CERN",
        "Geneva",
        "Switzerland",
        "The function of collimators in the LHC is to control and safely dispose of the halo particles that are produced by unavoidable beam losses from the circulating beam. Even tiny proportions of the 7TeV beam have the stored energy to quench the superconducting magnets or damage parts of the accelerator if left unchecked. Particle absorbing Low-Z material make up the active area of the collimator (jaws). Various beam impact scenarios can induce significant temperature gradients that cause deformation of the jaws. This can lead to a reduction in beam cleaning efficiency which can have a detrimental effect on beam dynamics. This has led to research into a new Adaptive collimation system (ACS). The ACS is a re-design of a current collimator already in use at CERN. The ACS will incorporate a novel fibre based measurement system and piezoceramic actuators mounted within the body of the collimator to maintain jaw straightness below the 100µm specification. These two systems working in tandem can monitor",
        "and correct for",
        "the jaw structural deformation for all impact events. This paper details the concept and technical solutions of the ACS as well as preliminary validation calculations."
      ],
      "institutions": [
        "Funding: This work has recevied funding from the Science & Technology Facilities Council (STFC) and, the European Organization for Nuclear Research (CERN)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/tupa15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/tupa15.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/tupa15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-TUPA15",
      "page_number": "240",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPA16",
      "title": "Signal Processing for Beam Loss Monitor System at Jefferson Lab",
      "authors": [
        "J. Yan",
        "T.L. Allison",
        "S. Bruhwel",
        "W. Lu",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Ion Chamber and Photomultiplier Tube (PMT) were both used for beam loss monitor in the Machine Protection System (MPS) at Jefferson Lab. The requirements of signal processing of these detectors are different",
        "so two VME-based signal processing boards",
        "Beam Loss Monitor (BLM) board and Ion-Chamber board",
        "were developed. The BLM board has fast response (< 1us) and 5 decades dynamic range from 10nA to 1 mA",
        "while the Ion-Chamber board has 8 decades dynamic range from 100 pA to 10 mA and slower response. Both of boards provide functions of machine protection and beam diagnostics",
        "and have features of fast shutdown (FSD) interface",
        "beam sync interface",
        "built-in-self-test",
        "remotely controlled bias signals",
        "and on-board memory buffer."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/tupa16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/tupa16.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/tupa16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-TUPA16",
      "page_number": "245",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPA17",
      "title": "Status of the BNL LEReC Machine Protection System",
      "authors": [
        "S. Seletskiy",
        "Z. Altinbas",
        "D. Bruno",
        "M.R. Costanzo",
        "K.A. Drees",
        "A.V. Fedotov",
        "D.M. Gassner",
        "X. Gu",
        "L.R. Hammons",
        "J. Hock",
        "R.L. Hulsart",
        "P. Inacker",
        "J.P. Jamilkowski",
        "D. Kayran",
        "J. Kewisch",
        "C. Liu",
        "K. Mernick",
        "T.A. Miller",
        "M.G. Minty",
        "M.C. Paniccia",
        "W.E. Pekrul",
        "I. Pinayev",
        "V. Ptitsyn",
        "V. Schoefer",
        "L. Smart",
        "K.S. Smith",
        "R. Than",
        "P. Thieberger",
        "J.E. Tuozzolo",
        "W. Xu",
        "Z. Zhao",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The low energy RHIC Electron Cooler (LEReC) will be operating with 1.6-2.6 MeV electron beams having up to 140 kW power. It was determined that under the worst case scenario the missteered electron beam can damage the vacuum chamber and in-vacuum components within 40 us. Hence",
        "the LEReC requires a dedicated fast machine protection system (MPS). The LEReC MPS has been designed and built and currently is under commissioning. In this paper we describe the most recent developments with the LEReC MPS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/tupa17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/tupa17.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/tupa17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-TUPA17",
      "page_number": "249",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 11,
  "scrape_time": "2025-10-10 17:46:56"
}