{
  "session_info": {
    "id": "WEPP",
    "name": "WEPP - Wednesday Poster Session",
    "url": "https://proceedings.jacow.org/ibic2020/html/wepp.htm"
  },
  "papers": [
    {
      "paper_id": "WEPP01",
      "title": "Filling Pattern Measurement Using a 500 MHz Digitizer at Soleil and APS Storage Rings",
      "authors": [
        "D. Bisiach",
        "M. Cargnelutti",
        "P. Leban",
        "M. Žnidarčič",
        "I-Tech",
        "Solkan",
        "Slovenia",
        "A.R. Brill",
        "N. Sereno",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "N. Hubert",
        "D. Pédeau",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France"
      ],
      "institutions": [],
      "abstract": "Filling pattern was measured at SOLEIL and APS storage ring using a 500 MHz digitizer. Various filling patterns were measured: from a single bunch to multi-bunch hybrid fill. The digitizer has 14-bit granularity and locks the sampling clock to exact RF frequency (352 MHz). Signals were sampled from the standard BPM pickup and from APD diode. Data were retrieved using Matlab and Labview interfaces and compared to existing systems.",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP01",
      "page_number": "96",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP02",
      "title": "CIEL: Current Injection Efficiency and Lifetime",
      "authors": [
        "R. Broucquart",
        "M. El Ajjouri",
        "N. Hubert",
        "D. Pédeau",
        "S. Poirier",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "NEXEYA Systems",
        "La Couronne",
        "France",
        "We will introduce a new acquisition system for storage ring beam current monitor. It is based on the co-developped PandBox electronics",
        "associated with a 24 bits 128kS/s ADC. It offers the possibility of fast",
        "triggered captures to measure injected current even during bursted injections. We’ll show the results of the first tests and the integration of this new measure."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "WEPP03",
      "title": "Bunch Purity Measurement for SSRF",
      "authors": [
        "B. Gao",
        "S.S. Cao",
        "Y.B. Leng",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "L.W. Lai",
        "X.Q. Liu",
        "SARI-CAS",
        "Pudong",
        "Shanghai",
        "People’s Republic of China",
        "SSRF is currently working on the beam line phase-II project",
        "which has moved toward laser/x-ray pump-probe experiments. In order to quantify the bunch pattern and charge purity of the probe pulse",
        "a bunch purity monitor based on the time-correlated single-photon counting system has been installed. This system has very good time resolution of 22ps",
        "and high dynamic range of more than seven orders of magnitude. In this paper",
        "system setup",
        "system evaluation and optimization process，a series of experimental studies and initial application will be described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP03",
      "page_number": "99",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP04",
      "title": "Modernization and Operation of Ionization-proportional Gas Counter at INR RAS Proton Linac",
      "authors": [
        "A.A. Melnikov",
        "S.A. Gavrilov",
        "RAS/INR",
        "Moscow",
        "Russia",
        "S.A. Gavrilov",
        "A.A. Melnikov",
        "MIPT",
        "Dolgoprudniy",
        "Moscow Region",
        "Russia",
        "Multianode gas counter is used as a detector for low intensity proton beam diagnostics at INR RAS linac. The device consists of ionization chamber to measure beam current and two proportional chambers",
        "based on stripe geometry",
        "to measure beam profiles. The data is processed with Labview software. The models and methods predicting operational characteristics of the counter in ionization and proportional mode are presented. An analytical model of recombination was tested to predict the saturation voltage for ionization mode. Beam test results and operational characteristics of the counter are presented as well as results of investigations of counter degradation under the beam. A new design of a gas filled counter is also discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP04",
      "page_number": "103",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP05",
      "title": "Reentrant Cavity Resonator as a Beam Current Monitor (BCM) for a Medical Cyclotron Facility",
      "authors": [
        "S. Srinivasan",
        "P.-A. Duperrex",
        "J.M. Schippers",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "At PSI",
        "a dedicated proton therapy facility",
        "with a superconducting cyclotron",
        "delivers 250 MeV beam energy",
        "pulsed at 72.85 MHz. The measurement of beam currents (0.1-10 nA) is generally performed by ionisation chambers (ICs)",
        "but at the expense of reduced beam quality",
        "and scattering issues. There is a strong demand to have an accurate signal with a minimal beam disturbance. A cavity resonator",
        "on fundamental resonance mode",
        "has been built for this purpose. The cavity",
        "coupled to the second harmonic of the pulse rate",
        "provides signals proportional to the beam current. It is installed in a beamline to measure for the energy range 238-70 MeV. Good agreement is reached between the expected and measured sensitivity of the cavity. The cavity delivers information for currents down to 0.15 nA with a resolution of 0.05 nA when integrated over one second. Its application is limited to a machine-safety monitor to trigger inter-locks",
        "within the existing domain of the proton therapy due to the low beam current limits. With new advancements in proton therapy",
        "especially FLASH",
        "the cavity resonator’s application as an online beam-monitoring device is feasible."
      ],
      "institutions": [],
      "abstract": "*Instruments 2018, 2(4), 24; https://doi.org/10.3390/instruments2040024",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp05.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP05",
      "page_number": "107",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP06",
      "title": "Investigation of an Optical-Fiber Based Beam Loss Monitor at the J-PARC Extraction Neutrino Beamline",
      "authors": [
        "S.V. Cao",
        "M.L. Friend",
        "KEK",
        "Tsukuba",
        "Japan",
        "Optical fibers",
        "which at once generate and guide Cherenkov light when charged particles pass through them",
        "are widely used to monitor the beam loss at accelerator facilities. In this report",
        "we investigate this application at the J-PARC extraction neutrino beamline",
        "where a 30GeV proton beam with eight bunches of ~20ns (1σ) bunch width and 581ns bucket length",
        "is extracted from the Main Ring",
        "guided",
        "and hit onto a graphite target to produce a highly intense beam of neutrinos. Three 30m-length 200um-core-diameter optical fibers",
        "which are arranged flexibly to form 60m or 90m length fibers",
        "were installed in the beamline. The beam loss signal was observed with the Muti-Pixel Photon Counters. We will discuss the result and prospects of using optical fibers for monitoring and locating the beam loss source."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp06.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP06",
      "page_number": "110",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP07",
      "title": "The Insertable Beam Stop in the ESS SPK Section",
      "authors": [
        "E.M. Donegani",
        "T.J. Grandsaert",
        "T.J. Shea",
        "C.A. Thomas",
        "ESS",
        "Lund",
        "Sweden",
        "This paper deals with the Insertable Beam Stop (IBS) to be installed at the transition between the normal conducting and superconducting sections of the ESS linac. The IBS will be used to avoid beam losses in the cryogenic cavities during tuning and commissioning of the ESS linac. The IBS will stop protons in the energy range from 73 MeV to 92 MeV. The proton beam has a current up to 62.5 mA",
        "and 50·10-6 or 5E-6s long pulses at a rate of 1 or 14 Hz",
        "respectively. Firstly",
        "the IBS was designed in MCNPX/ANSYS to withstand thermal and structural stresses",
        "while minimizing neutron production and limiting the deposited power in the cryogenic cavities below 0.2 W/m. Secondly",
        "the prompt background and residual dose in the vicinity of the IBS were computed",
        "as well as the activation of the IBS components themselves. Finally",
        "a feasibility study was performed to determine if the IBS can be profitably used as a beam-profile monitoring device. The results will serve as input for calculations of the expected signal in beam loss monitors. Moreover",
        "they will enable the design of the nearby shielding limiting the activation of surrounding structures and allowing maintenance works."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp07.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP07",
      "page_number": "114",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP09",
      "title": "New Beam Loss Monitor System at SOLEIL",
      "authors": [
        "N. Hubert",
        "A. Bence",
        "M. El Ajjouri",
        "D. Pédeau",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "SOLEIL has recently upgraded its Beam Loss Monitor (BLM) system from pin-diode detectors to plastic scintillators associated with photosensor modules. This new kind of monitor",
        "associated to its dedicated electronics",
        "is able to measure slow or fast losses. Monitors have been carefully calibrated with a Cesium source",
        "and installed at systematic locations on the storage ring to provide reliable loss amplitude comparison between them. SOLEIL storage ring is now equipped with 80 BLMs. Installation setup",
        "calibration procedure and resulting measurements will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp09.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP09",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "WEPP10",
      "title": "Proton-Induced SEY From Beam Interceptive Devices in the ESS Linac",
      "authors": [
        "ESS",
        "Lund",
        "Sweden",
        "During the ESS linac commissioning",
        "a wealth of beam-interceptive devices will be exposed to protons with nominal and non-nominal energies spanning from 75 keV to 2 GeV. Therefore",
        "a database of proton-induced Secondary Emission Yield (SEY) values was prepared for the structural materials of insertable devices into the ESS linac. The database relies on calculations of stopping powers in MCNPX and the Sternglass theory applied to protons in the [1 keV",
        "2 GeV] energy range. Results are reported for 16 relevant materials to wire scanners",
        "bunch shape monitors and target imaging systems",
        "including: TZM",
        "Ni",
        "SiC and graphite of various densities. In the future",
        "the results can be used also for determining the impact of secondaries on emittance or beam-current measurements with Emittance Monitor Units or Faraday cups of the ESS linac",
        "respectively. Moreover",
        "the database can be extended to critical structural materials of the ESS linac itself",
        "in order to estimate the impact of secondary electrons on the overall beam quality."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp10.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP10",
      "page_number": "117",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP11",
      "title": "Analysis of the Bunch Position Monitoring in Long Bunch Trains at FLASH",
      "authors": [
        "N. Baboi",
        "B. Lorbeer",
        "DESY",
        "Hamburg",
        "Germany",
        "Multi-bunch beams are routinely being accelerated at the FLASH Free Electron Laser at DESY",
        "Hamburg. More than hundred Beam Position Monitors (BPMs) measure the transverse offset of every single bunch in each train with a bunch repetition frequency of up to 1 MHz and a length of several hundreds of microseconds. Various types of monitors are being used: button",
        "stripline and cavity BPMs",
        "each type with several designs. The performance differs from type to type",
        "with resolutions from one to tens of micrometers. However so far only the first bunch in the train was investigated in detail. In this paper we study every bunch along long bunch train for several BPM designs and locations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp11.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP11",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "WEPP12",
      "title": "Simulation of the Signal Processing for the New Interaction Region BPMs of the High Luminosity LHC",
      "authors": [
        "JAI",
        "Oxford",
        "United Kingdom",
        "A. Boccardi",
        "M. Krupa",
        "M. Wendt",
        "CERN",
        "Geneva",
        "Switzerland",
        "New stripline beam position monitors (BPMs) will be installed at the Interaction Regions of the ATLAS and CMS experiments as part of the High-Luminosity upgrade to the LHC. These BPMs will be located in sections of the beamline where the two counter-propagating proton beams co-exist within a single pipe",
        "such that the signal observed on each output port is a combination of the signals generated by each beam. The use of the BPMs as the input for a possible luminosity feedback system places a demanding requirement on the long-term accuracy of the BPMs. Accurate measurement of the position of each beam requires a method for isolating the individual beam signals. A simulation framework has been developed covering all stages of the measurement process",
        "from generation of the signals expected for beams of a given intensity and orbit through to digitization",
        "and has been used to evaluate several candidate methods for extracting the position of each beam in the presence of the unwanted signal from the other."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp12.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP12",
      "page_number": "120",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP13",
      "title": "Design and Test of CBPM Prototypes for SHINE",
      "authors": [
        "Private Address",
        "Zhangjiang",
        "Shanghai",
        "People’s Republic of China",
        "R. Jiang",
        "Y.B. Leng",
        "R.X. Yuan",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "SHINE (Shanghai High repetition rate XFEL aNd Extreme light facility) is designed to be an extremely high-performance hard X-ray free-electron laser facility located at Zhangjiang",
        "Shanghai. As one of the key parameters of the facility",
        "the resolution of the beam position measurement in the undulator section is required to be under 200 nm at a low bunch charge of 100 pC and better than 10 um at 10 pC. To achieve this",
        "a pre-study based on cavity beam position monitors is under development. Four sets of cavity monitors with different frequencies or load quality factors have been designed and are now manufactured by four different companies. It aims to select the cavity with the best performance and select the most capable company. This paper will briefly introduce the motivation",
        "cavity design considerations",
        "and cold test results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp13.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP13",
      "page_number": "124",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP14",
      "title": "BPM Studies and Prototype Design for the SOLEIL Upgrade",
      "authors": [
        "M. El Ajjouri",
        "F. Alves",
        "A. Gamelin",
        "N. Hubert",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "Synchrotron SOLEIL is preparing a machine upgrade with a reduction by more than a factor 10 the horizontal electron beam emittance (< 100 pm.rad).",
        "the future multibend achromat lattice will be composed of a large number of magnet elements. Quadrupole and sextupole strengths will impose a drastic reduction of the vacuum chamber dimensions and in particular its diameter that will be reduced to 10 mm. One of the challenges for the beam position monitors will be the mechanical integration of the 4 buttons and feedthroughs on such a small beam pipe. In this context we have realized a first prototype with Component Off The Shelf 3 mm buttons diameter",
        "to validate this mechanical integration and are starting the 3D electromagnetic simulations to study the impedance characteristics",
        "the RF parameters",
        "the heating and thermal issues."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp14.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP14",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "WEPP15",
      "title": "Experiments With a Quadrated Dielectric-Filled Reentrant Cavity Resonator as a Beam Position Monitor (BPM) for a Medical Cyclotron Facility",
      "authors": [
        "S. Srinivasan",
        "P.-A. Duperrex",
        "J.M. Schippers",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Low beam currents (0.1-10 nA) are used for tumour treatment in the proton radiation therapy facility at PSI. The facility houses a superconducting cyclotron with extraction energy of 250 MeV pulsed at 72.85 MHz. Online measurement of the beam position is traditionally performed with the help of ionisation chambers (ICs)",
        "however",
        "at the expense of reduced beam quality and scattering issues. There is a strong demand to have this measurement performed with minimal beam disturbance since the beam position is directly associated with the dose-rate applied. A cavity resonator",
        "working on the principle of an electric dipole mode resonance",
        "whose frequency is coupled to the second harmonic of the pulse rate",
        "has been built to measure beam position in a purely non-invasive manner. Followed by a reasonable agreement between the test-bench and the simulation results",
        "the cavity is installed in one of the beamlines. Here",
        "we report on the measurement of the cavity BPM as a function of beam current and position and its shortcomings. The cavity BPM can deliver position information within the accuracy and resolution demands of 0.50 mm",
        "when measured with a spectrum analyzer."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp15.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP15",
      "page_number": "128",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP16",
      "title": "Advanced Light Source High Speed Digitizer",
      "authors": [
        "J.M. Weber",
        "J.C. Bell",
        "M.J. Chin",
        "W.E. Norum",
        "G.J. Portmann",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The Advanced Light Source (ALS) is developing the High Speed Digitizer (HSD)",
        "a data acquisition system based on the latest Radio Frequency System-on-Chip (RFSoC) technology. The system includes 8 channels of 4GHz 4Gsps analog input",
        "programmable gain",
        "self calibration",
        "and flexible data processing in firmware. The initial motivation for the HSD project was to develop a replacement for aging ZTEC oscilloscopes that would be more tightly integrated with the ALS Control System and Timing System than any available commercial oscilloscope. However",
        "a general approach to the design makes the HSD system useful for other applications",
        "including a Bunch Current Monitor",
        "as well as for other facilities beyond ALS."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp16.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP16",
      "page_number": "132",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP17",
      "title": "Upgrade and First Commissioning of Transverse Feedback System for SSRF",
      "authors": [
        "N. Zhang",
        "B. Gao",
        "L.W. Lai",
        "R.X. Yuan",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "To be a part of the transverse feedback system upgrade plan in SSRF PHASE II project",
        "a set of Dimtel feedback processors was installed to replace the previous set. In the commissioning",
        "the ability of supressing the trans-verse oscillation was tested and evaluated",
        "also",
        "beam diagnostics and control tools of the processors was used for injection transients analysis",
        "tune tracking and bunch cleaning. The results of the commissioning and data analysis will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp17.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP17",
      "page_number": "136",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP18",
      "title": "Stochastic Cooling Pickup/Kicker Developments for a High-Precision Spectrometer Ring",
      "authors": [
        "G. Zhu",
        "Z. Du",
        "Y. Wei",
        "J.X. Wu",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "CERN",
        "Geneva",
        "Switzerland",
        "Stochastic cooling of the Spectrometer Ring (SRing) at the High Intensity heavy-ion Accelerator Facility (HIAF) project in China",
        "which is used mainly for experiments with radioactive fragment beams",
        "is applied to speed up the cooling process of a stored ion beam. In this study",
        "both a Faltin traveling wave structure and a novel slot-ring standing wave structure based on a ceramic vacuum chamber are discussed and evaluated for the pickup/kicker of the SRing stochastic cooling system. The slot-ring structure should significantly improve the shunt impedance due to the Cerenkov effect. For the Faltin-type structure",
        "the results for the pickup shunt impedance obtained from simulations and from beam measurements agree well. Good agreement is also found between the simulated and measured results for the pickup shunt impedance of the slot-ring structure. Cooling process simulations using the Fokker-Planck equation based on the shunt impedance results for the Faltin and slot-ring type pickups are also presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp18.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP18",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "WEPP19",
      "title": "Non-Destructive Monitoring of Electron Beam Micro-Bunching Periodicity",
      "authors": [
        "I.V. Konoplev",
        "H. Zhang",
        "JAI",
        "Oxford",
        "United Kingdom",
        "Oxford University",
        "Physics Department",
        "Oxford",
        "Oxon",
        "United Kingdom",
        "Electron beam microbunching can either occur naturally in high current accelerator facilities",
        "or can be induced artificially for wide range of studies. Microbunching has applications in LINAC driven tunable sources of coherent radiation and wakefield acceleration. In all cases",
        "an accurate",
        "non-destructive monitoring of the beam microbunching is needed to validate theory",
        "improve the accelerator and light source operations and understanding of the phenomenon observed. However",
        "it is still a challenge to monitor the beam microbunching non-destructively and we discuss the possibility of measuring the femtosecond periodic microstructure of the beam without strong interference (i.e. in a non-destructive way) via analysis of the amplitude modulation of the coherent Smith-Purcell radiation (cSPr) signal generated by a partially or fully microbunched beam. The results of the numerical studies of the cSPr generated by the partially and fully microbunched beam and proof-of-principle experiments demonstrating the measurements of the distance between micro-bunches will be presented. The theoretical predictions are compared with the experimental data and the limitations are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp19.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP19",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "WEPP20",
      "title": "Measurements of Ultraviolet FEL Seed Laser Pulse Width Broading in Thin ß-BBO Crystals",
      "authors": [
        "C.L. Li",
        "X.T. Wang",
        "W.Y. Zhang",
        "Shanghai Advanced Research Institute",
        "Pudong",
        "Shanghai",
        "People’s Republic of China",
        "L. Feng",
        "B. Liu",
        "SARI-CAS",
        "Pudong",
        "Shanghai",
        "People’s Republic of China",
        "Short pulse",
        "high power seed lasers have been implemented to improve the longitudinal coherence and shot-to-shot reproducibility of Free Electron Lasers (FEL). The laser pulse duration is typically 100 - 200 fs with wavelengths in the 260 nm range produced from third harmonic generation of a Ti:sapphire laser. The pulse duration must be measured accurately for seeded FEL operation. The Ultraviolet (UV) pulse width measurement can be carried out with intensity cross-correlation based on the difference frequency generation (DFG) in ultrathin ß-Barium Borate (BBO) crystals. The DFG output pulse broadened due to group velocity mismatch between the 266.7 nm and 800 nm components. The broadening effect depends on the BBO crystal thickness so we explored 0.015 mm",
        "0.055 mm and 0.1 mm thick samples. To the best of our knowledge",
        "this is the first time that ß-BBO crystal with thickness of only 0.015 mm has been used to measure the UV seed laser pulse width. Experiment results show the measured pulse width broadens with increased BBO thickness in agreement with a theoretical model."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp20.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP20",
      "page_number": "140",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP21",
      "title": "Evaluation of a Novel Pickup Concept for Ultra-Low Charged Short Bunches in X-Ray Free-Electron Lasers",
      "authors": [
        "B.E.J. Scheible",
        "A. Penirschke",
        "THM",
        "Friedberg",
        "Germany",
        "W. Ackermann",
        "H. De Gersem",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "M.K. Czwalinna",
        "H. Schlarb",
        "DESY",
        "Hamburg",
        "Germany",
        "The all-optical synchronization systems used in various Xray free-electron lasers (XFEL) such as the European XFEL depend on transient fields of passing electron bunches coupled into one or more pickups in the Bunch Arrival Time Monitors (BAM). The extracted signal is then amplitude modulated on reference laser pulses in a Mach-Zehnder type electro-optical modulator. With the emerging demand of the experimenters for future experiments with ultra-short FEL shots",
        "fs precision is required for the synchronization systems even with 1 pC bunches. Since the sensitivity of the BAM depends in particular on the slope of the bipolar signal at the zero crossing and thus",
        "also on the bunch charge",
        "a redesign with the aim of a significant increase by optimized geometry and bandwidth is inevitable. In this contribution a possible new pickup concept is simulated and its performance is compared to the previous concept. A significant improvement of slope and voltage is found. The improvement is mainly achieved by the reduced distance to the beam and a higher bandwidth."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp21.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP21",
      "page_number": "145",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP22",
      "title": "Submicropulse Energy-Time Correlations of 40-Mev Electron Beams at Fast",
      "authors": [
        "R.M. Thurman-Keup",
        "A.H. Lumpkin",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "We have recently extended our ability to explore submicropulse effects in relativistic electron beams to energy-time (E-t) correlations. The Fermilab Accelerator Science and Technology (FAST) facility consists of a photoinjector",
        "two superconducting TESLA-type capture cavities",
        "one superconducting ILC-style cryomodule",
        "and a small ring for studying non-linear",
        "integrable beam optics called IOTA. The linac contains",
        "as part of its instrumentation",
        "an optical transport system that directs optical transition radiation (OTR) from an Al-coated Si surface to an externally located streak camera for bunch length measurements. For the first time",
        "an OTR screen after the spectrometer magnet was used for measurements of submicropulse E-t correlations. The projected",
        "micropulse time profile was fit to a single Gaussian peak with σ = 11.5 ± 0.5 ps for 500 pC/micropulse and with a 200-micropulse synchronous sum",
        "in agreement with the upstream bunch-length measurement at a non-energy-dispersive location. The submicropulse E-t images were explored for four rf phases of CC1",
        "and the E vs. t effects will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp22.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP22",
      "page_number": "150",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP23",
      "title": "Optimization of GaAs Based Field Effect Transistors for THz Detection at Particle Accelerators",
      "authors": [
        "R. Yadav",
        "S. Preu",
        "S. Regensburger",
        "IMP",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "THM",
        "Friedberg",
        "Germany",
        "For pump probe experiments employing a free-electron laser and a near infrared (NIR) laser",
        "there is no natural locking between the two. Therefore only the repetition rate of the two lasers can be synchronized leading to jitter and drift on the picosecond scale. GaAs-based field-effect transistors (FETs) allow for simultaneous detection of the amplitude and timing of picosecond-scale THz and NIR pulses*. They cover the whole THz band and beyond up to the MIR (0.1 - 22 THz) with the exception of the GaAs Reststrahlen band*. Large-area FETs feature a high damage threshold (>65 kW) and large linearity range*. Antenna-coupled FETs show a noise equivalent power (NEP) of 250 pW/√Hz at 600 GHz**. FET based THz detectors can be used both for THz beam on a single pulse level",
        "as well as for the beam diagnosis. For further optimization of the detector for the needs of beam diagnosis with low incident intensity",
        "a more precise modeling of the FET is developed. Therefore",
        "the incoupling of THz to the rectifying element is investigated. The S-Parameters of the 2DEG are measured with on-wafer probes up to 67 GHz and de-embedded with on-wafer TRL*** calibration."
      ],
      "institutions": [],
      "abstract": "* Regensburger, S.,et al.,DOI:10.1364/OE.23.020732.  ** Regensburger, S.,et al.,DOI: 10.1109/TTHZ.2018.2843535.  *** Guoping, T.,et al.,DOI: 10.1088/1674-4926/36/5/054012.",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp23.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP23",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "WEPP24",
      "title": "Prototype Design of Bunch Arrival Time Measurement System Based on Cavity Monitor for SHINE",
      "authors": [
        "Y.M. Zhou",
        "S.S. Cao",
        "J. Chen",
        "Y.B. Leng",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "The Shanghai high repetition rate XFEL and extreme light facility (SHINE) is planned to be built into one of the most efficient and advanced free-electron laser user facilities over the world to provide a unique tool for kinds of cutting-edge scientific research. The measurement of bunch arrival time is one of the key issues to optimize system performance. This is because the FEL facility relies on the synchronization of electron bunch and seeded lasers. Currently",
        "there are mainly two methods to measure the bunch arrival time: the electro-optical sampling method and the RF cavity-based method. Considering the latter one has a simpler system and lower cost",
        "the method has been adopted by SXFEL. The previous results show that the measurement uncertainty of bunch arrival time has achieved to be 45 fs",
        "which can be further optimized. For SHINE",
        "the bunch arrival time resolution is required to be better than 25 fs@100pC",
        "and 200 fs@10 pC. The RF cavity-based method will also be applied. This paper will present the system prototype design and related simulation results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp24.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP24",
      "page_number": "154",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP25",
      "title": "Photoinjector Driver Laser Temporal Shaping and Diagnostics for Shanghai Soft X-ray Free Electron Laser",
      "authors": [
        "C.L. Li",
        "X.T. Wang",
        "W.Y. Zhang",
        "Shanghai Advanced Research Institute",
        "Pudong",
        "Shanghai",
        "People’s Republic of China",
        "L. Feng",
        "B. Liu",
        "SARI-CAS",
        "Pudong",
        "Shanghai",
        "People’s Republic of China",
        "It is known that the intensity distribution plays an important role in the electron bunch character",
        "such as its transverse emittance",
        "longitudinal structure. Compared with longitudinal Gaussian distribution",
        "Driver laser pulse with longitudinal flattop structure can produce electron bunch with lower emittance. This paper presents electron beam structure and emittance under different driver laser structure",
        "specifically",
        "laser pulse temporal shaping method for producing Gaussian beam and flattop beam are presented. The advantage and disadvantage of the two method are also discussed. Flattop beam produced from BBO stacking is more benefit for producing electron beam with lower emittance",
        "but significantly increase the microbunch effect. However",
        "Gaussian beam has the advantage to help reducing the mircobunch effect. Moreover",
        "cross correlation method for characterization the laser pulse temporal structure are also presented",
        "particularly",
        "the group velocity mismatch effect induced by the sum frequency BBO crystal are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp25.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP25",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "WEPP26",
      "title": "Effect of phase modulation on the transverse beam size and emittance of the HLS-II ring",
      "authors": [
        "Y.K. Zhao",
        "S.S. Jin",
        "B.G. Sun",
        "J.G. Wang",
        "F.F. Wu",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "In this paper",
        "the radio-frequency (RF) phase modulation method is exploited to investigate the variations in the transverse beam size and emittance at Hefei Light Source (HLS-II). Meanwhile",
        "a certain quantitative analysis was performed on the stability and practicability of the beam transverse profile measurement systems. The experiments show that the RF phase modulation method can effectively explore the robustness and stability of beam transverse profile measurement systems over the range of 20.0-22.5 kHz",
        "which is close to the first-harmonic of the synchrotron frequency. It is concluded that when the modulation amplitude of the external phase perturbation is less than 0.04 rad",
        "this optical system can be capable of maintaining reliable and stable working status. This is also useful for analyzing the influence of RF phase noise on the subsequent beam measurement and diagnostics",
        "which including the deterioration of beam quality",
        "emittance blowup",
        "beam jitter",
        "and beam loss."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp26.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP26",
      "page_number": "158",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP27",
      "title": "An Alternative Processing Algorithm for the Tune Measurement System in the LHC",
      "authors": [
        "L. Grech",
        "D. Alves",
        "M. Gąsior",
        "S. Jackson",
        "O.R. Jones",
        "T.E. Levens",
        "J. Wenninger",
        "CERN",
        "Meyrin",
        "Switzerland",
        "University of Malta",
        "Information and Communication Technology",
        "Msida",
        "Malta",
        "The betatron tune in the Large Hadron Collider (LHC) is measured using a Base-Band-Tune (BBQ) system. Processing of these BBQ signals is often perturbed by 50Hz noise harmonics present in the beam. This causes the tune measurement algorithm",
        "currently based on peak detection",
        "to provide incorrect tune estimates during the acceleration cycle with values that clearly oscillate between neighbouring harmonics. The LHC tune feedback cannot be used to its full extent in these conditions as it relies on stable and reliable tune estimates. In this work we present two alternative tune measurement algorithms",
        "designed to mitigate this problem by ignoring small frequency bands around the 50Hz harmonics and estimating the tune from spectra with gaps. One is based on Gaussian Processes and the other is based on a weighted moving average. We compare the tune estimates of the new and present algorithms and put forward a proposal that can be implemented during the renovation of the BBQ system for the next physics run of the LHC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp27.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP27",
      "page_number": "162",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP28",
      "title": "High-Accuracy Diagnostic Tool for Beam Position Monitor Troubleshooting in SSRF Based on Clustering Analysis",
      "authors": [
        "R. Jiang",
        "J. Chen",
        "Y.B. Leng",
        "SSRF",
        "Shanghai",
        "People’s Republic of China"
      ],
      "institutions": [],
      "abstract": "Beam position monitors (BPMs) are important to monitor the beam moving steadily. In spite of some data is viewed and analysed, a large fraction of data has never been effectively analysed in accelerator operation. It lead to some useful information not coming to the surface during the beam position monitor troubleshooting processing. We will describe in this paper our efforts to use clustering analysis techniques to pull out new information from existing beam data. Our focus has been to look at malfunction of BPM, associating basic running data that is ß oscillation of X and Y directions, energy oscillation and doing predictive analysis. Clustering analysis results showed that 140 BPMs could be classify into normal group and fault group and abnormal BPM could be separated. Based on the results, the algorithm could locate fault BPM and it could be an effective supplement for data analysis in accelerator physics.",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp28.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP28",
      "page_number": "166",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP29",
      "title": "Energy Gain Measurement for Electrons Accelerated in a Single-Cycle THz Structure",
      "authors": [
        "S.V. Kuzikov",
        "S.P. Antipov",
        "P.V. Avrakhov",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "S. Bodrov",
        "A.E. Fedotov",
        "A.N. Stepanov",
        "A.A. Vikharev",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "Gradients on the order of 1 GV/m have been obtained via single cycle (~1 ps) THz pulses produced by the conversion of a high peak power laser radiation in nonlinear crystals (~1 mJ",
        "1 ps",
        "up to 3% conversion efficiency). For electron beam acceleration with such broadband (0.1- 5 THz) pulses",
        "we propose arrays of parabolic focusing micro-mirrors with common central. To measure energy gain of electrons in the THz structure we propose applying a voltage (up to 400 kV) to the structure respecting the cathode and anode. Electrons become preliminary accelerated at the entrance that makes design of the structure simpler",
        "because velocity of particles is near to be constant and almost equals the speed of light. On the other hand",
        "the anode can be reached only by the electrons accelerated in the THz field so that one can directly measure the resulting energy gain at the anode."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp29.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP29",
      "page_number": "170",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP31",
      "title": "Design of the Beam Diagnostic System for the New 3 GeV Light Source in Japan",
      "authors": [
        "H. Maesaka",
        "T. Fukui",
        "RIKEN SPring-8 Center",
        "Innovative Light Sources Division",
        "Hyogo",
        "Japan",
        "H. Dewa",
        "T. Fujita",
        "M. Masaki",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "Japan Synchrotron Radiation Research Institute (JASRI)",
        "RIKEN SPring-8 Center",
        "Hyogo",
        "Japan",
        "National Institutes for Quantum and Radiological Science and Technology (QST)",
        "Sayo-cho",
        "Japan",
        "We present a design overview of the beam diagnostic system for the new 3 GeV light source being constructed in Tohoku",
        "Japan",
        "and some test results obtained at SPring-8. This light source will generate brilliant x-rays from a high-quality electron beam having 1 nm rad emittance and 400 mA maximum stored current. To achieve the design performance and stability",
        "we must monitor various beam parameters precisely. The beam position should be detected precisely: single-pass resolution < 0.1 mm (0.1 nC injected beam)",
        "COD resolution < 0.1 μm (more than 100 mA stored current)",
        "position stability < 5 μm for 1 month. We will use 112 button-type BPMs in the storage ring for these purposes. The stored beam current and beam size are also monitored with a DCCT and an x-ray pinhole camera. We will install a 3-pole wiggler to a straight section for the pinhole camera and other optical diagnostics. A stripline BPM and a stripline kicker will be installed to another straight section to suppress the beam instability and to measure betatron tune. We will use FPGA-based high-speed electronics for instability suppression with a bunch-by-bunch feedback method and real-time tune monitoring."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp31.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP31",
      "page_number": "174",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP33",
      "title": "Progress of Profile Measurement Refurbishment Activities at HIPA",
      "authors": [
        "R. Dölling",
        "E. Johansen",
        "M. Roggli",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "At PSI’s High Intensity Proton Accelerator (HIPA) facility some 180 profile monitors and 10 radial probes are in use to measure transverse beam profiles in beam lines and cyclotrons at energies of 0.87 to 590 MeV. Mechanical malfunctions and increased noise in some devices",
        "a lack of spare parts and the obsolescence of most of the driver and read-out electronics as well as extended requirements to the measurement",
        "necessitate the development of improved versions of the electronics and of several monitors. We give an update on the status of three projects in this regard: A long radial probe in the Ring Cyclotron",
        "a profile monitor and BPM at 590 MeV in high radiation environment and new loss monitor electronics",
        "which should also serve as a basis for the profile monitor readout."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp33.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP33",
      "page_number": "179",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP34",
      "title": "First Beam Profile Measurements by Beam Induced Fluorescence at the J-PARC Neutrino Extraction Beamline",
      "authors": [
        "M.L. Friend",
        "S.V. Cao",
        "K. Nakayoshi",
        "K. Sakashita",
        "KEK",
        "Ibaraki",
        "Japan",
        "Kavli IPMU",
        "Kashiwa",
        "Japan",
        "Okayama University",
        "Faculty of Science",
        "Okayama City",
        "Japan",
        "Okayama University",
        "Okayama",
        "Japan",
        "A Beam Induced Fluorescence (BIF) profile monitor is under development at the J-PARC neutrino extraction beamline",
        "where neutrinos are produced using 30 GeV protons from the J-PARC MR accelerator. Towards the goal of continuously and non-destructively measuring the 1.3MW proton beam profile spill-by-spill using fluorescence from proton interactions with injected gas",
        "a full working prototype monitor was installed in the beamline in 2019. The prototype includes a scheme for pulsed injection of N2 gas into the ultra-high vacuum beampipe and two optical readout arms",
        "a conventional one using an Image Intensifier coupled to a CID camera",
        "along with an array of optical fibers coupled to a Multi-Pixel Photon Counter array. Initial beam tests of the system were carried out in early 2020",
        "and BIF light was successfully observed in both optical systems. Details of the prototype monitor",
        "along with first proton beam profile measurement results",
        "will be shown. Improvement plans towards continuous operation of the new profile monitor will also be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp34.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP34",
      "page_number": "184",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP35",
      "title": "Simulation and Experiments of Transverse Emittance Measurements with Slit scan and Quadrupole scan at ELBE SRF Gun",
      "authors": [
        "S. Ma",
        "A. Arnold",
        "P.E. Evtushenko",
        "A.A. Ryzhov",
        "J. Schaber",
        "J. Teichert",
        "R. Xiang",
        "HZDR",
        "Dresden",
        "Germany",
        "TU Dresden",
        "Dresden",
        "Germany",
        "Emittance is one of the most important parameters for electron injectors and accelerator facilities. Two traditional methods",
        "the single slit-scan",
        "and quadrupole scan are used in most emittance measurements. Although the experiment condition is the same",
        "one may receive different emittance results. The difference between simulation and experiment in the beamline will be discussed in this paper. As a statistical sampling",
        "the error of the slit-scan system is related to bunch transverse distribution",
        "bunch charge",
        "slit width and thickness",
        "beamlet number",
        "drift distance",
        "and screen resolution. In suitable conditions",
        "the space-charge dominated beam will become emittance dominated beam after slits and emittances from slit-scan are reliable. The error quadrupole scan depends on the quadrupole field’s measurement accuracy and bunch distribution. In this paper",
        "we use a simple way to calibrate quadrupole focus strength. Space charge usually can’t be avoided and will lead to some errors for quadrupole scan."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp35.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP35",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "WEPP36",
      "title": "Recent Progress on the Commissioning of a Gas Curtain Beam Profile Monitor Using Beam Induced Fluorescence for High Luminosity LHC",
      "authors": [
        "S. Mazzoni",
        "M. Ady",
        "O.R. Jones",
        "I. Papazoglou",
        "C. Pasquino",
        "A. Rossi",
        "S. Sadovich",
        "G. Schneider",
        "R. Veness",
        "CERN",
        "Geneva",
        "Switzerland",
        "P. Forck",
        "S. Udrea",
        "GSI",
        "Darmstadt",
        "Germany",
        "N. Kumar",
        "A. Salehilashkajani",
        "C.P. Welsch",
        "H.D. Zhang",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "N. Kumar",
        "A. Salehilashkajani",
        "C.P. Welsch",
        "H.D. Zhang",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "For the high-luminosity upgrade of the Large Hadron Collider",
        "active control of proton/ion beam halo will be essential for safe and reliable operation. Hollow Electron Lenses can provide such active control by enhancing the depletion of halo particles",
        "and are now an integral part of the high luminosity LHC collimation system. The centring of the proton beam within the hollow electron beam will be monitored through imaging the fluorescence from a curtain of supersonic gas. In this contribution we report on the recent progress with this monitor and its subsystems",
        "including the development of an LHC compatible gas-jet injection system",
        "the fluorescence imaging setup and preliminary test measurement in the LHC"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp36.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP36",
      "page_number": "188",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP37",
      "title": "Transverse Phase Portrait Tomography of Proton Beams at INR RAS Linac",
      "authors": [
        "A.I. Titov",
        "S.A. Gavrilov",
        "RAS/INR",
        "Moscow",
        "Russia",
        "S.A. Gavrilov",
        "A.I. Titov",
        "MIPT",
        "Dolgoprudniy",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Measuring of the parameters of the transverse phase portraits is crucial for beam dynamics. A method of tomographic reconstruction is implemented at INR RAS linac as an alternative to already existing quadrupole variation method. In this work new feature of disturbing online measurements of phase portrait parameters and important experimental results are discussed. Comparison of tomographic method with quadrupole variation method is presented.",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp37_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp37.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp37_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP37",
      "page_number": "193",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP38",
      "title": "Diamond Beam Halo Monitor",
      "authors": [
        "S.V. Kuzikov",
        "S.P. Antipov",
        "P.V. Avrakhov",
        "E.W. Knight",
        "Y. Zhao",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Beam halo measurement is important",
        "because novel x-ray free electron lasers like LCLS-II have very high repetition rates",
        "and the average power in the halo can become destructive to a beamline. Diamond quad detectors were previously used for electron beam halo measurements at KEK*. Diamond is the radiation hard material which can be used to measure the flux of passing particles based on a particle-induced conductivity effect. However",
        "the quad detectors have metallic contacts for charge collection. Their performance degrades over time due to the deterioration of the contacts under electron impact. We recently demonstrated a diamond electrodeless x-ray flux monitor based on a microwave measurement of the change in the resonator coupling and eigen frequency**. We propose similar measurements with a diamond put in a resonator that intercepts the halo. Without electrodes",
        "such a device is more radiation resistant. By measuring the change in RF properties of the resonator",
        "one can infer the beam halo parameters. In a similar manner to traditional beam halo monitors",
        "the diamond plate can be scanned across the beam to map its transverse distribution.",
        "* S.Liu et al.",
        "Nuclear Instruments and Methods in Physics Research A832 (2016) 231-242.  ** S.Antipov et al.",
        "Proceeding of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/wepp38_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/wepp38.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/wepp38_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-WEPP38",
      "page_number": "197",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 35,
  "scrape_time": "2025-10-10 17:42:51"
}