{
  "session_info": {
    "id": "MOYGB",
    "name": "MOYGB - Opening Plenaries",
    "url": "https://proceedings.jacow.org/ipac2018/html/moygb.htm"
  },
  "papers": [
    {
      "paper_id": "MOYGB1",
      "title": "Status and Future Strategy for Advanced High Power Microwave Sources for Accelerators",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "The need for more energy efficient high power microwave devices for accelerator applications continues to increase. This is important for development of cost effective accelerator designs that are coming up in the near future. Efforts are already in place to design new devices that could stretch the limits of RF power conversion to the highest levels possible. Devices including new technologies and design innovations like multi beam",
        "increased number of cavities designs are being considered. Advances in the application of solid state amplifiers to accelerators are also being realized. This invited talk will cover the recent advances and status of such efforts. It will discuss future needs and a strategy for pursuing these efforts on a faster time scale for the benefit of the accelerator community."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/moygb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/moygb1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/moygb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-MOYGB1",
      "page_number": "12",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOYGB2",
      "title": "The LCLS-II: A High Power Upgrade to the LCLS",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The LCLS-II is an upgrade of the LCLS X-ray FEL based on a 4 GeV superconducting RF linac. The LCLS-II is designed to produce 100's of Watts of X-rays from 200 eV up to 5 keV. The linac uses 1.3 GHz 9-cell cavities processed using the N2-doping technique and will be the first large scale CW SCRF linac with a Q of roughly 3x1010 at a gradient of 16 MV/m. The injector which will be commissioned in spring 2018",
        "is based on the normal conducting CW RF APEX gun developed at LBNL. The LCLS-II will have two undulators: the soft X-ray undulator is a 39 mm period hybrid PM with an adjustable vertical gap to cover the range from 200 eV to 1.5 keV and hard X-ray undulator is a novel adjustable horizontal gap hybrid PM undulator with 26 mm period to generate vertically polarized X-rays from 1 to 5 keV. The talk will review the performance goals as well as the hardware fabrication."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/moygb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/moygb2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/moygb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-MOYGB2",
      "page_number": "18",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOYGB3",
      "title": "The Path to LBNF",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "The LBNF is a major focus of the US high energy physics program. The neutrino beam will be created at Fermilab and the detector will be located at the Sanford laboratory in the Homestake mine in South Dakota. The talk will review the physics goals and the beam requirements for the experiment. It will then describe the beam physics challenges and the upgrades and modifications to the Fermilab site that have been and will be implemented to generate the required high intensity beams.",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/moygb3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/moygb3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/moygb3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-MOYGB3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:22:18"
}