{
  "session_info": {
    "id": "TUPP",
    "name": "TUPP - Tuesday Poster Session",
    "url": "https://proceedings.jacow.org/ibic2020/html/tupp.htm"
  },
  "papers": [
    {
      "paper_id": "TUPP01",
      "title": "Bunch Purity Measurement and Improvement",
      "authors": [
        "J. He",
        "J.H. Yue",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "A signal electron level purity is mandatory for a nuclear resonant scattering experiment. For the establishing such kind of beamlines on High Energy Photon Source (HEPS)",
        "a new time-correlated single photon counting system has been implemented on the storage ring of Beijing Electron-Positron Collider II (BEPCII)",
        "which is used to monitor the purity. The system could track the purity deterioration process. The possible reason of impurity growth is analysed",
        "the measurement results confirmed that Touschek scattering and pre-accelerators of the storage ring are the main mechanisms of impurity growth. A bunch cleaning technique based on a sinusoidal signal mixed a pseudo-square wave has been verified which could improve the purity to the level of 10-7. This paper mainly describes the experiment details and measurement results of purity measurement and improvement."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP04",
      "title": "Simulated Beam Loss Events in the FRIB Linac",
      "authors": [
        "R. Shane",
        "S. Cogan",
        "S.M. Lidia",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Beam loss is an ever-present issue in accelerators and can lead to degraded beam quality",
        "activation",
        "and machine damage. It is crucial to be able to pinpoint the source of beam loss so that the cause can be addressed. Towards this end",
        "beam loss studies were performed at the Facility for Rare Isotope Beams (FRIB) in which beam spills were simulated at various locations within the accelerator. Beam spills were achieved by adjusting the magnetic fields or turning off selected RF cavities. This defocused or moved the beam such that particles impacted the walls",
        "apertures",
        "and other surfaces in the beam transport volume",
        "creating measurable radiation. Losses were monitored on a suite of detectors including neutron detectors",
        "pressurized ion chambers",
        "and halo monitor rings. These data were used in conjunction with calculated beam profiles and statistical analyses in order to correlate loss detection patterns with beam spill location."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP04",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP05",
      "title": "X-Ray Beam Size Monitor Enclosure for the Advanced Photon Source Upgrade",
      "authors": [
        "K.P. Wootton",
        "W.X. Cheng",
        "G. Decker",
        "S.H. Lee",
        "B.X. Yang",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Confirmation of pm rad scale emittances from the Advanced Photon Source Upgrade electron storage ring necessitates direct measurement of the electron beam size. In the present work",
        "we motivate design choices for the X-ray beam size monitor shielding enclosure for the Advanced Photon Source Upgrade. Particular emphasis is given to outlining design choices from the perspectives of safety",
        "overall project construction schedule and eventual beamline operations."
      ],
      "institutions": [
        "Funding: This research used resources of the Advanced Photon Source, operated for the U.S. Department of Energy Office of Science by Argonne National Laboratory under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp05.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP05",
      "page_number": "34",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP06",
      "title": "Inclined X-ray Beam Position Monitors to Reduce Influence of Filling Pattern for the SPring-8 Photon Beamlines",
      "authors": [
        "H. Aoyagi",
        "Y. Furukawa",
        "S. Takahashi",
        "JASRI/SPring-8",
        "Hyogo",
        "Japan",
        "The X-ray beam position monitors (XBPMs) equipped with blade-type detector heads in SPring-8",
        "which operate in photoemission mode",
        "are required to withstand severe high heat loads. In addition",
        "they must work in a variety of several-bunch mode operations. However",
        "as bunch current in the storage ring increased",
        "influence of bunch filling patterns on XBPM performance increased year by year. We have performed a systematic evaluation of the influence of the filling patterns. We found that the cause of the influence is suppression of the XBPM current signal due to the space charge effect",
        "and that it can be quantified by observing the behavior of the current signal while changing the voltage of a photoelectron collection electrode*. We have designed and manufactured new blade-type detector heads in inclined configuration for the purpose of mitigation the space charge effect**. It has been demonstrated that the influence of filling patterns is reduced to a few um. We also report that",
        "as a result of a series of efforts against existing XBPMs for all ID beamlines",
        "the influence has been reduced to about 5 um RMS."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp06.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP06",
      "page_number": "37",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP08",
      "title": "BPM Low ß Calibration Test Stand",
      "authors": [
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Capacitive pickups such as beam position monitors (BPMs)",
        "are sensitive to the electric field distribution produced by the beam. For relativistic fields",
        "the fields are flattened therefore they well represent the longitudinal bunch shape. However",
        "for non-relativistic beam",
        "ß<0.1",
        "the field at the pickups can extend past the bunch which affects the measurements from the BPM. This effect from non-relativistic fields is currently accounted for with theory and simulations",
        "however a test stand is also desired that can replicate the field distribution and the bunch velocity. To accomplish this a test stand using a helical transmission line was designed and constructed which propagates with phase velocity of ~0.03c. Presented are measurements of the phase velocity",
        "dispersion",
        "and impedance of the helical transmission line and compared to simulations and theory. Also demonstrated is the ability for the helical transmission line to propagate pulses with minimal deformation and the fields from the helix well represent a particle bunch."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp08.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP08",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP09",
      "title": "Multiplexer System for the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp09.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP09",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP10",
      "title": "X-Ray Beam Position Monitor Silicon Photodiode Measurements for the Advanced Photon Source Upgrade",
      "authors": [
        "K.P. Wootton",
        "H. Cease",
        "M. Erdmann",
        "S.M. Oprondek",
        "M. Ramanathan",
        "B.X. Yang",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "To best leverage the orders of magnitude average brightness increase of multi-bend achromat synchrotron radiation storage rings",
        "ambitious beam stability requirements are imposed. One system that will be employed at the Advanced Photon Source Upgrade in support of photon beam stability will be X-ray beam position monitors. In the present work",
        "electrical characterisation of several types of photodiodes are evaluated for potential use in X-ray beam position monitors."
      ],
      "institutions": [
        "Funding: This research used resources of the Advanced Photon Source, operated for the U.S. Department of Energy Office of Science by Argonne National Laboratory under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp10.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP10",
      "page_number": "46",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP11",
      "title": "Beam Instrumentation Data Acquisition Using Gigabit Ethernet Communication Protocol",
      "authors": [
        "N. Eddy",
        "J.S. Diamond",
        "R.R. Santucci",
        "V.E. Scarpine",
        "A. Semenov",
        "D. Slimmer",
        "D.C. Voy",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Fermilab’s PIP-II accelerator is pursuing the developing a new generalized DAQ system using gigabit ethernet as the communication protocol. The system uses standard rackmount servers and commodity ethernet switches for the front-end",
        "which is a very low cost compared to standard platforms such as VME and uTCA. We use our own client-server protocol for GigE communication between the server and our custom in-house FPGA based digitizers. This allows for a lot of flexibility such that a single server can serve multiple different front-end systems (BPMs",
        "current monitors",
        "BLMs",
        "etc). At PIP2IT",
        "we have configured a system utilizing a single rackmount server and a 10-gigabit switch communicating with two VME crates housing digitizers for the BPM system. Each digitizer card is connected directly to the switch. The VME crates are just used for power and cooling. This talk will present the system architecture and initial results of operation at PIP2IT."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp11.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP11",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP12",
      "title": "Automated Management of Libera SPARK Module IOCs in",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp12.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP12",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP13",
      "title": "A New Flexible and Interactive Control System for the INFN-LNS Accelerators and Beamlines",
      "authors": [
        "G. Vecchio",
        "S. Aurnia",
        "S. Cavallaro",
        "L. Cosentino",
        "B.F. Diana",
        "E. Furia",
        "P.S. Pulvirenti",
        "A.D. Russo",
        "INFN/LNS",
        "Catania",
        "Italy",
        "Interactive Graphics User Interfaces (GUI) and a new message exchange protocol are parts of the modern Control System designed and developed to control and monitor the accelerators and beamlines at Istituto Nazionale di Fisica Nucleare - Laboratori Nazionali del Sud (INFN LNS). We used the most innovative open source frameworks and architectures to build several kinds of applications: a web-based application",
        "an interactive synoptic panel and a mobile app. The new protocol for the message exchange between the field devices and the control user interfaces uses the in-memory data structure store Redis as a message broker. Several outline tools allow the calculation of the beam intensity and the automatic acquisition of the beam contour for future beam replication. Moreover",
        "a relational database is used to store all the machine and beamlines parameters every day for each experiment."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp13.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP13",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP15",
      "title": "DEOS: A New Scheme for Recording Electron Bunch Shapes With High Resolution and Record Recording Length - Principle and Tests at EuXFEL",
      "authors": [
        "PhLAM/CERCLA",
        "Villeneuve d’Ascq Cedex",
        "France",
        "C. Evain",
        "E. Roussel",
        "C. Szwaj",
        "PhLAM/CERLA",
        "Villeneuve d’Ascq",
        "France",
        "C. Gerth",
        "B. Steffen",
        "DESY",
        "Hamburg",
        "Germany",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "Recording electron bunch longitudinal profiles in single-shot",
        "and non-destructively is largely needed in accelerator operation. A common strategy consists in probing the near-field of the bunch using femtosecond laser pulses. These two last decades",
        "such electro-optic detection schemes have evolved to compact and reliable techniques. However",
        "serious limitations have been limiting the time-resolution",
        "when long recording lengths are needed. This has been recognized as a fundamental bottleneck and even coined the term \"Fourier limit\". We present here a novel electro-optic sampling strategy that is theoretically capable to overcome this limit and achieve femtosecond resolution for any recording length. This new approach is based on the mathematical concept of information diversity. We present first results of DEOS (Diversity Electro-Optic Sampling) obtained both in table-top experiments",
        "as well as at the European XFEL. This technique opens the way to electric field shape characterization with femtosecond resolution in new situations",
        "including longitudinal bunch profile monitoring",
        "studies of microbunching instabilities",
        "and THz pulses generated at free-electron lasers."
      ],
      "institutions": [],
      "abstract": "https://arxiv.org/abs/2002.03782",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp15.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP15",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP17",
      "title": "Direct Observations of Sub-micropulse Electron-beam Effects from Short-range Wakefields in TESLA-type Superconducting RF Cavities",
      "authors": [
        "A.H. Lumpkin",
        "D.R. Edstrom",
        "P.S. Prieto",
        "J. Ruan",
        "R.M. Thurman-Keuppresenter",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "J.A. Diaz Cruz",
        "A.L. Edelen",
        "B.T. Jacobson",
        "F. Zhou",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The preservation of the low emittance of electron beams during transport in the accelerating structures of large facilities is an ongoing challenge. In the cases of the TESLA-type superconducting rf cavities currently used in the European X-ray Free-electron Laser (FEL) and the under construction Linac Coherent Light Source upgrade (LCLS-II)",
        "off-axis beam transport may result in emittance dilution due to transverse long-range and short-range wakefields (SRW)*. To investigate such effects",
        "experiments were performed at the Fermilab Accelerator Science and Technology (FAST) facility with its unique two-cavity configuration after the photocathode rf gun. We used optical transition radiation (OTR) imaging with a UV-visible synchroscan streak camera to display sub-micropulse y-t effects in the 41-MeV beam. The head-tail transverse kicks within the 11-ps-long micropulses were observed at the 100-micron level for steering off-axis in one cavity and several 100 microns for two cavities. Since the SRW kick angles go inversely with energy",
        "these results may inform the commissioning plans of the LCLS-II injector where beam will be injected at ~1 MeV into a cryomodule.",
        "* W.K.H. Panofsky and M. Bander",
        "Rev. Sci. Instr. 39",
        "206 (1968)."
      ],
      "institutions": [
        "Funding: Work supported by FRA, LLC under Contract No. DE-AC02-07CH11359 with the U.S. Dept. of Energy, Off. of Sci./HEP. SLAC is supported by the U.S. Dept. of Energy, OS/BES, under contract DE-AC02-76SF00515."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp17.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP17",
      "page_number": "56",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP18",
      "title": "Observations of Optical Synchrotron Radiation from Ultra-low Charges Stored in a Ring Operating at 425 MeV",
      "authors": [
        "AAI/ANL",
        "Lemont",
        "Illinois",
        "USA",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "The initial observations of optical synchrotron radiation (OSR) emitted over millions of passes from a few electrons circulating in the Particle Accumulator Ring (PAR) at the Advanced Photon Source have been done with a digital CMOS camera and a synchroscan streak camera operating at 117.3 MHz. The discrete changes of integrated counts in the CMOS image region of interest are ascribed to single electron steps at ~3500 cts per electron. Circulations of a single electron at 375 MeV and at 425 MeV were demonstrated in the 12-bit digital FLIR USB3 camera images. The Hamamatsu C5680 streak camera operating at the 12th harmonic of the fundamental revolution frequency at 9.77 MHz was used to measure the zero-current bunch length from 0.5 nC circulating charge down to 10s of electrons or <10 aC. The latter cases were performed with 6-ps temporal resolution for the first time anywhere",
        "to our knowledge. We report a preliminary effective bunch length of 276 ± 36 ps for 57 electrons (9.1 aC) stored based on a fit to a single Gaussian peak. The results will be compared to the standard zero-current model for the ring."
      ],
      "institutions": [
        "Funding: This research used resources of the Advanced Photon Source, operated for the U.S. Department of Energy Office of Science by Argonne National Laboratory under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "K.P. Woottonpresenter",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp18.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP18",
      "page_number": "61",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP20",
      "title": "Bunch Length Measurements Using Beam Position Monitors",
      "authors": [
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "S. Cogan",
        "S.M. Lidia",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Capacitive Beam Position Monitors (BPMs) are broadband pickups. For measurements of RF bunched beams",
        "however",
        "they typically use narrowband filters to measure one harmonic of the beam current to reduce noise and simplify the signal processing. If several harmonics are measured simultaneously",
        "the longitudinal bunch shape",
        "in principle",
        "may also be measured. This can be accomplished by recording the waveforms from the BPMs with an oversampling measurement scheme before the narrowband analysis is applied. In order to reconstruct the bunch shape",
        "the measured spectra should be corrected for non-relativistic effects",
        "cable attenuation and filtering",
        "and the geometry and impedance of the BPM pick up. These corrections are discussed as well as the procedure for calibrating the BPM system for measuring multiple harmonics. Measurements are presented that were taken in the medium energy beam transport line and the first linac section at the Facility for Rare Isotope Beams and are compared to simulations and measurements with a fast Faraday cup. Resolution and uncertainties of the reported bunch length measurements are described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp20.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP20",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP21",
      "title": "Transition Radiation Based Diagnostics for Non-Relativistic Ion Beams",
      "authors": [
        "R. Singh",
        "T. Reichert",
        "B. Walasek-Höhne",
        "GSI",
        "Darmstadt",
        "Germany",
        "The usage of optical transition radiation for profile monitoring of non-relativistic electron beams is well known. In this contribution",
        "we study the application of transition radiation in optical and GHz regime for non-relativistic ion beams. The light emitted from a metal target after ion beam irradiation consists of polarized transition radiation as well as significant amount of unpolarized photons. The dependence of light yield on beam current and comparison of measured transverse profiles with alternative devices is shown. Simulations and pilot measurements demonstrating the potential usage of coherent transition radiation in GHz regime for bunch-by-bunch longitudinal profile measurements is also discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp21.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP21",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP23",
      "title": "Streak Camera Measurement of Electron Beam Energy Loss Per Turn in the Advanced Photon Source Particle Accumulator Ring",
      "authors": [
        "K.P. Wootton",
        "J.R. Calvey",
        "J.C. Dooling",
        "K.C. Harkay",
        "A.H. Lumpkin",
        "Y. Sun",
        "B.X. Yang",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Relativistic electron beams in storage rings radiate a significant fraction of beam energy per turn. As demonstrated in previous experiments",
        "with the radiofrequency accelerating structures off",
        "the turn-by-turn time of arrival of the electron bunch can be observed from the synchrotron radiation that it produces using a streak camera. In the present work",
        "we present measurements of the energy loss per turn of an initially short electron bunch (~1 ps RMS) from a photocathode electron gun in the Advanced Photon Source Particle Accumulator Ring (375 MeV",
        "102 ns revolution period). With the streak camera synchroscan locked to the twelfth harmonic of the revolution frequency (117.3 MHz)",
        "we observe an injection transient in the horizontal direction."
      ],
      "institutions": [
        "Funding: This research used resources of the Advanced Photon Source, operated for the U.S. Department of Energy Office of Science by Argonne National Laboratory under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp23.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP23",
      "page_number": "66",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP24",
      "title": "LOCO Corrections for Beam Trajectory Optimisation on the ISIS Accelerator",
      "authors": [
        "E.J. Brookes",
        "H.V. Cavanagh",
        "B. Jones",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The ISIS facility at the Rutherford Appleton Laboratory",
        "UK",
        "produces neutron and muon beams for condensed matter research. Its 50 Hz",
        "800 MeV proton synchrotron delivers a mean beam power of 0.2 MW to two tungsten spallation targets. The beam optics correction technique implemented in this work is Linear Optics from Closed Orbits (LOCO). LOCO modifies existing accelerator models according to a measured orbit-response matrix (ORM). This correction technique identifies imperfections in the machine lattice",
        "and discrepancies between the machine and model. The identification of erroneous elements through analysis of the measured ORM is demonstrated in this work. In comparison to the operational settings achieved through the existing correction techniques",
        "the initial test of the LOCO code demonstrates a 17 % improvement to the RMS trajectory deviation in the horizontal plane."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp24.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP24",
      "page_number": "70",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP27",
      "title": "Monitor for Microbunching Instability in X-ray Free Electron Laser",
      "authors": [
        "C. Kim",
        "H.-S. Kang",
        "G. Kim",
        "I.S. Ko",
        "J.H. Ko",
        "PAL",
        "Pohang",
        "Republic of Korea",
        "The microbunching instability is an important issue in an X-ray Free Electron Laser (XFEL) because the intensity of the FEL can be reduced significantly when the microbunching instability is generated. In the X-ray Free Electron Laser of the Pohang Accelerator Laboratory (PAL-XFEL)",
        "a visible CCD camera was installed in the existing coherent radiation monitor (CRM) for the bunch length monitoring. The measurement result shows that the CCD camera can be used as a direct monitor to diagnose the microbunching instability and can be used to optimize the FEL lasing in the PAL-XFEL."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp27.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP27",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP28",
      "title": "Simulation of Cherenkov Diffraction Radiation for Various Radiator Designs",
      "authors": [
        "Jagiellonian University",
        "Kraków",
        "Poland",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "T. Lefèvre",
        "N. Mounet",
        "CERN",
        "Meyrin",
        "Switzerland",
        "TU Vienna",
        "Wien",
        "Austria",
        "Studies performed during the last few years at different facilities have indicated that the emission of Cherenkov Diffraction Radiation (ChDR) can be exploited for a range of non-invasive diagnostics. The question remains of how to choose an optimal dielectric material and which radiator shapes give the most promising results. This contribution presents a semi-analytical framework for calculating the electromagnetic field of a charged particle beam",
        "taking into consideration its interaction with surrounding structures. It allows us to directly compute ChDR at arbitrary probe positions inside the radiator. Several configurations will be discussed and presented",
        "including flat and cylindrical radiators of various dimensions and electrical properties",
        "as well as multilayer structures obtained by adding coatings of metallic nanolayers."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp28.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP28",
      "page_number": "73",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP30",
      "title": "Non-Invasive Dispersion Function Measurement During Light Source Operations",
      "authors": [
        "B. Podobedov",
        "Y. Hidaka",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "We implemented a completely parasitic measurement of lattice dispersion functions in both horizontal and vertical planes",
        "which is fully compatible with light source user operations. The measurement is performed by applying principle component analysis and adaptive filtering to very small residual orbit noise components introduced by the RF system and detected in the beam orbit data",
        "sampled at 10 kHz. No changes in RF frequency are required. The measurement",
        "presently performed once a minute",
        "was shown to be robust and immune to changes in the beam current",
        "residual orbit noise amplitude and frequency content as well as other factors. At low current it was shown to provide similar accuracy to the traditional method (which shifts the 500 MHz RF frequency by ±500 Hz). In this paper we will explain our measurement technique and present typical dispersion function stability achieved during NSLS-II operations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp30.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP30",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP31",
      "title": "Micro-Bunching Measurements at FERMI",
      "authors": [
        "M. Veronese",
        "E. Allaria",
        "S. Di Mitri",
        "M. Ferianis",
        "L. Giannessi",
        "G. Penco",
        "P. Rebernik Ribič",
        "S. Spampinati",
        "C. Spezzani",
        "M. Trovò",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Università degli Studi di Trieste",
        "Trieste",
        "Italy",
        "University of Nova Gorica",
        "Nova Gorica",
        "Slovenia",
        "PhLAM/CERLA",
        "Villeneuve d’Ascq",
        "France",
        "The origin and evolution of micro-bunching (u-B) in a LINAC is very important for Free Electron laser (FEL)",
        "a key knowledge to full control and highest quality of the FEL radiation. The experimental u-B characterization is not simple",
        "due to the measurement complexity",
        "considering the u-B extended spectral range and its interplay with other machine effects. At FERMI",
        "we have measured u-B signatures using different techniques",
        "including intensity characterization of Coherent OTR(visible range) and the FFT based modulation analysis performed on the spectrometer images. The latter available both at the first bunch compressor and at the diagnostics beam dump. The beating of two laser pulses at laser heater has been used to induce narrow-band micro-bunching modulations",
        "used as a known probe",
        "to study the FEL / u-B instability spectra. As spectral measurement technique",
        "the distribution of Coherent-TR in the IR region",
        "using BP filters and PbSe detectors",
        "has been implemented. More recently",
        "a new IR spectrometer based on a CaF2 prism and a scanning technique has been developed and installed. Here we present techniques and the experimental results obtained and future perspectives."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp31.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP31",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP32",
      "title": "Development of Novel Non-Destructive 2D and 3D Beam Monitoring Detectors at the Bern Medical Cyclotron",
      "authors": [
        "C. Belver-Aguilar",
        "S. Braccini",
        "T.S. Carzaniga",
        "A. Gsponer",
        "P. Haeffner",
        "P. Scampoli",
        "M. Schmid",
        "AEC",
        "Bern",
        "Switzerland",
        "TERA",
        "Novara",
        "Italy",
        "Naples University Federico II",
        "Napoli",
        "Italy",
        "The Laboratory for High Energy Physics (LHEP) at the University of Bern is developing novel beam monitoring detectors for the 18 MeV medical cyclotron in operation at the Bern University Hospital (Inselspital). A 2D non-destructive beam monitor - named Pi2 - was developed",
        "based on a thin aluminium foil coated with P47 scintillating material and a camera. It measures the transverse position",
        "shape",
        "and intensity of the beams for several applications",
        "as radiation hardness or radioisotope production studies. This detector allows the processing of data in real time and a reconstruction of the transverse phase space. Based on the Pi2",
        "a first prototype of a 3D beam monitoring detector - named Pi3 - was conceived",
        "constructed",
        "and tested. It is based on the same scintillating foil mounted on a movable support with a miniaturized camera. The Pi3 detector allows for the study of the beam evolution along a beam line",
        "even inside a magnet",
        "and the reconstruction of the beam envelope. In this paper",
        "we report about the design",
        "construction and beam tests performed with these two detectors. Further developments will be also presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp32.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP32",
      "page_number": "78",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP34",
      "title": "Beam Experiments with the Multi-purpose Iris Diaphragm Beam Detector",
      "authors": [
        "A. Liu",
        "C.-J. Jing",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Non-Gaussian beam distributions around the Gaussian core can be formed in an accelerator in both the transverse and longitudinal directions. Since there are no clearly defined criteria to distinguish the halo from the core",
        "the measurement of the halo structure without affecting the core is challenging. Previously",
        "a novel design of an iris diaphragm detector for transverse beam halo distributions and transverse profile was reported by Euclid Techlabs*. This multi-purpose design not only measures the transverse beam distribution but may also work as a tunable collimator or an adjustable BPM. In this paper",
        "the beam experiments using the ~ 1 MeV electron beam at the AWA Cathode Teststand (ACT) of ANL and the 200 keV TEM beam at Euclid are discussed for the most up-to-date version of this new apparatus: Iris Diaphragm e-beam Apparatus Series -Halo (IDEAS-Halo)."
      ],
      "institutions": [],
      "abstract": "* please see NAPAC 2019 pre-press proceedings",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp34.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP34",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP35",
      "title": "Development of a Thermal Response Model for Wire Grid Profile Monitors and Benchmarking to CERN",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp35.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP35",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPP36",
      "title": "Experimental Investigation of Spectral-Angular Cherenkov Radiation Characteristics From 855 MeV Electrons",
      "authors": [
        "A. Potylitsyn",
        "S.Yu. Gogolev",
        "A.V. Vukolov",
        "TPU",
        "Tomsk",
        "Russia",
        "G. Kube",
        "A.I. Novokshonovpresenter",
        "DESY",
        "Hamburg",
        "Germany",
        "IKP",
        "Mainz",
        "Germany",
        "Radiation based beam diagnostics is a versatile tool",
        "especially for transverse beam profile measurements. While the use of Optical Transition Radiation (OTR) has long history since developed",
        "the application of Cherenkov Radiation (ChR) having comparatively higher intensity and tunable frequency spectrum just arouse interest. In order to investigate the ChR properties",
        "an experiment has been carried out at the 855 MeV electron beam of the Mainz Microtron MAMI (University of Mainz",
        "Germany). The beam size was 370 um in horizontal and 6.5 um in vertical direction. A 200 um thick fused silica was used as radiator. The beam images were recorded with a standard CMOS camera and an objective lens. While the detector was at a fixed observation angle (much larger than 46.77 degrees - the Cherenkov angle for a fused silica)",
        "the radiator could be rotated with respect to the beam direction such that the ChR angular distribution was measured as a function of the radiator orientation. In addition",
        "a spectrometer was used to get the ChR emission spectrum orientation dependency. This report gives an overview of the experiment together with measurements and first theoretical comparisons."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp36.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP36",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPP37",
      "title": "A Beam Profile Monitor for High Energy Proton Beams Using Microfabrication Techniques",
      "authors": [
        "I.M. Mateu",
        "W. Farabolini",
        "A. Gilardi",
        "B. Gkotse",
        "A. Mapelli",
        "V. Meskovapresenter",
        "G. Pezzullo",
        "F. Ravotti",
        "O. Sidiropoulou",
        "CERN",
        "Geneva",
        "Switzerland",
        "D. Bouvet",
        "J.M. Sallese",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "In High Energy Physics experiments it is a common practice to expose electronic components and systems to particle beams",
        "in order to assess their level of radiation tolerance when operating in a radiation environment. One of the facilities used for such tests is the Proton Irradiation Facility (IRRAD) at CERN. In order to properly control the 24 GeV/c proton beam",
        "Beam Profile Monitor (BPM) devices are used. The current BPMs are fabricated as standard flexible PCBs featuring a matrix of metallic sensing pads. When exposed to the beam",
        "secondary electrons are emitted from each pad",
        "thus generating a charge proportional to the particle flux. The charge is measured individually for each pad using a dedicated readout system",
        "and so the beam shape",
        "position and intensity are obtained. The beam profile determination with this technique requires thus the usage of non-invasive and radiation tolerant sensing elements. This study proposes a new fabrication method using microfabrication techniques in order to improve the BPMs performance while greatly reducing the device thickness",
        "thus making them also appropriate for the monitoring of lower energy and intensity particle beams."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/tupp37_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/tupp37.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/tupp37_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-TUPP37",
      "page_number": "86",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 26,
  "scrape_time": "2025-10-10 17:42:20"
}