{
  "session_info": {
    "id": "WECA",
    "name": "WECA - Accelerators for medical and industrial applications",
    "url": "https://proceedings.jacow.org/rupac2014/html/weca.htm"
  },
  "papers": [
    {
      "paper_id": "WECA01",
      "title": "Accelerator Produced Radioisotopes for Targeted Alpha Therapy (TAT) for Cancer",
      "authors": [
        "Macquarie University",
        "North Ryde",
        "Australia",
        "Production of Actinium-225 for TAT Radium needles that were once implanted into tumours as a cancer treatment are now obsolete and constitute a radioactive waste problem",
        "as their half-life is 1600 years. The reduction of radium by photonuclear transmutation by bombarding Ra-226 with high-energy photons from a medical linac has been investigated. A linac dose of 2800 Gy produced about 50 mCi of Ra-225",
        "which decays to Ac-225",
        "and can then be used for ‘Targeted Alpha Therapy’ (TAT) of cancer. This result",
        "while consistent with theoretical calculations",
        "is far too low to be of practical use. The increasing application of Ac-225 for cancer therapy indicates the potential need for its increased production and availability. This presentation investigates the production of Ac-225 in commercial quantities",
        "which could potentially reduce obsolete radioactive material",
        "and displace the need for expensive importation of Ac-225 from the USA in the years ahead. Scaled up production of Ac-225 could be achieved by the use of a high current cyclotron or high-power linac. Production specifications are determined for a linac in terms of current",
        "pulse length and frequency. Yields are compared with those calculated for the Australian National Cyclotron in Sydney."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/weca01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/weca01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/weca01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WECA01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WECA02",
      "title": "Radiobiological Research with Charged Particles Beams in ITEP",
      "authors": [
        "N.V. Markov",
        "A. Golubev",
        "A.V. Kantsyrev",
        "I. Roudskoy",
        "ITEP",
        "Moscow",
        "Russia",
        "MEPhI",
        "Moscow",
        "Russia",
        "Radiobiological researches with heavy ions have been started at ITEP in 2006 on unique heavy ion accelerating facility ITEP-TWAC. The main purpose of these researches is study of the biological efficiency of carbon ions for different types of biological objects",
        "such as tumor and normal cells",
        "in the framework of the development of heavy ion therapy for cancer treatment in Russia. Another possible area of application of this research is the space radiobiology",
        "studying stochastic and deterministic effects of ionizing radiation in the space environment on human. In this work the experimental setup for radiobiological research with heavy ions in ITEP",
        "the dosimetry system for dose measurements and the results of the radiobiological researches with carbon ions are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/weca02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/weca02.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/weca02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WECA02",
      "page_number": "128",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECA03",
      "title": "Years of Hadron Therapy",
      "authors": [
        "MNIRTI",
        "Moscow",
        "Russia",
        "ITEP",
        "Moscow",
        "Russia",
        "The report observes the investigation stage (1954-1990 ys) and the adoption stage into the practical health care after the 1990 of the hadron therapy. At the present time 47 hospital-based multi-cabin proton and 7 ion (mainly",
        "carbon ions are used) centers are operating in the world. About the same number of centers are under construction. It is a common feeling that the hadron therapy is a very effective and often choiceless method of the radiation therapy. The main physicotechnical",
        "already established solutions of the multi-cabin clinical centers construction are discussed",
        "including the used accelerators",
        "the radiation units types",
        "the used environment",
        "IT",
        "etc. In this report the current problems and trends of hardware and technologies development for this treatment method are presented",
        "including proposals to use new types of accelerators",
        "to create one-cabin centers (one accelerator – one treatment unit)",
        "procedures how to solve economical problems of this rather expensive treatment method and so on. The 45-ys history of the proton therapy in Russia is briefly recounted",
        "the great contribution of Russian investigators to the problem",
        "and also the existing situation with the implementation of this radiation treatment method into the public health care in our country."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/weca03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/weca03.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/weca03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WECA03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WECA04",
      "title": "Accelerator Hadron Therapy Technique Developed at JINR",
      "authors": [
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Accelerator hadron therapy technique is one of applied researches realized at JINR. The JINR-IBA collaboration has developed and constructed the C235-V3 cyclotron for Dimitrovgrad hospital center of the proton therapy. Proton transmission in C235-V3 from radius 0.3m to 1.03 m is 72% without beam cutting diaphragms; the extraction efficiency is 62%. The main advantage of this cyclotron in comparison with serial commercial cyclotrons of IBA is related to higher current of the extracted beam. The cancer treatment is realized in JINR on the phasotron proton beam. More than 1000 patients were treated there. A project of the demonstration center of the proton therapy is discussed on base of a superconducting 250 MeV synchrocyclotron. The superconducting synchrocyclotron is planned to install instead of phasotron in Medical Technical Complex of DLNP. The project of the medical carbon synchrotron together with superconducting gantry was developed in JINR. The basis of this medical accelerator is the superconducting JINR synchrotron – Nuclotron. One important feature of this project is related to the application of superconducting gantry.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/weca04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/weca04.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/weca04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WECA04",
      "page_number": "131",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECA05",
      "title": "Operation and Development of the BINP AMS Facility",
      "authors": [
        "S. Rastigeev",
        "A.R. Frolov",
        "A.D. Goncharov",
        "V. Klyuev",
        "E.S. Konstantinov",
        "V.V. Parkhomchuk",
        "A.V. Petrozhitskii",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Institute of Archaeology and Ethnography",
        "Siberian Branch of the Russian Academy of Sciences",
        "Novosibirsk",
        "Russia",
        "The BINP AMS facility is the accelerator complex for accelerator mass spectrometry. The most distinguishing features of BINP AMS is the use of the middle energy separator of ion beams",
        "the magnesium vapors target as a stripper and time-of-flight telescope for accurate ion selection. Present status and development of AMS complex for extension of applications are reviewed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/weca05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/weca05.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/weca05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WECA05",
      "page_number": "134",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECA06",
      "title": "Extended Scope of Application of Industrial ELV Accelerator",
      "authors": [
        "D.A. Kogut",
        "S. Fadeev",
        "N.K. Kuksanov",
        "P.I. Nemytov",
        "R.A. Salimov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [
        "ELV accelerators is a D.C. machines. They were designed and manufactured by Budker Institute of Nuclear Physics of Siberian Branch of Russian Academy of Science. These machines are well known in the world. They are operating from Germany in West to Indonesia and Malaysia in East. Main application of these accelerators is the treatment of polymers. Accelerators for the polymer treatment are equipped with the foil window extraction device. Some kinds of ELV accelerators were equipped with the device for focused beam extraction into atmosphere. It allows the treatment of material with a high beam power density under atmosphere pressure. New development of ELV accelerators is concerning the low energy range and design of self-shielded accelerators. There are the set of self-shielded accelerators. The lowest energy is 150 - 200 kV. These machines are unified with usual ELV accelerators and extend their application area."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/weca06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/weca06.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/weca06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WECA06",
      "page_number": "137",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECA07",
      "title": "LIA-2 and BIM Accelerators as Part of Radiographic Complex at RFNC-VNIITF",
      "authors": [
        "A.R. Akhmetov",
        "S.D. Hrenkov",
        "P.A. Kolesnikov",
        "E.O. Kovalev",
        "O.A. Nikitin",
        "D.S. Smirnov",
        "RFNC-VNIITF",
        "Snezhinsk",
        "Chelyabinsk region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The regime of joint operation of LIA-2 and two betatrons in radiographic experiments is described. The brief review of main characteristics for all three used accelerators are presented.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/weca07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/weca07.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/weca07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WECA07",
      "page_number": "140",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECA08",
      "title": "Main Parameters and Operational Experience with New Generation of Electron Accelerators for Radiography and Cargo Inspection",
      "authors": [
        "A.N. Ermakov",
        "B.S. Ishkanov",
        "MSU",
        "Moscow",
        "Russia",
        "A.S. Alimov",
        "A.N. Kamanin",
        "V.V. Khankin",
        "N.I. Pakhomov",
        "V.G. Sayapin",
        "N.V. Shvedunov",
        "V.I. Shvedunov",
        "D.S. Yurov",
        "M.V. Lomonosov Moscow State University (MSU)",
        "Skobeltsyn Institute of Nuclear Physics",
        "Moscow",
        "Russia",
        "I.A. Frejdovich",
        "V.V. Klementiev",
        "S.V. Lamonov",
        "Yu.N. Pavshenko",
        "I.V. Shvedunov",
        "A.S. Simonov",
        "Federal State Unitary Enterprise",
        "Laboratory of Electron Accelerators MSU",
        "Ltd",
        "Moscow",
        "Russia",
        "L.Yu. Ovchinnikova",
        "I.Yu. Vladimirov",
        "Laboratory of Electron Accelerators MSU",
        "Ltd",
        "Physics Department",
        "Lomonosov Moscow State University",
        "Moscow",
        "Russia",
        "We describe main parameters and operational experience with new generation of electron accelerators for radiography and cargo inspection developed with participation of scientists",
        "engineers and technologists from Lomonosov Moscow State University and \"Research and Production Enterprise \"Toriy\". Two accelerators are described: accelerator for radiography UELR-8-2D with beam energy regulated in the range 3-8 MeV and dose rate from 0.5 to 15 Gy/min and accelerator for cargo inspection UELR-6-1-D-4-01 with pulse to pulse energy switching between 3.5 and 6 MeV",
        "with repetition rate 400 Hz and dose rate 4 Gy/min. Both accelerators use klystron as an RF source",
        "which is fed by solid state modulator."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/weca08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/weca08.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/weca08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WECA08",
      "page_number": "143",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECA09",
      "title": "Dedicated DC-110 Heavy Ion Cyclotron for Industrial Production of Track Membranes",
      "authors": [
        "B. Gikal",
        "P.Yu. Apel",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "V.A. Buzmakov",
        "S.N. Dmitriev",
        "A.A. Efremov",
        "A.A. Fateev",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "G.N. Ivanov",
        "I.V. Kalagin",
        "V.I. Kazacha",
        "N.Yu. Kazarinov",
        "M.V. Khabarov",
        "I.V. Kolesov",
        "V.A. Kostyrev",
        "A.M. Lomovcev",
        "V.N. Melnikov",
        "V.I. Mironov",
        "N.F. Osipov",
        "S.V. Pashchenko",
        "O.V. Semchenkova",
        "V.A. Sokolov",
        "A. Tikhomirov",
        "V.A. Verevochkin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "In the Laboratory of nuclear reactions JINR dedicated accelerator complex on the basis of the heavy ion cyclotron DC110 for the industrial track membrane production has been developed and created. The isochronous cyclotron DC110 accelerates the ions Ar",
        "Kr and Xe with a fixed energy of 2.5 MeV/nucleon and intensity of 10-15 mkA. The cyclotron is equipped with ECR ion source - DECRIS-5 (18 GHz) and axial injection system. The pole diameter of the magnet is 2 m. Isochronous magnetic field formed by shimming sectors on the level of 1.67 T. Accelerated ions 40Ar6+",
        "86Kr13+",
        "132Xe20+ have close mass-to-charge ratio",
        "which allows changing particles without changing the operation mode of the cyclotron. Accelerator complex DC-10 is capable of producing up to 2 million square meters of track membranes per the year."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/weca09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/weca09.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/weca09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WECA09",
      "page_number": "146",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECA10",
      "title": "Use of Accelerators U-150 and RIC-14 for Radionuclide Production",
      "authors": [
        "A.A. Razbash",
        "A.V. Ivanov",
        "B.N. Kirsanov",
        "A.I. Leonov",
        "A.N. Mamonov",
        "Cyclotron Company Ltd.",
        "Obninsk",
        "Russia",
        "One of the most important uses of charged particle accelerators is the production of radioactive isotopes for an application in different fields of sciences",
        "industry and nuclear medicine. In recent years",
        "the emphasis is on the creation of the line accelerators",
        "which covers various applications and ensures the efficient use of various nuclear reactions. At present our enterprise has two cyclotrons: U-150",
        "accelerating protons up to energy of 23 MeV and RIC-14",
        "accelerating protons up to energy of 14 MeV. Both devices are manufactured at Scientific-Research Efremov Institute of Electrophysical Apparatus (NIIEFA). The radionuclide production is realized by bombardment of the special developed universal targets using internal beam. The average beam current on the target can reach 2000 μA",
        "which provides high productivity on radionuclides. By this time the production methods of more than 30 radionuclides are developed at our enterprise. The most widely demanded radionuclides are cobalt-57",
        "gallium-67",
        "germanium-68",
        "palladium-103",
        "cadmium-109 and indium-111."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/weca10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/weca10.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/weca10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WECA10",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WECA11",
      "title": "CC-18/9M Cyclotron System",
      "authors": [
        "A.P. Strokach",
        "M.A. Emeljanov",
        "A.V. Galchuck",
        "Yu.N. Gavrish",
        "S.V. Grigorenko",
        "V.I. Grigoriev",
        "M.L. Klopenkov",
        "A.N. Kuzhlev",
        "V.G. Mudroliubov",
        "G.V. Muraviov",
        "V.I. Nikishkin",
        "V.I. Ponomarenko",
        "Yu.I. Stogov",
        "S.S. Tsygankov",
        "O.L. Veresov",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "The СС-18/9M cyclotron system has been designed",
        "manufactured and delivered to NIITFA",
        "Moscov. The system consists of an updated cyclotron and a targets system. The cyclotron is intended to produce proton and deuteron beams with an energy of 12-18/6-9 MeV and current up to 150/70 mkA. For this purpose",
        "a shielding-type electromagnet and a resonance system have been afresh designed. The target system for the production of F-18 and C-11 radionuclides has been designed in NIIEFA for the first time."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/weca11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/weca11.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/weca11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WECA11",
      "page_number": "149",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECA12",
      "title": "SEE Testing Facilities at FLNR Accelerators Complex: State of the Art and Future Plans",
      "authors": [
        "S. Mitrofanov",
        "B. Gikal",
        "G.G. Gulbekyan",
        "I.V. Kalagin",
        "N.F. Osipov",
        "S.V. Paschenko",
        "V.A. Skuratov",
        "Yu.G. Teterev",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "United Rocket and Space Corporation",
        "Institute of Space Device Engineering",
        "Moscow",
        "Russia",
        "* Proceedings of RADECS 2011 PJ-8",
        "pp.756-759",
        "2012.  ** Proceedings of PAC09",
        "Vancouver",
        "BC",
        "Canada FR5REP099",
        "pp. 5011-5013",
        "2009."
      ],
      "institutions": [
        "Funding: This work was sponsored by the Russian Federal Space Agency by special agreement between Institute of Space Device Engineering and Joint Institute for Nuclear Research.",
        "The Russian Space Agency (Roscosmos) utilizes U400 and U400M cyclotrons at accelerator complex of the Flerov Laboratory of Nuclear Reactions (FLNR) of the Joint Institute for Nuclear Research (JINR) in Dubna for heavy ion SEE testing. The ions up to the Xe and Bi with the energy up to 40 AMeV are available for the users. The detailed overview of the facility and the features of diagnostic set-up used for ion beam parameters evaluation and control during SEE testing are discussed. The road map for the strategic development of this field in FLNR is presented."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/weca12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/weca12.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/weca12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WECA12",
      "page_number": "152",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 12,
  "scrape_time": "2025-10-11 02:50:55"
}