{
  "session_info": {
    "id": "SAPAF",
    "name": "SAPAF - Saturday Parallel Fiesta Key",
    "url": "https://proceedings.jacow.org/icap2018/html/sapaf.htm"
  },
  "papers": [
    {
      "paper_id": "SAPAF01",
      "title": "Genetic Algorithm Enhanced by Machine Learning in Dynamic Aperture Optimization",
      "authors": [
        "Y. Li",
        "W.X. Cheng",
        "R.S. Rainer",
        "L. Yu",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "With the aid of machine learning techniques",
        "the genetic algorithm has been enhanced and applied to the multi-objective optimization problem presented by the dynamic aperture of the NSLS-II Ring. During the evolution employed by the genetic algorithm",
        "the population is classified into different clusters. The clusters with top average fitness are given elite status. Intervention is implemented by repopulating some potentially competitive candidates based on the accumulated data. These candidates replace randomly selected candidates among the original data pool. The average fitness of the population is improved while diversity is not lost. The quality of the population increases and produces more competitive descendants accelerating the evolution process significantly. When identifying the distribution of optimal candidates",
        "they appear to be located in isolated islands within the search space. Some of these optimal candidates have been experimentally confirmed at the NSLS-II storage ring. The machine learning techniques that exploit the genetic algorithm can also be used in other population-based optimization problems such as particle swarm algorithm."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/sapaf01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/sapaf01.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/sapaf01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SAPAF01",
      "page_number": "8",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SAPAF02",
      "title": "Optimization of Heavy-Ion Synchrotrons Using Nature-Inspired Algorithms and Machine Learning",
      "authors": [
        "S. Appel",
        "W. Geithner",
        "S. Reimann",
        "M. Sapinski",
        "R. Singh",
        "D.M. Vilsmeier",
        "GSI",
        "Darmstadt",
        "Germany",
        "The application of machine learning and nature-inspired optimization methods",
        "like for example genetic algorithms (GA) and particle swarm optimization (PSO) can be found in various scientific/technical areas. In recent years",
        "those approaches are finding application in accelerator physics to a greater extent. In this report",
        "nature-inspired optimization as well as the machine learning will be shortly introduced and their application to the accelerator facility at GSI/FAIR will be presented. For the heavy-ion synchrotron SIS18 at GSI",
        "the multi-objective GA/PSO optimization resulted in a significant improvement of multi-turn injection performance and subsequent transmission for intense beams. An automated injection optimization with genetic algorithms at the CRYRING@ESR ion storage ring has been performed. The usage of machine learning for a beam diagnostic application",
        "where reconstruction of space-charge distorted beam profiles from ionization profile monitors is performed",
        "will also be shown. First results and the experience gained will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/sapaf02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/sapaf02.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/sapaf02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SAPAF02",
      "page_number": "15",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SAPAF03",
      "title": "Comparison of Model-Based and Heuristic Optimization Algorithms Applied to Photoinjectors Using Libensemble",
      "authors": [
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "S. T. P. Hudson",
        "J.M. Larson",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illinois",
        "USA",
        "Genetic algorithms are common and often used in the accelerator community. They require large amounts of computational resources and empirical adjustment of hyperparameters. Model based methods are significantly more efficient",
        "but often labeled as unreliable for the nonlinear or unsmooth problems that can be found in accelerator physics. We investigate the behavior of both approaches using a photoinjector operated in the space charge dominated regime. All optimization runs are coordinated and managed by the Python library libEnsemble",
        "which is developed at Argonne National Laboratory."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/sapaf03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/sapaf03.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/sapaf03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SAPAF03",
      "page_number": "22",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SAPAF04",
      "title": "Single Objective Genetic Optimization of an 85% Efficient Klystron",
      "authors": [
        "A. Jensen",
        "J.J. Petillo",
        "Leidos Corp",
        "Billerica",
        "MA",
        "USA",
        "R.L. Ives",
        "M.E. Read",
        "CCR",
        "San Mateo",
        "California",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Overall efficiency is a critical priority for the next generation of particle accelerators as they push to higher and higher energies. In a large machine",
        "even a small increase in efficiency of any subsystem or component can lead to a significant operational cost savings. The Core Oscillation Method (COM) and Bunch-Align-Compress (BAC) method have recently emerged as a means to greatly increase the efficiency of the klystron RF source for particle accelerators. The COM and BAC methods both work by uniquely tuning klystron cavity frequencies such that more particles from the anti-bunch are swept into the bunch before power is extracted from the beam. The single objective genetic algorithm from Sandia National Laboratory’s Dakota optimization library is used to optimize both COM and BAC based klystron designs to achieve 85% efficiency. The COM and BAC methods are discussed. Use of the Dakota optimization algorithm library from Sandia National Laboratory is discussed. Scalability of the optimization approach to High Performance Computing (HPC) is discussed. The optimization approach and optimization results are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/sapaf04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/sapaf04.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/sapaf04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SAPAF04",
      "page_number": "25",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 18:30:18"
}