{
  "session_info": {
    "id": "WEXA",
    "name": "WEXA - Wednesday Oral Parallel A",
    "url": "https://proceedings.jacow.org/ipac2021/html/wexa.htm"
  },
  "papers": [
    {
      "paper_id": "WEXA01",
      "title": "Successful Crabbing of Proton Beams",
      "authors": [
        "CERN",
        "Meyrin",
        "Switzerland",
        "Many future particle colliders require beam crabbing to recover the geometric luminosity loss from the non-zero crossing angle at the interaction point. A first demonstration experiment of crabbing with hadron beams was successfully carried out with high energy protons. This breakthrough result is fundamental to achieve the physics goals of the high luminosity LHC upgrade project (HL-LHC) and the future circular collider (FCC). The expected peak luminosity gain (related to collision rate) is 65% for HL-LHC",
        "and even greater for the FCC. Novel beam physics experiments with proton beams in CERN’s Super Proton Synchrotron (SPS) were performed to demonstrate several critical aspects for the operation of crab cavities in the future HL-LHC including transparency with a pair of cavities",
        "a full characterization of the cavity impedance with high beam currents and controlled emittance growth from crab cavity induced RF noise."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexa01.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXA01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXA02",
      "title": "Operational Electron Cooling in the Relativistic Heavy Ion Collider",
      "authors": [
        "A.V. Fedotov",
        "K.A. Drees",
        "W. Fischer",
        "X. Gu",
        "D. Kayran",
        "J. Kewisch",
        "C. Liu",
        "K. Mernick",
        "M.G. Minty",
        "V. Schoefer",
        "H. Zhao",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "Since the invention of the electron cooling technique its application to cool hadron beams in colliders was considered for numerous accelerator physics projects worldwide. However",
        "achieving the required high-brightness electron beams of required quality and cooling of ion beams in collisions was deemed to be challenging. An electron cooling of ion beams employing a high-energy approach with RF-accelerated electron bunches was recently successfully implemented at BNL. It was used to cool ion beams in both collider rings with ion beams in collision. Electron cooling in RHIC became fully operational during the 2020 physics run and led to substantial improvements in luminosity. This presentation will discuss implementation",
        "optimization and challenges of electron cooling for colliding ion beams in RHIC."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexa02.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXA02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXA03",
      "title": "Physics and Technology Challenges in Generating High Intensity Positron Beams",
      "authors": [
        "Université Paris-Saclay",
        "CNRS/IN2P3",
        "IJCLab",
        "Orsay",
        "France",
        "Positron sources are essential to the current and future lepton collider projects (ILC",
        "CLIC",
        "SuperKEKB",
        "FCC-ee",
        "etc.) with challenging critical requirements of high-beam intensity and low emittance necessary to achieve high luminosity. In the conventional positron-generation system",
        "a possible scheme to increase the positron intensity is to increase the incident electron beam power (intensity and/or energy). However",
        "the allowable heat load as well as the thermo-mechanical stresses in the target severely limit the allowable beam power of the incident electrons. The positron source community should consolidate the effort and explore different methods of positron production",
        "both classical techniques and especially novel ones",
        "primarily for future high-energy physics applications requiring orders of magnitude higher intensity than what was demonstrated up to now",
        "and for considering future hadronic applications (including the EIC) requiring both polarization and intensity. The studies should be focused on different source types",
        "targets",
        "capture approaches including the existing limitations and potential for polarized positron production identifying the main axes for future R&D.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexa03.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXA03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEXA04",
      "title": "The RCS Design Status for the Electron Ion Collider",
      "authors": [
        "V.H. Ranjbar",
        "M. Blaskiewicz",
        "Z.A. Conway",
        "D.M. Gassner",
        "C. Hetzel",
        "B. Lepore",
        "H. Lovelace III",
        "I. Marneris",
        "F. Méot",
        "C. Montag",
        "J. Skaritka",
        "N. Tsoupas",
        "E. Wang",
        "F.J. Willeke",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "J.M. Grames",
        "J. Guo",
        "F. Lin",
        "V.S. Morozov",
        "T. Satogata",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The design of the Electron-Ion Collider Rapid Cycling Synchrotron (RCS) to be constructed at Brookhaven National Laboratory is advancing to meet the injection requirements for the Electron Storage Ring (ESR). Over the past year activities are focused on developing the approach to inject two 28 nC bunches every second",
        "up from the original design of one 10nC bunch every second. The solution requires several key changes concerning the injection and extraction kickers",
        "charge accumulation via bunch merging and a carefully calibrated RF acceleration profile to match the longitudinal emittance required by the ESR."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexa04.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXA04",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXA05",
      "title": "Solving for Collider Beam Profiles from Luminosity Jitter with Ghost Imaging",
      "authors": [
        "D.F. Ratner",
        "A. Chao",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Large accelerator facilities must balance the need to achieve user performance requirements while also maximizing delivery time. At the same time",
        "accelerators have advanced data-acquisition systems that acquire synchronous data at high-rate from a large variety of diagnostics. Here we discuss the application of ghost-imaging (GI) to measure beam parameters",
        "switching the emphasis from beam control to data collection: rather than intentionally manipulating the accelerator",
        "we instead passively monitor jitter gathered over thousands to millions of events to reconstruct the target of interest. Passive monitoring during routine operation builds large data sets that can even deliver higher resolution than brief periodic scans",
        "and can provide experiments with event-by-event information. In this presentation we briefly present applications of GI to light-sources",
        "and then discuss a potential new application for colliders: measuring the transverse beam shapes at a collider’s interaction point to determine both the integrated luminosity and the spatial distribution of collision vertices."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexa05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexa05.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexa05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXA05",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXA06",
      "title": "Study of Pb-Pb and Pb-p Collision Debris in the CERN LHC in View of HL-LHC Operation",
      "authors": [
        "M. Sabaté-Gilarte",
        "R. Bruce",
        "F. Cerutti",
        "A. Lechner",
        "CERN",
        "Meyrin",
        "Switzerland",
        "For the first time",
        "a full characterization of the Pb-Pb and Pb-p collision debris as well as its impact in terms of energy deposition in the long straight section (LSS) of CERN’s Large Hadron Collider has been carried out. By means of Monte Carlo simulations with FLUKA",
        "both inelastic nuclear interaction and electromagnetic dissociation were taken into account as source term for lead ion operation",
        "while for Pb-p operation only nuclear interaction is of importance. The radiation exposure of detectors exclusively destined for ion beam runs is assessed",
        "allowing drawing implications of their use. This work gave the opportunity for an unprecedented validation of simulation results against measurement of beam loss monitors (BLM) in the experimental LSS during ion operation. Pb-Pb operation refers to the 2018 ion run at 6.37 TeV per charge with a +160 microrad half crossing angle in the vertical plane at the ATLAS interaction point. Instead",
        "Pb-p operation was benchmarked for the 2016 ion run at 6.5 TeV per charge with -140 microrad half crossing angle in the vertical plane at the same location."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexa06.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXA06",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXA07",
      "title": "Beam Background Measurements at SuperKEKB/Belle-II in 2020",
      "authors": [
        "H.N. Nakayama",
        "T. Koga",
        "KEK",
        "Ibaraki",
        "Japan",
        "Nagoya University",
        "Nagoya",
        "Japan",
        "A. Natochii",
        "S. Vahsen",
        "University of Hawaii",
        "Honolulu",
        "USA",
        "The SuperKEKB electron-positron collider began collision operation in 2018 and achieved the world-record luminosity of 2.4x1034~cm-2s-1 in June 2020. We pursue higher luminosity by squeezing beam sizes and increasing beam currents. Beam backgrounds induced by stray particles will also increase and might cause severe radiation damage to Belle II detector components and worsen the quality of collected physics data. To mitigate these backgrounds",
        "we have carefully designed our interaction region and installed movable collimators in the machine. We present recent measurements of beam background at SuperKEKB. We have performed dedicated machine studies to measure each background component separately and found that beam-gas scattering and Touschek scattering in the positron ring are the dominant sources of background rates in Belle II. We also present the latest observations of injection background",
        "which determines the timing of a required Belle II data acquisition trigger veto and therefore affects the integrated luminosity. We show the beam background extrapolation toward the expected higher-luminosity operation and our plans for further background mitigation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2021/talks/wexa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2021/papers/wexa07.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2021/posters/wexa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2021-WEXA07",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 7,
  "scrape_time": "2025-10-10 18:54:11"
}