{
  "session_info": {
    "id": "TUPME",
    "name": "TUPME - Poster Session",
    "url": "https://proceedings.jacow.org/IPAC2013/html/tupme.htm"
  },
  "papers": [
    {
      "paper_id": "TUPME001",
      "title": "Effect of Self-consistency on Space Charge Induced Beam Loss",
      "authors": [
        "GSI",
        "Darmstadt",
        "Germany",
        "In long term storage space charge driven incoherent effect may lead to a slow beam diffusion that causes emittance growth and beam loss. However",
        "when beam loss are relevant the full mechanism cannot be understood only driven by an incoherent effect. In this proceeding the issue of the self-consistency is discussed",
        "and its impact presented for simplified examples and for the SIS100."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme001.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME002",
      "title": "Design Integration at the International Linear Collider",
      "authors": [
        "B. List",
        "L. Hagge",
        "J. Kreutzkamp",
        "N.J. Walker",
        "DESY",
        "Hamburg",
        "Germany",
        "In preparation for the Technical Design Report of the International Linear Collider",
        "a comprehensive design of the accelerator has been compiled. DESY has contributed a systematic design integration approach",
        "which helps to achieve a complete",
        "correct and consistent design. We use the lattice as the leading element for design integration. Geometry information including 3D visualization models are derived from the lattice",
        "and are used to ensure that the beamlines fit and suited for access and installation. The 3D models are also used as basis for tunnel and cavern layout. As detailed designs of components become available",
        "the lattice is adjusted and the overall models are iterated. Lists of components are derived from the lattice and are used to generate a component bill of materials",
        "which in turn serves as basis for cost estimation and installation planning. An integrated 3D model of the entire accelerator and all the civil construction elements helps to optimize the design for example with regard to space efficiency",
        "ease of access for installation",
        "and life safety. Setting up design integration in an early project stage results in a better design helps to reduce costs."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme002.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME003",
      "title": "Simulations of the  ILC Positron Source at Low Energies",
      "authors": [
        "A. Ushakov",
        "V.S. Kovalenko",
        "G.A. Moortgat-Pick",
        "University of Hamburg",
        "Hamburg",
        "Germany",
        "S. Riemann",
        "F. Staufenbiel",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "The International Linear Collider (ILC) baseline design includes an undulator-based positron source. The accelerated electron beam will be used for the positron generation before it goes to the collision point. For the whole ILC energy range the source has to generate 1.5 positrons per electron. However",
        "the efficiency of positron production goes down with decreasing electron drive beam energy. This effect can be compensated to some extend by the choice of undulator parameters and an optimized capture section. The simulation study considers for the range of electron beam energies down to low values of 120 GeV the feasibility to achieve the required positron yield. In particular",
        "the optimum parameters for undulator and capture section are presented depending on the drive electron beam energy."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme003.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME004",
      "title": "Spin Tracking at the International Linear Collider",
      "authors": [
        "V.S. Kovalenko",
        "G.A. Moortgat-Pick",
        "A. Ushakov",
        "University of Hamburg",
        "Hamburg",
        "Germany",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "DESY",
        "Hamburg",
        "Germany",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "In the baseline design for the International Linear collider an helical undulator-based positron source has been chosen that can provide positrons with a polarization of 60% as an upgrade option motivated by physics reasons. But even the baseline configuration would already provide about 30%. In order to match the high precision requirements from physics and to optimize the physics outcome one has to control systematic uncertainties to a very high level. Therefore it is needed to run both beams polarized but provide also an unpolarized set-up for control reasons. In our study we present results on precise spin tracking and propose also an minimal machine set-up to run in an unpolarized mode within the baseline design.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme004.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME005",
      "title": "Preparations for Beam Tests of a CLIC Damping Wiggler Prototype at ANKA",
      "authors": [
        "A. Bernhard",
        "E. Huttel",
        "P. Peiffer",
        "KIT",
        "Karlsruhe",
        "Germany",
        "A.V. Bragin",
        "N.A. Mezentsev",
        "V.M. Syrovatin",
        "K. Zolotarev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "P. Ferracin",
        "D. Schoerling",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Compact Linear Collider (CLIC) will require ultra-low emittance electron and positron beams. The targeted emittance will be achieved by radiative damping in the CLIC damping rings. For an efficient damping high-field short-period superconducting damping wigglers will be employed. In the conceptual design phase of CLIC",
        "the basic layout of these wigglers has been elaborated at CERN. In the course of the CLIC technical feasibility studies a full-scale damping wiggler prototype will be installed and tested in the ANKA storage ring. The device is currently under design and construction at the Budker Institute of Nuclear Physics",
        "Russia. Above the magnetic requirements",
        "the main design challenges for the prototype are scalability –- particularly of the cooling concept –-",
        "modularity and the capability of sustaining a high radiative heat load. The experiments at ANKA aim at a validation of the technical concepts applied to meet these requirements. Beyond that an extended experimental program on beam dynamics and alternative technical solutions is envisaged. This contribution gives an overview over the current status of the project and the further planning."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme005.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME006",
      "title": "Simulation of Stress in Positron Targets for Future Linear Colliders",
      "authors": [
        "F. Staufenbiel",
        "S. Riemann",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "O.S. Adeyemi",
        "V.S. Kovalenko",
        "G.A. Moortgat-Pick",
        "A. Ushakov",
        "University of Hamburg",
        "Hamburg",
        "Germany"
      ],
      "institutions": [],
      "abstract": "Future linear collider projects require intense positron sources with yields of about 1014 positrons per second. The positron source for the ILC is based on a helical undulator passed by the accelerated electron beam to create an intense circularly polarized photon beam. The positron beam produced by these photons is longitudinally polarized. The intense photon beam causes rapid temperature increase in the target material resulting in periodic stress. The average and peak thermal and mechanical load are simulated. Implications due to long-term target irradiation are considered.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme006.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME007",
      "title": "Beam Lifetime in Low Emittance Rings",
      "authors": [
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "In this paper I will review the main effects in low emittance rings that determine the beam lifetime by causing beam losses along the ring. As an example",
        "the case for a B-factory based on the crab-waist collision scheme has been studied. During the machine design all the effects that determine the beam lifetime and induce backgrounds in the detector have been analyzed in details. The crab-waist scheme provides an higher luminosity",
        "but at the same time it induces higher beam losses at the final focus. For this reason single beam effects such as Touschek and beam-gas scattering have been studied in details",
        "by means of a macroparticle tracking code developed for this purpose*. Also Radiative Bhabha scattering",
        "that is the dominant effect to lifetime and backgrounds has been studied with the same technique to check possible multiturn losses at IR. An efficient collimation system has been designed to intercept scattered particles that would be lost in the IR in both the horizontal and the vertical plane. Recently",
        "the Touschek tracking simulation code has been implemented to study the lifetime behavior for extremely low-emittance rings.",
        "* M. Boscolo and P. Raimondi",
        "“Monte Carlo simulation for the Touschek effect with the crab-waist scheme”",
        "Phys. Rev. ST-AB 15 104201 (2012)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme007.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME008",
      "title": "Beam Dynamics Studies for the Injection System of a High Luminosity Flavour Factory",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "M.E. Biagini",
        "S. Guiducci",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "The requirements",
        "in terms of average luminosity and lifetimes",
        "of high luminosity e+e− colliders such as the Flavor factories",
        "pose stringent constraints to the design of the injection complex. For the SuperB B-factory project at Tor Vergata",
        "Italy",
        "a design was developed to deliver full energy bunches (4.2 GeV e- and 6.7 GeV e+) to the main rings every 30 ms aiming at a high and nearly constant luminosity. The system included a polarized electron gun",
        "a positron production system",
        "linac sections",
        "a Damping Ring (DR) and transfer lines connecting to the collider Main Rings (MR). After the decision",
        "due to budget issues",
        "to rescale the project to a lower energy (2.3 GeV/beam) for a tau/charm flavour factory",
        "the same design principles have been applied. In this paper beam dynamics studies from the DR to the MR entrance is presented",
        "including optimization of the transfer lines and of the bunch compressor. A start to end simulation shows that the beam quality satisfies theinjection requirements",
        "even in the presence of energy errors and collective effects like CSR and wakefields."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme008.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME009",
      "title": "Measurement and Vibration Studies on the Final Focus Doublet at DAΦNE and new collider Implications",
      "authors": [
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "A Super Flavour Factory",
        "to be built in the Tor Vergata University campus near Frascati",
        "Italy",
        "will have nano-beams in order to reach the design luminosity. The knowledge and compensation of the vibrations induced on the beams by the anthropic noise is then fundamental. The DAΦNE Phi-factory at LNF",
        "Frascati",
        "was upgraded in the second half of 2007 in order to implement the large Piwinski angle and crab waist collision scheme and in 2010 the KLOE experiment was rolled in for a new data taking and physic program. A measurement campaign has been performed on DAΦNE to find out the actual vibration sensitivity of the final focus doublets. Vibration measurements were performed on the Final Focus doublet because of luminosity losses and photon beam lines instability evidences. Results and stabilization technique to mitigate the effects of the ground motion induced by the “cultural noise” are presented. Implications on the design and stabilization of a Flavour Factory Final Focus doublets will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme009.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME010",
      "title": "High-intensity and Low-emittance Upgrade of 7-GeV Injector Linac towards SuperKEKB",
      "authors": [
        "K. Furukawa",
        "M. Akemoto",
        "D.A. Arakawa",
        "Y. Arakida",
        "A. Enomoto",
        "S. Fukuda",
        "H. Honma",
        "R. Ichimiya",
        "N. Iida",
        "M. Ikeda",
        "E. Kadokura",
        "K. Kakihara",
        "T. Kamitani",
        "H. Katagiri",
        "M. Kurashina",
        "S. Matsumoto",
        "T. Matsumoto",
        "H. Matsushita",
        "S. Michizono",
        "K. Mikawa",
        "T. Miura",
        "F. Miyahara",
        "T. Mori",
        "H. Nakajima",
        "K. Nakao",
        "T. Natsui",
        "Y. Ogawa",
        "S. Ohsawa",
        "F. Qiu",
        "M. Satoh",
        "T. Shidara",
        "A. Shirakawa",
        "H. Sugimoto",
        "T. Suwada",
        "T. Takatomi",
        "T. Takenaka",
        "M. Tanaka",
        "Y. Yano",
        "K. Yokoyama",
        "M. Yoshida",
        "L. Zang",
        "X. Zhou",
        "KEK",
        "Ibaraki",
        "Japan",
        "TIT",
        "Tokyo",
        "Japan",
        "After a decade of successful operation at KEKB a new electron/positron collider",
        "SuperKEKB",
        "is being constructed to commission within FY2014. It aims at a luminosity of 8 x 1035 /s.cm2",
        "40-times higher than that of KEKB",
        "in order to study the flavor physics of elementary particles further",
        "by mainly squeezing the beams at the collision point. The injector linac should provide high-intensity and low-emittance beams of 7-GeV electron and 4-GeV positron by newly installing a RF-gun",
        "a flux concentrator",
        "and a damping ring with careful emittance and energy management. It also have to perform simultaneous top-up injections into four storage rings by pulse-to-pulse beam modulations not to interfare between three facilities of SuperKEKB",
        "Photon Factory and PF-AR. This paper describes the injector design decisions and present status of the construction."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme010.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME011",
      "title": "Simulated Beam-beam Limit for Circular Higgs Factories",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "CERN",
        "Geneva",
        "Switzerland",
        "We report simulation studies of the beam-beam limit for two proposed circular e+e− Higgs factories with circumference of 27 and 80 km",
        "respectively",
        "called LEP3 and TLEP. In particular we investigate the dependence of the steady-state luminosity and transverse beam sizes on the synchrotron tune (or momentum compaction factor) and on the betatron tunes",
        "as well as the consequences of the strong radiation damping and the implications of the large hourglass effect."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme011.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME012",
      "title": "Space Charge Simulation based on a Measured Optics in J-PARC MR",
      "authors": [
        "K. Ohmi",
        "S. Igarashi",
        "Y. Sato",
        "J. Takano",
        "KEK",
        "Ibaraki",
        "Japan",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "Linear optics parameters",
        "beta",
        "alpha",
        "phase",
        "x-y coupling and dispersion are measured by phase space monitor and/or other tools. Nonlinear effects due to the space charge and magnets are dominantly determined by linear optics. For example",
        "the beam distribution is mainly determined by linear optics",
        "and error of beta function at a sextuple magnet is larger than error of magnet strength generally. This means space charge simulation based on the measured optics takes into account of the major part of errors. We discuss how beam loss degrade and which resonances are induced by the errors in the simulations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme012.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME013",
      "title": "Coherent Thomson Scattering using Beam Echo",
      "authors": [
        "K. Ohmi",
        "S. Kamada",
        "KEK",
        "Ibaraki",
        "Japan",
        "Kanazawa University",
        "Kanazawa",
        "Japan"
      ],
      "institutions": [],
      "abstract": "Longitudinal phase space of the beam is modulated by laser interacting in undulators. The beam can have higher frequency component using the beam echo than than the laser as dicussed by G. Stupakov et al. The modulated beam has a potential to emit coherent radiation with the wave length. We evaluate coherent short wave length (~nm) and/or short pulse (attosec) light source using the beam echo in a low energy accelerator ~100MeV.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME014",
      "title": "Coherent Synchrotron Radiation Predicted at the SuperKEKB Damping Ring",
      "authors": [
        "H. Ikeda",
        "M. Kikuchi",
        "K. Ohmi",
        "K. Oide",
        "D. Zhou",
        "KEK",
        "Ibaraki",
        "Japan",
        "The damping ring of SuperKEKB is under construction in order to inject low emittance positron beam into the main ring. We calculated the bunch lengthening and the energy spread caused by the longitudinal wake",
        "which is dominated by the CSR wake field. The result was within the tolerance level."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme014.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME015",
      "title": "Proposal of Polarized Gamma-ray Source for ILC Based on CSR Inverse Compton Scattering",
      "authors": [
        "M. Shimada",
        "K. Yokoya",
        "KEK",
        "Ibaraki",
        "Japan",
        "JAEA",
        "Ibaraki-ken",
        "Japan",
        "University of Hawaii at Manoa",
        "Honolulu",
        "USA",
        "The positron source of International Linear Collider (ILC) requires a circular polarized gamma-ray with a flux more than 1016 phs./s and a helical undulator-based gamma-ray source is proposed in the baseline design. Although the undulator scheme is technically feasible",
        "it is not easy for a stand-alone operation because of the required electron energy",
        "~ 150GeV. In this paper",
        "we propose an alternative method",
        "the inverse Compton scattering with a high-power mid-infrared optical pulse generated from coherent synchrotron radiation (CSR). To achieve the high flux gamma-ray",
        "CSR with a few MHz is stacked in a high-finesse optical cavity made of a photonic crystal. In the proposed scheme",
        "a stand-alone operation is feasible because the electron energy is less than 10GeV."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme015.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME016",
      "title": "Crosstalk Between Beam-beam Interaction and Lattice Nonlinearities in the SuperKEKB",
      "authors": [
        "D. Zhou",
        "K. Ohmi",
        "Y. Ohnishi",
        "K. Oide",
        "H. Sugimoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "Momentum-dependent lattice nonlinearities have been proven to be important for the luminosity performance in the KEKB B-factory. As an upgrade of KEKB",
        "the SuperKEKB adopts nano-beam scheme",
        "in which the colliding beams are squeezed to extremely small sizes at the interaction point. Consequently",
        "the lattice nonlinearities in SuperKEKB become more stronger than in KEKB. Using two codes",
        "SAD and BBWS",
        "we did various simulations to study the crosstalk between beam-beam interaction and lattice nonlinearities. It is found that lattice nonlinearities can cause remarkable luminosity loss in the SuperKEKB."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme016.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME017",
      "title": "Validation of the Microwave Instability in the Damping Ring of SuperKEKB using VFP Solver",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "H. Ikeda",
        "K. Ohmi",
        "K. Oide",
        "D. Zhou",
        "KEK",
        "Ibaraki",
        "Japan",
        "Microwave instability driven by CSR impedance in the damping ring of Super-KEKB is a concern due to its high bunch current. To understand the beam dynamics",
        "we simulate the microwave instability using Vlasov-Fokker-Planck (VFP) solver. The longitudinal wake potential is calculated as a sum of the contributions due to vacuum chamber components distributed around the ring",
        "including geometry wake field and CSR wake. To improve the accuracy of the simulation of microwave instability",
        "the coherent synchrotron radiation impedance is calculated to very high frequency to get more accurate wake field with a short bunch. The CSR wake is much larger than the geometry wake. The threshold is just above the design current and saw-tooth type of instability is found above the threshold."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme017.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME018",
      "title": "Construction of New 90 MeV Injector Linac for the 1.2 GeV Booster Synchrotron at Tohoku University",
      "authors": [
        "S. Kashiwagi",
        "H. Hama",
        "F. Hinode",
        "M. Kawai",
        "T. Muto",
        "I. Nagasawa",
        "K. Nanbu",
        "Y. Shibasaki",
        "K. Takahashi",
        "Tohoku University",
        "Research Center for Electron Photon Science",
        "Sendai",
        "Japan",
        "NTHU",
        "Hsinchu",
        "Taiwan",
        "The Great East Japan Earthquake (March 11",
        "2011) has inflicted enormous damage on the accelerator facility of Research Center for Electron Photon Science",
        "Tohoku University. A 300 MeV linac operated for 46 years as an accelerator for radioisotope production and also as an injector of the 1.2 GeV booster synchrotron for nuclear physics experiments. The accelerator will be rebuilt with all the recyclable components. New small linac is constructed as the injector for the booster synchrotron. The injector consists of thermionic rf-gun",
        "two 3m-long accelerating structures",
        "and transport line to the synchrotron. The maximum energy of injector is 90 MeV with beam loading. The detail of the injector linac is introduced in this conference."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme018.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME019",
      "title": "Simulation for Control of Longitudinal Beam Emittance in J-PARC MR",
      "authors": [
        "M. Yamamoto",
        "M. Nomura",
        "A. Schnase",
        "T. Shimada",
        "F. Tamura",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "E. Ezura",
        "K. Hara",
        "K. Hasegawa",
        "C. Ohmori",
        "A. Takagi",
        "K. Takata",
        "M. Toda",
        "M. Yoshii",
        "KEK",
        "Ibaraki",
        "Japan",
        "The J-PARC MR receives a high intensity beam from the RCS. The designed longitudinal emittance of the RCS is 5 eVs",
        "whereas the MR rf bucket has enough margin to accept up to 10 eVs. Although the RCS emittance can be increased by using PM method and a large emittance is desirable to increase the bunching factor and to avoid instability",
        "it is difficult to receive such large emittance beam in the MR because of the MR kicker performance. We have performed the particle tracking simulation of longitudinal emittance control for enlarging the beam emittance by PM method and for keeping the bunching factor high using 2nd harmonic rf during the MR injection period."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme019.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME020",
      "title": "Design of a TeV Beam Driven Plasma-wakefield Linear Collider",
      "authors": [
        "University of Oslo",
        "Oslo",
        "Norway",
        "W. An",
        "C. Joshi",
        "W.B. Mori",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "J.-P. Delahaye",
        "S.J. Gessner",
        "M.J. Hogan",
        "T.O. Raubenheimer",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "MPI",
        "Muenchen",
        "Germany",
        "A novel design of a 500 GeV c.m. beam-driven PWFA linear collider with effective accelerating gradient on the order of 1 GV/m and extendable in the multi-TeV energy range is presented. The main bunches collide in CW mode at several kHz repetition frequency. They are accelerated and focused with several GV/m fields generated in plasma cells by drive bunches with very good transfer efficiency. The drive bunches are themselves accelerated by a CW superconducting rf recirculating linac. We consider the overall optimizations for the proposed design",
        "compare the efficiency with similar collider designs like ILC and CLIC and we outline the major R&D challenges."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme020.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME021",
      "title": "Optimization Parameter Design of a Circular e+e− Higgs Factory",
      "authors": [
        "D. Wang",
        "Y.W. An",
        "J. Gao",
        "H. Geng",
        "Y.Y. Guo",
        "Q. Qin",
        "N. Wang",
        "S. Wang",
        "M. Xiao",
        "G. Xu",
        "S.Y. Xu",
        "IHEP",
        "Beijing",
        "People's Republic of China"
      ],
      "institutions": [],
      "abstract": "In this paper we will show a genral method of how to make an optimized parameter design of a circular e+e− Higgs Factory by using analytical expression of maximum beam-beam parameter and beamstrahlung beam lifetime started from given design goal and technical limitations. A parameter space has been explored.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme021.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME022",
      "title": "Study on the Single Bunch Transverse Emittance Growth in BAPS",
      "authors": [
        "J. Gao",
        "D. Wang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Beijing Advanced photon Source (BAPS) is a proposed next synchrotron radiation facility which has much smaller transverse emittance after SSRF in China",
        "with 5 GeV energy and 1.5 km circumference. In order to explore how small the transverse emittance we can get on BAPS",
        "this paper studies the single bunch transverse emittance growth due to short range wakefield according to J. Gao’ theory. The mechanism of wakefield induced single bunch emittance is explained first and then the transverse emittance at the design beam current is estimated. Also",
        "the tolerances for the transverse loss factor and the vacuum chamber misalignment (or the closed orbit distortion) are presented."
      ],
      "institutions": [
        "Funding: Supported by the National Foundation of Natural Sciences Contract 11175192."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme022.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME024",
      "title": "Re-optimization of the Final Focus System Optics with Vertical Chromatic Correction",
      "authors": [
        "Y. Wang",
        "J. Gao",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "LAL",
        "Orsay",
        "France",
        "The purpose of the final focus (FF) system of the future linear collider (ILC and CLIC) is to demagnify the beam to the required size at the IP. This can be done in a compact way based on a local chromaticity correction. Two important issues are beam-beam induced radiation effects and the optical correction strategy to mitigate static and dynamic imperfections. For a small enough beam energy spread",
        "we investigate the possibility to get a smaller vertical beam size",
        "at the expense of a larger horizontal beam size",
        "by re-optimising the final focus optics with chromatic correction mainly in the vertical plane. Firstly",
        "we track the beam with MAD-X",
        "with and without chromaticity correction",
        "to estimate the optimum betax and betay values by rematching the linear optics",
        "and cross-check and improve the rematching procedure with MAPCLASS. Then",
        "we study the original design and an alternative simplified optical system",
        "using a set of enlarged betax values",
        "and optimize the sextupoles as a function of betay to minimize the vertical beam size for different assumptions on the energy spread."
      ],
      "institutions": [
        "Funding: The France China Particle Physics Laboratory (FCPPL) and The National Natural Science Foundation of China (NSFC, Project 11175192)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme024.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME025",
      "title": "Calculation of the Equilibrium Parameters for the Compact Ring of TTX",
      "authors": [
        "H.S. Xu",
        "W.-H. Huang",
        "C.-X. Tang",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "IUCEEM",
        "Bloomington",
        "Indiana",
        "USA",
        "Intra-Beam Scattering (IBS) can cause emittance growth in high intensity low energy beams. We study its effect on the compact low energy electron storage ring",
        "proposed for Tsinghua Thomson Scattering X-ray source (TTX). For a single bunch with peak current at about 17A and re-entrant type normal conducting RF cavity with peak voltage at 15kV",
        "the equilibrium horizontal and vertical emittances are 2.9 and 0.3 μm",
        "and the rms momentum spread and bunch length are about 0.2%",
        "and 23ps. In this paper",
        "we report the methods and results of the IBS calculation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme025.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME026",
      "title": "Optimization on RF parameters of a Choke-Mode Structure for the Clic Main LINAC",
      "authors": [
        "H. Zha",
        "H.B. Chen",
        "J. Shi",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "A tapered choke-mode structure for the main linac of Compact Linear Collider (CLIC) had been designed. Wakefield suppression of this structure fits the beam dynamic requirements. But it has a lower RF performance compared to the baseline design of CLIC main linac. A genetic algorithm is used in the procedure to find the optimum solution. A new choke-mode structure with 24 regular cells working on 100MV/m has been design",
        "which fits beam dynamic constraints and has higher RF efficiency and lower surface field."
      ],
      "institutions": [
        "Funding: This work was support by the National Natural Science Foundation of China (Grant No. 11135004)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme026.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME027",
      "title": "Advanced Studies on New Generation of Electron-positron Accelerators and Colliders for Fundamental and Applied Researches",
      "authors": [
        "A. Dudarev",
        "N. Balalykin",
        "U.A. Budagov",
        "V. Kobets",
        "M.V. Lyablin",
        "B.M. Sabirov",
        "G. Shirkov",
        "E. Syresin",
        "G.V. Trubnikov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "JINR actively leads the R&D works in particle accelerator physics and engineering",
        "construction of the free electron laser with the aim to prepare proposals for the project of JINR participation in international collaboration on construction of the future Linear Collider (CLIC/ILC). JINR scientists and engineers study in free electron laser physics",
        "development and construction of systems applied for formation and diagnostics of ultra short dense bunches in the linear electron accelerators. JINR physicists also take part in several fields of activity in ILC: works on photo injector prototype",
        "participation in design and construction of cryomodules",
        "laser metrology",
        "and possible ILC location near Dubna."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme027.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME028",
      "title": "RF Orbit Separation for CPT-Test Experiment at VEPP-4M",
      "authors": [
        "V.E. Blinov",
        "E.A. Bekhtenev",
        "G.V. Karpov",
        "V.A. Kiselev",
        "S.A. Krutikhin",
        "G.Y. Kurkin",
        "E.B. Levichev",
        "O.I. Meshkov",
        "S.I. Mishnev",
        "V.V. Neyfeld",
        "S.A. Nikitin",
        "I.B. Nikolaev",
        "D.N. Shatilov",
        "G.M. Tumaikin",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "A.P. Chabanov",
        "O.P. Gordeev",
        "A.I. Mickailov",
        "Budker INP & NSU",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "In a special program of experiments which is under development in a background regime at the VEPP-4M storage ring we set an aim to realize a potential possibility to make the CPT invariance test with the accuracy better than 10-8. The test will be based on a precise comparison of the spin precession frequencies of simultaneously stored electrons and positrons. To exclude the presence of static electric fields increasing a systematic error we have developed and tested a special RF system driven at the half revolution frequency to subsitute for the electrostatic orbit separation system. The latter is needed for the electron and positron orbit separation at the parasitic interaction point where the beam-beam effects drastically cut the beam currents.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme028.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME029",
      "title": "VEPP-4: Application Beyond the High Energy Physics",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The current status of VEPP-4M electron-positron collider has been described. During fall of 2011 the accelerator was shut down for planned reconstruction of KEDR detector. The next long run of the collider will be dedicated to the experiments at high energy physics within area of 2-5 GeV. Nevertheless",
        "the set of experiments at booster VEPP-3 were continued. VEPP-3 was operated as an SR source",
        "the experiment with internal target was performed and electron/positron scattering at proton was studied. The short runs of VEPP-4M were used as for commissioning of the new “warm” 3T wiggler as for experiments with an extracted electron beam dedicated for testing of different high energy physics detectors. The experiment of comparing of anomalous magnetic moment of electron and positron is con-tinued at VEPP-4M. The system of RF beam shifting is installed at a straight section of the accelerator. It is applied for elimination of parasitic interaction points of electron and positron beams. The first experiments with this system are described. KEDR detector reconstruction should be finished at autumn of 2013. The future experiments with KEDR detector are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme029.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME030",
      "title": "Emittance Reconstruction from Measured Beam Sizes",
      "authors": [
        "J. Giner Navarro",
        "A. Faus-Golfe",
        "J. Fuentes",
        "J. Navarro",
        "J. Resta",
        "IFIC",
        "Valencia",
        "Spain",
        "In this paper we analyze the projected emittance (2D) and the intrinsic emittance (4D) reconstruction method by using the beam size measurements at different locations. We have studied analytically the conditions of solvability of the systems of equations involved in this process and we have obtained some rules about the locations of the measurement stations to avoid unphysical results. Presently",
        "simulations are being made to test the robustness of the algorithm in realistic scenarios with high coupling and measurement errors. The special case of a multi-OTR system in ATF2 is being studied in much detail. The results of these studies will be very useful to better determine the location of the emittance measurement stations in the diagnostic sections of Future Linear Colliders."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme030.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME031",
      "title": "Considerations for a Higgs Facility Based on Laser Wakefield Acceleration",
      "authors": [
        "S. Hillenbrand",
        "A.-S. Müller",
        "KIT",
        "Karlsruhe",
        "Germany",
        "R.W. Assmann",
        "S. Hillenbrand",
        "D. Schulte",
        "CERN",
        "Geneva",
        "Switzerland",
        "Laser Wakefield Accelerators have seen tremendous progress over the last decades. It is hoped that they will allow to significantly reduce the size and cost of a future liner collider. Based on scaling laws",
        "laser-driven plasma accelerators are investigated as drivers for smaller scale facilities capable of producing Z and Higgs bosons."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme031.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME032",
      "title": "Update on Beam Induced RF Heating in the LHC",
      "authors": [
        "B. Salvant",
        "O. Aberle",
        "G. Arduini",
        "R.W. Aßmann",
        "V. Baglin",
        "M.J. Barnes",
        "W. Bartmann",
        "P. Baudrenghien",
        "O.E. Berrig",
        "A. Bertarelli",
        "C. Bracco",
        "E. Bravin",
        "G. Bregliozzi",
        "R. Bruce",
        "F. Carra",
        "F. Caspers",
        "G. Cattenoz",
        "S.D. Claudet",
        "H.A. Day",
        "M. Deile",
        "J.F. Esteban Müller",
        "P. Fassnacht",
        "M. Garlaschè",
        "L. Gentini",
        "B. Goddard",
        "A. Grudiev",
        "B. Henrist",
        "S. Jakobsen",
        "O.R. Jones",
        "O. Kononenko",
        "G. Lanza",
        "L. Lari",
        "T. Mastoridis",
        "V. Mertens",
        "N. Mounet",
        "E. Métral",
        "A.A. Nosych",
        "J.L. Nougaret",
        "S. Persichelli",
        "A.M. Piguiet",
        "S. Redaelli",
        "F. Roncarolo",
        "G. Rumolo",
        "B. Salvachua",
        "M. Sapinski",
        "R. Schmidt",
        "E.N. Shaposhnikova",
        "L.J. Tavian",
        "M.A. Timmins",
        "J.A. Uythoven",
        "A. Vidal",
        "J. Wenninger",
        "D. Wollmann",
        "M. Zerlauth",
        "CERN",
        "Geneva",
        "Switzerland",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "IFIC",
        "Valencia",
        "Spain",
        "Since June 2011",
        "the rapid increase of the luminosity performance of the LHC has come at the expense of increased temperature and pressure readings on specific near-beam LHC equipment. In some cases",
        "this beam induced heating has caused delays whilie equipment cools down",
        "beam dumps and even degradation of these devices. This contribution gathers the observations of beam induced heating attributable to beam coupling impedance",
        "their current level of understanding and possible actions that are planned to be implemented during the long shutdown in 2013-2014."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme032.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME033",
      "title": "Evaluation of the Beam Coupling Impedance of New beam Screen Designs for the LHC Injection Kicker Magnets",
      "authors": [
        "UMAN",
        "Manchester",
        "United Kingdom",
        "M.J. Barnes",
        "F. Caspers",
        "E. Métral",
        "B. Salvant",
        "CERN",
        "Geneva",
        "Switzerland",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The LHC injection kicker magnets (MKIs) have experienced a significant degree of beam induced heating since the beginning of the 2011 due to the increasing intensity stored in the LHC",
        "for long periods of time",
        "and the relatively large broadband impedance of the installed kicker magnets. In this paper we show the sources of impedance in the MKIs",
        "especially the effect that the beam screen dimensions have on the impedance. We show how these alter the power loss",
        "and present an improved beam screen design that improves shielding on the magnet",
        "whilst further improving electrical breakdown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme033.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME034",
      "title": "Experimental Studies for Future LHC Beams in the SPS",
      "authors": [
        "H. Bartosik",
        "T. Argyropoulos",
        "T. Bohl",
        "S. Cettour-Cave",
        "J.F. Esteban Müller",
        "W. Höfle",
        "G. Iadarola",
        "Y. Papaphilippou",
        "G. Rumolo",
        "B. Salvant",
        "F. Schmidt",
        "E.N. Shaposhnikova",
        "H. Timko",
        "CERN",
        "Geneva",
        "Switzerland",
        "KEK",
        "Ibaraki",
        "Japan",
        "The High Luminosity LHC (HL-LHC) project requires significantly higher beam intensity than presently accessible in the LHC injector chain. The aim of the LHC injectors upgrade project (LIU) is to prepare the CERN accelerators for the future needs of the LHC. Therefore a series of machine studies with high brightness beams were performed",
        "assessing the present performance reach and identifying remaining limitations. Of particular concern are beam loading and longitudinal instabilities at high energy",
        "space charge for beams with 50ns bunch spacing and electron cloud effects for beams with 25ns bunch spacing. This paper provides a summary of the performed studies",
        "that have been possible thanks to the implementation of the SPS low gamma-transition optics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme034.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME039",
      "title": "The Drive Beam Phase Stability in CTF3 and its Relation to the Bunch Compression Factor",
      "authors": [
        "E. Ikarios",
        "A. Andersson",
        "J. Barranco",
        "B. Constance",
        "R. Corsini",
        "A. Gerbershagen",
        "T. Persson",
        "P. Skowroński",
        "F. Tecker",
        "CERN",
        "Geneva",
        "Switzerland",
        "The proposed Compact Linear Collider (CLIC) is based on a two-beam acceleration scheme. The energy needed to accelerate a low intensity \"main\" beam is provided by a high intensity",
        "low energy \"drive\" beam. The precision and stability of the phase relation between two beams is crucial for the performance of the scheme. The tolerable phase jitter is 0.2 deg rms at 12GHz. For this reason it is fundamental to understand the main possible causes of the drive beam timing jitter. Experimental work aimed at such understanding was done in the CLIC Test Facility (CTF3) where a drive beam with characteristics similar to the CLIC one is produced. Several phase measurements allowed us to conclude that the main source of phase jitter is energy jitter of the beam transformed and amplified into phase jitter when passing through a magnetic chicane. This conclusion is supported by measurements done with different momentum compaction values in the chicane. In this paper the results of these several phase measurements will be presented and compared with expectations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme039.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME040",
      "title": "TLEP: High-performance Circular e+e− Collider to Study the Higgs Boson",
      "authors": [
        "M. Koratzinos",
        "O. Brunner",
        "A.C. Butterworth",
        "J.R. Ellis",
        "P. Janot",
        "E. Jensen",
        "J.A. Osborne",
        "F. Zimmermann",
        "CERN",
        "Geneva",
        "Switzerland",
        "CEA/DSM/IRFU",
        "France",
        "DPNC",
        "Genève",
        "Switzerland",
        "MIT",
        "Cambridge",
        "Massachusetts",
        "USA"
      ],
      "institutions": [],
      "abstract": "The recent discovery of a light Higgs boson has opened up considerable interest in circular e+e− Higgs factories around the world. We report on the progress of the “",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme040.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME042",
      "title": "The SPS as an Ultra-low Emittance Damping Ring Test Facility for CLIC",
      "authors": [
        "Y. Papaphilippou",
        "R. Corsini",
        "L.R. Evans",
        "CERN",
        "Geneva",
        "Switzerland",
        "In view of the plans for a future electron/positron linear collider based on the CLIC technology",
        "an ultra-low emittance damping ring test facility is proposed",
        "using the CERN SPS. Optics modification",
        "required wiggler length and characteristics",
        "energy and RF parameters are presented in order to reach CLIC performance requirements",
        "including the effect of Intrabeam Scattering. Considerations about the necessary injected beam characteristics",
        "its production and transfer through the existing CERN accelerator complex are also discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme042.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME045",
      "title": "Turn-by-turn Measurements in the KEK-ATF",
      "authors": [
        "Y. Renier",
        "Y. Papaphilippou",
        "R. Tomás",
        "M. Wendt",
        "CERN",
        "Geneva",
        "Switzerland",
        "Fermilab",
        "Batavia",
        "USA",
        "K. Kubo",
        "S. Kuroda",
        "T. Naito",
        "T. Okugi",
        "N. Terunuma",
        "J. Urakawa",
        "KEK",
        "Ibaraki",
        "Japan",
        "The ATF damping ring has been upgraded with new read-out electronics for the beam position monitors (BPM)",
        "capable to acquire the beam orbits on a turn-by-turn basis",
        "as well as in a high resolution averaging mode. The new BPM system allows to improve optic corrections and to achieve an even smaller vertical emittance (<2pm). Experimental results are presented based on turn-by-turn beam orbit measurements in the ring",
        "for estimating the beta functions and dispersion along the lattice. A fast method to measure spectral line amplitude in a few turns is also presented",
        "including the evaluation of chromaticity."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME046",
      "title": "Performance of SPS Low Transition Energy Optics for LHC Ion Beams",
      "authors": [
        "F. Antoniou",
        "G. Arduini",
        "H. Bartosik",
        "T. Bohl",
        "S. Cettour Cave",
        "K. Cornelis",
        "D. Manglunki",
        "Y. Papaphilippou",
        "CERN",
        "Geneva",
        "Switzerland",
        "An optics with low transition energy has been developed in the SPS for removing intensity limitations of the LHC proton beam and has become operational towards the second part of the 2012 LHC proton run. This optics was also used for filling the LHC with lead ions during the p/Pb run of the beginning of 2013. The impact of this optics in the performance of the LHC ion beam is studied here",
        "especially with respect to collective effects",
        "at the SPS injection energy. In particular",
        "the potential gain of the increased beam sizes provided by this optics",
        "with respect to losses and emittance blow up due to space-charge and Intrabeam Scattering (IBS) is evaluated. The measured lifetime is compared with the one provided by the Touschek effect and its interplay with RF noise is studied. The models are supported by measurements in the SPS and in the LHC flat bottom."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME047",
      "title": "Sub-Harmonic Bunching System of CLIC Drive Beam Injector",
      "authors": [
        "S. Sanaye Hajari",
        "S. Döbert",
        "S. Döbert",
        "H. Shaker",
        "CERN",
        "Geneva",
        "Switzerland",
        "S. Sanaye Hajari",
        "H. Shaker",
        "IPM",
        "Tehran",
        "Iran",
        "In the Compact Linear Collider (CLIC) the RF power for the acceleration of the Main Beam is extracted from a high-current Drive Beam that runs parallel with the main linac. The sub-harmonic bunching system of the drive beam injector has been studied in detail and optimized. The model consists of a thermionic gun",
        "three travelling wave sub-harmonic bunchers followed by a tapered travelling wave buncher. The simulation of the beam dynamics has been carried out with PARMELA with the goal of optimizing the overall bunching process and in particular capturing particles as much as possible in the buncher acceptance and decreasing the satellite population."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme047.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME048",
      "title": "Imperfection Tolerances for On-line Dispersion Free Steering in the Main Linac of CLIC",
      "authors": [
        "J. Pfingstner",
        "A. Latina",
        "D. Schulte",
        "CERN",
        "Geneva",
        "Switzerland",
        "Long-term ground motion misaligns the elements of the main linac of CLIC over time. Especially the misaligned quadrupoles create dispersion and hence the beam quality is decreased gradually due to an effect called chromatic dilution. Over longer time periods",
        "orbit feedback systems are not capable to fully recover the beam quality and have to be supplemented by dispersion correction algorithms. In this paper",
        "such and dispersion correction algorithm is presented",
        "which is an extended version of the well-known dispersion free steering algorithm. This extended algorithm can recover the beam quality over long time scaled without stopping the accelerator operation (on-line). Tolerances for different imperfections of the system have been identified and a strong sensitivity to the resolution of the wake field monitors of the main linac accelerating structures has been identified. This problem can be mitigated by using a local excitation scheme as will be shown in this work."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme048.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME049",
      "title": "Status of the Exploration of an Alternative CLIC First Energy Stage Based on Klystrons",
      "authors": [
        "D. Schulte",
        "A. Grudiev",
        "P. Lebrun",
        "G. McMonagle",
        "I. Syratchev",
        "W. Wuensch",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Compact Linear Collider is based on a two-beam scheme to accelerate the main",
        "colliding beams. This scheme allows to reach very high centre-of-mass energies. At low collision energies the main beams could be accelerated by powering the accelerating structures with X-band instead of a second beam. We explore this option and indicate the parameters and conceptual design."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme049.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME050",
      "title": "Performance Comparison of Different System Identification Algorithms for FACET and ATF2",
      "authors": [
        "J. Pfingstner",
        "A. Latina",
        "D. Schulte",
        "CERN",
        "Geneva",
        "Switzerland",
        "Good system knowledge is an essential ingredient for the operation of modern accelerator facilities. For example",
        "beam-based alignment algorithms and orbit feedbacks rely strongly on a precise measurement of the orbit response matrix. The quality of the measurement of this matrix can be improved over time by statistically combining the effects of small system excitations with the help of system identification algorithms. These small excitations can be applied in a parasitic mode without stopping the accelerator operation (on-line). In this work",
        "different system identification algorithms are used in simulation studies for the response matrix measurement at ATF2. The results for ATF2 are finally compared with the results for FACET",
        "latter originating from an earlier work."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme050.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME051",
      "title": "CLIC Final Focus System Alignment and Magnet Tolerances",
      "authors": [
        "J. Snuverink",
        "J. Barranco",
        "H. Garcia",
        "Y.I. Levinsen",
        "D. Schulte",
        "R. Tomás",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [],
      "abstract": "The design requirements for the magnets in the Compact Linear Collider (CLIC) Final Focus System (FFS) are very stringent. In this paper the sensitivity for the misalignment and the magnetic imperfections for the different magnets in the FFS and the crab cavity are presented. Possible mitigation methods are discussed.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme051.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME052",
      "title": "Sub-harmonic Buncher Design for the CLIC Drive Beam Injector",
      "authors": [
        "H. Shaker",
        "S. Döbert",
        "R. Leuxe",
        "S. Sanaye Hajari",
        "CERN",
        "Geneva",
        "Switzerland",
        "Università di Brescia",
        "Brescia",
        "Italy",
        "S. Sanaye Hajari",
        "H. Shaker",
        "IPM",
        "Tehran",
        "Iran"
      ],
      "institutions": [],
      "abstract": "The CLIC (Compact LInear Collider) is based on two beam concept where a high current drive beam provides the energy needed for acceleration of the main beam. The CLIC drive beam accelerator starts with a high current injector using a sophisticated sub-harmonic bunching system. This paper will focus on the design of the Sub Harmonic Bunchers (SHBs) the first RF components of the injector. A backward traveling wave structure has been optimized for this task. It will be shown also how to avoid asymmetrical fields inside the coupler cells and how to compensate beam loading by changing the phase velocity in comparison to the beam velocity.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme052.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME053",
      "title": "General Beam Loading Compensation in a Traveling Wave Structure",
      "authors": [
        "H. Shaker",
        "S. Döbert",
        "CERN",
        "Geneva",
        "Switzerland",
        "IPM",
        "Tehran",
        "Iran",
        "The well-known beam loading in a traveling wave structure is in fact a resistive beam loading which bunches travel on the crest. This type of beam loading could be compensated by increasing RF feed power. But generally",
        "bunches could travel on each phase. General beam loading compensation is well-known for a single cell cavity and it is done by changing the RF feed power and detuning the structure together. In this paper",
        "the concept of detuning for a TW structure will be shown and the evolution of fundamental mode beam-induced field will be derived and finally",
        "it will be shown how to compensate beam loading by changing the phase velocity in comparison to the beam velocity."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme053.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME054",
      "title": "Experimental Study of the Effect of Beam Loading on RF Breakdown Rate in CLIC High-gradient Accelerating Structures",
      "authors": [
        "F. Tecker",
        "R. Corsini",
        "M. Dayyani Kelisani",
        "S. Döbert",
        "A. Grudiev",
        "O. Kononenko",
        "S. Lebet",
        "J.L. Navarro Quirante",
        "G. Riddone",
        "I. Syratchev",
        "W. Wuensch",
        "CERN",
        "Geneva",
        "Switzerland",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "RF breakdown is a key issue for the multi-TeV high-luminosity e+e− Compact Linear Collider (CLIC). Breakdowns in the high-gradient accelerator structures can deflect the beam and decrease the desired luminosity. The limitations of the accelerating structures due to breakdowns have been studied so far without a beam present in the structure. The presence of the beam modifies the distribution of the electrical and magnetic field distributions",
        "which determine the breakdown rate. Therefore an experiment has been designed for high power testing a CLIC prototype accelerating structure with a beam present in the CLIC Test Facility (CTF3). A special beam line allows extracting a beam with nominal CLIC beam current and duration from the CTF3 linac. The paper describes the beam optics design for this experimental beam line and the commissioning of the experiment with beam."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme054.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME055",
      "title": "Strawman Optics Design for the CERN LHeC ERL Test Facility",
      "authors": [
        "A. Valloni",
        "O.S. Brüning",
        "R. Calaga",
        "E. Jensen",
        "M. Klein",
        "R. Tomás",
        "F. Zimmermann",
        "CERN",
        "Geneva",
        "Switzerland",
        "S.A. Bogacz",
        "D. Douglas",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "In preparation for a future Large Hadron electron Collider (LHeC) at CERN",
        "an ERL test facility is foreseen as a test bed for SRF development",
        "cryogenics",
        "and advanced beam instrumentation",
        "as well as for studies of ERL-specific beam dynamics. The CERN ERL test facility would comprise two linacs",
        "each consisting of 4 superconducting 5-cell cavities at 802 MHz",
        "and two return arcs on either side. With an RF voltage of 75 MeV per linac a final electron energy of about 300 MeV is reached. The average beam current should be above 6 mA to explore the parameter range of the future LHeC. In this paper we present a preliminary optics layout."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme055.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME056",
      "title": ".5 GeV Superconducting Stacking Ring for Compton Based Polarized Positrons Source of CLIC",
      "authors": [
        "E.V. Bulyak",
        "P. Gladkikh",
        "A.A. Kalamayko",
        "NSC/KIPT",
        "Kharkov",
        "Ukraine",
        "T. Omori",
        "J. Urakawa",
        "K. Yokoya",
        "KEK",
        "Ibaraki",
        "Japan",
        "L. Rinolfi",
        "F. Zimmermann",
        "CERN",
        "Geneva",
        "Switzerland",
        "This paper describes 3.5 GeV superconducting storage ring dedicated to positron accumulation as part of a polarized positron source for CLIC",
        "based on Compton scattering in a Compton storage ring. The superconducting stacking ring can provide a synchrotron damping time of order 250 microseconds. Together with combined injection scheme in the longitudinal and transverse plane",
        "such a ring may solve the problem of accumulating a positron beam with efficiency close to 95 % and with the beam intensity required for CLIC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme056.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME059",
      "title": "Collisional Effects in Particle-in-Cell Beam-Beam Simulations",
      "authors": [
        "S. Paret",
        "J. Qiang",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Self-consistent particle tracking simulations (strong-strong) can be used to investigate the deterioration of colliding beams in a storage ring. However",
        "the use of a small number of macroparticles copmared to the real number of particles magnifies the collisional effects and causes numerical noise. In particular",
        "predictions of the emittance lifetime suffer from this numerical noise. In order to produce usable emittance predictions",
        "the contribution of numerical noise to the simulated emittance growth has to be known. In this paper",
        "we apply a diffusion model to strong-strong beam-beam simulations to study the numerical noise driven emittance growth. The scaling of emittance growth with numerical and physical parameters is discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme059.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME060",
      "title": "Tune Studies with Beam-Beam Effects in LHC",
      "authors": [
        "S. Paret",
        "J. Qiang",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "R. Alemany-Fernandez",
        "X. Buffat",
        "R. Calaga",
        "K. Cornelis",
        "M. Fitterer",
        "R. Giachino",
        "W. Herr",
        "A. Macpherson",
        "G. Papotti",
        "T. Pieloni",
        "S. Redaelli",
        "F. Roncarolo",
        "M. Schaumann",
        "R. Suykerbuyk",
        "G. Trad",
        "CERN",
        "Geneva",
        "Switzerland",
        "ESS",
        "Lund",
        "Sweden",
        "In high brightness colliders",
        "the tune spread due to the collisions has a significant impact on the quality of the beams. The impact of the working point on emittance growth and beam lifetime has been observed in beam experiments in LHC. Strong-strong beam-beam simulations that were accomplished to better understand such observations are shown. Compared to experiments",
        "wide ranged parameter scans can be done easily. Tune footprints and scans of the emittance growth obtained from simulations are discussed. Three cases are considered: Very high intensity",
        "moderate intensity and collisions with separated beams."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme060.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME061",
      "title": "Emittance Growth with Crab Cavity and Damper Noise in LHC",
      "authors": [
        "S. Paret",
        "J. Qiang",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Strong-strong beam-beam simulations are employed to investigate the noise sensitivity of the emittance in the future High Luminosity (HL)-LHC. Noise in the accelerator causes fluctuations of the bunch centroids at the interaction points (IPs) which cause emittance growth for large beam-beam parameters. Two noise sources are examined: Crab cavities and the transverse damper. The damper noise is adjusted to bring simulations in agreement with an emittance measurement in a past LHC run. Results from simulations with HL-LHC beam parameters using different noise levels",
        "damper gains and working points are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme061.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME062",
      "title": "Simulation and Analysis of Microbunching Instability in a High Repetition rate FEL Beam Delivery System",
      "authors": [
        "J. Qiang",
        "J.N. Corlett",
        "P. Emma",
        "C.E. Mitchell",
        "M. Venturini",
        "LBNL",
        "Berkeley",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme062.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME064",
      "title": "Envelope Perturbations in a Space-Charge-Dominated Electron Beam",
      "authors": [
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "Linear perturbation analysis of the RMS envelope equations predicts a frequency splitting of the transverse envelope resonances with the onset of space charge. These resonances are a potential source of beam degradation for space-charge-dominated particle accelerators and storage rings. We use WARP for both envelope code integration and particle-in-cell (PIC) simulations to predict the behavior of these resonances for an existing alternating gradient lattice storage ring. The focus of these simulations is tailored toward examining physics that is scalable to future high-intensity accelerators. This paper provides detailed simulation results and a design for an experimental demonstration at the University of Maryland Electron Ring (UMER)",
        "a high intensity 10 keV electron storage ring."
      ],
      "institutions": [],
      "abstract": "W.D. Stem, B.L. Beaudoin, I. Haber, R.A. Kishek, T.W. Koeth",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme064.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME064",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME065",
      "title": "Experimental Study of Horizontal-Longitudinal Coupling at CesrTA",
      "authors": [
        "M. P. Ehrlichman",
        "A. Chatterjee",
        "W. Hartung",
        "D.P. Peterson",
        "N.T. Rider",
        "D. L. Rubin",
        "J.P. Shanks",
        "S. Wang",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "In storage rings",
        "the presence of horizontal dispersion in the RF cavities introduces x-z coupling. The result is that the beam is skewed in the horizontal-longitudinal plane. The skew angle is proportional to the V15 term of the 6X6 coupling matrix which is proportional to the RF cavity voltage and the horizontal dispersion in the cavity. Here we report experiments at CesrTA where x-z coupling was explored using three distinct lattice configurations with different V15 coupling terms. We explore x-z coupling for each of these lattices by measuring the horizontal projection of the beam with a beam size monitor",
        "as the RF voltage is varied. The first lattice has about 1 m dispersion in the RF cavities",
        "resulting in a V15 term at the beam size monitor source point corresponding to 16 mrad x-z tilt. In the second",
        "the V15 generated in one pair of cavities is compensated at the second pair by adjusting the horizontal betatron phase advance between the cavity pairs. In the third",
        "the optics are adjusted so that the RF cavity region is dispersion-free",
        "eliminating the coupling entirely. Additionally",
        "intra-beam scattering is evident in our measurements of beam size vs. RF voltage."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme065.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME066",
      "title": "CESR Low Emittance Upgrade with Combined Function Bends",
      "authors": [
        "D. L. Rubin",
        "Y. Li",
        "A.A. Mikhailichenko",
        "S. Wang",
        "CLASSE",
        "Ithaca",
        "New York",
        "USA",
        "The Cornell Electron Storage Ring is the laboratory for the CESR Test Accelerator damping ring R&D program",
        "and the source of x-rays for CHESS. A peculiarity of the layout of the storage ring is that horizontal emittance is generated predominantly by the strong bends in the sextant of the ring that was designed with a long straight to accommodate the interaction region required for operation as an electron-positron collider. By reconfiguring that single sextant we reduce the emittance by 60% to 20 nm-rad at 5.3 GeV for x-ray production and with damping wigglers to 1.3 nm-rad at 2.1 GeV for investigations of low emittance phenomena. The 35 meter radius of curvature",
        "3.2 meter long dipoles are refitted as combined function (vertically focusing) magnets to create simple achromats. The layout can accommodate six",
        "3 meter long undulators",
        "in addition to the six existing superconducting damping wigglers. With reduced horizontal emittance and energy spread",
        "the reconfiguration enhances the sensitivity of CESR to the emittance diluting effects that are the subject of the CesrTA study. Capability of the x-ray source is significantly improved with six new undulator beam lines."
      ],
      "institutions": [
        "Funding: Work supported by the National Science Foundation and Department of Energy under contract numbers PHY-1002467, DMR-0936384 and DE-SC0006505"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme066.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPME067",
      "title": "Design Concept of a Gamma-gamma Higgs Factory Driven by Thin Laser Targets and Energy Recovery Linacs",
      "authors": [
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "A gamma-gamma collider has long been considered an option for a Higgs Factory. Such photon colliders usually rely on Compton back-scattering for generating high energy gamma photons and further Higgs bosons through gamma-gamma collisions. The presently existing proposals or design concepts all have chosen a very thick laser target (i.e.",
        "high laser photon intensity) for Compton scatterings. In this paper",
        "we present a new design concept of a gamma-gamma collider utilizing a thin laser target (i.e.",
        "relatively low photon density)",
        "thus leading to a low electron to gamma photon conversion rate. This new concept eliminates most useless and harmful low energy soft gamma photons from multiple Compton scattering so the detector background is improved. It also greatly relaxes the requirement of the high peak power of the laser",
        "a significant technical challenge. A high luminosity for such a gamma-gamma collider can be achieved through an increase of the bunch repetition rate and current of the driven electron beam. Further",
        "multi-pass recirculating linac could greatly reduce the linac cost and energy recovery is required to reduce the needed RF power."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tupme067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tupme067.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tupme067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUPME067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 56,
  "scrape_time": "2025-10-10 21:21:07"
}