{
  "session_info": {
    "id": "TUPAF",
    "name": "TUPAF - MC4 Poster Session",
    "url": "https://proceedings.jacow.org/ipac2018/html/tupaf.htm"
  },
  "papers": [
    {
      "paper_id": "TUPAF001",
      "title": "Requirements for the Cryogenic Refrigerator and the He Distribution System for the MYRRHA 100 Mev Accelerator",
      "authors": [
        "Accelerators and Cryogenic Systems",
        "Orsay",
        "France",
        "Studiecentrum voor Kernenergie - Centre d'Étude de l'énergie Nucléaire (SCK•CEN)",
        "Mol",
        "Belgium",
        "SCK•CEN",
        "Mol",
        "Belgium",
        "MYRRHA is an ADS demonstrator for the long-lived radioactive waste transmutation. It is composed of a High Energy CW Linac Accelerator (600 MeV - 4mA) coupled to a Subcritical Reactor of 100 MW thermal power. The main challenge of the Linac is a very high reliability performance to limit stress and long restart procedures of the reactor. Within the MYRRHA project phased approach for the construction",
        "a 100 MeV-4 mA Linac (Injector up to 17 MeV and SC Linac between 17 MeV and 100 MeV) will be constructed in the Phase 1",
        "covering 2016-2024. The SC Linac is composed of 58 Single-Spoke SC cavities",
        "housed in 29 cryomodules. The cavities operates at 352 MHz",
        "in a superfluid Helium bath at 2K. In this paper",
        "the requirements for the Linac Cryogenic System are presented. The analysis of high thermal loads induced by the CW mode operation of cavities",
        "leads to a Cryogenic Refrigerator with a power of 2700 W (equiv. power capacity at 4.5 K). Each cryomodule is connected through a dedicated Valve Box to the Helium transfer line running along the Linac tunnel. A description of the cryogenic system features and initial models of the tunnel and associated buildings are presented."
      ],
      "institutions": [],
      "abstract": "D. Vandeplasschepresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf001.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF001",
      "page_number": "655",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF002",
      "title": "Beam Commissioning of the 750 MHz Proton RFQ for the LIGHT Prototype",
      "authors": [
        "V.A. Dimov",
        "M. Caldara",
        "A. Degiovannipresenter",
        "L.S. Esposito",
        "D.A. Fink",
        "M. Giunta",
        "A. Jeff",
        "A. Valloni",
        "AVO-ADAM",
        "Meyrin",
        "Switzerland",
        "A.M. Lombardi",
        "S.J. Mathot",
        "M. Vretenar",
        "CERN",
        "Geneva",
        "Switzerland",
        "ADAM (Application of Detectors and Accelerators to Medicine)",
        "a CERN spin-off company",
        "is developing the Linac for Image Guided Hadron Therapy",
        "LIGHT",
        "which will accelerate proton beams up to 230 MeV. The design of the linac will allow fast intensity and energy modulation for pencil-beam scanning during cancer treatment. The linac consists of a 40 keV Proton Injector; a 750 MHz Radio Frequency Quadrupole (RFQ) accelerating the proton beam up to 5 MeV; a 3 GHz Side Coupled Drift Tube Linac (SCDTL) up to 37.5 MeV; and a 3 GHz Cell Coupled Linac (CCL) section up to 230 MeV. A prototype of LIGHT is being commissioned progressively with the installation of the accelerating structures at a CERN site. The beam commissioning of the RFQ",
        "which was designed and built by CERN",
        "was completed in 2017 using a movable beam diagnostic test bench with various instruments. This paper reports on the RFQ commissioning strategy and the results of the beam measurements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF002",
      "page_number": "658",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF003",
      "title": "Integrated Prototyping in View of the 100 MeV Linac for Myrrha Phase 1",
      "authors": [
        "D. Vandeplassche",
        "J. Belmans",
        "SCK•CEN",
        "Mol",
        "Belgium",
        "C. Angulo",
        "D. Davin",
        "W. De Cock",
        "P. Della Faille",
        "F. Doucet",
        "A. Gatera",
        "Pompon",
        "F.F. Pompon",
        "Studiecentrum voor Kernenergie - Centre d'Étude de l'énergie Nucléaire (SCK•CEN)",
        "Mol",
        "Belgium",
        "D. Bondoux",
        "F. Bouly",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "H. Höltermann",
        "D. Mäder",
        "BEVATECH",
        "Frankfurt",
        "Germany",
        "C. Joly",
        "G. Olry",
        "H. Saugnac",
        "IPN",
        "Orsay",
        "France",
        "M. Loiselet",
        "N. Postiau",
        "L. Standaert",
        "UCL",
        "Louvain-la-Neuve",
        "Belgium",
        "H. Podlech",
        "U. Ratzinger",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "The MYRRHA project borne by SCK•CEN",
        "the Belgian Nuclear Research Centre",
        "aims at realizing a pre-industrial Accelerator Driven System (ADS) for exploring the transmutation of long lived nuclear waste. The linac for this ADS will be a High Power Proton Accelerator delivering 2.4 MW CW beam at 600 MeV. It has to satisfy stringent requirements for reliability and availability: a beam-MTBF of 250h is targeted. The reliability goal is pursued through a phased approach. During Phase 1",
        "expected till 2024",
        "the MYRRHA linac up to 100 MeV will be constructed. It will allow to evaluate the reliability potential of the 600 MeV linac. It will also feed a Proton Target Facility in which radioisotopes of interest will be collected through an ISOL system. This contribution will focus on the transition to integrated prototyping",
        "which will emphasize (i) a test platform consisting of the initial section of the normal conducting injector (5.9 MeV)",
        "(ii) the realization of a complete cryomodule for the superconducting linac and of its cryogenic valve box. The cryomodule will house two 352 MHz single spoke cavities operated at 2K."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf003.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF003",
      "page_number": "661",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF004",
      "title": "Status of the MedAustron Beam Commissioning with Protons and Carbon Ions",
      "authors": [
        "C. Kurfürst",
        "L. Adler",
        "A. De Francopresenter",
        "F. Farinon",
        "N. Gambino",
        "G. Guidoboni",
        "G. Kowarik",
        "M. Kronberger",
        "S. Myalski",
        "S. Nowak",
        "M.T.F. Pivi",
        "C. Schmitzer",
        "I. Strašík",
        "P. Urschütz",
        "A. Wastl",
        "EBG MedAustron",
        "Wr. Neustadt",
        "Austria",
        "Abstract Landscapes",
        "Montpellier",
        "France",
        "MedAustron is a synchrotron-based Particle Therapy Accelerator located in Wiener Neustadt",
        "Austria",
        "which is delivering beams for medical treatment since end of 2016. The accelerator provides clinical proton beams in the energy range 62-252 MeV and is designed to provide carbon ions in the range 120-400 MeV/n to three ion therapy irradiation rooms IRs",
        "including a room with a proton Gantry. Proton beams of up to 800 MeV will be provided to a fourth room dedicated to research. Presently",
        "proton beams are delivered to the fixed horizontal beam lines of three rooms. Beam commissioning of the vertical beam line of the second IR is being completed and the beam line is in preparation for clinical treatment. Commissioning of the accelerator with carbon ions is advancing and first clinical beams have been sent to the IRs",
        "while the preparation for the Gantry beam line is ongoing. A slow extraction 3rd order resonance method is used to extract particles from the synchrotron between 0.1-10 seconds to favor control of the delivered dose during clinical treatments. The main characteristics of the accelerator and results obtained during the latest commissioning activities are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf004.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF004",
      "page_number": "665",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF005",
      "title": "Status of AC-Dipole Project at RHIC Injectors for Polarized Helions",
      "authors": [
        "K. Hock",
        "H. Huangpresenter",
        "F. Méot",
        "P. Oddo",
        "N. Tsoupas",
        "J.E. Tuozzolo",
        "K. Zeno",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Polarized helions will be used in the eRHIC collider to collide with polarized electrons. To allow efficient transport of polarized helions in the Booster",
        "to rigidities sufficiently high (B rho=10.8 T.m",
        "|G gamma|=10.5) for minimizing the optical perturbations from the two partial helical dipoles in the AGS",
        "an upgrade for overcoming depolarizing intrinsic resonances is needed. An AC-dipole is being designed to induce spin flips through intrinsic resonances. Booster AC-dipole operation will be established with protons while the polarized helion source is being completed. This paper reports the status of the project (which is now well advanced after two years of theoretical and design studies) and provides an overview of proof of principle experiments to take place after successful installation of the AC-dipole",
        "during RHIC Run 19 with polarized proton beams."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf005.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF005",
      "page_number": "669",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF006",
      "title": "Operation of RHIC Injectors with Isobaric Ruthenium and Zirconium Ions",
      "authors": [
        "H. Huang",
        "E.N. Beebe",
        "I. Blacker",
        "J.J. Butler",
        "C. Carlson",
        "P.S. Dyer",
        "W. Fischer",
        "C.J. Gardner",
        "D.M. Gassner",
        "D. Goldberg",
        "T. Hayes",
        "S. Ikeda",
        "J.P. Jamilkowski",
        "T. Kanesue",
        "N.A. Kling",
        "C. Liu",
        "D. Maffei",
        "G.J. Marr",
        "B. Martin",
        "J. Morris",
        "C. Naylor",
        "M. Okamura",
        "D. Raparia",
        "V. Schoefer",
        "F. Severino",
        "T.C. Shrey",
        "K.S. Smith",
        "D. Steski",
        "P. Thieberger",
        "K. Zeno",
        "I.Y. Zhang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "Utsunomiya University",
        "Utsunomiya",
        "Japan",
        "The FY18 RHIC physics program calls for Ru-Ru and Zr-Zr collisions at 100GeV using isobaric Ruthenium and Zirconium ions",
        "each having 96 nucleons. In the injector chain",
        "these two ions have to come from tandem and EBIS source",
        "respectively. To reduce systematic errors in the detector",
        "the luminosity between the two species combinations is matched as closely as possible",
        "and the species are switched frequently. Several bunch merges are needed in the Booster and AGS to reach the desired bunch intensity for RHIC. The setup and performance of Booster and AGS with these ions are reviewed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf006.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF006",
      "page_number": "672",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF010",
      "title": "Empty Sweeping Bucket for Slow Extraction",
      "authors": [
        "L. Falbo",
        "E. Bressi",
        "C. Priano",
        "CNAO Foundation",
        "Milan",
        "Italy",
        "The extraction process from a synchrotron is one of the most important aspects of an accelerator devoted to clinical purposes",
        "like the hadrontherapy in which hadron beams are used to treat tumors. Indeed the quality of the dose delivered to the patient",
        "in terms of dose uniformity and precision in the beam characteristics",
        "is defined by the way in which the beam is extracted. The quality of the extracted beam (the so called spill) is strongly affected by the stability of the power supplies of the synchrotron magnets whose field stability creates a ripple in the intensity of the extracted beam itself. When it is not possible to improve the power supply stability",
        "it is needed to apply some additional techniques in order to cure the spill ripple. At CNAO",
        "the italian hadrontherapy facility",
        "it has been thought to improve the Empty Bucket Channelling technique by using an energy-moving bucket instead of a stationary bucket. The paper shows the implementation",
        "the advantages and the efficacy of this RF gymnastic",
        "named 'Empty Sweeping Bucket'."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF010",
      "page_number": "676",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF011",
      "title": "Btrain Calibration with RF-Master Method",
      "authors": [
        "L. Falbo",
        "E. Bressi",
        "M. Pezzetta",
        "C. Priano",
        "CNAO Foundation",
        "Milan",
        "Italy",
        "CNAO is the only Italian hadrontherapy facility able to treat tumors with beams of protons and carbon ions. It is based on a synchrotron with a 77 m ring equipped with 16 normal conducting dipoles characterized by a long delay in the field stabilization. B-Train system is a fundamental device of the whole machine; it is used in feedback to the dipole power supply in order to regulate the magnetic field reducing the natural stabilization times that would cause long treatments. B-Train system allows to obtain the magnetic field starting from measurements of magnetic field changes: it works as an integrator and then it needs a system to reset the counts compensating the electronic and numerical drift of the system itself. An innovative method has been implemented at CNAO to reset Btrain counts exploiting beam measurements after the RF cavity trapping. This procedure has the advantage to avoid external and additional element like NMR probes. The paper shows the use of B-train system at CNAO and its calibration with this method",
        "called \"RF-master method\"."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf011.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF011",
      "page_number": "679",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF012",
      "title": "Commissioning of the Lipac Medium Energy Beam Transport Line",
      "authors": [
        "I. Podadera",
        "J. Castellanos",
        "J.M. García",
        "D. Gavela",
        "A. Ibarra",
        "D. Jiménez-Rey",
        "A. Marqueta",
        "L.M. Martinez Fresno",
        "E. Molina Marinas",
        "J. Mollá",
        "P. Méndez",
        "C. Oliver",
        "D. Regidor",
        "F. Toral",
        "R. Varelapresenter",
        "V. Villamayor",
        "M. Weber",
        "C. de la Morena",
        "CIEMAT",
        "Madrid",
        "Spain",
        "P. Cara",
        "A. Marqueta",
        "I. Moya",
        "Fusion for Energy",
        "Garching",
        "Germany",
        "T. Ebisawa",
        "Y. Hirata",
        "A. Ihara",
        "Y. Ikeda",
        "A. Kasugai",
        "T. Kitano",
        "K. Kondo",
        "T. Narita",
        "K. Sakamoto",
        "T. Shinya",
        "M. Sugimoto",
        "QST",
        "Aomori",
        "Japan",
        "D. Gex",
        "A. Jokinen",
        "F4E",
        "Germany",
        "IFMIF/EVEDA",
        "Rokkasho",
        "Japan",
        "7S",
        "Peligros (Granada)",
        "Spain",
        "IREC",
        "Sant Adria del Besos",
        "Spain",
        "Consorzio RFX",
        "Associazione Euratom-ENEA sulla Fusione",
        "Padova",
        "Italy",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "LIPAc* will be a 9 MeV",
        "125 mA CW deuteron accelerator which aims to validate the technology to be used as neutron source of the IFMIF facility. Those facilities are essential for future fusion reactors material research. A 175 MHz RFQ will increase the energy up to 5 MeV before a Superconducting RF (SRF) linac with eight 175 MHz Half Wave Resonators brings the particles up to the final energy of 9 MeV. Between both stages",
        "a Medium Energy Beam Transport line (MEBT)** aims at transporting and matching the beam between the RFQ and the SRF linac. The transverse focusing of the beam is controlled by five quadrupole magnets with integrated steerers",
        "grouped in one triplet and one doublet. Two buncher cavities handle the longitudinal dynamics. Two movable scraper systems are included to purify the beam optics coming out the RFQ and avoid losses in the SRF linac. In this contribution",
        "checkout of the beamline and its ancillaries in Japan is reported. Tests carried out on the beamline prior to the MEBT beam commissioning are described",
        "focusing in vacuum tests",
        "magnets powering",
        "buncher conditioning and scrapers movement.",
        "* P. Cara et al."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf012.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF012",
      "page_number": "683",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF014",
      "title": "Beam Dynamics Studies For the IFMIF-DONES SRF-Linac",
      "authors": [
        "L. Du",
        "N. Bazin",
        "N. Chauvin",
        "S. Chel",
        "J. Plouin",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "The DONES (DEMO oriented neutron source) project is aimed at constructing a DEMO of IFMIF to provide sufficient material damage [1]. In the SRF-Linac of this project",
        "losses can cause harmful material activation and must be maintained much less than 1W/m. It's a challenge to keep losses at such a low level with high beam power and high space charge. This paper presents two designs of the DONES SRF-Linac",
        "one with 4 cryomodules and another with 5 cryomodules. The design details to reduce the losses and the multi-particle simulation results will be shown. The errors studies for these results will also be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf014.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF014",
      "page_number": "687",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF015",
      "title": "Preliminary Test Results of the First ESS Elliptical Cryomodule Demonstrator",
      "authors": [
        "F. Peauger",
        "C. Arcambal",
        "S. Berry",
        "P. Bosland",
        "E. Cenni",
        "G. Devanz",
        "T. Hamelin",
        "O. Piquet",
        "B. Renard",
        "P. Sahuquet",
        "T. Trublet",
        "CEA/DRF/IRFU",
        "Gif-sur-Yvette",
        "France",
        "ESS",
        "Lund",
        "Sweden",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "IPN",
        "Orsay",
        "France",
        "Laboratoire APC",
        "Paris",
        "France"
      ],
      "institutions": [],
      "abstract": "Two ESS elliptical cavities cryomodule prototypes are being developed and will be tested at CEA Saclay before starting the series production. This paper presents the preliminary test results of the first medium beta cavities cryomodule demonstrator M-ECCTD. The measurements of the cryogenic performances at 80 K and 2 K of the different cryomodule components and circuits are given. The first RF test results performed at low power are also reported. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf015.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF015",
      "page_number": "691",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF016",
      "title": "Increase of IPHI Beam Power at CEA Saclay",
      "authors": [
        "F. Senée",
        "F. Benedetti",
        "E. Giner-Demange",
        "A. Gomes",
        "M. Oublaid",
        "CEA/DRF/IRFU",
        "Gif-sur-Yvette",
        "France",
        "P. Ausset",
        "M. Ben Abdillah",
        "C. Joly",
        "IPN",
        "Orsay",
        "France",
        "F. Belloni",
        "B. Bolzon",
        "N. Chauvin",
        "M. Desmons",
        "Y. Gauthier",
        "C. Marchand",
        "J. Marroncle",
        "T. Papaevangelou",
        "G. Perreu",
        "O. Piquet",
        "B. Pottin",
        "Y. Sauce",
        "J. Schwindling",
        "L. Segui",
        "O. Tuske",
        "D. Uriot",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "F. Harrault",
        "R. Touzery",
        "CEA/DSM/IRFU",
        "France",
        "For the first time",
        "in April 2016",
        "the SILHI source produced a proton beam for IPHI RFQ. Due to several technical difficulties on the RFQ water cooling skid",
        "a short RF power pulse (100 μs at the beginning until few hundred microseconds) is injected into the RFQ accelerates the high intensity proton beam up to 3 MeV. The repetition rate is tuned between 1 and 5 Hz. Under these conditions",
        "the beam power after the RFQ is lower than 100 W. At the end of 2017",
        "the 352 MHz RFQ conditioning has been completed (with the same duty cycle) and the proton beam has been accelerated. The increase of the beam power is expected to continue in 2018 in order to reach several kilowatts by the end of the year. In addition",
        "two Ionization beam Profile Monitors (IPM) developed for ESS have been tested on the deviated beam line with a very low duty cycle. The IPHI facility should demonstrate the possibility to produce neutrons with a flexible compact accelerator in the framework of the SONATE project. This paper presents the status of the IPHI project in April 2018."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf016.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF016",
      "page_number": "694",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF017",
      "title": "Stability Analysis of the TOP-IMPLART 35 MeV Proton Beam",
      "authors": [
        "P. Nenzi",
        "A. Ampollini",
        "G. Bazzano",
        "L. Picardi",
        "C. Ronsivalle",
        "V. Surrenti",
        "E. Trinca",
        "M. Vadruccipresenter",
        "ENEA C.R. Frascati",
        "Frascati (Roma)",
        "Italy",
        "The TOP-IMPLART (Intensity Modulated Proton Linear Accelerator for RadioTherapy) is the demonstrator of a 150 MeV proton linear accelerator devoted to cancer treatment application under development at ENEA-Frascati. It is a full linear machine composed by a 425 MHz 7 MeV injector and a high frequency linac operating at 2997.92 MHz. The first accelerating section",
        "installed and in operation",
        "consists of 4 SCDTL structures and delivers a 35 MeV beam in 3 microseconds pulses at a maximum repetition frequency of 50 Hz. The principal advantage of a linear accelerator",
        "in a therapeutic application",
        "is the quick setting possibility (up to pulse-to-pulse",
        "in principle) of the physical properties of the proton beam",
        "offering larger flexibility (compared to traditional circular designs) and improved precision on dose delivery to the patient.",
        "The short and long range stability of the machine have been analyzed measuring on a pulse by pulse basis both the output beam characteristics and other machine parameters in order to identify those that mainly affect the beam stability. This work describes the methodology used in this study",
        "the main results achieved and the future developments."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf017.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF017",
      "page_number": "697",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF018",
      "title": "Characterization of Automatic Frequency Control systems for S-band Proton LINAC \"TOP-IMPLART\"",
      "authors": [
        "G. Bazzano",
        "P. Nenzi",
        "L. Picardi",
        "C. Ronsivalle",
        "M. Vadruccipresenter",
        "ENEA C.R. Frascati",
        "Frascati (Roma)",
        "Italy",
        "The TOP-IMPLART (Intensity Modulated Proton Linear Accelerator for RadioTherapy) proton linear accelerator is under development at ENEA-Frascati. It is composed by a 7 MeV",
        "425 MHz injector followed by a sequence of 2997.92 MHz accelerating modules. Four 10 MW klystrons will be used to power all high frequency structures up to a beam energy of 150 MeV. The first section",
        "consisting of 4 SCDTL modules (7 to 35 MeV)",
        "is operational at low repetition rate (up to 50 Hz). Whereas beam acceleration is effective even without closed loop control",
        "to ensure high beam current stability the resonance frequency variation must be kept for each SDCTL module within few kHz. This is achieved implementing an automatic frequency control (AFC) loop that detects structure detuning caused by thermal drifts and produce an error signal fed to a tuning motor. A prototype of an AFC custom solution",
        "derived from a medical electron linac",
        "has been tested on TOP-IMPLART accelerator. This was originally designed for magnetron frequency tuning with much larger frequency span. Other AFC systems with different components have been evaluated in order to reach the high required resolution."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf018.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF018",
      "page_number": "701",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF020",
      "title": "Performance of the CERN Low Energy Ion Ring (LEIR) with Xenon beams",
      "authors": [
        "R. Alemany-Fernández",
        "S.C.P. Albright",
        "O. Andujar",
        "M.E. Angoletta",
        "J. Axensalva",
        "H. Bartosik",
        "G. Baud",
        "N. Biancacci",
        "M. Bozzolan",
        "S. Cettour Cave",
        "K. Cornelis",
        "J. Dalla-Costa",
        "M. Delrieux",
        "A. Dworak",
        "A. Findlay",
        "F. Follin",
        "A. Frassier",
        "M. Gabriel",
        "A. Guerrero",
        "M. Haase",
        "S. Hirlaender",
        "S. Jensen",
        "V. Kain",
        "L.V. Kolbeck",
        "Y. Le Borgne",
        "D. Manglunki",
        "O. Marqversen",
        "S. Massot",
        "D. Moreno Garcia",
        "D.J.P. Nicosia",
        "S. Pasinelli",
        "L. Pereira",
        "D. Perez",
        "A. Rey",
        "J.P. Ridewood",
        "F. Roncarolo",
        "Á. Saá Hernández",
        "R. Scrivens",
        "O.G. Sveen",
        "G. Tranquille",
        "E. Veyrunes",
        "CERN",
        "Geneva",
        "Switzerland",
        "In 2017 the CERN Low Energy Ion Ring demonstrated once more the feasibility of injecting",
        "accumulating",
        "cooling and accelerating a new nuclei",
        "129Xe39 . The operation of this new ion species started at the beginning of March with the start up of the xenon ion source and the Linac3. Ten weeks later the beam arrived to the Low Energy Ion Ring (LEIR) triggering the start of several weeks of beam commissioning in view of providing the injector complex with Xenon beams for different experiments and a series of machine development experiments in LEIR. Two types of beams were setup",
        "the so called EARLY beam",
        "with a single injection into LEIR from Linac3",
        "and the NOMINAL beam with up to seven injections. 2017 was as well an interesting year for LEIR because several improvements in the control system of the accelerator and in the beam instrumentation were done in view of increasing the machine reliability. This paper summarises the beam commissioning phase and all the improvements carried out during 2017."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf020.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF020",
      "page_number": "705",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF021",
      "title": "Identification and Removal of SPS Aperture Limitations",
      "authors": [
        "V. Kain",
        "R. Alemany-Fernandezpresenter",
        "H. Bartosik",
        "S. Cettour Cave",
        "K. Cornelis",
        "P. Cruikshank",
        "J.A. Ferreira Somoza",
        "B. Goddard",
        "C. Pasquino",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN SPS (Super Proton Synchrotron) serves as LHC injector and provides beam for the North Area fixed target experiments. Since the 2016 run automated local aperture scans have been performed with the main focus on the vertical plane where limitations typically arise due to the flat vacuum chambers in most SPS elements. For LHC beams the aperture limitations with the present low integer tune optics also occur at locations with large dispersion. Aperture measurements in the horizontal plane using a variety of techniques were performed and showed surprising results",
        "which could partially explain the unexpected losses of high intensity LHC beams at the SPS flat bottom. In this paper",
        "reference measurements from 2016 are compared with the ones taken at the beginning of the run in 2017. Several aperture restrictions in the vertical plane could be found and cured",
        "and a potential systematic restriction in the horizontal plane has been identified. The results of the measurements and the origin of the restrictions are presented in this paper",
        "and the outlook for partial mitigation is discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf021.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF021",
      "page_number": "709",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF022",
      "title": "Studies of a New Optics With Intermediate Transition Energy as Alternative for High Intensity LHC Beams in the CERN SPS",
      "authors": [
        "M. Carlà",
        "H. Bartosik",
        "M.S. Beckpresenter",
        "K.S.B. Li",
        "M. Schenk",
        "CERN",
        "Geneva",
        "Switzerland",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "The LHC injector upgrade project calls for a twofold increase in intensity of the SPS proton beam. In this paper",
        "we present studies with a new SPS optics called Q22",
        "which has a transition energy in between the one of the operationally used Q20 and Q26 optics. This new optics provides a compromise between the stability of Q20",
        "due to the low transition energy",
        "and the reduced requirements in terms of RF voltage and power in Q26. A non-linear effective model of Q22 has been extrapolated from beam based measurements and used to complement the SPS non-linear optics model. Furthermore the studies of the TMCI threshold performed so far are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf022.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF022",
      "page_number": "713",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF023",
      "title": "The Beamlines of the CERN East Area Renovation Project",
      "authors": [
        "J. Bernhard",
        "M. Bonnet",
        "Q. Bouirek",
        "D. Brethoux",
        "B.D. Carlsen",
        "A. Ebn Rahmoun",
        "J. Etheridge",
        "S. Evrard",
        "L. Gatignon",
        "E. Harrouch",
        "M. Lazzaroni",
        "M. Van Dijk",
        "A. Watrigant",
        "CERN",
        "Geneva",
        "Switzerland",
        "The East Area at the Proton Synchrotron is one of CERN's longest running facilities for experiments",
        "beam tests",
        "and irradiations with a successful history of over 55 years. The facility serves more than 20 user teams for about 200 days of running each year and offers mixed secondary hadron",
        "electron and muon beams of 0.5 GeV/c to 10 GeV/c. In addition",
        "the primary proton beam or ion beam is transported to the irradiation facilities CHARM and IRRAD. Due to the steadily high user demand",
        "the CERN management approved an upgrade and renovation of the facility to meet future beam test and physics requirements. New beam optics will assure a better transmission and purity of the secondary beams",
        "now also with the possibility of highly pure electron",
        "hadron or muon beams. The upgrade includes a pulsed powering scheme with energy recovering power supplies and new magnets",
        "reducing both power and cooling requirements. Together with the building consolidation",
        "this results in a considerably lower energy consumption. The renovation phase is scheduled during the technical stops between 2018 and 2020. We will give an overview of the project scope including upgrades and future beams."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf023.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF023",
      "page_number": "717",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF024",
      "title": "Impedance and Instability Studies in LEIR with Xenon",
      "authors": [
        "N. Biancacci",
        "H. Bartosik",
        "M. Gąsior",
        "S. Hirlaender",
        "V. Kain",
        "T.E. Levens",
        "E. Métral",
        "CERN",
        "Geneva",
        "Switzerland",
        "Rome University La Sapienza",
        "Roma",
        "Italy",
        "In 2017",
        "the LEIR accelerator has been operated with Xe39+ beam for fixed target experiments in the SPS North Area. The different ion species",
        "with respect to the usually operated Pb54+",
        "allowed for additional comparative measurements of tune shift versus intensity at injection energy both in coasting and bunched beams. The fast transverse instability observed for high accumulated intensities has been as well characterized and additional observations relevant to impedance have been collected from longitudinal Schottky signal and BTF measurements. The results of these measurements are summarised and compared to the currently developed machine impedance model."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf024.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF024",
      "page_number": "720",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF025",
      "title": "Multi-turn Study in FLUKA for the Design of CERN-PS Internal Beam Dumps",
      "authors": [
        "J.A. Briz Monago",
        "M. Calviani",
        "F. Cerutti",
        "J.J. Esala",
        "S.S. Gilardoni",
        "F.-X. Nuiry",
        "G. Romagnoli",
        "G. Sterbini",
        "V. Vlachoudis",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN Proton-Synchrotron (PS) accelerator is currently equipped with two internal beam dumps in operation since the 1970's. An upgrade is required to be able to withstand the beams that will be produced after the end of the LIU (LHC Injector Upgrade) project. For the design of the new dumps",
        "the interaction and transport of beam and all secondary particles generated has been simulated using FLUKA. The working principle of the internal beam dump in the PS ring is very peculiar with respect to the other dumps in the CERN accelerator complex. A moving dump intercepts the circulating beam during few milliseconds like a fast scraper. The moving dump shaving the beam",
        "the multi-turn transport of beam particles in the PS accelerator and a time-dependent energy deposition in the dump were modeled. The methodology and the results obtained in our studies for the dump core and downstream equipment will be reported in this contribution."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf025.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF025",
      "page_number": "724",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF026",
      "title": "Higher-Harmonic RF System for Landau Damping in the CERN PS",
      "authors": [
        "H. Damerau",
        "A. Lasheen",
        "E.N. Shaposhnikova",
        "CERN",
        "Geneva",
        "Switzerland",
        "Longitudinal coupled-bunch instabilities after transition crossing and at the flat-top limit the intensity of LHC-type beams in the CERN Proton Synchrotron (PS). A dedicated coupled-bunch feedback for dipole oscillation modes",
        "using a Finemet cavity as wide-band longitudinal kicker",
        "suppresses the instabilities up to an intensity of about 2·1011 particles per bunch at extraction. However",
        "dipole and quadrupole coupled-bunch oscillations are observed beyond this intensity. At the flat-top they were damped with a 40 MHz RF cavity operated as a higher-harmonic RF system to increase Landau damping",
        "in addition to the principal RF system at 10 MHz. The existing 40 MHz RF system",
        "designed for RF manipulations at fixed frequency",
        "does not cover the frequency range required during acceleration. It is therefore proposed to install a tunable RF system with a 5% relative frequency swing. This paper summarizes the observations of instability damping at the flat-top and presents preliminary parameters for the higher-harmonic RF system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf026.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF026",
      "page_number": "728",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF027",
      "title": "CERN PS Kicker for Proton Injection: from Beam-Based Waveform Measurements to Hardware Improvements",
      "authors": [
        "V. Forte",
        "A. Ferrero Colomopresenter",
        "M.A. Fraser",
        "T. Kramer",
        "CERN",
        "Geneva",
        "Switzerland",
        "For 2017 operation",
        "the termination mode of the CERN Proton Synchrotron (PS) horizontal injection kicker was permanently changed to short-circuited",
        "to be compliant with the future performances requested by the LHC Injectors Upgrade (LIU) project. An extensive campaign of measurements was performed through a dedicated beam-based technique. The measurements identified possibilities for optimisation of the kicker system and were fundamental to properly tune the PSpice simulation model of the kicker",
        "as well as for validating the hardware changes. The model was finally used to estimate the horizontal emittance growth for the future injection schemes in the PS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf027.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF027",
      "page_number": "732",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF028",
      "title": "Energy Deposition Studies and Analysis of the Quench Behavior in the Case of Asynchronous Dumps During 6.5 TeV LHC Proton Beam Operation",
      "authors": [
        "M.I. Frankl",
        "W. Bartmann",
        "M. Bednarek",
        "C. Bracco",
        "A. Lechner",
        "A.P. Verweij",
        "C. Wiesner",
        "D. Wollmann",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN LHC beam dumping system comprises a series of septa and fast-pulsed kicker magnets for extracting the stored proton beams to the external beam dumps. Different absorbers in the extraction region protect superconducting magnets and other machine elements in case of abnormal beam aborts",
        "where bunches are swept across the machine aperture. During Run 2 of the LHC",
        "controlled beam loss experiments were carried out at 6.5 TeV probing the particle leakage from protection devices under realistic operation conditions. This paper presents particle shower simulations analyzing the energy deposition in superconducting coils and assessing if the observed magnet quenches are compatible with the presently known quench limits."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf028.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF028",
      "page_number": "736",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF029",
      "title": "Observation of Fast Losses in the LHC Operation in 2017",
      "authors": [
        "A.A. Gorzawski",
        "N. Fuster-Martínez",
        "S. Redaelli",
        "C. Xu",
        "C. Zamantzas",
        "CERN",
        "Geneva",
        "Switzerland",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "Four diamond detectors that provide beam loss measurements with time resolution in the nanosecond range were added in the vicinity of the primary collimators of the Large Hadron Collider (LHC). This is a powerful diagnostic tool that provides the unique chance to measure bunch-by-bunch losses. The operation of the LHC in 2017 presented several unusual events of fast",
        "high intensity beam losses",
        "many of them captured by the diamond detectors in the betatron cleaning region. In this paper we review some of the relevant loss cases that were analyzed in the wider scope of determining the source of the instability generating these losses. We show few of the possible applications of this detectors in daily operations."
      ],
      "institutions": [],
      "abstract": "H. Garcia Moralespresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf029.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF029",
      "page_number": "740",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF030",
      "title": "Electron Cloud Build Up for LHC Sawtooth Vacuum Chamber",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf030.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF030",
      "page_number": "744",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF031",
      "title": "Beam Simulation Studies for the Upgrade of the SPS Beam Dumping System",
      "authors": [
        "C. Heßler",
        "W. Bartmann",
        "E. Carlier",
        "L. Ducimetière",
        "B. Goddard",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "The SPS at CERN currently uses a beam dumping system that is installed in the long straight section 1 (LSS1) of the SPS. This system consists of two beam stopper blocks for low and high energy beams",
        "as well as two vertical and three horizontal kicker magnets",
        "which deflect and dilute the beam on the dumps. Within the frame of the LHC injector upgrade project (LIU) the beam dumping system will be relocated to long straight section 5 (LSS5) and upgraded with an additional vertical kicker",
        "new main switches and a single new beam dump",
        "which covers the full energy range. The impact of a possible increase of the vertical kicker rise time on the beam has been studied in simulations with MAD-X for the different optics in the SPS. Furthermore",
        "the impact on the beam in failure scenarios such as the non-firing of one kicker has been investigated. The results of these studies will be presented and discussed in this paper. Operational mitigation methods to deal with an increased rise time will also be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf031.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF031",
      "page_number": "747",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF032",
      "title": "Beam Transfer Line Design to the SPS Beam Dump Facility",
      "authors": [
        "Y. Dutheil",
        "J. Bauche",
        "M. Calviani",
        "L.A. Dougherty",
        "M.A. Fraser",
        "B. Goddard",
        "C. Hesslerpresenter",
        "J. Kurdej",
        "E. Lopez Sola",
        "CERN",
        "Geneva",
        "Switzerland",
        "Studies for the SPS Beam Dump Facility (BDF) are ongoing within the scope of the Physics Beyond Collider project. The BDF is a proposed fixed target facility to be installed in the SPS North Area",
        "to accommodate the SHiP experiment (Search for Hidden Particles)",
        "which is most notably aiming at studying hidden sector particles. This experiment requires a high intensity slowly extracted 400 GeV proton beam with 4·1013 protons per 1 s spill to achieve 4·1019 protons on target per year. The extraction and transport scheme will make use of the first 600 m of the existing North Area extraction line. In this paper",
        "we will present the design of the additional 600 m of transfer line towards BDF branching off from the existing line and discuss the detailed design of the BDF beam line",
        "its components and optics. We present the latest results on the study and design of a new laminated Lambertson splitter magnet to provide fast switch between the current North Area experiments and the BDF. The latest specification of a dipole dilution system used to reduce the local peak power of the beam on the target is also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf032.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF032",
      "page_number": "751",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF033",
      "title": "Beam Optics Studies for BDF and for Tests of a Prototype Target",
      "authors": [
        "C. Heßler",
        "M. Calviani",
        "Y. Dutheil",
        "M.A. Fraser",
        "B. Goddard",
        "V. Kain",
        "E. Lopez Sola",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "Within the frame of the Physics Beyond Collider project a new fixed target facility at the SPS North Area",
        "the so-called Beam Dump Facility (BDF)",
        "is under study. BDF requires a high intensity slowly extracted 400 GeV proton beam with 4·1013 protons per 1 s spill to achieve 4·1019 protons on target per year. This results in an exceptionally high average beam power of 355 kW on the target",
        "which is a major challenge. To validate the target design",
        "a test of a prototype target is planned for 2018 at an existing North Area beam line. A large part of this beam line is in common with the future BDF beam line with comparable beam characteristics and several measurement campaigns were performed in 2017 to study the optics of the line in preparation for the test. The intrinsic characteristics of the slow extraction process make the precise characterisation of the beam reaching the target particularly challenging. This paper presents beam and lattice characterisation methods and associated measurement results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf033.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF033",
      "page_number": "754",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF034",
      "title": "LEIR Injection Efficiency Studies as a Function of the Beam Energy Distribution from Linac3",
      "authors": [
        "S. Hirlaender",
        "R. Alemany-Fernández",
        "H. Bartosik",
        "G. Bellodi",
        "N. Biancacci",
        "V. Kain",
        "R. Scrivens",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [
        "High intensities in the CERN Low Energy Ion Ring (LEIR) are achieved using multi-turn injections from the pre-accelerator Linac3 combined with simultaneous stacking in momentum and transverse phase spaces. Up to seven consecutive 200 μs long, 200 ms spaced pulses are injected from Linac3 into LEIR by stacking each of them into the six-dimensional phase-space over 70 turns. An inclined septum magnet allows proper filling of the transverse phase-space plane, while longitudinal stacking requires momentum variation achieved by a shift of mean momentum over time provided by phase shifting a combination of 2 RF cavities at the exit of Linac3. The achievable maximum accumulated intensity depends strongly on the longitudinal beam quality of the injected beam. The longitudinal Schottky signal is used to measure the received energy distribution of the circulating beam which is then correlated with the obtained injection efficiency. This paper presents the experimental studies to understand and further improve the injection reliability and the longitudinal stacking."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf034.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF034",
      "page_number": "758",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF035",
      "title": "Observations of SPS Slow-Extracted Spill Quality Degradation and Possible Improvements",
      "authors": [
        "F.M. Velotti",
        "H. Bartosik",
        "K. Cornelis",
        "M.A. Fraser",
        "B. Goddard",
        "S. Hirlaenderpresenter",
        "V. Kain",
        "O. Michels",
        "M. Pari",
        "CERN",
        "Geneva",
        "Switzerland",
        "The SPS delivers slow extracted proton and heavy ion spills of several seconds to the North Area fixed target experiments with a very high duty factor. Reduced machine reproducibility due to magnetic history and power supply ripples on the main circuits lead however to frequent degradation of the spill duty factor. In this paper",
        "the measured effect of the SPS magnetic history on spill quality and principal machine parameters is presented. Another detailed measurement campaign was aimed at characterising the frequency content and response of the spill to noise on the main power supplies ripples. The main findings of this study will also be reported. Finally",
        "simulations of possible improvements based on the data acquired are discussed",
        "as well as an extrapolation to the possible spill quality after the implementation of the improvements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf035.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF035",
      "page_number": "761",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF036",
      "title": "Studies of the Injection and Cooling Efficiency in LEIR Using the Longitudinal Schottky Spectrum",
      "authors": [
        "S. Hirlaender",
        "R. Alemany-Fernández",
        "H. Bartosik",
        "N. Biancacci",
        "V. Kain",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN Low Energy Ion Ring (LEIR) has two main operational beams with their associated cycles",
        "the so-called EARLY and the NOMINAL beam. The EARLY beam consists of a single injected pulse from the"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf036.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF036",
      "page_number": "765",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF037",
      "title": "Validation of the CERN PS Eddy Current Injection Septa",
      "authors": [
        "M. Hourican",
        "B. Balhan",
        "J.C.C.M. Borburgh",
        "T. Masson",
        "A. Sanz Ull",
        "CERN",
        "Geneva",
        "Switzerland",
        "As part of the upgrade of the CERN PS accelerator from 1.4 GeV to 2 GeV",
        "new injection septa have been developed. The system is comprised of a pulsed eddy current septum magnet and a pulsed eddy current bumper magnet. Both magnets will be housed in a common vacuum vessel and powered by independent power converters. In-depth studies and simulations have been performed to reduce as much as possible the leak field by designing specific magnetic shielding",
        "combined with dual function beam impedance shielding. A prototype magnet was built and measured to validate the simulations. The final complete system will be bake-able at 200C and uses demineralised water for cooling. Closed circuit cooling systems have been integrated to reduce risks of vacuum leaks. This report describes the electromechanical design from the concept and simulation stages to the prototyping and final manufacturing. Results of the initial magnetic measurements",
        "including field homogeneity and leak field mitigation methods are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf037.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF037",
      "page_number": "768",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF038",
      "title": "Prototyping Activities for a New Design of CERN's Antiproton Production Target",
      "authors": [
        "C. Torregrosa",
        "M.E.J. Butcher",
        "M. Calviani",
        "J.P.C. Espadanal",
        "R. Ferriere",
        "L. Gentini",
        "E. Grenier-Boley",
        "L. Mircea Grec",
        "A. Perillo-Marcone",
        "R. Seidenbinder",
        "N.S. Solieri",
        "M.A. Timmins",
        "E. Urrutia",
        "V. Vlachoudis",
        "CERN",
        "Geneva",
        "Switzerland",
        "Antiprotons are produced at CERN by impacting intense proton beams of 26 GeV/c onto a high-Z water-cooled target. The current design consists in an Ir core target in a graphite matrix and inserted in a Ti-6Al-4V assembly. A new target design has been foreseen for operation after 2021 aiming at improving the operation robustness and antiproton production yield",
        "triggering several R&D activities during the last years. First",
        "both numerical (use of hydrocodes) and experimental approaches were carried out to study the core material response under extreme dynamic loading when impacted by the primary proton beam. The lessons learnt from these studies have been then applied to further prototyping and testing under proton beam impact at the CERN-HiRadMat facility. A first scaled prototype consisting in Ta rods embedded in an expanded graphite matrix was irradiated in 2017",
        "while in 2018",
        "the PROTAD experiment will test different real-scale AD-Target prototypes",
        "in which the old water-cooled assembly is replaced by a more compact air-cooled one",
        "and different core geometry and material configurations are investigated. This contribution details these prototyping and testing activities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf038.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF038",
      "page_number": "772",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF039",
      "title": "Electron Cooling Simulation and Experimental Benchmarks at LEIR",
      "authors": [
        "A. Latina",
        "H. Bartosik",
        "N. Biancacci",
        "R. Corsini",
        "D. Gamba",
        "S. Hirlaender",
        "A. Huschauer",
        "CERN",
        "Geneva",
        "Switzerland",
        "A fast and accurate simulation of Electron Cooling has recently been implemented in the tracking code RF-Track. The implementation",
        "which is based on a \"hybrid kinetic\" model",
        "enables the simulation of a large variety of realistic scenarios",
        "including imperfections such as gradients in the electron density",
        "misalignments of electrons / ions / solenoidal fields",
        "both in the static and in the dynamic regimes. Benchmarks of the simulations against measurements performed at LEIR",
        "using Lead and Xenon ions",
        "are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf039.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF039",
      "page_number": "776",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF040",
      "title": "Beam Loss Measurements for Recurring Fast Loss Events During 2017 LHC Operation Possibly Caused by Macroparticles",
      "authors": [
        "A. Lechner",
        "B. Auchmann",
        "E. Bravin",
        "A.A. Gorzawski",
        "L. K. Grob",
        "E.B. Holzer",
        "B. Lindstrompresenter",
        "T. Medvedeva",
        "D. Mirarchi",
        "R. Schmidt",
        "M. Valette",
        "D. Wollmann",
        "CERN",
        "Geneva",
        "Switzerland",
        "The availability of the LHC machine was adversely affected in 2017 by tens of beam aborts provoked by frequent loss events in one standard arc cell (16L2). In most of the cases",
        "the dumps were triggered by concurrently developing fast beam instabilities leading to particle losses in the betatron cleaning insertion. Many of the events started with a distinct sub-millisecond loss peak comparable to regular dust particle events",
        "which have been observed along all the LHC since the start-up. In contrast to regular dust events",
        "persistent losses developed in cell 16L2 after the initial peaks which can possibly be explained by a phase transition of macroparticles to the gas phase. In this paper",
        "we summarize the observed loss characteristics such as spatial loss pattern and time profiles measured by Beam Loss Monitors (ionization chambers). Based on the measurements",
        "we estimate the energy deposition in macroparticles and reconstruct proton loss rates as well as the gas densities after the phase transition. Differences between regular dust events and events in 16L2 are highlighted and the ability to induce magnet quenches is discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf040.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF040",
      "page_number": "780",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF041",
      "title": "Residual Gas Ions Characterization from the REXEBIS",
      "authors": [
        "N. Bidault",
        "M.L. Lozanopresenter",
        "J.A. Rodriguez",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Isotope mass Separator On-Line DEvice (ISOLDE) is a user facility located at CERN where Radioactive Ion Beams (RIBs) are produced from proton collisions onto a target",
        "mass separated and transported to user experimental stations either directly at low energy or after being post- accelerated",
        "notably for nuclear physics studies. Prior to acceleration through the REX/HIE-ISOLDE linear acceler- ator",
        "the ion beam is accumulated",
        "bunched and cooled in a Penning trap (REXTRAP) and afterwards charge-bred in an Electron Beam Ion Source (REXEBIS). Multi-charged radioactive species of interest are then selected by a mass-to- charge (A/q) ratio separator dipole in the Low Energy Beam Transfer Line (LEBT). A method is presented to character- ize the Residual Gas Ion (RGI) background contamination for diﬀerent operational conditions of the REXEBIS. More particularly",
        "a discussion is held about the inﬂuence of the conﬁnement time inside the charge-breeder on the residual gas spectrum. Finally",
        "a method to identify sub-pico-Ampere contaminants is demonstrated."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf041.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF041",
      "page_number": "784",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF042",
      "title": "Characterization of the Beam Energy Spread at the REX/HIE-ISOLDE Linac",
      "authors": [
        "M.L. Lozano",
        "N. Bidault",
        "E. Fadakis",
        "M.A. Fraser",
        "E. Matli",
        "J.A. Rodriguez",
        "CERN",
        "Geneva",
        "Switzerland",
        "ISOLDE is an on-line radioactive isotope separator located at CERN that works by colliding protons accelerated in the PS Booster into a fixed target and by separating the resultant ionized isotopes using a magnetic separator. The completion of the HIE-ISOLDE superconducting linac allows the acceleration of these ions to energy levels that were not reachable before",
        "opening the door to new experiments in different fields. These experiments often have special requirements in terms of beam intensity and purity",
        "transverse emittance or energy spread. A possible way to reduce the energy spread of the beam delivered to the experimental stations is to use one or more of the superconducting cavities as bunchers. The main results of several tests conducted during the last beam commissioning campaign prove that this mode of operation is feasible and will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf042.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF042",
      "page_number": "787",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF043",
      "title": "Testing the Double-Crystal Setup for Physics Beyond Colliders Experiments in the UA9-SPS Experiment",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "The UA9 experiment is installed in the CERN SPS to study how coherent interaction in crystalline materials can be used to steer particles beams. Recently",
        "new experiments requiring complex beam manipulations by means of crystals have been proposed in the framework of the Physics Beyond Colliders study group at CERN. In particular",
        "it was proposed to use a first crystal to direct protons from the LHC beam halo on a target placed in the beam pipe and to use a second crystal to deflect the particles produced in the target (double-crystal setup)",
        "allowing to measure their polarization. The layout of the UA9 experiment in the CERN SPS has been modified to study the feasibility of the proposed scenario and its compatibility with the delicate environment of a superconducting collider. A first set of measurements was performed in 2017 proving that the protons deflected by the first crystal can be intercepted and successfully deflected by a second crystal. A further upgrade of the experiment in 2018 will allow measuring more precisely the combined efficiency of the two crystals and the beam-induced background."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf043.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF043",
      "page_number": "790",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF044",
      "title": "Schedule Evolution of the Linac4 Installation During the Lifetime of the Linac4 Project and Connection Forecast",
      "authors": [
        "J. Coupard",
        "A. Berjillos",
        "J.-P. Corso",
        "K. Foraz",
        "B. Nicquevertpresenter",
        "E. Paulat",
        "M. Vretenar",
        "CERN",
        "Geneva",
        "Switzerland",
        "The new CERN linear accelerator Linac4 started the installation phase in 2010 after the delivery of the new building and tunnel by the civil engineering and was inaugurated six years later. It will be connected to the CERN accelerators chain and replace the current proton linear accelerator",
        "Linac2",
        "during the second long shut-down (LS2) of the Large Hadron Collider (LHC) in 2019. This paper aims to summarize the schedule evolution through the different phases of installation",
        "from general services to machine installation",
        "highlight the key factors that contributed to drive the schedule (safety",
        "logistics and integration) and describe the coordination study of the future connection (integration",
        "schedule",
        "logistics",
        "constraints and priorities)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf044.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF044",
      "page_number": "794",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF045",
      "title": "Studies for Future Fixed-Target Experiments at the LHC in the Framework of the CERN Physics Beyond Colliders Study",
      "authors": [
        "S. Redaelli",
        "M. Ferro-Luzzi",
        "CERN",
        "Geneva",
        "Switzerland",
        "IN2P3-CNRS",
        "Orsay",
        "France",
        "A study on prospects for Physics Beyond Colliders at CERN was launched in September 2016 to assess the capabilities of the existing accelerators complex. Among several other working groups",
        "this initiative triggered the creation of a working group with the scope of studying a few specific proposals to perform fixed-target physics experiments at the Large Hadron Collider (LHC). This includes for example physics experiments with solid or gaseous internal targets",
        "polarized gas targets",
        "and experiments using bent-crystals for halo splitting from beam core for internal targets. The focus of the working group's activities is on the technical feasibility and on implications to the LHC ring. In this paper",
        "the current status of the studies is presented and future plans are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf045.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF045",
      "page_number": "798",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF046",
      "title": "Conceptual Design of a Collimation System for the CERN Super Proton Synchrotron",
      "authors": [
        "M. Patecki",
        "A. Mereghetti",
        "D. Mirarchi",
        "S. Redaellipresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Super Proton Synchrotron (SPS) is the last accelerator in the LHC Injectors Chain. Its performance is constantly being improved in frame of the LHC Injectors Upgrade (LIU) Project in order to prepare it for the future HL-LHC (High Luminosity LHC) operation. One of the LIU goals is to nearly double the intensity extracted from the SPS",
        "up to 2.32×1011 p/bunch. In recent years",
        "nearly 10% of losses are observed for nominal intensity and LHC-type beams; they grow to about 20% for the intensity approaching the HL-LHC target. Beam losses imply activation and aging of the SPS hardware; the possibility to add a collimation system is being considered to mitigate this problem. In this paper we present studies of a collimation system design for the SPS. The concept is based on a primary horizontal collimator located in an available position with high enough dispersion",
        "and a secondary collimator to intercept the particles leaking out from the primary collimator. Performance of the proposed collimation system is evaluated by means of numerical simulations."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf046.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF046",
      "page_number": "802",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF047",
      "title": "Systematic Studies of Transverse Emittance Measurements Along the CERN PS Booster Cycle",
      "authors": [
        "A. Santamaría García",
        "S.C.P. Albright",
        "H. Bartosik",
        "J.A. Briz Monago",
        "G.P. Di Giovanni",
        "V. Forte",
        "B. Mikulec",
        "F. Roncarolo",
        "V. Vlachoudis",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN Proton Synchrotron Booster (PSB) will need to deliver 2 times the current brightness to the Large Hadron Collider (LHC) after the LHC Injectors Upgrade (LIU) to meet the High-Luminosity-LHC beam requirements. Beam intensity and transverse emittance are the key parameters to increase brightness",
        "the latter being more difficult to manipulate. It is",
        "therefore",
        "crucial to monitor not only the emittance evolution between the different injectors but also along each acceleration cycle. To this end",
        "detailed emittance measurements were carried out for the four rings of the PSB at various times in the cycle with different beam types. A thorough analysis of systematic error sources was conducted including multiple Coulomb scattering happening during profile measurements with wire scanners",
        "where experimental and analytical treatments of the emittance blow-up were compared to FLUKA simulations. In order to properly account for the dispersive contribution",
        "the full momentum spread profile was considered using a deconvolution method. We conclude with an assessment of this first comprehensive emittance evolution measurement along the PSB cycle."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf047.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF047",
      "page_number": "806",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF048",
      "title": "LIU Space Charge Studies for the LHC Pre-Accelerators",
      "authors": [
        "F. Schmidt",
        "H. Bartosik",
        "CERN",
        "Geneva",
        "Switzerland",
        "In 2011 a working group has been started to study performance limitations due to Space Charge (SC) in the four LHC pre-accelerators",
        "LEIR",
        "PSB",
        "PS & SPS",
        "in view of the LHC Injector Upgrade (LIU) project. To this end external and in-house simulation tools have been benchmarked for the LIU study cases with the long-term goal of providing a full sequence of tested CERN Space Charge tools. It became clear that SC studies must be combined with trustworthy models of the machines",
        "including linear and non-linear errors. In particular an effective s-dependent non-linear model is required. Recent studies indicate that also the low frequency ripple spectrum due to conventional power supplies might play an important role for the beam dynamics in presence of space charge in the pre-injectors."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf048.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF048",
      "page_number": "810",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF049",
      "title": "Analysis of Loss Signatures of Unidentified Falling Objects in the LHC",
      "authors": [
        "L. K. Grob",
        "M. Dziadosz",
        "E.B. Holzer",
        "A. Lechner",
        "B. Lindstrom",
        "R. Schmidtpresenter",
        "D. Wollmann",
        "C. Zamantzas",
        "CERN",
        "Geneva",
        "Switzerland",
        "Particulates in the LHC beam pipes can interact with the proton beams and cause significant beam losses. The \"UFOs\" (unidentified falling objects) hypothesis describes a particle falling into the beam",
        "creating particle showers",
        "being ionized and repelled. Though the signals of the beam loss monitors support this",
        "many aspects remain unknown. Neither the source of the dust nor the release mechanism from the beam pipe are understood. The same holds for the forces involved in the interaction and the observed UFO rate reduction over the years. These open questions are approached from different angles. Firstly",
        "a new data analysis tool was established featuring advanced raw data selection and statistical analysis. Results of this analysis will be presented. Secondly",
        "dust samples were extracted from LHC components and analyzed to gain insight into the size distribution and material composition of the contamination. The performed observations and analysis lead to a better modelling of the UFO events and helped to understand the physics involved. The validated UFO models will be crucial in view of the high luminosity upgrade of the LHC (HL-LHC) and the Future Circular Collider (FCC)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf049.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF049",
      "page_number": "814",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF050",
      "title": "Beam Dynamics Simulations of the Effect of Power Converter Ripple on Slow Extraction at the CERN SPS",
      "authors": [
        "J. Prieto",
        "M.A. Fraser",
        "B. Goddard",
        "V. Kain",
        "L.S. Stoelpresenter",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "The SPS provides slowly extracted protons at 400 GeV/c to CERN's North Area Fixed Target experiments over spills of duration from 1-10 seconds. Low frequency ripple on the current in the main magnets originating from their power converters is a common issue that degrades the slow-extracted spill quality. In order to better understand how the stability of the power converters affects losses",
        "beam emittance and spill quality",
        "particle tracking simulations were carried out using MAD-X and compared to measurements",
        "with the impact of each magnet circuit investigated systematically. The implications for the performance of the SPS slow extraction are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf050.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF050",
      "page_number": "818",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF051",
      "title": "Investigating Beam Loss Reduction with Octupoles During Slow Extraction in the CERN SPS",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf051.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF051",
      "page_number": "822",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF052",
      "title": "Effects of Electrostatic Septum Alignment on Particle Loss During Slow Extraction at CERN SPS",
      "authors": [
        "J. Prieto",
        "Y. Dutheil",
        "M.A. Fraser",
        "B. Goddard",
        "V. Kain",
        "L.S. Stoelpresenter",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Slow extraction is an intrinsically lossy process that splits the beam with an electrostatic septum (ES)",
        "employing a thin-wire array to delimit the high electric field region that deflects the beam into the extraction channel. At CERN's Super Proton Synchrotron (SPS) the ES is over 16 m long and composed of 5 separate units containing separate wire-arrays that can be moved independently. The tanks are all mounted on a single support structure that can move the ensemble coherently. As a result",
        "the large number of positional degrees of freedom complicates the alignment procedure in operation. Obtaining and maintaining accurate alignment of the ES with the beam is therefore crucial for minimising beam loss. In this paper",
        "we investigate the alignment procedure for different operational scenarios using particle tracking simulations to understand the beam loss along the extraction straight as a function of the relative positions of each of the 5 separate ES units. An important aspect of the study was to understand the required alignment tolerance to achieve optimum extraction efficiency for a given configuration of wire-array thicknesses."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf052.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF052",
      "page_number": "826",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF053",
      "title": "Optimization of Diffuser (Pre-Scatterer) Configurations for Slow  Extraction Loss Reduction at Electrostatic Septa",
      "authors": [
        "B. Goddard",
        "B. Balhan",
        "J.C.C.M. Borburgh",
        "M.A. Fraser",
        "L.O. Jorat",
        "V. Kain",
        "C. Lolliot",
        "L.S. Stoelpresenter",
        "P. Van Trappen",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "Wigner Research Centre for Physics",
        "Institute for Particle and Nuclear Physics",
        "Budapest",
        "Hungary",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Uncontrolled beam loss at the electrostatic septum is a performance limit for several existing or planned high power hadron accelerators delivering slow-extracted spills to fixed targets. A passive diffuser",
        "or pre-scatterer",
        "in a suitable configuration has been shown to reduce such beamloss significantly",
        "with the actual gain factor depending on the parameters and details of the extraction process and hardware. In this paper",
        "the optimization of diffuser configurations is investigated for a range of beam energies and extraction conditions",
        "and the sensitivity to the available parameters explored via simulation results. The advantages and limitations of the diffuser are discussed and conclusions drawn concerning the specific case studies of the 8 GeV Fermilab debuncher ring and 400 GeV CERN SPS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf053.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF053",
      "page_number": "830",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF054",
      "title": "Slow Extraction Efficiency Measurements at the CERN SPS",
      "authors": [
        "M.A. Fraser",
        "K. Cornelis",
        "L.S. Esposito",
        "B. Goddard",
        "V. Kain",
        "F. Roncarolo",
        "L.S. Stoelpresenter",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "The high efficiency of most slow extraction systems makes quantifying the exact amount of beam lost in the process extremely challenging. This is compounded by the lack of time structure in the extracted beam",
        "as is typically required by the high-energy physics experiments",
        "and the difficulty in accurately calibrating D.C. intensity monitors in the extraction line at count rates of ~ 1013 Hz. As a result",
        "it is common for the extraction inefficiency to be measured by calibrating the beam loss signal induced by the slow extraction process itself. In this paper",
        "measurements of the extraction efficiency performed at the CERN Super Proton Synchrotron for the third-integer resonant slow extraction of 400 GeV protons over recent years will be presented and compared to expectation from simulation. The technique employed will be discussed along with its limitations and an outlook towards a future online extraction efficiency monitoring system will be given."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf054.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF054",
      "page_number": "834",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF055",
      "title": "Progress Toward a Dynamic Extraction Bump for Slow Extraction in the CERN SPS",
      "authors": [
        "L.S. Stoel",
        "M. Benedikt",
        "M.A. Fraser",
        "B. Goddard",
        "J. Prieto",
        "F.M. Velotti",
        "CERN",
        "Geneva",
        "Switzerland",
        "The possibility of reducing the angular spread of slow extracted particles with a time-dependent extraction bump at the CERN Super Proton Synchrotron (SPS) is under investigation. In order to create this so-called dynamic bump",
        "two orthogonal knobs were designed to enable independent movements of the beam in position and angle at the upstream end of the electrostatic extraction septum (ES). With the present slow extraction scheme",
        "simulations show that the use of a dynamic bump can reduce the angular spread at the ES by roughly a factor two and reduce beam loss on the ES. A reduction in the angular spread is also a prerequisite to exploit the full potential of other loss reduction techniques being considered for implementation at the SPS",
        "like the active or passive diffusers planned for installation upstream of the ES in 2018. In this paper",
        "the simulated loss reduction with a dynamic bump alone or in combination with other loss reduction techniques will be assessed",
        "the first beam-based tests of the dynamic bump presented",
        "the details of its implementation examined and its potential for future operation at the SPS discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf055.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF055",
      "page_number": "838",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF056",
      "title": "The CERN-ELENA Electron Cooler Magnetic System",
      "authors": [
        "G. Tranquille",
        "L.V. Jørgensen",
        "CERN",
        "Geneva",
        "Switzerland",
        "D. Luckin",
        "R.J. Warner",
        "Tesla Engineering Limited",
        "West-Sussex",
        "United Kingdom",
        "Phase space compression of the antiproton beam in ELENA will be performed by a new electron cooler the performance of which is greatly influenced by the properties of the electron beam. Careful design of the electron gun electrodes",
        "the efficient recuperation of the electrons in the collector and the quality of the guiding magnetic field ensure an optimal performance of the cooler. The ELENA cooler is a compact device incorporating an adiabatic expansion to reduce the electron beam temperature as well as electrostatic bending plates for efficient collection of the electron beam. The transverse components of the longitudinal field in the cooling section must be kept small (Bt/Bl ≤ 5x10-4) to ensure a minimal perturbation to the electron beam transverse temperature. The longitudinal field itself needs to be as low as possible such that the distortion to the closed orbit of the circulating ion beam due to the short 90° toroids is kept as small as possible. We present the solutions chosen to design and construct a magnetic system within the above constraints as well as the setup used to measure and optimise the magnetic field components."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf056.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF056",
      "page_number": "842",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF057",
      "title": "The SPS Tests of the HL-LHC Crab Cavities",
      "authors": [
        "R. Calaga",
        "O. Capatina",
        "G. Vandonipresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Two superconducting crab cavities in the framework of the High Luminosity (HL-LHC) LHC were built to test for the first time with proton beams in the Super Proton Synchrotron (SPS) at CERN. These tests will address the operation of the crab cavities in a high current and high intensity proton machine through the full energy cycle with a primary focus on cavity transparency",
        "performance and stability",
        "failures modes and long term effects on proton beams. An overview of the SPS cryomodule development towards the SPS tests along with the first test results are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf057.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF057",
      "page_number": "846",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF058",
      "title": "Optimization of the FCC-hh Beam Extraction System Regarding Failure Avoidance and Mitigation",
      "authors": [
        "E. Renner",
        "M.J. Barnes",
        "W. Bartmann",
        "F. Burkart",
        "E. Carlier",
        "L. Ducimetière",
        "B. Goddard",
        "T. Kramer",
        "A. Lechner",
        "N. Magnin",
        "V. Senaj",
        "J.A. Uythoven",
        "P. Van Trappen",
        "C. Wiesnerpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "A core part of the Future Circular Collider (FCC) study is a high energy hadron-hadron collider with a circumference of nearly 100~km and a center of mass beam energy of 100~TeV. The energy stored in one beam at top energy is 8.3~GJ",
        "more than 20 times that of the LHC beams. Due to the large damage potential of the FCC-hh beam",
        "the design of the beam extraction system is dominated by machine protection considerations and the requirement of avoiding any material damage in case of an asynchronous beam dump. Erratic operation of one or more extraction kickers is a main contributor to asynchronous beam dumps. The presented study shows ways to reduce the probability and mitigate the impact of erratic kicker switching. Key proposals to achieve this include layout considerations",
        "different hardware options and alternative reaction strategies in case of erratic extraction kicker occurrence. Based on these concepts",
        "different solutions are evaluated and an optimized design for the FCC-hh extraction system is proposed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf058.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF058",
      "page_number": "850",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF059",
      "title": "Design and Evaluation of FCC-hh Injection Protection Schemes",
      "authors": [
        "E. Renner",
        "M.J. Barnes",
        "W. Bartmann",
        "C. Bracco",
        "R. Bruce",
        "F. Burkart",
        "B. Goddard",
        "A. Lechner",
        "L.S. Stoel",
        "F.M. Velotti",
        "C. Wiesnerpresenter",
        "D. Woog",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Future Circular Collider (FCC) study considers several injector scenarios for FCC-hh",
        "the proposed 100~TeV centre of mass hadron collider located at CERN. The investigated options include amongst others to use the LHC at 3.3~TeV or a superconducting SPS at 1.3~TeV as a High Energy Booster (HEB). Due to the high energy of the injected proton beam and the short time constant of injection failures",
        "a thorough consideration of potential failure cases is of major importance. Further attention has to be given to the fact that the injection is - as in LHC - located upstream of the side experiments. Failure scenarios are identified for both injector options",
        "appropriate designs of injection protection schemes are proposed and first simulations are conducted to validate the protection efficiency."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf059.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF059",
      "page_number": "854",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF060",
      "title": "Injection and Dump Systems for a 13.5 TeV Hadron Synchrotron HE-LHC",
      "authors": [
        "W. Bartmann",
        "M.J. Barnes",
        "L. Ducimetière",
        "B. Goddard",
        "M. Hofer",
        "T. Kramer",
        "A. Lechner",
        "E. Renner",
        "A. Sanz Ull",
        "V. Senaj",
        "L.S. Stoel",
        "C. Wiesnerpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "One option for a future circular collider at CERN is to build a 13.5 TeV hadron synchrotron",
        "or High Energy LHC (HE-LHC) in the LHC tunnel. Injection and dump systems will have to be upgraded to cope with the higher beam rigidity and increased damage potential of the beam. The required modifications of the beam transfer hardware are highlighted in view of technology advancements in the field of kicker switch technology. An optimised straight section optics is shown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf060.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF060",
      "page_number": "858",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF061",
      "title": "Use of a Massless Septum to Increase Slow-Extraction Efficiency",
      "authors": [
        "K. Brunner",
        "M.A. Fraser",
        "B. Goddard",
        "L.S. Stoel",
        "C. Wiesnerpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Wigner Research Centre for Physics",
        "Institute for Particle and Nuclear Physics",
        "Budapest",
        "Hungary",
        "The Super Proton Synchrotron (SPS) at CERN provides slow-extracted beam for Fixed Target experiments in the North Area. For the higher extracted beam intensities requested by future experimental proposals",
        "beam-loss induced activation will be one of the limiting factors for the availability of such a facility. In this paper",
        "we present and discuss the concept of using a massless septum magnet to increase the extraction efficiency and decrease losses caused by protons scattering on the electrostatic-septa wires."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf061.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF061",
      "page_number": "862",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF062",
      "title": "Parametric Study of the Beam Footprint Characteristics on the ESS Target",
      "authors": [
        "ESS",
        "Lund",
        "Sweden",
        "ISA",
        "Aarhus",
        "Denmark",
        "The beam delivery system of the ESS linac utilizes fast oscillating triangular wave dipole magnets of two transverse planes (raster magnets) to spray each long beam pulse (2.86 ms) over a rectangular cross-check pattern on the target. The characteristics of this beam footprint on the target are determined by the amplitudes of the raster magnets",
        "RMS sizes of the beam and",
        "in some case",
        "the tail of the beam profile and have to satisfy the requirements from the target for the peak density as well as the fraction outside of a given rectangular boundary. This paper presents approximate closed-form expressions for the characteristics of the beam footprint and",
        "based on the presented expressions",
        "explores the parameter space of the raster magnets and beam parameters for achieving the optimal characteristics of the beam footprint."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf062.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF062",
      "page_number": "866",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF063",
      "title": "Beam Dynamics Studies of the ESS LINAC Using a New Multicell Cavity Model",
      "authors": [
        "R. De Prisco",
        "D.C. Plostinarpresenter",
        "ESS",
        "Lund",
        "Sweden",
        "The European Spallation Source is designed to deliver 5 MW proton beam power on the target while keeping the beam induced losses below 1 W/m throughout the LINAC. This implies the need of accurate models to correctly describe the longitudinal beam dynamics within the multi-cell cavities. In all the previous error studies the cells of a multi-cell cavity were modelled as a sequence of independent gaps and the errors were applied directly on the amplitude of each cell accelerating field",
        "considered as random variable. In this paper",
        "instead",
        "we present a new detailed analysis of the effect of the error tolerances on the beam dynamics including a new model to calculate the amplitude errors of the accelerating field in the multi-cell cavities: errors are applied on the geometrical parameters of each cavity; then the accelerating field is calculated solving the Maxwell equations over all the cavity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf063.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF063",
      "page_number": "870",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF064",
      "title": "Preparation Towards the Ess Linac Ion Source and Lebt Beam Commissioning on Ess Site",
      "authors": [
        "R. Miyamoto",
        "M. Eshraqi",
        "A. Jansson",
        "E. Laface",
        "Y. Levinsen",
        "Ø. Midttun",
        "N. Milas",
        "M. Muñoz",
        "D.C. Plostinar",
        "A. Ponton",
        "E. Sargsyan",
        "L. Tchelidze",
        "ESS",
        "Lund",
        "Sweden",
        "L. Celona",
        "L. Neri",
        "INFN/LNS",
        "Catania",
        "Italy",
        "Vitrociset s.p.a",
        "Roma",
        "Italy",
        "Beam commissioning of the proton linac of the European Spallation Source begin in summer",
        "2018",
        "from the ion source (IS) and low energy beam transport (LEBT)",
        "and continues in stages until 2022",
        "when the first beam is sent to its spallation target. This paper presents the plan",
        "status",
        "and highlights of preparation works for the upcoming IS and LEBT beam commissioning."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf064.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF064",
      "page_number": "874",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF065",
      "title": "Opportunities and Challenges in Planning the Installation, Testing and Commissioning of Large Accelerator Facilities",
      "authors": [
        "D.C. Plostinar",
        "D. Bergenholtz",
        "H. Danared",
        "L. Gunnarsson",
        "M.I. Israelsson",
        "A. Jansson",
        "M. Lindroos",
        "A. Sunesson",
        "L. Tchelidze",
        "J.G. Weisend",
        "ESS",
        "Lund",
        "Sweden",
        "Delivering major accelerator facilities requires complex project preparation",
        "organisation and scheduling. Often",
        "multiple factors have to be taken into account including technical",
        "financial and political. This makes planning particularly difficult",
        "but at the same time opens opportunities for improving and optimising the project prospects. In this paper",
        "we discuss the major drivers governing the installation",
        "testing and commissioning of major accelerators in general",
        "with particular emphasis on the European Spallation Source (ESS) accelerator",
        "currently under construction in Lund",
        "Sweden."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf065.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF065",
      "page_number": "878",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF066",
      "title": "Transverse Dynamics and Software Integration of the ESS Low Energy Beam Transport",
      "authors": [
        "N. Milas",
        "K.S. Louisy",
        "D.C. Plostinarpresenter",
        "ESS",
        "Lund",
        "Sweden",
        "The first part of the ESS linac",
        "also called front-end",
        "comprising the Ion Source and the Low Energy Beam Transport (LEBT) section",
        "will be installed and commissioned in 2018. The LEBT is used to focus and correct the proton beam trajectory and clean the head and tail of the proton pulse from the flat top before entering the RFQ. During the ion source and LEBT commissioning a full beam characterization at the RFQ entrance interface is planned. It is thus important to have an application in the control room able to display quantities measured by the diagnostic devices and also to quickly run a simulation including not only centre of mass dynamics but also envelope. This paper presents the efforts in modelling the LEBT elements",
        "as accurately as possible",
        "and implementing the dynamics calculation and integration with diagnostics tools. The final result is a Java FX GUI based on the OpenXAL library."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf066.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF066",
      "page_number": "882",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF067",
      "title": "Beam Physics Analysis of the ESS RFQ Non-Conformities",
      "authors": [
        "ESS",
        "Lund",
        "Sweden",
        "During the fabrication of an RFQ",
        "deviation from the perfect geometry will occur during assembling",
        "brazing and machining the different parts. These geometrical defects will also impact the theoretical inter-vane voltage",
        "given by the beam dynamics",
        "even if tuners can correct partially the effect of the manufacturing. The combination of geometrical and voltage errors will alter the electro-magnetic field in the axis region leading to a degradation of the beam quality. The study proposes to expand the method to treat the voltage errors presented in *",
        "in which the deviation from the theoretical parameters is represented by a sum of periodic functions of z",
        "to the machining errors and to include positioning and alignment errors. The results of the error study will be presented. Then",
        "using the results of the fabrication control by metrology",
        "we will analyze the impact of the real RFQ geometry on the beam transport and compare the results will the prediction from the error study.",
        "* A. Ponton et al.",
        "\"Voltage errors studies in the ESS RFQ\"",
        "presented at the 7th Int. Particle Accelerator Conf. (IPAC'16)",
        "Busan",
        "Korea",
        "May 2016",
        "paper"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf067.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF067",
      "page_number": "886",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF068",
      "title": "Functional Integration of the RFQ in the ESS Systems",
      "authors": [
        "J.S. Schmidt",
        "E. Bargalló",
        "T. Fay",
        "G. Hulla",
        "B. Lagoguez",
        "R. Montaño",
        "E. Sargsyan",
        "S. Scolari",
        "H. Spoelstra",
        "ESS",
        "Lund",
        "Sweden",
        "A.C. Chauveau",
        "M. Desmons",
        "O. Piquet",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "Lund University",
        "Lund",
        "Sweden",
        "Vitrociset s.p.a",
        "Roma",
        "Italy",
        "The 352 MHz Radio Frequency Quadrupole (RFQ) for the European Spallation Source ERIC (ESS) will be delivered during 2018. After delivery",
        "installation and tuning of the cavity",
        "the high power RF conditioning will be performed. At this point all the different systems that are needed to condition and operate the RFQ have to be in place and operational. This paper will give an overview of the system analysis that has been performed for the RFQ. The RFQ requirements for the RF system",
        "including the RF distribution system (RFDS)",
        "the Low Level RF (LLRF) and the local RF protection system (RFLPS) will be presented. In addition",
        "the paper covers the system integration of the structure in the ESS control and vacuum systems as well as the outcome of a machine protection analysis."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf068.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF068",
      "page_number": "890",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF073",
      "title": "Simulation of Integrable Synchrotron with Space-charge and Chromatic Tune-shifts",
      "authors": [
        "J.S. Eldred",
        "A. Valishev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "We present a nonlinear rapid-cycling synchrotron designed as a high-intensity replacement of the Fermilab Booster. The design incorporates integrable optics",
        "an innovation in particle accelerator design that enables strong nonlinear focusing without generating parametric resonances. We use the Synergia space-charge tracking code to demonstrate the stability of a beam in this lattice with a space-charge tune-shift up to 0.4 and a rms momentum spread up to 0.4\\%. We demonstrate the benefit of increased lattice periodicity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf073.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF073",
      "page_number": "894",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF074",
      "title": "Preliminary Modelling of Radiation Levels at the Fermilab PIP-II Linac",
      "authors": [
        "L. Lari",
        "C.M. Baffes",
        "S.J. Dixon",
        "N.V. Mokhov",
        "I.L. Rakhno",
        "I.S. Tropin",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "F. Cerutti",
        "L.S. Esposito",
        "L. Lari",
        "CERN",
        "Geneva",
        "Switzerland",
        "PIP-II is the Fermilab's flagship project for providing powerful",
        "high-intensity proton beams to the laboratory's experiments. The heart of PIP-II is an 800-MeV superconducting linac accelerator. It will be located in a new tunnel with new service buildings and connected to the present Booster through a new transfer line. To support the design of civil engineering and mechanical integration",
        "this paper provides preliminary estimation of radiation level in the gallery at an operational beam loss limit of 0.1 W/m",
        "by means of Monte Carlo calculations with FLUKA and"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf074.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF074",
      "page_number": "898",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF075",
      "title": "Design Status of the LBNF/DUNE Beamline",
      "authors": [
        "V. Papadimitriou",
        "J.E. Anderson",
        "R. Andrews",
        "J.J. Angelo",
        "V.T. Bocean",
        "C.F. Crowley",
        "A. Deshpande",
        "N. Eddy",
        "K. E. Gollwitzer",
        "S. Hays",
        "P. Hurh",
        "J. Hylen",
        "J.A. Johnstone",
        "P.H. Kasper",
        "T.R. Kobilarcik",
        "G.E. Krafczyk",
        "N.V. Mokhov",
        "D. Pushka",
        "S.D. Reitzner",
        "P. Schlabach",
        "V.I. Sidorov",
        "M. Slabaugh",
        "S. Tariq",
        "L.R. Valerio",
        "K. Vaziri",
        "G. Velev",
        "G.L. Vogel",
        "K.E. Williams",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The Long Baseline Neutrino Facility (LBNF) will utilize a beamline located at Fermilab to provide and aim a wide band beam of neutrinos of sufficient intensity and appropriate energy toward DUNE detectors",
        "placed 4850 feet underground at SURF in South Dakota",
        "about 1",
        "300 km away. The primary proton beam (60-120 GeV) will be extracted from the MI-10 section of Fermilab's Main Injector. Neutrinos are produced after the protons hit a four-interaction length solid target and produce mesons which are subsequently focused by a set of three magnetic horns into a 194 m long helium filled decay pipe where they decay into muons and neutrinos. The parameters of the facility were determined taking into account the physics goals",
        "spatial and radiological constraints",
        "extensive simulations and the experience gained by operating the NuMI facility at Fermilab. The Beamline facility is designed for initial operation at a proton-beam power of 1.2 MW",
        "with the capability to support an upgrade to about 2.4 MW. LBNF/DUNE obtained CD-1 approval in November 2015 and CD-3a approval in September 2016. We discuss here the Beamline design status and the associated challenges."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf075.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF075",
      "page_number": "902",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF076",
      "title": "Design of PIP-II Medium Energy Beam Transport",
      "authors": [
        "A. Saini",
        "C.M. Baffes",
        "A.Z. Chen",
        "V.A. Lebedev",
        "L.R. Prost",
        "A.V. Shemyakin",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Proton Improvement Plan-II (PIP-II) is a proposed upgrade for the accelerator complex at Fermilab. The central piece of PIP-II is a superconducting radio frequency (SRF) 800 MeV linac capable of operating in both CW and pulse regimes. The PIP-II linac comprises a warm front-end that includes a H− ion source capable of delivering 15-mA",
        "30-keV DC or pulsed beam",
        "a Low Energy Beam Transport (LEBT)",
        "a 162.5 MHz",
        "CW Radio-Frequency Quadrupole (RFQ) accelerating the ions to 2.1 MeV and",
        "a 14-m Medium Energy Beam Transport (MEBT) before beam is injected into SRF part of the linac. This paper presents the PIP-II MEBT design and",
        "discusses operational features and considerations that lead to existing optics design such as bunch by bunch chopping system",
        "minimization of radiation coming to the warm front-end from the SRF linac using a concrete wall",
        "a robust vacuum protection system etc."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf076.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF076",
      "page_number": "905",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF077",
      "title": "Beam Optics Measurements in Medium Energy Beam Transport at PIP-II Injector Test Facility",
      "authors": [
        "A. Saini",
        "J.-P. Carneiro",
        "B.M. Hanna",
        "L.R. Prost",
        "A.V. Shemyakin",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "BARC",
        "Mumbai",
        "India",
        "The Proton Improvement Plan-II Injector Test (PIP2IT) is an accelerator test facility under construction at Fermilab that will provide a platform to demonstrate critical technologies and concept of the front-end of the PIP-II linear accelerator (linac). The PIP2IT warm front-end comprises a H− ion source capable of delivering 15 mA",
        "30 keV DC or pulsed beam",
        "a Low Energy Beam Transport (LEBT)",
        "a 162.5 MHz",
        "CW Radio Frequency Quadrupole (RFQ) that accelerates the beam to 2.1 MeV and",
        "a 14 m medium energy beam transport (MEBT). Presently",
        "beamline up to the MEBT has been commissioned and operates routinely at the PIP2IT facility. In this paper",
        "we discuss beam measurements performed at the MEBT to analyze beam emittance and its RMS sizes along the MEBT. In addition",
        "beam based calibration of the beamline elements using differential trajectory measurement is also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf077.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF077",
      "page_number": "909",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF078",
      "title": "Recent Results of HESR Original Stochastic Cooling Tanks at COSY",
      "authors": [
        "R. Stassen",
        "B. Breitkreutz",
        "N. Shurkhno",
        "FZJ",
        "Jülich",
        "Germany",
        "The High Energy Storage Ring (HESR) of the FAIR project at GSI Darmstadt will be very important for different scientific programs due to the modularized start version of FAIR. Stochastic cooling together with barrier bucket operation will be the key component to fulfill the requirements of the different experiments. First pickup and first kicker of the HESR stochastic cooling system have been installed into the COSY accelerator at FZJ Jülich. COSY is well suited to test the performance of the HESR stochastic cooling hardware at different energies and variable particle numbers. The novel dedicated HESR-structures were already successfully tested at the Nuclotron in Dubna for longitudinal cooling and during a beam time 2017 for transverse cooling at COSY. The results of the last stochastic cooling beam time will be presented as well as the first use of GaN based amplifiers in a stochastic cooling system. The HESR needs fast transmission-lines between PU and KI. Beside air-filled coax-lines",
        "optical hollow fiber-lines are very attractive. First results with such a hollow fiber used for the transverse signal path will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf078.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF078",
      "page_number": "913",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF079",
      "title": "Scaled Alvarez-Cavity Model Investigations for the UNILAC Upgrade",
      "authors": [
        "M. Heilmann",
        "X. Du",
        "L. Groening",
        "M. Kaiser",
        "S. Mickat",
        "M. Vossberg",
        "GSI",
        "Darmstadt",
        "Germany",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "The 1:3 scaled aluminum model of an Alvarez-type cavity with 10 gaps was used for comparison of simulation with measurement for the frequency and the electric field on axis. The scaled frequency is 325.224 MHz and an Alvarez cavity has a small frequency tuning range. With this scaled model it was possible to apply different stem configurations for each drift tube to damp parasitic modes and to increase the field stability. The new drift tubes have an optimized free-formed profile on the end plates in order to increase the shunt impedance. In special the assembly",
        "positioning and alignment of the drift tubes can be tested and the frequency change can be investigated in this respect."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf079_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf079.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf079_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF079",
      "page_number": "916",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF080",
      "title": "Final Design of the FoS Alvarez-Cavity-Section for the Upgraded UNILAC",
      "authors": [
        "M. Heilmann",
        "X. Du",
        "L. Groening",
        "M. Kaiser",
        "S. Mickat",
        "C. Mühle",
        "A. Rubin",
        "V. Srinivasan",
        "GSI",
        "Darmstadt",
        "Germany",
        "IAP",
        "Frankfurt am Main",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The final design describes the First-of-Series (FoS) Alvarez-Cavity-section of the first tank being part of the new post-stripper DTL of the UNILAC. The FoS-cavity has an input energy of 1.358 MeV/u with 11 drift tubes (including quadrupole singlets) in a total length of 1.9 m and a diameter of 2 m with an operation frequency of 108.4 MHz. The drift tubes will have a new shape profile at the end plates. The single layered quadruple singlets inside the drift tubes are pulsed with 10 Hz and will have a maximum field gradient of 51 T/m. The new drift tube design combines the new shape profile with the transverse and longitudinal installation space of the magnet. The FoS Alvarez-cavity will be part of the first section of the new Alvarez DTL. It shall be operated at nominal RF- and magnetic fields prior to procurement of the series. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf080.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF080",
      "page_number": "920",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF081",
      "title": "Measurements and Simulations of the Spill Quality of Slowly Extracted Beams from  the SIS-18 Synchrotron",
      "authors": [
        "S. Sorge",
        "P. Forck",
        "R. Singhpresenter",
        "GSI",
        "Darmstadt",
        "Germany",
        "In this contribution",
        "results of recent measurements of the spill structure of slowly extracted beams out of the GSI heavy ion synchrotron SIS-18 are presented and compared to results of simulations. Aim of the study is the determination of spill structures at several kHz which arise from ripples in the fields of the accelerator magnets due to imperfections of the magnets' power supplies. The goal of the study is to understand how the ripple is transferred from the magnets to the spill and to find possible ways for spill smoothing. For this purpose a comprehensive simulation model for slow extraction is in preparation which will be validated with beam-based measurements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf081_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf081.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf081_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF081",
      "page_number": "924",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF083",
      "title": "SIS100 Tunnel Design and Civil Construction Status",
      "authors": [
        "C. Omet",
        "J. Falenski",
        "H. Kisker",
        "K. Konradt",
        "P.J. Spillerpresenter",
        "GSI",
        "Darmstadt",
        "Germany",
        "FAIR",
        "Darmstadt",
        "Germany",
        "As the FAIR Project is proceeding",
        "building designs have been frozen and the according work packages tendered. For the future FAIR main driver accelerator",
        "SIS100",
        "the 1.1 km long accelerator tunnel \"T110\"",
        "has been planned 17 m deep under ground. In this article",
        "environmental boundary conditions",
        "the chosen layout and the current status of civil construction is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf083_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf083.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf083_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF083",
      "page_number": "927",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF084",
      "title": "The First-of-Series SIS100 Cryocatcher",
      "authors": [
        "L.H.J. Bozyk",
        "Sh. Ahmed",
        "P.J. Spiller",
        "GSI",
        "Darmstadt",
        "Germany",
        "The superconducting heavy ion synchrotron SIS100 of the FAIR-facility will be equipped with 60 cryocatcher",
        "to suppress dynamic vacuum effects. A prototype cryocatcher has been designed",
        "manufactured and underwent several tests. The results yielded in the design of the series cryocatcher. Recently",
        "the First-of-Series cryocatcher has been manufactured and tested. Results from the manufacturing process and the site acceptance tests",
        "including cryogenic test with liquid helium are presented. The FoS cryocatcher sucessfully passed all tests and the series production will be released."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf084_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf084.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf084_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF084",
      "page_number": "930",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF085",
      "title": "Status of Link Existing Facility Project for FAIR",
      "authors": [
        "J. Stadlmann",
        "C. Omet",
        "A. Schuhmann",
        "P.J. Spiller",
        "GSI",
        "Darmstadt",
        "Germany",
        "The project \"Link existing Facility\"",
        "or GaF (GSI Anbindung an FAIR)",
        "is an important subproject of the overall FAIR facility. In order to serve as injector for SIS100",
        "the main accelerator of FAIR",
        "the existing GSI synchrotron SIS18 is undergoing an upgrade program leading to about 100 times higher beam intensities. Especially the foreseen operation with 4 GeV Protons with up to 5·1012 protons per second increases the radiation protection requirements to such an extent that the existing radiation protection measures are no longer sufficient. The project consists of 78 individual measures. The four most substantial activities are the construction of a table-like structure to carry additional shielding. The creation of an opening and a first part of transfer tunnel for the beamlines towards the future FAIR campus. The preparation for the building",
        "beam dump and connection of the FAIR proton injector. The incorporation of state-of-the-art radiation- and fire-protection measures into the present facilities including the a new technical building to house technical infrastructure. We report on the project status which is foreseen to finish mid-2018."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf085_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf085.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf085_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF085",
      "page_number": "934",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF086",
      "title": "Adaption of the HSI -RFQ Rf-Properties to an Improved Beam Dynamics Layout",
      "authors": [
        "M. Vossberg",
        "L. Groening",
        "S. Mickat",
        "H. Vormann",
        "C. Xiao",
        "GSI",
        "Darmstadt",
        "Germany",
        "V. Bencini",
        "J.M. Garland",
        "J.-B. Lallement",
        "A.M. Lombardi",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [
        "The GSI accelerator facility comprising the linear accelerator UNILAC and the synchrotron SIS18 will be used in future mainly as the injector for the Facility for Anti-Proton and Ion Research (FAIR) being under construction. FAIR requires high beam brilliance and the UNILAC's RFQ electrodes must be upgraded with respect to their beam dynamics design. The new layout is currently being conducted at CERN with the aim of adjusting the electrode voltage according to the design voltage of 123 kV. CST simulations performed at GSI assure that the resonance frequency with the new electrode geometry is recuperated through corrections of the carrier rings. Simulations on the frequency dependence of the rings shapes and their impact on the voltage distribution along the RFQ are presented."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf086_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf086.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf086_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF086",
      "page_number": "938",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF087",
      "title": "A Two-Stage Splitring-RFQ for High Current Ion Beams at Low Frequencies",
      "authors": [
        "M. Baschke",
        "H. Podlech",
        "A. Schempp",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "For several accelerator projects RFQs are the first stage of acceleration. To reach high intensities a new Splitring-RFQ is investigated. Not only a high current and high beam quality/brilliance should be achieved",
        "also a good tuning flexibility and comfort for maintenance are part of the study. The RFQ will consist of two stages with 27 MHz and 54 MHz to accelerate ions with an A/q of 60 up to energies of 200 keV/u. RF simulations with CST MWS have been performed to obtain the quality factor",
        "shunt impedance and voltage distribution as well as tuning possibilities. The results and the status of the project will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf087_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf087.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf087_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF087",
      "page_number": "941",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF088",
      "title": "Final factory-side Measurements of the Next SC CH-Cavities for the HELIAC-Project",
      "authors": [
        "M. Basten",
        "M. Busch",
        "H. Podlech",
        "M. Schwarz",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "K. Aulenbacher",
        "W.A. Barth",
        "V. Gettmann",
        "T. Kürzeder",
        "M. Miski-Oglu",
        "HIM",
        "Mainz",
        "Germany",
        "W.A. Barth",
        "F.D. Dziuba",
        "M. Heilmann",
        "S. Yaramyshev",
        "GSI",
        "Darmstadt",
        "Germany",
        "The upcoming FAIR project (Facility for Antiproton and Ion Research) at GSI will use the existing UNILAC (UNIversal Linear Accelerator) as an injector to provide high intensity heavy ion beams at low repetition rates. As a consequence a new superconducting (sc) continous wave (cw) high intensity heavy ion Linac is required to provide ion beams above the coulomb barrier to keep the Super Heavy Element (SHE) physics program at GSI competitive on an international level. The fundamental Linac design comprises a high performance ion source",
        "the High Charge State Injector (HLI) upgraded for cw-operation and a matching line (1.4 MeV/u) followed by a sc Drift Tube Linac (DTL). Four cryo modules each equipped with three Crossbar-H-mode (CH) structures provide for acceleration up to 7.3 MeV/u. The first section of this ambitious accelerator project has been successfully commissioned and tested with heavy ion beam from the HLI in 2017. It comprises two sc 9.3 T solenoids and a sc 217 MHz CH-cavity with 15 equidistant gaps as a demonstrator. The construction of the next two sc 217 MHz 8 gap CH-cavities is nearly finished and final factory-side measurements will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf088_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf088.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf088_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF088",
      "page_number": "943",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF089",
      "title": "Initial Measurements on a New 108 MHz 4-Rod CW RFQ Prototype for the HLI at GSI",
      "authors": [
        "D. Koser",
        "K. Kümpel",
        "H. Podlech",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "GSI",
        "Darmstadt",
        "Germany",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "The High Charge State Injector (HLI) at the GSI Helmholtz Centre for Heavy Ion Research in Darmstadt",
        "Germany",
        "is one of the two injector linacs for the Universal Linear Accelerator (UNILAC) and is also planned to serve as dedicated injector for a proposed superconducting CW linac for heavy element research. Within the scope of an intended CW upgrade of the HLI front end",
        "a replacement for the existing 4-rod RFQ is desirable since its stable operation and performance is severely impeded by mechanical vibrations of the electrodes and a high thermal sensitivity*. With the aim of suppressing mechanical vibrations and providing efficient cooling considering high power CW operation",
        "a completely new and improved 4-rod design was developed** with a focus on structural mechanical simulations using ANSYS. In order to validate the simulated RF performance",
        "thermal behavior and structural mechanical characteristics",
        "a 6-stem prototype was manufactured***. Initial low power RF measurements and basic piezo actuated mechanical investigations were done and the anticipated properties could be confirmed prior to planned high power RF tests and further mechanical vibration studies.",
        "* D. Koser et al."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf089_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf089.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf089_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF089",
      "page_number": "946",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF090",
      "title": "Measurements of the MYRRHA-RFQ at the IAP Frankfurt",
      "authors": [
        "K. Kümpel",
        "D. Koser",
        "S. Lamprecht",
        "N.F. Petry",
        "H. Podlech",
        "A. Schempp",
        "D. Strecker",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "NTG Neue Technologien GmbH & Co KG",
        "Gelnhausen",
        "Germany",
        "GSI",
        "Darmstadt",
        "Germany",
        "The MYRRHA (Multi-purpose hYbrid Research Reactor for High-tech Applications) Project is a planned accelerator driven system (ADS) which aims to demonstrate the feasibility of large scale transmutation. The first RF structure of the 600 MeV MYRRHA Linac will be a 176.1 MHz 4-Rod RFQ that will accelerate up to 4 mA protons in cw operation from 30 keV up to 1.5 MeV. The voltage along the approximately 4 m long electrodes has been chosen to 44 kV which limits the RF losses to about 25 kW/m. During the design of the structure a new method of dipole compensation has been applied. This paper describes the status of the RFQ and shows the results of the measurements done at IAP Frankfurt such as dipole and flatness measurement",
        "vacuum tests and power tests up to 11 kW."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tupaf090_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tupaf090.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tupaf090_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUPAF090",
      "page_number": "949",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 80,
  "scrape_time": "2025-10-10 19:25:38"
}