{
  "session_info": {
    "id": "WEYBA",
    "name": "WEYBA - Wednesday Parallel Session 3",
    "url": "https://proceedings.jacow.org/napac2019/html/weyba.htm"
  },
  "papers": [
    {
      "paper_id": "WEYBA1",
      "title": "AWAKE, Proton Bunch Self-Modulation and Electron Acceleration",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [],
      "abstract": "AWAKE has demonstrated the controlled self-modulation of a high energy proton bunch. Basic beam plasma interaction physics was observed and characterized. This led to the driving of large amplitude wakefields suitable for external electron injection and acceleration. Electrons were accelerated to 2GeV. The concept and the experiment will be introduced. Detailed experimental results will be presented. Possible future experiments and applications will be outlined.",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weyba1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weyba1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weyba1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEYBA1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEYBA2",
      "title": "Petawatt Laser Guiding and Electron Beam Acceleration to 8 GeV in a Laser-Heated Capillary Discharge Waveguide",
      "authors": [
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Laser plasma accelerators are able to generate large acceleration gradients",
        "tens to hundreds of GV/m",
        "several orders of magnitude larger than conventional radio frequency technology. To achieve high beam energies",
        "preformed plasma waveguides can be used to mitigate laser diffraction of focused laser pulses",
        "increasing the acceleration length and the energy gain for a given laser power. Here we report on guiding of relativistically intense laser pulses with PW peak power over 20 diffraction lengths by increasing the focusing strength of a capillary discharge waveguide using laser inverse Bremsstrahlung heating. This allowed production of electron beams with quasi-monoenergetic peaks in energy up to 7.8 GeV",
        "* almost double what was previously demonstrated.**",
        "* A. J. Gonsalves",
        "et al.",
        "Phys. Rev. Lett. Phys. Rev. Lett. 122",
        "084801 (2018). ** W. P. Leemans",
        "A. J. Gonsalves",
        "et al.",
        "Phys. Rev. Lett. 113",
        "245002 (2014)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weyba2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weyba2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weyba2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEYBA2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEYBA3",
      "title": "Tolerances for Plasma Wakefield Acceleration Drivers",
      "authors": [
        "G.R. White",
        "T.O. Raubenheimer",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Transverse jitter tolerances are considered for beam-driven plasma accelerators. A simple model for jitter transfer from the drive to witness beam was developed and con-crete examples were studied for: high-brightness witness bunch injectors; high-energy boosters for FEL’s; and future Linear Colliders. For the LC application",
        "we con-sider a superconducting Linac designed to minimize the jitter conditions of the drive beam. We use a start-to-end tracking model to simulate expected jitter performance. The tolerances on each subsystem of the driver Linac are found to be very tight",
        "especially for magnet vibration which must be controlled at the sub-nm level."
      ],
      "institutions": [],
      "abstract": "Work supported by the Department of Energy under Contract Number: DE-AC02-76SF00515.",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weyba3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weyba3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weyba3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEYBA3",
      "page_number": "614",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYBA4",
      "title": "Beam Induced Ionization Injection of Shaped Electron Bunches",
      "authors": [
        "N. Vafaei-Najafabadi",
        "L.D. Amorim",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "Particle-driven Plasma Wakefield Accelerators (PWFAs) are promising candidates for future free electron laser and collider applications. In PWFAs",
        "energy is transferred from a relativistic drive beam to a trailing bunch in a plasma wake. One of the challenges of PWFAs is reducing energy spread of the beam from typically few percent to the required 0.1% range. This can be accomplished by generating a trailing bunch with a trapezoidal density profile",
        "which will allow the PWFA to operate in the beam-loading regime",
        "therefore circumventing the energy-spread growth of the trailing beam during acceleration. In this work we show how the Beam Induced Ionization Injection (BIII) technique can produce a trailing bunch of electrons with a trapezoidal shape suitable for beam-loading. In BIII",
        "the trailing beam is created by ionization injection of an impurity due to the increased field of the beam during betatron oscillations. By tailoring the longitudinal profile of the impurity",
        "we can shape the injected trailing electron bunch to reach the beam-loading regime. We will present results of numerical simulations done to model BIII shaped beams with the Particle In Cell code OSIRIS*.",
        "* R. A. Fonseca et al.",
        "Lect. Notes Comput. Sci. 2331",
        "342 (2002)."
      ],
      "institutions": [
        "Funding: Simulations were conducted on NERSC facility, operated under Contract No. DE-AC02-5CH11231, and of SEAWULF at Stony Brook University."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weyba4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weyba4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weyba4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEYBA4",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEYBA5",
      "title": "Diamond Field Emitter Array Cathode Experimental Tests in RF Gun",
      "authors": [
        "K.E. Nichols",
        "H.L. Andrews",
        "D. Kim",
        "E.I. Simakov",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Euclid Beamlabs LLC",
        "Bolingbrook",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "M.E. Conde",
        "D.S. Doran",
        "G. Ha",
        "W. Liu",
        "J.F. Power",
        "J.H. Shao",
        "C. Whiteford",
        "E.E. Wisniewski",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Diamond Field Emitter Array (DFEA) cathodes are arbitrarily shaped arrays of sharp (~50 nm tip size) nano-diamond pyramids with bases on the order of 3 to 25 microns and pitches 5 microns and greater. These cathodes have demonstrated very high bunch charge in tests at the L-band RF gun at the Argonne National Laboratory (ANL) Advanced Cathode Test Stand (ACTS). Intrinsically shaped electron beams have a variety of applications",
        "but primarily to achieve high transformer ratios for Dielectric Wakefield Accelerators (DWA) when used in conjunction with Emittance Exchange (EEX) systems. Here we will present results from a number of recent cathode tests including bunch charge and YAG images. We have demonstrated shaped beam transport down the 2.54-meter beamline. In addition we will present emission simulations that demonstrate shielding effects for this geometry."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weyba5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weyba5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weyba5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEYBA5",
      "page_number": "618",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYBA6",
      "title": "A High-Precision Emission Computational Model for Ultracold Electron Sources",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weyba6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weyba6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weyba6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEYBA6",
      "page_number": "622",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:53:03"
}