{
  "session_info": {
    "id": "TUOMMH",
    "name": "TUOMMH - Tu1",
    "url": "https://proceedings.jacow.org/ECRIS2014/html/tuommh.htm"
  },
  "papers": [
    {
      "paper_id": "TUOMMH01",
      "title": "Improvement of Beam Intensities for Ion Beams with Charge-to-Mass Ratio of 1/3 with Two-Frequency Heating Technique",
      "authors": [
        "NIRS",
        "Chiba-shi",
        "Japan",
        "T.F. Fujita",
        "M. Muramatsu",
        "National Institute of Radiological Sciences",
        "Chiba",
        "Japan",
        "K. Fukushima",
        "N. Sasaki",
        "K. Takahashi",
        "W. Takasugi",
        "AEC",
        "Chiba",
        "Japan",
        "Osaka University",
        "Graduate School of Engineering",
        "Osaka",
        "Japan",
        "Facilities of heavy ion radiotherapy use carbon ions due to its better biological dose distributions. The necessary energy is over 400MeV/u. A typical accelerator system consisits of a synchrotron and an injector. ECR ion sources have been developed and utilized to produce C4+ ions. On the other hand",
        "in order to study basic biological researches with a such facility",
        "there are occasionally requirements to produce other ion species like Ar or Fe. Since the injector design is fixed for the acceleration of ions with a charge-to-mass ratio of about 1/3",
        "the ion source must produce Ar13+ and Fe19+. As a method to improve highly-charged ion production",
        "the technique to feed multiple microwaves with different frequencies is well-known. Our group studied the improvements when the two frequencies are close together each with a power of more than 1kW using the 18GHz NIRS-HEC ECR ion source installed in the Heavy Ion Medical Accelerator in Chiba (HIMAC. Fe and Ni are interesting for a risk study in space environment. We combined the MIVOC method and the two-frequency heating technique for the production of Fe and Ni. The recent test results will be reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/tuommh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/tuommh01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/tuommh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-TUOMMH01",
      "page_number": "83",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOMMH02",
      "title": "ECR Ion Source Developments at INFN-LNS",
      "authors": [
        "L. Celona",
        "G. Castro",
        "S. Gammino",
        "D. Mascali",
        "L. Neri",
        "G. Torrisi",
        "INFN/LNS",
        "Catania",
        "Italy",
        "CNAO Foundation",
        "Milan",
        "Italy",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "Universitá Mediterranea di Reggio Calabria",
        "Reggio Calabria",
        "Italy",
        "At INFN-LNS",
        "ECRIS development during the ‘90s boosted the K-800 Cyclotron performances: SERSE and CAESAR have then well supported Nuclear Physics research. For the new needs of the laboratory",
        "further improvements are required and here described. Activities recently started aimed to the production of multicharged ion beams and to the production of intense light ion beams. Technological developments led the AISHa source design",
        "now under construction",
        "in order to adapt a high performance ECR ion source to hospital facilities needing multiply charged ion production with high reliability and brightness",
        "easy operations and maintenance. The realization of the 75kV-70mA proton source",
        "called PS-ESS",
        "and of its LEBT for the forthcoming European Spallation Source in Sweden is one of the major engagements of the INFN-LNS. Other activities are ongoing on high charge state and high intensity beam production: a major update is going to be finalized on SERSE cryogenic system; at Vancouver",
        "the VIS source is used for producing multi-mA beams of H2+ for a high-current cyclotron; a new flexible plasma trap is under test for fundamental research about innovative plasma heating methods."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/tuommh02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/tuommh02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/tuommh02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-TUOMMH02",
      "page_number": "87",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOMMH03",
      "title": "Status Report of SECRAL II Ion Source Development",
      "authors": [
        "L.T. Sun",
        "M.Z. Guan",
        "Q. Hu",
        "W. Lu",
        "L.Z. Ma",
        "E.M. Mei",
        "D.S. Ni",
        "B.M. Wu",
        "W. Wu",
        "T.J. Yang",
        "Y. Yang",
        "W.H. Zhang",
        "X.Z. Zhang",
        "B. Zhao",
        "H.W. Zhao",
        "S.J. Zheng",
        "L. Zhu",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "University of Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "For a new injector linac project launched at IMP",
        "a superconducting ECR ion source SECRAL II is now under construction. This ion source is a duplicated one of SECRAL I which is operated routinely for HIRFL facility at the frequency of 18-24 GHz. SECRAL II is designed to be operated at the frequency of 28 GHz",
        "which needs slightly higher radial field at the plasma chamber wall. The fabrication of the cold mass was started at early 2013",
        "and it has been completed in May 2014. The engineering design of the whole superconducting magnet has also been finished and ready for fabrication. After a brief introduction of the recent results obtained with SECRAL I ion source",
        "this paper will present the cold mass test results and the cryogenic system design of SECRAL II magnet. The test bench design will be also discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/tuommh03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/tuommh03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/tuommh03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-TUOMMH03",
      "page_number": "94",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOMMH04",
      "title": "An ECR Ion Source with Integrated Sputter Magnetron for Metal Ion Beam Generation and Large Area Implantation",
      "authors": [
        "Dreebit GmbH",
        "Großröhrsdorf",
        "Germany",
        "U. Hartung",
        "T. Kopte",
        "T. Weichsel",
        "Fraunhofer FEP",
        "Dresden",
        "Germany",
        "A. Silze",
        "G.H. Zschornack",
        "DREEBIT GmbH",
        "Dresden",
        "Germany",
        "High current metal ion sources are utilized for surface irradiation and implantation in semiconductor",
        "medical or optical industry as well as in photovoltaics. Therefore",
        "a new ECR ion source (ECRIS) combined with an inverted cylindrical sputter magnetron device for metal atom load of the plasma has been developed to produce high currents of metal ion beams. For the generation of mA currents of metallic ion beams the particle load of the plasma should be in the order of 1018 particles per second. Double Langmuir probe and optical emission spectroscopy measurements are accomplished to determine the electron density in the plasma. The ion source is part of a new implantation platform which is suitable for the irradiation of a target width of 200 mm to produce homogeneous implantation profiles over the entire surface. This facility is including a dipole magnet to separate the produced metal ions from the process gas ions. Furthermore",
        "an ion scan optic followed by an additional dipole magnet is developed to realize a pseudo broad beam scanning unit for large area implantation. In the presentation we describe the ion beam facility and report on first ion extraction experiments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/tuommh04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/tuommh04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/tuommh04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-TUOMMH04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUOMMH05",
      "title": "HIISI, New 18 GHz ECRIS for the JYFL Accelerator Laboratory",
      "authors": [
        "H. A. Koivisto",
        "P. M.T. Heikkinen",
        "T. Kalvas",
        "K. Ranttila",
        "O.A. Tarvainen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "I. Izotov",
        "V. Skalyga",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "NSCL",
        "East Lansing",
        "Michigan",
        "USA",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "LBNL",
        "Berkeley",
        "California",
        "USA"
      ],
      "institutions": [
        "At the end of 2013 the Academy of Finland granted an infrastructure funding for the JYFL Accelerator Laboratory in order to increase beam intensities for the international user community. The primary objective is to construct a new high performance ECR ion source, HIISI (Heavy Ion Ion Source Injector), for the K130 cyclotron. Using room temperature magnets the HIISI has been designed to produce about the same magnetic field configuration as the superconducting ECRIS SUSI at NSCL/MSU for 18 GHz operation. An innovative structure will be used to maximize the radial confinement and safety of the permanent magnets. The sextupole magnets are separated and insulated from the plasma chamber providing two advantages: 1) the permanent magnets can be cooled down to -20˚C, which increases especially their coercivity and 2) makes it possible to reach higher radial field at the inner surface of plasma chamber. Comprehensive simulations were performed with microwave power up to 6 kW to analyse and address all the heat loads and temperature distribution on the permanent magnet. In this article the magnetic field design and detailed innovative scheme for sextupole magnet will be presented."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/tuommh05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/tuommh05.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/tuommh05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-TUOMMH05",
      "page_number": "99",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-10 17:28:37"
}