{
  "session_info": {
    "id": "WEPAF",
    "name": "WEPAF - MC6 Poster Session",
    "url": "https://proceedings.jacow.org/ipac2018/html/wepaf.htm"
  },
  "papers": [
    {
      "paper_id": "WEPAF001",
      "title": "A Diagnostic Test Bench for the LIGHT Accelerator",
      "authors": [
        "A. Jeff",
        "A. Benot-Morell",
        "M. Caldara",
        "P. Nadig",
        "A.D.A.M. SA",
        "Meyrin",
        "Switzerland",
        "The LIGHT accelerator is the first compact Linac that will deliver proton beams up to 230 MeV for cancer treatment. The accelerator is only 24m long and is being built to be modular and capable of changing proton beam energy and intensity pulse-to-pulse at up to 200Hz. The LIGHT prototype is currently being commissioned by AVO / ADAM at CERN",
        "while the first full installation is foreseen in 2019. Here we present the design and implementation of a moveable diagnostic test bench which is used to measure a full set of beam properties at each commissioning step. Parameters measured include beam current",
        "pulse length",
        "energy",
        "position",
        "transverse profile and emittance. The compact instruments",
        "the electronics and the controls that equip the test bench are the same as those who will be permanently installed along the accelerator after the commissioning. The first results obtained with the test bench for beams up to 16 MeV are shown here. We demonstrate that the chosen instrumentation achieves a very high sensitivity",
        "dynamic range",
        "reliability and immunity to EM noise. Procedures for on-line calibration of the instruments are also discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf001.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF003",
      "title": "Beamline Architect",
      "authors": [
        "J.D. Kunz",
        "C.M. Conrad",
        "L.M. Romero",
        "Anderson University",
        "Anderson",
        "USA",
        "Beamline Architect is a new particle accelerator simulation tool. Currently",
        "two of the most widely used tools in this field are G4beamline and COSY Infinity. While these codes are fast and quite accurate",
        "sometimes their interfaces can be time-consuming for students to learn",
        "particularly undergraduate students or students whose primary field is not accelerator physics. Without Beamline Architect",
        "each code has its own high-level language that must be manually written into a file and then executed on the command line. Moreover",
        "sometimes the use of both simulation tools is warranted in order to check for consistency between the codes. Writing the codes by hand or translating between software can sometimes be cumbersome",
        "even for experts. Furthermore",
        "knowledge of an additional language",
        "such as Python",
        "is required in order to analyze the outputs of the codes (which may be in different formats from one another). Beamline Architect is a tool that provides a graphical user interface to G4beamline and COSY Infinity. This lets the user build a particle accelerator channel in 3D with or without using code. The channel may then be saved",
        "exported",
        "translated",
        "or run. Any output data will be plotted in Beamline Architect using Python",
        "since it is both flexible aesthetically and quite standard in the particle accelerator community. For undergraduate and non-accelerator students",
        "Beamline Architect allows a hands-on experience with accelerator simulations. Some applications for these students include health physics radiation dosimetry problems",
        "medical imaging mechanics",
        "security scanner simulations",
        "and (of course) accelerator channel design for particle physics experiments. For experts",
        "Beamline Architect provides visual confirmation of the channel and a faster",
        "more consistent way of cross-referencing results between the codes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf003.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF005",
      "title": "A Fast Beam Interlock System for the Advanced Photon Source Particle Accumulator Ring",
      "authors": [
        "J.C. Dooling",
        "M. Borland",
        "K.C. Harkay",
        "R.T. Keane",
        "B.J. Micklich",
        "C. Yao",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "A fast beam interlock system for the Advanced Photon Source (APS) Particle Accumulator Ring (PAR) based on the detection of Cerenkov light is proposed for high-charge operations associated with the APS Upgrade (APS-U). Light is generated from lost electrons passing through high-purity",
        "fused-silica fiber optic cable. The cable acts as both radiator and light pipe to a Pb-shielded photomultiplier tube. Results from a prototype installation along the PAR south wall have shown excellent sensitivity",
        "linearity",
        "and reproducibility after 10",
        "000 hours of operation to date with little change in the optical transmission of the fiber. High sensitivity allows more accurate measurement of low-level loss than possible with current monitors. The radiator and detector provide a much faster response than the installed gamma or neutron detectors. A faster",
        "more accurate response to electron loss will be important as we run with higher charge and consider operating at increased energy for APS-U. Initial calibration measurements of the prototype system with radiation monitors for various loss scenarios are discussed. Comparison of the scenarios with simulations are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf005.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF006",
      "title": "Fast Photodetector Bunch Duration Monitor for the Advanced Photon Source Particle Accumulator Ring",
      "authors": [
        "J.C. Dooling",
        "J.R. Calvey",
        "K.C. Harkay",
        "B.X. Yang",
        "C. Yao",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "A fast photodetector is used to monitor the bunch duration in the Advanced Photon Source (APS) Particle Accumulator Ring (PAR). The Bunch Duration Monitor (BDM) diagnostic provides an accurate measure of the PAR bunch length. PAR BDM data show good agreement with streak camera measurements. The BDM is based on the metal-semiconductor-metal (MSM) photodetector Hamamatsu G4176-03 MSM with specified rise and fall times of 30 ps. The BDM has sufficient frequency response to resolve the PAR bunch near extraction where",
        "under low-charge conditions",
        "minimum rms pulse durations of 200-300 ps are observed. Beam from the PAR is injected into the Booster; for efficient capture",
        "injected rms bunch duration from the PAR must be less than 600 ps. The MSM detector exhibits a ringing response to fast input signals. To overcome this",
        "the BDM output is de-convolved with the impulse response function of the detector-amplifier circuit. Turn-by-turn bunch duration data is presented versus charge and time in the PAR cycle. Charge calibration is used to determine fit parameters for bunch duration measurements in peak-detection mode. Observations relevant to APS Upgrade high-charge studies are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf006.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF007",
      "title": "A Scheme for Asynchronous Operation of the APS-U Booster Synchrotron",
      "authors": [
        "U. Wienands",
        "T.G. Berenc",
        "T. Fors",
        "F. Lenkszus",
        "N. Serenopresenter",
        "G.J. Waldschmidt",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The APS-U 6-GeV MBA storage ring will have 42 pm beam emittance and relatively tight acceptance. This requires limiting the beam emittance out of the Booster synchrotron which is achieved by operating the Booster off-momentum",
        "thus manipulating the damping partitions. However",
        "the much higher charge for the APS-U strongly favors injecting on momentum into the Booster for maximum acceptance. An rf-frequency ramping scheme is proposed to allow injecting on momentum and then moving the beam off momentum. The ramp is adjusted from cycle to cycle to vary the total time taken by the beam from injection to extraction",
        "thus aligning the Booster bunch with any chosen MBA storage ring bucket. The two rf systems will not be locked at any time of the cycle. The proposed scheme is compatible with the existing synchronization of the APS injector cycle to the 60-Hz line voltage which induces a variation in the start time of the acceleration cycle. The scheme removes the need to realign the Booster ring for total path length while optimizing its operation for high charge acceleration. A ferrite tuner is being considered for dynamic tuning of the rf cavities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf007.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF009",
      "title": "Optimising Response Matrix Measurements for LOCO Analysis",
      "authors": [
        "AS - ANSTO",
        "Clayton",
        "Australia",
        "The Linear Optics from Closed Orbit (LOCO) method is a common tool for determining storage ring lattice functions and requires a measured BPM to Corrector response matrix. For very large rings with many correctors",
        "such measurements can be time consuming. The following study investigates how the number of correctors and the signal-to-noise ratio (SNR) affects the LOCO analysis results. For the Australian Synchrotron",
        "the results show that four distributed correctors per plane with a SNR of >1000 is sufficient to fit the betatron functions to an accuracy of less than 0.2%."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf009.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF010",
      "title": "Fast Glitch Detection of Coupled Bunch Instabilities and Orbit Motions",
      "authors": [
        "W.X. Cheng",
        "B. Bacha",
        "K. Ha",
        "Y. Li",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "During high current operation at NSLS-II storage ring",
        "vertical beam size spikes have been noticed. The spikes are believed due to ion instability associates with vacuum activities localized in the ring. A new tool has been developed using gated BPM turn-by-turn (TBT) data to detect beam centroid glitches. When one turn orbit deviates outside the predefined window",
        "a global event will be generated. This allows synchronized data acquisition of TBT beam positions around the ring. Bunch by bunch data is acquired at the same time to analyze the possible coupled bunch instabilities (CBI). Besides CBI mainly due to ion bursts",
        "fast orbit glitches have been captured with the new tool. Sources of the glitches can be identified."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF011",
      "title": "Developments of Bunch by Bunch Feedback System at NSLS-II Storage Ring",
      "authors": [
        "W.X. Cheng",
        "B. Bacha",
        "Y. Li",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Dimtel",
        "San Jose",
        "USA",
        "Transverse bunch-by-bunch (BxB) feedback system has been constructed and in operation since the very beginning of NSLS-II storage ring commissioning. As the total beam current continues increasing in the past years",
        "the system has been operating stable and reliable. Advanced BxB diagnostic functions have been developed using the system. Continuous tune measurement is realized with a diagnostic single bunch. Coupled bunch instability growth rate is able to be measured with the transient excitation. The BxB feedback system is also capable to excite a small fraction of total bunches for lattice measurement during high current operations. We present the most recent developments and operation experience on the BxB feedback system at NSLS-II."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf011.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF012",
      "title": "Improvements of NSLS-II X-ray Diagnostic Beamlines",
      "authors": [
        "W.X. Cheng",
        "B. Bacha",
        "B.N. Kosciuk",
        "D. Padrazo Jr",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "There are two X-ray diagnostic beamlines (XDB) developed at NSLS-II storage ring to measure emittance",
        "energy spread",
        "and other machine parameters. The first beamline utilizes a soft bending magnet radiation has been in operation since 2014. The tungsten pinhole originally located in the air had corrosion issue. The beamline has been improved by extending the vacuum to the imaging system. The second X-ray pinhole beamline using three-pole wiggler (TPW) radiation has been constructed and commissioned recently. Energy spread is able to be precisely measured due to large dispersion at the source point. A gated camera is equipped with the new beamline to acquire profiles within one turn. Recent operation experience and beam measurements will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf012.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF013",
      "title": "Database for the Management of NSLS-II Active Interlock System",
      "authors": [
        "J. Choi",
        "R.P. Fliller",
        "K. Ha",
        "Y. Tian",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "NSLS-II is operating the active interlock (AI) system to protect the machine components from the synchrotron radiation from the accidentally mis-steered electron beam. For the systematic management",
        "a relational database is dedicated to the AI system and working as the data provider as well as the archiver. The paper shows how the database is structured and used for the AI system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf013.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF014",
      "title": "Commissioning the Superconducting Magnetic Inflector System for the Muon g-2 Experiment",
      "authors": [
        "CENPA",
        "Seattle",
        "Washington",
        "USA",
        "K.E. Badgley",
        "H. Nguyen",
        "D. Stratakis",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "UKY",
        "Kentucky",
        "USA",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "The Fermilab muon g-2 experiment aims to measure the muon anomalous magnetic moment with a precision of 140 ppb - a fourfold improvement over the 540 ppb precision obtained in the BNL muon g-2 experiment. Both of these high-precision experiments require an extremely uniform magnetic field in the muon storage ring. A superconducting magnetic inflector system is used to inject beam into the storage ring as close as possible to the design orbit while minimizing disturbances to the storage-region magnetic field. The Fermilab experiment is currently in its first data-taking run",
        "where the Fermilab inflector system is the refurbished BNL inflector system. This discussion reviews the Fermilab inflector system refurbishment and commissioning."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf014.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF015",
      "title": "Commissioning the Muon g-2 Experiment Electrostatic Quadrupole System",
      "authors": [
        "J.D. Crnkovic",
        "V. Tishchenko",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "K.E. Badgley",
        "H. Nguyen",
        "E. Ramberg",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "E. Barlas Yucel",
        "M. Yucel",
        "Istanbul Technical University",
        "Maslak",
        "Istanbul",
        "Turkey",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "J.L. Holzbauer",
        "W. Wu",
        "UMiss",
        "University",
        "Mississippi",
        "USA",
        "APP",
        "Freeville",
        "New York",
        "USA",
        "Sanders Pulsed Power LLC",
        "Batavia",
        "Illinois",
        "USA",
        "BUphy",
        "Boston",
        "Massachusetts",
        "USA",
        "The Fermilab Muon g-2 experiment aims to measure the muon anomaly with a precision of 140 parts-per-billion (ppb) - a fourfold improvement over the 540 ppb precision obtained by the BNL Muon g-2 experiment. These high precision experiments both require a very uniform muon storage ring magnetic field that precludes the use of vertical-focusing magnetic quadrupoles. The Fermilab Electrostatic Quadrupole System (EQS) is the refurbished and upgraded BNL EQS",
        "where this overview describes the Fermilab EQS and its recent operations."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf015.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF016",
      "title": "Application of Quad-Scan Measurement Techniques to Muon Beams in the Muon g-2 Experiment",
      "authors": [
        "Edinburgh University",
        "Edinburgh",
        "United Kingdom",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "B.E. Drendel",
        "D. Stratakis",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "CENPA",
        "Seattle",
        "Washington",
        "USA",
        "Determination of the properties of a beam during transport is a vital process for most accelerator-related experiments; for example Fermilab's Muon g-2 experiment requires large numbers of muons to be stored in a storage ring of 7 meter radius",
        "and the transmission fraction has been shown to depend strongly on the properties of the beam",
        "specifically the Twiss parameters. The current equipment in the muon campus beamlines allows only measurement of beam profiles which limits how well propagation can be predicted",
        "however by using the well-studied quad-scan technique it is possible to obtain all of the Twiss parameters at a point using these profiles. Experimental quad-scans of muon beams have not yet been reported",
        "this paper introduces the quad-scan technique and then goes on to discuss the analysis of one such experiment and the results obtained",
        "showing that such a technique is applicable in the muon g-2 experiment to obtain the Twiss parameters without requiring installation of new equipment."
      ],
      "institutions": [],
      "abstract": "N.S. Froemmingpresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf016.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF017",
      "title": "Correction of ID-Induced Transverse Linear Coupling at NSLS-II",
      "authors": [
        "Y. Hidaka",
        "Y. Li",
        "T.V. Shaftan",
        "T. Tanabe",
        "Y. Tian",
        "G.M. Wang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Sizeable lifetime jumps have been observed sporadically since March 2016 at NSLS-II. These jumps were found to coincide with insertion device (ID) gap motions. Particularly",
        "one of the in-vacuum undulators (IVUs) at Cell 17 was discovered to have large localized skew quadrupole component variation with gap. To allow the machine to operate stably in the low-emittance mode",
        "a global coupling feedforward system has been recently implemented and successfully deployed. After installation of a new additional skew quadrupole",
        "coupling compensation of this ID is now performed by a local coupling feedforward system. Furthermore",
        "the maximum gap limit of all the existing IVUs has been decreased from 40 mm to 25 mm to limit the skew component variation during user operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf017.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF018",
      "title": "Proposed BPM-Based Bunch Crabbing Angle Monitor",
      "authors": [
        "P. Thieberger",
        "M.G. Mintypresenter",
        "C. Montag",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A tilted bunch traversing a button beam profile monitor will produce signals on opposite pickup electrodes that will have different degrees of distortion depending on the tilt angle. In particular",
        "the zero-crossing time difference between the two signals will be approximately proportional to the tilt angle. We perform simulations to study this effect as a possible diagnostic tool for measuring the crabbing angles in a future electron-ion collider."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf018.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF019",
      "title": "Fast Readout Algorithm for Cylindrical Beam Position Monitors Providing Good Accuracy for Particle Bunches with Large Offsets",
      "authors": [
        "P. Thieberger",
        "D.M. Gassner",
        "R.L. Hulsart",
        "R.J. Michnoff",
        "T.A. Miller",
        "M.G. Mintypresenter",
        "Z. Sorrell",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "A simple",
        "analytically correct algorithm is developed for calculating 'pencil' beam coordinates using the signals from an ideal cylindrical beam position monitor (BPM) with four pickup electrodes (PUEs) of infinitesimal widths. The algorithm is then applied to simulations of realistic BPMs with finite width PUEs. Surprisingly small deviations are found. Simple empirically determined correction terms reduce the deviations even further. Finally",
        "the algorithm is used to study the impact of beam-size upon the precision of BPMs in the non-linear region. As an example of the data acquisition speed advantage",
        "a FPGA-based BPM readout implementation of the new algorithm has been developed and characterized"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf019.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF022",
      "title": "Application of Machine Learning to Minimize Long Term Drifts in the NSLS-II Linac",
      "authors": [
        "R.P. Fliller",
        "C. Gardner",
        "P. Marino",
        "R.S. Rainer",
        "M. Santana",
        "G.J. Weiner",
        "X. Yangpresenter",
        "E. Zeitler",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Machine Learning has proven itself as a useful technique in a variety of applications from image recognition to playing Go. Artificial Neural Networks have certain advantages when used as a feedforward system",
        "such as the predicted correction relies on a model built from data. This allows for the Artificial Neural Network to compensate for effects that are difficult to model such as low level RF adjustments to compensate for long term drifts. The NSLS-II linac suffers from long terms drifts from a number of sources including thermal drifts and klystron gain variations. These drifts have an effect on the injection efficiency into the booster",
        "and if left unchecked",
        "portions of the bunch train may not be injected into the booster",
        "and the storage ring bunch pattern will ultimately suffer. In this paper",
        "we discuss the application of Artificial Neural Networks to compensate for long term drifts in the NSLS-II linear accelerator. The Artificial Neural Network is implemented in python allowing for rapid development of the network. We discuss the design and training of the network",
        "along with results of using the network in operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf022.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF024",
      "title": "Turn-by-Turn Position Measurements at CNAO with the Libera Spark HR Prototype",
      "authors": [
        "M. Cargnelutti",
        "M. Žnidarčič",
        "I-Tech",
        "Solkan",
        "Slovenia",
        "G.M.A. Calvi",
        "A. Parravicini",
        "E. Rojatti",
        "C. Viviani",
        "CNAO Foundation",
        "Milan",
        "Italy",
        "CNAO in Pavia is one of the first centers for hadrontherapy in Europe",
        "treating patients since 2011. The center is an international reference for a whole new concept of machines being constructed for this purpose. The synchrotron BPM electronics is based on analog boards that compute the ratio between difference and sum signals from the shoebox pickup",
        "later acquired by digital cards. Although the system operates reliably",
        "it just calculates the position with 1kHz rate",
        "while the revolution frequency ranges from 0.5 to 3 MHz. To extend the measurement possibilities for these new hadron synchrotrons",
        "Instrumentation Technologies is developing a data acquisition system capable of acquiring the pickup signals with 125MSps ADCs and calculating bunchbybunch positions of the accelerated beam. The first prototype was tested at CNAO: the turnbyturn beam position was analyzed off line",
        "at different energies and positions with both Protons and Carbon ions beam. This paper will presents the results achieved with the system and compares them with the measurements of the current system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf024.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF025",
      "title": "Fast Intensity Monitor Based on Channeltron Electron Multiplier",
      "authors": [
        "G.M.A. Calvi",
        "V. Lante",
        "L. Lanzavecchia",
        "G. Magro",
        "A. Parravicini",
        "E. Rojatti",
        "C. Viviani",
        "CNAO Foundation",
        "Milan",
        "Italy",
        "The paper concerns the Fast Intensity Monitor (FIM) designed for the CNAO (Centro Nazionale di Adroterapia Oncologica)",
        "the Italian facility of Oncological Hadrontherapy. The FIM detector has been designed with the purpose of having a continuous and non-destructive measurement of the beam intensity in the High Energy Beam Transfer (HEBT) line. The passage of the beam through a thin aluminum foil produces secondary electrons whose yield depends on beam species (protons or carbon ions)",
        "intensity and energy. Secondary electrons are focused on the Channeltron Electron Multiplier (CEM) input",
        "multiplied and sensed over a precision resistor. In order to minimize the perturbation to the beam",
        "the foil is grounded and the read out electronics is floating. This makes electronics design harder but it is a key point to make FIM use possible continuously even during patients treatment. Measurements performed with the FIM are discussed and checked against reference detectors."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf025.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF026",
      "title": "Beam Induced Fluorescence Measurements of 100 keV Deuterons in LIPAc Accelerator",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf026.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF027",
      "title": "Low Q Cavity BPM Study for the Beam Position Measurement of Nanosecond Spaced Electron Bunches",
      "authors": [
        "L. Yang",
        "X. Hepresenter",
        "L.W. Zhang",
        "CAEP/IFP",
        "Mainyang",
        "Sichuan",
        "People's Republic of China",
        "S.S. Cao",
        "Y.B. Leng",
        "L.Y. Yu",
        "R.X. Yuan",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "Low Q cavity BPM is a key to distinguish closely spaced electron bunches allowing precise beam handling for XFEL facilities operating in a multi-bunch mode at high repetition rate up to hundreds MHz. The inter-bunch signal pollution issue becomes significant when bunch separation is down to nanosecond and causes the position detection to be increasingly overestimated. Solely relying on extreme low Q to achieve sufficient decay within bunch interval leads to appreciable interference from non-signal modes due to strong overcoupling of antenna design is required. The error imposed on measured position raises a challenge to meet the goal of high resolution. Alternatively",
        "a concept is proposed to remove the dominant part of signal pollution at the moment of sampling by intentionally shifting the phase of the last bunch signal 90degree respect to that of current bunch signal",
        "where signal sampling is normally taken for nanosecond spaced bunches. This quadrature phase shift is defined by properly choosing the operational frequency of dipole mode regarding to the bunch frequency. A low Q cavity BPM prototype to identify technical challenges and verify this concept is under development in the R&D plan for future XFEL with high repetition rate"
      ],
      "institutions": [
        "Funding: National natural science foundation of China, 11705184"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf027.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF030",
      "title": "HEPS High-Level Software Architecture Plan",
      "authors": [
        "C.P. Chu",
        "Y.S. Qiao",
        "C.H. Wang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "The High Energy Photon Source (HEPS) is a planned ultra-low emittance synchrotron radiation based light source which requires high precession control systems for both accelerator and beamlines. Such kind of accelerators will require extremely sophisticated high-level control software for both accelerator and beamline operation to achieve not only the demanded precision but also high reliability. This paper outlines the high-level application software architecture design including relational data-bases",
        "software platforms",
        "and advanced controls with machine learning (ML) techniques. Early plan for beam-line control is also reported. For better quality control and easy maintenance",
        "the high-level applications will be built upon matured software platforms. Also",
        "the HEPS High-Level Software team will collaborate with EPICS community for improving the software platforms."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf030.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF032",
      "title": "An Alternative Fast Orbit Feedback Design of HEPS",
      "authors": [
        "X.Y. Huang",
        "J.S. Cao",
        "Y.Y. Du",
        "F. Liu",
        "Y.H. Lu",
        "Y.F. Ma",
        "Y.F. Sui",
        "S.J. Wei",
        "Q. Ye",
        "X.E. Zhang",
        "D.C. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The High Energy Photon Source (HEPS) is a fourth generation light source in China and will be built in this year. The emittance of HEPS storage ring is approaching diffraction limit and the circumstance of the ring is about 1.3 kilometres. To stabilize the electron beam",
        "fast orbit feedback (FOFB) system is prerequisite. In this paper",
        "the requirements on the HEPS beam stability are discussed and an alternative FOFB design based on DBPM are introduced with algorithm and architecture."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf032.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF034",
      "title": "A Supersonic Gas Jet-Based Beam Profile Monitor Using Fluorescence for HL-LHC",
      "authors": [
        "H.D. Zhang",
        "A.S. Alexandrova",
        "R. Schnuererpresenter",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "M. Ady",
        "E. Barrios Diaz",
        "N. Chritin",
        "O.R. Jones",
        "R. Kersevan",
        "T. Marriott-Dodington",
        "S. Mazzoni",
        "A. Rossi",
        "G. Schneider",
        "R. Veness",
        "CERN",
        "Geneva",
        "Switzerland",
        "A.S. Alexandrova",
        "A. Salehilashkajani",
        "R. Schnuererpresenter",
        "C.P. Welsch",
        "H.D. Zhang",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "P. Forck",
        "S. Udrea",
        "GSI",
        "Darmstadt",
        "Germany",
        "WRUT",
        "Wroclaw",
        "Poland",
        "The High-Luminosity Large Hadron Collider (HL-LHC) project aims to increase the machine luminosity by a factor of 10 as compared to the LHC's design value. To achieve this goal",
        "a special type of electron lens is being developed. It uses a hollow electron beam which co-propagates with the hadron beam to act on any halo particles without perturbing the core of the beam. The overlapping of both beams should be carefully monitored. This contribution presents the design principle and detailed characteristics of a new supersonic gas jet-based beam profile monitor. In contrast to earlier monitors",
        "it relies on fluorescence light emitted by the gas molecules in the jet following interaction with the primary hadron beams. A dedicated prototype has been designed and built at the Cockcroft Institute and is being commissioned. Details about monitor integration",
        "achievable resolution and dynamic range will be given."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf034.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF035",
      "title": "Coherent Diffraction Radiation Imaging as an RMS Bunch Length Monitor",
      "authors": [
        "J. Wolfenden",
        "R.B. Fiorito",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "R.B. Fiorito",
        "C.P. Welsch",
        "J. Wolfenden",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "T.H. Pacey",
        "T.H. Pacey",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "High-resolution bunch length measurement is of the utmost importance for current and future generations of light sources and linacs. It is also key to the optimisation of the final beam quality in plasma-based acceleration. We present progress in the development of a novel RMS bunch length monitor based on imaging the coherent diffraction radiation (CDR) produced by a non-invasive circular aperture. Due to the bunch lengths involved",
        "the radiation produced is in the THz range. This has led to the development of a novel THz imaging system",
        "which can be applied to low energy electron beams. For high energy beams the imaging system can be used as a single shot technique. Simulation results show that the profile of a CDR image of a beam is sensitive to bunch length and can thus be used as a diagnostic. The associated benefits of this imaging distribution methodology over the typical angular distribution measurement are discussed. Plans for experiments conducted at the SwissFEL (PSI",
        "Switzerland)",
        "along with plans for future high energy single shot measurements are also presented."
      ],
      "institutions": [
        "Funding: This work was supported by the EU under Grant Agreement No. 624890 and the STFC Cockcroft Institute core Grant No. ST/G008248/1."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf035.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF036",
      "title": "Energy Independence in Optical Transition Radiation Imaging",
      "authors": [
        "J. Wolfenden",
        "R.B. Fiorito",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "R.B. Fiorito",
        "C.P. Welsch",
        "J. Wolfenden",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "The exploitation of optical transition radiation (OTR) in imaging-based diagnostics for charged particle beams is a well-established technique. Simulations of the expected OTR transverse beam profiles are therefore important in both the design of such imaging systems and the analysis of the data. Simulating OTR images is relatively straightforward for low energy electron beams. However",
        "in the near future electron machines will be using high-energy and low-emittance beams. Using such parameters can be challenging to simulate",
        "and can be limiting in their account of practical factors",
        "e.g. chromatic aberrations. In this work we show systematically that the use of low-energy parameters in high-energy OTR image simulations induces little deviation in the resulting transverse beam profiles. Simulations therefore become much easier to perform",
        "and further analysis may be performed. This opens up exciting opportunities to perform simulations quicker and with reduced demands on the computation requirements. It will be shown in this contribution how this approach will enable enhanced ways to optimize OTR diagnostics."
      ],
      "institutions": [
        "Funding: This work was supported by the EU under Grant Agreement No. 624890 and the STFC Cockcroft Institute core Grant No. ST/G008248/1."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf036.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF041",
      "title": "Use of Dimension-Reduction Techniques With Multi-Objective Genetic Algorithms to Improve the Vertical Emittance and Orbit at CESR",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf041.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF042",
      "title": "Measurement of Beam yz Crabbing Tilt Due to Wake Fields Using Streak Camera at CESR",
      "authors": [
        "S. Wang",
        "D. L. Rubinpresenter",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Transverse vertical wake fields can increase the vertical emittance and distort the phase space of a bunch in a storage ring. Recently",
        "we observed charge-dependent vertical beam size growth with a single scraper inserted through the top of the storage ring vacuum chamber. This apparent growth was due in large part to the yz coupling (vertical crabbing) induced by the wake field from the asymmetric scraper configuration. Here",
        "we report a direct measurement of a small beam yz crabbing tilt using a streak camera. The recorded images (projected beam profiles in yz plane) are analyzed with three different methods",
        "which yield consistent beam yz tilts. We found the directly-measured current-dependent beam tilts by the streak camera are consistent with the beam tilts calculated from a wake field model."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf042.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF043",
      "title": "Commissioning and Long-Term Results of a Fully-Automated Pulse-Based Optical Timing Distribution System at Dalian Coherent Light Source",
      "authors": [
        "H.P.H. Cheng",
        "A. Berlin",
        "E. Cano",
        "A. Dai",
        "J. Derksen",
        "D. Forouher",
        "W. Nasimzada",
        "M. Neuhaus",
        "P. Schiepel",
        "E. Seibel",
        "K. Shafak",
        "Cycle GmbH",
        "Hamburg",
        "Germany",
        "Z. Chen",
        "H.L. Ding",
        "Z.G. He",
        "Y.H. Tian",
        "G.R. Wu",
        "DICP",
        "Dalian",
        "People's Republic of China",
        "Deutsches Elektronen Synchrotron (DESY) and Center for Free Electron Science (CFEL)",
        "Hamburg",
        "Germany",
        "B. Liu",
        "X.Q. Liu",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "New generation light sources such as X-ray free-electron lasers* and attoscience centers** require high demand for timing synchronization",
        "on the order of few femtoseconds or below",
        "to generate ultrashort X-ray pulses that enables attosecond temporal and subatomic spatial resolution. The challenge in achieving this scientific dream lies in part in a reliable",
        "high-precision timing distribution system that can synchronize various optical and microwave sources across multi-km distances with good long-term stability. It was shown that the pulsed-optical timing distribution system can deliver sub-fs long-term timing precision between remotely synchronized lasers and microwave sources in laboratory environment.*** We present the latest results from the commissioning of China's first multi-link pulse-based optical timing distribution system (TDS) installed at Dalian Coherent Light Source. Long term operating results of the fully-automated polarization-maintaining TDS",
        "as well as lessons learned and recommendations for future improvements",
        "are presented",
        "including performance of the timing-stabilized PM fiber links",
        "microwave end-stations and ultrafast laser synchronization end-stations.",
        "*http://www.xfel.eu/news/2017/europeanxfelgeneratesitsfirstlaserlight  **G. Mourou and T. Tajima",
        "Science",
        "331",
        "pp. 41-42",
        "2011.   ***M. Xin et al.",
        "Light Sci. Appl.",
        "6",
        "e16187",
        "2017."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf043.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF044",
      "title": "Automatic Tuning of PETRA, its Injector Complex, and Prospects of Autonomous Operation of PETRA IV",
      "authors": [
        "I.V. Agapov",
        "H. Ehrlichmann",
        "J. Keil",
        "G.K. Sahoo",
        "R. Wanzenberg",
        "DESY",
        "Hamburg",
        "Germany",
        "ANL",
        "Argonne",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "We present the progress in tuning automation of the PETRA injection complex. The OCELOT optimizer has been ported to the PETRA control system and proof-of-principle tests of transmission efficiency optimization done. We further argue that the next steps in tuning and automation are impossible without rethinking the architecture of the high level contol system. A possible approach to the new system is then sketched. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf044.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF046",
      "title": "RF Electronics for the Measurement of Beam Induced Higher Order Modes (HOM) Implemented in the MicroTCA.4 Form Factor",
      "authors": [
        "S. Jabłoński",
        "N. Baboi",
        "U. Mavrič",
        "H. Schlarb",
        "DESY",
        "Hamburg",
        "Germany",
        "Higher order modes (HOM) excited in RF accelerating cavities by a particle beam can be used for electron beam diagnostics. Phase of a monopole HOM provides information about the beam phase relative to the externally induced RF field in a cavity (BPhM) [1]. Furthermore",
        "the amplitude of a dipole mode is proportional to the beam position in the cavity",
        "hence it can be used for beam position monitoring (BPM). In this paper we present a prototype of an instrument implemented in the MicoTCA.4 form factor for the measurement of the HOMs at FLASH and Eu-XFEL. The prototype consists of an analog module",
        "which is used for filtering and conditioning of the selected modes",
        "and a digital module responsible for digitization and signal processing. We present the instruments performance and discuss its influence on the precision of the HOM-based diagnostics."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf046.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF047",
      "title": "Status and Commissioning of the Wire Scanner System for the European XFEL",
      "authors": [
        "T. Lensch",
        "S. Liu",
        "DESY",
        "Hamburg",
        "Germany",
        "The European-XFEL (E-XFEL) is an X-ray Free Electron Laser facility located in Hamburg (Germany). The superconducting accelerator for up to 17.5 GeV electrons will provide photons simultaneously to several user stations. Currently 12 Wire Scanner stations are used to image transverse beam profiles in the high energy sections. These scanners provide a slow scan mode which is currently used to measure beam emittance and beam halo distributions. When operating with long bunch trains (>100 bunches) also fast scans are planned to measure beam sizes in an almost nondestructive manner. This paper describes the current installations and the latest developments of the system at European-XFEL. Furthermore",
        "the commissioning status of the system and first results of beam halo studies will be shown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf047.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF048",
      "title": "High Resolution and Low Charge Button and Strip-Line Beam Position Monitor Electronics Upgrade at Flash",
      "authors": [
        "B. Lorbeer",
        "N. Baboi",
        "H.T. Duhme",
        "Re. Neumann",
        "DESY",
        "Hamburg",
        "Germany",
        "Historically the FLASH (Free Electron Laser in Hamburg) facility at DESY (Deutsches Elektronen-Synchrotron) in Germany has foreseen operation in a charge range from 1nC-3nC for which a VME based BPM(Beam Position Monitor) system has been in operation since 2005. For a couple of years the standard machine operation has been settled at a few hundreds of pC with the tendency for smaller charges down to 100pC and smaller. The availability and resolution performance of the BPM system at charges below 300pC in many locations along the machine was unsatisfactory. In the last couple of years a new BPM electronic system based on the utca standard has been developed to overcome these limitations. A substantially improved version of the analog frontend and digital electronics has been developed in 2016 and tested successfully. During shutdown works at FLASH in summer 2017 all old button and strip-line BPM electronics has been replaced with the new type of electronics. This paper summarizes the features and performance of the new BPM system",
        "compares the beam jitter free resolution of old and new BPM system and highlights its high single shot resolution of better than 10um at a charge of 15pC."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf048.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF049",
      "title": "Energy Beam Position Monitor Button Array Electronics for the European XFEL",
      "authors": [
        "B. Lorbeer",
        "B. Beutner",
        "H.T. Duhme",
        "L. Fröhlich",
        "D. Lipka",
        "D. Nölle",
        "DESY",
        "Hamburg",
        "Germany",
        "The European XFEL(X-Ray Free Electron Laser) at DESY(Deutsches Elektronen-Synchrotron) in Hamburg/Schenefeld started commissioning in early 2017. Before the pulsed electron beam is accelerated to its final energy of 14 GeV",
        "the energy of the bunch can be compressed in three bunch compression chicanes at 130 MeV",
        "700 MeV and 2400 MeV. The vacuum chamber in these sections is tapered from 40 mm round beam pipe to a 40 cm rectangular shaped vacuum section. A custom made button array type of BPM(Beam position Monitor) is installed in this section with 26 button electrode feed-throughs. The analog and digital readout electronics for this monitor and the first experience with the calibration and operational aspects of this system are presented in this poster."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf049.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF050",
      "title": "Simulations of 3D Charge Density Measurements for Commissioning of the PolariX-TDS",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf050.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF051",
      "title": "LLRF Operation and Performance at the European XFEL",
      "authors": [
        "M. Omet",
        "V. Ayvazyan",
        "J. Branlard",
        "Ł. Butkowski",
        "M. Hierholzer",
        "M. Killenberg",
        "D. Kostin",
        "L. Lilje",
        "S. Pfeiffer",
        "H. Schlarb",
        "Ch. Schmidt",
        "V. Vogel",
        "N. Walker",
        "DESY",
        "Hamburg",
        "Germany",
        "The European X-ray Free-Electron Laser (XFEL) at Deutsches Elektronen-Synchrotron (DESY)",
        "Hamburg",
        "Germany is a user facility providing ultrashort hard and soft X-ray flashes with a high brilliance. All LLRF stations of the injector",
        "covering the normal conducting RF gun",
        "A1 (8 1.3 GHz superconducting cavities (SCs)) and AH1 (8 3.9 GHz SCs)",
        "were successfully commissioned by the end of 2015. The commissioning of LLRF stations A2 to A23 (32 1.3 GHz SCs each) in the XFEL accelerator tunnel (XTL) was concluded in June 2017. SASE light was produced in SASE undulator section SA1 and delivered to the first users in September 2017",
        "marking the beginning of regular user operation. The current state of the LLRF systems",
        "the experience gained during operation and the performance achieved in terms of stability and energy reach are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf051.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF052",
      "title": "High QL and High Gradient CW Operation of Tesla SCRF 9-Cell Cavity",
      "authors": [
        "K.P. Przygoda",
        "V. Ayvazyan",
        "Ł. Butkowski",
        "M. Hierholzer",
        "R. Rybaniec",
        "H. Schlarb",
        "Ch. Schmidt",
        "J.K. Sekutowicz",
        "DESY",
        "Hamburg",
        "Germany",
        "In the paper we would like to present Tesla SCRF 9-Cell cavity operated at CW regime with extremely high QL at gradients above 23 MV/m. The design hardware and firmware components as well as developed high level software procedures allows automatic procedure of cavity trip from low to high gradient operation. The microphonics as well as a pendoromotive effects are sensed",
        "identify and applied for cavity detuning correction. The RF and piezo feedbacks performance are demonstrated and preliminary results are briefly discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf052.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF053",
      "title": "Status and Commissioning of the European XFEL Beam Loss Monitor System",
      "authors": [
        "T. Wamsat",
        "T. Lensch",
        "P.A. Smirnov",
        "DESY",
        "Hamburg",
        "Germany",
        "The European XFEL MTCA based Beam Loss Monitor System (BLM) is composed of about 450 monitors",
        "which are part of the Machine Protection System (MPS). The BLMs detect losses of the electron beam",
        "in order to protect accelerator components from damage and excessive activation",
        "in particular the undulators",
        "since they are made of permanent magnets. Also each cold accelerating module is equipped with a BLM to measure the sudden onset of field emission (dark current) in cavities. In addition some BLMs are used as detectors for wire- scanners. Experience from the already running BLM system in"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf053.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF054",
      "title": "Online Multi Objective Optimisation at Diamond Light Source",
      "authors": [
        "M. Apollonio",
        "R. Bartolini",
        "R.T. Fielder",
        "I.P.S. Martin",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "JAI",
        "Oxford",
        "United Kingdom",
        "Oxford University",
        "Physics Department",
        "Oxford",
        "Oxon",
        "United Kingdom",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "At Diamond Light Source we have developed an Optimization Package currently used online to improve the performance of the machine",
        "usually measured in terms of lifetime",
        "injection efficiency or beam disturbance at injection. The tool is flexible in that control variables in order to optimise objectives (or their functions) can be easily specified by means of EPICS process variables (PV)",
        "making it suitable for virtually any sort of optimization. At present three different algorithms can be used to perform optimizations in a multi-objective fashion: Multi-Objective Genetic Algorithm (MOGA)",
        "Particle Swarm Optimizer (MOPSO) and Simulated Annealing (MOSA). We present a series of tests aimed at characterizing the algorithm as well as improving the performance of the machine itself."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf054.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF055",
      "title": "Time-Synchronized Beam Diagnostics at",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf055.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF056",
      "title": "A Graphical User Interface for Transverse Bunch-by-Bunch Feedback at",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf056.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF057",
      "title": "Electron Beam Diagnostics Concept for the ELI LUX Project",
      "authors": [
        "K.O. Kruchinin",
        "D. Kocon",
        "A.Y. Molodozhentsev",
        "L. Pribyl",
        "ELI-BEAMS",
        "Prague",
        "Czech Republic",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "Nowadays the popularity of Laser Wakefield Accelerators (LWFA) is increasingly growing. Although the quality of the beams produced by LWFA is still lower than provided by conventional accelerators",
        "they have great potential to be considered as a new basis for future FELs and even colliders. Laser Undulator X-ray (LUX) source is being commissioned at ELI-beamlines in Czech Republic. The goal of this machine is to provide photon beam in so called \"water window\" wavelength region for user experiments. Possible upgrade of the facility towards the LWFA based FEL is also considered. The electron beam diagnostics is absolutely crucial for achieving the aim of LUX. Specific properties of the beam produced by current LWFA",
        "such as low charge",
        "poor beam stability",
        "big beam divergence and energy spread",
        "require rethinking and adaptation of the conventional diagnostic tools and",
        "in some cases",
        "development of new ones. Ideally",
        "they have to be compact",
        "stable",
        "non-invasive and allow measurements in single-shot mode. In this report we will present an overview and design considerations for the LUX electron beam main diagnostics. We will also discuss the hardware status and future plans."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf057.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF058",
      "title": "Detection of X-Rays and Charged Particles via Detuning of the Microwave Resonator",
      "authors": [
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "Euclid Beamlabs LLC",
        "Bolingbrook",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "Critically coupled microwave resonator is a finely balanced system",
        "reflection at the resonance is virtually zero. Small changes in dielectric properties of resonator parts destroy this balance",
        "small reflection can be detected from the resonator. This measurement is used in electron paramagnetic resonance studies. In this paper we discuss two accelerator - related applications of this technology. First is related to beam halo measurement taking advantage of high sensitivity of the microwave measurement. High energy particles crossing the diamond inside of a tuned resonator induce a weak conductivity in the sensing material. This small change results in resonator decoupling providing a signal proportional to a number of particles crossing the diamond plate. Second application considered is the x-ray flux monitoring. In this case it is x-ray induced photoconductivity which alters resonator coupling and produces a signal. Interestingly",
        "sensing dielectric material embedded in a resonator can be a diamond or kapton window",
        "refractive lens or part of a silicon monochromator. Thus an inevitable x-ray absorption on optical elements of the beamline is used to monitor x-ray flux online."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf058.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF059",
      "title": "A Low Cost Beam Position Monitor System",
      "authors": [
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "J.G. Power",
        "J.H. Shao",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "University of Chicago",
        "Chicago",
        "Illinois",
        "USA",
        "A Beam Position Monitor (BPM) system is essential to beam diagnostics for almost all particle accelerators. However",
        "a typical BPM system contains customized hardware and complicated processing electronics which considerably drive the cost for large facilities where hundreds of them may be used. It also limits its use in the small scale accelerator facilities. In the paper",
        "we present a low cost BPM system which consists of a commercial available CF flange based signal pickup device",
        "a low cost integrated circuit adjacent to the pickup to filter",
        "sample",
        "digitize",
        "and broadcast the signals out of the pickup electrodes. The digital signal is transmitted out for post processing through noise-protected Wi-Fi router. We will briefly discuss the working principle and experimental progress to date."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf059.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF060",
      "title": "Non-Invasive Bunch Length Diagnostics for High Intensity Beams",
      "authors": [
        "S.V. Kuzikov",
        "S.P. Antipov",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "S.V. Kuzikov",
        "A.A. Vikharev",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "Modern particle accelerators utilize photoinjectors and compression schemes to produce short high peak current electron bunches for various applications like x-ray free electron lasers",
        "high gradient beam driven acceleration and others. Bunch length detection is a desired diagnostics for such machines. In this paper we describe a non-invasive",
        "real-time detector which can be retrofitted into an existing beamline and measure the bunch length in real time using interferometric methods. Diffraction radiation is the mechanism to be used to produce a measurable signal without intercepting the beam. This became possible as sensitivity of pyrodetectors improved over the years",
        "while peak beam power grew. For high peak current beams there is a possibility of a single shot measurement. This can be done with a pair of closely placed vacuum breaks that create a spatial correlation of the generated signals which can be measured by a pyro-detector array or a THz camera. The bunch length is determined from the correlation data using an iterative beam profile recovery algorithm."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf060.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF062",
      "title": "Machine Learning Methods for Optics Measurements and Corrections at LHC",
      "authors": [
        "E. Fol",
        "F.S. Carlierpresenter",
        "J.M. Coello de Portugal",
        "A. Garcia-Tabares",
        "R. Tomás",
        "CERN",
        "Geneva",
        "Switzerland",
        "The application of machine learning methods and concepts of artificial intelligence can be found in various industry and scientific branches. In Accelerator Physics the machine learning approach has not found a wide application yet. This paper is devoted to evaluation of machine learning methods aiming to improve the optics measurements and corrections at LHC. The main subjects of the study are devoted to recognition and analysis of faulty beam position monitors and prediction of quadrupole errors using clustering algorithms",
        "decision trees and artificial neural networks. The results presented in this paper clearly show the suitability of machine learning methods for the optics control at LHC and the potential for further investigation on appropriate approaches."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf062.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF063",
      "title": "RF Manipulations for Special LHC-Type Beams in the CERN PS",
      "authors": [
        "H. Damerau",
        "S. Hancock",
        "A. Lasheen",
        "D. Perrelet",
        "CERN",
        "Geneva",
        "Switzerland",
        "Beams with special longitudinal characteristics for the Large Hadron Collider (LHC) have been produced in the Proton Synchrotron (PS) and CERN. The flexibility of its RF systems consisting of in total 25 RF cavities at frequencies from 400 kHz to 200 MHz allows a variety of longitudinal beam manipulations. In particular the main RF system is split into three independent groups tunable from 2.8 MHz to 10 MHz. It is used to merge",
        "split and change the spacing between bunches by applying different voltage and phase programs to the three groups of cavities at different harmonic numbers simultaneously. The batch compression",
        "merging and splitting (BCMS) process has been operationally used for LHC fillings since 2016. To mitigate issues with long bunch trains in the LHC in 2017",
        "short gaps of four bunch positions have been introduced between mini-batches of eight bunches (8b4e). A higher brightness version resulting in four mini-batches per PS extraction has been delivered for luminosity production in the LHC. This paper summarizes the operational experience and indicates possible future RF manipulation schemes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf063.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF064",
      "title": "Dependable Implementation of the Beam Interlock Mechanism in CERN Power Converter Controllers",
      "authors": [
        "M. Di Cosmo",
        "Q. King",
        "R. Murillo-Garcia",
        "D. Nisbet",
        "B. Todd",
        "CERN",
        "Geneva",
        "Switzerland",
        "At CERN a Beam Interlock System (BIS) protects accelerators from accidental and uncontrolled release of beam energy",
        "avoiding machine downtime. Throughout the accelerator complex numerous critical subsystems",
        "including power converters",
        "interact with the BIS indicating their readiness for operation with beam. Power converters play a vital role in establishing operational conditions",
        "and an unmitigated power converter malfunction could lead to damage to the machine. For example a bending magnet converter set at an incorrect current would result in an incorrect field strength",
        "and beam passing through this may impact and damage the machine. A fast and dependable Beam Interlock Mechanism is required between power converters and BIS",
        "verifying that voltage and current levels are within tolerances. This paper describes the design and realisation of the Beam Interlock Mechanism",
        "based on CERN's Function Generator Controller (FGC)",
        "the central processing unit power converter control. Particular emphasis is placed on the system architecture required to assure the integrity of the power converter parameters",
        "and the protection of the CERN accelerator complex."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf064.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF064",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF066",
      "title": "The New CLIC Main Linac Installation and Alignment Strategy",
      "authors": [
        "H. Mainaud Durand",
        "J. Gaydepresenter",
        "J. Jaros",
        "M. Sosin",
        "A. P. Zemanek",
        "CERN",
        "Geneva",
        "Switzerland",
        "ESGT-CNAM",
        "Le Mans",
        "France",
        "A complete solution has been proposed for the pre-alignment of the CLIC main linac in 2012 for the Conceptual Design Report. Two recent studies provide new perspectives for such a pre-alignment. First in a study on Particle Accelerator Components' Metrology and Alignment to the Nanometre scale (PACMAN)",
        "new solutions to fiducialise and align different types of components within a micrometric accuracy on the same support were proposed and validated",
        "using a stretched wire. Secondly",
        "a 5 degree of freedom adjustment platform with plug-in motors showed a very accurate and efficient way to adjust remotely components. By combining the results of both studies",
        "two scenarios of installation and alignment for the CLIC main linac are proposed",
        "providing micrometric and automatized solutions of micrometric assembly",
        "fiducialisation and alignment in metrological labs or in the tunnel. In this paper",
        "the outcome of the two studies are presented; the two scenarios of installation and alignment are then detailed and discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf066.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF067",
      "title": "Alignment and Monitoring Systems for Accelerators and Experiments Based on BCAM - First Results and Benefits of Systems Developed for ATLAS, LHCb and HIE-ISOLDE",
      "authors": [
        "J. Gayde",
        "B. Di Girolamo",
        "Y. Kadi",
        "G. Kautzmann",
        "F. Klumb",
        "R. Lindner",
        "D. Mergelkuhl",
        "L. Pontecorvo",
        "M. Raymond",
        "P. Sainvitu",
        "E. Thomas",
        "CERN",
        "Geneva",
        "Switzerland",
        "F. Blanc",
        "P. Stefko",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "In the last few years alignment and monitoring systems based on BCAM* cameras active sensors",
        "or their HBCAM evolution",
        "have been developed at the request of the Technical Coordination of LHC experiments and HIE-ISOLDE facility Project Leader. ADEPO (ATLAS DEtector POsition) has been designed to speed up the precise closure - 0.3 mm - of large detector parts representing in total ~2500 tons. For LHCb a system has been studied and installed to monitor the positions of the Inner Tracker stations during the LHCb dipole magnet cycles. The MATHILDE (Monitoring and Alignment Tracking for HIE-ISOLDE) system has been developed to fulfil the alignment and monitoring needs for components of the LINAC enclosed in successive Cryo-Modules. These systems have been in each case configured and adapted to the objectives and environmental conditions: low space for integration; presence of magnetic fields; exposure to non-standard environmental conditions such as high vacuum and cryogenic temperatures. After a short description of the different systems and of the environmental constraints",
        "this paper summarizes their first results",
        "performances and their added value.",
        "* BCAM: Brandeis CCD Angle Monitor",
        "http://alignment.hep.brandeis.edu/Devices/BCAM/"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf067.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF068",
      "title": "Frequency Scanning Interferometry as New Solution for on-Line Monitoring Inside a Cryostat for the HL-LHC project",
      "authors": [
        "H. Mainaud Durand",
        "T. Dijoud",
        "J. Gaydepresenter",
        "F. Micolon",
        "M. Sosin",
        "CERN",
        "Geneva",
        "Switzerland",
        "M. Duquenne",
        "V. Rude",
        "ESGT-CNAM",
        "Le Mans",
        "France",
        "For the HL-LHC project",
        "the cryostats of the key components will be equipped permanently with an on-line position monitoring system based on Frequency Scanning Interferometry (FSI). Such a system",
        "based on absolute distance measurement",
        "will determine the position of the inner triplet cold masses w.r.t. their cryostat and the position of the crab cavities also inside their cryostat",
        "within an uncertainty of measurement of 0.1 mm",
        "in a harsh environment: cold temperature of 2 K and high radiation level of the order of 1 MGy. The FSI system was validated first successfully on one LHC dipole cryostat and its associated cold mass to undergo qualification tests under different conditions: warm",
        "vacuum and cold (2K). The FSI system also equips the first crab cavities prototype cryostat. The configuration of the FIS system chosen after simulations",
        "the conditions of tests as well as their results and analysis are presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf068.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF069",
      "title": "Evaluation of Frequency Scanning Interferometer Performances for Surveying, Alignment and Monitoring of Physics Instrumentation",
      "authors": [
        "J. Gayde",
        "S.W. Kamugasa",
        "CERN",
        "Geneva",
        "Switzerland",
        "During the last three years",
        "the performance of Frequency Scanning Interferometry",
        "accurate to a few micrometres",
        "has been evaluated at CERN in the frame of the PACMAN project. Improvements have been studied and tested to make it better suited for typical alignment and survey conditions in accelerators and experiments. The results of these developments and tests",
        "coupled with the multi-channel capability of the system",
        "and its compactness which eases its integration in the area to be surveyed",
        "offer a wide scope of possible applications for in-situ large scale metrology for physics equipment and facility elements. Furthermore",
        "the fact that the system electronics can be placed far away from the position to be measured",
        "allows the system to be used in confined and hazardous spaces. This paper briefly describes the system and its improvements. It gives the precision obtained for distance measurements and for the 3D point reconstruction based on FSI observations in the case of CLIC component fiducialisation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf069.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF069",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF070",
      "title": "Commissioning of Beam Instrumentation at the CERN AWAKE Facility After Integration of the Electron Beam Line",
      "authors": [
        "I. Gorgisyan",
        "C. Bracco",
        "S. Burger",
        "S. Döbert",
        "S.J. Gessner",
        "E. Gschwendtner",
        "L.K. Jensen",
        "S. Jensen",
        "S. Mazzoni",
        "D. Medina",
        "K. Pepitone",
        "L. Søby",
        "F.M. Velotti",
        "M. Wendt",
        "CERN",
        "Geneva",
        "Switzerland",
        "M. Cascella",
        "S. Jolly",
        "F. Keeble",
        "M. Wing",
        "UCL",
        "London",
        "United Kingdom",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "The Advanced Proton Driven Plasma Wakefield Acceleration Experiment (AWAKE) is a project at CERN aiming to accelerate an electron bunch in a plasma wakefield driven by a proton bunch*. The plasma is induced in a 10 m long Rubidium vapour cell using a pulsed Ti:Sapphire laser",
        "with the wakefield formed by a proton bunch from the CERN SPS. A 16 MeV electron bunch is simultaneously injected into the plasma cell to be accelerated by the wakefield to energies in GeV range over this short distance. After successful runs with the proton and laser beams",
        "the electron beam line was installed and commissioned at the end of 2017 to produce and inject a suitable electron bunch into the plasma cell. To achieve the goals of the experiment",
        "it is important to have reliable beam instrumentation measuring the various parameters of the proton",
        "electron and laser beams such as transverse position",
        "transverse profile as well as temporal synchronization. This contribution presents the status of the beam instrumentation in AWAKE",
        "including the new instruments incorporated into the system for measurements with the electron beam line",
        "and reports on the performance achieved during the AWAKE runs in 2017.",
        "* Gschwendtner E.",
        "et al. \"AWAKE",
        "the Advanced Proton Driven Plasma Wakefield Experiment at CERN\"",
        "NIM A 829 (2016)76-82"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf070.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF070",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF072",
      "title": "Transverse Feedback System for the CERN FCC-hh Collider",
      "authors": [
        "W. Höfle",
        "J. Komppula",
        "G. Kotzian",
        "K.S.B. Li",
        "D. Valuch",
        "CERN",
        "Geneva",
        "Switzerland",
        "For the future hadron Collider (FCC-hh) being studied at CERN a strong transverse feedback system is required to damp coupled bunch instabilities. This system is also planned to be used for injection damping. Based on the LHC transverse feedback design we derive requirements for power and kick strength for this system for the different options of bunch spacing",
        "25 ns and 5 ns",
        "and injection energy. Operation at high gain and close to a half integer tune is being considered and constrains the layout and signal processing. Requirements for the pick-up resolution are derived from the need to keep the emittance increase small. The performance is evaluated using numerical simulations based on the headtail code. Future areas of research and development and possible prototype developments are outlined."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf072_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf072.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf072_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF072",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF073",
      "title": "Ultra-Wideband Transverse Intra-Bunch Feedback: Beginning Development of a Next Generation 8GSa/s System",
      "authors": [
        "J.E. Dusatko",
        "J.D. Fox",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Building on the success of our 4GSa/s wideband trans-verse feedback system",
        "we have begun development of a next generation ultra-wideband feedback processor which doubles the effective sampling rate to 8GSa/s. This higher sampling rate and proportional increase in analog band-width enable enhanced flexibility and diagnostics for accelerator transverse feedback such as control of higher-order modes",
        "more detailed diagnostic information",
        "im-proved SNR and two channel processing of total charge and orbit signals",
        "with multiple pickups. Though targeted for ongoing transverse intra-bunch instability studies at the CERN SPS with a 1.7ns bunch length",
        "the increased performance paves the way for instability control and diagnostics applications for other machines such as the HL-LHC and FCC. This paper discusses the beginning development process including an evaluation of the high-est speed AtoD and DtoA data converter devices at time of this writing and selection of the devices used in our design. It then describes the architecture of the full 8GSa/s prototype feedback processor and the design approach",
        "which involves using both custom and commercial components enabling rapid and flexible development."
      ],
      "institutions": [
        "Funding: US Department of Energy DE-AC02-76SF00515, US LHC Accelerator Research Program, CERN LHC Injector Upgrade Project and the US-Japan Cooperative Program in High Energy Physics."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf073.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF073",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF074",
      "title": "Non-invasive Beam Diagnostics with Cherenkov Diffraction Radiation",
      "authors": [
        "T. Lefèvre",
        "M. Bergamaschi",
        "O.R. Jones",
        "R. Kieffer",
        "S. Mazzoni",
        "CERN",
        "Geneva",
        "Switzerland",
        "L.Y. Bartnik",
        "M.G. Billing",
        "Y.B.P. Bordlemay Padilla",
        "J.V. Conway",
        "M.J. Forster",
        "J.P. Shanks",
        "S. Wang",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "M. Bergamaschi",
        "P. Karataev",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "V.V. Bleko",
        "A.S. Konkov",
        "J.S. Markova",
        "A. Potylitsyn",
        "TPU",
        "Tomsk",
        "Russia",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "Based on recent measurements of incoherent Cherenkov Diffraction Radiation (ChDR) performed on the Cornell Electron Storage Ring",
        "we present here a concept for the centering of charged particle beams when passing close to dielectric material. This would find applications as beam instrumentation in dielectric capillary tubes",
        "typically used in novel accelerating technologies",
        "as well as in collimators using bent crystals for high-energy",
        "high-intensity hadron beams",
        "such as the Large Hadron Collid-er or Future Circular Collider. As a charged particle beam travels at a distance of a few mm or less from the surface of a dielectric material",
        "incoherent ChDR is produced inside the dielectric. The photons are emitted at a large and well-defined angle that allows their detection with a limited contribution of background light. A set of ChDR detectors distributed around a dielectric would enable both the beam position and tilt angle to be measured with a good resolution."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf074.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF074",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF075",
      "title": "Availability Allocation to Particle Accelerators Subsystems by Complexity Criteria",
      "authors": [
        "O. Rey Orozko",
        "A. Apollonio",
        "M. Jonker",
        "J.A. Uythoven",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the early design stages of an accelerator",
        "an effective allocation method is needed to translate an overall accelerator availability goal into availability requirements for its subsystems. During the allocation process",
        "many factors are considered to obtain so-called ‘complexity weights'",
        "which are at the basis of the system availability allocation. Some of these factors can be measured quantitatively while other have to be assessed qualitatively. Based on our analysis of factors affecting availability",
        "we list six criteria for complexity resulting in an availability allocation of accelerator subsystems. System experts determine the scales of factors and relationships between subsystems. In this paper",
        "we consider four availability apportionment techniques to allocate complexity weights to subsystems. Finally",
        "we apply this method to the Compact Linear Collider (CLIC) and we propose another application of the complexity weights to the Large Hadron Collider (LHC)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf075.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF075",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF076",
      "title": "Availability Studies Comparing Drive Beam and Klystron Options for the Compact Linear Collider",
      "authors": [
        "O. Rey Orozko",
        "S. Döbert",
        "M. Jonker",
        "CERN",
        "Geneva",
        "Switzerland",
        "The initial proposal for the Compact Linear Collider (CLIC) is based on a two beam-scheme to accelerate the main colliding beams. For low collision energies",
        "the main beam could also be accelerated by powering the accelerating structures with klystrons instead of the two-beam scheme. This paper studies the feasibility of this new alternative in terms of machine availability. An implemented bottom-up availability model considers the components failure modes to estimate the overall availability of the system. The model is defined within a Common Input Format scheme and the AvailSim3 software package is used for availability simulations. This paper gives an overview of the systems affecting the beam powering availability and makes recommendations for availability improvements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf076.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF076",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF077",
      "title": "Performance Evaluation of Linac4 During the Reliability Run",
      "authors": [
        "O. Rey Orozko",
        "A. Apollonio",
        "S.S. Erhard",
        "G. Guidoboni",
        "B. Mikulec",
        "J.A. Uythoven",
        "CERN",
        "Geneva",
        "Switzerland",
        "Linac4 will replace Linac2 as the first element in the CERN proton injector chain from 2020 onwards",
        "following the second LHC long shutdown (LS2). With more than three times higher energy and number of compo-nents than Linac2",
        "beam availability is one of the main challenges of Linac4. Intended as a smooth transition from commissioning to operation",
        "a Linac4 Reliability Run was started in July 2017 and is foreseen to last until mid-May 2018. The goal is to achieve the target availability of 95 %. This implies consolidated routine operation and identification of recurring problems. This paper introduces the schedule and operational aspects of the Linac4 Reliability Run",
        "including the developed tools and methods for availability tracking. The paper also summarizes the lessons learned during the first period of the Linac4 Reliability Run with respect to fault tracking and provides an in-depth analysis of the failure modes and observed availability."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf077.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF077",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF078",
      "title": "Machine Learning Applied at the LHC for Beam Loss Pattern Classification",
      "authors": [
        "University of Malta",
        "Information and Communication Technology",
        "Msida",
        "Malta",
        "CERN",
        "Geneva",
        "Switzerland",
        "Beam losses at the LHC are constantly monitored because they can heavily impact the performance of the machine. One of the highest risks is to quench the LHC superconducting magnets in the presence of losses leading to a long machine downtime in order to recover cryogenic conditions. Smaller losses are more likely to occur and have an impact on the machine performance",
        "reducing the luminosity production or reducing the lifetime of accelerator systems due to radiation effects",
        "such as magnets. Understanding the characteristics of the beam loss",
        "such as the beam and the plane",
        "is crucial in order to correct them. Regularly during the year",
        "dedicated loss map measurements are performed in order to validate the beam halo cleaning of the collimation system. These loss maps have the particular advantage that they are performed in well controlled conditions and can therefore be used by a machine learning algorithm to classify the type of losses during the LHC machine cycle. This study shows the result of the beam loss classification and its retrospective application to beam loss data from the 2017 run."
      ],
      "institutions": [],
      "abstract": "B. Salvachuapresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf078.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF078",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF079",
      "title": "A Smart Framework for the Availability and Reliability Assessment and Management of Accelerators Technical Facilities",
      "authors": [
        "L. Serio",
        "A. Castellano",
        "U. Gentile",
        "CERN",
        "Geneva",
        "Switzerland",
        "F. Antonello",
        "P. Baraldi",
        "E. Zio",
        "Politecnico di Milano",
        "Milan",
        "Italy",
        "CERN operates and maintains a large and complex technical infrastructure serving the accelerator complex and experiments detectors. A performance assessment and enhancement framework based on data mining",
        "artificial intelligence and machine-learning algorithms is under development with the objective of structuring",
        "collecting and analyzing systems and equipment operation and failure data",
        "to guide the identification and implementation of adequate corrective",
        "preventive and consolidation interventions. The framework is designed to collect and structure the data",
        "identify and analyze the associated driving events. It develops dynamically functional dependencies and logic trees",
        "descriptive and predictive models to support operation and maintenance activities to improve the reliability and availability of the installations. To validate the performance of the framework and quality of the algorithms several case studies are being carried out. We report on the design",
        "implementation and on the preliminary results inferred on historical and live stream data from CERN's technical infrastructure. Proposal for the full deployment and expected long-term capabilities will also be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf079_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf079.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf079_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF079",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF080",
      "title": "Beam Size Measurements Based on Movable Quadrupolar Pick-ups",
      "authors": [
        "A. Sounas",
        "M. Gąsior",
        "T. Lefèvre",
        "A. Mereghetti",
        "J. Olexa",
        "S. Redaelli",
        "G. Valentino",
        "CERN",
        "Geneva",
        "Switzerland",
        "Measurements with quadrupolar pick-ups (PU) have attracted particular interest as non-intercepting diagnostics for determining the transverse beam size. They are based on processing the signals of an electromagnetic PU for the extraction of the second-order moment",
        "which contains information about the beam size. Despite the simplicity of the concept",
        "quadrupololar measurements have always been highly challenging in reality. This comes from the fact that the quadrupolar moment constitutes only a very small part of the total PU signal dominated by the intensity and the position signals. Therefore",
        "the beam size information can easily be lost due to small imperfections in the signal processing chain",
        "such as asymmetries in the electronics and cables. In this paper",
        "we present a new method for quadrupolar measurements using movable PUs. Through position and aperture scans",
        "our technique minimizes the parasitic beam position signal and takes into account imperfections of the PU",
        "cables and electronics",
        "thus enabling an efficient auto-calibration of the measurement system. Preliminary studies",
        "using collimators with embedded electrostatic PUs in the LHC at CERN",
        "have shown very promising results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf080.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF080",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF081",
      "title": "An Enhanced Quench Detection System for Main Quadrupole Magnets in the Large Hadron Collider",
      "authors": [
        "J. Spasic",
        "D.O. Calcoen",
        "R. Denz",
        "V. Froidbise",
        "S. Georgakakis",
        "T. Podzorny",
        "A.P. Siemko",
        "J. Steckert",
        "CERN",
        "Geneva",
        "Switzerland",
        "To further improve the performance and reliability of the quench detection system (QDS) for main quadrupole magnets in the Large Hadron Collider (LHC)",
        "there is a planned upgrade of the system during the long shutdown period of the LHC in 2019-2020. While improving the already existing functionalities of quench detection for quadrupole magnets and field-bus data acquisition",
        "the enhanced QDS will incorporate new functionalities to strengthen and improve the system operation and maintenance. The new functionalities comprise quench heater supervision",
        "interlock loop monitoring",
        "power cycling possibility for the whole QDS and its data acquisition part",
        "monitoring and synchronization of trigger signals",
        "and monitoring of power supplies. In addition",
        "the system will have two redundant power supply feeds. Given that the enhanced QDS units will replace the existing QDS units in the LHC tunnel",
        "the units will be exposed to elevated levels of ionizing radiation. Therefore",
        "it is necessary to design a radiation tolerant detection system. In this work",
        "an overview of the design solution for such enhanced QDS is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf081_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf081.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf081_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF081",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF082",
      "title": "A Systematic Analysis of the Prompt Dose Distribution at the Large Hadron Collider",
      "authors": [
        "O. Stein",
        "K. Bilko",
        "M. Brugger",
        "S. Danzeca",
        "D. Di Francesca",
        "R. Garcia Alia",
        "Y. Kadi",
        "G. Li Vecchi",
        "C. Martinella",
        "CERN",
        "Geneva",
        "Switzerland",
        "During the operation of the Large Hadron Collider (LHC) the continuous particle losses create a mixed particle radiation field in the LHC tunnel and the adjacent caverns. Exposed electronics and accelerator components show dose dependent accelerated aging effects. In order to achieve an optimal lifetime associated to radiation damage",
        "the position of the equipment is chosen in dependency of the amplitude of the radiation fields. Based on the continuous analysis of the data from more than 3900 ionisation chamber beam loss monitors the evolution of the radiation levels is monitored during the accelerator operation. Normalising the radiation fields with either the integrated luminosity or the integrated intensities allows extrapolating the radiation levels of future accelerator operation. In this paper",
        "the general radiation levels in the arcs and the insertion regions at the LHC and their evolution will be presented. The changes in the prompt dose distribution along the LHC between the operation in 2016 and 2017 will be discussed. The impact of different accelerator settings on the local dose distribution will be addressed as well."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf082_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf082.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf082_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF082",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF083",
      "title": "Distributed Optical Fiber Radiation Sensing at CERN",
      "authors": [
        "G. Li Vecchi",
        "M. Brugger",
        "S. Danzeca",
        "D. Di Francesca",
        "R. Ferraro",
        "Y. Kadi",
        "O. Steinpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Univ-Lyon Laboratoire H. Curien",
        "UMR CNRS 5516",
        "Saint Etienne",
        "France",
        "The CERN's accelerator tunnels are associated with very complex mixed field radiation environments. Radiation degrades electronic components and directly affects their lifetimes causing failures that contribute to the machine downtime periods. In our contribution",
        "we will report on the development and first employment of a Distributed Optical Fiber Radiation Sensor (DOFRS) at CERN. The most interesting feature of DOFRS technology is to provide an online and spatially distributed map of the dose levels in large machines with spatial resolution of the order of one meter. This fiber based dose sensor will provide valuable information in addition to the currently installed active and passive dosimeters. After demonstrating the working principle of DOFRS*",
        "the first operational prototype was installed in the Proton Synchrotron Booster during last 2016/17 end-of-the-year technical stop. The DOFRS has been acquiring data successfully since the beginning of 2017 operations. The performances that were achieved by the first prototype will be discussed in the final contribution. The DOFRS measurements will also be bench-marked to the results provided by other punctual dosimeters.",
        "*I. Toccafondo et al.",
        "'Distributed Optical Fiber Radiation Sensing in a Mixed-Field Radiation Environment at CERN",
        "' J. Lightw. Technol. 35",
        "3303",
        "3310",
        "2017."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf083_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf083.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf083_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF083",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF084",
      "title": "Commissioning the ELENA Beam Diagnostics Systems at CERN",
      "authors": [
        "G. Tranquille",
        "S. Burger",
        "M. Gąsior",
        "P. Grandemange",
        "T.E. Levens",
        "O. Marqversen",
        "L. Søby",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Extra Low ENergy Antiproton ring (ELENA) at CERN entered the commissioning phase in November 2016 using H− ions and antiprotons to setup the machine at the different energy plateaus. The low intensities and energy of the ELENA beam generate very weak signals making beam diagnostics very challenging. With a circulating beam current of less than 1 μA and an energy where the beam annihilates in less than a few microns of matter",
        "special care was taken during the design phase to ensure an optimal performance of these measurement devices once installed on the ring and transfer lines. A year on we present the performance of the various devices that have been deployed to measure the beam parameters from the extraction point of the Antiproton Decelerator (AD)",
        "through the ELENA ring and in the experimental lines."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf084_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf084.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf084_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF084",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF085",
      "title": "Upgrade of the CERN SPS Beam Position Measurement System",
      "authors": [
        "M. Wendt",
        "M. Barros Marin",
        "A. Boccardi",
        "T.B. Bogey",
        "V. Kain",
        "C. Moran Guizan",
        "A. Topaloudis",
        "CERN",
        "Geneva",
        "Switzerland",
        "Università di Pisa",
        "Pisa",
        "Italy",
        "The CERN Super Proton Synchrotron (SPS) is a fast cycling hadron accelerator delivering protons with momenta of up to 450 GeV/c for the Large Hadron Collider (LHC)",
        "fixed target experiments and other users such as the AWAKE plasma acceleration experiment",
        "and also used to accelerate heavy ions. This paper presents the upgrade initiative for the SPS beam position measurement system in the frame of the CERN LHC Injector Upgrade (LIU) project. The new SPS beam position read-out electronics will be based on logarithmic amplifiers",
        "using signals provided by the 216 existing beam position monitors",
        "the majority of which are based on split-plane 'shoebox' technology. It will need to cover a dynamic range sufficient to manage the wide range of SPS beam intensities and bunch formatting schemes to provide turn-by-turn and averaged beam orbits along the SPS acceleration cycles. In order to avoid long coaxial cables",
        "the front-end electronics including the digitisation",
        "will be located inside the accelerator tunnel",
        "with optical transmission to surface processing electronics. This represents an additional challenge in terms of radiation tolerance of electronics components and materials."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf085_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf085.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf085_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF085",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF086",
      "title": "Latest Developments and Updates of the ESS Linac Simulator",
      "authors": [
        "J.F. Esteban Müller",
        "E. Laface",
        "ESS",
        "Lund",
        "Sweden",
        "A fast and accurate online model is required for optimal commissioning and reliable operation of the high-power proton linac at the European Spallation Source. The Open XAL framework",
        "initially developed at SNS",
        "is used at ESS for the development of high-level physics applications. The online model we use",
        "known as ESS Linac Simulator (JELS)",
        "extends the Open XAL model with several features. This paper describes the latest updates carried out to JELS. Two new elements have been implemented: a solenoid field map for the LEBT and a DTL Tank element that automatically calculates each gap phase. All calculations are now done in the laboratory frame",
        "in agreement with Open XAL convention. A thorough benchmark of the model against TraceWin",
        "which is the tool used for the lattice design",
        "is also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf086_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf086.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf086_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF086",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF087",
      "title": "The First Experience and Results of Beam Diagnostics Deployment at the ESS Accelerator",
      "authors": [
        "V. Grishin",
        "E.C. Bergman",
        "B. Cheymol",
        "C.S. Derrez",
        "T.J. Grandsaert",
        "H. Hassanzadegan",
        "A. Jansson",
        "H. Kocevar",
        "Ø. Midttun",
        "S. Molloy",
        "J. Norin",
        "T.J. Shea",
        "C.A. Thomas",
        "ESS",
        "Lund",
        "Sweden",
        "Vitrociset s.p.a",
        "Roma",
        "Italy",
        "F. Senée",
        "O. Tuske",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "The European Spallation Source (ESS) will produce neutrons for science by subjecting a tungsten target to the high-intensity proton beam from a superconducting linear accelerator. A complete suite of beam diagnostics will enable tuning",
        "monitoring and protection of the accelerator during commissioning",
        "studies and operation. As an initial step toward neutron production",
        "the Ion Source and the 75 keV Low Energy Transport Line is installed on the ESS site in Lund",
        "Sweden. To support the commissioning and characterization of this first beam-producing system",
        "a subset of the full diagnostics suite is deployed. This includes the following equipment: a faraday cup",
        "current transformers",
        "an emittance measurement unit",
        "beam-induced fluorescence monitors",
        "and a doppler-shift spectroscopy system. All aspects of the deployment experience",
        "from acceptance testing through installation",
        "verification",
        "and commissioning will be presented."
      ],
      "institutions": [],
      "abstract": "*Beam Instrumentation reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf087_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf087.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf087_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF087",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF088",
      "title": "Machine Protection Features of the ESS Beam Current Monitor System",
      "authors": [
        "H. Hassanzadegan",
        "E. Bargalló",
        "S.G. Gabourin",
        "T. Korhonen",
        "S. Kövecses de Carvalho",
        "A. Nordt",
        "T.J. Shea",
        "ESS",
        "Lund",
        "Sweden",
        "Sigma Connectivity Engineering",
        "Lund",
        "Sweden",
        "DESY",
        "Hamburg",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The BCM system of the European Spallation Source includes several machine protection features to ensure that the actual beam parameters will be consistent with the selected beam and destination modes. Differential current measurements with several ACCT pairs are foreseen to detect beam losses particularly in the low-energy linac where Beam Loss Monitors cannot be used. The ACCTs will also be used to check that no beam will be present in the sections downstream of a temporary beam dump. These measurements will then be used to stop the beam shortly after an abnormal condition has been detected by the BCM system. This will require some customized interfaces with the Timing System and the Machine Protection System as well as an optical interface for differential current measurement over large distances. Automatic setting of the machine protection thresholds and masking/unmasking of the interlocks based on the beam and destination modes are among the technical complexities. This paper gives an overview of the design including the most recent updates and discusses in more details the machine protection features of the BCM system. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf088_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf088.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf088_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF088",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPAF090",
      "title": "CS-Studio Operator Training at ReA3",
      "authors": [
        "T. Summers",
        "D.B. Crisp",
        "NSCL",
        "East Lansing",
        "Michigan",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "In the past year",
        "Control System Studio (CS-Studio) has become the predominant graphical user interface tool at ReA3",
        "the 3 MeV/u rare isotope beam Reaccelerator at Michigan State University's National Superconducting Cyclotron Laboratory. CS-Studio is a set of control system interface tools that include operator interfaces",
        "history plots",
        "an alarm handler",
        "save/restore",
        "scanning",
        "and more. Becoming an effective user of these tools takes considerable time and training. This contribution will describe the challenges and strategies for training operators on the general use of the CS-Studio tools. It will describe the use of a simulated user interface environment for training operators at any time without affecting the operating facility."
      ],
      "institutions": [
        "Funding: This material is based upon work supported by the National Science Foundation under Grant No. PHY-1565546"
      ],
      "abstract": "A.C.C. Villaripresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/wepaf090_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/wepaf090.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/wepaf090_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEPAF090",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 71,
  "scrape_time": "2025-10-10 19:29:49"
}