{
  "session_info": {
    "id": "MOOYGD",
    "name": "MOOYGD - Contributed Orals: Novel Particle Sources and Acceleration Techniques",
    "url": "https://proceedings.jacow.org/ipac2022/html/mooygd.htm"
  },
  "papers": [
    {
      "paper_id": "MOOYGD1",
      "title": "Experiments Towards High-Repetition Rate Plasma Wakefield Acceleration at FLASHForward",
      "authors": [
        "G. Loisch",
        "J. Beinortaite",
        "G.J. Boyle",
        "R.T.P. D’Arcy",
        "S. Diederichs",
        "J.M. Garland",
        "P. Gonzalez-Caminal",
        "C.A. Lindstrøm",
        "J. Osterhoff",
        "T. Parikh",
        "S. Schreiber",
        "S. Schröder",
        "M. Thévenet",
        "S. Wesch",
        "M. Wing",
        "DESY",
        "Hamburg",
        "Germany",
        "J. Chappell",
        "M. Wing",
        "UCL",
        "London",
        "United Kingdom",
        "JAI",
        "Oxford",
        "United Kingdom",
        "Universität Hamburg",
        "Hamburg",
        "Germany",
        "Beam-driven plasma-wakefield acceleration (PWFA) is one of the most promising techniques to reduce significantly the size and cost of future lepton accelerators. Huge steps have been taken in the last decades towards achieving high acceleration gradients with simultaneous beam-quality preservation. However",
        "in order to match both the luminosity demands of high-energy physics and the brilliance requirements of photon science",
        "PWFA must be capable of accelerating thousands of bunches per second ’ orders of magnitude beyond the current state of the art. Historically",
        "investigation of the rate limitation in plasmas was limited by the number of bunches available from the accelerator front-end. The FLASHForward facility",
        "which is driven by the superconducting linac of the FLASH free-electron laser",
        "is the first experiment capable of addressing this issue. We report here on first experimental results from the facility",
        "aimed at determining the repetition rate limit of plasma accelerators arising from fundamental plasma processes* and finally advancing the repetition rate of PWFA from proof-of-principle experiments at a few bunches per second to a competitive plasma accelerator.",
        "* R. D’Arcy et al.",
        "Recovery time of a plasma-wakefield accelerator",
        "Nature (in press)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/mooygd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/mooygd1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/mooygd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-MOOYGD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOOYGD2",
      "title": "The AWAKE Experiment in 2021:  Performance and Preliminary Results on Electron-Seeding of Self-Modulation",
      "authors": [
        "E. Gschwendtner",
        "L. Verra",
        "G. Zevi Della Porta",
        "CERN",
        "Meyrin",
        "Switzerland",
        "P. Muggli",
        "L. Verra",
        "MPI",
        "Muenchen",
        "Germany",
        "MPI-P",
        "München",
        "Germany",
        "TUM",
        "Munich",
        "Germany",
        "The future programme of the Advanced Wakefield (AWAKE) experiment at CERN relies on the seeded self-modulation of an entire proton bunch",
        "resulting in phase-reproducible micro-bunches. This important milestone was achieved during the 2021 proton run by injecting a short electron bunch ahead of the proton bunch",
        "demonstrating for the first time the electron-seeding of proton bunch self-modulation. This talk describes the programme",
        "performance and preliminary results of the AWAKE experiment in the 2021 proton run",
        "and introduces the program of the 2022 proton run. The observation of electron-seeded self-modulation opens new avenues of exploration which will be studied in 2022",
        "including the effect of a phase difference between the front and the back of a proton bunch and the possibility of reproducibly seeding the hosing instability using the electron beam."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/mooygd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/mooygd2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/mooygd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-MOOYGD2",
      "page_number": "21",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 18:33:49"
}