{
  "session_info": {
    "id": "TUIZGD",
    "name": "TUIZGD - Invited Orals: Applications of Accel., Tech. Transfer and Industrial Rel.",
    "url": "https://proceedings.jacow.org/ipac2022/html/tuizgd.htm"
  },
  "papers": [
    {
      "paper_id": "TUIZGD1",
      "title": "An ERL-Driven Intense Compton Source Above 100 keV and Other ERL Applications",
      "authors": [
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "This talk will specify the x-ray characteristics that can be achieved by Compton scattering off a high-brightness electron beam that ERLs make available. These are important parameters for x-ray users as well as for nuclear physics applications. The use of the Cornell BNL ERL Test Accelerator (CBETA) as an example layout for such a Compton source will be presented",
        "including some accelerator physics details of CBETA’s design",
        "construction",
        "and commissioning. The talk will also highlight other applications that are enabled by unique features of ERLs."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/tuizgd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/tuizgd1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/tuizgd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-TUIZGD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUIZGD2",
      "title": "RIKEN Accelerator-Driven Compact Neutron Systems, RANS Project and Their Capabilities",
      "authors": [
        "RIKEN",
        "Center for Advanced Photonics",
        "Wako",
        "Japan",
        "RIKEN Accelerator-driven compact neutron source",
        "RANS",
        "has been operational since 2013. There are two major goals of RANS research and development. One is to establish a new compact low energy neutron non-destructive evaluation system on-site of floor-standing type for industrial use. Another goal is to invent a novel transportable compact neutron system for the preventive maintenance of large scale construction such as a bridge. The low energy transmission imaging",
        "neutron diffractometer",
        "small angle scattering instruments",
        "fast neutron transmission imaging",
        "fast neutron back scattering imaging",
        "neutron induced prompt gamma-ray analysis and neutron activation analysis are available with RANS. For further compact neutron system",
        "RANS-II with 2.49 MeV proton linac starts in operation and fast neutron scattering imaging experiments for non-destructive visualization of concrete degradation",
        "and the suspension bridge cables are being successfully realized. Based on more compact and light proton accelerator tube and the solid state amplifier with 500 MHz",
        "RANS-III development starts towards a transportable neutron system. The proton energy and the neutron generating target of RANS-III is the same as RANS-II",
        "so that all the novel technologies of fast neutron non-destructive test to be demonstrated for practical use in RANS-II will be available in RANS-III."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/tuizgd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/tuizgd2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/tuizgd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-TUIZGD2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 18:36:41"
}