{
  "session_info": {
    "id": "TUOB",
    "name": "TUOB - Tuesday Contributed Oral Session B",
    "url": "https://proceedings.jacow.org/medsi2020/html/tuob.htm"
  },
  "papers": [
    {
      "paper_id": "TUOB01",
      "title": "Exactly-constrained KB Mirrors for Sirius/LNLS Beamlines: Design and Commissioning of the TARUMÃ Station Nanofocusing Optics at CARNAÚBA Beamline",
      "authors": [
        "G.B.Z.L. Moreno",
        "C.S.N.C. Bueno",
        "R.R. Geraldes",
        "F.R. Lena",
        "S.A.L. Luiz",
        "E.O. Pereira",
        "H.C.N. Tolentino",
        "Y.R. Tonin",
        "W.H. Wilendorf",
        "LNLS",
        "Campinas",
        "Brazil",
        "Next-generation nanoprobes",
        "empowered by diffraction-limited storage rings",
        "as Sirius/LNLS",
        "present high-performance requirements aiming at high spatial resolution and throughput. For the focusing optics",
        "this means assuring a small and non-astigmatic probe",
        "high flux density",
        "and remarkably high position stability",
        "while also preserving beam wavefront. At stations further dedicated to spectromicroscopy and in-situ experiments",
        "these requirements add up to having achromatic design and suitable working distance",
        "respectively. In this way",
        "Kirkpatrick-Baez (KB) mirrors have been chosen as the most appropriate solution for Sirius focusing optics. At TARUMÃ*",
        "the first delivered nanoprobe at Sirius",
        "the KB focuses the beam down to a 120 nm spot size (>8 keV) with a 440 mm working distance. This brought the requirements on the mirror’s angular stability to less than 10 nrad RMS",
        "surface quality to single-digit nanometers",
        "and alignment tolerances to the range of hundreds of nrad",
        "which can be even tighter for other nanoprobes. Such specifications are particularly challenging regarding clamping",
        "vibration",
        "and thermal expansion budgets",
        "even testing optical metrology limits during alignment and validation phases. The resulting KB mechanism is an opto-mechanical system with an exactly-constrained",
        "deterministic design**",
        "and suspension modes well above 250 Hz",
        "sufficiently coupling optics to sample in the same 6-DoF base. It provides low-order aberration corrections by single degree-of-freedom alignment with piezo actuators",
        "while higher order aberrations from clamping and thermal deformations are mitigated by gluing each mirror to flexure-based mounting frames. This contribution presents the design",
        "assembly",
        "and commissioning of the KB system at TARUMÃ as a reference case.",
        "*Tolentino",
        "H.C.N.",
        "et al. \"TARUMÃ station for the CARNAÚBA beamline at SIRIUS/LNLS\" SPIE 11112 19 **Geraldes",
        "R.R.",
        "et al. \"The Design of Exactly-constrained X-ray Mirror Systems for Sirius.\""
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tuob01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tuob01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tuob01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUOB01",
      "page_number": "111",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOB02",
      "title": "Development of a Passive Tuned Mass Damper for Ultra-High Vacuum Beamline Optics",
      "authors": [
        "F. Khan",
        "D. Crivelli",
        "J.H. Kelly",
        "A. Male",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Vibration in beamline optics can degrade the quality of experiments: the resulting movement of a mirror increases the x-ray beam position uncertainty",
        "and introduces flux variations at the sample. This is normally dealt with by averaging data collection over longer periods of time",
        "by slowing down the data acquisition rates",
        "or by accepting lower quality / blurred images. With the development of faster camera technology and smaller beam sizes in next generation synchrotron upgrades",
        "older optics designs can become less suitable",
        "but still very expensive to redesign. Mechanically",
        "mirror actuation systems need to be a balance between repeatability of motion and stability. This normally leads to designs that are ’soft’ and have resonant modes at a relatively low frequency",
        "which can be easily excited by external disturbances such as ground vibration and local noise. In ultra-high vacuum applications the damping is naturally very low",
        "and the amplification of vibration at resonance tends to be very high. At Diamond we designed a process for passively damping beamline mirror optics. First",
        "we analyse the mirror’s vibration modes using experimental modal analysis; we then determine the tuned mass damper parameters using mathematical and dynamic models. Finally",
        "we design a flexure-based metal tuned mass damper which relies on eddy current damping through magnets and a conductor plate. The tuned mass damper can be retrofitted to existing optics using a clamping system that requires no modification to the existing system. In this conference paper we show a case study on a mirror optic on Diamond Light Source’s small molecule single crystal diffraction beamline",
        "I19."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tuob02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tuob02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tuob02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUOB02",
      "page_number": "115",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOB03",
      "title": "Ultra-Precision Mechanics for Fourth-Generation Sources",
      "authors": [
        "R. Doehrmann",
        "S. Botta",
        "P. Wiljes",
        "DESY",
        "Hamburg",
        "Germany",
        "Fourth-generation synchrotrons",
        "with their extremely good beam conditions",
        "offer experimental possibilities that go far beyond the current technological state of the art. These extremely brilliant x-ray sources enable",
        "among other things with new focusing optics",
        "focal sizes in the nanometer range with the highest intensity and thus allow for highly dynamic experiments also on this scale. In order to guarantee the required beam quality all the way down to the experiment",
        "optimal conditions must be generated for the end stations and for the beamline optics. An optimum of stability and precision can unfortunately only be achieved if",
        "on the one hand",
        "the infrastructure that shields the experiments and enables undisrupted operation is planned very carefully. On the other hand",
        "the scientific instruments must also be optimized and improved. Our strategy for the construction of the PETRA IV experiments is based on five pillars (low vibration",
        "stable environment",
        "rigid construction",
        "optimized design and fast feedback). In this contribution",
        "we describe these concepts in more detail. Furthermore",
        "we present illustrative examples of a possible implementation at PETRA IV."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/tuob03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/tuob03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/tuob03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-TUOB03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 23:25:36"
}