{
  "session_info": {
    "id": "MOOMMH",
    "name": "MOOMMH - M1",
    "url": "https://proceedings.jacow.org/ECRIS2014/html/moommh.htm"
  },
  "papers": [
    {
      "paper_id": "MOOMMH01",
      "title": "How Can an ECRIS Meet Requirement of the Next Generation Heavy Ion Accelerator Facility",
      "authors": [
        "H.W. Zhao",
        "L.T. Sun",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "Driven by the requirement of nuclear physics research",
        "a few next generation heavy ion accelerator facilities have been proposed such as GSI-FAIR",
        "IMP-HIAF",
        "JINR-NICA and JLAB-MEIC which require ion source to produce very intense pulsed-highly-charged heavy ion beams such as Au32+",
        "U28+ and U35+ with beam current 1011 particles per pulse. With more intense higher charge state heavy ion beam produced",
        "the design and building of such a heavy ion accelerator complex will be more cost effective and more compact. This is a big challenge and also an opportunity for ECR ion source development. However",
        "how can an ECR ion source compete with other ion sources such as EBIS",
        "LIS and MEVVA ion sources to meet requirement of the next generation heavy ion accelerator complex? The potential performance of the next generation ECRISs working at the frequency 40~60 GHz and comparison with other possible ion sources will be presented. This paper will have a detailed discussion of the foreseen challenges of the next generation ECRISs and impact on the next generation heavy ion acclerator complex as well."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/moommh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/moommh01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/moommh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-MOOMMH01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOOMMH02",
      "title": "First Ion Beams Extracted from a 60 GHz ECR Ion Source Using Polyhelices Technique",
      "authors": [
        "T. Lamy",
        "J. Angot",
        "J. Jacob",
        "P. Sole",
        "T. Thuillier",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "GYCOM Ltd",
        "Nizhny Novgorod",
        "Russia",
        "F. Debray",
        "J.M. Dumas",
        "C. Grandclement",
        "P. Sala",
        "C. Trophime",
        "LNCMI",
        "Grenoble Cedex",
        "France",
        "A.G. Eremeev",
        "I. Izotov",
        "B.Z. Movshevich",
        "V. Skalyga",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "The first 18 GHz ECR plasma in an ion source prototype with a magnetic structure using high field magnets techniques was performed in 2012. The particularity of such a prototype is the establishing of a topologically closed ECR zone in a cusp configuration. During the current increase to get a closed 60 GHz zone",
        "a failure appeared at 21000 A in one helix among the four. After the modification of the cooling circuit",
        "the prototype was able to accept up to 26000 A allowing high frequency experiments. In the same time",
        "a 60 GHz - 300 kW pulsed gyrotron has been successfully built and installed in Grenoble by IAP-RAS and Gycom company. The first 60 GHz ECR plasma has been produced in April 2014",
        "the first pulsed beams have been extracted and analyzed. The experimental results obtained will be presented along with the perspectives of such developments."
      ],
      "institutions": [
        "Funding: We acknowledge the support of the LNCMI-CNRS, member of the European Magnetic Field Laboratory (EMFL) and the International Science and Technology Center (project#3965)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/moommh02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/moommh02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/moommh02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-MOOMMH02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOOMMH03",
      "title": "First Results At 24 GHz With The Superconducting Source For Ions (SuSI)",
      "authors": [
        "G. Machicoane",
        "D.G. Cole",
        "D.E. Neben",
        "L. Tobos",
        "NSCL",
        "East Lansing",
        "Michigan",
        "USA",
        "K. Holland",
        "D. Leitner",
        "D. Morris",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The superconducting ECR ion source SuSI at Michigan State University was designed to operate primarily at 18GHz and has demonstrated very good performance at this frequency especially when coupling two klystrons to the plasma [1]. Following a period of training",
        "SuSI has been able to reach the magnetic field needed for operation in the high-B mode at 24 GHz. SuSI has several interesting features. First the axial magnetic profile is defined using 6 solenoids which provide some flexibility to adjust parameters such as field gradient at the resonance",
        "Bminimum or plasma length. Second with a diameter of only 101mm",
        "SuSI plasma chamber has a nominal volume of about 3.5 l. Therefore",
        "power density in excess of 2kW/l could be reach and lead potentially to new insight on the maximum performance achievable with an ECR. In January 2014",
        "a 10 kW 24 GHz Gyrotron obtained from the Russian company GYCOM was commissioned at MSU on a dummy load and then connected to SuSI. We report here on the first measurements done with SuSI at 24 GHz.",
        "* L.T. Sun",
        "J. Brandon",
        "D.G. Cole",
        "M. Doleans",
        "G. Machicoane",
        "D. Morris",
        "T. Ropponen",
        "L. Tobos.",
        "ECRIS 2010 ("
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/moommh03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/moommh03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/moommh03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-MOOMMH03",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:28:09"
}