{
  "session_info": {
    "id": "TUIBCC",
    "name": "TUIBCC - WG5.2 FEL Applications B",
    "url": "https://proceedings.jacow.org/erl2017/html/tuibcc.htm"
  },
  "papers": [
    {
      "paper_id": "TUIBCC001",
      "title": "Photon Science Exploitation of ALICE in Biomedical Science",
      "authors": [
        "STFC/DL/SRD",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "T. Craig",
        "P. Harrison",
        "J. Ingham",
        "M.R.F. Siggel-King",
        "C. Smith",
        "P. Weightman",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "ISM-CNR",
        "Rome",
        "Italy",
        "D.J. Dunning",
        "Y.M. Saveliev",
        "N. Thompson",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "P. Gardner",
        "M.J. Pilling",
        "MIB",
        "Manchester",
        "United Kingdom",
        "CNR-ISM",
        "Trieste",
        "Italy",
        "University of Liverpool",
        "Liverpool",
        "United Kingdom"
      ],
      "institutions": [
        "The UK has maintained an ambition to build a national FEL facility and this has been reinforced in a recent strategic review*. The Daresbury Laboratory is engaged in research and development programmes to ensure delivery of a high performance UK XFEL and is operating a number of research accelerators to support all aspects of FEL technology. ALICE is an ERL built to develop skills and experience in superconducting RF. It provides mid infrared and THz light from a cavity FEL and a CSR source respectively. From the very start of the ALICE programme a photon science exploitation activity was pursued. In the last few years all funding for ALICE was for biomedical exploitation by a consortium led by the University of Liverpool, which includes clinicians as well as scientists. In this paper we review the work, including investigating the effect of THz radiation on living cells and sub-diffraction chemical imaging of normal and cancerous human tissue by IR microscopy. The stringent demands of these experiments required substantial improvement on the performance of ALICE. Limitations of the current configuration are discussed and schemes for extending its capability are presented."
      ],
      "abstract": "* www.stfc.ac.uk/files/fel-report-2016/",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuibcc001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuibcc001.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuibcc001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUIBCC001",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUIBCC002",
      "title": "EUV ERLs for Semiconductor Integrated Circuit Lithography",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "Although the technologies on EUV Lithography are progressing based on laser-produced plasma (LPP) source",
        "which is expected to produce the EUV power of 250 W or more",
        "it is important to develop a new-type EUV source to meet future demand for higher power than 1 kW. Energy recovery linac(ERL) based free electron lasers(FEL) are possible candidates of a high-power EUV source that can distribute 1 kW class power to multiple scanners simultaneously. In order to demonstrate the feasibility of EUV ERLs for lithography",
        "an EUV source based on an 800 MeV ERL operating at the wavelength of 13.5 nm has been designed using available technologies without too much development and resources of the KEK cERL. In addition",
        "the EUV-FEL Light Source Study Group for Industrialization has been established in Japan to realize industrialization of such an ERL-EUV source and the related items. We will present recent progress of the EUV-ERL design work and some activities and considerations for the industrialization."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuibcc002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuibcc002.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuibcc002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUIBCC002",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUIBCC003",
      "title": "Applications for CBETA at Cornell",
      "authors": [
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "At Cornell",
        "a 4-turn ERL with FFAG return loop is being constructed by a collaboration of Cornell and BNL. It is designed to produce a high-current (up to 40mA) CW beam of moderate energy (150MEV). For after successful commissioning",
        "several applications of CBETA have been envisioned and are being analyzed",
        "these include (a) a dark-photon search",
        "(b) a Compton-Backscattering hard-x-ray source",
        "(c) a Terahertz FEL",
        "(d) a facility or ERL accelerator physics studies",
        "and (e) a test facility with CW beam to test",
        "for example",
        "SRF cryomodules for eRHIC or for industrial isotope production"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuibcc003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuibcc003.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuibcc003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUIBCC003",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUIBCC004",
      "title": "Applications by Means of the Accelerator Technologies Based on cERL",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "The cERL has been constructed for the test facility so as to demonstrate the ERL operation as the view point of the accelerator technologies. Therefore",
        "the application programs by using cERL are not the main purpose. However",
        "we have demonstrated several test productions such as laser Compton scattering X-ray production and THz radiation. Furthermore",
        "we have tried to draw several industrial applications such as EUV-FEL light source",
        "security systems for nuclear material based on gamma-ray production by means of laser Compton scattering",
        "high resolution medical x-ray imaging systems",
        "and so on. I will present these activities at the workshop."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2017/talks/tuibcc004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2017/papers/tuibcc004.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2017/posters/tuibcc004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2017-TUIBCC004",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:05:23"
}