{
  "session_info": {
    "id": "MOPHA",
    "name": "MOPHA - Posters",
    "url": "https://proceedings.jacow.org/icalepcs2019/html/mopha.htm"
  },
  "papers": [
    {
      "paper_id": "MOPHA001",
      "title": "Robotizing SOLEIL Beamlines to Improve Experiments Automation",
      "authors": [
        "Y.-M. Abiven",
        "T. Bucaille",
        "L. Chavas",
        "E. Elkaim",
        "P. Gourhant",
        "Y. Liatimi",
        "K. Medjoubi",
        "S. Pierre-Joseph Zéphir",
        "B. Pilliaud",
        "V. Pinty",
        "A. Somogyi",
        "F. Thiam",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "EFOR",
        "Levallois Perret",
        "France",
        "Beamlines can benefit from the implementation of industrial robots in several ways: minimization of dead time",
        "maximization of experimental throughput",
        "and limitation of human presence during experimentation. Furthermore",
        "the robots add flexibility in task management. The challenge for SOLEIL is to define a robotic standard",
        "on both hardware and software",
        "which is versatile enough to cover beamlines requirements",
        "while being easy to implement",
        "easy to use",
        "and to maintain in operation. This paper will present the process of defining such a standard at SOLEIL",
        "using 6 axis industrial robot arms. It will detail all aspects of this development",
        "from market studies up to technical constraints. The specifications of the robots are aimed at addressing the most common technical constraints of beamlines",
        "with a special care for mechanical properties. The robotic systems will be integrated into the Tango control system using a feature-based approach. This standard implementation is driven by two applications: picking and placing samples for powder diffraction on the CRISTAL beamline and positioning of a detector for x-rays coherent diffraction experiments on the NANOSCOPIUM beamline."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha001.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA001",
      "page_number": "183",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA002",
      "title": "A Model-Driven Service-Oriented Wizard-Based Multi-Target Development Kit for Supervision Systems",
      "authors": [
        "C.F. Afonso",
        "L. Casalegno",
        "S. Foglio",
        "S.G. Gioia",
        "M. Necchi",
        "M.G. Pullia",
        "S. Toncelli",
        "CNAO Foundation",
        "Pavia",
        "Italy",
        "Pavia University",
        "Biomedical Informatics Lab \"Mario Stefanelli\"",
        "Pavia",
        "Italy",
        "The Italian National Hadrontherapy Center (CNAO) is a particle treatment and research center equipped with a synchrotron accelerator. The configuration and support environment of CNAO’s control system",
        "originally designed in 2003",
        "is currently being upgraded to incorporate mobile devices. As part of the technological upgrade",
        "a product line architecture has been designed with intent to define application scope",
        "reusability of core assets",
        "and specification of variation points. Implementation and compliance with the product line architecture aims at reducing application’s development time",
        "improving reliability",
        "and aiding medical certification procedures. However",
        "definition and compliance with the architecture comes with considerable overhead development costs. In order to assist the development of new environment applications",
        "a visual wizard has been developed to create customized base applications. This paper presents the challenges encountered and description of the product line architecture for the upgraded configuration and support environment. Alongside",
        "we also describe the Wizard Generator",
        "currently implemented applications",
        "and planned application validation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha002.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA002",
      "page_number": "187",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA003",
      "title": "Integrating Mobile Devices Into CNAO’s Control System, a Web Service Approach to Device Communication",
      "authors": [
        "C.F. Afonso",
        "L. Casalegno",
        "S. Foglio",
        "S.G. Gioia",
        "M. Necchi",
        "S. Toncelli",
        "CNAO Foundation",
        "Pavia",
        "Italy",
        "Pavia University",
        "Biomedical Informatics Lab \"Mario Stefanelli\"",
        "Pavia",
        "Italy",
        "The Italian National Hadrontherapy Center (CNAO) is a cancer treatment center employing a synchrotron to accelerate charged particle beams. The configuration and support environment of CNAO’s control system is responsible for managing the repository",
        "configuring the control system",
        "as well as performing non-real time support operations. Applications in this environment interface with the relational repository",
        "remote file systems",
        "as well as lower level control system components. As part of the technological upgrade of the configuration and support environment",
        "CNAO plans to integrate mobile applications into the control system. In order to lay the groundwork for the new generation of applications",
        "new communication interfaces had to be designed. To achieve this",
        "a web services approach was taken",
        "with the objective of standardizing access to these resources. In this paper we describe in detail the update of the communication channels. Additionally",
        "several solutions to challenges encountered",
        "such as access management",
        "logging",
        "and interoperability",
        "are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha003.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA003",
      "page_number": "192",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA006",
      "title": "SwissFEL Undulator Control System",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "SwissFEL has successfully commissioned the Aramis beamline",
        "hard x-rays (2 - 12.4 KeV)",
        "and the Athos line",
        "soft x-rays (200 eV to 2 keV)",
        "will start commissioning in 2020. The Aramis undulator line is currently composed of 13 variable-gap in-vacuum undulators. The Athos line will be made of 16 APPLE II type undulators (Advanced Planar Polarized Light Emitter). Both beamlines have each undulator segment on a 5D mover system; they both also have phase shifters and movable quadrupole tables in between segments. PLCs and DeltaTau motor controllers are used to control motion",
        "for I/O interface",
        "and interlocks. EPICS IOCs communicate with the controllers and provide additional logic and some high level functionality. Further higher level functions are provided through Python scripts and other high level languages."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha006.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA006",
      "page_number": "197",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA007",
      "title": "Quality Assurance Plan for the SCADA System of the Cherenkov Telescope Array Observatory",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha007.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA008",
      "title": "LIPAc RFQ Control System Lessons Learned",
      "authors": [
        "L. Antoniazzi",
        "A. Baldo",
        "M.G. Giacchini",
        "M. Montis",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "F4E",
        "Germany",
        "Fusion for Energy",
        "Garching",
        "Germany",
        "The Linear IFMIF Prototype Accelerator (LIPAc)* Radio Frequency Quadrupole (RFQ) will accelerate a 130 mA deuteron beam up to 5 MeV in continuous wave. Proton beam commissioning of RFQ cavity",
        "together with Medium Energy Beam Transport Line (MEBT) and Diagnostics Plate",
        "is now ongoing to characterize the accelerator behavior**. The RFQ Local Control System (LCS) was designed following the project guideline. It was partially assembled and verified during the RFQ power test in Italy***. The final system configuration was pre-assembled and tested in Europe",
        "after that it was transferred to Japan",
        "where it was installed",
        "commissioned and integrated into LIPAc Central Control System (CCS) between November 2016 and July 2017",
        "when the RFQ Radio Frequency (RF) conditioning started****. Now the RFQ LCS has been running for 2 years. During this time",
        "especially in the initial period",
        "the system required several adjustments and modifications to its functionality and interface",
        "together with assistance and instructions to the operation team. This paper will try to collect useful lessons learned coming from this experience."
      ],
      "institutions": [],
      "abstract": "*http://www.ifmif.org  **LINAC 2018 -",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha008.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA008",
      "page_number": "200",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA009",
      "title": "Commissioning the Control System for Cryomodule Cryogenics Distribution System in Test Stand 2",
      "authors": [
        "E. Asensi Conejero",
        "M. Boros",
        "N. Elias",
        "J. Fydrych",
        "W. Hees",
        "P.L. van Velze",
        "ESS",
        "Lund",
        "Sweden",
        "IFJ-PAN",
        "Kraków",
        "Poland",
        "The European Spallation Source (ESS) is currently under construction in Lund",
        "Sweden. The superconducting section of the linear accelerator consists of three parts; 26 double-spoke cavities gathered in 13 cryomodules",
        "36 medium beta elliptical cavities gathered in 9 cryomodules and 84 high beta elliptical cavities gathered in 21 cryomodules. The cryomodules have to be tested in a dedicated test facility before installation in the ESS tunnel",
        "Test Stand 2 is dedicated to the tests of the medium beta and high beta elliptical cryomodules for the ESS linear accelerator. In this paper",
        "the authors present the commissioning of the PLC based control system for the cryogenic circuits in the elliptical cavities cryomodules. These circuits allow the circulation of gas Helium at 4.5 K and liquid Helium at 2 K to cool down the niobium cavities and reach the material superconducting state",
        "as well as to keep a thermal shield with gas Helium at 50 K. Cryogenic valves",
        "heaters and different sort of sensors need to be controlled and monitored to operate this system successfully from a Control Room using dedicated Operator Interfaces developed in CS-Studio and following the EPICS architecture."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha009.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA009",
      "page_number": "205",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA010",
      "title": "Automatic Beam Loss Threshold Selection for LHC Collimator Alignment",
      "authors": [
        "G. Azzopardi",
        "S. Redaelli",
        "B. Salvachua",
        "CERN",
        "Meyrin",
        "Switzerland",
        "A. Muscat",
        "G. Valentino",
        "University of Malta",
        "Information and Communication Technology",
        "Msida",
        "Malta",
        "The collimation system used in the Large Hadron Collider at CERN is positioned around the beam with a hierarchy that protects sensitive equipment from unavoidable beam losses. The collimator settings are determined using a beam-based alignment technique",
        "where collimator jaws are moved towards the beam until the beam losses exceed a predefined threshold. This threshold needs to be updated dynamically",
        "corresponding to the changes in the beam losses. The current method for aligning collimators is semi-automated requiring a collimation expert to monitor the loss signals and continuously select and update the threshold accordingly. The human element in this procedure is a major bottleneck for speeding up the alignment. This paper therefore proposes a method to fully automate this threshold selection. A data set was formed from previous alignment campaigns and analyzed to define an algorithm that produced results consistent with the user selections. In over 90% of the cases the difference between the two was negligible and the algorithm presented in this study was used for collimator alignments throughout 2018."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha010.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA010",
      "page_number": "208",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA011",
      "title": "Improving Gesture Recognition with Machine Learning: A Comparison of Traditional Machine Learning and Deep Learning",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "Meaningful gesturing is important for an intuitive human-machine communication. This paper deals with methods suitable for identifying different finger",
        "hand and head movements using supervised machine learning algorithms. On the one hand it discusses an implementation based on the k-nearest neighbor classification algorithm (traditional machine learning approach). On the other hand it demonstrates the classification potential of a convolutional neural network (deep learning approach). Both methods are capable of distinguishing between fast and slow",
        "short and long",
        "up and down",
        "or right and left linear as well as clockwise and counterclockwise circular movements. The details of the different methods with respect to recognition accuracy and performance will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha011.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA011",
      "page_number": "214",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA012",
      "title": "Interrupting a State Machine",
      "authors": [
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "At the ISIS Pulsed Neutron and Muon Source we talk to a variety of types of beamline systems for controlling the environment of samples under investigation. A state machine is an excellent way of controlling a system which has a finite number of states",
        "a predetermined set of transitions",
        "and known events for initiating a transition. But what happens when you want to interrupt that flow? An excellent example of this kind of system could be a field ramp for a magnet",
        "this will start in a \"stable\" state",
        "the \"ramp to target field\" event will occur",
        "and it will transition into a state of \"ramping\". When the field is at the target value",
        "it returns to a \"stable\" state. Depending on the ramp rate and difference between the current field and the target field this process could take a long time. If you put the wrong field value in",
        "or something else happens external to the state machine",
        "you may want to pause or abort the system whilst it is running. You will want to interrupt the flow through the states. This presentation will detail a solution for such an interruptible system within the EPICS framework."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha012.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA012",
      "page_number": "219",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA014",
      "title": "Building and Packaging EPICS Modules With Conda",
      "authors": [
        "B. Bertrand",
        "A. Harrisson",
        "ESS",
        "Lund",
        "Sweden",
        "Conda is an open source package",
        "dependency and environment management system. It runs on Windows",
        "macOS and Linux and can package and distribute software for any language (Python",
        "R",
        "Ruby",
        "C/C++…). It allows one to build a software in a clean and repeatable way. EPICS is made of many different modules that need to be compiled together. Conda makes it easy to define and track dependencies between EPICS base and the different modules (and their versions). Anaconda’s new compilers allow conda to build binaries that can run on any modern linux distribution (x8664). Not relying on any specific OS packages removes issues that can arise when upgrading the OS. At ESS",
        "conda packages are built using gitlab-ci and pushed to a local channel on our Artifactory server. Using conda makes it easy for the users to install the EPICS modules they want",
        "where they want (locally on a machine",
        "in a docker container for testing…). All dependencies and requirements are handled by conda. Conda environments make it possible to work on different versions on the same machine without any conflict."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha014.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA014",
      "page_number": "223",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA015",
      "title": "Reverse Engineering the Amplifier Slab Tool at the National Ignition Facility",
      "authors": [
        "A. Bhasker",
        "R.D. Clark",
        "J.E. Dorham",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "This paper discusses the challenges and steps required to convert a stand-alone legacy Microsoft Access-based application",
        "in the absence of original requirements",
        "to a web-based application with an Oracle backend and Oracle Application Express/JavaScript/JQuery frontend. The Amplifier Slab Selection (ASL) Tool provides a means to manage and track Amplifier Slabs on National Ignition Facility (NIF) beamlines. ASL generates simulations and parameter visualization charts of seated Amplifier Slabs as well as available replacement candidates to help optics designers make beamline configuration decisions. The migration process",
        "undertaken by the NIF Shot Data Systems (SDS) team at Lawrence Livermore National Laboratory (LLNL)",
        "included reverse-engineering functional requirements due to evolving processes and changing NIF usage patterns."
      ],
      "institutions": [
        "Funding: This work performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha015.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA015",
      "page_number": "228",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA016",
      "title": "use link to see paper's listing under its alternate paper code",
      "authors": [
        "W.A.H. Rogers",
        "T.J.R. Nicholls",
        "A.A. Wilsonpresenter",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Virtual accelerators are used for testing control system software against realistic accelerator simulations. Previous virtual accelerators for synchrotron light sources have used Tracy* ** and Elegant*** **** as the simulator",
        "but without Python bindings for accelerator simulations it has been difficult to create a virtual accelerator using Python. With the development of Python Accelerator Toolbox (pyAT)*****",
        "that is now possible. This paper describes the combination of pyAT",
        "Python Toolkit for Accelerator Controls (Pytac) and pythonSoftIoc to create an EPICS-based virtual accelerator for Diamond Light Source."
      ],
      "institutions": [],
      "abstract": "*TRACY-2 Documentation  **The DLS Control System  ***elegant: A Code for Accelerator Simulation  ****A Virtual Accelerator in the Tango Control System *****pyAT: Python Accelerator Toolbox",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha016.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA017",
      "title": "pyAT, Pytac and pythonSoftIoc: a Pure Python Virtual Accelerator",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha017.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA017",
      "page_number": "232",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA018",
      "title": "An EPICS Channel Access Implementation on Siemens PLCs",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha018.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA019",
      "title": "Upgrade of the Control System for the LHC High Level RF",
      "authors": [
        "Y. Brischetto",
        "L. Arnaudon",
        "V. Costa",
        "D.C. Glenat",
        "D. Landré",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The acceleration of particles in CERN’s Large Hadron Collider (LHC) is carried out by sixteen superconducting radiofrequency (RF) cavities. Their remote control is taken care of by a complex system which involves heterogeneous equipment and interfaces with a number of different subsystems",
        "such as high voltage power converters",
        "cryogenics",
        "vacuum and access control interlocks. In view of the renovations of the CERN control system planned for the Long Shutdown 2 (LS2)",
        "the control software for the RF system recently underwent a complete bottom-up refactoring",
        "in order to dispose of obsolete software and ensure the operation of the system in the long term. The upgraded software has been deployed one year before LS2",
        "and allowed successful operation of the machine. This paper describes the strategy followed in order to commission the system and to guarantee LHC nominal operation after LS2."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha019.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA019",
      "page_number": "236",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA022",
      "title": "Implementation of ISO 50001 Energy Management System With the Advantage of Archive Viewer in NSRRC",
      "authors": [
        "C.S. Chen",
        "W.S. Chan",
        "Y.Y. Cheng",
        "Y.F. Chiu",
        "Y.-C. Chung",
        "K.C. Kuo",
        "M.T. Lee",
        "Y.-C. Lin",
        "C.Y. Liu",
        "Z.-D. Tsai",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Due to the limited energy resources in Taiwan",
        "energy conservation is always a big issue for everyone who lives in this country. According to the data from the related departments",
        "nearly 98% of energy is imported from abroad for more than a decade. Despite the strong dependency on foreign fuel imports",
        "the energy subsidy policy leads to a relatively low cost of energy for end users",
        "while it is not reasonable. In order to resolve the energy resource shortage and pursue a more efficient energy use",
        "the implementation of ISO 50001 energy management system is activated with the advantage of the Archive Viewer in NSRRC this year. The energy management system will build up a overall energy usage model and several energy performance indicators to help us achieve efficient energy usage."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha022.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA022",
      "page_number": "239",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA023",
      "title": "Applications of an EPICS Embedded and Credit-card Sized Waveform Acquisition",
      "authors": [
        "Y.-S. Cheng",
        "K.T. Hsu",
        "K.H. Hu",
        "D. Lee",
        "C.Y. Liao",
        "C.Y. Wu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "To eliminate long distance cabling for improving signal quality",
        "the remote waveform access supports have been developed for the TPS (Taiwan Photon Source) and TLS (Taiwan Light Source) control systems for routine operation. The previous mechanism was that a dedicated EPICS IOC has been used to communicate with the present Ethernet-based oscilloscopes to acquire each waveform data. To obtain higher reliability operation and low power consumption",
        "the FPGA and SoC (System-on-Chip) based waveform acquisition which embedded an EPICS IOC has been adopted to capture the waveform signals and process to the EPICS PVs (Process Variables). According to specific purposes use",
        "the different graphical applications have been designed and integrated into the existing operation interfaces. These are convenient to observe waveform status and to analyse the caught data on the control consoles. The efforts are described at this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha023.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA023",
      "page_number": "242",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA026",
      "title": "Development of an Online Diagnostic Toolkit for the UPC Control System",
      "authors": [
        "H.Z. Chen",
        "Y.-S. Chengpresenter",
        "K.T. Hsu",
        "K.H. Hu",
        "C.Y. Liao",
        "C.Y. Wu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Most IOC (Input Output Controller) platforms and servers at the TPS control system have been connected to uninterruptible power supplies (UPS) to prevent short downtime of the mains electricity. To accomplish higher availability",
        "it is necessary to maintain batteries and circuits for the UPS system periodically. Thus",
        "an online diagnostic toolkit had to be developed to monitor the status of the UPS system and to notify which abnormal components should be replaced. One dedicated EPICS IOC has been implemented to communicate with each UPS device via SNMP. The PV states of the UPS system are published and archived and specific graphical applications are designed to show the existing control environment via EPICS CA (Channel Access). This paper reports the development of an online diagnostic toolkit for the UPS System."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha026.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA026",
      "page_number": "246",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA027",
      "title": "use link to see paper's listing under its alternate paper code",
      "authors": [
        "C.P. Chu",
        "D.P. Jin",
        "G. Lei",
        "G. Li",
        "C.H. Wang",
        "G.L. Xu",
        "L.X. Zhu",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "A 6 GeV high energy synchrotron radiation light source is being built near Beijing",
        "China. The accelerator part contains a linac",
        "a booster and a 1360 m circumference storage ring",
        "and fourteen production beamlines for phase one. The control systems are EPICS based with integrated application and data platforms for the accelerators and beamlines. The number of devices and the complexity level of operation for such a machine is extremely high",
        "therefore",
        "a modern system design is vital for efficient operation of the machine. This paper reports the design",
        "preliminary development and planned near-future work",
        "especially the databases for quality assurance and application software platforms for high level applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha027.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA028",
      "title": "High Energy Photon Source Control System Design",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha028.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA028",
      "page_number": "249",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA029",
      "title": "FORS-Up: An Upgrade of the",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha029.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA030",
      "title": "An Upgrade of the HARPS-N Spectrograph Autoguider at TNG",
      "authors": [
        "R. Cirami",
        "I. Coretti",
        "P. Di Marcantonio",
        "INAF-OAT",
        "Trieste",
        "Italy",
        "F. Alesina",
        "N. Buchschacher",
        "F. Pepe",
        "Université de Genève",
        "Observatoire Astronomique",
        "Versoix",
        "Switzerland",
        "HARPS-N is a high-precision radial-velocity spectrograph installed on the INAF TNG in the island of La Palma",
        "Canary Islands. The HARPS-N project is a collaboration among several institutes lead by the Astronomical Observatory of the University of Geneva. The HARPS-N control software is composed by the Sequencer",
        "which coordinates the scientific observations and by a series of modules implemented in LabVIEW for the control of the instrument front end",
        "calibration unit and autoguider. The autoguider is the subsystem in charge of maintaining the target centered on the spectrograph fiber. It acquires target images at high frequency with a technical CDD and with the help of dedicated algorithms keeps the target centered on the fiber through a piezo tip-tilt stage. Exploiting the expertise acquired with the autoguiding system of the ESPRESSO spectrograph installed at the ESO VLT",
        "a collaboration has been setup between the HARPS-N Consortium and the INAF - Astronomical Observatory of Trieste for the design and implementation of a new autoguider for HARPS-N. This paper describes the design",
        "implementation and installation phases of the new autoguider system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha030.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA030",
      "page_number": "258",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA031",
      "title": "Software and Hardware Design for Controls Infrastructure at Sirius Light Source",
      "authors": [
        "J.G.R.S. Franco",
        "C.F. Carneiro",
        "E.P. Coelho",
        "R.C. Ito",
        "P.H. Nallinpresenter",
        "R.W. Polli",
        "A.R.D. Rodrigues",
        "V. dos Santos Pereira",
        "LNLS",
        "Campinas",
        "Brazil",
        "Sirius is a 3 GeV synchrotron light source under construction in Brazil. Assembly of its accelerators began on March 2018",
        "when the first parts of the linear accelerator were taken out of their boxes and installed. The booster synchrotron installation has already been completed and its subsystems are currently under commissioning",
        "while assembly of storage ring components takes place in parallel. The Control System of Sirius accelerators",
        "based on EPICS",
        "plays an important role in the machine commissioning",
        "and installations and improvements have been continuously achieved. This work describes all the IT infrastructure underlying the control system",
        "hardware developments",
        "software architecture",
        "and support applications. Future plans are also presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha031.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA031",
      "page_number": "263",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA032",
      "title": "Big Data Architectures for Logging and Monitoring Large Scale Telescope Arrays",
      "authors": [
        "A. Costa",
        "U. Becciani",
        "P. Bruno",
        "A.S. Calanducci",
        "A. Grillo",
        "S. Riggi",
        "E. Sciacca",
        "F. Vitello",
        "INAF-OACT",
        "Catania",
        "Italy",
        "V. Conforti",
        "F. Gianotti",
        "INAF",
        "Bologna",
        "Italy",
        "INAF-Osservatorio Astronomico di Brera",
        "Merate",
        "Italy",
        "Università degli di Perugia",
        "Perugia",
        "Italy",
        "Large volumes of technical and logging data result from the operation of large scale astrophysical infrastructures. In the last few years several \"Big Data\" technologies have been developed to deal with a huge amount of data",
        "e.g. in the Internet of Things (IoT) framework. We are comparing different stacks of Big Data/IoT architectures including high performance distributed messaging systems",
        "time series databases",
        "streaming systems",
        "interactive data visualization. The main aim is to classify these technologies based on a set of use cases typically related to the data produced in the astronomical environment",
        "with the objective to have a system that can be updated",
        "maintained and customized with a minimal programming effort. We present the preliminary results obtained",
        "using different Big Data stack solution to manage some use cases related to quasi real-time collection",
        "processing and storage of the technical data",
        "logging and technical alert produced by the array of nine ASTRI telescopes that are under development by INAF as a pathfinder array for the Cherenkov astronomy in the TeV energy range."
      ],
      "institutions": [
        "Funding: This work was partially supported by the ASTRI \"Flagship Project\" financed by the Italian Ministry of Education, University, and Research and led by the Italian National Institute of Astrophysics."
      ],
      "abstract": "*ASTRI Project: http://www.brera.inaf.it/~astri/wordpress/ **CTA Project: https://www.cta-observatory.org/",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha032.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA032",
      "page_number": "268",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA033",
      "title": "Timing, Synchronization and Software-Generated Beam Control at FRIB",
      "authors": [
        "E. Daykin",
        "M.G. Konrad",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The Facility for Rare Isotope Beams",
        "once completed",
        "will require hundreds of devices throughout the machine to operate using synchronized timestamps and triggering events. These include",
        "but are not limited to fault timestamps",
        "time-dependent diagnostic measurements and complex beam pulse patterns. To achieve this design goal",
        "we utilize a timing network using off-the-shelf hardware from Micro Research Finland. A GPS time base is also utilized to provide client timestamping synchronization via NTP/PTP. We describe our methods for software-generated event and beam pulse patterns",
        "performance of installed equipment against project requirements",
        "integration with other systems and challenges encountered during development."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha033.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA033",
      "page_number": "272",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA034",
      "title": "Software Architecture for Next Generation Beam Position Monitors at Fermilab",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha034.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA034",
      "page_number": "275",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA038",
      "title": "A Cloud Based Framework for Advanced Accelerator Controls",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha038.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA039",
      "title": "Slow Control Systems at BM@N and MPD/NICA Detector Experiments",
      "authors": [
        "D. Egorov",
        "V.B. Shutov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "P.V. Chumakov",
        "R.V. Nagdasev",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "NICA (Nuclotron-based Ion Collider fAcility) is a new accelerator complex designed at the Joint Institute for Nuclear Research (Dubna",
        "Russia) to study properties of dense baryonic matter. BM@N (Baryonic Matter at Nuclotron) is the first experiment at the complex. It is an experimental setup in the fixed-target hall of the Nuclotron to perform a research program focused on the production of strange matter in heavy-ion collisions. MPD (Multipurpose Detector) is a detector for colliding beam experiments at the complex",
        "and it is being developed to provide: efficient registration of the particles produced by heavy ion collisions; identification of particle type",
        "charge and energy; reconstruction of vertices of primary interactions and the position of secondary particle production. Existing Slow Control Systems for BM@N experiment",
        "assembling",
        "and testing zones of MPD detectors are based on Tango Controls. They provide monitoring and control of diverse hardware for efficient data taking",
        "stable operation of detectors and quality control of assembled modules. Current status and developments as well as future design and plans for MPD Slow Control System will be reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha039.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA039",
      "page_number": "278",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA040",
      "title": "Beam Position Feedback System Supported by Karabo at European XFEL",
      "authors": [
        "V. Bondar",
        "M. Beg",
        "M. Bergemann",
        "S. Brockhauser",
        "C. Carinan",
        "R. Costa",
        "F. Dall’Antonia",
        "C. Danilevski",
        "W. Ehsanpresenter",
        "S.G. Esenov",
        "R. Fabbri",
        "H. Fangohr",
        "G. Flucke",
        "D. Fulla Marsa",
        "A. Galler",
        "G. Giovanetti",
        "D. Goeries",
        "J. Grünert",
        "S. Hauf",
        "D.G. Hickin",
        "T. Jarosiewicz",
        "E. Kamil",
        "Y. Kirienko",
        "A. Klimovskaia",
        "T.A. Kluyver",
        "D. Mamchyk",
        "T. Michelat",
        "I. Mohacsi",
        "A. Parenti",
        "D.B. Rück",
        "H. Santos",
        "R. Schaffer",
        "A. Silenzi",
        "C. Youngman",
        "P. Zalden",
        "J. Zhu",
        "EuXFEL",
        "Schenefeld",
        "Germany",
        "BRC",
        "Szeged",
        "Hungary",
        "University of Southampton",
        "Southampton",
        "United Kingdom",
        "The XrayFeed device of Karabo [1",
        "2] is designed to provide spatial X-ray beam stability in terms of drift compensation utilizing different diagnostic components at the European XFEL (EuXFEL). Our feedback systems proved to be indispensable in cutting-edge pump-probe experiments at EuXFEL. The feedback mechanism is based on a closed loop PID control algorithm [3] to steer the beam position measured by a so-called diagnostic devices to the desired centered position via defined actuator adjusting the alignment of X-ray optical elements",
        "in our case a flat X-ray mirror system. Several diagnostic devices and actuators can be selected according to the specific experimental area where a beam position feedback is needed. In this contribution",
        "we analyze the improvement of pointing stability of X-rays using different diagnostic devices as an input source for our feedback system. Different types of photon diagnostic devices such as gas-based X-ray monitors [4]",
        "quadrant detectors based on avalanche photo diodes [5] and optical cameras imaging the X-ray footprint on scintillator screens have been evaluated in our pointing stability studies."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha040.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA040",
      "page_number": "281",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA041",
      "title": "Cause-and-Effect Matrix Specifications for Safety Critical Systems at CERN",
      "authors": [
        "B. Fernández Adiego",
        "E. Blanco Viñuela",
        "M. Charrondiere",
        "R. Speroni",
        "CERN",
        "Geneva",
        "Switzerland",
        "M. Bonet",
        "H.D. Hamisch",
        "M.H. de Queiroz",
        "UFSC",
        "Florianópolis",
        "Brazil",
        "One of the most critical phases in the development of a Safety Instrumented System (SIS) is the functional specification of the Safety Instrumented Functions (SIFs). This step is carried out by a multidisciplinary team of process",
        "controls and safety experts. This functional specification must be simple",
        "unambiguous and compact to allow capturing the requirements from the risk analysis",
        "and facilitating the design",
        "implementation and verification of the SIFs. The Cause and Effect Matrix (CEM) formalism provides a visual representation of Boolean expressions. This makes it adequate to specify stateless logic",
        "such as the safety interlock logic of a SIS. At CERN",
        "a methodology based on the CEM has been applied to the development of a SIS for a magnet test bench facility. This paper shows the applicability of this methodology in a real magnet test bench and presents its impact in the different phases of the IEC 61511 safety lifecycle."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha041.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA041",
      "page_number": "285",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA042",
      "title": "Evaluating VISTA and EPICS With Regard to Future Control Systems Development at ISIS",
      "authors": [
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The ISIS Muon and Neutron Source has been in operation for more than 30 years and has already seen one complete replacement of its controls system software. Currently ISIS uses the Vista controls system suite of software. I present our work in implementing a new EPICS control system for our Front End Test Stand (FETS) currently running VISTA. This new EPICS system is being used to evaluate a possible migration from Vista to EPICS at a larger scale in ISIS. I present my experience in the initial implementation of EPICS",
        "considerations on using a phased transition during which the two systems are run in parallel",
        "and our future plans with regard to developing control systems in an established decades-old accelerator with heterogeneous systems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha042.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA042",
      "page_number": "291",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA043",
      "title": "Accelerator Control Data Mining with WEKA",
      "authors": [
        "W. Fu",
        "K.A. Brown",
        "T. D’Ottavio",
        "P.S. Dyer",
        "S. Nemesure",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "Accelerator control systems generates and stores many time-series data related to the performance of an accelerator and its support systems. Many of these time series data have detectable change trends and patterns. Being able to timely detect and recognize these data change trends and patterns",
        "analyse and predict the future data changes can provide intelligent ways to improve the controls system with proactive feedback/forward actions. With the help of advanced data mining and machine learning technology",
        "these types of analyses become easier to produce. As machine learning technology matures with the inclusion of powerful model algorithms",
        "data processing tools",
        "and visualization libraries in different programming languages (e.g. Python",
        "R",
        "Java",
        "etc)",
        "it becomes relatively easy for developers to learn and apply machine learning technology to online accelerator control system data. This paper explores time series data analysis and forecasting in the Relativistic Heavy Ion Collider (RHIC) control systems with the Waikato Environment for Knowledge Analysis (WEKA) system and its Java data mining APIs."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha043.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA043",
      "page_number": "293",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA044",
      "title": "Development of Ethernet Based Real-Time Applications in Linux Using DPDK",
      "authors": [
        "G. Gaio",
        "G. Scalamera",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "In the last decade Ethernet has become the most popular way to interface hardware devices and instruments to the control system. Lower cost per connection",
        "reuse of existing network infrastructures",
        "very high data rates",
        "good noise rejection over long cables and finally an easier maintainability of the software in the long term are the main reasons of its success. In addition",
        "the need of low latency systems of the High Frequency Trading community has boosted the development of new strategies",
        "such as CPU isolation",
        "to run real-time applications in plain Linux with a determinism of the order of microseconds. DPDK (Data Plane Development Kit)",
        "an open source software solution mainly sponsored by Intel",
        "addresses the request of high determinism over Ethernet by bypassing the network stack of Linux and providing a more friendly framework to develop tasks which are even able to saturate a 100 Gbit connection. Benchmarks regarding the real-time performance and preliminary results of employing DPDK in the acquisition of beam position monitors for the fast orbit feedback of the Elettra storage ring will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha044.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA044",
      "page_number": "297",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA045",
      "title": "A New Simulation Stucture to Improve Software Dependability in Collider-Accelerator Control Systems",
      "authors": [
        "Y. Gao",
        "T.G. Robertazzi",
        "Stony Brook University",
        "Stony Brook",
        "New York",
        "USA",
        "K.A. Brown",
        "J. Morris",
        "R.H. Olsen",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "In this work",
        "we propose a new simulation framework aiming to improve the robustness of the control system. It focuses on enhancing the reliability of controls ADO codes by running user-customized testing. The new simulation architecture has two independent parts; together they cover a large amount of ADOs frequently used by developers. The first part of the simulation framework focuses on testing ADOs with GPIB connections to devices. It consists of several function blocks and has a switch mechanism which enables users to conveniently turn on and off the simulation mode without changing the ADO codes. Moreover",
        "it contains a special module which automates testing on ADO codes. Testing results are summarized and presented to users for codes analysis. The second part of the framework adopts a totally different structure. It simulates a different type of interface. Specifically",
        "it focuses on testing ADOs with Ethernet connections to devices. It is based on a powerful networking engine called Twisted",
        "which is an event-driven network programming framework developed by the Twisted Matrix Labs. The simulation framework can handle multiple types of devices at the same time."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha045.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA045",
      "page_number": "301",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA046",
      "title": "A New Simulation Timing System for Software Testing in Collider-Accelerator Control Systems",
      "authors": [
        "Y. Gao",
        "T.G. Robertazzi",
        "Stony Brook University",
        "Stony Brook",
        "New York",
        "USA",
        "K.A. Brown",
        "M. Harvey",
        "J. Morris",
        "R.H. Olsen",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "Particle accelerators need a timing mechanism to properly accelerate the beam from its source to its destination. The synchronization among accelerator devices is important",
        "which is accomplished by a distribution of timing signals. Devices which require their times synchronized to the acceleration cycle are connected to timelines. Timing signals are sent out along the timelines in the form of digital codes. Correspondingly",
        "devices in the complex are equipped with timeline decoders",
        "which allow devices to extract timing signals appropriately. In this work",
        "a new simulation architecture is introduced which can generate user-specific timing events for software testing in the control systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha046.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA046",
      "page_number": "307",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA047",
      "title": "CERN Secondary Beamlines Software Migration Project",
      "authors": [
        "A. Gerbershagen",
        "D. Banerjee",
        "J. Bernhard",
        "M. Brugger",
        "N. Charitonidis",
        "L. Gatignon",
        "E. Montbarbon",
        "B. Rae",
        "M.S. Rosenthal",
        "M.W.U. Van Dijk",
        "CERN",
        "Meyrin",
        "Switzerland",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "Technion",
        "Haifa",
        "Israel",
        "The Experimental Areas group of the CERN Engineering department operates a number of beamlines for the fixed target experiments",
        "irradiation facilities and test beams. The software currently used for the simulation of the beamline layout (BEATCH)",
        "beam optics (TRANSPORT)",
        "particle tracking (TURTLE) and muon halo calculation (HALO) has been developed in FORTRAN in the 1980s and requires an update in order to ensure long-term continuity. The ongoing Software Migration Project transfers the beamline description to a set of newer commonly used software codes",
        "such as MADX",
        "FLUKA",
        "G4Beamline",
        "BDSIM etc. This contribution summarizes the goals and the scope of the project. It discusses the implementation of the beamlines in the new codes",
        "their integration into the CERN layout database and the interfaces to the software codes used by other CERN groups. This includes the CERN secondary beamlines control system CESAR",
        "which is used for the readout of the beam diagnostics and control of the beam via setting of the magnets",
        "collimators",
        "filters etc. The proposed interface is designed to allow a comparison between the measured beam parameters and the ones calculated with beam optics software."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha047.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA047",
      "page_number": "312",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA048",
      "title": "The IRRAD Data Manager (IDM)",
      "authors": [
        "B. Gkotse",
        "G. Pezzullo",
        "F. Ravotti",
        "CERN",
        "Meyrin",
        "Switzerland",
        "B. Gkotse",
        "P. Jouvelot",
        "MINES ParisTech",
        "PSL Research University",
        "Paris",
        "France",
        "The Proton Irradiation Facility (IRRAD) is a reference facility at CERN for characterizing detectors and other accelerator components against radiation. To ensure reliable facility operations and smooth experimental data handling",
        "a new IRRAD Data Manager (IDM) web application has been developed and first used during the last facility run before the CERN Long Shutdown 2. Following best practices in User Experience design",
        "IDM provides a user-friendly interface that allows both users to handle their samples’ data and the facility operators to manage and coordinate the experiments more efficiently. Based on the latest web technologies such as Django",
        "JQuery and Semantic UI",
        "IDM is characterized by its minimalistic design and functional robustness. In this paper",
        "we present the key features of IDM",
        "our design choices and its overall software architecture. Moreover",
        "we discuss scalability and portability opportunities for IDM in order to cope with the requirements of other irradiation facilities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha048.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA048",
      "page_number": "318",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA049",
      "title": "Test-bench Design for New Beam Instrumentation Electronics at CERN",
      "authors": [
        "M. Gonzalez-Berges",
        "J.O. Robinson",
        "M. Saccani",
        "V. Schramm",
        "M.A. Stachon",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The Beam Instrumentation group has designed a new general-purpose VME acquisition board that will serve as the basis for the design of new instruments and will be used in the renovation of existing systems in the future. Around 1200 boards have been produced. They underwent validation",
        "environmental stress screening and run-in tests to ensure their performance and long term reliability. This allowed to identify potential issues at an early stage and mitigate them",
        "minimizing future interventions and downtime. A dedicated test-bench was designed to drive the tests and continuously monitor the board functionality. One board has more than 45 functions including memories",
        "high speed serial links and a variety of diagnostics. The test-bench was fully integrated with the CERN asset management system to allow lifecycle management from the initial production phase. The data captured during these tests was stored and analyzed regularly to find sources of failures. This was the first time that such a complete test-bench has been used. This paper presents all the details of the test-bench design and implementation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha049.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA049",
      "page_number": "323",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA050",
      "title": "Towards Improved Accessibility of the Tango Controls",
      "authors": [
        "P.P. Goryl",
        "M. Liszcz",
        "S2Innovation",
        "Kraków",
        "Poland",
        "R. Bourtembourg",
        "A. Götz",
        "ESRF",
        "Grenoble",
        "France",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "Tango Controls is successfully applied at more than 40 scientific institutions and industrial projects. These institutions do not only use the software but also actively participates to its development. The Tango Community raised several projects and activities to support collaboration as well as to make Tango Controls being easier to start with. Some of the projects are led by S2Innovation. These projects are: gathering and unifying of Tango Controls documentation",
        "providing a device classes catalogue and preparation of a so-called TangoBox virtual machine. Status of the projects will be presented as well as their impact on the Tango Controls collaboration."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha050.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA050",
      "page_number": "328",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA051",
      "title": "Towards Specification of Tango V10",
      "authors": [
        "P.P. Goryl",
        "M. Liszcz",
        "S2Innovation",
        "Kraków",
        "Poland",
        "ESRF",
        "Grenoble",
        "France",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "More than 40 laboratories use Tango Controls as a framework for their control systems. During its 18 years of existence",
        "Tango Controls has evolved and matured. The latest 9.3.3 release is regarded as the most stable and feature-reach version of the framework. However",
        "it makes use of already outdated CORBA technology which impacts all the stack",
        "from the low-level transport protocol up to the client API and tools. The Tango Community decided to move forward and is preparing for so-called Tango Controls v10. Tango v10 is meant to be more a new implementation of the framework than a release of new features. The new implementation shall make the code easier to maintain and extend as well as remove legacy technologies. At the same time",
        "it shall keep the Tango Controls objective philosophy and allows the new implementation to coexist with the old one at the same laboratory. The first step in the process is to provide a formal specification of current concepts and protocol. This specification will be base for the development and verification of new source code. Formal specification of Tango Controls and its purpose will be presented along with used tools and methodologies."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha051.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA051",
      "page_number": "331",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA052",
      "title": "Evolution Based on MicroTCA and MRF Timing System",
      "authors": [
        "F. Gougnaud",
        "P. Bargueden",
        "J.F. Denis",
        "A. Gaget",
        "P. Guiho",
        "T.J. Joannem",
        "A. Lotode",
        "Y. Lussignol",
        "Y. Mariette",
        "V. Nadot",
        "N. Solenne",
        "CEA-DRF-IRFU",
        "France",
        "Q. Bertrand",
        "G. Ferrand",
        "F. Gohier",
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "I. Hoffman Moran",
        "E. Reinfeld",
        "I. Shmuely",
        "Soreq NRC",
        "Yavne",
        "Israel"
      ],
      "institutions": [
        "For many years our Institute CEA IRFU has had a sound experience in VME and EPICS. For the accelerator projects"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha052.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA052",
      "page_number": "334",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA053",
      "title": "Status of Control and Synchronization Systems Development at Institute of Electronic Systems",
      "authors": [
        "M.G. Grzegrzółka",
        "A. Abramowicz",
        "A. Ciszewska",
        "K. Czuba",
        "B. Gąsowski",
        "P.K. Jatczak",
        "M. Kalisiak",
        "T. Lesniak",
        "M. Lipinski",
        "T. Owczarek",
        "R. Papis",
        "I. Rutkowski",
        "K. Sapór",
        "M. Sawicka",
        "D. Sikora",
        "M. Urbański",
        "Ł. Zembala",
        "M. Żukociński",
        "Warsaw University of Technology",
        "Institute of Electronic Systems",
        "Warsaw",
        "Poland",
        "Institute of Electronic Systems (ISE) at Warsaw University of Technology designs",
        "builds and installs control and synchronization systems for several accelerator facilities. In recent years ISE together with the Deutsches Elektronen-Synchrotron (DESY) team created the RF synchronization system for the European XFEL in Hamburg. ISE is a key partner in several other projects for DESY flagship facilities. The group participated in development of the MTCA.4 standard and designed a family of components for the MTCA.4-based LLRF control system. Currently",
        "ISE contributes to the development of the Master Oscillators for XFEL and FLASH",
        "and phase reference distribution system for SINBAD. Since 2016 ISE is an in-kind partner for the European Spallation Source (ESS)",
        "working on the phase reference line for the ESS linac",
        "components for 704.42 MHz LLRF control system",
        "including a MTCA.4-based LO signal generation module and the Cavity Simulator. In 2019 ISE became one of the co-founders of the Polish Free-Electron Laser (PolFel) located in the National Centre for Nuclear Research in Świerk. The overview of the recent projects for large physics experiments ongoing at ISE is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha053.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA053",
      "page_number": "338",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA058",
      "title": "Lua-Language-Based Data Acquisition Processing EPICS Subscription Filters",
      "authors": [
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "A previous paper described an upgrade to EPICS enabling client side tools at LANSCE to receive subscription updates filtered selectively to match a logical configuration of LANSCE beam gates",
        "as specified dynamically by control room application programs. This update paper will examine evolving enhancements enabling Lua-language based data acquisition processing subscription update filters",
        "specified by snippets of Lua-language source-code embedded within the EPICS channel-name’s postfix. We will discuss the generalized utility of this approach across a wide range of data acquisition applications",
        "projects",
        "and platforms; the performance and robustness of our production implementation; and our operational experience with the software at LANSCE."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha058.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA058",
      "page_number": "342",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA059",
      "title": "Ultra-High Precision Timing System for the CEA-Laser Megajoule",
      "authors": [
        "S. Hocquet",
        "N. Bazoge",
        "Ph. Hours",
        "D. Monnier-Bourdin",
        "Greenfield Technology",
        "Massy",
        "France",
        "T. Falgon",
        "T. Somerlinck",
        "CEA",
        "LE BARP cedex",
        "France",
        "High power laser such as the Laser MegaJoule (LMJ) or National Ignition Facility (NIF) requires different types of trigger precision to synchronize all the laser beams",
        "plasma diagnostics and generate fiducials. Greenfield Technology",
        "which designs and produces picosecond delay generator and timing system for about 20 years",
        "has been hired by CEA to develop new products to meet the LMJ requirements. About 2000 triggers are about to be set to control and synchronize all of the 176 laser beams on the target with a precision better than 40 ps RMS. Among these triggers",
        "Greenfield Technology’s GFT1012 is a 4-channels delay generator challenging ultra-high performances: an ultra-low jitter between 2 slaves below 4 ps RMS and a peak-to-peak wander over 1 week lower than 6 ps due to a thermal control of the most sensitive part (the thermal drift is below 1 ps/°C) and specific developments for clock management and restitution. On going investigation should bring the jitter close to 2 ps RMS between 2 slaves."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha059.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA059",
      "page_number": "347",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA062",
      "title": "The Personnel Safety System of ELI-ALPS",
      "authors": [
        "F. Horvath",
        "L.J. Fuloppresenter",
        "Sz. Horváth",
        "Z. Héjja",
        "T. Kecskés",
        "I. Kiss",
        "V. Kurusa",
        "G. Kávai",
        "K. Untener",
        "ELI-ALPS",
        "Szeged",
        "Hungary",
        "ELI-ALPS will be the first large-scale attosecond facility accessible to the international scientific community and its user groups. The facility-wide Personnel Safety System (PSS) has been successfully developed and commissioned for the majority of the laboratories. The system has three major goals. First",
        "it provides safe and automatic sensing and interlocking engineering measures as well as monitoring and controlling interfaces for all laboratories in Building A: emergency stop buttons",
        "interlock and enabling signals",
        "door and roller blind sensors",
        "and entrance control. Second",
        "it integrates and monitors the research technology equipment delivered by external parties as black-box systems (all laser systems",
        "and some others). Third",
        "it includes the PSS subsystems of research technology equipment developed on site by in-house and external experts (some of the secondary sources). The gradual development of the system is based on the relevant standards and best practices of functional safety as well as on an iterative and systematic lifecycle incorporating several internal and external reviews. The system is implemented with an easily maintainable network of safety PLCs."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha062.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA062",
      "page_number": "351",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA063",
      "title": "Towards a Common Reliability & Availability Information System for Particle Accelerator Facilities",
      "authors": [
        "K. Höppner",
        "Th. Haberer",
        "K. Pasic",
        "A. Peters",
        "HIT",
        "Heidelberg",
        "Germany",
        "J. Gutleber",
        "A. Niemi",
        "CERN",
        "Meyrin",
        "Switzerland",
        "AIT",
        "Vienna",
        "Austria",
        "Failure event and maintenance record based data collection systems have a long tradition in industry. Today",
        "the particle accelerator community does not possess a common platform that permits storing and sharing reliability and availability information in an efficient way. In large accelerator facilities used for fundamental physics research",
        "each machine is unique",
        "the scientific culture",
        "work organization",
        "and management structures are often incompatible with a streamlined industrial approach. Other accelerator facilities enter the area of industrial process improvement",
        "like medical accelerators due to legal requirements and constraints. The Heidelberg Ion Beam Therapy Center is building up a system for reliability and availability analysis",
        "exploring the technical and organizational requirements for a community-wide information system on accelerator system and component reliability and availability. This initiative is part of the EU H2020 project ARIES",
        "started in May 2017. We will present the technical scope of the system that is supposed to access and obtain information specific to reliability statistics in ways not compromising the information suppliers and system producers."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha063.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA063",
      "page_number": "356",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA064",
      "title": "An Off-Momentum Beam Loss Feedback Controller and Graphical User Interface for the LHC",
      "authors": [
        "B. Salvachua",
        "D. Alves",
        "G. Azzopardi",
        "S. Jacksonpresenter",
        "D. Mirarchi",
        "M. Pojer",
        "CERN",
        "Meyrin",
        "Switzerland",
        "University of Malta",
        "Information and Communication Technology",
        "Msida",
        "Malta",
        "During LHC operation",
        "a campaign to validate the configuration of the LHC collimation system is conducted every few months. This is performed by means of loss maps",
        "where specific beam losses are deliberately generated with the resulting loss patterns compared to expectations. The LHC collimators have to protect the machine from both betatron and off-momentum losses. In order to validate the off-momentum protection",
        "beam losses are generated by shifting the RF frequency using a low intensity beam. This is a delicate process that",
        "in the past",
        "often led to the beam being dumped due to excessive losses. To avoid this",
        "a feedback system based on the 100 Hz data stream from the LHC Beam Loss system has been implemented. When given a target RF frequency",
        "the feedback system approaches this frequency in steps while monitoring the losses until the selected loss pattern conditions are reached",
        "so avoiding the excessive losses that lead to a beam dump. This paper will describe the LHC off-momentum beam loss feedback system and the results achieved."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha064.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA064",
      "page_number": "360",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA065",
      "title": "use link to see paper's listing under its alternate paper code",
      "authors": [
        "R.A. Kadyrov",
        "D.G. Brown",
        "E.P. Chin",
        "C.I. Clarke",
        "M. Petree",
        "E. Rodriguez",
        "F. Tao",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "LCLS-II is a new FEL which is under construction at SLAC National Accelerator Laboratory. Its superconducting electron linac is able to produce up to 1.2 MW of beam power. Beam Containment System (BCS) is employed to limit the beam power and prevent excessive radiation in case of electron beam loss or FEL breach. Fast and slow shut-off paths are designed for devices with different response requirements. The system is required to shut-off the beam within 200 µs for some of the fast sensors. Fast path is based on custom electronic designs",
        "and slow path leverages industrial safety-rated PLC hardware. The system spans for 4 km of LCLS-II and combines inputs from about 150 sensors of different complexity. Architecture is based on multiple levels starting with summing sensor inputs locally and to converting them into permits for the shut-off devices. Each level is implemented redundantly. Automated test and manual tests at all levels are implemented in the system. System architecture",
        "electronics design and cable plant challenges are presented below."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha065.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA066",
      "title": "Electronics for LCLS-II Beam Containment System Shut-off",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha066.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA066",
      "page_number": "366",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA067",
      "title": "New Injection Information Archiver for SuperKEKB",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "We upgraded the Injection Archiver System of the SuperKEKB collider. It records the information related with the beam injection. The system is configured on the EPICS network. The database server employs Archiver Appliance as the database management system. In addition",
        "the distributed shared memory is installed on the database server. Its memory area is synchronized with other nodes such as bunch current monitor via the optical connection. Therefore the database server can collect the data like bunch current at the RF-bucket which the beam pulse is injected. By using this dedicated optical network",
        "we succeed the high-speed and stable data acquisition. The injection data can be recorded",
        "pulse-by-pulse",
        "in 50 Hz without any packet loss."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha067.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA067",
      "page_number": "370",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA068",
      "title": "Improving Reliability of the Fast Extraction Kicker Timing Control at the AGS",
      "authors": [
        "P.K. Kankiya",
        "J.P. Jamilkowski",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "The fast extraction kicker system at AGS to RHIC transport line uses Stanford Research DG535 delay generators to time",
        "synchronize",
        "and trigger charging power supplies and high-level thyratron trigger pulse generators. This timing system has been upgraded to use an SRS DG645 instrument due to reliability issues with the aforementioned model and slow response time of GPIB buses. The new model provides the relative timing of the separate kicker modules of the assembly from a synchronized external trigger with the RF system. Specifications of the timing scheme",
        "an algorithm to load settings synchronized with RHIC real-time events",
        "and performance analysis of the software will be presented in the paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha068.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA068",
      "page_number": "373",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA069",
      "title": "Automation of the Undulator Middle Plane Alignment Relative to the Electron Beam Position Using the K-Monochromator",
      "authors": [
        "S. Karabekyan",
        "S. Abeghyan",
        "W. Freund",
        "EuXFEL",
        "Schenefeld",
        "Germany",
        "DESY",
        "Hamburg",
        "Germany",
        "The correct K value of an undulator is an important parameter to achieve lasing conditions at free electron lasers. The accuracy of the installation of the undulator in the tunnel is limited by the accuracy of the instruments used in surveying. Moreover",
        "the position of the electron beam also varies depending on its alignment. Another source of misalignment is ground movement and the resulting change in the position of the tunnel. All this can lead to misalignment of the electron beam position relative to the center of the undulator gap up to several hundred microns. That",
        "in turn",
        "will lead to a deviation of the ΔK/K parameter several times higher than the tolerance requirement. An automated method of aligning the middle plane of the undulator",
        "using a K-monochromator",
        "was developed and used at European XFEL. Details of the method are described in this article. The results of the K value measurements are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha069.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA069",
      "page_number": "375",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA071",
      "title": "Integrated Multi-Purpose Tool for Data Processing and Analysis via EPICS PV Access",
      "authors": [
        "J.H. Kim",
        "H.S. Kim",
        "Y.M. Kim",
        "H.-J. Kwon",
        "Y.G. Song",
        "Korea Atomic Energy Research Institute (KAERI)",
        "Gyeongbuk",
        "Republic of Korea",
        "At the KOMAC",
        "we have been operating a proton linac",
        "consists of an ion source",
        "low energy beam transport",
        "a radio frequency quadrupole and eleven drift tube linacs for 100 MeV. The beam that users require is transported to the five target rooms using linac control system based on EPICS framework. In order to offering stable beam condition",
        "it is important to figure out characteristic of a 100 MeV proton linac. Then the beam diagnosis systems such as beam current monitoring system",
        "beam phase monitoring system and beam position monitoring system are installed on linac. All the data from diagnosis systems are monitored using control system studio for user interface and are archived through archive appliance. Operators analyze data after experiment for linac characteristic or some events are happened. So data scanning and processing tools are required to manage and analysis the linac more efficiently. In this paper",
        "we describe implementation for the integrated data processing and analysis tools based on data access."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha071_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha071.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha071_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA071",
      "page_number": "379",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA072",
      "title": "Automation in NSRC SOLARIS With Python and Tango Controls",
      "authors": [
        "W.T. Kitka",
        "M.K. Falowski",
        "A.M. Marendziak",
        "N. Olszowska",
        "M. Zając",
        "NSRC SOLARIS",
        "Kraków",
        "Poland",
        "NSRC SOLARIS is a 1.5 GeV third generation light source constructed at Jagiellonian University in Kraków",
        "Poland. The machine was commissioned in April 2016 and operates in decay mode. Two beamlines PEEM/XAS and UARPES were commissioned in 2018 and they have opened for conducting research in fall 2018. Two more beamlines (PHELIX and XMCD) are installed now and will be commissioned soon. Due to small size of the team and many concurrent tasks",
        "automation is very important. Automating many tasks in a quick and effective way is possible thanks to the control system based on TANGO Controls and Python programming language. With facadevice library the necessary values can be easily calculated in real-time. Beam position correction with PID controller at PEEM/XAS and UARPES beamlines",
        "alarm handling in SOLARIS Heating Unit Controller and real-time calculation of various vacuum parameters are shown as examples."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha072_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha072.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha072_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA072",
      "page_number": "382",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA073",
      "title": "Recent Updates of the RIKEN RI Beam Factory Control System",
      "authors": [
        "M. Komiyama",
        "M. Fujimaki",
        "N. Fukunishi",
        "A. Uchiyama",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "We report on two latest updates of the RIKEN Radioactive Isotope Beam Factory (RIBF) control system. First",
        "the successor of the existing beam interlock system (BIS) operated since 2006 was developed in 2019. As a first step",
        "it covers a small part of the RIBF facility. The new interlock system is based on a programmable logic controller (PLC) and uses a Linux-based PLC-CPU on that the Experimental Physics and Industrial Control System (EPICS) programs can be executed in addition to a sequencer. By using two kinds of CPUs properly according to the speed required for each signal handled in the system",
        "we succeeded in reducing the response time less than one third of the BIS in the performance test using prototype. Second",
        "we plan to expand coverage of the alarm system. We have applied the Best Ever Alarm System Toolkit (BEAST) for several years in addition to the Alarm Handler mainly to vacuum components. We have tried to include the magnet power supplies but found difficulties in treating old power supplies having large fluctuations of read-out values of their excitation currents in an appropriate manner. Our trials to overcome this problem will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha073.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA073",
      "page_number": "384",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA074",
      "title": "Automatic Deployment in a Control System Environment",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha074.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA074",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA075",
      "title": "EPICS Support Module for Efficient UDP Communication With FPGAs",
      "authors": [
        "M.G. Konrad",
        "E. Bernal",
        "M.A. Davis",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The driver linac of the Facility for Rare Isotope Beams (FRIB) contains 332 cavities which are controlled by individual FPGA-based low-level RF controllers. Due to limited hardware resources the EPICS IOCs cannot be embedded in the low-level RF controllers but are running on virtual machines communicating with the devices over Ethernet. An EPICS support module communicating with the devices over UDP has been developed based on the Asyn library. It supports efficient read and write access for both scalar and array data as well as support for triggering actions on the device. Device-related parameters like register addresses and data types are configurable in the EPICS record database making the support module independent of the hardware and the application. This also allows engineers to keep up with evolving firmware without recompiling the support library. The implementation of the support module leverages modern C++ features and relies on timers for periodic communication",
        "timeouts",
        "and detection of communication problems. The latter allows the communication code to be tested separately from the timers keeping the run time of the unit tests short."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha075.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA075",
      "page_number": "388",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA076",
      "title": "Timing System Upgrade for Medical Linear Accelerator Project at SLRI",
      "authors": [
        "R. Rujanakraikarn",
        "P. Koonpongpresenter",
        "S. Tesprasitte",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "A prototype of 6 MeV medical linear accelerator has been under development at Synchrotron Light Research Institute (SLRI). Several subsystems of the machine have been carefully designed and tested to prepare for x-ray generation. To maintain proper operation of the machine",
        "pulse signals are generated to synchronize various subsystems. The timing system",
        "based on the previous version designed on Xilinx Spartan-3 FPGA",
        "is upgraded with better timing resolution",
        "easier configuration with more timing channels",
        "and future expansion of the system. A new LabVIEW GUI is also designed with more details on timing parameters for easy customization. The result of this new design is satisfactorily achieved with the resolution of 10 nanoseconds per time step and up to 15 synchronized timing channels implemented on two FPGA modules."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha076.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA076",
      "page_number": "392",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA078",
      "title": "Renovation of the SPS Personnel Protection System:  A Configurable Approach",
      "authors": [
        "T. Ladzinski",
        "B. Fernández Adiego",
        "F. Havart",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The renovation of the SPS Personnel Protection System (PPS) comprises the installation of industrial access control solutions and the implementation of a new safety instrumented system tailored to the particular needs of the accelerator. The SPS has been a working horse of the CERN accelerator complex for many decades and its configuration has changed through the many years of operation. The classic solutions for safety systems design",
        "used in the LHC and PS machines",
        "have not been judged adequate for this accelerator undergoing perpetual changes",
        "composed of many sites forming several safety chains. In order to avoid expensive software modifications",
        "each time the accelerator configuration evolves",
        "a configurable safety software design was proposed. This paper presents the hardware architecture of the PLC-based SPS PPS and the configurable software architecture proposed. It further reports on the testing and formal verification activities performed to validate the safety software and discusses the pros and cons of the configurable approach."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha078.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA078",
      "page_number": "395",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA079",
      "title": "adviewer: The EPICS Area Detector Configurator You Didn’t Know You Needed",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha079_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha079.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha079_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA079",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA080",
      "title": "Automatic Reconfiguration of CERN 18 kV Electrical Distribution - the Auto Transfer Control System",
      "authors": [
        "J.C. Letra Simoes",
        "S. Infante",
        "F.A. Marin",
        "CERN",
        "Geneva",
        "Switzerland",
        "Availability is key to electrical power distribution at CERN. The CERN electrical network has been consolidated over the last 15 years in order to cope with the evolving needs of the laboratory and now comprises a 200 MW supply from the French grid at 400 kV",
        "a partial back up from the Swiss grid at 130 kV and 16 diesel generators. The Auto Transfer Control System has a critical role in minimizing the duration of power cuts on this complex electrical network",
        "thus significantly reducing the impact of downtime on CERN accelerator operation. In the event of a major power loss",
        "the control system analyzes the global status of the network and decides how to reconfigure the network from alternative sources",
        "following predefined constraints and priorities. The Auto Transfer Control System is based on redundant logical controllers (PLC) with multiple remote IO stations linked via an Ethernet IP ring (over optical fiber) across the three major substations at CERN. This paper describes the system requirements",
        "constraints and the applicable technologies",
        "which will be used to deliver an operational system by 2020."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha080.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA080",
      "page_number": "400",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA085",
      "title": "CERN Controls Open Source Monitoring System",
      "authors": [
        "F. Locci",
        "F. Ehm",
        "L. Gallerani",
        "J. Lauener",
        "J.P. Palluel",
        "R. Voirin",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The CERN accelerator controls infrastructure spans several thousands of machines and devices used for Accelerator control and data acquisition. In 2009 a full home-made CERN solution has been developed (DIAMON) to monitor and diagnose the complete controls infrastructure. The adoption of the solution by an enlarged community of users and its rapid expansion led to a final product that became more difficult to operate and maintain",
        "in particular because of the multiplicity and redundancy of the services",
        "the centralized management of the data acquisition and visualization software",
        "the complex configuration and also the intrinsic scalability limits. At the end 2017",
        "a complete new monitoring system for the beam controls infrastructure was launched. The new \"COSMOS\" system was developed with two main objectives in mind: First",
        "detect instabilities and prevent breakdowns of the control system infrastructure and to provide users with a more coherent and efficient solution for the development of their specific data monitoring agents and related dashboards. This paper describes the overall architecture of COSMOS",
        "focusing on the conceptual and technological choices of the system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha085_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha085.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha085_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA085",
      "page_number": "404",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA086",
      "title": "The Design of Experimental Performance Analysis and Visualization System",
      "authors": [
        "J. Luo",
        "L. Li",
        "Z. Ni",
        "X. Zhou",
        "CAEP",
        "Sichuan",
        "People’s Republic of China",
        "Stony Brook University",
        "Stony Brook",
        "New York",
        "USA",
        "The analysis of experimental performance is an essential task to any experiment. With the increasing demand on experimental data mining and utilization. methods of experimental data analysis abound",
        "including visualization",
        "multi-dimensional performance evaluation",
        "experimental process modeling",
        "performance prediction",
        "to name but a few. We design and develop an experimental performance analysis and visualization system",
        "consisting of data source configuration component",
        "algorithm management component",
        "and data visualization component. It provides us feasibilities such as experimental data extraction and transformation",
        "algorithm flexible configuration and validation",
        "and multi-views presentation of experimental performance. It will bring great convenience and improvement for the analysis and verification of experimental performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha086_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha086.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha086_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA086",
      "page_number": "409",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA087",
      "title": "The Design of Intelligent Integrated Control Software Framework of Facilities for Scientific Experiments",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha087_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha087.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha087_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA087",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA088",
      "title": "Consolidation of Re-Triggering System of LHC Beam Dumping System at CERN",
      "authors": [
        "N. Magnin",
        "W. Bartmann",
        "C. Bracco",
        "E. Carlier",
        "G. Gräwer",
        "T.D. Mottram",
        "E. Renner",
        "Rodziewicz",
        "J.P. Rodziewicz",
        "V. Senaj",
        "C. Wiesner",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Trigger Synchronization and Distribution System (TSDS) is a core part of the LHC Beam Dump System (LBDS). It comprises redundant Re-Trigger Lines (RTLs) that allow fast re-triggering of all high-voltage pulsed generators in case one self-triggers",
        "resulting in a so-called asynchronous dump. For reliability reasons",
        "the TSDS relies on many RTL redundant trigger sources that do not participate directly to the execution of a normal dump. After every dump",
        "signals propagating on the RTLs are analyzed by Post Operation Check (POC) systems",
        "to validate the correct performance and synchronization of all redundant triggers. The LBDS operated reliably since the start-up of LHC in 2008",
        "but during the Run 2 of the LHC",
        "new failure modes were identified that could incur damage for the beam dump block. In order to correct these failure modes",
        "an upgrade of the TSDS is realized during the LS2. This paper reviews the experience gained with the LBDS during Run 2 of the LHC operation and describes the new architecture of the TSDS being implemented. Measurements and simulations of signals propagating on the RTL are presented",
        "and the analysis performed by the POC systems are explained."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha088_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha088.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha088_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA088",
      "page_number": "412",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA089",
      "title": "New Neutron Sensitive Beam Loss Monitor (nBLM)",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha089_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha089.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha089_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA089",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA090",
      "title": "Design of Vessel and Beamline Vacuum and Gas Control System for Proton Radiography",
      "authors": [
        "P.S. Marroquin",
        "J.D. Bernardin",
        "J.G. Gioia",
        "D.A. Hathcoat",
        "A. Llobet",
        "H.J. Sandin",
        "W. Winton",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "A new capability for conducting explosively-driven dynamic physics experiments at the Proton Radiographic (pRad) facility at Los Alamos National Laboratory (LANL) is in development. The pRad facility",
        "an experimental area of the Los Alamos Neutron Science Center (LANSCE)",
        "performs multi frame proton radiography of materials subjected to an explosive process. Under design is a new beamline with confinement and containment vessels and required supporting systems and components. Five distinct vacuum sections have been identified",
        "each equipped with complete vacuum pumping assemblies. Inert gas systems are included for backfill and pressurization and supporting piping integrates the subsystems for gas distribution and venting. This paper will discuss the design of the independent vacuum control subsystems",
        "the integrated vacuum and gas control system and full incorporation into the Experimental Physics and Industrial Control System (EPICS) based LANSCE Control Systems and Networks."
      ],
      "institutions": [
        "Funding: Supported by the US Department of Energy, Los Alamos National Laboratory. Managed by Triad National Security, LLC, for the DOE National Nuclear Security Administration (Contract 89233218CNA000001)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha090_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha090.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha090_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA090",
      "page_number": "417",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA091",
      "title": "ESS MEBT Control System Integration",
      "authors": [
        "I. Mazkiaran",
        "I. Bustinduy",
        "G. Harper",
        "A. Rodríguez Páramo",
        "C. de la Cruz",
        "ESS Bilbao",
        "Zamudio",
        "Spain",
        "ESS",
        "Lund",
        "Sweden",
        "The high power linac of European Spallation Source",
        "ESS (Lund",
        "Sweden)",
        "accelerates 62.5 mA of protons up to 2 GeV in a sequence of normal conducting and superconducting accelerating structures. The Medium Energy Beam Transport (MEBT) line has been designed tested and mounted at ESS Bilbao premises to guarantee tight requirements are met. The main purpose of this 3.62 MeV MEBT is to match the RFQ output beam characteristics to the DTL input requirements both transversally using quadrupoles",
        "and longitudinally RF buncher cavities. Additionally",
        "the beam is also cleaned by efficient use of halo scrapers and pulse shape by means of a fast chopper. Besides",
        "beam characterization (beam current",
        "pulse shape",
        "size",
        "emittance) is performed using a comprehensive set of diagnostics. Therefore",
        "firstly",
        "control integration of magnets and steerers power supplies",
        "for quadrupoles",
        "as well as synchronism",
        "triggering",
        "linked to high voltage pulsers within the chopper control",
        "is part of the commitment for the present work. Secondly",
        "the control developments of beam instruments such as Faraday Cup and Emittance Meter Unit will be described. All the integrations are based on ESS EPICS environment."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha091_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha091.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha091_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA091",
      "page_number": "421",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA092",
      "title": "Prototyping the Resource Manager and Central Control System for the Cherenkov Telescope Array",
      "authors": [
        "D. Melkumyan",
        "I. Sadeh",
        "T. Schmidt",
        "P.A. Wegner",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "M. Fuessling",
        "I. Oya",
        "CTA",
        "Heidelberg",
        "Germany",
        "S. Sah",
        "M. Sekoranja",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "Humboldt University Berlin",
        "Institut für Physik",
        "Berlin",
        "Germany",
        "INAF-Osservatorio Astronomico di Brera",
        "Merate",
        "Italy"
      ],
      "institutions": [],
      "abstract": "The Cherenkov Telescope Array (CTA) will be the next generation ground-based observatory for gamma-ray astronomy at very-high energies. CTA will consist of two large arrays with 118 Cherenkov telescopes in total, deployed in Paranal (Chile) and Roque de Los Muchachos Observatories (Canary Islands, Spain). The Array Control and Data Acquisition (ACADA) system provides the means to execute observations and to handle the acquisition of scientific data in CTA. The Resource Manager & Central Control (RM&CC) sub-system is a core element in the ACADA system. It implements the execution of observation requests received from the scheduler sub-system and provides infrastructure services concerning the administration of various resources to all ACADA sub-systems. The RM&CC is also responsible of the dynamic allocation and management of concurrent operations of up to nine telescope sub-arrays, which are logical groupings of individual CTA telescopes performing coordinated scientific operations. This contribution presents a summary of the main RM&CC design features, and of the future plans for prototyping.",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha092_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha092.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha092_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA092",
      "page_number": "426",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA093",
      "title": "Control System Virtualization at Karlsruhe Research Accelerator",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha093_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha093.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha093_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA093",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA095",
      "title": "Status of OpenXAL at ESS",
      "authors": [
        "N. Milas",
        "J.F. Esteban Müller",
        "E. Laface",
        "Y. Levinsen",
        "ESS",
        "Lund",
        "Sweden",
        "The OpenXAL accelerator physics software platform is being developed through international collaboration among several facilities since 2010. The goal of the collaboration is to establish OpenXAL as a multi-purpose software platform supporting a broad range of tool and application development in accelerator physics and high-level control. This paper discusses progress in beam dynamics simulation and updated application framework along with new generic accelerator physics applications for the ESS branch of the collaboration. We present the current status of the project",
        "a roadmap for continued development and an overview of the future developments needed for ESS future commissioning work."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha095_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha095.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha095_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA095",
      "page_number": "432",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA096",
      "title": "ESS Drift Tube Linac Control System Architecture and Concept of Operations",
      "authors": [
        "M. Montis",
        "L. Antoniazzi",
        "A. Baldo",
        "M.G. Giacchini",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "ESS",
        "Lund",
        "Sweden",
        "The Drift Tube Linac (DTL) of the European Spallation Source (ESS)* is designed to operate at 352.2 MHz with a duty cycle of 4% (3 ms pulse length",
        "14 Hz repetition period) and will accelerate a proton beam of 62.5 mA pulse peak current from 3.62 to 90 MeV. According to the Project standards",
        "the entire control system is based on the EPICS framework**. This paper presents the control system architecture designed for the DTL apparatus by INFN-LNL***",
        "emphasizing in particular the technological solutions adopted and the high level control orchestration",
        "used to standardize the software under logic design",
        "implementation and maintenance points of view."
      ],
      "institutions": [],
      "abstract": "*https://europeanspallationsource.se/  **https://epics-controls.org/ ***https://web.infn.it/epics/",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha096_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha096.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha096_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA096",
      "page_number": "436",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA097",
      "title": "EPICS Based Control System for SPES Tape Station for Beam Characterization: Motion System and Controls",
      "authors": [
        "M. Montis",
        "M.G. Giacchini",
        "T. Marchi",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "iThemba LABS",
        "Somerset West",
        "South Africa",
        "B. Genolini",
        "L. Vatrinet",
        "D. Verney",
        "Université Paris-Saclay",
        "CNRS/IN2P3",
        "IJCLab",
        "Orsay",
        "France",
        "The SPES* Tape Station (STS) for Radioactive Ion Beams (RIBs) characterization is under construction at LNL. This tool will be used to measure the actual composition of the radioactive ion beams extracted from the SPES-β ion source and to optimize the source’s parameters. STS will provide beam diagnostic information by determining the beam composition and intensity. At the same time",
        "it will be able to measure the target release curves needed for the source’s characterization and development. The core part of the system",
        "the related motor and controls are being designed and constructed in synergy with IPN Orsay (France)",
        "iThemba Laboratories (South Africa) and the Gamma collaboration (INFN-CSN3). In particular",
        "the mechanical part is based on the existing BEDO** tape system operated in ALTO while the control system for motion is an EPICS*** base application under implementation by iThemba and INFN",
        "result of a upgrade operation required to substitute obsoleted hardware and update logic and algorithm.",
        "*https://web.infn.it/spes/  **Etil et al. PRC 91",
        "064317 (2015) ***https://epics-controls.org/"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha097_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha097.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha097_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA097",
      "page_number": "440",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA098",
      "title": "A New Communication Interface for the European Southern Observatory (ESO)’s Very Large Telescope Technical Detector Control System Using Aravis, an Open-Source Library for GenICam Cameras",
      "authors": [
        "OSL",
        "St Ives",
        "Cambridgeshire",
        "United Kingdom",
        "J. Knudstrup",
        "F. Pellegrin",
        "ESO",
        "Garching bei Muenchen",
        "Germany",
        "The European Southern Observatory’s Very Large Telescope (VLT) provides support for high-performance industrial cameras with its Technical Detector Control System (TDCS). Until now",
        "TDCS has used a communication interface based on an API from Allied Vision Technologies (AVT)",
        "which only supports cameras made by AVT. As part of the VLT 2019 release",
        "a new communication interface has been developed for TDCS using Aravis",
        "the open-source library for GenICam cameras. Aravis has been independently developed to provide support for cameras from any vendor",
        "although this is not guaranteed. It reads the GenICam interface of a GigE Vision camera to enable control. It also has capabilities for USB3Vision cameras. With this new communication interface",
        "support for other manufacturers is now possible. It has been tested with cameras from AVT and Basler",
        "and further tests using a CameraLink camera with a GigE Vision adapter are planned. This paper will discuss the capabilities of Aravis",
        "considerations in the design of the communication interface",
        "and lessons learnt from the implementation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha098_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha098.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha098_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA098",
      "page_number": "444",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA099",
      "title": "XChem Laboratory Puck Scanner - Algorithm and Result Visualization",
      "authors": [
        "U.M. Neuman",
        "J.D. O’Hea",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Tessella",
        "Abingdon",
        "United Kingdom",
        "Mind Foundry Ltd",
        "Oxford",
        "United Kingdom",
        "Macromolecular Crystallography (MX) facilities are known for using many samples and require software tools which can scan",
        "store and help to track samples’ Data Matrix codes and to maintain the correct sample processing order. An open source Data Matrix code scanning program",
        "Puck Scanner",
        "developed at Diamond Light Source (DLS) is introduced",
        "its scanning algorithm explained and the continuous visualisation of results presented. Scanned codes are stored together with date",
        "time",
        "and the number of valid codes within a puck. This information is crucial for researchers as it allows them to match the sample with X-ray scanning results. The software is used in Diamond’s XChem laboratory on a day to day basis and has started to be adopted by other facilities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha099_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha099.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha099_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA099",
      "page_number": "448",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA100",
      "title": "quasar : The Full-Stack Solution for Creation of OPC-UA Middleware",
      "authors": [
        "P.P. Nikiel",
        "P. Moschovakos",
        "S. Schlenker",
        "CERN",
        "Meyrin",
        "Switzerland",
        "Quasar (Quick OPC-UA Server Generation Framework) enables efficient development of OPC-UA servers. The project evolved into a software ecosystem providing complete OPC-UA support for Detector Control Systems. OPC-UA servers can be modeled and generated and profit from tooling to aid development",
        "deployment and maintenance. OPC-UA client libraries can be generated and published to users. Client-server chaining is supported. quasar was used to build OPC-UA servers for different computing platforms including server machines",
        "credit-card computers as well as System-on-a-chip solutions. Quasar generated servers can be integrated as slave modules into other software projects written in higher-level programming languages (such as Python) to provide OPC-UA information exchange. quasar supports quick and efficient integration of OPC-UA servers into a control system based on the WinCC OA SCADA platform. The ecosystem can work with different OPC-UA stacks including 100% free and open-source ones. Thus it’s not restricted by licensing constraints. The contribution will present an overview and the evolution of the ecosystem along with example applications from ATLAS DCS and beyond."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha100_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha100.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha100_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA100",
      "page_number": "453",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA103",
      "title": "The PLC Control System for the RF Upgrade of the Super Proton Synchrotron",
      "authors": [
        "J.C. Oliveira",
        "L. Arnaudon",
        "A. Diaz Fontalva",
        "CERN",
        "Geneva",
        "Switzerland",
        "During the CERN Long Shutdown 2 (LS2)",
        "the 200 MHz main acceleration system of the Super Proton Synchrotron (SPS) is being upgraded. Two cavities will be added to reach a total of six. Each new cavity will be powered by Solid State Power Amplifiers (SSPA) grouped into 16 \"towers\" of 80 modules each",
        "in total 2560 modules. This paper describes the newly developed control system which uses a master PLC for control and interlock of each cavity and the slave PLC controllers for each of the solid state amplifier towers. The system topology and design choices are discussed. Control and interlocking of all subsystems necessary for the operation of an RF cavity are detailed",
        "and the interaction between the master and slave PLC controllers is outlined. We discuss some preliminary results and performance of the test installation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha103.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA103",
      "page_number": "458",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA105",
      "title": "Adaptation of CERN Power Converter Controls for Integration into Other Laboratories using EPICS and TANGO",
      "authors": [
        "S.T. Page",
        "J. Afonso",
        "C. Ghabrous Larrea",
        "J. Herttuainen",
        "Q. King",
        "B. Todd",
        "CERN",
        "Geneva",
        "Switzerland",
        "Modern power converters (power supplies) at CERN use proprietary controls hardware",
        "which is integrated into the wider control system by software device servers developed specifically for the CERN environment",
        "built using CERN libraries and communication protocols. There is a growing need to allow other HEP laboratories to make use of power converters that were originally developed for CERN and",
        "consequently",
        "a desire to allow for their efficient integration into control systems used at those laboratories",
        "which are generally based upon either of the EPICS and Tango frameworks. This paper gives an overview of power converter equipment and software currently being provided to other laboratories through CERN’s Knowledge and Technology Transfer program and describes differences identified between CERN’s control system model and that of EPICS",
        "which needed to be accounted for. A reference EPICS implementation provided by CERN to other laboratories to facilitate integration of the CERN power converter controls is detailed and the prospects for the development of a Tango equivalent in the future are also covered."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha105_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha105.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha105_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA105",
      "page_number": "462",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA106",
      "title": "FGC3.2: A New Generation of Embedded Controls Computer for Power Converters at CERN",
      "authors": [
        "S.T. Page",
        "C. Ghabrous Larrea",
        "Q. King",
        "B. Todd",
        "S. Uznanski",
        "D.J. Zielinski",
        "CERN",
        "Geneva",
        "Switzerland",
        "Modern power converters (power supplies) at CERN are controlled by devices known as Function Generator/Controllers (FGCs)",
        "which are embedded computer systems providing function generation",
        "current and field regulation",
        "and state control. FGCs were originally conceived for the LHC in the early 2000s",
        "though later generations are now increasingly being deployed in the accelerators in the LHC Injector Chain (Linac4",
        "Booster",
        "Proton Synchrotron and SPS) to replace obsolete equipment. A new generation of FGC known as the FGC3.2 is currently in development",
        "which will provide for the evolving needs of the CERN accelerator complex and additionally be supplied to other HEP laboratories through CERN’s Knowledge and Technology Transfer program. This paper describes the evolution of FGCs",
        "summarizes tests performed to evaluate candidate components for the FGC3.2 and details the final hardware and software architectures which were chosen. The new controller will make use of a multi-core ARM-based system-on-chip (SoC) running an embedded Linux operating system in contrast to earlier generations which combined a microcontroller and DSP with software running on ’bare metal’."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha106_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha106.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha106_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA106",
      "page_number": "468",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA107",
      "title": "use link to see paper's listing under its alternate paper code",
      "authors": [
        "M.C. Paniccia",
        "D.M. Gassner",
        "A. Marusic",
        "A. Sukhanov",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "There are a variety of beam current transformers that are used at all accelerator facilities for current and bunch charge measurements. Transformer signals are traditionally measured using integrator electronics followed by a digitizer. However",
        "integrator circuits have a limited bandwidth and are susceptible to noise. By directly digitizing the output of the transformer",
        "the signal bandwidth is limited only by the transformer characteristics and the digitizing platform. Digital integration and filtering can then easily be applied to reduce noise resulting in an overall improvement of the beam parameter measurements. This paper describes a Python-based application that performs the filtering and integration of a current transformer pulse that has been directly digitized by an oscilloscope."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha107_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha107.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha107_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA107",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA109",
      "title": "Python Based Application for Beam Current Transformer Signal Analysis",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha109_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha109.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha109_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA109",
      "page_number": "473",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA111",
      "title": "Easing the Control System Application Development for CMS Detector Control System with Automatic Production Environment Reproduction",
      "authors": [
        "I. Papakrivopoulos",
        "G. Bakas",
        "G. Tsipolitis",
        "National Technical University of Athens",
        "Athens",
        "Greece",
        "DESY",
        "Hamburg",
        "Germany",
        "J. Branson",
        "S. Cittolin",
        "M. Pieri",
        "UCSD",
        "La Jolla",
        "California",
        "USA",
        "P. Brummer",
        "D. Da Silva Gomes",
        "C. Deldicque",
        "M. Dobson",
        "N. Doualot",
        "J.R. Fulcher",
        "D. Gigi",
        "M.S. Gladki",
        "F. Glege",
        "J. Hegeman",
        "A. Mecionis",
        "F. Meijers",
        "E. Meschi",
        "K. Mor",
        "S. Morovic",
        "L. Orsini",
        "D. Rabady",
        "A. Racz",
        "K.V. Raychinov",
        "A. Rodriguez Garcia",
        "H. Sakulin",
        "C. Schwick",
        "D. Simelevicius",
        "P. Soursos",
        "M. Stankevicius",
        "U. Suthakar",
        "C. Vazquez Velez",
        "A.B. Zahid",
        "P. Zejdl",
        "CERN",
        "Meyrin",
        "Switzerland",
        "G.L. Darlea",
        "G. Gomez-Ceballos",
        "C. Paus",
        "MIT",
        "Cambridge",
        "Massachusetts",
        "USA",
        "W. Li",
        "A. Petrucci",
        "A. Stahl",
        "Rice University",
        "Houston",
        "Texas",
        "USA",
        "R.K. Mommsen",
        "S. Morovic",
        "V. O’Dell",
        "P. Zejdl",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Detector Control System (DCS) is one of the main pieces involved in the operation of the Compact Muon Solenoid (CMS) experiment at the LHC. The system is built using WinCC Open Architecture (WinCC OA) and the Joint Controls Project (JCOP) framework which was developed on top of WinCC at CERN. Following the JCOP paradigm",
        "CMS has developed its own framework which is structured as a collection of more than 200 individual installable components each providing a different feature. Everyone of the systems that the CMS DCS consists of is created by installing a different set of these components. By automating this process",
        "we are able to quickly and efficiently create new systems in production or recreate problematic ones",
        "but also",
        "to create development environments that are identical to the production ones. This latter one results in smoother development and integration processes",
        "as the new/reworked components are developed and tested in production-like environments. Moreover",
        "it allows the central DCS support team to easily reproduce systems that the users/developers report as being problematic",
        "reducing the response time for bug fixing and improving the support quality."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha111_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha111.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha111_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA111",
      "page_number": "476",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA112",
      "title": "Improving Perfomance of the MTCA System by use of PCI Express Non-Transparent Bridging and Point-To-Point PCI Express Transactions",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "The PCI Express Standard enables one of the highest data transfer rates today. However",
        "with a large number of modules in a MTCA system and an increasing complexity of individual MTCA components along with a growing demand for high data transfer rates to client programs performance of the overall system becomes an important key parameter. Multiprocessor systems are known to provide not only the ability for higher processing bandwidth",
        "but also allow greater system reliability through host failover mechanisms. The use of non-transparent bridges in PCI systems supporting intelligent adapters in enterprise and multiple processors in embedded systems is a well established technology. There the non-transparent bridge acts as a gateway between the local subsystem and the system backplane. This can be ported to the PCI Express standard by replacing one of the transparent switches on the PCI Express switch with a non-transparent switch. Our experience of establishing non-transparent bridging in MTCA systems will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha112_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha112.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha112_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA112",
      "page_number": "480",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA113",
      "title": "Linux-based PXIe System for the Real-Time Control of New Painting Bumper at CERN",
      "authors": [
        "M.P. Pimentel",
        "E. Carlierpresenter",
        "C. Chanavat",
        "T. Gharsa",
        "G. Gräwer",
        "N. Magnin",
        "N. Voumard",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the framework of the LHC Injectors Upgrade Project",
        "the new connection from Linac4",
        "injecting a 160 MeV H− beam into the Proton Synchrotron Booster (PSB) requires a set of four slow kicker magnets (KSW) per PSB ring to move the beam on a stripping foil",
        "remove electrons and perform phase space painting. A new multiple-linear waveform generator based on a Marx topology powers each KSW",
        "allowing adjustment of the current discharge shape with high flexibility for the different beam users. To control these complex power generators",
        "National Instruments (NI) PXIe crates fitted with a set of modules (A/D",
        "D/A",
        "FPGA",
        "PROFINET) are used. Initially",
        "control software developed with LabVIEW has validated the test bench hardware. A full software re-engineering",
        "accessing the hardware using Linux drivers",
        "C APIs and the C++ framework"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha113_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha113.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha113_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA113",
      "page_number": "483",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA114",
      "title": "Achieving Optimal Control of LLRF Control System with Artificial Intelligence",
      "authors": [
        "R. Pirayesh",
        "S. Biedron",
        "J.A. Diaz Cruz",
        "M. Martinez-Ramon",
        "S.I. Sosa Guitron",
        "University of New Mexico",
        "Albuquerque",
        "New Mexico",
        "USA",
        "Artificial Intelligence is a versatile tool to make machines learn the characteristics of a device or a system. In this research",
        "we will be investigating applying deep learning and Gaussian process learning to make a machine learn the optimal settings of a low-level RF (LLRF) control system for particle accelerators. These settings include the multiple controllers’ parameters and the parameters of the LLRF that result in an optimal target function applied to the LLRF. Finding this target function",
        "finding the right machine learning algorithm with the lowest error",
        "and finding the best controller that result in the most optimal target function is the goal of this research."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha114_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha114.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha114_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA114",
      "page_number": "488",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA115",
      "title": "Code Generation Tools and Editor for Memory Maps",
      "authors": [
        "P. Plutecki",
        "B. Bielawski",
        "A.C. Butterworth",
        "CERN",
        "Geneva",
        "Switzerland",
        "Cheburashka",
        "a toolset created in the Radio Frequency Group at CERN",
        "has become an essential part of our hardware and software developments. Due to changing requirements",
        "this toolset has been recently rewritten in C++ and Python. A hardware developer",
        "using the graphical editor",
        "defines a memory map",
        "which is subsequently used to ensure consistency between software and hardware. The memory map file is an input for a variety of tools used by the hardware engineers",
        "such as VHDL code generators. In addition to aiding the firmware development",
        "our tools generate C++ wrapper libraries. The wrapper provides a simple interface on top of a Linux device driver to read and write registers by exposing memory map nodes in a hierarchical way",
        "performing all low-level bit manipulations and checks internally. To interact with the hardware",
        "a software that runs on a front-end computer is needed. Cheburashka allows us to generate FESA (Front-End Software Architecture) classes with parts of the operational interface already present. This paper describes the evolution of the graphical editor and the Python tools used for C++ code generation",
        "along with a description of their main features."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha115_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha115.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha115_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA115",
      "page_number": "493",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA117",
      "title": "Big Data Archiving From Oracle to Hadoop",
      "authors": [
        "I. Prieto Barreiro",
        "M. Sobieszek",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The CERN Accelerator Logging Service (CALS) is used to persist data of around 2 million predefined signals coming from heterogeneous sources such as the electricity infrastructure",
        "industrial controls like cryogenics and vacuum",
        "or beam related data. This old Oracle based logging system will be phased out at the end of the LHC’s Long Shut-down 2 (LS2) and will be replaced by the Next CERN Accelerator Logging Service (NXCALS) which is based on Hadoop. As a consequence",
        "the different data sources must be adapted to persist the data in the new logging system. This paper describes the solution implemented to archive into NXCALS the data produced by QPS (Quench Protection System) and SCADAR (Supervisory Control And Data Acquisition Relational database) systems",
        "which generate a total of around 175",
        "000 values per second. To cope with such a volume of data the new service has to be extremely robust",
        "scalable and fail-safe with guaranteed data delivery and no data loss. The paper also explains how to recover from different failure scenarios like e.g. network disruption and how to manage and monitor this highly distributed service."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha117_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha117.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha117_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA117",
      "page_number": "497",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA118",
      "title": "Improving Alarm Handling for the TI Operators by Integrating Different Sources in One Alarm Management and Information System",
      "authors": [
        "M. Bräger",
        "M. Bouzas Reguera",
        "U. Epting",
        "E. Mandilara",
        "E. Matli",
        "I. Prieto Barreiropresenter",
        "M.P. Rafalski",
        "CERN",
        "Geneva",
        "Switzerland",
        "CERN uses a central alarm system to monitor its complex technical infrastructure. The Technical Infrastructure (TI) operators must handle a large number of alarms coming from several thousand equipments spread around CERN. In order to focus on the most important events and improve the time required to solve the problem",
        "it is necessary to provide extensive helpful information such as alarm states of linked systems",
        "a geographical overview on a detailed map and clear instructions to the operators. In addition",
        "it is useful to temporarily inhibit alarms coming from equipment during planned maintenance or interventions. The tool presents all necessary information in one place and adds simple and intuitive functionality to ease the operation with an enhanced interface."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha118_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha118.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha118_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA118",
      "page_number": "502",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA121",
      "title": "Generic Data Acquisition Interfaces and Processes in Sardana",
      "authors": [
        "Z. Reszela",
        "J. Andreu",
        "T.M. Coutinho",
        "G. Cuní",
        "C. Falcon-Torres",
        "D. Fernández-Carreiras",
        "R. Homs-Puron",
        "C. Pascual-Izarra",
        "D. Roldán",
        "M. Rosanes-Siscart",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "NSRC SOLARIS",
        "Kraków",
        "Poland",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "DESY",
        "Hamburg",
        "Germany",
        "Users visiting scientific installations aim to collect the best quality data frequently under time pressure. They look for complementary techniques at different sites and when they arrive to one they have limited time to understand the data acquisition architecture. In these conditions",
        "the availability of generic and common interfaces to the experimental channels and measurements improve the user experience regarding the programming and configuration of the experiment. Here we present solutions to the data acquisition challenges provided by the Sardana scientific SCADA suite. In one experimental session the same detector may be employed in different modes e.g.",
        "getting the data stream when aligning the sample or the stage",
        "getting a single time/monitor controlled exposure and finally running the measurement process like a step or continuous scan. The complexity of the acquisition setup increases with the number of detectors being simultaneously used and even more depending on the applied synchronization. In this work we present recently enriched Sardana interfaces and optimized processes and conclude with the roadmap of further enhancements."
      ],
      "institutions": [],
      "abstract": "M.T. Núñez Pardo de Vera",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha121_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha121.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha121_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA121",
      "page_number": "506",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA122",
      "title": "Improving User Information by Interfacing the Slow Control’s Log and Alarm Systems to a Flexible Chat Platform",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha122_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha122.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha122_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA122",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA123",
      "title": "Vacuum Controls Configurator: A Web Based Configuration Tool for Large Scale Vacuum Control Systems",
      "authors": [
        "A.P. Rocha",
        "I.A. Amador",
        "S. Blanchard",
        "J. Fraga",
        "P. Gomes",
        "C.V. Lima",
        "G. Pigny",
        "P. Poulopoulou",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Vacuum Controls Configurator (vacCC) is an application developed at CERN for the management of large-scale vacuum control systems. The application was developed to facilitate the management of the configuration of the vacuum control system at CERN",
        "the largest vacuum system in operation in the world",
        "with over 15",
        "000 vacuum devices spread over 128 km of vacuum chambers. It allows non-experts in software to easily integrate or modify vacuum devices within the control system via a web browser. It automatically generates configuration data that enables the communication between vacuum devices and the supervision system",
        "the generation of SCADA synoptics",
        "long and short term archiving",
        "and the publishing of vacuum data to external systems. VacCC is a web application built for the cloud",
        "dockerized",
        "and based on a microservice architecture. In this paper",
        "we unveil the application’s main aspects concerning its architecture",
        "data flow",
        "data validation",
        "and generation of configuration for SCADA/PLC."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha123_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha123.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha123_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA123",
      "page_number": "511",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA124",
      "title": "Local Oscillator Rear Transition Module for 704.42 MHz LLRF Control System at ESS",
      "authors": [
        "I. Rutkowski",
        "K. Czuba",
        "M.G. Grzegrzółka",
        "Warsaw University of Technology",
        "Institute of Electronic Systems",
        "Warsaw",
        "Poland",
        "This paper describes the specifications",
        "architecture",
        "and measurements’ results of the MTCA-compliant Local Oscillator (LO) Rear Transition Module (RTM) board providing low phase noise clock and heterodyne signals for the 704.42 MHz Low Level Radio Frequency (LLRF) control system at the European Spallation Source (ESS). The clock generation and LO synthesis circuits are based on the module presented at ICALEPCS 2017. The conditioning circuits for the input and output signals must simultaneously achieve the desired impedance matching",
        "spectral purity",
        "output power as well as the phase noise requirements. The reference conditioning circuit presents an additional challenge due to input power range being significantly wider than the output range. The circuits monitoring the power levels of critical signals and voltages of supply rails for remote diagnostics as well as the programmable logic devices used to set the operating parameters via Zone3 connector are described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha124_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha124.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha124_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA124",
      "page_number": "516",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA125",
      "title": "Data Visualization With Data Browser Software",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha125_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha125.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha125_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA125",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA126",
      "title": "Control and Analysis Software Development at the European XFEL",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha126_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha126.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha126_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA126",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA130",
      "title": "A Library of Fundamental Building Blocks for Experimental Control Software",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha130_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha130.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha130_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA130",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA131",
      "title": "Waste Heat Recovery for the LHC Coooling Towers: Control System Validation Using Digital Twins",
      "authors": [
        "B. Schofield",
        "E. Blanco Viñuela",
        "W. Booth",
        "CERN",
        "Geneva",
        "Switzerland",
        "Aalto University",
        "School of Science and Technology",
        "Aalto",
        "Finland",
        "In order to improve its energy utilization",
        "CERN will deploy a Waste Heat Recovery system at one of the LHC’s surface sites which will provide heating power to a local municipality. To study the effects that the heat recovery plant will have on the cooling system",
        "a ’digital twin’ of the cooling plant was created in the simulation tool EcosimPro. The primary question of interest was whether the existing control system of the cooling plant would be capable of handling transients arising from a sudden shutdown of the heat recovery plan. The simulation was connected via OPC UA to a PLC implementing the cooling plant control system. This ’virtual commissioning’ setup was used to study a number of scenarios representing different cooling loads",
        "ambient temperature conditions",
        "and heat recovery plant operating points. Upon completion of the investigation it was found that the current cooling plant control system will be sufficient to deal with the transients arising from a sudden stop of heat recovery plant operation. In addition",
        "it was shown that an improvement in the controls could also enhance the energy savings of the cooling towers."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha131_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha131.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha131_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA131",
      "page_number": "520",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA132",
      "title": "Control System Integration of MAX IV Insertion Devices",
      "authors": [
        "J. Lidón-Simon",
        "N.S. Al-Habib",
        "H.Y. Al-Sallami",
        "A. Dupre",
        "V.H. Hardion",
        "M. Lindberg",
        "P. Sjöblom",
        "A. Thiel",
        "G. Todorescu",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "During the last 2.5 years",
        "MAX IV have installed and commissioned in total 15 insertion devices out of which 6 are new in vacuum undulators",
        "1 in vacuum wiggler",
        "and 7 in-house developed and manufactured Apple II elliptical polarized undulators. From the old lab",
        "MAXLAB",
        "1 PU is also reused. Looking forward",
        "3 additional insertion devices will be installed shortly. As MAX IV only has one Control and IT group",
        "the same concept of machine and beamline installation have been applied also to the insertion devices",
        "i.e. Sardana",
        "Tango",
        "PLC",
        "and IcePAP integration. This has made a seamless integration possible to the rest of the facility in terms of user interfaces",
        "alarm handling",
        "archiving of status",
        "and also future maintenance support."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha132_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha132.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha132_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA132",
      "page_number": "525",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA133",
      "title": "Stable Operation of the MAX IV Laboratory Synchrotron Facility",
      "authors": [
        "P. Sjöblom",
        "A. Amjad",
        "P.J. Bell",
        "D.A. Erb",
        "A. Freitas",
        "V.H. Hardion",
        "J.M. Klingberg",
        "V. Martos",
        "A. Milan-Otero",
        "S. Padmanabhan",
        "H. Petri",
        "J.T.K. Rosenqvist",
        "D.P. Spruce",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain"
      ],
      "institutions": [
        "MAX IV Laboratory, inaugurated in June 2016, has for the last 8 months accepted synchrotron users on three beamlines, NanoMAX, BioMAX and Hippie, while simultaneously pushing towards bringing more beamlines into the commissioning and user phases. As evidence of this, the last call issued addressed 10 beamlines. As of summer 2019, MAX IV has reached a point where 11 beamlines simultaneously have shutters open and are thus receiving light under stable operation. With 16 beamlines funded, the number of beamlines will grow over the coming years. The Controls and IT group has performed numerous beamline system installations such as a sample changer at BioMAX, Dectris detector at Nanomax, and End Station at Hippie. It has additionally developed processes, such as automated IT infrastructure with a view to accepting users. We foresee a focus on end stations and detectors, as well as data storage, data handling and scientific software. As an example, a project entitled \"DataStaMP\" has been recently funded aiming to increase the data and metadata storage and management system in order to accommodate the ever increasing demand for storage and access."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha133_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha133.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha133_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA133",
      "page_number": "530",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA134",
      "title": "PyDM - Status Update",
      "authors": [
        "H.H. Slepicka",
        "M.L. Gibbs",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "PyDM (Python Display Manager) is a Python and Qt-based framework for building user interfaces for control systems providing a no-code",
        "drag-and-drop system to make simple screens",
        "as well as a straightforward Python framework to build complex applications. In this brief presentation we will talk about the state of PyDM",
        "the new functionality that has been added in the last year of development",
        "including full support for EPICS PVAccess and other structured data sources as well as the features targeted for release in 2020."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha134_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha134.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha134_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA134",
      "page_number": "536",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA135",
      "title": "PyDM - Extension Points",
      "authors": [
        "H.H. Slepicka",
        "M.L. Gibbs",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "PyDM (Python Display Manager) is a Python and Qt-based framework for building user interfaces for control systems providing a no-code",
        "drag-and-drop system to make simple screens",
        "as well as a straightforward Python framework to build complex applications. PyDM developers and users can easily create complex applications using existing Python packages such as NumPy",
        "SciPy",
        "Scikit-learn and others. With high level interfaces for data plugins and external tools",
        "PyDM can be extended with new widgets",
        "integration with facility-specific tools (electronic log books",
        "data logger viewers",
        "et cetera) as well as new data sources (EPICS",
        "Tango",
        "ModBus",
        "Web Services",
        "etc) without the need to recompile or change the PyDM internal source."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha135_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha135.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha135_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA135",
      "page_number": "539",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA136",
      "title": "Integration of Optical Beam Loss Monitor for CLARA",
      "authors": [
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A.D. Brynes",
        "F. Jackson",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A.D. Brynes",
        "F. Jackson",
        "J. Wolfenden",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "The detection of beam loss events in accelerators is an important task for machine and personal protection",
        "and for optimization of beam trajectory. An optical beam loss monitor (oBLM) being developed by the Cockcroft Institute at Daresbury Laboratory required integration with the rest of the controls and timing system of the site’s electron accelerator",
        "CLARA (Compact Linear Accelerator for Research and Applications). [1] This paper presents the design and implementation of an inexpensive solution using a Domino Ring Sampling device from PSI. Signals from the oBLM are acquired and can be processed to resolve beam loss events to a resolution of 0.2 m."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha136_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha136.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha136_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA136",
      "page_number": "544",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA137",
      "title": "Timing Synchronization and Controls Integration for ESS Detector Readout",
      "authors": [
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "S. Alcock",
        "J.M.C. Nilsson",
        "ESS",
        "Lund",
        "Sweden",
        "The European Spallation Source (ESS) is a new facility being built in Lund",
        "Sweden",
        "which when finished will be the world’s most powerful neutron source. STFC has an in-kind project with the Detector group at ESS to provide timing and control systems integration for the detector data readout system. This paper describes how time is synchronised and distributed to the readout system from the ESS timing system",
        "and how EPICS is used to implement a controls interface exposing the functionality of detector front ends."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha137_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha137.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha137_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA137",
      "page_number": "547",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA138",
      "title": "Beam Gate Control System for the Proton Injector and Beamlines on KOMAC",
      "authors": [
        "Y.G. Song",
        "H.S. Kim",
        "J.H. Kim",
        "H.-J. Kwon",
        "Korea Atomic Energy Research Institute (KAERI)",
        "Gyeongbuk",
        "Republic of Korea",
        "The Korea Multi-purpose Accelerator Complex (KOMAC) 100 MeV proton linac operates with the timing system to change real-time timing parameters for low and high-flux proton beam utilization. The main requirements are to synchronize the operation of the facility including linac",
        "target",
        "and diagnostics",
        "to provide a variable beam repetition rate up to 60 Hz",
        "and to support post-mortem analysis when a beam trip occurs. The timing system",
        "which consists of one event generator and eleven event receivers",
        "is configured to control the beam gate and beam sequence to distribute the proton beam to the beam line. Corresponding to user’s demands",
        "beam gate should be controlled",
        "and the beam distribution must be precisely synchronized with the main reference signal. The timing system is configured with sequence logic for beam gate control",
        "and the timing events can trigger the software to perform actions including beam on or off",
        "post-mortem data acquisition",
        "and beam distribution on the beam lines. The results of the timing control system for the beam gate and beam distribution are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha138_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha138.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha138_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA138",
      "page_number": "551",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA139",
      "title": "Implementation of the PLC based Machine Protection System for Magnets at ESS",
      "authors": [
        "D. Sánchez-Valdepeñas",
        "M. Carroll",
        "A. Nordt",
        "M. Zaera-Sanz",
        "ESS",
        "Lund",
        "Sweden",
        "The special properties of the neutrons allow to study the matter structure and dynamics of atoms and molecules. Neutron scattering is applied in a wide range of research fields such as chemistry of materials",
        "biology",
        "magnetism and pharmacy. The European Spallation Source ERIC (ESS) will be the most powerful neutron source in the world with the vision to help the researchers to develop new solutions for the challenges of our time. Inside the Integrated Control System Division (ICS)",
        "the Protection Systems group will provide a Beam Interlock System to protect the beam and to avoid the activation of equipment. One of these interlock systems is the Machine Protection System for Magnets (MPSMag)",
        "which collects the signals coming from each of the 150 quadrupoles distributed along the 600 meters long LINAC to prevent beam losses. The MPSMag first prototype has been implemented using industrial Programmable Logic Controllers (PLCs)",
        "the Profinet real-time fieldbus communications protocol",
        "and Siemens TIA Portal software to fulfill the high availability requirements of the facility. The concept of operation",
        "the state machine",
        "and the electrical design will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha139_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha139.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha139_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA139",
      "page_number": "554",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA140",
      "title": "Current Status of KURAMA-II",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha140_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha140.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha140_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA140",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA141",
      "title": "Dynamic System Reliability Modelling of SLAC’s Radiation Safety Systems",
      "authors": [
        "F. Tao",
        "K.W. Belt",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "When the LCLS-II project is complete",
        "there will be three major Department of Energy (DOE) beam programs occupying the same 2-mile long accelerator tunnel",
        "e.g. LCLS",
        "LCLS-II and FACET-II. In addition to the geographical overlap",
        "the number of beam loss monitors of all types has been also significantly expanded to detect power beam loss from all sources. All these factors contribute to highly complex Radiation Safety Systems (RSS) at SLAC. As RSS are subject to rigorous configuration control",
        "and their outputs are permits directly related to beam production",
        "even small faults can cause a long down time. As all beam programs at SLAC have the 95% beam availability target",
        "the complex RSS’s contribution to overall beam availability and maintainability is an important subject worth detailed analysis. In this paper",
        "we apply the dynamic system reliability engineering techniques to create the RSS reliability model for all three beam programs. Both qualitative and semi-quantitative approaches are used to identify the most critical common causes",
        "the most vulnerable subsystem as well as the areas that require future design improvement for better maintainability."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha141_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha141.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha141_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA141",
      "page_number": "558",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA142",
      "title": "FACET-II Radiation Safety Systems Development",
      "authors": [
        "F. Tao",
        "B.M. Bennett",
        "N. Lipkowitz",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Facility for Advanced Accelerator Experimental Tests (FACET)-II is an upgrade of the FACET. It uses the middle third of SLAC’s 2-mile long linear accelerator to accelerate the electron beam to 10 GeV",
        "with positron beam to be added in the Stage 2 of the project. Once the project completes in late 2019",
        "it will be operated as a Department of Energy (DOE) user facilities for advanced accelerator science studies. In this paper",
        "we will describe the Radiation Safety Systems (RSS) design and implementation for FACET-II project. RSS include Personnel Protection System (PPS) and Beam Containment System (BCS). Though both systems are safety critical",
        "different technologies are used to implement safety functions. PPS uses Siemens PLC as the backbone for control but legacy CAMAC for data acquisition",
        "while BCS develops customized electronics for faster response to protect safety devices from radiation induced damage."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha142_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha142.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha142_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA142",
      "page_number": "562",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA143",
      "title": "Motion Control Development of the Material Handling System for Industrial Linac Project at SLRI",
      "authors": [
        "R. Rujanakraikarn",
        "P. Koonpong",
        "S. Tesprasitte",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand"
      ],
      "institutions": [
        "The prototype of industrial linac for food irradiation application using x-ray has been under development at Synchrotron Light Research Institute (SLRI). Several subsystems of the machine are carefully designed for proper operation. Material handling system with its motion control and its relationship with a beam scanning system is explained in this paper. Hardware selection and software development together with a networked control system is described. This system is being developed and tested with the object detection system to monitor and control the position and velocity of materials on a conveyor belt."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha143_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha143.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha143_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA143",
      "page_number": "566",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA144",
      "title": "Development of a New Data Acquisition System for a Photon Counting Detector Prototype at SOLEIL Synchrotron",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha144_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha144.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha144_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA144",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA145",
      "title": "Evolution of the CERN LINAC 4 Intensity Interlock System Using a Generic, Real-Time Comparator in C++",
      "authors": [
        "A. Topaloudis",
        "J.C. Allica Santamaria",
        "CERN",
        "Geneva",
        "Switzerland",
        "During the commissioning phase of LINAC 4",
        "three watchdog interlock systems were used to protect the accelerator and its equipment. These systems cut the beam if losses",
        "calculated by combining the intensity measurements at various locations",
        "exceed some predefined thresholds. While the existing systems were designed to be simple and robust to ensure safety",
        "the future connection of the linac to the Proton Synchrotron Booster (PSB) requires new instances of these systems with additional requirements. Such requirements include the remote communication of the watchdogs with the intensity measurement systems to decouple any physical dependency between the two systems",
        "and the arithmetical/logical combination of the measured data based on the watchdog location. As the Controls Interlocks Beam User (CIBU) hardware interface to the Beam Interlock Controller (BIC) is simple",
        "the software part of the system can be re-designed to be application agnostic giving a single decision after performing a configurable set of comparisons. This paper describes the upgrade of the software of the existing watchdog interlock system to a generic comparator",
        "enabling its usage for other applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha145_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha145.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha145_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA145",
      "page_number": "570",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA147",
      "title": "Integrating the First SKA MPI Dish Into the MeerKAT Array",
      "authors": [
        "S.N. Twum",
        "A.F. Joubertpresenter",
        "K. Madisa",
        "SARAO",
        "Cape Town",
        "South Africa",
        "The 64-antenna MeerKAT interferometric radio telescope is a precursor to the SKA which will host hundreds of receptor dishes with a collecting area of 1 sq km. During the pre-construction phase of the SKA1 MID",
        "the SKA DSH Consortium plans to build",
        "integrate and qualify an SKA1 MID DSH Qualification Model (SDQM) against MeerKAT. Before the system level qualification testing can start on the SDQM",
        "the qualified Dish sub-elements have to be integrated onto the SDQM and set to work. The SKA MPI DISH",
        "a prototype SKA dish funded by the Max Planck Institute",
        "will be used for early verification of the hardware and the control system. This prototype dish uses the TANGO framework for monitoring and control while MeerKAT uses the Karoo Array Telescope Control Protocol (KATCP). To aid the integration of the SKA MPI DSH",
        "the MeerKAT Control and Monitoring (CAM) subsystem has been upgraded by incorporating a translation layer and a specialized SKA antenna proxy that will enable CAM to monitor and command the SKA dish as if it were a MeerKAT antenna."
      ],
      "institutions": [
        "Funding: National Research Foundation"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha147_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha147.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha147_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA147",
      "page_number": "575",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA149",
      "title": "Accelerator Schedule Management at CERN",
      "authors": [
        "B. Urbaniec",
        "C. Roderick",
        "CERN",
        "Geneva",
        "Switzerland",
        "Maximizing the efficiency of operating CERN’s accelerator complex requires careful forward planning",
        "and synchronized scheduling of cross-accelerator events. These schedules are of interest to many people helping them to plan and organize their work. Therefore",
        "this data should be easily accessible",
        "both interactively and programmatically. Development of the Accelerator Schedule Management (ASM) system started in 2017 to address such topics and enable definition",
        "management and publication of schedule data in generic way. The ASM system currently includes three core modules to manage: Yearly accelerator schedules for the CERN Injector complex and LHC; Submission and scheduling of Machine Development (MD) requests with supporting statistics; Submission",
        "approval",
        "scheduling and follow-up of control system changes and their impact. This paper describes the ASM Web application (built with Angular",
        "TypeScript and Java) in terms of: Core scheduling functionality; Integration of external data sources; Provision of programmatic access to schedule data via a language agnostic REST API (allowing other systems to leverage schedule data)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha149_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha149.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha149_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA149",
      "page_number": "579",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA150",
      "title": "Performance of the ALICE Luminosity Leveling Software Architecture in the Pb-Pb Physics Run",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha150_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha150.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha150_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA150",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA151",
      "title": "Feasibility of Hardware Acceleration in the LHC Orbit Feedback Controller",
      "authors": [
        "L. Grech",
        "D. Alves",
        "S. Jackson",
        "J. Wenninger",
        "CERN",
        "Meyrin",
        "Switzerland",
        "University of Malta",
        "Information and Communication Technology",
        "Msida",
        "Malta",
        "Orbit correction in accelerators typically make use of a linear model of the machine",
        "called the Response Matrix (RM)",
        "that relates local beam deflections to position changes. The RM is used to obtain a Pseudo-Inverse (PI)",
        "which is used in a feedback configuration",
        "where positional errors from the reference orbit as measured by Beam Position Monitors (BPMs) are used to calculate the required change in the current flowing through the Closed Orbit Dipoles (CODs). The calculation of the PIs from the RMs is a crucial part in the LHC’s Orbit Feedback Controller (OFC)",
        "however in the present implementation of the OFC this calculation is omitted as it takes too much time to calculate and thus is unsuitable in a real-time system. As a temporary solution the LHC operators pre-calculate the new PIs outside the OFC",
        "and then manually upload them to the OFC in advance. In this paper we aim to find a solution to this computational bottleneck through hardware acceleration in order to act automatically and as quickly as possible to COD and/or BPM failures by re-calculating the PIs within the OFC. These results will eventually be used in the renovation of the OFC for the LHC’s Run 3."
      ],
      "institutions": [],
      "abstract": "G. Valentinopresenter",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha151_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha151.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha151_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA151",
      "page_number": "584",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA152",
      "title": "Use of Multi-Network Fieldbus for Integration of Low-Level Intelligent Controller Within Control Architecture of Fast Pulsed System at CERN",
      "authors": [
        "N. Voumard",
        "C. Boucly",
        "M.P. Pimentel",
        "L. Strobino",
        "P. Van Trappenpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Fieldbuses and Industrial Ethernet networks are extensively used for the control of fast-pulsed magnets at CERN. With the ongoing trend to develop increasingly more complex low-level intelligent controllers near to the actuators and sensors",
        "the flexibility to integrate these within different control architectures grows in importance. In order to reduce development efforts and keep the fieldbus choice open",
        "a multi-network field-bus technology has been selected for the network interfacing part of the controllers. Such an approach has been successfully implemented for several projects such as the development of high voltage capacitor chargers/dischargers",
        "the surveillance of floating solid-state switch and the monitoring of a power triggering system that",
        "today",
        "are interfaced either to PROFIBUS-DP or PROFINET networks. The integration of various fieldbus interfaces within the controller and the required embedded software/gateware to manage to network communication are presented. The gain in flexibility",
        "modularity and openness obtained through this approach is also reviewed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha152_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha152.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha152_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA152",
      "page_number": "589",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA153",
      "title": "SoC Technology for Embedded Control and Interlocking Within Fast Pulsed Systems at CERN",
      "authors": [
        "P. Van Trappen",
        "E. Carlier",
        "M. Gauthier",
        "N. Magnin",
        "E.J. Oltedal",
        "J. Schipper",
        "CERN",
        "Geneva",
        "Switzerland",
        "The control of pulsed systems at CERN requires often the use of fast digital electronics to perform tight timing control and fast protection of high-voltage pulsed generators. For the implementation of such functionalities",
        "a FPGA is the perfect candidate for the digital logic",
        "however with limited integration potential within the control system. The market push for integrated devices",
        "so called System on a Chip (SoC) - a tightly coupled ARM processing system and specific programmable logic in a single device",
        "has allowed a better integration of the various components required for the control of pulsed systems. This technology is used for the implementation of fast switch interlocking logic",
        "integrated within the CERN control framework by using embedded Linux running a Snap7 server. It is also used for the implementation of a lower-tier communication bridge between a front-end computer and a high fan-out multiplexing programmable logic for timing and analogue low-level control. This paper presents these two projects where the SoC technology has been deployed and discusses possible further applications within distributed real-time control architecture for distributed pulsed systems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha153_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha153.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha153_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA153",
      "page_number": "592",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA154",
      "title": "Data Acquisition System Deployment Using Docker Containers for the SMuRF Project",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The SLAC Microresonator Radio Frequency (SMuRF) system is being developed as a readout system for next generation Cosmic Microwave Background (CMB) cameras*. It is based on a FPGA board where the real-time digital processing algorithms are implemented",
        "and high-level applications running in an industrial PC. The software for this project is based on C++ and Python and it is in active development. The software follows the client-server model where the server implements the low-level communication with the FGPA while high-level applications and data processing algorithms run on the client. SMuRF systems are being deployed in several institutions and in order to facilitate the management of the software application releases",
        "dockers containers are being used. Docker images",
        "for both servers and clients",
        "contain all the software packages and configurations needed for their use. The images are tested",
        "tagged",
        "and published in one place. They can then be deployed in all other institutions in minutes with no extra dependencies. This paper describes how the docker images are designed and build",
        "and how continuous integration tools are used in their release cycle for this project."
      ],
      "institutions": [],
      "abstract": "*arXiv:1809.03689 [astro-ph.IM]",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha154_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha154.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha154_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA154",
      "page_number": "597",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA156",
      "title": "The Linux Device Driver Framework for High-Throughput Lossless Data Streaming Applications",
      "authors": [
        "K. Vodopivec",
        "J.E. Breeding",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "ORNL RAD",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Many applications in experimental physics facilities require custom hardware solutions to control process parameters or to acquire data at high rates with high integrity. These hardware solutions typically require custom software implementations. The neutron scattering detectors at the Spallation Neutron Source at ORNL* implement custom protocols over optical fiber connected to a PCI express based read-out board. A dedicated kernel device driver provides an interface to the software application and must be able to sustain data bursts from a pulsed source while acquiring data for long periods of time. The same optical channel is also used as low-latency communication link to detector electronics for configuration and real time fault detection. This paper presents a Linux device driver design",
        "implementation challenges in a low-latency high-throughput setup",
        "real use case benchmarks and importance of clean application programming interface for seamless integration in control systems. This software implementation was developed as a generic framework and has been extended beyond neutron data acquisition. It is suitable to diverse applications where it allows for rapid FPGA development."
      ],
      "institutions": [
        "*Oak Ridge National Laboratory"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha156_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha156.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha156_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA156",
      "page_number": "602",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA157",
      "title": "Global Information Management System for HEPS",
      "authors": [
        "C.H. Wang",
        "C.P. Chu",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "HEPS is a big complex science facility which consists of the accelerator",
        "the beam lines and general facilities. The accelerator is made up of many subsystem and a large number of components such as magnets",
        "power supply",
        "high frequency and vacuum equipment",
        "etc. Variety of components and equipment with cables are distributed installation with distance to each other. These components during the stage of the design and construction and commissioning will produce tens of thousands of data. The information collection and storage and management for so much data for a large scientific device is particularly important. This paper describes the HEPS database design and application from the construction and installation and put into operations generated by the uniqueness of huge amounts of data",
        "in order to fully improve the availability and stability of the accelerator",
        "and experiment stations",
        "and further improve the overall performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha157_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha157.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha157_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA157",
      "page_number": "606",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA158",
      "title": "Compact Electronic Logbook System",
      "authors": [
        "L. Wang",
        "M.T. Kang",
        "X. Wu",
        "IHEP CSNS",
        "Guangdong Province",
        "People’s Republic of China",
        "C.P. Chupresenter",
        "F.Q. Guo",
        "Y.C. He",
        "D.P. Jin",
        "J. Liu",
        "Y.L. Zhang",
        "Z. Zhao",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "Compact Electronic Logbook System (Clog) is designed to record the events in an organized way during operation and maintenance of an accelerator facility. Clog supports functionalities such as log submission",
        "attachment upload",
        "easy to retrieve logged messages",
        "RESTful API and so on",
        "which aims to be compact enough for anyone to conveniently deploy it and anyone familiar with Java EE (Enterprise Edition) technology can easily customize the functionalities. After the development is completed",
        "Clog can be used in accelerator facilities such as BEPC-II (Beijing Electron/Positron Collider Upgrade) and HEPS (High Energy Photon Source). This paper presents the design",
        "implementation and development status of Clog."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha158_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha158.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha158_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA158",
      "page_number": "611",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA160",
      "title": "Enabling Data Analytics as a Service for Large Scale Facilities",
      "authors": [
        "K. Woods",
        "R.J. Clegg",
        "N.S. Cook",
        "R. Millward",
        "Tessella",
        "Abingdon",
        "United Kingdom",
        "F. Barnsely",
        "C. Jones",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The Ada Lovelace Centre (ALC) at STFC is an integrated",
        "cross-disciplinary data intensive science centre",
        "for better exploitation of research carried out at large scale UK Facilities including the Diamond Light Source",
        "the ISIS Neutron and Muon Facility",
        "the Central Laser Facility and the Culham Centre for Fusion Energy. ALC will provide on-demand",
        "data analysis",
        "interpretation and analytics services to worldwide users of these research facilities. Using open-source components",
        "ALC and Tessella have together created a software infrastructure to support the delivery of that vision. The infrastructure comprises a Virtual Machine Manager",
        "for managing pools of VMs across distributed compute clusters; components for automated provisioning of data analytics environments across heterogeneous clouds; a Data Movement System",
        "to efficiently transfer large datasets; a Kubernetes cluster to manage on demand submission of Spark jobs. In this paper",
        "we discuss the challenges of creating an infrastructure to meet the differing analytics needs of multiple facilities and report the architecture and design of the infrastructure that enables Data Analytics as a Service."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha160_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha160.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha160_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA160",
      "page_number": "614",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA161",
      "title": "Scalable High Demand Analytics Environments with Heterogeneous Clouds",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha161_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha161.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha161_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA161",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA162",
      "title": "SharePoint for HEPS Technical Systems and Project Management",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha162_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha162.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha162_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA162",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA163",
      "title": "The Detector Control System of the Muon Forward Tracker for the ALICE Experiment at LHC",
      "authors": [
        "Hiroshima University",
        "Faculty of Science",
        "Higashi-Hirosima",
        "Japan",
        "ALICE is the LHC experiment specifically devoted to the study of heavy-ion collisions. The Muon Forward Tracker (MFT) is one of the new detectors developed in the framework of the upgrade programs towards the LHC Run 3 starting from 2021. A Detector Control System (DCS) was developed for the MFT within the new framework of the upgraded ALICE central DCS. In this framework",
        "detectors will deliver physics raw data as well as slow control data. The central DCS will be composed of an interface",
        "named Alice Low level FRont-End Device (ALFRED)",
        "to convert high-level words within the DCS to low-level words which are sent to the detector FEE as commands. Used Supervisory Control And Data Acquisition (SCADA) is WinCC Open Architecture (OA). In addition",
        "Joint Control Project Framework is installed to provide standard DCS solutions such as a Finite State Machine (FSM) commonly used by the LHC experiments. The FSM",
        "as a base of the DCS hierarchy",
        "was fully developed and successfully tested. A test bench of the MFT DCS was built as a minimal setup of the full DCS chain consisting of WinCC OA",
        "ALFRED",
        "a demonstration board of a DCS chip and a readout board. The latest status will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha163_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha163.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha163_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA163",
      "page_number": "617",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA164",
      "title": "Wire Scanner for High Intensity Beam Profile Diagnostics",
      "authors": [
        "J. Yan",
        "J. Gubeli",
        "K. Jordan",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "University of Tennessee",
        "Knoxville",
        "USA",
        "A control and data acquisition system of a high speed wire scanner is developed for high intensity beam profile diagnostics. The control system of the wire scanner includes two IOCs",
        "a Soft IOC and a VME IOC. The Soft IOC connects with an Aerotech Ensemble motor drive through EPCIS motor record and controls the movement of the wire scanner. An Electrical Input card samples the real-time position of the wire through an incremental encoder",
        "and generates a pulse to synchronize a VME ADC data acquisition card",
        "which digitizes and samples the beam-induced signal after pre-amplification. A VME Relay Output card is installed to control the Brake Solenoid and Actuator Solenoid. All the VME I/O cards are installed on one VME crate and controlled by the VME IOC. The system configuration and software of the wire scanner are under development.",
        "Authored by Jefferson Science Associates",
        "LLC under U.S. DOE Contract No. DE-AC05-06OR23177."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha164_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha164.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha164_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA164",
      "page_number": "622",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA165",
      "title": "An Embedded IOC for 100 MeV Cyclotron RF Control",
      "authors": [
        "Z.G. Yin",
        "X.L. Fu",
        "X.T. Lu",
        "T.J. Zhang",
        "CIAE",
        "Beijing",
        "People’s Republic of China",
        "North China University of Technology",
        "Beijing",
        "People’s Republic of China",
        "An ARM9 based embedded controller for 100 MeV cyclotron RF control has been successfully developed and tested with EPICS control software. The controller is implemented as a 3U VME long card",
        "located in the first slot of the LLRF control crate",
        "as a supervise module that continuously monitors the status of the RF system through a costume designed backplane and related ADCs located on other boards in the crate. For high components density and signal integrate considerations",
        "the PCB layout adopts a 6-layer design. The Debian GNU/Linux distribution for the ARM architecture has been selected as operating system for both robustness and convenience. EPICS device support as well as Linux driver routings has been written and tested to interface database records to the on board 12 multichannel 16-bit ADCs and DACs. In the meantime",
        "a chip selecting encoding-decoding strategy has been implemented from both software and hardware aspects to extend the SPI bus of the AT91SAM9g20 processor. The detailed software as well as hardware designed will be reported in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha165_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha165.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha165_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA165",
      "page_number": "625",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA167",
      "title": "Cloud Computing Platform for High-level Physics Applications Development",
      "authors": [
        "T. Zhang",
        "D.G. Maxwell",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha167_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha167.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha167_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA167",
      "page_number": "629",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPHA168",
      "title": "Prototype Design for Upgrading East Safety and Interlock System",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha168_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha168.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha168_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA168",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA169",
      "title": "Design of Vacuum Control System for Superconducting Accelerator",
      "authors": [
        "J.M. Zhou",
        "A.L. Li",
        "K.N. Li",
        "C.H. Peng",
        "J. Zheng",
        "CIAE",
        "Beijing",
        "People’s Republic of China",
        "A linear superconducting accelerator is being constructed in our institute. Its vacuum control system should be convenient and reliable. We intend to concentrate the control of each vacuum unit into a control box that implement the simple hard interlocking logic and the final action output of the vacuum device and the complete interlocking logic between the vacuum devices is realized in the PLC. Operators can perform local operation through the front panel of the control box or remotely control through the computer by switching the local/remote switch. In addition",
        "the control flow of vacuum extraction and the protection flow when leakage occurs are also given in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha169_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha169.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha169_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA169",
      "page_number": "634",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA172",
      "title": "Data Streaming With Apache Kafka for CERN Supervision, Control and Data Acquisition System for Radiation and Environmental Protection",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha172_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha172.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha172_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA172",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPHA173",
      "title": "Graphical User Interface Programming Challenges Moving Beyond Java Swing and JavaFX",
      "authors": [
        "S. Bart Pedersen",
        "S. Jackson",
        "CERN",
        "Geneva",
        "Switzerland",
        "Oracle",
        "the owner of Java",
        "announced in 2018 that they would stop supporting their Swing and JavaFX technologies within the next decade. These technologies have fulfilled the graphical user interface (GUI) needs of CERN accelerator operation for over 2 decades",
        "but their impending eradication has triggered an initiative to choose alternative technologies to develop future GUIs. Hundreds of existing applications will also need to be migrated or rewritten. The challenges to replace Java GUIs are numerous. The programmers will have to adapt and be retrained. The performance of the new GUI technologies will have to be at least as performant as the existing Java technologies. The programming environment",
        "code versioning",
        "dependency management and documentation will all need to be considered. This paper provides an overview of research comparing candidate GUI technologies and explains the selection of two main language families as possible replacements for Swing and JavaFX: Web applications (combining Java/JavaScript and web sockets) and Python PyQt (C++ based graphical library)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2019/talks/mopha173_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2019/papers/mopha173.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2019/posters/mopha173_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2019-MOPHA173",
      "page_number": "637",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 132,
  "scrape_time": "2025-10-10 18:10:13"
}