{
  "session_info": {
    "id": "TUZAT01",
    "name": "TUZAT01 - WG5 (MDI) (plenary)",
    "url": "https://proceedings.jacow.org/eefact2022/html/tuzat01.htm"
  },
  "papers": [
    {
      "paper_id": "TUZAT0101",
      "title": "IR Design Issues for High Luminosity and Low Backgrounds",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA"
      ],
      "institutions": [
        "New ee collider designs use high beam currents (>1 A) to help obtain a high luminosity value. This leads to several issues that affect detector background levels. I will discuss several of these issues and indicate some of the backgrounds the detectors at these new colliders will encounter. The experience of the first two B-factories (PEP-II and KEKB) and also of the currently operating SuperKEKB accelerator will be used and the discussion will also include the new Electron-Ion Collider to be built at Brookhaven National Laboratory."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/tuzat0101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/tuzat0101.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/tuzat0101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-TUZAT0101",
      "page_number": "65",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZAT0103",
      "title": "Beam-Induced Background Simulation and Measurements in Belle II at SuperKEKB",
      "authors": [
        "University of Hawaii",
        "Honolulu",
        "USA",
        "Seeking New Physics beyond the Standard Model",
        "the Belle~II experiment at the SuperKEKB electron-positron collider has already reached a peak luminosity of about 4.7·1034 cm-2.s-1. Its unprecedented target luminosity of 6.3·1035 cm-2.s-1 requires stable machine operation and proper control of beam-induced backgrounds for safe detector operation at high beam currents. The leading background components originating from stored and colliding beams can now be predicted with reasonable accuracy. Dedicated simulations based on the particle tracking software Strategic Accelerator Design (SAD) and Geant4 are used to predict beam-induced backgrounds. These simulations are important for studying realistic collimation scenarios",
        "estimating associated background levels at future machine optics",
        "and making informed choices between possible machine and detector protection upgrades. This paper reports on the Belle~II beam-induced background status in 2021–2022. It overviews background simulation and measurement methodology",
        "and discusses the expected background evolution and mitigation strategies at higher luminosity."
      ],
      "institutions": [
        "Funding: The work is supported by the U.S. Department of Energy (DOE) via Award Number DE-SC0007852 and via U.S. Belle II Operations administered by Brookhaven National Laboratory (DE-SC0012704)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/tuzat0103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/tuzat0103.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/tuzat0103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-TUZAT0103",
      "page_number": "71",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 08:34:49"
}