{
  "session_info": {
    "id": "THAO",
    "name": "THAO - Transverse Profile, Emittance Monitors and Machine Learning",
    "url": "https://proceedings.jacow.org/ibic2020/html/thao.htm"
  },
  "papers": [
    {
      "paper_id": "THAO01",
      "title": "Machine Learning-based Beam Size Stabilization",
      "authors": [
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "In state-of-the-art synchrotron light sources the overall source stability is presently limited by the achievable level of electron beam size stability. This source size stability is presently on the few-percent level",
        "which is still 1-2 orders of magnitude larger than already demonstrated stability of source position/angle (slow/fast orbit feedbacks) and current (top-off injection). Until now",
        "source size stabilization has been achieved through corrections based on a combination of static predetermined physics models and lengthy calibration measurements (feed-forward tables)",
        "periodically repeated to counteract drift in the accelerator and instrumentation. We now demonstrate for the first time [PRL 123 194801 (2019)]",
        "how application of machine learning allows for a physics- and model-independent stabilization of source size relying only on previously existing instrumentation in ALS. Such feed-forward correction based on neural networks that can be continuously online-retrained achieves source size stability as low as 0.2 microns rms (0.4%) which results in overall source stability approaching the sub-percent noise floor of the most sensitive experiments."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/thao01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/thao01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/thao01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-THAO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THAO02",
      "title": "Using Machine Learning Tools to Predict Accelerator Failure",
      "authors": [
        "M. Reščič",
        "R. Seviour",
        "University of Huddersfield",
        "Huddersfield",
        "United Kingdom",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "Modern particle accelerator facilities are continuously introducing improved beam diagnostics",
        "data acquisition",
        "storage and analysis capabilities. Although the increased volume of data this generates makes manual analyse and understand the acquired data very difficult. In this paper we propose the use of machine learning to better understanding of beam failures. The proposed methods allow for both precognitive failure prediction and failure classification",
        "determined using existing beam diagnostics infrastructure. Where we present the concept of tuning classifier parameters and pulse properties to refine datasets. As a demonstrator we apply our machine learning algorithm to analysis the vast data generated by the Oakridge Spallation Neutron Source (SNS) Differential Beam Current Monitoring (DBCM) diagnostics system. We show that analysis of the SNS DBCM data using machine learning",
        "particle accelerator failure can be identified prior to the actual machine failure with 92% accuracy. Importantly",
        "our research shows that emergent behavior regarding machine failure is encoded in the beam pulses prior to failure actually occurring."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/thao02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/thao02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/thao02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-THAO02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THAO03",
      "title": "Source Size and Emittance Measurements for Low-Emittance Light Sources",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "L.D. Chapman",
        "L.O. Dallin",
        "CLS",
        "Saskatoon",
        "Saskatchewan",
        "Canada",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Radiation-based techniques for measuring electron source sizes are widely used as emittance diagnostics at existing synchrotron sources. In this presentation",
        "we review different radiation-based methods which are being considered as source diagnostics for low emittance synchrotron storage rings. Three of these systems - pinhole imaging",
        "double-slit interferometry",
        "and a K-edge filter-based beam position and size monitor (ps-BPM) system - are studied in detail and optimized for small source size measurements. Each method has its advantages and limitations and provides complementary information. Pinhole imaging is the most commonly used technique which has the simplest setup but with limited resolution. Double-slit interferometry gives the highest sensitivity among the three methods. The ps-BPM system has reasonable resolution in measuring source size and divergence",
        "and at the same time",
        "provides real-time information on source position and angle. A combination of multiple techniques is recommended for the full characterization of the source."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/thao03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/thao03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/thao03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-THAO03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THAO04",
      "title": "Beam Coupling Impedance Analyze Using Bunch-by-Bunch Measurement",
      "authors": [
        "University of Chinese Academy of Sciences",
        "Beijing",
        "People’s Republic of China",
        "Y.B. Leng",
        "X.Y. Xu",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "Beam coupling impedance is very important parameters for advanced synchrotron radiation facilities. Till now there is no online method to measure beam impedance directly. But some beam parameters such as betatron tune amplitude and frequency",
        "synchrotron phase",
        "bunch lifetime and so on",
        "can be modulated by beam impedance effects. So wake field and beam impedance information could be retrieved by measuring bunch-by-bunch beam 3D positions and analyzing bunch index dependency of above beam parameters. A bunch-by-bunch 3D positions and charge measurement system had been built at SSRF for this purpose and the performance is not good enough for beam impedance analyze due to cross talk between bunches. We upgraded the measurement system to minimize cross talk and improve resolution this year. New beam experiment results and corresponding analyze will be introduced in this paper."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/thao04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/thao04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/thao04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-THAO04",
      "page_number": "202",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAO05",
      "title": "Advanced Laser-driven Plasma Accelerator Electron-beam Diagnostics with COTR Techniques",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "M. Downer",
        "M. LaBerge",
        "The University of Texas at Austin",
        "Austin",
        "Texas",
        "USA",
        "HZDR",
        "Dresden",
        "Germany",
        "Private Address",
        "Silver Spring",
        "USA",
        "A significant advance in laser-driven plasma accelerator (LPA) electron-beam diagnostics has recently been demonstrated based on coherent optical transition radiation (COTR) imaging*. We find COTR signal strengths from a microbunched subset of beam exiting the LPA to be several orders of magnitude higher than that of incoherent optical transition radiation (OTR). The transverse sizes are only a few microns as deduced from the point-spread-function-related lobe structure. In addition",
        "the far-field COTR interferometric images obtained on the same shot provide beam-size limits plus divergence and pointing information at the sub-mrad level when compared to an analytical model** with a recent revision. The integrated image intensities can be used to estimate the microbunching fraction and relatable to the LPA process. Initial results in a collaborative experiment at the Helmholtz-Zentrum Dresden-Rossendorf LPA will be reported for electron beam energies of about 215 MeV.",
        "* A.H. Lumpkin",
        "M. LaBerge",
        "D.W. Rule et al.",
        "\"Interferometric Optical Signature.\"",
        "subm. to Phys. Rev.Lett.(2019).  ** D.W. Rule",
        "A.H. Lumpkin",
        "Proc. of PAC2001",
        "Vol. 2",
        "pp. 1288-1290 (IEEE 2001)."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/thao05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/thao05.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/thao05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-THAO05",
      "page_number": "206",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAO06",
      "title": "Features of the Metal Microstrip Detectors for Beam Profile Monitoring",
      "authors": [
        "V.M. Pugatch",
        "O.S. Kovalchuk",
        "D. Ramazanovpresenter",
        "NASU/INR",
        "Kiev",
        "Ukraine",
        "Features of Metal Microstrip Detectors (MMD) are presented for application in beam profile monitoring of charged particles and synchrotron radiation beams. Through an innovative plasma-chemistry etching production process*",
        "thin metal micro-strips only 1-2μm thick are aligned. Because of the very thin nature of the strips",
        "the MMD is nearly transparent",
        "and can be used in-situ for measuring",
        "tuning and imaging the beam online. Metal structure of sensors guaranties high radiation tolerance (about 100MGy) providing their stable response to the beam particles (by the secondary electron emission) independent upon the accumulated fluence. The spatial resolution of the MMD is determined by the strips pitch constituting from 5 to 100µm in currently manufactured samples*. The data were obtained with MMDs read out by the low noise X-DAS system** providing integration time from 1 to 500ms",
        "and the ability to process signals in real time. The scope of MMD & X-DAS is scientific and applied research using beams: in control systems of accelerators and synchrotron radiation sources. New possibilities are discussed for equipment requiring high spatial resolution and radiation hardness.",
        "* V.M. Pugatch et al. Plasma technologies for manufacturing micro-strip metal detectors for ionizing radiation. Series «Plasma Physics» (13). 2007",
        "№ 1",
        "p. 173-175.  ** sens-tech.com"
      ],
      "institutions": [
        "Funding: National academy of sciences, Ukraine"
      ],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted! reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2020/talks/thao06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2020/papers/thao06.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2020/posters/thao06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2020-THAO06",
      "page_number": "211",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-10 17:42:57"
}