{
  "session_info": {
    "id": "WEA1PL",
    "name": "WEA1PL - Plenary Session C",
    "url": "https://proceedings.jacow.org/fls2018/html/wea1pl.htm"
  },
  "papers": [
    {
      "paper_id": "WEA1PL01",
      "title": "Status and Prospects for Plasma Accelerator Based Light Sources",
      "authors": [
        "TUB",
        "Beijing",
        "People's Republic of China",
        "In the past decade",
        "the field of plasma based accelerators and light sources has witnessed remarkable progresses worldwide. In this talk",
        "the current status of light sources based on plasma accelerators will be reviewed. For incoherent synchrotron like sources",
        "the development and preliminary applications of Betatron and inverse-Compton X/Gamma-ray sources will be discussed. For coherent sources",
        "the development of intense THz and Infrared sources based on plasma nonlinear optics",
        "as well as EUV/X-ray sources based on FELs will be discussed",
        "with an emphasis on the challenges and opportunities of compact FELs based on laser and beam driven wakefield accelerators. Particularly",
        "the prospects of generating high quality electron beams with extremely high brightness in plasma accelerators and its implication for future light source development will be discussed in details.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R.J. England",
        "Z. Huang",
        "SLAC",
        "Menlo Park",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "Slides WEA1PL01 [10.688 MB] reference for this paper using Dielectric Accelerators and Other Non-Plasma Accelerator Based Compact Light Sources",
      "presentation_url": "https://proceedings.jacow.org/fls2018/talks/wea1pl01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/fls2018/papers/wea1pl01.pdf",
      "poster_url": "https://proceedings.jacow.org/fls2018/posters/wea1pl01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FLS2018-WEA1PL01",
      "page_number": "74",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEA1PL02",
      "title": "Dielectric Accelerators and Other Non-Plasma Accelerator Based Compact Light Sources",
      "authors": [
        "R.J. England",
        "Z. Huang",
        "SLAC",
        "Menlo Park",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/fls2018/talks/wea1pl02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/fls2018/papers/wea1pl02.pdf",
      "poster_url": "https://proceedings.jacow.org/fls2018/posters/wea1pl02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FLS2018-WEA1PL02",
      "page_number": "74",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEA1PL03",
      "title": "Attosecond Timing",
      "authors": [
        "Deutsches Elektronen Synchrotron (DESY) and Center for Free Electron Science (CFEL)",
        "Hamburg",
        "Germany",
        "CFEL",
        "Hamburg",
        "Germany",
        "Cycle GmbH",
        "Hamburg",
        "Germany",
        "DESY",
        "Hamburg",
        "Germany",
        "Photon-science facilities such as X-ray free-electron lasers (XFELs) and intense-laser facilities are emerging world-wide with some of them producing sub-fs X-ray pulses. These facilities are in need of a high-precision timing distribution system",
        "which can synchronize various microwave and optical sub-sources across multi-km distances with attosecond precision. Here",
        "we report on a synchronous laser-microwave network that permits attosecond precision across km-scale distances. This was achieved by developing new ultrafast timing metrology devices and carefully balancing the fiber nonlinearities and fundamental noise contributions in the system. New polarization-noise-suppressed balanced optical crosscorrelators and free-space-coupled balanced optical-microwave phase detectors for improved noise performance have been implemented. Residual second- and third-order dispersion in the fiber links are carefully compensated with additional dispersion-compensating fiber to suppress link-induced Gordon-Haus jitter and to minimize output pulse duration; the link power is stabilized to minimize the nonlinearity-induced jitter as well as to maximize the signal to noise ratio for locking.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Funding: This work was supported by DESY and the European Research Council under the European Union's Seventh Framework Program (FP/2007-2013) / ERC Grant Agreement No. 609920."
      ],
      "abstract": "Slides WEA1PL03 [5.888 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-FLS2018-WEA1PL03 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/fls2018/talks/wea1pl03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/fls2018/papers/wea1pl03.pdf",
      "poster_url": "https://proceedings.jacow.org/fls2018/posters/wea1pl03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FLS2018-WEA1PL03",
      "page_number": "79",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:08:40"
}