{
  "session_info": {
    "id": "WEXAA",
    "name": "WEXAA - Accelerator System and Components",
    "url": "https://proceedings.jacow.org/hiat2018/html/wexaa.htm"
  },
  "papers": [
    {
      "paper_id": "WEXAA01",
      "title": "SHE-Factory: new cyclotron facility for super heavy element research",
      "authors": [
        "I.V. Kalagin",
        "S.N. Dmitriev",
        "G.G. Gulbekyan",
        "Y.T. Oganessian",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The synthesis of heavy and the heaviest elements and the study of their nuclear and chemical properties are of highest priority in the basic research programme of the Flerov Laboratory of Nuclear Reactions. The synthesis of super heavy elements (SHE) with atomic numbers 113-118 has been achieved in the 48Ca-induced reactions. The International Unions of pure and applied physics (IUPAP) and chemistry (IUPAC) recognized the priority of Dubna in the discovery of elements 114 ’ 118. The seventh period of the Periodic Table has been completed. In accordance with the development program",
        "the first in the world Super heavy Element Factory is being built at the Laboratory on the basis of the new DC280 cyclotron which has to provide intensities up to 10 pμA for ions with atomic masses over 50. The main task of the Factory is the synthesis of new chemical elements with atomic numbers 119 and higher",
        "as well as a detailed study of the nuclear and chemical properties of previously discovered superheavy elements. The Factory will be equipped with target materials",
        "new separators and detectors for the study of the nuclear",
        "atomic and chemical properties of the new elements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hiat2018/talks/wexaa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hiat2018/papers/wexaa01.pdf",
      "poster_url": "https://proceedings.jacow.org/hiat2018/posters/wexaa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2018-WEXAA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:37:07"
}