{
  "session_info": {
    "id": "MOBO",
    "name": "MOBO - Status reports and new development I",
    "url": "https://proceedings.jacow.org/ecris2016/html/mobo.htm"
  },
  "papers": [
    {
      "paper_id": "MOBO01",
      "title": "FECRAL - a 45 GHz Fourth Generation ECR Ion Source and Its Technical Challenge",
      "authors": [
        "H.W. Zhao",
        "L.T. Sun",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "A 45 GHz superconducting ECR ion source FECRAL (a Fourth generation ECR ion source with Advanced design in Lanzhou) is going to be built in the next few years as a key technology R&D of HIAF facility. HIAF injector of a superconducting heavy ion linac requests the ion source of delivering 50 pμA of 238U35+ pulsed beam and 25 pμA of 238U35+ CW beam. This presentation will present preliminary technical-design of FECRAL ECR ion source including magnetic field configuration produced by a Nb3Sn superconducting magnet with 6.5 Tesla axial mirror field and 3.5 Tesla sextupole field on the plasma chamber inner wall",
        "20 kW@45 GHz microwave coupling system and beam transport line. Obviously",
        "to build a 45 GHz FECRAL ECR ion source",
        "there will be many technical challenges",
        "such as engineering and fabrication of the Nb3Sn superconducting magnet with 12 Tesla maximum magnetic field on the conductor",
        "cryogenic system of the magnet",
        "efficient coupling of 45 GHz microwave power",
        "intense beam extraction and transmission to achieve good beam quality",
        "integration of the FECRAL ion source system and analyzing beam line at a high voltage platform."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mobo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mobo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mobo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOBO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOBO02",
      "title": "Possible Optimizations of Existing Magnet Structures for the Next Generation of ECRIS",
      "authors": [
        "D. Xie",
        "G.L. Sabbi",
        "D.S. Todd",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Constructing a minimum-B structure with higher magnetic fields is the prerequisite for the next generation of Electron Cyclotron Resonance Ion Sources (ECRIS): ion sources that will operate at substantially higher heating frequencies than those currently in use. There are three leading candidates of Nb3Sn coil structures for use in future ECRISs: a Mixed Axial and Radial field System (MARS) that merges the sextupole racetrack coils and partial end-solenoids into an exotic closed-loop-coil; a classical Sextupole-In-Solenoids design; and a Solenoids-In-Sextupole configuration. Focusing on efficient magnetic field generation",
        "this article briefly reviews the advantages and disadvantages of each of these magnet structures. Though Sextupole-In-Solenoids and Solenoids-In-Sextupole magnetic structures using NbTi conductor have been validated by current ECRISs",
        "improvements of these magnet structures remain possible. Possible optimizations to the two existing magnet structures",
        "such as using a non-conventional sextupole magnet consisting of either V-bend or skew racetrack coils",
        "are discussed. The development status of a MARS NbTi magnet at LBNL for a new ECRIS will be also presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mobo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mobo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mobo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOBO02",
      "page_number": "5",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOBO03",
      "title": "Current Status of a SC-ECRIS of the RAON Accelerator.",
      "authors": [
        "Y.H. Kim",
        "T. Hashimoto",
        "J. Heo",
        "H. Ishiyama",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "Raon is the heavy ion accelerator being built in Korea. It contains 3rd generation SC-ECRIS which uses 28GHz/18GHz microwave power to extract a heavy ion beam. We prepared and installed beam focusing devices and beam diagnostic devices to characterize the ion source. Now the ion source is in beam commissioning status after maintenance activities. After beam commissioning with oxygen beam",
        "a metal ion beam will be extracted at the end of this year using sputtering method."
      ],
      "institutions": [
        "Funding: This work was supported by the Rare Isotope Science Project funded by Ministry of Science, ICT and Future Planning (MSIP) and the National Research Foundation (NRF) of the Republic of Korea"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mobo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mobo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mobo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOBO03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOBO04",
      "title": "Recent Developments of RIKEN 28 GHz SC-ECRIS",
      "authors": [
        "Y. Higurashi",
        "H. Haba",
        "M. Kidera",
        "T. Nakagawa",
        "J. Ohnishi",
        "K. Ozeki",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "In the past two years",
        "we tried to improve the performance of the RIKEN 28GHz SC-ECRIS for production of intense U ion beam. Usually",
        "we used the sputtering method to produce U ion beam. Last year",
        "we produced ~200e μA of U35+ at the injected RF power of ~2.6kW",
        "when slightly adding the U vapor with high temperature oven. For RIKEN RIBF experiment",
        "we produced ~110 e μA of U35+ beam with sputtering method longer than one month without break. In this case",
        "we surly need very stable beam to increase the transmission efficiency in the accelerators and avoid the any damage of the components of the accelerator due to the high power beam. In this contribution",
        "we will report the beam intensity of highly charged U ions as a function of various parameters (magnetic field strength",
        "RF power",
        "sputtering voltage etc.) and the effect of these parameters on the beam stability in detail. We also present the experience of the long term operation of the ion source for the RIKEN RIBF experiments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mobo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mobo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mobo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOBO04",
      "page_number": "10",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:27:14"
}