{
  "session_info": {
    "id": "TUBD",
    "name": "TUBD - Contributed Orals (MC1)",
    "url": "https://proceedings.jacow.org/IPAC2015/html/tubd.htm"
  },
  "papers": [
    {
      "paper_id": "TUBD1",
      "title": "Optics Measurement and Correction during Acceleration with Beta-squeeze in RHIC",
      "authors": [
        "C. Liu",
        "A. Marusic",
        "M.G. Minty",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "In the past",
        "beam optics correction at RHIC has only taken place at injection and at final energy",
        "with interpolation of corrections partially into the acceleration cycle. Recent measurements of the beam optics during acceleration and squeeze have evidenced significant beta-beats that",
        "if corrected",
        "could minimize undesirable emittance dilutions and maximize the spin polarization of polarized proton beams by avoiding the high-order multipole fields sampled by particles within the bunch. We recently demonstrated successfully beam optics corrections during acceleration at RHIC. We verified conclusively the superior control of the beam realized via these corrections. As a valuable by-product",
        "these corrections have minimized the beta-beat at the profile monitors",
        "so providing more precise measurements of the evolution of the beam emittances during acceleration."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tubd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tubd1.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tubd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUBD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBD2",
      "title": "Final Cooling For a High-luminosity High-energy Lepton Collider",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "T.L. Hart",
        "D.J. Summers",
        "UMiss",
        "University",
        "Mississippi",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The final cooling system for a high-energy high-luminosity muon collider requires reduction of the transverse emittance by an order of magnitude to ~0.00003 m (rms",
        "N)",
        "while allowing longitudinal emittance increase to ~0.1m. In the present baseline approach",
        "this is obtained by transverse cooling of low-energy muons within a sequence of high field solenoids with low-frequency rf systems. Recent studies of such systems are presented. Since the final cooling steps are actually emittance exchange a variant form of that final system can be obtained by a round to flat transform in x-y",
        "with transverse slicing of the enlarged flat transverse dimension followed by longitudinal recombination of the sliced bunchlets. Development of final exchange following lowest-emittance cooling is discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tubd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tubd2.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tubd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUBD2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBD3",
      "title": "Effects of Accelerating Structures on On-line DFS in the Main Linac of CLIC",
      "authors": [
        "J. Pfingstner",
        "E. Adli",
        "University of Oslo",
        "Oslo",
        "Norway",
        "CERN",
        "Geneva",
        "Switzerland",
        "Long-term ground motion will create significant dispersion in the time-scale of hours in the main linac of CLIC. To preserve the emittance to an acceptable level",
        "a dispersion correction with on-line dispersion-free steering (DFS) is inevitable. For this on-line technique",
        "the dispersion has to be measured using beam energy variations of only about one per mil in order to not disturb the operation of the accelerator. For such small energy variations",
        "the interaction of the particle beam and the accelerating structures creates large enough additional signals components in the measured dispersion to cause the dispersion correction to not work properly anymore. In this paper",
        "the additional signals are described and their effect on the DFS algorithm is analysed. Finally",
        "methods for the mitigation of the deteriorating signal components are presented and studied via simulations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tubd3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tubd3.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tubd3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUBD3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 20:24:27"
}