{
  "session_info": {
    "id": "WEBL",
    "name": "WEBL - Data Management",
    "url": "https://proceedings.jacow.org/icalepcs2021/html/webl.htm"
  },
  "papers": [
    {
      "paper_id": "WEBL01",
      "title": "FAIRmat - a Consortium of the German Research-Data Infrastructure (NFDI)",
      "authors": [
        "H. Junkes",
        "P. Oppermann",
        "R. Schlögl",
        "A. Trunschke",
        "FHI",
        "Berlin",
        "Germany",
        "M. Krieger",
        "H. Weber",
        "FAU",
        "Erlangen",
        "Germany",
        "A sustainable infrastructure for provision",
        "interlinkage",
        "maintenance",
        "and options for reuse of research data shall be created in Germany in the coming years. The consortium FAIRmat meets the interests of experimental and theoretical condensed-matter physics. This also includes",
        "for example",
        "chemical physics of solids",
        "synthesis",
        "and high-performance computing. All this is demonstrated by use cases from various areas of functional materials. The necessity of a FAIR data infrastructure in the FAIRmat* research field is very pressing. We need and want to support the actual",
        "daily research work to further science. Besides storing",
        "retrieving",
        "and sharing data",
        "a FAIR data infrastructure will also enable a completely new level of research. In the Area D \"Digital Infrastructure\" a Configurable Experiment Control System is to be developed here as a reference. EPICS was selected as an initial open source base system. The control system of the newly founded CATlab** in Berlin will be fully implemented according to the FAIRmat specifications."
      ],
      "institutions": [],
      "abstract": "FAIRmat : https://www.fair-di.eu/fairmat/fairmat/consortium CatLab : https://www.helmholtz-berlin.de/projects/catlab/indexen.html",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/webl01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/webl01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/webl01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-WEBL01",
      "page_number": "558",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBL02",
      "title": "Prototype of Image Acquisition and Storage System for SHINE",
      "authors": [
        "H.H. Lv",
        "D.P. Bai",
        "X.M. Liu",
        "H. Zhao",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "Shanghai HIgh repetition rate XFEL aNd Extreme light facility (SHINE) is a quasi-continuous wave hard X-ray free electron laser facility",
        "which is currently under construction. The image acquisition and storage system has been designed to handle a large quantity of image data generated by the beam and X-ray diagnostics system",
        "the laser system",
        "etc. A prototype system with Camera Link cameras has been developed to acquire and to reliably transport data at a throughput of 1000MB/sec. The image data are transferred through ZeroMQ protocol to the storage where the image data and the relevant metadata are archived and made available for user analysis. For high-speed frames of image data storage",
        "optimized schema is identified by comparing and testing four schemas. The image data are written to HDF5 files and the metadata pertaining to the image are stored in NoSQL database. It could deliver up to 1.2GB/sec storage speed. The performances are also contrasted between a stand-alone server and the Lustre file system. And the Lustre could provide a better performance. Details of the image acquisition",
        "transfer",
        "and storage schemas will be described in the paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/webl02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/webl02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/webl02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-WEBL02",
      "page_number": "564",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBL03",
      "title": "Managing high-performance data flows and file structures",
      "authors": [
        "J.M.C. Nilsson",
        "T.S. Richter",
        "ESS",
        "Copenhagen",
        "Denmark",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Tessella",
        "Abingdon",
        "United Kingdom",
        "The beam intensity at the European Spallation Source will necessitate a high performance acquisition and recording system for the data from the user experiments. In addition to high neutron counts rates the expected large number of dynamic measurements per day calls for a flexible system that supports a high variability in sample set-ups. Apache Kafka has been chosen as the central data switchboard to handle all the event driven data sources from detectors as well as from the EPICS controls system. The file writing system centres around a facility wide pool of HDF5 file-writers that uses Apache Kafka also for command and control. File-writing jobs are posted to a topic on Apache Kafka and picked up by individual workers. This centralises and optimises resources",
        "as I/O load can be balanced between different neutron instruments. Command messages embed a NeXus compliant structure to capture the raw data in a community agreed format. To simplify correctly defining the file structure",
        "physical device locations can the visualised. Data inspection can be applied to find available data sources and easily allocate them locations in the file."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/webl03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/webl03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/webl03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-WEBL03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEBL04",
      "title": "Manage the Physics Settings on the Modern Accelerator",
      "authors": [
        "T. Zhang",
        "K. Fukushima",
        "T. Maruta",
        "P.N. Ostroumov",
        "A.S. Plastun",
        "Q. Zhao",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/webl04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/webl04.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/webl04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-WEBL04",
      "page_number": "569",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBL05",
      "title": "FAIR Meets EMIL: Principles in Practice",
      "authors": [
        "G. Günther",
        "M. Bär",
        "N. Greve",
        "R. Krahl",
        "M. Kubin",
        "O. Mannix",
        "W. Smith",
        "S. Vadilonga",
        "R. Wilks",
        "HZB",
        "Berlin",
        "Germany",
        "Findability",
        "accessibility",
        "interoperability",
        "and reusability (FAIR) form a set of principles required to ready information for computational exploitation. The Energy Materials In-Situ Laboratory Berlin (EMIL) at BESSY II",
        "with its unique analytical instrumentation in direct combination with an industrially-relevant deposition tool",
        "is in the final phase of commissioning. It provides an ideal testbed to ensure workflows are developed around the FAIR principles; enhancing usability for both human and machine agents. FAIR indicators are applied to assess compliance with the principles on an experimental workflow realized using Bluesky. Additional metadata collection by integrating an instrument PID",
        "an electronic laboratory book",
        "and a sample tracking system is considered along with staff training. Data are collected in Nexus format and made available in the ICAT repository. This paper reports on experiences",
        "problems overcome",
        "and areas still in need of improvement in future perspectives."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/webl05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/webl05.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/webl05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-WEBL05",
      "page_number": "574",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-10 18:06:06"
}