{
  "session_info": {
    "id": "THCOBA",
    "name": "THCOBA - Control Systems Infrastructure",
    "url": "https://proceedings.jacow.org/ICALEPCS2013/html/thcoba.htm"
  },
  "papers": [
    {
      "paper_id": "THCOBA01",
      "title": "Evolution of the Monitoring in the LHCb Online System",
      "authors": [
        "C. Haen",
        "E. Bonaccorsi",
        "N. Neufeld",
        "CERN",
        "Geneva",
        "Switzerland",
        "The LHCb online system relies on a large and heterogeneous I.T. infrastructure : it comprises more than 2000 servers and embedded systems and more than 200 network devices. The low level monitoring of the equipment was originally done with Nagios. In 2011",
        "we replaced the single Nagios instance with a distributed Icinga setup presented at ICALEPCS 2011. This paper will present with more hindsight the improvements we observed",
        "as well as problems encountered. Finally",
        "we will describe some of our prospects for the future after the Long Shutdown period",
        "namely Shinken and Ganglia."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/thcoba01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/thcoba01.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/thcoba01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-THCOBA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCOBA02",
      "title": "Unidirectional Security Gateways: Stronger than Firewalls",
      "authors": [
        "Waterfall Security Solutions",
        "New York",
        "USA",
        "In the last half decade",
        "application integration via Unidirectional Security Gateways has emerged as a secure alternative to firewalls. The gateways are deployed extensively to protect the safety and reliability of industrial control systems in nuclear generators",
        "conventional generators and a wide variety of other critical infrastructures. Unidirectional Gateways are a combination of hardware and software. The hardware allows information to leave a protected industrial network",
        "and physically prevents any signal whatsoever from returning to the protected network. The result is that the hardware blocks all online attacks originating on external networks. The software replicates industrial servers to external networks",
        "where the information in those servers is available to end users and to external applications. The software does not proxy bi-directional protocols. Join us to learn how this secure alternative to firewalls works",
        "where and how the tecnhology is deployed routinely",
        "and how all of the usual remote support",
        "data integrity and other apparently bi-directional deployment issues are routinely resolved."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/thcoba02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/thcoba02.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/thcoba02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-THCOBA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCOBA03",
      "title": "",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/thcoba03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/thcoba03.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/thcoba03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-THCOBA03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCOBA04",
      "title": "Evolution Of IT Infrastructure For Fusion Control Systems",
      "authors": [
        "T.M. Frazier",
        "P. Adams",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "The National Ignition Facility (NIF) at the Lawrence Livermore National Laboratory is a stadium-sized facility that contains a 192-beam",
        "1.8-Megajoule",
        "500-Terawatt",
        "ultraviolet laser system that provides a scientific center to study Inertial Confinement Fusion and matter at extreme energy densities and pressures. An Information Technology (IT) infrastructure consisting of some 2",
        "500 servers",
        "400 network devices and 700 terabytes of storage provides the foundation for NIF’s Control System & Data Archive. Over the past 36 months",
        "NIF’s infrastructure has been highly consolidated and segmented. This talk discusses the high-level requirements and design principles which guided this effort",
        "the metrics & monitoring tools used to assess the performance and configuration management of the infrastructure",
        "and the processes and procedures used to migrate to a highly virtualized infrastructure. Elements of NIF’s approach that might be applicable at other facilities will be discussed."
      ],
      "institutions": [
        "Funding: This work performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344. #LLNL-ABS-633253"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/thcoba04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/thcoba04.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/thcoba04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-THCOBA04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THCOBA05",
      "title": "Control System Virtualization for the LHCb Online System",
      "authors": [
        "E. Bonaccorsi",
        "L. Granado Cardoso",
        "N. Neufeld",
        "CERN",
        "Geneva",
        "Switzerland",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "Virtualization provides many benefits such as more efficiency in resource utilization",
        "less power consumption",
        "better management by centralized control and higher availability. It can also save time for IT projects by eliminating dedicated hardware procurement and providing standard software configurations. In view of this virtualization is very attractive for mission-critical projects like the experiment control-system (ECS) of the large LHCb experiment at CERN. This paper describes our implementation of the control system infrastructure on a general purpose server-hardware based on Linux and the RHEV enterprise clustering platform. The paper describes the methods used",
        "our experiences and the knowledge acquired in evaluating the performance of the setup using test systems",
        "constraints and limitations we encountered. We compare these with parameters measured under typical load conditions in a real production system. We also present the specific measures taken to guarantee optimal performance for the SCADA system (WinCC OA)",
        "which is the back-bone of our control system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/thcoba05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/thcoba05.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/thcoba05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-THCOBA05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCOBA06",
      "title": "Virtualization and Deployment Management for the KAT-7 / MeerKAT Control and Monitoring System",
      "authors": [
        "N. Marais",
        "P.S. Swart",
        "L. Van den Heever",
        "C.C.A. de Villiers",
        "SKA South Africa",
        "National Research Foundation of South Africa",
        "Cape Town",
        "South Africa",
        "To facilitate efficient deployment and management of the Control and Monitoring software of the South African 7-dish Karoo Array Telescope (KAT-7) and the forthcoming Square Kilometer Array (SKA) precursor",
        "the 64-dish MeerKAT Telescope",
        "server virtualization and automated deployment using a host configuration database is used. The advantages of virtualization is well known; adding automated deployment from a configuration database",
        "additional advantages accrue: Server configuration becomes deterministic",
        "development and deployment environments match more closely",
        "system configuration can easily be version controlled and systems can easily be rebuilt when hardware fails. We chose the Debian GNU/Linux based Proxmox VE hypervisor using the OpenVZ single kernel container virtualization method along with Fabric (a Python ssh automation library) based deployment automation and a custom configuration database. This paper presents the rationale behind these choices",
        "our current implementation and our experience with it",
        "and a performance evalution of OpenVZ and KVM. Tests include a comparison of application specific networking performance over 10GbE using several network configurations."
      ],
      "institutions": [
        "Funding: National Research Foundation (NRF) of South Africa"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/thcoba06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/thcoba06.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/thcoba06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-THCOBA06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-10 18:29:36"
}