{
  "session_info": {
    "id": "MOYAA",
    "name": "MOYAA - Plenary Oral Session, Synchrotron Light Sources and FELs",
    "url": "https://proceedings.jacow.org/IPAC2014/html/moyaa.htm"
  },
  "papers": [
    {
      "paper_id": "MOYAA01",
      "title": "Innovative Ideas for Single-pass FELs",
      "authors": [
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "SASE FELs are a powerful light source in short wavelengths from VUV to X-ray regions to investigate matters and phenomena. SASE was first experimentally obtained in 2000 at DESY TTF with an output wavelength of 109 nm. Subsequently",
        "FLASH",
        "LCLS and SACLA have achieved lasing in VUV",
        "soft X-rays and hard X-rays. Although SASE has already been widely used for many application experiments in broad scientific fields",
        "its spiky spectrum and time structures due to the lack of longitudinal coherence sometimes become problematic. To improve its longitudinal coherence",
        "various ideas have been proposed and some of them are already demonstrated experimentally",
        "such as a self-seeded scheme",
        "high-gain harmonic generation (HGHG) and echo-enabled harmonic generation (EEHG). There is also another direction of developments to enhance the capability and potentiality of SASE",
        "for example short pulse generation and two-color lasing. This talk will review recent innovative ideas of short wavelength FELs together with their experimental results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/moyaa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/moyaa01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/moyaa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-MOYAA01",
      "page_number": "12",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 20:36:36"
}