{
  "session_info": {
    "id": "WEZBB",
    "name": "WEZBB - Wednesday Parallel Session 6",
    "url": "https://proceedings.jacow.org/napac2019/html/wezbb.htm"
  },
  "papers": [
    {
      "paper_id": "WEZBB1",
      "title": "Accelerator Research and Technology Developments for Industrial Applications",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Accelerator generated particle beams have spawned a range of industrial applications such as food sterilization",
        "wastewater treatment",
        "cargo inspection and material processing. Some of the technologies that form the backbone of these industrial systems have emerged from the accelerator-driven science mission pursued at the national labs. Applying the technologies that are developed at national labs for science and transforming them to solve challenges is of great value that allows new industries to emerge which promotes the long-term economic interest of the society. In this talk",
        "with inputs from other labs",
        "I will present a broad survey of accelerator technology developments that are on-going at the U.S. Department of Energy Laboratories with the emphasis on industrial applications excluding medical applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/wezbb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/wezbb1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/wezbb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEZBB1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEZBB2",
      "title": "IAEA Activities in Support of the Accelerator-Based Research and Applications",
      "authors": [
        "A. Simon",
        "S. Charisopoulos",
        "International Atomic Energy Agency",
        "Physics Section",
        "Div. Physical and Chemical Sciences",
        "Vienna",
        "Austria",
        "D. Ridikas",
        "N. Skukan",
        "I.P. Swainson",
        "IAEA",
        "Vienna",
        "Austria",
        "Promotion of nuclear applications for peaceful purposes and related capacity building is among the missions of the IAEA. In this context",
        "accelerator applications and nuclear instrumentation is one of the thematic areas",
        "where the IAEA supports its Member States in strengthening their capabilities to adopt and benefit from the usage of accelerators. A number of activities are being implemented focusing on accelerator-based applications in multiple disciplines",
        "e.g. materials characterization and modification",
        "forensics",
        "cultural heritage. This presentation will give an overview on strategies and key priority areas of the Physics Section accelerator sub-programme. The IAEA Accelerator Knowledge Portal which serves as a reference database of various type of accelerators world-wide will be also presented."
      ],
      "institutions": [],
      "abstract": "IAEA Accelerator Knowledge Portal: https://nucleus.iaea.org/sites/accelerators/",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/wezbb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/wezbb2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/wezbb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEZBB2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEZBB3",
      "title": "Ultra-Compact Accelerator for Radioactive Isotope Sources Replacement, Security, NDT and Medical Applications",
      "authors": [
        "S. Boucher",
        "R.B. Agustsson",
        "A. Arodzero",
        "S.V. Kutsaevpresenter",
        "A.Yu. Smirnov",
        "RadiaBeam",
        "Los Angeles",
        "California",
        "USA",
        "The US and IAEA authorities have identified as a priority the replacement of radioactive sources with alternative technologies",
        "due to the risk of accidents and diversion by terrorists for use in Radiological Dispersal Devices. In particular",
        "enrichment plants that represent one of the most sensitive parts of the nuclear fuel cycle",
        "use the Co-57 based Cascade Header Enrichment Monitor (CHEM) to detect the presence of UF6 gas at low pressures and to determine whether it is highly enriched. RadiaBeam has developed an inexpensive",
        "hand-portable 180 keV Ku-band electron accelerator to replace Co-57 radionuclide source in CHEM detectors. We used an innovative split accelerating structure approacg to design the linac in two halves and to avoid labor-intensive tuning steps. In this paper",
        "we will discuss the accelerator",
        "including X-ray convertor and accelerating structure design. The results of RF measurements of a Ku-band split structure will also be reviewed. Other applications of Ku-band linacs include compact both backscatter- and transmission- X-ray inspection systems",
        "as well as computed tomography for luggage and parcel screening with or without modulated energy pulses."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/wezbb3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/wezbb3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/wezbb3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEZBB3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEZBB4",
      "title": "High-Power Superconducting Electron Linacs for Commercial Applications",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/wezbb4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/wezbb4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/wezbb4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEZBB4",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEZBB5",
      "title": "Modeling and Evaluation Thermionic Energy Converters in the Space-Charge Limit",
      "authors": [
        "N.M. Cook",
        "J.P. Edelen",
        "C.C. Hall",
        "Y. Hu",
        "M.V. Keilman",
        "P. Moeller",
        "R. Nagler",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Thermionic energy converters (TECs) are a promising technology for modular",
        "efficient thermoelectric energy transfer. A TEC is comprised of a narrowly-separated cathode and anode",
        "thermionic emission at the cathode drives a current across the gap which may generate electrical power. For high operating temperatures and large gap distances",
        "currents can meet or exceed the Child-Langmuir limit. The steady-state operation of a TEC depends upon the emission characteristics of the cathode and anode",
        "the presence of intra-gap electrodes",
        "and the self-consistent transport of the electrons in the gap",
        "for which high fidelity simulations with self-consistent emission models and complex boundary interactions are required. We present results from simulations of TECs using the Warp code",
        "developed at Lawrence Berkeley National Lab. We demonstrate newly developed tools to accurately model a broad array of devices",
        "including mesh refinement and cut-cell techniques for improved resolution",
        "Schottky emission from shaped emitter surfaces",
        "and CAD I/O for grid design and optimization. These tools are employed to validate and optimize realistic device designs for future energy applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/wezbb5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/wezbb5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/wezbb5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEZBB5",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEZBB6",
      "title": "Development of a 19Ne Source in Search of Chirality Flipping Interactions",
      "authors": [
        "A. García",
        "M.E. Higgins",
        "N.C. Hoppispresenter",
        "D.W. Storm",
        "CENPA",
        "Seattle",
        "Washington",
        "USA",
        "At the University of Washington we are developing a 19Ne source to be used to search for chirality-flipping interactions a signature of new physics. The 19Ne source is required to provide approx. 1010 atoms/second with low contamination such that the decays can be observed in a low pressure (~10-7 Torr) environment. The 19Ne will be produced via the 19F(p",
        "n)19Ne reaction using a Sulfur Hexafluoride gas target and rapid cryogenic separation. The chirality-flipping interactions will be detected by measuring the beta spectrum using the Cyclotron Radiation Emission Spectroscopy technique. Results will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/wezbb6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/wezbb6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/wezbb6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEZBB6",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:56:58"
}