{
  "session_info": {
    "id": "MOIA",
    "name": "MOIA - Invited Talk in Monday-A",
    "url": "https://proceedings.jacow.org/IBIC2012/html/moia.htm"
  },
  "papers": [
    {
      "paper_id": "MOIA01",
      "title": "Accelerator Projects at KEK",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "This is a short talk to introduce accelerator projects at KEK including the Super B-Factory (SuperKEKB)",
        "Photon Factory (PD/PF-AR) and the high-intensity proton machine J-PARC. Some R&D efforts for future such as the International Linear Collider (ILC/STF/ATF) and the Energy Recovery Linac will be also overviewed. It may briefly mention on critical issues related to beam instrumentation for each project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/moia01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/moia01.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/moia01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-MOIA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOIA02",
      "title": "Progress of Beam Instumentation in J-PARC Linac",
      "authors": [
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "J-PARC",
        "one of the high intensity proton accelerators",
        "achieved the output power of 300 kW at the downstream rapid cycling synchrotron with a beam energy of 181 MeV and a beam current of 15 mA. When an upgrade of an ion source which can provide 50 mA and the installation of the additional acceleration cavities for the energy upgrade up to 400 MeV are completed",
        "output power can reach 1MW. To meet with the requirements of the high intensity beam diagnostics",
        "we prepare several measures against high intensity proton related issues. The following subjects have been reported among many subjects: development of strip-line type beam position monitors",
        "beam current monitors",
        "phase monitors and transverse profile monitors. And the subjects of the beam diagnostic for the energy upgraded linac including the longitudinal beam profile monitor and the developing laser based profile monitor will be mentioned. A big earthquake occurred on May 11",
        "2011. We successfully recovered to have commercial operation",
        "but a partial recovery is still undergoing. Influence of the quake on the J-PARC linac is also mentioned."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2012/talks/moia02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2012/papers/moia02.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2012/posters/moia02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2012-MOIA02",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 18:01:43"
}