{
  "session_info": {
    "id": "TUPAF",
    "name": "TUPAF - Tuesday Parallel Fiesta Key",
    "url": "https://proceedings.jacow.org/icap2018/html/tupaf.htm"
  },
  "papers": [
    {
      "paper_id": "TUPAF01",
      "title": "Upgrade of MAD-X for HL-LHC Project and FCC Studies",
      "authors": [
        "L. Deniau",
        "H. Burkhardt",
        "R. De Maria",
        "M. Giovannozzi",
        "J.M. Jowett",
        "A. Latina",
        "T. Persson",
        "F. Schmidt",
        "I.S. Shreyber",
        "P.K. Skowroński",
        "CERN",
        "Geneva",
        "Switzerland",
        "HIT",
        "Heidelberg",
        "Germany",
        "The design efforts for the High Luminosity upgrade of the Large Hadron Collider (HL-LHC) and for the FCC-ee project required significant extensions of the MAD-X code widely used for designing and simulating particle accelerators. The modelling of synchrotron radiation effects has recently been reviewed",
        "improved and tested on the lattices of ESRF",
        "LEP and CLIC Final Focus System. The results were cross checked with the codes AT",
        "PLACET",
        "Geant4",
        "and MAD8. The implementation of space charge has been drastically restructured in a modular design. The linear coupling calculation has been completely reviewed and improved",
        "from the theory to the implementation in MAD-X code to ensure its correctness in the presence of strong coupling as in the HL-LHC studies. The slicing module has been generalised to allow for thick slices of bending magnets",
        "quadrupoles and solenoids. The SBEND element has been extended to support difference between bending angle and integrated dipole strength. Patches have been added to the list of supported elements. MAD-X PTC has also been extended to track resonance driving terms along layouts",
        "and to support AC dipoles to simulate beams during optics measurements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf01.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF01",
      "page_number": "165",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF02",
      "title": "SixTrack Project: Status, Runtime Environment, and New Developments",
      "authors": [
        "R. De Maria",
        "J. Andersson",
        "L. Field",
        "M. Giovannozzi",
        "P.D. Hermes",
        "N. Hoimyr",
        "G. Iadarola",
        "S. Kostoglou",
        "E.H. Maclean",
        "E. McIntosh",
        "A. Mereghetti",
        "J. Molson",
        "V.K.B. Olsen",
        "D. Pellegrini",
        "T. Persson",
        "M. Schwinzerl",
        "K.N. Sjobak",
        "CERN",
        "Geneva",
        "Switzerland",
        "University of Malta",
        "Information and Communication Technology",
        "Msida",
        "Malta",
        "Indian Institute of Technology Madras",
        "Chennai",
        "India",
        "University of Oslo",
        "Oslo",
        "Norway",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "SixTrack is a single-particle tracking code for high-energy circular accelerators routinely used at CERN for the Large Hadron Collider (LHC)",
        "its luminosity upgrade (HL-LHC)",
        "the Future Circular Collider (FCC)",
        "and the Super Proton Synchrotron (SPS) simulations. The code is based on a 6D symplectic tracking engine",
        "which is optimised for long-term tracking simulations and delivers fully reproducible results on several platforms. It also includes multiple scattering engines for beam-matter interaction studies",
        "as well as facilities to run integrated simulations with FLUKA and"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf02.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF02",
      "page_number": "172",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF03",
      "title": "Update on the Status of Linac Part of the PyORBIT Code",
      "authors": [
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "The structure and capabilities of the linac beam dynamics part of the PyORBIT code are presented. The PyORBIT is an open source code",
        "a descendant of the original ORBIT code that was developed at the Spallation Neutron Source (SNS) for design",
        "commissioning",
        "and studies of the ring. The linac part was started 8 years ago to utilize PyORBIT classes and infrastructure for the SNS linac simulations. The PyORBIT linac model has its own lattice description that is necessary to include lattice elements significantly different from the PyORBIT ring elements. The most important among them are accelerating RF structures. The five different RF gap models recently implemented in PyORBIT are discussed. Some benchmarks of the PyORBIT with Parmila",
        "the XAL Online Model",
        "and TraceWin code are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf03.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF04",
      "title": "Zgoubi: Recent Developments and Future Plans",
      "authors": [
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "ParaTools",
        "Inc.",
        "Eugene",
        "Oregon",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Sourcery Institute",
        "Oakland",
        "California",
        "USA",
        "The particle tracking code Zgoubi [*] has been used for a broad array of accelerator design studies",
        "including FFAGs and EICs [**]. Zgoubi is currently being used to evaluate proposed designs for both JLEIC and eRHIC [***]",
        "and to prepare for commissioning the CBETA BNL-Cornell FFAG return loop ERL [****]. Moreover",
        "Zgoubi is now the subject of a Phase II SBIR aimed at improving its speed",
        "flexibility",
        "and ease-of-use. In this paper",
        "we describe our on-going work on several fronts: (i) parallelizing Zgoubi using new features of Fortran 2018",
        "including coarrays [*****]; (ii) implementing a new particle update algorithm that requires significantly less memory and arithmetic; and (iii) developing symplectic tracking for field maps. In addition",
        "we describe plans for a web-based graphical interface to Zgoubi.",
        "*F Meot",
        "FERMILAB-TM-2010  **F Lemuet",
        "NIM-A",
        "547:638; F Lin"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf04.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF05",
      "title": "Advances in Accelerator Modeling with Parallel Multi-Physics Code Suite ACE3P",
      "authors": [
        "L. Xiao",
        "L. Ge",
        "Z. Li",
        "C.-K. Ng",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "ACE3P is a comprehensive set of parallel finite-element codes for multi-physics modeling of accelerator structures including integrated electromagnetic",
        "thermal and mechanical effects. Recent advances of ACE3P have been focused on the development of multi-physics modeling capabilities",
        "implementation of advanced numerical algorithms",
        "and improvement of code performance on state-of-the-art high-performance computing (HPC) platforms for large-scale accelerator applications. A nonlinear eigensolver using the CORK algorithm [1] has been implemented in the eigensolver module Omega3P to enable accurate determination of damping factors of resonant modes above the beampipe cutoff frequency. It has enabled the first-ever direct calculation of trapped modes in the TESLA TTF cryomodules",
        "providing reliable damping factors that were validated against measurements. A newly developed mechanical eigensolver in the multi-physics module TEM3P has allowed the determination of mechanical modes in Fermilab PIP-II high beta 650 MHz cryomodule",
        "demonstrating mode coupling between the 6 cavities in the cryomodule. To exploit multi-core computer architectures on supercomputers",
        "a hybrid MPI+OpenMP parallel programing has been developed in the particle tracking module Track3P to speed up dark current simulation in multiple cavities for the LCLS-II linac. Highlights of these developments and their impacts on accelerator modeling using HPC will be presented.",
        "[1] R. Van Beeuman",
        "Invited talk",
        "this conference."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf05.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF06",
      "title": "Simulations of Longitudinal Beam Stabilisation in the CERN SPS With BLonD",
      "authors": [
        "J. Repond",
        "K. Iliakis",
        "M. Schwarz",
        "E.N. Shaposhnikova",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The Super Proton Synchrotron (SPS) at CERN",
        "the Large Hadron Collider (LHC) injector",
        "will be pushed to its limits for the production of the High Luminosity LHC proton beam while beam quality and stability in the longitudinal plane are influenced by many effects. Particle simulation codes are an essential tool to study the beam instabilities. BLonD",
        "developed at CERN",
        "is a 2D particle-tracking simulation code",
        "modelling the longitudinal phase space motion of single and multi-bunch beams in multi-harmonic RF systems. Computation of collective effects due to the machine impedance and space charge is done on a multi-turn basis. Various beam and cavity control loops of the RF system are implemented (phase",
        "frequency and synchro-loops",
        "and one-turn delay feedback) as well as RF phase noise injection used for controlled emittance blow-up. The longitudinal beam stability simulations during long SPS acceleration cycle (~ 20 s) include a variety of effects (beam loading",
        "particle losses",
        "controlled blow-up",
        "double RF system operation",
        "low-level RF control",
        "injected bunch distribution",
        "etc.). Simulations for the large number of bunches in the nominal LHC batch (288) use the longitudinal SPS impedance model containing broad and narrow-band resonances between 50 MHz and 4 GHz. This paper presents a study of beam stabilisation in the double harmonic RF system of the SPS system with results substantiated",
        "where possible",
        "by beam measurements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf06.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF06",
      "page_number": "179",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF07",
      "title": "Recent Developments of the Open Source Code OPAL",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "After a general introduction of OPAL",
        "I will introduce a set of new features available with version 2.0 released in July 2018. All new features will be presented together with examples of ongoing research projects. In the OPAL-t flavour",
        "elements can now be placed in 3D",
        "without restriction. Overlapping fringe fields are handled",
        "and off-momentum beams as occurring in tolerance studies can be tracked. Furthermore",
        "survey plots of placed elements are a valuable diagnostic when dealing with complex designs. A new element",
        "a flexibly configurable collimator",
        "will be presented. In the OPAL-cyc flavour",
        "a robust way of generating matched distributions with linear space charge is introduced. A new method for describing fixed field accelerators (FFAs) in a very general way will be shown. A new element TRIMCOIL can be used to correct for field-errors in cyclotrons and FFAs. The OPAL language (a derivative of the MAD language) was extended to allow the specification of multi objective optimisation problems",
        "which are then solved with a built in NGSA-II genetic algorithm. A new feature SAMPLER allows you to setup and run random or sequential parameter studies and seamless utilisation of a vast number of computing cores. Finally",
        "a set of Python tools (pyOPALTools) was created for post processing. The manual is now available on the OPAL-wiki as well as in pdf format."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf07.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF07",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF08",
      "title": "A Full Field-Map Modeling of Cornell-BNL CBETA 4-Pass Energy Recovery Linac",
      "authors": [
        "F. Méot",
        "S.J. Brooks",
        "D. Trbojevic",
        "N. Tsoupas",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The Cornell-BNL Electron Test Accelerator (CBETA) is a four-pass",
        "150 MeV energy recovery linac (ERL)",
        "now in construction at Cornell. A single fixed-field alternating gradient (FFAG) beam line recirculates the four energies",
        "42",
        "78",
        "114 and 150 MeV. The return loop is comprised of 107 quadrupole-doublet cells",
        "built using Halbach permanent magnet technology. Spreader and combiner sections (4 independent beam lines each) connect the 36 MeV linac to the FFAG loop. We present here a start-to-end simulation of the 4-pass ERL",
        "entirely",
        "and exclusively",
        "based on the use of magnetic field maps to model the magnets and correctors. There are paramount reasons for that and this is discussed",
        "detailed outcomes are presented",
        "together with comparisons with regular beam transport (mapping based) techniques."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf08.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF08",
      "page_number": "186",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF09",
      "title": "Multi Pass Energy Recovery Linac Design With a Single Fixed Field Magnet Return Line",
      "authors": [
        "D. Trbojevic",
        "J.S. Berg",
        "S.J. Brooks",
        "F. Méot",
        "N. Tsoupas",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "We present a new approach of the Energy Recovery Linac Design for the future projects: PERLE (Powerful Energy Recovery Linac for Experiments)",
        "LHeC/FCCeH and eR- HIC. The concept uses superconducting linacs and a single xed eld beam line with multiple energy passes of electron beams. This represents an update to the existing CBETA (Cornell University Brookhaven National Laboratory ERL Test Accelerator) where the superconducting linac uses a single xed eld magnet beam line with four energy passes during acceleration and four passes during the energy recov- ery. To match the single xed eld beam line to the linac the CBETA uses the spreaders and combiners on both sides of the linac",
        "while the new concept eliminates them. The arc cells from the single xed eld beam line are connected to the linac with adiabatic transition arcs wher cells increase in length. The orbits of di erent energies merge into a sin- gle orbit through the interleaved linac within the straight sections as in the CBETA project. The betatron functions from the arcs are matched to the linac. The time of ight of di erent electron energies is corrected for the central orbits by additional correction magnet controlled induced beam oscillations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf09.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF09",
      "page_number": "191",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF10",
      "title": "Experience With CBETA Online Modeling Tools",
      "authors": [
        "C.M. Gulliford",
        "A.C. Bartnik",
        "J. Dobbins",
        "D. Sagan",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "UCF",
        "Orlando",
        "USA",
        "The Cornell-Brookhaven CBETA machine is a four pass Energy Recovery Linac (ERL) with a Non-scaling Fixed-Field Alternating gradient (NS-FFA) arc. For online modeling of single particle dynamics in CBETA",
        "a customized version of the Tao program",
        "which is based upon the Bmad toolkit",
        "has been developed. This online program",
        "called CBETA-V",
        "is interfaced to CBETA’s EPICS control system. This paper describes the online modeling system and initial experience during machine running."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf10.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF10",
      "page_number": "196",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF11",
      "title": "Advanced Design and Simulation of Fixed-Field Accelerators",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "M. Berz",
        "K. Makino",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "The development of new types of accelerators that allow wide choices of parameters",
        "promote complicated fields",
        "and often need to efficiently handle very large emittance beams requires the availability of new simulation environments to design and accurately predict operation. This is particularly true of Fixed-field accelerators",
        "FFAs",
        "which apply arbitrary-order fields - both alternating gradient",
        "strong focusing - but also weak-focusing cyclotrons. This is especially applicable at medium-to-high energy combined with high intensity (mA currents). Synchrotron and cyclotron codes are generally inadequate to simulate accurately the performance of these strong-focusing fixed-field accelerators",
        "particularly the new breed of non-scaling machines which have difficult",
        "high-order fringe-field and edge-angle effects. One well-supported code",
        "COSY INFINITY (COSY) is particularly suitable for accurate",
        "high-order descriptions of accelerators. New tools have been developed in COSY INFINITY to address and accurately represent complex fixed-field machines in both a sector and spiral sector footprint. A description",
        "application",
        "and comparison of these tools with fields from magnet lattice design is presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf11.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF11",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF12",
      "title": "Longitudinal Beam Dynamics With a Higher-Harmonic Cavity for Bunch Lengthening",
      "authors": [
        "G. Bassi",
        "J. Tagger",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "We discuss the longitudinal beam dynamics in storage rings in the presence of a higher-harmonic cavity (HHC) system for bunch lengthening. We first review the general conditions for HHC operations",
        "either in active or passive mode",
        "assuming the stability of the system. For uniform filling patterns",
        "a distinction is made between operations with a normal-conducting HHC",
        "where optimal conditions for bunch lengthening can be satisfied",
        "and operations with super-conducting HHC",
        "where optimal conditions can be met only approximately. The option to operate the NSLS-II storage ring with a passive",
        "super-conducting third harmonic cavity (3HC) system is discussed next. The stability and performance of the system in the presence of a gap in the uniform filling",
        "which corresponds to the present mode of operation of the NSLS-II storage ring",
        "is investigated with self-consistent Vlasov-Fokker-Planck simulations performed with the code SPACE*.",
        "* G. Bassi",
        "A. Blednykh and V. Smaluk",
        "Phys Rev. Accel. Beams 19",
        "024401 (2016)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf12.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF12",
      "page_number": "202",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF13",
      "title": "Calculation of the AGS Optics Based on 3D Fields Derived From Experimentally Measured Fields on Median Plane",
      "authors": [
        "N. Tsoupas",
        "J.S. Berg",
        "S.J. Brooks",
        "F. Méot",
        "V. Ptitsyn",
        "D. Trbojevic",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Closed orbit calculations of the AGS synchrotron were performed and the beam parameters at the extraction point of the AGS [1] were calculated using the RAYTRACE computer code [2] which was modified to generate 3D fields from the experimentally measured field maps on the median plane of the AGS combined function magnets. The algorithm which generates 3D fields from field maps on a plane is described in reference [3] which discusses the details of the mathematical foundation of this approach. In this presentation we will discuss results from studies [1",
        "4] that are based on the 3D fields generated from the known field components on a rectangular grid of a plane. A brief overview of the algorithm used will be given",
        "and two methods of calculating the required field derivatives on the plane will be presented. The calculated 3D fields of a modified Halbach magnet [5] of inner radius of 4.4 cm will be calculated using the two different methods of calculating the field derivatives on the plane and the calculated fields will be compared against the ’ideal’ fields as calculated by the OPERA computer code [6]. [1] N. Tsoupas et. al. ’Closed orbit calculations at AGS and Extraction Beam Parameters at H13 AD/RHIC/RD-75 Oct. 1994 [2] S.B. Kowalski and H.A. Enge ’The Ion-Optical Program Raytrace’ NIM A258 (1987) 407 [3] K. Makino",
        "M. Berz",
        "C. Johnstone",
        "Int. Journal of Modern Physics A 26 (2011) 1807-1821 [4] N. Tsoupas et. al. ’Effects of Dipole Magnet Inhomogeneity on the Beam Ellipsoid’ NIM A258 (1987) 421-425 [5] ’The CBETA project: arXiv.org > physics > arXiv:1706.04245’’ [6] Vector Fields Inc. https://operafea.com/"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf13.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF13",
      "page_number": "209",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF14",
      "title": "Analytical Calculations for Thomson Backscattering Based Light Sources",
      "authors": [
        "P.I. Volz",
        "A. Meseck",
        "HZB",
        "Berlin",
        "Germany",
        "There is a rising interest in Thomson-backscattering based light sources",
        "as scattering intense laser radiation on MeV electrons produces high energy photons that would require GeV or even TeV electron beams when using conventional undulators or dipoles. Particularly",
        "medium energy high brightness beams delivered by LINACs or Energy Recovery LINACs",
        "such as BERLinPro being built at Helmholtz-Zentrum Berlin",
        "seem suitable for these sources. In order to study the merit of Thomson-backscattering-based light sources",
        "we are developing an analytical code to simulate the characteristics of the Thomson scattered radiation. The code calculates the distribution of scattered radiation depending on the incident angle and polarization of the laser radiation. Also the impact of the incident laser profile and the full 6D bunch profile",
        "including microbunching",
        "are incorporated. The Status of the code and first results will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf14.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF14",
      "page_number": "215",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF15",
      "title": "A Holistic Approach to Simulating Beam Losses in the Large Hadron Collider Using BDSIM",
      "authors": [
        "S.D. Walker",
        "A. Abramov",
        "S.T. Boogert",
        "H. Garcia Morales",
        "S.M. Gibson",
        "L.J. Nevay",
        "H. Pikhartova",
        "W. Shields",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "To fully understand the beam losses",
        "subsequent radiation",
        "energy deposition",
        "backgrounds and activation in particle accelerators",
        "a holistic approach combining a 3-D model",
        "physics processes and accelerator tracking is required. Beam Delivery Simulation (BDSIM) is a program developed to simulate the passage of particles",
        "both primary and secondary",
        "in particle accelerators and calculate the energy deposited by these particles via material interactions using the Geant4 physics library. A Geant4 accelerator model is built from an existing optical description of a lattice by procedurally placing a set of predefined accelerator components. These generic components can be refined to an arbitrary degree of detail with the use of user-defined geometries",
        "detectors",
        "field maps",
        "and more. A detailed model of the Large Hadron Collider has been created in BDSIM",
        "validated with existing tracking codes and applied to study beam loss patterns."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf15.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF15",
      "page_number": "221",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF16",
      "title": "Analysis of the Beam Loss Mechanism During the Energy Ramp-Up at the SAGA-LS",
      "authors": [
        "SAGA",
        "Tosu",
        "Japan",
        "The accelerator of the SAGA Light Source consists of 255 MeV injector linac　and 1.4 GeV storage ring. The accumulated electron beam current of the　storage ring is about 300 mA. The energy of　the electrons are raised up to 1.4 GeV in 4 minutes in the storage ring. At the moment of the　beam acceleration (the beam energy is lower than 300 MeV)",
        "the electron　beam is lost like the step function. The lost beam current is normally　about 5 mA to 30 mA. The beam loss at the energy ramp-up is not observed",
        "when the beam current is lower than 200 mA. To understand the beam loss mechanism",
        "which depend on the beam current",
        "we developed high-speed logging system of 100 kHz for monitoring the beam current and the magnets power supplies using National Instruments PXI. We investigated the relationship between the beam loss and the betatron tune shifts. The tune shifts during the beam acceleration were analyzed from the measured data of the output current of the magnets power supplies by using beam tracking code of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf16.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF16",
      "page_number": "227",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF19",
      "title": "pyaopt Optimization Suite and its Applications to an SRF Cavity Design for UEMs",
      "authors": [
        "A. Liu",
        "P.V. Avrakhov",
        "R.A. Kostin",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "Euclid Beamlabs LLC",
        "Bolingbrook",
        "USA",
        "In order to achieve sharp",
        "high resolution real-time imaging",
        "electrons in a MeV UEM (ultrafast electron microscope) beamline need to minimize instabilities. The Superconducting RF (SRF) photocathode gun is a promising candidate to produce highly stable electrons for UEM/UED applications. It operates in an ultrahigh Q",
        "CW mode",
        "and dissipates a few watts of RF power",
        "which make it possible to achieve a 10s ppm level of beam stability by using modern RF control techniques. In order to find the best performance of the gun design",
        "an optimization procedure is required. pyaopt is a Python-based optimization suite that supports multi-objective optimizations using advanced algorithms. In this paper",
        "the novel SRF photogun design and its optimizations through pyaopt and Astra’s beam simulations will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf19.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF19",
      "page_number": "229",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF20",
      "title": "Mean-Field Density Evolution of Bunched Particles With Non-Zero Initial Velocity",
      "authors": [
        "B.S. Zerbe",
        "P.M. Duxbury",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "Reed (2006) presented a 1D mean-field model of initially cold pancake-beam expansion demonstrating that the evolution of the entire spatial distribution can be solved for all time where the 1D assumption holds. This model is relevant to ultra-fast electron microscopy as it describes the evolution of the distribution within the photoelectron gun",
        "and this model is similar to Anderson’s sheet beam density time dependence (Anderson 1987) except that Reed’s theory applies to freely expanding beams instead of beams within a focussing channel. Our recent work (Zerbe 2018) generalized Reed’s analysis to cylindrical and spherical geometries demonstrating the presence of a shock that is seen in the Coulomb explosion literature under these geometries and further discussed the absence of a shock in the 1D model. This work is relevant as it offers a mechanistic explanation of the ring-like density shock that arises in non-equilibrium pancake-beams within the photoelectron gun; moreover",
        "this shock is coincident with a region of high-temperature electrons providing an explanation for why experimentally aperturing the electron bunch results in a greater than 10-fold improvement in beam emittance(Williams 2017)",
        "possibly even resulting in bunch emittance below the intrinsic emittance of the cathode. However",
        "this theory has been developed for cold-bunches",
        "i.e. bunches of electrons with 0 initial momentum. Here",
        "we briefly review this new theory and extend the cylindrical- and spherical- symmetric distribution to ensembles that have non-zero initial momentum distributions that are symmetric but otherwise unrestricted demonstrating how initial velocity distributions couple to the shocks seen in the less general formulation. Further",
        "we derive and demonstrate how the laminar condition may be propagated through beam foci."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf20.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF20",
      "page_number": "233",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF22",
      "title": "FEL Simulation Using the Lie Method",
      "authors": [
        "K. Hwang",
        "J. Qiang",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Advances in numerical methods for free-electron-laser~(FEL) simulation under wiggler period averaging~(WPA) are presented. First",
        "WPA is generalized using perturbation Lie map method. The conventional WPA is identified as the leading order contribution. Next",
        "a widely used shot-noise modeling method is improved along with a particle migration scheme across the numerical mesh. The artificial shot noise arising from particle migration is suppressed. The improved model also allows using arbitrary mesh size",
        "slippage resolution",
        "and integration step size. These advances will improve modeling of longitudinal beam profile evolution for fast FEL simulation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf22.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF22",
      "page_number": "240",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF23",
      "title": "Start-to-End Simulations of THz SASE FEL Proof-of-Principle Experiment at PITZ",
      "authors": [
        "M. Krasilnikov",
        "P. Boonpornprasert",
        "F. Stephan",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "E. Schneidmiller",
        "M.V. Yurkov",
        "DESY",
        "Hamburg",
        "Germany",
        "The Photo Injector Test facility at DESY in Zeuthen (PITZ) develops high brightness electron sources for modern linac-based Free Electron Lasers (FELs). The PITZ accelerator has been proposed as a prototype for a tunable",
        "high power THz source for pump and probe experiments at the European XFEL. A Self-Amplified Spontaneous Emission (SASE) FEL is considered to generate the THz pulses. High radiation power can be achieved by utilizing high charge (4 nC) shaped electron bunches from the PITZ photo injector. THz pulse energy of up to several mJ is expected from preliminary simulations for 100 um radiation wavelength. For the proof-of-principle experiments a re-usage of LCLS-I undulators at the end of the PITZ beamline is under studies. One of the challenges for this setup is transport and matching of the space charge dominated electron beam through the narrow vacuum chamber. Start-to-end simulations for the entire experimental setup - from the photocathode to the SASE THz generation in the undulator section - have been performed by combination of several codes: ASTRA",
        "SC and GENESIS-1.3. The space charge effect and its impact onto the output THz radiation have been studied. The results of these simulations will be presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf23.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF23",
      "page_number": "246",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPAF24",
      "title": "Numerical Simulations for Generating Fully Coherent Soft X-Ray Free Electron Lasers With Ultra-Short Wavelength",
      "authors": [
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "For the fully coherent",
        "ultra-short and high power soft x-rays are becoming key instruments in different research fields",
        "such as biology",
        "chemistry or physics. However it’s not easy to generate this kind of advantaged light source by conventional lasers",
        "especially for the soft x-rays with ultra-short wavelength. The external seeded free electron laser (FEL) is considered as one feasible method. Here",
        "we give an example to generate fully coherent soft x-rays with the wavelength 1nm by the two-stage cascaded FELs. The EEHG scheme is used in the first-stage while the HGHG scheme is used in the second-stage.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Funding: Shanghai Institute of Applied Physics, Chinese Academy of Sciences"
      ],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/tupaf24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/tupaf24.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/tupaf24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-TUPAF24",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 21,
  "scrape_time": "2025-10-10 18:31:14"
}