{
  "session_info": {
    "id": "THOA",
    "name": "THOA - Thursday Contributed Oral Session A",
    "url": "https://proceedings.jacow.org/medsi2020/html/thoa.htm"
  },
  "papers": [
    {
      "paper_id": "THOA01",
      "title": "A Family of High-Stability Granite Stages for Synchrotron Applications",
      "authors": [
        "C.A. Preissner",
        "S.J. Bean",
        "M. Erdmann",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "M. Bergeret",
        "J.R. Nasiatka",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Engineers at the APS have developed a granite",
        "air-bearing stage concept that provides many millimeters of motion range and nanometer-level vibrational stability. This technique was first conceptualized and used on the Velociprobe x-ray microscope. The success of that design spurred adaption of the approach to over 90 devices",
        "including many new instruments at the APS and high performing instruments at other synchrotrons. This paper details the design concept",
        "some performance measurements",
        "and new developments allowing for a six-degree-of-freedom device."
      ],
      "institutions": [
        "Funding: Advanced Photon Source, a U.S. Department of Energy (DOE) Office of Science User Facility, operated for the DOE Office of Science by Argonne National Laboratory under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/thoa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/thoa01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/thoa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-THOA01",
      "page_number": "341",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THOA02",
      "title": "A New Traveling Interferometric Scheme for the APS Upgrade of the 2-ID Bionanoprobe",
      "authors": [
        "S.J. Bean",
        "S. Chen",
        "T. Graber",
        "C. Jacobsen",
        "B. Lai",
        "E.R. Maxey",
        "T. Mooney",
        "C.A. Preissner",
        "X. Shi",
        "D. Shu",
        "J. Tan",
        "W. Wojcik",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "The Advanced Photon Source (APS) at Argonne National Laboratory (ANL) is being upgraded to a multi-bend achromat (MBA) lattice storage ring which will increase brightness and coherent flux by several orders of magnitude. As part of this upgrade a total of 15 beamlines were selected to be enhanced to take advantage of the new source ’ these are designated as ’Enhanced Beamlines’. Among these is the enhancement to 2-ID",
        "which includes an upgrade and move of the existing Bionanoprobe (BNP) from 9-ID [1]. This instrument will become the second generation Bionanoprobe II (BNP-II) with intent of studying cryogenic samples with sub-10 nm resolution. This upgrade requires a high performing metrology configuration and design to achieve the desired spatial resolution while adapting to the various constraints of the instrument. The cryogenic sample environment and detection constraints offer significant challenges for implementing a metrology scheme. In this paper we report on the new traveling interferometer configuration proposed for BNP-II."
      ],
      "institutions": [
        "Funding: Advanced Photon Source, a U.S. Department of Energy (DOE) Office of Science User Facility, operated for the DOE Office of Science by Argonne National Laboratory under Contract No.DE-AC02-06CH11357"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/thoa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/thoa02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/thoa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-THOA02",
      "page_number": "345",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THOA03",
      "title": "Alignment Strategies and First Results on Sirius Beamlines",
      "authors": [
        "G.R. Rovigatti de Oliveira",
        "H. Geraissate",
        "R. Junqueira Leão",
        "LNLS",
        "Campinas",
        "Brazil",
        "The new Brazilian Synchrotron Light Source had its first friendly users late in 2019. During 2020",
        "the first experimental stations were aligned and had the first beam successfully at the sample. The reference network of points used for the storage ring alignment was connected to an external network located in the experimental hall. Following this step",
        "it was possible to extend these references to the hutches environment",
        "where the beamlines components are installed. During the alignment of the first beamlines",
        "a sequence of common tasks was performed",
        "from the bluelining of the hutches footprints",
        "to the components fine alignment. The position and orientation deviation of the main components will be presented for the Manacá",
        "Cateretê",
        "Ema",
        "and Carnaúba beamlines. Two specific measurement strategies used for aligning special components will also be presented: (1) an indirect fiducialization procedure developed for most of the mirrors and their mechanisms using a mix of coordinate measuring machine and articulated measuring arm measurements",
        "and (2) a multi-station setup arranged for the alignment of a 30 meters long detector carriage",
        "using a mix of laser tracker",
        "physical artifacts",
        "and a rotary laser alignment system used as a straightness reference."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/thoa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/thoa03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/thoa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-THOA03",
      "page_number": "349",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 23:31:00"
}