{
  "session_info": {
    "id": "TUTUB",
    "name": "TUTUB - Managing Electromagnetic Interference Tutorial",
    "url": "https://proceedings.jacow.org/IBIC2014/html/tutub.htm"
  },
  "papers": [
    {
      "paper_id": "TUTUB1",
      "title": "Managing Electromagnetic Interference  in  Large Instrumentation Environments",
      "authors": [
        "URS",
        "Albuquerque",
        "New Mexico",
        "USA",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Implementing high-quality measurement systems in large test environments presents a number of unique challenges. And",
        "these challenges are made even more interesting where new instrumentation systems are being implemented in existing legacy environments where there is little opportunity to modify the infrastructure. Often",
        "Electromagnetic Interference (EMI) is encountered. This interference may be simply an annoyance were sufficiently low that data integrity is not severely compromised",
        "but in many cases",
        "perhaps most",
        "EMI is so severe as to totally obscure the signals of interest. Various sources of EMI and common points of entry of are reviewed. Means of mitigation of EMI in the design and implementation of instrumentation systems in legacy environments are presented. Common sources of EMI potentially introduced by the instrumentation systems themselves are examined",
        "and means of design to mitigate such self-induce interference are examined. Real-life examples are provided to demonstrate the EMI issues",
        "and the affect of mitigation. It’s all about the current – pretty much!"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/tutub1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/tutub1.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/tutub1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-TUTUB1",
      "page_number": "224",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:56:23"
}