{
  "session_info": {
    "id": "TUOAB1",
    "name": "TUOAB1 - Contributed Oral Presentations (Hadron Accelerators)",
    "url": "https://proceedings.jacow.org/IPAC2013/html/tuoab1.htm"
  },
  "papers": [
    {
      "paper_id": "TUOAB101",
      "title": "Installation and Commissioning of the 1.1 MW Deuteron Prototype Linac for IFMIF",
      "authors": [
        "IFMIF/EVEDA",
        "Rokkasho",
        "Japan",
        "P. Cara",
        "A. Mosnier",
        "Fusion for Energy",
        "Garching",
        "Germany",
        "CEA/DSM/IRFU",
        "France",
        "CIEMAT",
        "Madrid",
        "Spain",
        "Japan Atomic Energy Agency (JAEA)",
        "International Fusion Energy Research Center (IFERC)",
        "Rokkasho",
        "Kamikita",
        "Aomori",
        "Japan",
        "IFMIF",
        "the International Fusion Materials Irradiation Facility",
        "will learn the degradation of the mechanical properties of purpose designed reduced activation ferritic-martensitic steels under bombardment of 14 MeV neutrons at 1018 n/m2s flux reaching values of 150 displacements per atom in the steel lattice. The understanding of the impact of Deuterium-Tritium fusion neutrons in next decade is essential to design and construct a fusion power plant; the next step after ITER. The 14 MeV neutrons are stripped from a liquid Li screen flowing at 15 m/s impacted by 2 parallel 125 mA deuteron beam at 40 MeV. IFMIF project",
        "in its engineering validation phase",
        "will operate in Rokkasho a 125 mA deuteron LINAC at 9 MeV that will validate the concept of IFMIF accelerator",
        "LIPAc. The ion source will inject 140 mA deuterons at 100 KeV in a normal-conducting RFQ that will deliver the bunched beam at 5MeV to be accelerated up to 9 MeV thanks to 8 half-wave superconducting resonators. The installation and commissioning of LIPAc in Rokkasho (Japan) is sequential and the first stage is starting now; the strategy to overcome potential difficulties is detailed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tuoab101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tuoab101.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tuoab101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUOAB101",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOAB102",
      "title": "Project X Injector Experiment: Goals, Plan and Status",
      "authors": [
        "A.V. Shemyakin",
        "S.D. Holmes",
        "D.E. Johnson",
        "M. Kaducak",
        "R.D. Kephart",
        "V.A. Lebedev",
        "C.S. Mishra",
        "S. Nagaitsev",
        "N. Solyak",
        "R.P. Stanek",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "ANL",
        "Argonne",
        "USA",
        "A multi-MW proton facility",
        "Project X",
        "has been proposed and is currently under development at Fermilab. We are carrying out a program of research and development aimed at integrated systems testing of critical components comprising the front end of the Project X. This program is being undertaken as a key component of the larger Project X R&D program. The successful completion of this program will validate the concept for the Project X front end",
        "thereby minimizing a primary technical risk element within Project X. Integrated systems testing",
        "known as the Project X Injector Experiment (PXIE)",
        "will be accomplished with a new test facility under construction at Fermilab and will be completed over the period FY12- 17. PXIE will include an H− ion source",
        "a CW 2.1-MeV RFQ and two superconductive RF (SRF) cryomodules providing up to 25 MeV energy gain at an average beam current of 1 mA (upgradable to 2 mA). Successful systems testing will also demonstrate the viability of novel front end technologies that are expected find applications beyond Project X."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tuoab102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tuoab102.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tuoab102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUOAB102",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOAB103",
      "title": "Development of a Low-energy Heavy-ion Storage Ring Facility at KACST",
      "authors": [
        "M.O.A. El Ghazaly",
        "H.H. Alharbi",
        "S.M. Alshammari",
        "KACST",
        "Riyadh",
        "Kingdom of Saudi Arabia",
        "Heavy-ion storage rings have provided a great impetus to research in atomic and molecular physics",
        "and related fields. At the National Centre for Mathematics and Physics (NCMP)",
        "King Abdulaziz City for Science and Technology (KACST)",
        "a small electrostatic storage ring for atomic and Molecular collisions are currently being developed. The design of this ring relies on the pioneering Danish storage ring ELISA (ELectrostatic Ion Storage ring in Aarhus)",
        "but extends beyond it in that it shall form the core of a unique facility at KACST. Here",
        "a detailed description of the design of such a storage ring is presented together with the present status of the project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tuoab103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tuoab103.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tuoab103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUOAB103",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 21:12:05"
}