{
  "session_info": {
    "id": "THOAA",
    "name": "THOAA - Radioactive Ion Beam Facilities",
    "url": "https://proceedings.jacow.org/hiat2018/html/thoaa.htm"
  },
  "papers": [
    {
      "paper_id": "THOAA01",
      "title": "High Resolution Mass Separator Dipole Design Studies for SPES Project",
      "authors": [
        "C. Baltador",
        "L. Bellan",
        "M. Cavenago",
        "M. Comunian",
        "L. Ferrari",
        "A. Galatà",
        "M.F. Moisio",
        "A. Pisent",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "Consorzio RFX",
        "Padova",
        "Italy",
        "The purposes of the SPES (Selective Production of Exotic Species) project at INFN laboratory in Legnaro (Italy) is to study nuclei close to the drip lines. Therefore",
        "a High Resolution Mass Separator (HRMS) must provide full separation of the ions with a resolution 1/20000",
        "to be sensible to the proton’neutron mass difference. SPES HRMS is consisting of: two 90° magnet dipoles",
        "one electrostatic multipole in between them",
        "six electrostatic quadrupoles",
        "two electrostatic hexapoles and two electrostatic triplets before and after the slits on the object and image point. All these components will be installed on a high voltage platform with a maximum operating voltage of -240 kV. Before entering the HRMS",
        "a 40 keV energy beam go through an RFQ Cooler",
        "designed to have an output energy spread of 1 eV. Mass separation within target resolution is the most critical part: dipoles must provide a magnetic field homogeneity of 4 E-5 throughout beam occupancy (half magnet pole surface)",
        "at a field intensity of 0.56 T for the reference ion 132 Sn. Therefore",
        "a very accurate dipole design is mandatory. This contribute will show the key points which lead to the final HRMS layout and dipole design."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hiat2018/talks/thoaa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hiat2018/papers/thoaa01.pdf",
      "poster_url": "https://proceedings.jacow.org/hiat2018/posters/thoaa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2018-THOAA01",
      "page_number": "164",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:37:31"
}