{
  "session_info": {
    "id": "TUZO",
    "name": "TUZO - Ion Beam Extraction & Optics",
    "url": "https://proceedings.jacow.org/ECRIS2012/html/tuzo.htm"
  },
  "papers": [
    {
      "paper_id": "TUZO01",
      "title": "Beam Extraction Results with KAERI 14.5 GHz ECR Ion Source",
      "authors": [
        "B.H. Oh",
        "D.S. Chang",
        "C.K. Hwang",
        "S.R. In",
        "S.H. Jeong",
        "J.-T. Jin",
        "T.S. Kim",
        "C.H. Lee",
        "K.W. Lee",
        "KAERI",
        "Daejon",
        "Republic of Korea",
        "E.-S. Kim",
        "C.S. Seo",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "A 14.5 GHz electron cyclotron resonance ion source has been designed and fabricated at KAERI (Korea Atomic Energy Research Institute) to produce multi-charged ion beams (particularly C6+ ion beams) for medical applications. During the first beam extraction experiments with the developed ion source",
        "it was found that C4+ beam of 15 eμA and Ar15+ beam of 1 eμA were the optimized beam current. A big current loss was made along the beam transport path from the ion source to the entrance port of an analyzing magnet because of long beam line and small acceptance of the magnet. A new Einzel lens is added in the beam line to minimize the beam loss",
        "and the second beam extraction experiments have been made. In this paper the beam experimental results with the KAERI ion source",
        "including the hard X-ray spectrum from the ECR plasma and the emittance measurement results of carbon beam",
        "will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuzo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuzo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuzo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUZO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUZO02",
      "title": "Detailed Investigation of the 4D Phase-Space of an Ion Beam",
      "authors": [
        "H.R. Kremers",
        "J.P.M. Beijers",
        "S. Brandenburg",
        "V. Mironov",
        "S. Saminathan",
        "KVI",
        "Groningen",
        "The Netherlands",
        "A second order transfer matrix is calculated",
        "which is used in the calculation of a 4D phase-space distribution of a 24.6 keV He1+ beam. The calculated distribution matches a 4D phase-space distribution measured with the KVI pepper pot emittance meter. The pepper pot emittance meter is installed in the image plane of a dipole magnet acting as a charge-state analyser directly downstream the KVI AECR ion source. From the second order transfer matrix simple analytical equations are derived by retaining the terms for angular coefficients. These simple equations describe the main features of the phase-space correlations in the image plane. The equations show also that the subset of the 4D phase-space distribution",
        "selected by one pepper pot aperture",
        "results in multiple beam-lets. Due to this successful matrix modelling we conclude that the 4D phase-space distribution measured is fully determined by the ionoptical properties of the magnet."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuzo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuzo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuzo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUZO02",
      "page_number": "30",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZO03",
      "title": "New Extraction Design for the JYFL 14 GHz ECRIS",
      "authors": [
        "V. Toivanen",
        "T. Kalvas",
        "H. A. Koivisto",
        "J.P.O. Komppula",
        "O.A. Tarvainen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "A new extraction system has been designed and constructed for the JYFL 14 GHz ECRIS at the Department of Physics",
        "University of Jyväskylä (JYFL). The goal of the new design is to improve the performance of the ion source and increase the transmission efficiency of the low energy beam transport and the accelerator. The new extraction system is designed to be able to handle higher beam currents",
        "yield better beam quality and offer more tuning flexibility. The design was made with the aid of simulations performed with the IBSimu code. The suitability of the code for this task was verified by simulating the old extraction system and good agreement between simulations and measurements was achieved. The new extraction system has been constructed",
        "installed and tested. The new design",
        "simulations and the first measurement results will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuzo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuzo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuzo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUZO03",
      "page_number": "34",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZO04",
      "title": "Space Charge Compensation Measurements of Multicharged Ion Beams Extracted from an ECR Ion Source",
      "authors": [
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "D.G. Cole",
        "D. Leitner",
        "G. Machicoane",
        "F. Marti",
        "L. Tobos",
        "NSCL",
        "East Lansing",
        "Michigan",
        "USA",
        "Space charge compensation* due to the interaction of the beam with residual gas molecules is a well-known phenomenon for high current injector beam lines. For beam lines using mostly magnetic focusing elements and for pressure above 10-6 mbar",
        "full neutralization has been observed. However",
        "due to the low pressure required for the efficient transport of high charge state ions",
        "beams in ECR injector lines are typically only partly neutralized. With the performance increase of the next generation ECR ion sources it is possible to extract tens of mA of beam current. In this high current regime",
        "non-linear focusing effects due to the space-charge potential of the beam become more and more important. In order to develop a realistic simulation model for low energy beam transport lines",
        "it is important to estimate the degree of space charge compensation. In this contribution we report on measurements of the beam potential (and neutralization)",
        "performed after the extraction region of the ECR ion source",
        "in dependence of the base pressure in the beam line and other source parameters using a Retarding Field Analyzer (RFA). Results are discussed and compared to simulations.",
        "* When the beam interacts with the residual gas",
        "electrons are separated from gas molecules and accumulate inside the beam envelope",
        "thereby compensating the space-charge (aka neutralization)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuzo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuzo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuzo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUZO04",
      "page_number": "38",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:29:07"
}