{
  "session_info": {
    "id": "WEPI",
    "name": "WEPI - Poster in Pills 1",
    "url": "https://proceedings.jacow.org/pcapac2018/html/wepi.htm"
  },
  "papers": [
    {
      "paper_id": "WEPI1",
      "title": "EtherCAT Driver and Tools for EPICS and Linux at PSI",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "EtherCAT bus and interface are widely used for external module and device control in accelerator environments at PSI",
        "ranging from modulator and undulator communication and control",
        "over motion control",
        "basic I/O control",
        "all the way to Machine Protection System for the new SwissFEL accelerator. A combined EPICS/Linux driver package has been developed at PSI",
        "to allow for simple and mostly automatic setup of various EtherCAT configurations. The driver is capable of automatic scan of the existing devices and modules",
        "followed by self-configuration and finally autonomous operation of the EtherCAT bus real-time loop. Additionally",
        "the driver package supports the user PLC to manipulate EtherCAT data in real time",
        "implements fast real-time (single cycle) slave-to-slave communication (skipping EPICS layer or PLC completely)",
        "features guaranteed one-shot trigger signals otherwise not supported by EPICS and much more. All the standard EtherCAT functions are supported",
        "including the complete reprogramming of slave configurations and configuration generation for programmable slaves",
        "such as EL6692 and EL6695 network bridges.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP01 paper received ※ 08 October 2018       paper accepted ※ 16 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI1",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI2",
      "title": "BLISS - Experiments Control for ESRF Beamline",
      "authors": [
        "V. Michel",
        "A. Beteva",
        "T.M. Coutinho",
        "M.C. Dominguez",
        "M. Guijarro",
        "C. Guilloud",
        "A. Homs",
        "J.M. Meyer",
        "E. Papillon",
        "M. Perez",
        "S. Petitdemange",
        "ESRF",
        "Grenoble",
        "France",
        "BLISS is the new ESRF control system for running experiments",
        "with full deployment aimed for the end of the EBS upgrade program in 2020. BLISS provides a global approach to run synchrotron experiments",
        "thanks to hardware integration",
        "Python sequences and an advanced scanning engine. As a Python package",
        "BLISS can be easily embedded into any Python application and data management features enable online data analysis. In addition",
        "BLISS ships with tools to enhance scientists user experience and can easily be integrated into TANGO based environments",
        "with generic TANGO servers on top of BLISS controllers. BLISS configuration facility can be used as an alternative TANGO database. Delineating all aspects of the BLISS project from beamline device configuration up to the integrated user interface",
        "this poster will present the technical choices that drove BLISS design and will describe the BLISS software architecture and technology stack in depth."
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi2.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI2",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI3",
      "title": "A General Solution for Complex Vacuum System Controls",
      "authors": [
        "G. Bischof",
        "A. M. Barbour",
        "B. A. Sobhani",
        "A. Walter",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "At the National Synchrotron Light Source II (NSLS-II) there are many different ultra-high vacuum system configurations on the unique beamline end-stations. The proposed controls solution attempts to capture the requirements of all of these configurations with a single standard logic and graphical user interface. Additional design considerations include: resource management for multiple users",
        "providing a high level of abstraction to simplify operation for users",
        "providing a high level of flexibility to do non-standard operations",
        "minimizing shock from pressure differentials when opening valves",
        "supporting a variety of pumps",
        "and maximizing pump lifetime. At NSLS-II it was determined that all vacuum configurations can be captured by the composition of three standard objects: a \"rough vacuum group\"",
        "and \"high vacuum group\"",
        "and a \"smart vacuum manifold\" which implements a blocking queue. These objects can be flexibly linked together to meet the needs of the beamline experiments. This solution is platform independent",
        "but implemented and tested here using Pfeiffer vacuum pumps",
        "Allen Bradley PLC",
        "EPICS",
        "and Control System Studio (CSS).",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP03 paper received ※ 10 October 2018       paper accepted ※ 16 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi3.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI3",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI4",
      "title": "Developing and Validating OPC-UA Based Industrial Controls for Power Supplies at CERN",
      "authors": [
        "M. Ludwig",
        "J.A.R. Arroyo Garcia",
        "M. Bengulescu",
        "B. Farnham",
        "P.G.J. Gonzalez Jimenez",
        "F. Varela",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The industrial control systems of CERN’s experiments are undergoing major renovation since 2017 and well into CERN’s second Long Shutdown (LS2) until the end of 2019. Each detector power-supply control system runs several hundred software instances consisting of many different components in parallel on a large scale",
        "broadly distinguishable as servers and clients. Our accumulated experience during LHC runs proves that some complex control issues are impossible to detect using stand-alone components on a small scale only. Furthermore",
        "new components must be developed well before the electron-ics becomes available",
        "without impact on operations. Moreover",
        "during LS2",
        "the improved and now widely established Open Protocol Communication Unified Ar-chitecture (OPC-UA) replaces OPC-DA as middleware protocol. For these reasons",
        "we developed a simulation environment to emulate the real",
        "and valuable",
        "CAEN power-supply electronics underneath the OPC-UA serv-ers. This distributed simulation is configurable to mimic and exceed the nominal conditions during production and provides a repeatable setup for validation. This paper discusses the functionality and use of this simulation service.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP04 paper received ※ 05 October 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi4.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI4",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI5",
      "title": "Wireless Internet of Thing Application in the TLS",
      "authors": [
        "C.H. Kuo",
        "K.H. Hu",
        "C.-J. Wang",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The internet of thing is applied in the accelerator more frequently than before. There are many advantages in data acquisition and control oriented applications",
        "for example",
        "easy to distribute remotely and less cables needed",
        "low noise generated",
        "many commercial interfaces for choosing. The stable wireless communication is also applied in the measurement system. The high reliability and security of wireless communication with server and client structure is introduced. The structure design and implementation of IoT are summarized in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP05 paper received ※ 16 October 2018       paper accepted ※ 30 January 2019        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi5.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI5",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI6",
      "title": "Data Archiving and Visualization of IRFEL",
      "authors": [
        "Y. Song",
        "X. Chen",
        "C. Li",
        "G. Liu",
        "J.G. Wang",
        "K. Xuan",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "An Infrared Free Electron Laser Light (IRFEL) is being constructed at National Synchrotron Radiation Laboratory. The EPICS Archiver Appliance provides the functions of historical data acquisition",
        "archiving",
        "migration",
        "retrieval and management in the IRFEL facility. A Single-Page Web Application is developed for the data visualization based on Vue.js framework and Highcharts JavaScirpt library. A unified interface is developed for the visualization to integrate multiple data sources and provide the same retrieval entry of the historical data from EPICS Archiver Appliance",
        "the real-time data from EPICS IOC",
        "the statistical data from database and the alarm information from the Phoebus. This paper will describe the implementation details of data archiving and visualization of IRFEL.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Funding: Work supported by National Natural Science Foundation of China (No.11375186)"
      ],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP06 paper received ※ 09 October 2018       paper accepted ※ 16 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi6.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI6",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI7",
      "title": "Innovative Graphical User Interfaces Development: Give the Power Back to Users",
      "authors": [
        "G. Segura",
        "A. Ledeul",
        "A. Savulescu",
        "B. Styczen",
        "D. Vazquez Rivera",
        "CERN",
        "Meyrin",
        "Switzerland",
        "GUI for supervision",
        "control and data acquisition systems are usually oriented to specialist users. In big organizations like CERN",
        "where different teams play the roles of operators",
        "scientists and instrumentation specialists",
        "providing a unique or static user interface usually results in a situation of dissatisfaction of everyone. On the other hand",
        "providing distinct user interfaces for each type of user increases the development and maintenance effort and makes software evolution heavier. The approach taken for the design and development of GUIs for radiation and environment protection at CERN addressed this issue by integrating user interface changes as an embedded software functionality. Key users were provided with a tool to build",
        "deploy and maintain their own tailor-made user interfaces",
        "in a graphical way and without the necessity of learning any kind of programming or scripting languages. Other benefits observed from this solution include reduction of the resources spent on the support and maintenance and increase of the frequency of GUIs updates",
        "executed without compromising the underlying control system. This paper describe the innovative design that was implemented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP07 paper received ※ 09 October 2018       paper accepted ※ 17 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi7_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi7.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi7_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI7",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI8",
      "title": "A Universal System Based on WebSocket and JSON for the Employment of LabVIEW External Drivers",
      "authors": [
        "A. Stecchi",
        "C. Bisegni",
        "P. Ciuffetti",
        "A. D’Uffizi",
        "G. Di Pirro",
        "F. Galletti",
        "A. Michelotti",
        "INFN/LNF",
        "Frascati",
        "Italy",
        "One of the heaviest workloads when installing a Control System on a plant is the development of a large number of device drivers. This is even more true in the case of scientific facilities for which you typically deal with many custom devices and legacy code. In these cases",
        "it is useful to consider the Rapid Application Development (RAD) approach that consists in lessen the planning phase and give more emphasis on an adaptive process",
        "so that software prototypes can be successfully used in addition to or in place of design specifications. LabVIEW* is a typical RAD-oriented development tool and is widely used in technical laboratories where many stand-alone programs are developed to manage devices under construction or evaluation. An original system that allows software clients to use external LabVIEW drivers is presented. This system",
        "originally created for the !CHAOS Control System**",
        "is entirely written in LabVIEW and is based on JSON messages -transmitted on a WebSocket communication- driving LabVIEW VIs through dynamic calls. This system is completely decoupled from the client and is therefore suitable for any Control System.",
        "*LabVIEW: http://www.ni.com ** L. Catani et al",
        "Phys. Rev. ST Accel. Beams 15",
        "112804 (2012). Introducing a New Paradigm for Accelerators and Large Experimental Apparatus Control Systems.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP08 paper received ※ 10 October 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi8_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi8.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi8_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI8",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 8,
  "scrape_time": "2025-10-11 02:01:54"
}