{
  "session_info": {
    "id": "TUZA",
    "name": "TUZA - Invited Oral Presentations, Synchrotron Light Sources and FELs",
    "url": "https://proceedings.jacow.org/IPAC2014/html/tuza.htm"
  },
  "papers": [
    {
      "paper_id": "TUZA01",
      "title": "Advanced Concepts and Challenges in Compton Radiation Sources",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Ongoing developments in Compton radiation sources are aimed toward a diversity of potential applications",
        "ranging from university-scale compact x-ray light sources and metrology tools for EUV lithography",
        "to positron sources for e−e+ colliders. Novel conceptual approaches are pursued on different routes: One research direction lies in multiplying the source’s repetition rate and increasing its average brightness by placing the point of Compton interaction inside an optical cavity. High-gradient plasma-wakefield accelerators are fast becoming a practical reality",
        "offering a new paradigm to compact all-optical Compton sources operating in x-ray- and gamma-regions. Continuing improvement in the quality of the beam of plasma accelerators promises the achievement of fully coherent Compton x-rays",
        "thereby prompting the evolution of the Compton source to an all-optical free-electron laser."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/tuza01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/tuza01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/tuza01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-TUZA01",
      "page_number": "928",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZA02",
      "title": "THz Facility at ELBE: A Versatile Test Facility for Electron Bunch Diagnostics on Quasi-CW Electron Beams",
      "authors": [
        "M. Gensch",
        "B.W. Green",
        "J. Hauser",
        "S. Kovalev",
        "M. Kuntzsch",
        "U. Lehnert",
        "P. Michel",
        "R. Schurig",
        "HZDR",
        "Dresden",
        "Germany",
        "A. Al-Shemmary",
        "V. B. Asgekar",
        "T. Golz",
        "H. Schlarb",
        "N. Stojanovic",
        "S. Vilcins",
        "DESY",
        "Hamburg",
        "Germany",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "XFEL. EU",
        "Hamburg",
        "Germany",
        "A.-S. Müller",
        "M. Schwarz",
        "KIT",
        "Karlsruhe",
        "Germany",
        "N.E. Neumann",
        "D. Plettemeier",
        "TU Dresden",
        "Dresden",
        "Germany",
        "At the Helmholtz-Zentrum Dresden-Rossendorf near Dresden a quasi-cw low-energy electron linear accelerator based on superconducting radiofrequency technology is operated successfully for more than 10 years. The ELBE accelerator is driving several secondary radiation sources including 2 infrared free electron lasers. A new addition will be a THz facility that aims to make use of super-radiant THz radiation. In its final form the THz facility shall consist of one coherent diffraction radiator and one undulator source which provide high-field THz pulses at unprecedented repetition rates. While the medium term goal is to establish a unique user facility for nonlinear THz science",
        "the THz sources are already used as a test facility for novel diagnostic techniques on quasi-cw electron beams. The progress of the developments is reported and an outlook into future challenges and opportunities is given."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/tuza02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/tuza02.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/tuza02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-TUZA02",
      "page_number": "933",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 20:40:21"
}