{
  "session_info": {
    "id": "MOXPLM",
    "name": "MOXPLM - Opening talks",
    "url": "https://proceedings.jacow.org/ipac2019/html/moxplm.htm"
  },
  "papers": [
    {
      "paper_id": "MOXPLM1",
      "title": "Meeting Future Challenges in Accelerators: Innovation, Collaboration and Communication.",
      "authors": [
        "JAI",
        "Oxford",
        "United Kingdom",
        "Accelerator science crosses from curiosity-driven research all the way through to practical applications. For more than 100 years",
        "innovation in accelerator physics and engineering have provided cutting edge instruments capable of understanding the Universe. Today",
        "at the energy and intensity frontiers",
        "machines are getting so large and complex that they take decades to realise. However",
        "there are further challenges of increasing importance such as reliability",
        "cost and sustainability. Some of these challenges are most pressing in our ’everyday’ accelerators used in medicine and industry. In this talk",
        "I will use historical and contemporary examples to build on the themes of innovation",
        "collaboration and communication",
        "providing an overview of the ways in which our field works to both explore the Universe and make an impact in society."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/moxplm1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/moxplm1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/moxplm1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-MOXPLM1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOXPLM2",
      "title": "From Dreams to Reality: Prospects for Applying Advanced Accelerator Technology to Next Generation Scientific User Facilities",
      "authors": [
        "INFN/LNF",
        "Frascati",
        "Italy",
        "DESY",
        "Hamburg",
        "Germany",
        "Recent years have seen spectacular progress in the development of innovative acceleration methods that are not based on traditional RF accelerating structures. These novel developments are at the interface of laser",
        "plasma and accelerator physics and may potentially lead to much more compact and economical accelerator facilities. While primarily focusing on the ability to accelerate charged particles with much larger gradients than traditional RF",
        "these new techniques have yet to demonstrate comparable performances to RF in terms of both beam parameters or reproducibility. To guide the developments beyond the necessary basic R&D and concept validations",
        "a common understanding and definition of required performance and beam parameters for an operational user facility is now needed. These innovative user facilities can include \"table-top\" light sources",
        "medical accelerators",
        "industrial accelerators or even high-energy colliders. The talk will review the most promising developments in new acceleration methods",
        "it will present the status of ongoing projects including the EU project EuPRAXIA and will identify the set of required specifications for the application under consideration."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/moxplm2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/moxplm2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/moxplm2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-MOXPLM2",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 19:04:02"
}