{
  "session_info": {
    "id": "FRXXPLS",
    "name": "FRXXPLS - Contributed Oral: Beam Instrumentation, Controls, Feedback and Operation",
    "url": "https://proceedings.jacow.org/ipac2019/html/frxxpls.htm"
  },
  "papers": [
    {
      "paper_id": "FRXXPLS1",
      "title": "Tests of a 3D Printed BPM with a Stretched Wire and with a Particle Beam",
      "authors": [
        "N. Delerue",
        "D. Auguste",
        "J. Bonis",
        "F. Gauthier",
        "S. Jenzer",
        "A.M. Moutardier",
        "LAL",
        "Orsay",
        "France"
      ],
      "institutions": [],
      "abstract": "We have successfully printed a beam position monitor using 3D printing. After ultra-high vacuum testing and initial measurements with a network analyser we now reports on tests of this BPM using the stretched wire method. The BPM has been installed on a test stand with a wire going through it and electrical pulses have been sent. The signal measured on the pick-ups was compared to that of two conventional BPMs and shows no anomaly specific to the 3D printed BPMs. Following the success of these tests we have also installed this BPM in a beam line at the PhotoInjector at LAL (PHIL). We show that it can give position measurements with an accuracy comparable to that of other BPMs.",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/frxxpls1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/frxxpls1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/frxxpls1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-FRXXPLS1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRXXPLS2",
      "title": "Extinction Measurement of J-PARC MR with 8 GeV Proton Beam for the New Muon-to-Electron Conversion Search Experiment - COMET",
      "authors": [
        "H. Nishiguchi",
        "Y. Fukao",
        "Y. Hashimoto",
        "Y. Igarashi",
        "S. Mihara",
        "M. Moritsu",
        "R. Muto",
        "M. Tomizawa",
        "K. Ueno",
        "KEK",
        "Tsukuba",
        "Japan",
        "Monash University",
        "Faculty of Science",
        "Clayton",
        "Victoria",
        "Australia",
        "Indian Institute of Technology Bombay",
        "Mumbai",
        "India",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "At J-PARC",
        "extraction tests of a 8GeV pulsed proton beam from Main Ring (MR) have been successfully completed by a team drawn from the Accelerator Laboratory Group and the COherent Muon to Electron Transition (COMET) Experimental Group. The COMET Experiment aims to find new physics beyond the Standard Model by searching for the coherent neutrinoless conversion of a muon to an electron in muonic atoms",
        "so-called mu-e conversion. This requires an extremely clean pulsed beam",
        "and development of this beam plays a key role in the pursuit of the highest level of sensitivity. This successful extraction test is the clearing of a major milestone for the forthcoming experiment. The goal of the extraction tests was to confirm the beam quality under the customized MR operation mode. The J-PARC MR usually accelerates the proton beam (at one bunch per 600ns) up to 30GeV. But in the test",
        "the MR instead accelerates the proton beam (at one bunch per 1.2us) up to 8GeV. The number of protons leaking between proton bunches",
        "so-called EXTINCTION",
        "must be less than one for every 1010 protons in the bunch. Extraction tests in the customized mode were conducted in January and February 2018 and resulted in many successes. In this test",
        "leakage protons between bunches was successfully reduced below the objective of 10−10 of the number of protons in a bunch. This is a great success to guarantee the quality of proton beam required by COMET experiment. In addition",
        "the time development of proton leakage was also precisely studied with several RF settings which enables us to further improve the extinction. In this paper",
        "the result of extinction measurement and future prospect of beam extinction improvement is presented in addition to the detailed description of customized MR operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/frxxpls2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/frxxpls2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/frxxpls2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-FRXXPLS2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRXXPLS3",
      "title": "Application of a Phase Space Beam Position and Size Monitor for Synchrotron Radiation",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/frxxpls3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/frxxpls3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/frxxpls3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-FRXXPLS3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:20:16"
}