{
  "session_info": {
    "id": "WEYYPLS",
    "name": "WEYYPLS - Contributed Orals: Beam Dynamics and EM Fields",
    "url": "https://proceedings.jacow.org/ipac2019/html/weyypls.htm"
  },
  "papers": [
    {
      "paper_id": "WEYYPLS1",
      "title": "Muon G-2:  An Interplay between Beam Dynamics and a Muon Decay Experiment at the Precision Frontier",
      "authors": [
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "The Muon g-2 Experiment at Fermilab (E989) will use the higher proton flux delivered by the Fermilab accelerator complex and improvements to the experimental apparatus to measure the anomalous magnetic moment of the muon to unprecedented precision. In addition to the increased statistics beyond the most recent measurement",
        "the experiment relies on detailed understanding of the beam dynamics in the experiment’s storage ring as well as the incoming muon beam properties for proper assessments of systematic errors in the data analysis. Modeling and measurements of beam and storage ring properties",
        "from proton targeting to muon storage",
        "produce a unique unification of particle beam physics with a high energy physics experiment. Here the beam dynamics issues and analysis techniques essential to the g-2 experiment are presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/weyypls1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/weyypls1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/weyypls1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-WEYYPLS1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYYPLS2",
      "title": "First Experimental Measurements of the Caustic Nature of Trajectories in Bunch Compressors",
      "authors": [
        "The University of Melbourne",
        "Melbourne",
        "Victoria",
        "Australia",
        "Lund University",
        "Lund",
        "Sweden",
        "CERN",
        "Geneva",
        "Switzerland",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "Theoretical advancements describing density perturbations in accelerated charge particle beams",
        "known as caustics",
        "has been recently developed * This proceeding describes the first experimental measurements of the caustic nature of charged particle trajectories in a particle accelerator. Caustics by their nature are discontinuities that result from small continuous perturbations of an input. Under certain conditions",
        "small density modulations will reliably produce striking changes in the corresponding output current profile. These current modulations can shift alone the bunch with varying higher-order longitudinal dispersion. The MAX IV linac double-bend achromats provide the perfect test bed for experimentally verifying how the caustic lines evolve. The natural amplification of small perturbations makes caustics an attractive diagnostic tool",
        "and effective tool for characterise the bunch compressors. This approach also allows us to modify and improve the longitudinal charge profile",
        "removing current spikes or creating tailor shaped current profiles.",
        "* T.K.Charles et. al. Phys. Rev. Accel. Beams 19",
        "104402"
      ],
      "institutions": [],
      "abstract": "J. Björklund Svensson",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/weyypls2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/weyypls2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/weyypls2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-WEYYPLS2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYYPLS3",
      "title": "Development of Methods for Calculation of Bunch Radiation in Presence of Dielectric Objects",
      "authors": [
        "A.V. Tyukhtin",
        "E.S. Belonogaya",
        "S.N. Galyamin",
        "V.V. Vorobev",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "Radiation of charged particles moving in presence of dielectric targets is of interests for various applications in accelerator and beam physics*. Typically",
        "the size of the target is much larger than the wavelengths under consideration. This fact gives us an obvious small parameter of the problem and allows developing approximate methods of analysis. We develop two methods: \"ray-optical method\" and \"aperture method\"**. These methods can be very effective for all situations where we can find the tangential field components on the \"aperture\" which is an object boundary illuminated by Cherenkov radiation. We apply the aperture method to different dielectric objects including a prism",
        "a cone",
        "and a ball. Electromagnetic field is analyzed on different distances from the objects. The special attention is given to investigation of the field in the far-field (Fraunhofer) area having large importance for various applications. We obtain analytical results for different objects",
        "demonstrate typical radiation patterns and discuss new physical effects",
        "in particular",
        "the phenomenon of concentration of radiation and effect of \"Cherenkov spotlight\". Prospects of use of aperture method and ray-optical one for other objects are discussed as well.",
        "* R.Kieffer et al",
        "PRL",
        "121",
        "054802 (2018).  ** E.S.Belonogaya et al",
        "JOSA B",
        "32",
        "649 (2015); S.N.Galyamin",
        "A.V.Tyukhtin",
        "PRL",
        "113",
        "064802 (2014); A.V.Tyukhtin et al",
        "J. Instrum.",
        "13",
        "C02033 (2018)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/weyypls3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/weyypls3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/weyypls3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-WEYYPLS3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:12:28"
}