{
  "session_info": {
    "id": "WEIB2",
    "name": "WEIB2 - Special Session for Industry",
    "url": "https://proceedings.jacow.org/IPAC2013/html/weib2.htm"
  },
  "papers": [
    {
      "paper_id": "WEIB201",
      "title": "Industrial Accelerators",
      "authors": [
        "R.W. Hamm",
        "M.E. Hamm",
        "R&M Technical Enterprises",
        "Pleasanton",
        "California",
        "USA",
        "Particle accelerators",
        "originally developed for basic science research",
        "are increasingly being employed for industrial applications",
        "with the production of these systems itself a worldwide business conducted by more than 70 companies and institutes. Collectively these entities ship more than 1000 systems per year. The industrial applications of these accelerators cover a broad range of business segments from low energy electron beam systems for welding",
        "machining",
        "and product irradiation to high energy cyclotrons and synchrotrons for radioisotope production and synchrotron radiation production. This talk is a review of these business segments and their impact on our lives and the economy. It will also cover new accelerator technology under development that will be used by industry in the future and the predicted growth in the various business segments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weib201_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weib201.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weib201_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEIB201",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEIB202",
      "title": "Industrialization of the ILC Project",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The International Linear Collider Global Design Effort (GDE) team completed the Technical Design Report (TDR) in early 2013. The TDR consists of a description of the machine design",
        "a summary of the R&D program carried out in support of the design",
        "a cost estimate and a project plan. The number of high technology components to be fabricated for ILC is large",
        "similar to that built for the Large Hadron Collider*",
        "and industrial partners have had an important role throughout the technical development and design period. It is recognized that transfer of new technology to industrial partners and subsequent collaborative development can be difficult**. To counter this",
        "the ILC Technical Design Phase (TDP) team arranged a series of vendor visits",
        "component development contracts",
        "workshop satellite meetings and industrial production study contracts. The GDE collaboration provided the framework for development through an agreed-upon performance parameter set and project implementation scheme. The latter includes a ‘plug-compatibility’ policy that promotes innovation as long as specified interface conditions are met. In this paper we show the evolution of the technology from the labs where it was developed to the companies where high performance cavities are now routinely produced."
      ],
      "institutions": [],
      "abstract": "* The longest journey: the LHC dipoles arrive on time.  http://cerncourier.com/cws/article/cern/29723   ** Office of High Energy Physics Accelerator R&D Task Force Report http://www.acceleratorsamerica.org/report/acceleratortaskforcereport.pdf",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weib202_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weib202.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weib202_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEIB202",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEIB203",
      "title": "Industrialization of ILC from a View Point of Industry",
      "authors": [
        "K. Sennyu",
        "H. Hara",
        "F. Inoue",
        "K. Kanaoka",
        "K. Okihira",
        "MHI",
        "Hiroshima",
        "Japan",
        "Cavity performance has been improved by various efforts to meet the ILC spec stably in these days. For industrialization",
        "not only Quality but also Cost and Delivery time",
        "that is",
        "QCD are important. We report our activities for stable quality and cost reduction in this report."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weib203_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weib203.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weib203_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEIB203",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEIB204",
      "title": "Industry and Science, POSCO and POSTECH Case",
      "authors": [
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "POSCO is a world-leading iron and steel company established in 1968 in Pohang",
        "in the South East coast of Korea. Starting with 1.0 million ton size in 1973",
        "the company made profits even in the first year. While its capacity has been increased to 40 million tons with another works in Gwangyang",
        "POSCO paid attention on education to attract intellectuals to Pohang and Korea. It results in establishing a small-sized university",
        "Pohang University of Science and Technology (POSTECH) in 1987. POSTECH immediately decided to construct a third generation synchrotron light source of 2.0 GeV",
        "Pohang Light Source (PLS) on its campus in 1988",
        "with support from POSCO and also Government. POSTECH achieved a high rank in the world",
        "and PLS is upgraded to 3.0 GeV in 2011. A new PAL-XFEL of 10.0 GeV is now under construction. POSCO's consistent policy is the key of the success of POSTECH and Pohang Light Source. This is an unprecedented example of the relationship between industry and science."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weib204_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weib204.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weib204_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEIB204",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEIB205",
      "title": "Promoting Local Economic Development by an Integration of Industry, Teaching and Research of Compact Low Energy Accelerators",
      "authors": [
        "M. Fan",
        "D.Z. Chen",
        "J. Huang",
        "D. Li",
        "K.F. Liu",
        "B. Qin",
        "Y.Q. Xiong",
        "J. Yang",
        "T. Yu",
        "HUST",
        "Wuhan",
        "People's Republic of China",
        "Hubei University of Science and Technology",
        "Hubei",
        "People's Republic of China",
        "Huazhong University of Science and Technology has been carrying out R&D of compact low energy accelerators by integrating industry",
        "teaching and research to promote local economic development supported by both national and provincial government and local enterprises. Currently",
        "the projects include: compact medical cyclotron",
        "electron irradiation accelerators",
        "etc. The industry of non-power nuclear energy based on low energy particle accelerator has also drawn attention from the provincial government of Hubei and municipal government of Xianning. Meanwhile",
        "a series of lectures about nuclear science and nuclear safety were hosted to help the public better understand nuclear technology and to wipe out fears of nuclear energy. At the moment",
        "the application of non-power nuclear energy with based on compact low energy accelerator is developing into an industry chain in the area of central China."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weib205_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weib205.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weib205_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEIB205",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-10 21:27:18"
}