{
  "session_info": {
    "id": "MOZB2",
    "name": "MOZB2 - Invited Oral Presentations (Circular and Linear Colliders)",
    "url": "https://proceedings.jacow.org/IPAC2013/html/mozb2.htm"
  },
  "papers": [
    {
      "paper_id": "MOZB201",
      "title": "Overview of the LHeC Design Study at CERN",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "The LHeC is a potential future lepton-hadron collider project at CERN based on the existing LHC infrastructure. The presentation highlights the main results of the recently published conceptual design report",
        "including the findings of an international review committee that evaluated it. The presentation outlines the planed future studies and R&D activities for the next years."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mozb201_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mozb201.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mozb201_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOZB201",
      "page_number": "40",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOZB202",
      "title": "The First Long Shutdown (LS1) for the LHC",
      "authors": [
        "F. Bordry",
        "S. Baird",
        "K. Foraz",
        "A.-L. Perrot",
        "R.I. Saban",
        "J.Ph. G. L. Tock",
        "CERN",
        "Geneva",
        "Switzerland",
        "The LHC has been delivering data to the physics experiments since the first collisions in 2009. The first long shutdown (LS1)",
        "which started on 14 February 2013",
        "was triggered by the need to consolidate the magnet interconnections so as to allow the LHC to operate at the design energy of 14 TeV in the centre-of-mass. It has now become a major shutdown which",
        "in addition",
        "includes other repairs",
        "consolidation",
        "upgrades and cabling across the whole accelerator complex and the associated experimental facilities. LS1 will see a massive programme of maintenance for the LHC and its injectors in the wake of more than three years of operation without the long winter shutdowns that were the norm in the past. The main driving effort will be the consolidation of the 10",
        "170 high-current splices between the superconducting magnets. The presentation describes first the preparation phase with the prioritisation of the activities",
        "the building of the teams and the detailed planning of the operation. Then",
        "it gives the status after 3 months and the restart plans for all CERN accelerators. First lessons learnt for the 2nd long shutdown (LS2) will conclude the presentation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mozb202_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mozb202.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mozb202_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOZB202",
      "page_number": "44",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 21:01:31"
}