{
  "session_info": {
    "id": "WEPLG",
    "name": "WEPLG - Wednesday Plenary",
    "url": "https://proceedings.jacow.org/icap2018/html/weplg.htm"
  },
  "papers": [
    {
      "paper_id": "WEPLG01",
      "title": "Analysis of Emittance Growth in a Gridless Spectral Poisson Solver for Fully Symplectic Multiparticle Tracking",
      "authors": [
        "C.E. Mitchell",
        "J. Qiang",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Gridless spectral methods for self-consistent symplectic space charge modeling possess several advantages over traditional momentum-conserving particle-in-cell methods",
        "including the absence of numerical grid heating and the presence of an underlying multi-particle Hamiltonian. Nevertheless",
        "evidence of collisional particle noise remains. For a class of such 1D and 2D algorithms",
        "we provide analytical models of the numerical field error",
        "the optimal choice of spectral modes",
        "and the numerical emittance growth per timestep. We compare these results with the emittance growth models of Struckmeier",
        "Hoffman",
        "Kesting",
        "and others."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/weplg01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/weplg01.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/weplg01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-WEPLG01",
      "page_number": "335",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPLG02",
      "title": "REPTIL - A Relativistic 3D Space Charge Particle Tracking Code Based on the Fast Multipole Method",
      "authors": [
        "S. A. Schmid",
        "H. De Gersem",
        "E. Gjonaj",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "Modern free electron lasers and high current energy recovery linacs accelerate electron beams with particle bunch charges reaching up to several nanocoulombs. Especially in the low energy sections",
        "such as the photoinjector of the accelerator",
        "space charge interaction forces are the dominating effect influencing the dynamics of the electron beam. A direct computation of space charge forces is numerically very expensive. Commonly used simulation codes typically apply mesh based particle-in-cell methods (PIC) to solve this problem. Our simulation tool",
        "REPTIL",
        "is a relativistic",
        "three-dimensional space charge tracking code",
        "which computes the interaction forces based on a meshless fast multipole method (FMM). The FMM based space charge solver is more flexible regarding the choice of the interaction model and yields maximum accuracy for the near field forces between particles. For this reason",
        "the FMM is very suitable for the simulation of the influence of space charge on the particle emission process in high current photoinjectors. In this contribution",
        "we present a numerical study of the efficiency and the accuracy of the method. Therefore",
        "we perform a case study for the PITZ photoinjector used for the European XFEL at DESY. Furthermore",
        "we compare the performance of REPTIL with commonly used PIC codes like e.g. ASTRA. Finally",
        "we investigate a hybrid approach by using the FMM on a mesh. The latter method makes further increases in the particle number possible",
        "which translates to a higher resolution in the phase space of the electron bunch."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/weplg02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/weplg02.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/weplg02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-WEPLG02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPLG03",
      "title": "Theoretical and Computational Modeling of a Plasma Wakefield BBU Instability",
      "authors": [
        "S.D. Webb",
        "D.L. Bruhwiler",
        "N.M. Cook",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "A.V. Burov",
        "V.A. Lebedev",
        "S. Nagaitsev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Plasma wakefield accelerators achieve accelerating gradients on the order of the wave-breaking limit",
        "m c2 kp/e",
        "so that higher accelerating gradients correspond to shorter plasma wavelengths. Small-scale accelerating structures",
        "such as plasma and dielectric wakefields",
        "are susceptible to the beam break-up instability (BBU)",
        "which can be understood from the Panofsky-Wenzel theorem: if the fundamental accelerating mode scales as b-1 for a structure radius b",
        "then the dipole mode must scale as b-3",
        "meaning that high accelerating gradients necessarily come with strong dipole wake fields. Because of this relationship",
        "any plasma-accelerator-based future collider will require detailed study of the trade-offs between extracting the maximum energy from the driver and mitigating the beam break-up instability. Recent theoretical work* predicts the tradeoff between the witness bunch stability and the amount of energy that can be extracted from the drive bunch",
        "a so-called efficiency-instability relation . We will discuss the beam break-up instability and the efficiency-instability relation and the theoretical assumptions made in reaching this conclusion. We will also present preliminary particle-in-cell simulations of a beam-driven plasma wakefield accelerator used to test the domain of validity for the assumptions made in this model.",
        "* V. Lebedev",
        "A. Burov",
        "and S. Nagaitsev",
        "\"Efficiency versus  instability in plasma accelerators\"",
        "Phys. Rev. Acc. Beams 20",
        "121301 (2017)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/weplg03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/weplg03.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/weplg03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-WEPLG03",
      "page_number": "341",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPLG05",
      "title": "Review of Spectral Maxwell Solvers for Electromagnetic Particle-in-Cell: Algorithms and Advantages",
      "authors": [
        "R. Lehé",
        "J.-L. Vay",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Electromagnetic Particle-In-Cell codes have been used to simulate both radio-frequency accelerators and plasma-based accelerators. In this context",
        "the Particle-In-Cell algorithm often uses the finite-difference method in order to solve the Maxwell equations. However",
        "while this method is simple to implement and scales well to multiple processors",
        "it is liable to a number of numerical artifacts that can be particularly serious for simulations of accelerators. An alternative to the finite-difference method is the use of spectral solvers",
        "which are typically less prone to numerical artifacts. In this talk",
        "I will review recent progress in the use of spectral solvers for simulations of plasma-based accelerators. This includes techniques to scale those solvers to large number of processors",
        "extensions to cylindrical geometry",
        "and adaptations to specific problems such as boosted-frame simulations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/weplg05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/weplg05.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/weplg05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-WEPLG05",
      "page_number": "345",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 18:31:38"
}