{
  "session_info": {
    "id": "WEPP",
    "name": "WEPP - Wednesday Poster Presentation B",
    "url": "https://proceedings.jacow.org/ibic2021/html/wepp.htm"
  },
  "papers": [
    {
      "paper_id": "WEPP01",
      "title": "Longitudinal Impedance Measurements With Streak Camera at BEPC II Electron Storage Ring",
      "authors": [
        "D.C. Zhu",
        "J.S. Cao",
        "Y.F. Sui",
        "J.Q. Wang",
        "J.H. Yue",
        "W. Zhang",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "We measure the bunch length at BEPC II electron storage ring using a dual sweep streak camera at visible light diagnostic beamline. The impedances estimated by a series R+L impedance model. Resistive impedance of R=446±21 Ω is obtained by measuring loss factor from measured synchronous phase advancing with streak camera. An inductance impedance of L=23.3±1.8 nH has been estimated by measuring single bunch lengthening with beam current. Both loss factor and inductance are close to the impedance budget. Besides",
        "the streak cam-era is also used to measure synchronous phase at low current as RF voltage changing from 0.85 MV to 1.65 MV."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP01",
      "page_number": "353",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP02",
      "title": "Time Domain Photon Diagnostics for the Advanced Photon Source Upgrade",
      "authors": [
        "K.P. Wootton",
        "W.X. Cheng",
        "G. Decker",
        "S.H. Lee",
        "N. Sereno",
        "B.X. Yang",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "With swap-out injection and a third-harmonic bunch lengthening cavity",
        "time domain diagnostics will be beneficial tools in for optimisation of the Advanced Photon Source Upgrade electron storage ring. In the present work",
        "we present plans for time-domain X-ray and visible photon diagnostics for the Advanced Photon Source Upgrade. Particular emphasis is given to implementation of visible light streak cameras and X-ray bunch purity monitors as time domain photon diagnostics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP02",
      "page_number": "356",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP03",
      "title": "Terahertz Diagnostic for the Advanced Photon Source Particle Accumulator Ring",
      "authors": [
        "K.P. Wootton",
        "W. Berg",
        "S.H. Lee",
        "N. Sereno",
        "J.L. Steinmann",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "KIT",
        "Karlsruhe",
        "Germany",
        "Electron beam microbunching instabilities can present operational limits on the practical operation of storage ring accelerators. In the present work",
        "we outline components of a synchrotron radiation diagnostic beamline for the Advanced Photon Source Particle Accumulator Ring operating at frequencies up to approximately 1 THz."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP03",
      "page_number": "361",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP04",
      "title": "Schottky Signal From Distributed Orbit Pick-Ups",
      "authors": [
        "O. Marqversen",
        "S. Jensen",
        "CERN",
        "Geneva 23",
        "Switzerland",
        "In the CERN Extra Low ENergy Anti-proton (ELENA) ring",
        "intended for the deceleration of antiprotons",
        "the longitudinal Schottky signal is obtained by summing the multiple electrostatic pick-up (PU) signals that are also used to measure the closed orbit. The signals from the individual PUs are phase-compensated to a single",
        "common longitudinal location in the machine and added in the time domain. In this contribution",
        "the related theoretical phase compensation is calculated and compared to measurements. We show how the cross correlation between the Schottky noise from the individual PUs can be used to find the correct phase-compensation for an optimal signal-to-noise ratio (SNR). This improvement in terms of SNR is",
        "as expected",
        "proportional to the square root of the number of PUs. The capability of the system to measure both",
        "the bunched and the un-bunched low intensity (~3·107 H− @ 100keV / 144kHz) beams is confirmed by the experimental results presented. Furthermore",
        "the inter-bunch phase correlation is briefly addressed and",
        "for the case of bunched beams",
        "the Schottky signal levels once down converted to different harmonics of the revolution frequency (frev) are presented. In applications where the coherent beam signal dominates the spectrum and limits the dynamic range of the signal processing system",
        "a down-conversation to a non-integer multiple of the RF harmonic is proposed as a way to reduce the coherent signal level."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP04",
      "page_number": "366",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP05",
      "title": "Two Color Balanced Optical Cross Correlator to Synchronize Distributed Lasers for SHINE Project",
      "authors": [
        "C.L. Li",
        "L. Feng",
        "B. Liu",
        "J.G. Wang",
        "X.T. Wang",
        "W.Y. Zhang",
        "SARI-CAS",
        "Pudong",
        "Shanghai",
        "People’s Republic of China",
        "The planned Shanghai high repetition rate XFEL and extreme light facility (SHINE) generate X-ray light pulses in femtosecond range. For photoinjector drive laser",
        "seed laser",
        "and time resolved pump-probe experiments it is crucial to synchronize various slave laser oscillator to the master reference laser with a long term stability of better than 10 fs. For this purpose two color balanced optical cross correlator for locking slave laser to master laser is under developing. In this paper",
        "we report on the progress of the development of a background free two color balanced cross correlator (TCBOC) to synchronize 800 nm slave laser to 1550 nm master laser. The synchronization system is being tested by linking a commercial Ti:sapphire oscillator to a locally installed timing reference source."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp05.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP05",
      "page_number": "370",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP06",
      "title": "Observation and Analysis of Island Phenomenon in the Storage Ring Light Source",
      "authors": [
        "Y.K. Zhao",
        "S.S. Jin",
        "P. Lu",
        "B.G. Sun",
        "L.L. Tang",
        "J.G. Wang",
        "F.F. Wu",
        "T.Y. Zhou",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "In the previous experimental investigations and measurements using the radio-frequency (RF) phase modulation method to study the longitudinal beam characteristics of the Hefei Light Source-II (HLS-II)",
        "we found that the longitudinal bunch distributions under different modulation frequencies and amplitudes have great difference. In order to further explore island phenomenon and better understand beam motion associated with external RF phase modulation",
        "the streak camera is exploited to effectively observe the longitudinal bunch profile and distribution in single-bunch filling mode. In addition",
        "the dependence between island size",
        "bunch dilution effect and modulation frequency are also discussed in detail. This is meaningful for researching the impact of RF noise on longitudinal beam dynamics",
        "beam manipulation",
        "and machine maintenance and debugging."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp06.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP06",
      "page_number": "373",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP07",
      "title": "Design and Simulation of the Coupling Structure for Single Resonant Cavity Bunch Length Monitor",
      "authors": [
        "H.X. Tuo",
        "P. Lu",
        "Q. Luo",
        "B.G. Sun",
        "F.F. Wu",
        "T.Y. Zhou",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "The measurement of the bunch length can better realize the monitoring of the beam",
        "because the bunch length is one of the important longitudinal parameters of the beam. In this paper",
        "a new single-cavity bunch length monitor is proposed",
        "whose coupling structures consist of two kinds of filters. One is a low pass filter",
        "the other is a band pass filter. The coaxial low-pass filter is used to couple out lowfrequency signals",
        "and the band-pass filter is used to couple higher-frequency signals. According to the beam characteristics of the National Synchrotron Radiation Laboratory (NSRL)based on the tunable infrared laser energy chemistry research large-scale experimental device (FELiChEM)",
        "we perform simulation in CST. The simulation results show that the monitor can measure the bunch length of the FELiChEM device very well",
        "and the simulation measurement error is less than 2%."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp07.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP07",
      "page_number": "377",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP08",
      "title": "Femtosecond Fiber Link Stabilization to Timing Synchronization System for SHINE Project",
      "authors": [
        "L. Feng",
        "C.L. Li",
        "B. Liu",
        "J.G. Wang",
        "X.T. Wang",
        "W.Y. Zhang",
        "SARI-CAS",
        "Pudong",
        "Shanghai",
        "People’s Republic of China",
        "The upcoming Shanghai high repetition rate XFEL and Extreme light facility (SHINE) project has a high precision requirement for the timing synchronization system on femtosecond timescale over more than 3-km long optical fiber links. For this purpose",
        "we setup the fiber link stabilization units to stable a long-distance polarization maintaining (PM) fiber link using balanced optical cross-correlators. In this paper",
        "the current development progress and measurement results of the fiber link stabilization will be reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp08.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP08",
      "page_number": "381",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP09",
      "title": "The Development of Bunch Length Monitor Based on CSR for SXFEL",
      "authors": [
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "The Shanghai soft X-ray Free-Electron Laser facility (SXFEL) will be opened to user at the end of this year. In order to ensure the stable FEL generation",
        "on-line single-shot and nondestructive bunch length monitors utilizing coherent synchrotron radiation (CSR) were installed after each of two bunch compressors (BC1",
        "BC2). We have tested CSR monitor after BC1 when bunch length range from 1ps to 2 ps and calibrated with TDS stalled downstream. The results show that the monitor is capable of measuring picosecond bunch length with a precision of less than 10%.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp09.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP09",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPP10",
      "title": "Development of an On-Line Bunch Length Monitoring System at PLS-II Using an Ultrafast Photodiode",
      "authors": [
        "POSTECH",
        "Pohang",
        "Republic of Korea",
        "T. Ha",
        "G. Hahn",
        "Y.D. Joo",
        "D. Kim",
        "Y.S. Lee",
        "PAL",
        "Pohang",
        "Republic of Korea",
        "HZB",
        "Berlin",
        "Germany",
        "Users of time-resolving experiments at 3rd generation synchrotron light sources deem online bunch length and filling pattern monitoring as an important real-time diagnostic. We developed an on-line monitoring system that can measure bunch lengths and filling pattern using a photodiode",
        "a wideband pre-amplifier",
        "and a sampling digitizer. Two different methods were evaluated to reconstruct the bunch lengths: Gaussian deconvolution method as an approximation scheme and Fourier analysis as a method to restore the original signal by using the power transmission characteristics of the electronic devices in the system",
        "including a bias-tee",
        "a wideband amplifier",
        "cables",
        "and the photodiode. A bunch lengthening experiment has been conducted to compare and verify the results of those two methods of the photodiode and the result of the streak camera images by changing the overall gap voltage of the superconducting RF cavities. In this paper",
        "we elaborate upon the said photodiode-based measurement techniques",
        "and present the experimental results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp10.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP10",
      "page_number": "384",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP11",
      "title": "Broadband Characterization of a Compact Zero-Bias Schottky Diode Detector with a Continuous Wave THz System",
      "authors": [
        "R. Yadav",
        "S. Preu",
        "IMP",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "THM",
        "Friedberg",
        "Germany",
        "Over the last few decades several types of Terahertz (THz) detectors have been developed to maturity",
        "paving the way for various potential applications such as diagnostics of THz generation at particle accelerators. An important class are zero-biased Schottky diode THz detectors that are frequently applied at accelerator facilities [*] for operation at room temperature. Zero-biased Schottky diode THz detectors [**",
        "***] are having lower noise compared to biased ones due to the absence of shot noise. Here we demonstrate the sensitivity of Schottky detectors using a commercial continuous wave photomixing THz system as source. Both",
        "a commercially available as well as a research-grade compact quasi-optical detector with improved video bandwidth are compared from 0.05 to 1.2 THz in terms of sensitivity. At 1 THz",
        "the research grade quasi optical detector shows 7 dB higher dynamic range than the commercial one."
      ],
      "institutions": [],
      "abstract": "[*] Preu, S.,et al.,DOI: 10.1109/TTHZ.2015.2482943  [**] Penirschke, A.,et al.,DOI: 10.1109/IRMMW-THz.2014.6956027  [***] Hoefle, M.,et al.,DOI: 10.1109/IRMMW-THz.2013.6665893",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp11.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP11",
      "page_number": "388",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP12",
      "title": "Modal Analysis of Electromagnetic Coupling Between SMA-Feedthrough Electrode and Beam for Wideband Beam Monitor",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "The direct simultaneous detection of electron (e-) and positron (e+) bunch signals was successfully performed for the first time by a wideband beam monitor at the positron capture section of the SuperKEKB factory. This monitor can measure a time interval between the e- and e+ bunches",
        "their bunch lengths",
        "bunch intensities",
        "and transverse beam positions",
        "depending on the phase of accelerating structures. For this purpose",
        "a new beam monitor with wideband pickups simply using SMA feedthroughs and a wideband detection system based on a fast and real-time oscilloscope was developed to investigate their capture process at the capture section and to maximally optimize the e+ intensity. The required specification for the new monitor is to simultaneously detect the e+ and e- bunches generated in the capture section within the resolution of pico-second level with a sufficient dynamic range in the time-interval and bunch-length measurements. Thus",
        "the wideband detection system is required for this purpose. In this report",
        "the basic design and results based on a modal analysis of electromagnetic couplings between the SMA-feedthrough electrode and a beam are in detail given along with some obtained performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp12.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP12",
      "page_number": "392",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP13",
      "title": "Bunch Arrival Time Measurement System Test for SHINE",
      "authors": [
        "Y.M. Zhou",
        "J. Chen",
        "Y.B. Leng",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "SARI-CAS",
        "Pudong",
        "Shanghai",
        "People’s Republic of China",
        "To achieve high-precision synchronization between electron bunches and seeded lasers",
        "a femto-second resolution bunch arrival time measurement system (BAM) is required at SHINE (Shanghai High repetition rate XFEL aNd Extreme light facility). The bunch signal from a GHz-bandwidth cavity monitor is mixed with a reference signal from the device synchronization clock in the RF front-end. Then",
        "the generated IF signal is collected by the digital acquisition system. In the pre-research stage",
        "four sets of cavity monitors with different frequencies and load quality factors and three sets of analog front-ends with different schemes were performed",
        "but now only one monitor with the attenuation time constant of 200 ns was installed for beam experiment testing. The system can measure the bunch charge",
        "bunch arrival time",
        "and bunch flight time. The first results will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp13.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP13",
      "page_number": "396",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP14",
      "title": "Bunch Compression Monitor Based on Coherent Diffraction Radiation at European XFEL and FLASH",
      "authors": [
        "C. Gerth",
        "N.M. Lockmann",
        "DESY",
        "Hamburg",
        "Germany",
        "Bunch compression monitors (BCMs) based on the detection of coherent diffraction radiation have been installed at the European XFEL for a beam-based stabilisation of the accelerating phases as well as monitoring of bunch lengths. The monitor systems comprise zero-bias Schottky and pyro-electric detectors in combination with low and high pass filters. The detector responses and filters are matched to the spectral ranges of the coherent part of the emitted diffraction radiation which is given by the particular beam energy and bunch lengths after each bunch compression stage. In this paper",
        "we describe in detail the experimental setup of the BCMs. The last BCM has been calibrated with the help of a transverse deflecting structure to establish a (rms) bunch length monitor in the range of a few tens of femtoseconds",
        "and results from compression scans are presented. To enable operation at megahertz repetition rates of the superconducting accelerator",
        "a correction method for the signal pileup of the pyro-electric detectors has been applied. Installation of the same BCMs is foreseen at FLASH within the"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp14.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP14",
      "page_number": "400",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP15",
      "title": "Proposed Longitudinal Profile Diagnostics for Optical Stochastic Cooling of Stored Electrons in the IOTA Ring",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "One of the predicted signatures of successful optical stochastic cooling (OSC) in the Fermilab Integrable Optics Test Accelerator (IOTA) ring is reduction of the bunch length. The IOTA OSC experiment is designed for a low nominal beam current (~0.1 microAmps of 100-MeV electrons) to reduce intrabeam scattering (IBS)",
        "and during cooling",
        "OSC is expected to reduce the bunch length from ~200 ps to ~130 ps*. These equilibrium bunch lengths can be measured using a streak camera and the optical synchrotron radiation (OSR) generated in a ring dipole by the circulating beam. A similar measurement was previously performed at the Advanced Photon Source with a Hamamatsu C5680 synchroscan streak camera operating at 117.3 MHz**. In this case",
        "synchronous summing of OSR resulted in a bunch length measurement of 276 ± 30 ps using only 57 electrons circulating at 425 MeV. At IOTA",
        "an existing streak camera has been modified to operate at the 11th harmonic of the ring’s revolution frequency of 7.50 MHz and has been installed on an OSR port in support of the OSC experiments. The integrated system will have sufficient sensitivity and resolution for measuring the evolution and equilibrium values of the bunch length during OSC experiments.",
        "*V. Lebedev",
        "J. Jarvis",
        "H. Piekarz",
        "A. Romanov",
        "J. Ruan",
        "M. Andorf",
        "https://arxiv.org/abs/2012.09967 ** A.H. Lumpkin and K. P. Wootton"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp15.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP15",
      "page_number": "404",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP16",
      "title": "Comparison of Feschenko BSM and Fast Faraday Cup with Low Energy Ion Beams",
      "authors": [
        "R. Singh",
        "W.A. Barth",
        "P. Forck",
        "S. Lauber",
        "M. Miski-Oglu",
        "T. Reichert",
        "T. Sieber",
        "GSI",
        "Darmstadt",
        "Germany",
        "V.E. Scarpine",
        "D. Sun",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "A comparison between Fast Faraday Cup and Feschenko longitudinal bunch shape detectors was recently performed at HELIAC Advanced Demonstrator beamline at GSI. Feschenko bunch shape monitor (BSM) uses the time to space conversion by means of secondary electrons emitted from a wire correlated to a rf deflector",
        "while the fast Faraday cup (FFC) measures the deposited charge in a cup geometry matched to 50 Ohm. The FFC design aims to minimize the bunch shape dilution due to field polarization and secondary electrons produced on irradiation. An He1+ with 100 µA average current and 1.4 MeV/u kinetic energy is utilized for this comparison. A buncher upstream of the detectors was operated to focus the beam longitudinally. The results are discussed in this contribution."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp16.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP16",
      "page_number": "407",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP17",
      "title": "Uncertainty Quantification and Robustness of Particle Accelerator Machine-Learning Based Models",
      "authors": [
        "O.R. Convery",
        "A. Hanuka",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Y. Gal",
        "L. Smith",
        "Oxford University Press (Oxford Electronic Publishing)",
        "Oxford",
        "United Kingdom",
        "Virtual Diagnostic (VD) is a computational tool built using deep learning that can be used to predict diagnostic outputs*. VDs are especially useful in systems where measuring outputs is invasive",
        "limited",
        "costly or runs the risk of modifying the output. In experiments with large ramifications",
        "it is important to quantify the uncertainty of each prediction. Given out-of-distribution inputs (e.g. using the same machine in a different operation mode)",
        "it is also necessary to understand how robust the VD model is and how well it generalizes on unfamiliar data. In this work**",
        "we use various compositions of neural networks to explore and enhance prediction uncertainty and robustness on data sets gathered from SLAC National Laboratory. We aim to accurately and confidently predict the longitudinal phase space images of electron beams. The ability to make informed decisions under uncertainty and limited computational power is crucial for reliable deployment of scalable deep learning tools on safety-critical systems such as particle accelerators.",
        "* Hanuka",
        "A.",
        "Emma",
        "C.",
        "Maxwell",
        "T. et al. Sci Rep 11",
        "2945 (2021). ** Convery",
        "O.",
        "Smith",
        "L.",
        "Gal",
        "Y.",
        "& Hanuka",
        "A. Arxiv 2105.04654 (2021).",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Funding: This work was supported by the Department of Energy, Laboratory Directed Research and Development program at SLAC National Accelerator Laboratory, under contract DE-AC02-76SF00515."
      ],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp17.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP17",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPP18",
      "title": "New X-Band RF Deflector for Femtosecond Diagnostics of LCLS-II Beams",
      "authors": [
        "V.A. Dolgashev",
        "H. Bassan",
        "S. Condamoor",
        "A.A. Haase",
        "P. Krejcik",
        "T.J. Maxwell",
        "J.W. Wang",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "An X-band transverse deflector has been successfully developed for femtosecond electron and x-ray pulse temporal diagnostic at the LCLS [1]. The working frequency for the deflector is 11.424 GHz. New free electron laser LCLS-II has two undulator beamlines",
        "one Soft-X-Ray and another Hard-X-Ray. The Hard-X-Ray line uses two one-meter long X-band deflectors for beam diagnostics. We have designed",
        "build",
        "installed and commissioned another",
        "1.5 meter long X-band deflector in the Soft-X-Ray beam line. Both Hard-X-Ray and Soft-X-Ray deflectors share one klystron. RF power is transmitted from a 50 MW klystron to a tunnel in an overmoded circular waveguide and then directed to either of the deflectors using a remotely controlled RF switch. The power split ratio could be changed arbitrarily",
        "and both deflectors could work simultaneously. In this article",
        "we provide details on the development and commissioning of the new deflector."
      ],
      "institutions": [],
      "abstract": "[1] C. Behrens et al., ’Few-femtosecond time-resolved measurements of X-ray free-electron lasers’ Nat. Commun., vol. 5, no. 1, pp. 17, Apr. 2014, doi: 10.1038/ncomms4762.",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp18.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP18",
      "page_number": "412",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP19",
      "title": "Bunch Arrival-Time Measurement with Rod-Shaped Pickups on a Printed Circuit Board for X-Ray Free-Electron Lasers",
      "authors": [
        "B.E.J. Scheible",
        "S. Mattiello",
        "A. Penirschke",
        "THM",
        "Friedberg",
        "Germany",
        "W. Ackermann",
        "H. De Gersem",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "M.K. Czwalinna",
        "H. Schlarb",
        "DESY",
        "Hamburg",
        "Germany",
        "The all-optical synchronization system implemented in the European X-ray free-electron laser (EuXFEL) is to receive an upgrade. The modifications are intended to allow operation with consistently high accuracy in a 1 pC mode",
        "which is required for various user experiments. The lower charges",
        "e.g. a factor of 20",
        "lead to a reduced signal strength at the pickups and thus to a decreased resolution. A significant potential for improvement has been identified in a modified pickup structure and transmission network",
        "which provide the transient voltage signal to subsequent parts of the synchronization system. One solution for a broadband pickup structure with short signal paths",
        "large active surfaces and minimum aperture diameter could be achieved by connecting rod-shaped pickups to a combination network on a printed circuit board",
        "which will be mounted in the beamline. In this contribution the proposed design is introduced and analyzed by electromagnetic field simulations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp19.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP19",
      "page_number": "417",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP20",
      "title": "Design of the Bunch-Length Monitors for the New Superconducting LCLS Linac",
      "authors": [
        "E.C. Aneke",
        "A.S. Fisher",
        "B.T. Jacobson",
        "T.J. Maxwell",
        "L. Sapozhnikov",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The LCLS x-ray free-electron laser at SLAC uses the third km of the original 3-km copper linac. We are now installing LCLS-II",
        "a superconducting linac that replaces the first km. Two undulators",
        "for hard and soft x rays",
        "will be driven by bunches from either linac. One of the solutions developed at SLAC involves a pyroelectric detector",
        "which converts the infrared emitted by the electron bunch into voltage by measuring fast changes in the temperature of the detecting crystal. Not only are the pyrodetectors used at SLAC but also a method with gap diodes. The radial electric field produced by the bunches leaks through a ceramic gap in the beampipe and is collected by a horn antenna and conveyed through a one millimeter waveguide. The waveguides act as a filter",
        "only passing shorter wavelengths and a zero-bias Schottky diode measures the power. In both methods",
        "a portion of the spectral energy emitted by the bunch is intercepted. After normalizing to differentiate between bunches of the same length with different charge",
        "the detected signal is sensitive to only changes in bunch length. This poster discusses the mechanics and optics behind the LCLS-II bunch length monitors operations and plans for collaboration."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp20.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP20",
      "page_number": "422",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP21",
      "title": "High Resolution Bunch Arrival Time Monitor Based on Sagnac Interferometer",
      "authors": [
        "SARI-CAS",
        "Pudong",
        "Shanghai",
        "People’s Republic of China",
        "Based on an sagnac interferometer detection scheme",
        "a Bunch Arrival-time Monitor (BAM) is under study at Shanghai soft X-ray Free Electron Laser (SXFEL) to meet the high-resolution requirements of the measurement of bunch arrival time. In this paper",
        "we present the basic working principle and the design of the BAM system.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp21.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP21",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPP23",
      "title": "Design of Wall Current Monitor in BRing at HIAF*",
      "authors": [
        "P.L. He",
        "X.C. Kang",
        "X.T. Liu",
        "R.S. Mao",
        "Z.G. Xu",
        "Y.L. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "The Wall Current Monitor (WCM) can monitor the lon-gitudinal beam shape",
        "beam stability",
        "beam longi-tudinal emittance and intensity",
        "which has been ap-plied widely in the laboratories of high-current proton accelerators. Many accelerators such as CERN-PS",
        "CERN-CLIC",
        "J-PARC and CSNS-RCS have designed different WCMs according to their respective accelera-tor beam parameters. In order to provide the high-intensity heavy-ion accelerator facility (HIAF)-BRing high-frequency system of with the intensity of each harmonic beam to compensate for wake field; and to observe the changes of the bundle length during the injection",
        "acceleration",
        "and extraction of the bundle",
        "it is planned to place a WCM in HIAF-BRing. According to physical requirements",
        "the lower limit of the WCM work-ing bandwidth is expected to reach 10kHz",
        "and the upper limit can reach 100MHz. According to this bandwidth re-quirement",
        "a WCM structure is designed",
        "and its theoretical bandwidth is 2kHz~400MHz",
        "which fully meets the de-mand. This article gives a detailed and comprehensive in-troduction to the overall design of this WCM",
        "the selection of various components",
        "design calculations and related simulation calcula-tions. At present",
        "the WCM has com-pleted the pro-curement and processing of various compo-nents",
        "while offline and online testing has not been carried out owing to time constraints. It is expected to be in-stalled on the Heavy Ion Research Facility in Lanzhou-Cooling Storage Ring (HIRFL-CSR) for online testing in August."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp23.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP23",
      "page_number": "425",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP24",
      "title": "PSB H0-H⁻ Monitor Calibration and Commissioning",
      "authors": [
        "A. Navarro Fernandez",
        "D. Belohrad",
        "C. Bracco",
        "E. Renner",
        "F. Roncarolo",
        "J. Tassan-Viol",
        "CERN",
        "Geneva",
        "Switzerland",
        "During the LHC Long Shutdown 2 (LS2)",
        "the H−"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp24.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP24",
      "page_number": "429",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP25",
      "title": "Design of a Dielectric-Filled Cavity Beam Current Monitor for HUST-PTF",
      "authors": [
        "J.Q. Li",
        "Q.S. Chen",
        "HUST",
        "Wuhan",
        "People’s Republic of China",
        "Huazhong University of Science and Technology",
        "State Key Laboratory of Advanced Electromagnetic Engineering and Technology",
        "Hubei",
        "People’s Republic of China",
        "A dedicated proton therapy facility",
        "HUST-PTF (Huazhong University of Science and Technology Proton Therapy Facility) is being developed in Wuhan. With respect to the proton therapy facility",
        "non-destructive beam diagnostic devices are essential to guarantee the online measurement during the patient treatment. In order to meet the clinical requirement",
        "the proton beam current varies from the 0.35-5 nA. Extremely low beam intensity is a great challenge to non-destructive beam current detection. Conventional beam current monitors used in proton therapy facility",
        "ionization champers",
        "will cause beam scattering and the monitor activation",
        "etc. To mitigate this issue",
        "we design a non-invasive beam current monitor based the principle of dielectric-filled reentrant cavity. The fundamental mode of the cavity was employed as the working mode and its working frequency of 146 MHz was matched to the second harmonic of the pulse rate. The CST Microwave Studio was used for electromagnetic modeling and design parameters optimization. We evaluated the effect of the different proton energy due to the degrader on the output signal. The electronics based on a commercial lock-in amplifier is proposed to perform the demodulation of induced signal and we evaluated the signal-to-noise ratio and the beam current resolution. The results of the design studies show that the dielectric-filled cavity resonator is a potential candidate for non-destructive beam current detection in HUST-PTF.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp25.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP25",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPP26",
      "title": "Development of the Ion Beam Diagnostic System for BIBA using 28 GHz ECRIS at KBSI",
      "authors": [
        "KBSI",
        "Gangseo-gu",
        "Busan",
        "Republic of Korea",
        "S.J. Kim",
        "J.W. Ok",
        "J.Y. Park",
        "Korea Basic Science Institute",
        "Busan",
        "Republic of Korea",
        "Busan Ion Beam Accelerator (BIBA) is a compact linear accelerator facility using the 28 GHz Electron Cyclotron Resonance Ion Source (ECRIS) at Korea Basic Science Institute (KBSI). For utilization of ion beam",
        "an ion implantation system has been developed to use a multi-charged state ion beams produced by 28 GHz ECRIS. Recently",
        "the low energy beam transport (LEBT) system for BIBA has been re-designed taking into account the fringe effect of magnet to match the ion beam for ion implantation as well as for input beam for the accelerator such as Radio-Frequency Quadrupole (RFQ). The beam diagnostic system for monitoring such as current",
        "position",
        "profile",
        "emittance and beam loss are also required for operating and improving accelerator system. In this paper",
        "we report the result and design of ion beam diagnostics system to measure various beam parameters of the beam current",
        "profile",
        "and emittance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp26.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP26",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "WEPP27",
      "title": "High Speed Parallel Digital Signal Processing Structure in Bunch-By-Bunch Position Measurement Based on FPGA",
      "authors": [
        "R.Z. Wu",
        "P. Lu",
        "B.G. Sun",
        "L.L. Tang",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "In storage ring",
        "the measurement of bunch-by-bunch positions can help to obtain abundant beam dynamics characteristic information",
        "diagnose the instability of beam motion and provide a basis for the suppression of instability. However",
        "the measurement of bunch-by-bunch requires one analog-to-digital converter (ADC) with high sampling rate and one processor with fast digital signal processing (DSP)ability. With the development of electronics",
        "high sampling rate ADCs are no longer a problem. Therefore",
        "high-speed DSP has become the key. In this paper",
        "a parallel digital signal processing architecture based on polyphase decomposition is proposed. This architecture realizes the GHz DSP speed on the programmable gate array (FPGA)",
        "which can be used as the infrastructure of high-speed DSP in the bunch-by-bunch position measurement system."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp27.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP27",
      "page_number": "434",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP28",
      "title": "Sub-ns Single-Particle Spill Characterization for Slow Extraction",
      "authors": [
        "T. Milosic",
        "P. Forck",
        "R. Singh",
        "GSI",
        "Darmstadt",
        "Germany",
        "With the recent developments on improving spill quality at GSI/FAIR",
        "appropriate measurement devices have come into focus again. In contrast to commonly used scaler-based approaches where events at a certain sample frequency are counted",
        "we present a measurement concept resolving single event detector timestamps in the sub-ns regime leveraging a well established off-the-shelf TDC VMEbus module. This allows for high resolution time structure information with respect to the ring RF as well as valuation of inter-particle separation distributions. This yields insightful information for specific experiments at GSI whose efficiencies are heavily limited by pile-ups and detector dead times. We will present the concept of the measurement setup and exemplary data taken in recent campaigns in context of spill microstructure improvements for slow extraction."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp28.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP28",
      "page_number": "438",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP31",
      "title": "Web-Based Software Development for Failure Prediction in Commercial Cyclotrons Used in Medical Applications",
      "authors": [
        "A. García-Tabarés Valdivieso",
        "F. Berdascas Julián",
        "BPT",
        "Madrid",
        "Spain",
        "Radioisotopes used for PET and SPECT diagnostics are commonly produced using commercial cyclotrons. These accelerators are equipped with online monitoring instrumentation that allows the machine to be operated within the safety margins defined by the manufacturer. However",
        "the probabilities of cyclotron failure cannot be estimated simply by online data logging but must be supplemented by a long-term data-driven analysis and storage system. The low level of development of the analysis and storage systems makes it difficult to optimize the preventive maintenance schedule and makes it almost impossible to prevent failures. Beta Pharma Technologies (BPT) has developed a web-based big data software",
        "which in combination with a database",
        "bridges the gap in storage and analytics capabilities of the current cyclotron software. This software analyzes the evolution of the cyclotron in the medium-long term",
        "extracting statistical information and correlation between the different parameters of the cyclotron. To validate the method",
        "BPT has used the software intensively to analyze the big data generated by various commercial cyclotrons. This article shows that by analyzing logged data using analysis tools the cyclotron failure can be identified before the actual machine failure. Additionally",
        "the data analysis carried out using this methodology allows optimizing the material resources and the workers’ exposure time.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp31.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP31",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPP32",
      "title": "Tests of Digital BPM Signal Processors for SHINE",
      "authors": [
        "X. Yang",
        "J. Wan",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "L.W. Lai",
        "Y.M. Zhou",
        "SARI-CAS",
        "Pudong",
        "Shanghai",
        "People’s Republic of China",
        "Y.B. Leng",
        "W.M. Zhou",
        "Y.M. Zhou",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "Digital signal processors that can handle 1 MHz bunch rate BPM signal processing is under development for SHINE. At the same time",
        "two general purpose processor prototypes for all BPM signal sampling and processing have been developed. One uses 14bits ADC",
        "the other uses 16bits ADC. Both processors have been completed. This paper will introduce the tests of the processors and the related performance evaluations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp32.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP32",
      "page_number": "443",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP33",
      "title": "The FACET-II Data Acquisition System",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The Facility for Advanced Accelerator Experimental Tests (FACET) at SLAC utilizes over 80 digital cameras to monitor and diagnose particle beams and laser systems. The cameras are part of the EPICS control system and run on areaDetector IOCs. Experiments at FACET acquire data from multiple cameras simultaneously. This presents a challenge because the data rate easily exceeds 10 Gbps for multiple cameras operating at 10-30 Hz",
        "thus preventing data acquisition via Channel Access. Our system avoids this problem by writing the images to a local shared hard drive. Critically",
        "we make use of the SLAC EVG-EVR timing system to coordinate image acquisition and ensure synchronicity across multiple cameras. The image acquisition features are combined with SLAC’s Beam Synchronous Acquisition (BSA) features for a unified data acquisition framework."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp33.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP33",
      "page_number": "446",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP34",
      "title": "Towards Single Shot X-ray Absorption Spectroscopy Using the Broadband Emission at the SwissFEL Aramis Undulator",
      "authors": [
        "P. Bougiatioti",
        "Y.P. Arbelo",
        "C. Bacellar Cases da Silveira",
        "C. Cirelli",
        "Ch. David",
        "P.N. Juranič",
        "G. Knopp",
        "K.J. Nass",
        "S. Reiche",
        "Y. Uemura",
        "J. Vila Comamala",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "EuXFEL",
        "Schenefeld",
        "Germany",
        "X-ray absorption spectroscopy (XAS) is a powerful tool for the investigation of the electronic and structural environment of the absorbing atom. The high element specificity of XAS is gained by photon energies around resonant absorption edges of the probed material. Dynamics on a femtosecond timescale can be accessed with time resolved XAS (TR-XAS) using a laser to photo-excite the sample and intense femtosecond X-ray pulses from a free-electron laser to probe with XAS. A primary drawback to the implementation of TR-XAS at X-ray free-electron lasers is the general requirement to scan the photon energy for obtaining the spectrum. Moreover",
        "fluctuations of the X-ray spectrum and intensity due to the self-amplified stimulated emission lead to normalization problems. To tackle these issues we propose a novel scheme for TR-XAS using a broadband emission mode of the Aramis undulator at SwissFEL providing dE/E = 2% bandwidth",
        "which is sufficient to cover a XAS spectrum. By utilizing a transmission grating",
        "the chirped beam is split into 1st",
        "0th and -1st orders having similar intensity. By placing a sample in the 1st or -1st diffraction order we can record sample and reference signal in order to normalize intrinsic spectral and intensity fluctuations on a shot-to-shot basis. The beams are sent onto a single shot spectrometer that uses the <111> reflection from a strongly bent thin Si crystal",
        "in order to characterize the broadband",
        "chirped emission of every free-electron laser shot. In this contribution",
        "we present a quantitative data analysis and compare the shot-to-shot normalization method with the conventional data analysis without beam splitting",
        "showing a significant improvement of the data quality in the first case. We show XAS measurements at the Nickel K-edge on thin foils and Nickelsulfamate solutions. The presented experiments form the basis for future time-resolved research comprising more advanced diffractive x-ray optics",
        "as well as pump-probe schemes.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp34.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP34",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPP35",
      "title": "EPICS Control System for RAON Diagnostics",
      "authors": [
        "Korea University Sejong Campus",
        "Sejong",
        "Republic of Korea",
        "Y.S. Chung",
        "G.D. Kim",
        "J.W. Kwon",
        "H.J. Woo",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "KUS",
        "Sejong",
        "Republic of Korea",
        "RAON has various diagnostic devices for measuring beam characteristics",
        "such as Faraday Cup",
        "Wire Scanner",
        "and Beam Loss Monitor",
        "etc. Each device is driven by PLC system and acquires current data with a DAQ based uTCA system. All the parameters are controlled by EPICS as process variables (PV) and monitored on GUI of CS-Studio. PVs of PLC and DAQ were named according to the RAON naming convention. Epics sequences are written in finite state machine code to work diagnostic device sequentially. Below we show the working principle of the epics based diagnostics devices control system and measurement results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp35.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP35",
      "page_number": "449",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP36",
      "title": "Study of Solutions for Interfacing ILSF Beam Diagnostics Tools to Control System",
      "authors": [
        "P. Navidpour",
        "F. Ahmad Mehrabi",
        "S. Mohammadi Alamouti",
        "ILSF",
        "Tehran",
        "Iran",
        "There is an ongoing study at Iranian Light Source Facility (ILSF) aims to determine control solutions for a variety of diagnostics tools that will be placed at various locations around the facility. In this paper",
        "an overview of the possible solutions with a focus mostly on the low-level part of the control system is reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp36.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP36",
      "page_number": "452",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP37",
      "title": "Bunch-by-Bunch 3D Measurement System in HLS-II",
      "authors": [
        "R.Z. Wu",
        "P. Lu",
        "B.G. Sun",
        "L.L. Tang",
        "Y.G. Wang",
        "F.F. Wu",
        "Z.R. Zhou",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "In order to improve the performance of Hefei Light Source (HLS-II)",
        "it is necessary to study various problems of nonlinear beam dynamics in the storage ring",
        "so as to optimize the beam filling mode and injection mode",
        "and then improve the intensity and brightness of HLS-II. In beam dynamics",
        "bunch-by-bunch can provide detailed information of beam bunches and help beam researchers to study the problems of beam bunches deeper. Therefore",
        "HLS-II diagnostics group has developed an on-line bunch-by-bunch three-dimensional measurement system based on high bandwidth and high speed oscilloscope."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp37_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp37.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp37_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP37",
      "page_number": "455",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP38",
      "title": "Development of a Data Acquisition System for Real-Time Beam Monitoring of Flash Ion Beam",
      "authors": [
        "S.H. Choi",
        "D.H. An",
        "K.U. Kang",
        "G.B. Kim",
        "J.H. Kim",
        "T.K. Yang",
        "KIRAMS",
        "Seoul",
        "Republic of Korea",
        "KIRAMS/KHIMA",
        "Seoul",
        "Republic of Korea",
        "Our research team is developing and constructing a high-energy ion beam irradiation device capable of ultra-high dose rates for biomedical research in connection with the main accelerator of RAON (Rare isotope accelerator complex for ON-line experiments). In this ion beam irradiation line",
        "an x",
        "y scanner will be installed in the active scanning type research beam delivery line. In order to measure the beam current",
        "profile",
        "and position before and after scanning",
        "it is necessary to develop a system that can monitor the ultra-high dose rate ion beam in real time. The objective of this study is to develop and verify a data acquisition system that can measure the position and intensity of a flash ion beam in real time. To measure the accumulated detector current and beam profile using a charge integrator",
        "output terminals of 128 channels for X and Y were fabricated. The detector current amount of each 128 channels was measured in units of 100 us for a pre-programmed time",
        "and the beam intensity was set to store negative charge in the data memory inside the FPGA every 30 us. Also",
        "center",
        "σ",
        "and sum values can be calculated based on the output of 128 channels for each x and y axis. In order to evaluate the usefulness of the manufactured DAQ",
        "the measurement response of the intensity charge integrator",
        "noise according to the gain setting",
        "response",
        "and the measured value of the strip charge integrator according to the gain setting were tested",
        "and it was confirmed that it is suitable for monitoring the ultra-high dose rate ion beam. It is expected that the DAQ system manufactured in this study can be used not only for the RAON ion beam currently under construction",
        "but also for the flash electron beam accelerator. In the future",
        "it will be conduct the test verification with a two-dimensional array type ion chamber in flash radiation."
      ],
      "institutions": [
        "Funding: This work was supported by the Rare Isotope Science Project of Institute for Basic Science funded by Ministry of Science and ICT and National Research Foundation of Korea (IBS-I001-D1-2021-b00)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2021/talks/wepp38_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2021/papers/wepp38.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2021/posters/wepp38_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2021-WEPP38",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    }
  ],
  "paper_count": 35,
  "scrape_time": "2025-10-10 17:41:35"
}