{
  "session_info": {
    "id": "THAA",
    "name": "THAA - End Stations and Sample Environments",
    "url": "https://proceedings.jacow.org/medsi2016/html/thaa.htm"
  },
  "papers": [
    {
      "paper_id": "THAA01",
      "title": "Large (Metre) Scale Positioning Systems for Imaging Program at BMIT",
      "authors": [
        "T.W. Wysokinski",
        "G. Belev",
        "L.D. Chapman",
        "C.D. Miller",
        "CLS",
        "Saskatoon",
        "Saskatchewan",
        "Canada",
        "RMD Engineering Inc.",
        "Saskatoon",
        "Canada",
        "ESRF",
        "Grenoble",
        "France",
        "The BioMedical Imaging and Therapy (BMIT) facility provides synchrotron-specific imaging and radiation therapy capabilities. We describe here the main mechanical stages on the insertion device (ID) beam-line 05ID-2",
        "with the beam terminated in SOE-1 experimental hutch. The main mechanical components within the second optics hutch (POE-3) are: tiltable optics table that provides support for a set of filters",
        "shutters and ion chambers and a moveable shielding assembly. The table provides 0.24 m vertical travel range and tilt capability of -8° to +13° (with respect to the horizontal) and 200 kg load capacity. Moveable shielding provides 2030 kg load capacity",
        "with vertical travel range of 0.7 m and has two sets of photon/safety shutters",
        "which are required for the KES imaging angle range of +12.3° to -7.3°. SOE-1 hutch is 6 m wide",
        "5 m tall and 10 m long and accommodates the large animal positioning system (LAPS) capable of positioning and manipulating samples up to 907 kg",
        "over 2.7 m vertical travel range. This end-station also includes a unique camera positioner with a 320 kg load capacity",
        "vertical travel range of 4.9 meters and ability to tilt the stage for KES and DEI modes."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/thaa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/thaa01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/thaa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-THAA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THAA02",
      "title": "Mechanical Engineering of a Cryo STXM at CLS",
      "authors": [
        "C.N. Regier",
        "A.F.G. Leontowich",
        "D.M. Taylor",
        "CLS",
        "Saskatoon",
        "Saskatchewan",
        "Canada",
        "A Scanning Transmission X-ray Microscope (STXM) is a useful imaging tool",
        "but its application to certain types of samples is limited by significant rates of x-ray damage to the sample. Cooling samples to liquid nitrogen temperatures can delay radiation damage",
        "but must be done in a vacuum environment to prevent rapid formation of ice on the sample. The Canadian Light Source (CLS) has constructed a Cryo-STXM",
        "which can maintain sample temperatures at 100 K in an ultra-high vacuum environment and rotate the samples in the beam to collect tomographic data sets. This presentation will discuss the mechanical engineering aspects of the development of this Cryo-STXM including the finite element analysis (FEA) for stresses and vibrations",
        "and present the performance parameters being achieved by the instrument."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/thaa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/thaa02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/thaa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-THAA02",
      "page_number": "381",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAA03",
      "title": "Mechanical Design of New Dual Pinhole Mini-Beam Collimator With Motorized Pitch and Yaw Adjuster Provides Lower Background for X-Ray Crystallography at GMCA@APS",
      "authors": [
        "S. Xu",
        "R. Fischetti",
        "O. Makarov",
        "S.A. Stepanov",
        "N. Venugopalan",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The GM/CA developed",
        "quad-mini-beam collimator[*",
        "**]",
        "advanced rastering and vector data-collection software tools[***]",
        "have enabled successful data collection on some of the most challenging problems in structural biology. There are two main sources of X-ray scattering (besides the sample) that reach the detector",
        "contribute to back-ground and limit data resolution. These are scattering within the collimator that escapes the exit aperture and air-scattering of the direct beam before it terminates in the beamstop. Scattering from the collimator can be reduced by decreasing the exit aperture size. A quad mini-beam collimator was built consisting of 5/50",
        "10/70",
        "20/100 and 150/300 µm beam defining/exit aperture combination",
        "respectively. Previous collimators were positioned in the X-ray beam by two motorized translational motions and two manual angular adjustments via a kinematic mount. Due to reduced tolerance in the new design",
        "aligning each of the pin-hole combinations to high-precision required motorizing both translational and angular motions. Design and con-struction of the improved mini-beam collimator and the extent of background reduction will be discussed."
      ],
      "institutions": [
        "Funding: GM/CA@APS has been funded in whole or in part with Federal funds from the National Cancer Institute (ACB-12002) and the National Institute of General Medical Sciences (AGM-12006)."
      ],
      "abstract": "* Fischetti, et al.,JSR 16, 217-225 PMCID 2725011  ** S. Xu, et al, AIP 1234, 897 - 900 (2010)  *** Hilgart, et al, J Synchr. Radiat. 2011:717-22. doi: 10.1107/S0909049511029918. Epub 2011 Jul 29",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/thaa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/thaa03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/thaa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-THAA03",
      "page_number": "387",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAA04",
      "title": "Upgrading a Transmission SAX/WAX Beamline to Allow High Quality GISAX/GIWAX Experiments for Soft Matter Thin Films",
      "authors": [
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "The project required a sample environment to deliver experiments in vacuum or helium",
        "with high humidity",
        "including capacity to use aggressive solvents. The compact",
        "transportable system incorporates a high precision in-vacuum manipulator/ positioning stage (with repeatability better than1 µm/ 1 mdeg) allowing for multiple sample configurations. Current sample mounts include in-situ film formation (Doctor Blade)",
        "thermal annealing/drying heater stage",
        "sample cooling and multiple sample stages; the system has been designed to accommodate many sample substrate formats. The existing end station camera system has been upgraded to include two",
        "in-vacuum",
        "WAXS and SAXS area detectors",
        "which are custom builds based on the Pilatus 6M. The SAX detector module includes three in vacuum",
        "independent",
        "configurable SAXS beam stop manipulators to block GISAXS transmitted",
        "reflected and specular flare as well as isotropic and anisotropic SAX",
        "a photon sensitive detector shutter plate is included. The 4 mm diameter tungsten beamstops each include a miniature photodiode to measure beam intensity and can be positioned to within 10 µm precision in X and Y over 300 mm x 250 mm motion range."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/thaa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/thaa04.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/thaa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-THAA04",
      "page_number": "390",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-11 00:04:58"
}