{
  "conference_info": {
    "name": "2016",
    "code": "ecris2016",
    "url": "https://proceedings.jacow.org/ecris2016/",
    "status": "pending"
  },
  "sessions": [
    {
      "session_info": {
        "id": "MOAO",
        "name": "MOAO - Special Session",
        "url": "https://proceedings.jacow.org/ecris2016/html/moao.htm"
      },
      "papers": [
        {
          "paper_id": "MOAO01",
          "title": "Scaling Laws in Electron Cyclotron Resonance Ion Sources",
          "authors": [
            "LBNL",
            "Berkeley",
            "California",
            "USA",
            "In the last 43 years",
            "the performance of high charge state ECRIS has improved dramatically as a result of improvements to the magnetic field confinement",
            "increases in the microwave heating frequency and techniques to stabilize the plasma at high densities. For example",
            "in 1973 15 eμA of O6+ was produced in an ECRIS and now it is possible to produce as much as 4500 eμA. In this paper the parameters and performance of ECRIS are reviewed and compared to empirical scaling laws* to see what can be expected when fourth generation ECRIS begin to operate.",
            "* Geller",
            "Richard. Electron cyclotron resonance ion sources and ECR plasmas. CRC Press",
            "1996",
            "p 395"
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moao01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moao01.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moao01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOAO01",
          "page_number": "1",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 1,
      "scrape_time": "2025-10-10 17:27:10"
    },
    {
      "session_info": {
        "id": "MOBO",
        "name": "MOBO - Status reports and new development I",
        "url": "https://proceedings.jacow.org/ecris2016/html/mobo.htm"
      },
      "papers": [
        {
          "paper_id": "MOBO01",
          "title": "FECRAL - a 45 GHz Fourth Generation ECR Ion Source and Its Technical Challenge",
          "authors": [
            "H.W. Zhao",
            "L.T. Sun",
            "IMP/CAS",
            "Lanzhou",
            "People's Republic of China",
            "A 45 GHz superconducting ECR ion source FECRAL (a Fourth generation ECR ion source with Advanced design in Lanzhou) is going to be built in the next few years as a key technology R&D of HIAF facility. HIAF injector of a superconducting heavy ion linac requests the ion source of delivering 50 pμA of 238U35+ pulsed beam and 25 pμA of 238U35+ CW beam. This presentation will present preliminary technical-design of FECRAL ECR ion source including magnetic field configuration produced by a Nb3Sn superconducting magnet with 6.5 Tesla axial mirror field and 3.5 Tesla sextupole field on the plasma chamber inner wall",
            "20 kW@45 GHz microwave coupling system and beam transport line. Obviously",
            "to build a 45 GHz FECRAL ECR ion source",
            "there will be many technical challenges",
            "such as engineering and fabrication of the Nb3Sn superconducting magnet with 12 Tesla maximum magnetic field on the conductor",
            "cryogenic system of the magnet",
            "efficient coupling of 45 GHz microwave power",
            "intense beam extraction and transmission to achieve good beam quality",
            "integration of the FECRAL ion source system and analyzing beam line at a high voltage platform."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mobo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mobo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mobo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOBO01",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "MOBO02",
          "title": "Possible Optimizations of Existing Magnet Structures for the Next Generation of ECRIS",
          "authors": [
            "D. Xie",
            "G.L. Sabbi",
            "D.S. Todd",
            "LBNL",
            "Berkeley",
            "California",
            "USA",
            "IMP/CAS",
            "Lanzhou",
            "People's Republic of China",
            "Constructing a minimum-B structure with higher magnetic fields is the prerequisite for the next generation of Electron Cyclotron Resonance Ion Sources (ECRIS): ion sources that will operate at substantially higher heating frequencies than those currently in use. There are three leading candidates of Nb3Sn coil structures for use in future ECRISs: a Mixed Axial and Radial field System (MARS) that merges the sextupole racetrack coils and partial end-solenoids into an exotic closed-loop-coil; a classical Sextupole-In-Solenoids design; and a Solenoids-In-Sextupole configuration. Focusing on efficient magnetic field generation",
            "this article briefly reviews the advantages and disadvantages of each of these magnet structures. Though Sextupole-In-Solenoids and Solenoids-In-Sextupole magnetic structures using NbTi conductor have been validated by current ECRISs",
            "improvements of these magnet structures remain possible. Possible optimizations to the two existing magnet structures",
            "such as using a non-conventional sextupole magnet consisting of either V-bend or skew racetrack coils",
            "are discussed. The development status of a MARS NbTi magnet at LBNL for a new ECRIS will be also presented."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mobo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mobo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mobo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOBO02",
          "page_number": "5",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "MOBO03",
          "title": "Current Status of a SC-ECRIS of the RAON Accelerator.",
          "authors": [
            "Y.H. Kim",
            "T. Hashimoto",
            "J. Heo",
            "H. Ishiyama",
            "IBS",
            "Daejeon",
            "Republic of Korea",
            "Raon is the heavy ion accelerator being built in Korea. It contains 3rd generation SC-ECRIS which uses 28GHz/18GHz microwave power to extract a heavy ion beam. We prepared and installed beam focusing devices and beam diagnostic devices to characterize the ion source. Now the ion source is in beam commissioning status after maintenance activities. After beam commissioning with oxygen beam",
            "a metal ion beam will be extracted at the end of this year using sputtering method."
          ],
          "institutions": [
            "Funding: This work was supported by the Rare Isotope Science Project funded by Ministry of Science, ICT and Future Planning (MSIP) and the National Research Foundation (NRF) of the Republic of Korea"
          ],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mobo03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mobo03.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mobo03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOBO03",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "MOBO04",
          "title": "Recent Developments of RIKEN 28 GHz SC-ECRIS",
          "authors": [
            "Y. Higurashi",
            "H. Haba",
            "M. Kidera",
            "T. Nakagawa",
            "J. Ohnishi",
            "K. Ozeki",
            "RIKEN Nishina Center",
            "Wako",
            "Japan",
            "In the past two years",
            "we tried to improve the performance of the RIKEN 28GHz SC-ECRIS for production of intense U ion beam. Usually",
            "we used the sputtering method to produce U ion beam. Last year",
            "we produced ~200e μA of U35+ at the injected RF power of ~2.6kW",
            "when slightly adding the U vapor with high temperature oven. For RIKEN RIBF experiment",
            "we produced ~110 e μA of U35+ beam with sputtering method longer than one month without break. In this case",
            "we surly need very stable beam to increase the transmission efficiency in the accelerators and avoid the any damage of the components of the accelerator due to the high power beam. In this contribution",
            "we will report the beam intensity of highly charged U ions as a function of various parameters (magnetic field strength",
            "RF power",
            "sputtering voltage etc.) and the effect of these parameters on the beam stability in detail. We also present the experience of the long term operation of the ion source for the RIKEN RIBF experiments."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mobo04_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mobo04.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mobo04_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOBO04",
          "page_number": "10",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 4,
      "scrape_time": "2025-10-10 17:27:14"
    },
    {
      "session_info": {
        "id": "MOCO",
        "name": "MOCO - Plasma investigations I",
        "url": "https://proceedings.jacow.org/ecris2016/html/moco.htm"
      },
      "papers": [
        {
          "paper_id": "MOCO01",
          "title": "Innovative Schemes of Plasma Heating for Future Multiply-Charged Ions Sources: Modeling and Experimental Investigation",
          "authors": [
            "D. Mascali",
            "C. Altana",
            "G. Castropresenter",
            "L. Celona",
            "S. Gammino",
            "O. Leonardi",
            "M. Mazzaglia",
            "D. Nicolosi",
            "R. Reitano",
            "F.P. Romano",
            "G. Sorbello",
            "G. Torrisi",
            "INFN/LNS",
            "Catania",
            "Italy",
            "M. Mazzaglia",
            "R. Reitano",
            "Universita Degli Studi Di Catania",
            "Catania",
            "Italy",
            "IBAM-CNR",
            "Catania",
            "Italy",
            "University of Catania",
            "Catania",
            "Italy",
            "The application of plasma heating methods alternative to the direct Electron Cyclotron Resonance coupling",
            "such as the Electron Bernstein Waves (EBW) heating",
            "is already a reality in large-size thermonuclear reactors. These plasma waves give the unique opportunity to largely overcome the cutoff density. EBW heating in compact traps such as ECRIS devices is still a challenge",
            "requiring advanced modelling and innovative diagnostics. At Istituto Nazionale di Fisica Nucleare-Laboratori Nazionali del Sud (INFN-LNS)",
            "the off-ECR heating (driven by Bernstein waves) has produced a highly overdense plasma. Interferometric measurements say the electron density has overcome by a factor ten the cutoff density at 3.76 GHz. More advanced schemes of wave launching have been designed and implemented on the new test-bench called Flexible Plasma Trap",
            "operating up to 7 GHz-0.5 T",
            "in ﬂat/simple mirror/beach magnetic conﬁguration. The paper will give an overview about modal-conversion investigation by a theoretical and experimental point of view",
            "including the description of the diagnostics developed to detect plasma emitted radiation in the RF",
            "optical",
            "soft-X and hard-X-ray domains."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moco01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moco01.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moco01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOCO01",
          "page_number": "14",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "MOCO02",
          "title": "Broadband Microwave Emission Spectrum Associated With Kinetic Instabilities in ECR Plasmas",
          "authors": [
            "I. Izotov",
            "D. Mansfeld",
            "V. Skalyga",
            "IAP/RAS",
            "Nizhny Novgorod",
            "Russia",
            "I. Izotov",
            "V. Skalyga",
            "UNN",
            "Nizhny Novgorod",
            "Russia",
            "T. Kalvas",
            "H. A. Koivisto",
            "J. Komppula",
            "R.J. Kronholm",
            "J.P. Laulainen",
            "O.A. Tarvainen",
            "JYFL",
            "Jyväskylä",
            "Finland",
            "ECRISs are susceptible to kinetic instabilities due to resonance heating mechanism forming an anisotropic electron velocity distribution function. Well-known and frequently observed extracted ion beam current oscillations in case of high heating power and/or low magnetic field gradient are proven to be caused by the instabilities of cyclotron type leading to a notable reduction of highly-charged ion beam intensities. It has been shown recently that heating power level and magnetic field gradient affect the spectrum of microwave emission of plasma related to cyclotron instabilities",
            "being in the frequency range of 8-14 Ghz. More detailed study of microwave emission spectrum of ECR plasma conducted with an improved setup is presented in this work. It was found that frequencies of microwaves emitted by the plasma can be far beyond the primary heating frequency (14 GHz) and up to 25 GHz. Moreover",
            "a threshold transition from periodic pulsed emission to a CW emission has been observed in the experiment for the first time",
            "as was predicted theoretically*. The transition occurs at certain threshold levels of heating microwave power and magnetic field gradient.",
            "*A.G. Shalashov et all",
            "JETP Letters",
            "2006",
            "Vol. 84",
            "No. 6",
            "pp. 314-319 (2006)"
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moco02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moco02.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moco02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOCO02",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "MOCO03",
          "title": "Cavity Tuning Experiments with the JYFL 14 GHz ECRIS",
          "authors": [
            "O.A. Tarvainen",
            "T. Kalvas",
            "H. A. Koivisto",
            "R.J. Kronholm",
            "J.P. Laulainen",
            "J. Orpana",
            "JYFL",
            "Jyväskylä",
            "Finland",
            "I. Izotov",
            "D. Mansfeld",
            "V. Skalyga",
            "IAP/RAS",
            "Nizhny Novgorod",
            "Russia",
            "CERN",
            "Geneva",
            "Switzerland",
            "Experimental results showing the effect of cavity tuning on oxygen beam currents extracted from the AECR-type JYFL 14 GHz ECRIS are reported. The microwave-plasma coupling properties of the ion source were adjusted by inserting a conducting tuner stub through the injection plug",
            "thus changing the dimensions of the plasma chamber and affecting the cavity properties of the system. The beam currents of high charge state ions were observed to vary up to some tens of percent depending on the tuner position and the microwave frequency."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moco03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moco03.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moco03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOCO03",
          "page_number": "18",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "MOCO04",
          "title": "Recent Bremsstrahlung Measurements from the Superconducting Electron Cyclotron Resonance Ion Source VENUS",
          "authors": [
            "J.Y. Benitez",
            "C.M. Lyneis",
            "L. Phair",
            "D.S. Todd",
            "D. Xie",
            "LBNL",
            "Berkeley",
            "California",
            "USA",
            "Axial bremsstrahlung from the superconducting Electron Cyclotron Resonance ion source VENUS have been systematically measured as a function of RF heating frequency",
            "and the axial and radial field strengths. The work focuses on bremsstrahlung with energies greater than 10 keV to extract the spectral temperature Ts. The three axial coils and the radial coils in the superconducting VENUS can all be set independently and have a large dynamic range",
            "which makes it possible to decouple Bmin and Bgrad and study their effects on the bremsstrahlung independently. With typical pressure and RF power levels",
            "the measurements show that Ts depends approximately linearly on Bmin and is not correlated with the ∇BECR",
            "the magnetic field mirror ratios or the RF frequency. These results are important for the next generation of ECR ion sources",
            "which are designed to operate at frequencies above 40 GHz and significantly higher magnetic fields where bremsstrahlung is expected to cause a significant cryogenic heat load and increase the radiation shielding requirements."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moco04_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moco04.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moco04_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOCO04",
          "page_number": "23",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 4,
      "scrape_time": "2025-10-10 17:27:18"
    },
    {
      "session_info": {
        "id": "MODO",
        "name": "MODO - Plasma investigations II",
        "url": "https://proceedings.jacow.org/ecris2016/html/modo.htm"
      },
      "papers": [
        {
          "paper_id": "MODO01",
          "title": "Structural Information on the ECR Plasma by X-ray Imaging",
          "authors": [
            "R. Rácz",
            "S. Biri",
            "ATOMKI",
            "Debrecen",
            "Hungary",
            "C. Caliri",
            "G. Castro",
            "S. Gammino",
            "D. Mascali",
            "L. Neri",
            "F.P. Romano",
            "INFN/LNS",
            "Catania",
            "Italy",
            "DU",
            "Debrecen",
            "Hungary",
            "IBAM-CNR",
            "Catania",
            "Italy",
            "Precise knowledge on the density distribution of the Electron Cyclotron Resonance Ion Source plasma is needed by several reasons: i) in order to possibly improve the quality parameters of the extracted ion beam (emittance",
            "brightness) strongly linked to the plasma structure",
            "ii) to correctly investigate the recently observed plasma instabilities and/or the implementation of alternative heating methods (e.g. modal conversion) iii) in order to improve the general microwave-to-plasma coupling efficiency",
            "in view of a microwave-absorption oriented design of future ECRIS. The non-destructive spectroscopic diagnostic methods give information always corresponding to an integration over the whole plasma volume. X-ray imaging by pin-hole camera can partly overcome this limitation. We performed volumetric and space resolved X-ray measurements at the ATOMKI ECRIS operated at lower frequencies than usual. The experimental setup in detail and the methods how the working parameters were selected will be shown. The integrated and photon-counting analyses of the collected plasma images show a strong effect of the frequency and magnetic field on the plasma structure and local energy content."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/modo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/modo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/modo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MODO01",
          "page_number": "30",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "MODO02",
          "title": "Angular Distributions of Bremsstrahlung X-ray Emission from ECR Plasma",
          "authors": [
            "Korea University",
            "Seoul",
            "Republic of Korea",
            "High-energy X-ray emission beyond a critical energy from ECR heating has long attracted much attention and its nature has yet been unsolved. We have measured bremsstrahlung X-rays from the 28-GHz ECR ion source at Busan Center of KBSI. The gamma-ray detection system consists of three NaI(Tl) scintillation detectors placed 55 cm radially from the beam axis at the extraction port",
            "and a NaI(Tl) scintillation detector for monitoring X-ray intensity at the beam axis. Bremsstrahlung X-ray energy spectra were measured at 9 azimuthal angular regions at RF power of 1kW. We also measured bremsstrahlung X-rays by exchanging detector positions for studying systematic uncertainties. Detection efficiency and shielding effect are taken into account for extracting real X-ray energy spectra from measured ones",
            "based on Geant4 simulation results. Preliminary results on the azimuthal angular distributions of bremsstrahlung X-rays with respect to energy region will be presented.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/modo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/modo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/modo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MODO02",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 2,
      "scrape_time": "2025-10-10 17:27:21"
    },
    {
      "session_info": {
        "id": "MOEO",
        "name": "MOEO - RF generation and transport",
        "url": "https://proceedings.jacow.org/ecris2016/html/moeo.htm"
      },
      "papers": [
        {
          "paper_id": "MOEO01",
          "title": "Microwave Power Injection Schemes Study at IMP with Superconducting ECR Ion Source SECRAL",
          "authors": [
            "IMP/CAS",
            "Lanzhou",
            "People's Republic of China",
            "The performance of electron cyclotron resonance ion sources (ECRIS) is critically dependent on the resonant absorption efficiency of microwave power. Over-sized round waveguide with a diameter about Ø33.0 mm excited in the TE01 mode has been typically adopted for microwave coupling to the ECR plasma with the superconducting ECRIS operated at 24 or 28 GHz",
            "such as SECRAL and VENUS. However",
            "it should be realized that this is not necessarily the optimal scheme for microwave power injection. In order to study the impact of different microwave power distribution on ECRH efficiency and especially the production of highly charged ions",
            "a set of compact and efficient mode convertors and mode transitions with different diameters applicable to 24 GHz SECRAL has been designed",
            "fabricated and tested. SECRAL has been tested with the different microwave power injection schemes for the production intense highly charged heavy ion beams of Ar and Xe. A general comparison of the performance working at the different injection schemes with SECRAL will be given",
            "and a preliminary analysis will be made in this paper."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moeo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moeo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moeo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOEO01",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 1,
      "scrape_time": "2025-10-10 17:27:23"
    },
    {
      "session_info": {
        "id": "MOFO",
        "name": "MOFO - Charge breeding",
        "url": "https://proceedings.jacow.org/ecris2016/html/mofo.htm"
      },
      "papers": [
        {
          "paper_id": "MOFO01",
          "title": "",
          "authors": [],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mofo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mofo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mofo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOFO01",
          "page_number": "",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "MOFO02",
          "title": "Comparison of Residual Background in an ECR and an EBIS",
          "authors": [
            "R.C. Vondrasek",
            "C. Dickerson",
            "P.N. Ostroumov",
            "R.C. Pardo",
            "R.H. Scott",
            "G.P. Zinkann",
            "ANL",
            "Argonne",
            "Illinois",
            "USA",
            "An ECR charge breeder was developed some years ago as part of the Californium Rare Ion Breeder Upgrade (CARIBU) program at Argonne National Laboratory. The charge breeding efficiency and high charge state production of the source were at the forefront of ECR charge breeders",
            "but its overall performance as part of the accelerator system was limited by a pervasive stable ion background. Steps were taken to reduce the level of background contamination but met with limited success. As such",
            "the ECR charge breeder was decommissioned in late 2015 and replaced with an EBIS charge breeder. The EBIS has demonstrated good breeding efficiency in an off-line installation",
            "but the critical attribute of stable ion background has only begun to be characterized. We will present a comparison of the background levels from these two devices when coupled to the accelerator complex as well as possible solutions for background reduction in ECR charge breeders.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [
            "Funding: This work was supported by the U.S. Department of Energy, Office of Nuclear Physics, under Contract No. DE-AC02-06CH11357 and used resources of ANL ATLAS facility, an Office of Science User Facility"
          ],
          "abstract": "reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mofo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mofo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mofo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOFO02",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "MOFO03",
          "title": "Simulations of the ECR-based Charge Breeding Process at INFN: Status and Perspectives",
          "authors": [
            "INFN/LNL",
            "Legnaro (PD)",
            "Italy",
            "D. Mascali",
            "L. Neri",
            "G. Torrisi",
            "INFN/LNS",
            "Catania",
            "Italy",
            "Since 2012",
            "the INFN ion source group has been undertaking an intense activity on numerical modelling",
            "in the European context of the EMILIE Project until 2014. The work concerns the study of the two main aspects influencing the performances of an ECR-based charge breeder: on one hand",
            "the interaction of the injected 1+ beam with the ECR plasma; on the other hand",
            "the energy coupling to plasma electrons by the microwave field set-up inside the plasma chamber. The first aspect has been addressed by developing a numerical code in a Matlab environment",
            "able to reproduce the capture and thermalization of an ion beam by the ECR plasma. Equations describing the process have been implemented trough the Langevin formalism",
            "including a plasma model of increasing complexity. The second aspect has been studied with the interplay between the 3D solver COMSOL Multiphysics and Matlab",
            "describing the plasma through its fully 3D dielectric permittivity tensor. This paper describes the state-of-the-art of the work on both the fronts: it will show an overview of the beam-plasma interaction",
            "offering some hints for the optimization of already existing devices or for the design of new ones."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mofo03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mofo03.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mofo03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOFO03",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 3,
      "scrape_time": "2025-10-10 17:27:26"
    },
    {
      "session_info": {
        "id": "TUAO",
        "name": "TUAO - Status reports and new development II",
        "url": "https://proceedings.jacow.org/ecris2016/html/tuao.htm"
      },
      "papers": [
        {
          "paper_id": "TUAO01",
          "title": "The Proton Source for the European Spallation Source (PS-ESS): Installation and Commissioning at INFN-LNS",
          "authors": [
            "L. Celona",
            "L. Allegra",
            "A. Amato",
            "G. Calabrese",
            "A.C. Caruso",
            "G. Castro",
            "F. Chines",
            "G. Gallo",
            "S. Gammino",
            "O. Leonardi",
            "A. Longhitano",
            "G. Manno",
            "S. Marletta",
            "D. Mascali",
            "A. Massara",
            "A. Maugeri",
            "M. Mazzaglia",
            "L. Neri",
            "S. Passarello",
            "G. Pastore",
            "A. Seminara",
            "A. Spartà",
            "G. Torrisi",
            "S. Vinciguerra",
            "INFN/LNS",
            "Catania",
            "Italy",
            "S. Di Martino",
            "P. Nicotra",
            "Si.A.Tel SRL",
            "Catania",
            "Italy",
            "A 2.45 GHz ' 0.1 T microwave discharge Proton Source has been designed and assembled at INFN-LNS for the European Spallation Source (PS-ESS) in order to produce pulsed beams of protons up to 74 mA nominal current",
            "at 75 keV of energy",
            "with a transverse emittance containing 99 % of the nominal proton current below 2.25 π mm mrad and a beam stability of ± 2 %. The challenging performances of the machine have triggered specific studies on the maximization of the proton fraction inside the plasma and of the overall plasma density",
            "including dedicated modelling of the wave-to-plasma interaction and ionization processes. The plasma conditioning phase started in July and excellent RF to plasma coupling",
            "more than 99.5% is evident since the beginning. Reflected power fluctuation less than 0.05 % was measured providing a great starting point to reach the beam stability requested by the ESS accelerator."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tuao01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tuao01.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tuao01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUAO01",
          "page_number": "39",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUAO02",
          "title": "The Development of ECR Ion Source for Medical Applications",
          "authors": [
            "B.S. Lee",
            "J. Bahng",
            "S. Choi",
            "J.G. Hong",
            "H.G. Kim",
            "S.J. Kim",
            "J.W. Ok",
            "J.Y. Park",
            "M. Won",
            "J.H. Yoon",
            "Korea Basic Science Institute",
            "Busan",
            "Republic of Korea",
            "Kyungpook National University",
            "Daegu",
            "Republic of Korea",
            "Since 2009",
            "the ECR ion source for material researcher was developed at Korea Basic Science Institute (KBSI). From our efforts during 7 years",
            "The service of 28 GHz ECR ion source of KBSI was succeeded in this year. Our new project is started based on developed skills for 28GHz ECR ion source. In this year",
            "we are started proton ECR ion source with high current for medical application that is Boron Neutron Capture Therapy (BNCT)",
            "Proton Therapy. The first step is development of proton ECR ion source with beam current of 23mA. In this paper",
            "we will suggest design results and manufacturing status of proton ECR ion source for BNCT. Also",
            "we will introduce the future plan about development of compact proton therapy and will report plans for feasibility study."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tuao02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tuao02.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tuao02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUAO02",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "TUAO03",
          "title": "Injector Characteristics of 100-MeV Proton Linac at KOMAC",
          "authors": [
            "KAERI",
            "Daejon",
            "Republic of Korea",
            "Y.-S. Cho",
            "D.I. Kim",
            "H.-J. Kwon",
            "S.P. Yun",
            "Korea Atomic Energy Research Institute (KAERI)",
            "Gyeongbuk",
            "Republic of Korea",
            "A 100-MeV proton linac at Korea Multi-purpose Accelerator Complex (KOMAC) is under operation and has provided high-intensity proton beam to users since 2013. The injector part of the linac consists of a microwave ion source with 50 keV extraction energy",
            "two solenoids for beam matching to the 3-MeV RFQ and a vacuum box including beam diagnostics and vacuum pump. The design current of the injector is 20 mA with 0.2 pi.mmmrad transverse normalized rms emittance. The injector was characterized through emittance measurement and solenoids operating parameter sweep. The details of the injector characteristics will be presented in this paper."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tuao03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tuao03.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tuao03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUAO03",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "TUAO04",
          "title": "SECRAL II Ion Source Development and the First Commissioning at 28 GHz",
          "authors": [
            "L.T. Sun",
            "X. Fang",
            "Y.C. Feng",
            "J.W. Guo",
            "H.Y. Ma",
            "L.Z. Ma",
            "Y.M. Ma",
            "Z. Shen",
            "W. Wu",
            "T. Yang",
            "Y. Yang",
            "W.H. Zhang",
            "X.Z. Zhang",
            "B. Zhao",
            "H.W. Zhao",
            "IMP/CAS",
            "Lanzhou",
            "People's Republic of China",
            "SECRAL II ion source has been successfully designed and developed at IMP. This ion source is a 3rd generation ECR machine optimized for the operation at 28 GHz. As a second superconducting ECR ion source developed at IMP with the identical coldmass design as SECRAL ion source",
            "which has the sextupole coils external to the axial solenoids",
            "the magnet performance is more robust according the training test. After a short time beam test at 18 GHz",
            "SECRAL II has been commissioned at 28 GHz",
            "and some preliminary results have been achieved with high charge state ion beam production. This paper will present the magnet design and test results. The first beam at 28 GHz will also be given."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tuao04_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tuao04.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tuao04_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUAO04",
          "page_number": "43",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "TUAO05",
          "title": "First Plasma of the PHOENIX V3 ECR Ion Source",
          "authors": [
            "T. Thuillier",
            "J. Angot",
            "L. Bonny",
            "J. Jacob",
            "T. Lamy",
            "P. Sole",
            "LPSC",
            "Grenoble Cedex",
            "France",
            "J.L. Flambard",
            "L. Maunoury",
            "GANIL",
            "Caen",
            "France",
            "JYFL",
            "Jyväskylä",
            "Finland",
            "IN2P3 IPNL",
            "Villeurbanne",
            "France"
          ],
          "institutions": [],
          "abstract": "PHOENIX V3 is an upgrade of the PHOENIX V2 ECR ion source granted by the European CRISP project. This new ECRIS features a larger plasma chamber and a re-duced vacuum pressure under operation. The V3 source will replace the V2 one on the",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tuao05_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tuao05.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tuao05_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUAO05",
          "page_number": "48",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 5,
      "scrape_time": "2025-10-10 17:27:32"
    },
    {
      "session_info": {
        "id": "TUBO",
        "name": "TUBO - Theory",
        "url": "https://proceedings.jacow.org/ecris2016/html/tubo.htm"
      },
      "papers": [
        {
          "paper_id": "TUBO02",
          "title": "Numerical Studies of the Gas-Mixing Effect in ECRIS",
          "authors": [
            "V. Mironov",
            "S.L. Bogomolov",
            "A.E. Bondarchenko",
            "A.A. Efremov",
            "V.N. Loginov",
            "JINR",
            "Dubna",
            "Moscow Region",
            "Russia",
            "The particle-in-cell MCC code NAM-ECRIS is used to simulate the ECRIS plasma sustained in a mixture of Kr with O2",
            "N2",
            "Ne and He. The model assumes that ions are electrostatically confined in ECR zone by a dip in the plasma potential. Gain in the extracted krypton ion currents is seen for the highest charge states; the gain is maximized when oxygen is used as the mixing gas. A special feature of oxygen is that most of singly charged oxygen ions are produced after dissociative ionization of oxygen molecules with the large kinetic energy release of around 5 eV per ion. Increased loss rate of energetic lowly charged ions of the mixing element requires building up of the retarding potential barrier close to ECR surface to equilibrate electron and ion losses out of the plasma. In the mixed plasmas",
            "the barrier value is large (~1 V) compared to the pure Kr plasma (~0.01 V)",
            "with the longer confinement times of krypton ions and with the much higher ion temperatures."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tubo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tubo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tubo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUBO02",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "TUBO03",
          "title": "Simulations of High Intensity Low Mass Ion Sources",
          "authors": [
            "R. de Guiran",
            "A. Chancé",
            "R. Gobin",
            "O. Tuske",
            "CEA/IRFU",
            "Gif-sur-Yvette",
            "France",
            "At CEA/Saclay",
            "in the framework of the HPPA devel-opment",
            "the Department of Accelerators",
            "Cryogenics and Magnetism (SACM) has designed and built low mass",
            "high intensity ECRIS for more than 15 years. Such skills are illustrated by the construction of injectors (sources and low energy beam transport lines) for several national and international projects such as"
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tubo03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tubo03.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tubo03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUBO03",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 2,
      "scrape_time": "2025-10-10 17:27:34"
    },
    {
      "session_info": {
        "id": "WEAO",
        "name": "WEAO - Status reports and new development III",
        "url": "https://proceedings.jacow.org/ecris2016/html/weao.htm"
      },
      "papers": [
        {
          "paper_id": "WEAO01",
          "title": "Recent Developments with the GTS-LHC ECR Ion Source at CERN",
          "authors": [
            "V. Toivanen",
            "G. Bellodi",
            "C. Fichera",
            "D. Küchler",
            "A.M. Lombardi",
            "M. Maintrot",
            "A.I. Michet",
            "M. O'Neil",
            "S. Sadovich",
            "F.J.C. Wenander",
            "CERN",
            "Geneva",
            "Switzerland",
            "JYFL",
            "Jyväskylä",
            "Finland",
            "Linac3 is the first link in the chain of accelerators providing highly charged heavy ion beams for the CERN experimental program. The beams",
            "predominantly lead",
            "are produced with the GTS-LHC 14.5 GHz Electron Cyclotron Resonance (ECR) ion source",
            "operated in afterglow mode. In the framework of the LHC Injector Upgrade program (LIU)",
            "several activities have been carried out to improve the GTS-LHC and Linac3 performance",
            "in terms of delivered beam current. The extraction region of the GTS-LHC has been upgraded with redesigned apertures and the addition of an einzel lens",
            "yielding improved Linac3 output. Also",
            "a series of measurements has been performed to study the effects of two-frequency heating on the performance of the GTS-LHC. A Traveling Wave Tube Amplifier (TWTA) with variable frequency and pulse pattern was utilized as a secondary microwave source. The two-frequency effect commonly reported with CW operation of ECR ion sources boosting high charge state ion production was also observed in afterglow mode. Lastly",
            "for studies of metal ion beam production",
            "a dedicated test stand has been assembled to characterize the GTS-LHC resistively heated miniature oven performance."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao01.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO01",
          "page_number": "50",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEAO02",
          "title": "Preliminary Design of a Hybrid Ion Source for 7Li+3 Generation",
          "authors": [
            "S.X. Peng",
            "J.E. Chen",
            "Z.Y. Guo",
            "H.T. Ren",
            "J.M. Wen",
            "W.B. Wu",
            "Y. Xu",
            "A.L. Zhang",
            "J.F. Zhang",
            "T. Zhang",
            "PKU",
            "Beijing",
            "People's Republic of China",
            "Graduate University",
            "Chinese Academy of Sciences",
            "Beijing",
            "People's Republic of China",
            "University of Chinese Academy of Sciences",
            "Beijing",
            "People's Republic of China",
            "To provide a novel directional fast-neutron via the p(7Li",
            "n) reaction for prompt fission γ -ray (PFG) spectra study",
            "a hybrid 7Li3+ ion source was designed at Peking University(PKU). It is a combination of a 6.5 GHz ECR (electron cyclotron resonance) ion source and a hot surface ionization source. The surface ionization source locates inside the ECR chamber and a 500 V bias voltage is set between the hot surface and the ECR chamber. Lithium vapor from an oven is guided into the surface source through a heating transfer pipe. Li+ ions generated on the hot surface will be extracted from the surface source and striped into Li3+ with the electron impact ionization. To avoid the lithium vapor attaching on the wall of the discharge chamber",
            "the whole plasma chamber will be heated up to 300 °C. A four-electrode extraction system will be used for Li3+ ion beam formation. Details will be presented in the paper.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao02.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO02",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "WEAO03",
          "title": "Practical Comparison of Two-Frequency Heating Phenomena in Different ECR Ion Sources",
          "authors": [
            "NIRS",
            "Chiba-shi",
            "Japan",
            "S. Biri",
            "R. Rácz",
            "ATOMKI",
            "Debrecen",
            "Hungary",
            "Osaka University",
            "Graduate School of Engineering",
            "Osaka",
            "Japan",
            "National Institute of Radiological Sciences",
            "Chiba",
            "Japan",
            "AEC",
            "Chiba",
            "Japan",
            "In order to improve highly-charged ion production from the 18GHz NIRS-HEC ECRIS",
            "our group has studied the mixture of two microwaves of which the frequencies were close together each. Our conclusion was that when an additional microwave is added to the primary microwave",
            "the plasma stability is improved. The output current of the highly charged ion beam was proportional to the total power of both microwaves. The dependence on the additional frequency showed the fine structure. Since this structure depended on the magnetic field",
            "vacuum pressure",
            "and so on",
            "the precise frequency adjustment for maximum output was required under each condition. Our interest is whether the above-mentioned phenomenon can be demonstrated using a different ion source where the two frequencies are even far from each other. We installed a 17.75-18.25 GHz microwave system in addition to the 14.3 GHz klystron amplifier of the ATOMKI ECRIS. Argon output currents at various values of the microwave power and frequency were studied. The dependence on the total power shows the similar tendency as at NIRS. The dependence on the additional frequency also shows the fine structure. Detailed data will be presented."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao03.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO03",
          "page_number": "55",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEAO04",
          "title": "Installation and Commissioning of the 18 GHz High Temperature Superconducting Ecr Ion Source and Low Energy Beam Transport  System on a 200 kV High Voltage Platform",
          "authors": [
            "G.O. Rodrigues",
            "R. Ahuja",
            "P. Barua",
            "D. Kanjilal",
            "A. Kothari",
            "A. Malyadri",
            "A. Mandal",
            "Y.M. Mathur",
            "U.K. Rao",
            "A. Sharma",
            "IUAC",
            "New Delhi",
            "India",
            "The High Current Injector programme at the Inter University Accelerator Centre is presently in various stages of installation and commissioning. The main objective of the high current injector is to provide higher beam intensities (A/q ~ 6) over a wider mass range as compared to the presently operating 15UD",
            "16MV Tandem-LINAC combination. The injector is based on a reasonably high performing ECR ion source called PKDELIS. The 18 GHz high temperature superconducting ECR ion source",
            "PKDELIS and the low energy beam transport system has been recently installed and commissioned on a 200 kV high voltage platform. The details of the installation and commissioning results will be presented.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao04_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao04.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao04_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO04",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "WEAO05",
          "title": "SMASHI and MeLA ECR Ion Source at NFRI: One for Highly-Charged Ions and the Other for High Current Metal Ions",
          "authors": [
            "H.J. You",
            "W.I. Choo",
            "S.O. Jang",
            "NFRI",
            "Daejon",
            "Republic of Korea",
            "There are two type of ECR ion sources at NFRI. One is SMASHI(Superconducting Multi-Application Source of Highly-charged Ions)",
            "and the other MeLA(Magnet-embedded Lisitano Antenna) ion source. They are developed for highly-charged ions(HCI) and high current metal ions(HCMI) generation",
            "respectively. Firstly",
            "SMASHI is a 18 GHz superconducting ECR ion source",
            "which will be dedicated for future application of HCIs and matter interaction. SMASHI is featuring a liquid helium-free SC magnet having fast-excitation capability(>0.1 A/s) of coils",
            "two frequency heating(18",
            "18+Δ GHz)",
            "remotely-positional variable gap extraction system",
            "and two diagnostic ports for the extraction region. Secondly",
            "MeLA ion source is a scalable high current(>10 mA) metal ion source. the MeLA*",
            "originally developed for a large-area microwave ECR plasma source for semiconductor processing by our group",
            "is able to generate high density uniform ECR plasma by a waveguide directly-coupled and permanent Magnet-embedded Lisitano Antenna. In this presentation we describe design aspects of the sources in detail",
            "and then their performance results are provided.",
            "*H. J. You",
            "S. O. Jang",
            "Y. H. Jung",
            "and B. J. Lee",
            "\"Microwave Antenna for Generating Plasma\"",
            "U.S. Patent 8 648 534",
            "February",
            "2014."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao05_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao05.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao05_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO05",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 5,
      "scrape_time": "2025-10-10 17:27:39"
    },
    {
      "session_info": {
        "id": "WEBO",
        "name": "WEBO - Applications",
        "url": "https://proceedings.jacow.org/ecris2016/html/webo.htm"
      },
      "papers": [
        {
          "paper_id": "WEBO01",
          "title": "An ECRIS Facility for Investigating Nuclear Reactions in Astrophysical Plasmas",
          "authors": [
            "M. Kreller",
            "C. Baumgart",
            "G. Zschornack",
            "DREEBIT",
            "Dresden",
            "Germany",
            "K. Czerski",
            "M. Kaczmarski",
            "N. Targosz-Ślęczka",
            "University of Szczecin",
            "Institute of Physics",
            "Szczecin",
            "Poland",
            "A. Huke",
            "G. Ruprecht",
            "D. Weißbach",
            "IFK Berlin",
            "Berlin",
            "Germany",
            "Technische Universität Dresden",
            "Institut für Angewandte Physik",
            "Dresden",
            "Germany",
            "Nuclear reactions at low energies can be strongly enhanced due to screening of the Coulomb barrier by the surrounding electrons. This effect was studied for the deuteron fusion reactions taking place in metallic environments as a model for dense astrophysical plasmas. Experimentally determined screening energies corresponding to the reduction of the Coulomb barrier height are much larger than the theoretical predictions. One possible explanation is the excitation of a hypothetical threshold resonance in the 4He nucleus. As the energy dependence of the resonant reaction cross section differs to that of the electron screening effect",
            "one can distinguish between both processes expanding measurements down to the deuteron energies of 1keV. A novel ion accelerator was implemented at the University of Szczecin. Ions are produced by a Dresden ECRIS-2.45M as a high-current",
            "low-Z ion source. The following beam line is designed to work on HV potential for decelerating ions below a kinetic energy of 1keV and combined with a ultra-high vacuum target chamber to reduce target impurities. The ion irradiation facility as well as first experimental results are described and discussed."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/webo01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/webo01.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/webo01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEBO01",
          "page_number": "59",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEBO02",
          "title": "Design of Compact ECR Ion Source for C5+ Production",
          "authors": [
            "M. Muramatsu",
            "Y. Iwata",
            "A. Kitagawa",
            "E. Noda",
            "M. Sekiguchi",
            "NIRS",
            "Chiba-shi",
            "Japan",
            "K. Fukushima",
            "T. Sasano",
            "T. Suzuki",
            "K. Takahashi",
            "AEC",
            "Chiba",
            "Japan",
            "H. Murata",
            "T. Takahashi",
            "SHI",
            "Kanagawa",
            "Japan",
            "The Heavy Ion Medical Accelerator in Chiba (HIMAC) was constructed as the first medical dedicated heavy ion accelerator facility at National Institute of Radiological Sciences (NIRS). Over 9000 cancer patients have been treated with 140-430 MeV/u carbon beams since 1994. Compact ECR ion source with all permanent magnets",
            "named Kei2",
            "was developed for production of C4+ ions for medical treatment at NIRS. A compact ECR ion source for Gunma University (Gunma University Heavy Ion Medical Center: GHMC)",
            "Saga carbon-ion radiotherapy (Saga Heavy Ion Medical Accelerator in Tosu: SAGA HIMAT) and Kanagawa carbon-ion radiotherapy (Ion-beam Radiation Oncology Center in Kanagawa: i-ROCK) facility has been operated for medical use. It is a copy of the Kei2 which was developed by NIRS. In order to reduce operation cost of the injector for next designed carbon ion facility",
            "we start design of new compact ECR ion source for C5+ production. Some dependence (mirror field",
            "microwave power and frequency) were checked for optimal parameter of C5+ production at 18 GHz NIRS-HEC source. Results of experiments and specification of new compact source are described in this presentation."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/webo02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/webo02.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/webo02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEBO02",
          "page_number": "64",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEBO03",
          "title": "In-situ Observation of Phase Transformation During Ion Beam Irradiation",
          "authors": [
            "KBSI",
            "Deajeon",
            "Republic of Korea",
            "LANL",
            "Los Alamos",
            "New Mexico",
            "USA",
            "The new method uses reflection high-energy electron diffraction (RHEED) to collect electron diffraction patterns while performing ion irradiation. We use a 50 keV electron beam impinging on a crystalline substrate at grazing incidence. In this presentation",
            "we report on ion irradiations of a single crystal. Irradiations were performed using 100 keV Ar ions at room temperature. Before the single crystal was bombarded with Ar ions",
            "a diffraction pattern with strong diffraction maxima was observed. During the Ar ion irradiation",
            "electron diffraction patterns were collected from the near surface region. The initially strong diffraction patterns gradually faded in intensity until no diffraction spots were visible on the phosphor screen at the fluence of 6~8x1014 ions/cm2. To confirm the presence of the ion-induced amorphization in the near surface region",
            "we used grazing incidence X-ray diffraction and electron diffraction in a transmission electron microscope. Both characterization techniques corroborated the RHEED in-situ measurement",
            "showing the existence of an amorphous region produced by the 100 keV Ar ions."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/webo03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/webo03.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/webo03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEBO03",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 3,
      "scrape_time": "2025-10-10 17:27:42"
    },
    {
      "session_info": {
        "id": "WECO",
        "name": "WECO - Beam extraction & optics",
        "url": "https://proceedings.jacow.org/ecris2016/html/weco.htm"
      },
      "papers": [
        {
          "paper_id": "WECO01",
          "title": "Intermediate Commissioning Results of the Required 140 mA/100 keV CW D+ ECR Injector of LIPAc, IFMIF's Prototype",
          "authors": [
            "B. Bolzon",
            "N. Chauvin",
            "R. Gobin",
            "F. Senée",
            "CEA/IRFU",
            "Gif-sur-Yvette",
            "France",
            "P.-Y. Beauvais",
            "H. Dzitko",
            "F4E",
            "Germany",
            "L. Bellan",
            "M. Comunian",
            "E. Fagotti",
            "A. Pisent",
            "INFN/LNL",
            "Legnaro (PD)",
            "Italy",
            "Univ. degli Studi di Padova",
            "Padova",
            "Italy",
            "P. Cara",
            "R. Heidinger",
            "Fusion for Energy",
            "Garching",
            "Germany",
            "CEA/DSM/IRFU",
            "France",
            "R. Ichimiya",
            "A. Ihara",
            "A. Kasugai",
            "T. Kitano",
            "M. Komata",
            "K. Kondo",
            "K. Sakamoto",
            "T. Shinya",
            "M. Sugimoto",
            "QST",
            "Aomori",
            "Japan",
            "J. Knaster",
            "A. Marqueta",
            "K. Nishiyama",
            "Y. Okumura",
            "G. Pruneri",
            "F. Scantamburlo",
            "IFMIF/EVEDA",
            "Rokkasho",
            "Japan"
          ],
          "institutions": [
            "The LIPAc accelerator aims to operate in Rokkasho Fusion Institute a 125 mA/CW deuteron beam at 9 MeV to validate the concept of IFMIF's accelerators that will operate in CW 125 mA at 40 MeV. The 2.45 GHz ECR injector developed by CEA-Saclay is designed to deliver 140 mA/100 keV CW D+ beam with 99% D+ fraction ratio. Its LEBT relies on a dual solenoid focusing system to transport and match the beam into the RFQ. The normalized RMS emittance at the RFQ injection cone is required to be within 0.25π mm·mrad to allow 96% transmission through the 9.81 m long RFQ. An equal perveance H+ beam of half current and half energy as nominal with D+ is used to avoid activation during commissioning. The injector commissioning at Rokkasho is divided into three phases to characterize the emittance between the two solenoids of the LEBT (A1) and just downstream the RFQ injection cone (A2) and the extraction system of the source (A3). Phase A1 has been achieved and phase A2 continues in 2016 in order to reach the required beam parameters and to match the beam into the RFQ. This paper reports the commissioning results of phase A1 and the intermediate ones of phase A2 for H+ and D+ beams."
          ],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weco01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weco01.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weco01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WECO01",
          "page_number": "67",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WECO02",
          "title": "Development of a Compact High Intensity Ion Source for Light Ions   at CEA-Saclay",
          "authors": [
            "O. Delferrière",
            "Y. Gauthier",
            "R. Gobin",
            "O. Tuske",
            "CEA/IRFU",
            "Gif-sur-Yvette",
            "France",
            "CEA/DRF/IRFU",
            "Gif-sur-Yvette",
            "France",
            "During the past 5 years",
            "a R&D program has been launched to improve the beam quality of ECR 2.45 GHz high intensity light ion sources for high power accelerators. The main goal was to minimize the divergence and emittance growth of intense beams due to the space charge as early as possible on the low energy transfer line for a better injection in the second stage of acceleration (RFQ). This has been achieved by reducing the length of the extraction system",
            "to be able to put the first solenoid as close as possible to the extraction aperture. This was performed with the ALISES concept (Advanced Light Ion Source Extraction System). Encouraging results have been obtained in 2012 but with limitations due to Penning discharges in the accelerating column. Taking advantages of ALISES geometry",
            "intensive studies and simulations have been undertaken to eliminate the discharge phenomena. An Innovative and compact source geometry has been found and the source has been fabricated. This new prototype and its performances will be described",
            "as well as magnetic field configuration studies and its influence on the extracted beam."
          ],
          "institutions": [],
          "abstract": "This source developed at Saclay is under patent number FR 15 56871 and this patent is pending",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weco02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weco02.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weco02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WECO02",
          "page_number": "73",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WECO03",
          "title": "Transverse Coupling of Ion Beams From an RCR Ion Source",
          "authors": [
            "Y. Yang",
            "Y. Liu",
            "L.T. Sun",
            "Y.J. Yuan",
            "H.W. Zhao",
            "IMP/CAS",
            "Lanzhou",
            "People's Republic of China",
            "ECR ion source beam quality will deteriorate under the influence of beam transverse coupling and high-order magnetic field aberration. Ion beams from an ECR ion source will experience a descending axial magnetic field at the extraction region",
            "leading to a strong transverse coupling to the extracted beam",
            "with projection emittance growth both in horizontal and vertical and two eigen emittances separation. On the other hand",
            "sextupole field in the ECR and the sextupole component in the analyzing dipole can also degrade the beam quality by resulting in beam distortion. Proper adjusting of the extraction field strength of the ion source and the pre-focusing solenoid field can help to weaken the correlation in the inter-plane phase spaces and reduce the projection emittances. Another approach to improve the beam quality is to compensate for the high-order magnetic fields. This paper presents the property of beam coupling in the transverse phase space by analytical theory and simulations. Some experimental results are also presented and discussed. In addition",
            "a high-order compensation scheme is displayed",
            "whose feasibility has been verified by preliminary tests with SECRAL at IMP."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weco03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weco03.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weco03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WECO03",
          "page_number": "76",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WECO04",
          "title": "Progress of an Intense Ion Source and Low Energy Beam Transport System for  Jinping Underground Nuclear Astrophysics Experiments",
          "authors": [
            "IMP/CAS",
            "Lanzhou",
            "People's Republic of China",
            "Jinping Underground Laboratory for Nuclear Astrophysics (JUNA) will take the advantage of the ultra low background and high current accelerator facility to study directly a number of important reactions at stellar energies",
            "such as 25Mg(p",
            "γ)26Al",
            "19F(p",
            "α)16O",
            "13C(α",
            "n)16O",
            "and 12C(α",
            "γ)16O reactions. As a key component of high current accelerator facility",
            "the performance of ion source has a very important effect on the beam quality. In order to produce the requested 10 emA H+",
            "10 emA He+ and 2.5 emA He2+ at the exit of low energy beam transport (LEBT) line",
            "an intense 2.45GHz ECR ion source operated at the maximum energy of 50keV/q will be developed for JUNA project. The ion beam extracted by a 3-electrode extraction system passes through a low energy beam transport system",
            "which is composed of identical solenoids and dipole magnet",
            "into the entrance of acceleration tube (AT). In this paper",
            "the main technique risks",
            "physics design of the ion source and LEBT will be discussed. The progress of the ion source and LEBT",
            "such as mechanical design",
            "magnetic elements",
            "beam diagnostic units of LEBT and development of ion source will be introduced.",
            "1. Q. Wu. Z.M. Zhang",
            "L.T. Sun et al. Rev. Sci. Instrum. 85.02A703. (2014)  2. ZHANG Meng",
            "PENG Shi-Xiang; SONG Zhi-Zhong etal. Chinese physics C",
            "2008 Vol. 32 (S1): 220-222"
          ],
          "institutions": [
            "Funding: This work is supported by the equipment research and development project of Chinese Academy of Sciences and National Natural Science Foundation of China under grant NO.11221064."
          ],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weco04_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weco04.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weco04_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WECO04",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 4,
      "scrape_time": "2025-10-10 17:27:47"
    },
    {
      "session_info": {
        "id": "WEPP",
        "name": "WEPP - Poster session",
        "url": "https://proceedings.jacow.org/ecris2016/html/wepp.htm"
      },
      "papers": [
        {
          "paper_id": "WEPP01",
          "title": "High Intensity Beam Production at CEA/Saclay For The IPHI Project",
          "authors": [
            "R. Gobin",
            "D. Bogard",
            "O. Delferrière",
            "M. Desmons",
            "Y. Gauthier",
            "F. Harrault",
            "F. Peauger",
            "G. Perreu",
            "B. Pottin",
            "Y. Sauce",
            "J. Schwindling",
            "F. Senée",
            "O. Tuske",
            "D. Uriot",
            "T.V. Vacher",
            "CEA/DRF/IRFU",
            "Gif-sur-Yvette",
            "France",
            "CEA/Saclay is involved in high power proton accelerators for long years. This activity started in the 90's",
            "with the development of the SILHI source which routinely produces tens mA of proton beam. Several industrial difficulties led to a very long IPHI RFQ construction process. The 352 MHz RFQ conditioning is presently in progress. Before the completion of the conditioning in CW mode",
            "tests with pulsed proton beam have been decided. As a consequence",
            "the SILHI source recently produced very short H+ beam pulses in order to allow the first IPHI beam acceleration. Such very short pulses",
            "in the range of few hundred microseconds",
            "allowed analyzing the beam loading of the RFQ cavity as well as conditioning the middle energy diagnostic. This article will focus on the source parameters and beam characteristics in the low energy beam line leading to the best RFQ transmission."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp01.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP01",
          "page_number": "83",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP02",
          "title": "Commissioning of the High Intensity Proton Injector of the Facility for Anti Proton and Ion Research at CEA-Saclay",
          "authors": [
            "O. Tuske",
            "N. Chauvin",
            "O. Delferrière",
            "Y. Gauthier",
            "P. Girardot",
            "N. Misiara",
            "Y. Sauce",
            "F. Senée",
            "C. Simon",
            "CEA/IRFU",
            "Gif-sur-Yvette",
            "France",
            "F. Ameil",
            "R. Berezov",
            "J. Fils",
            "R. Hollinger",
            "GSI",
            "Darmstadt",
            "Germany",
            "CEA/DSM/IRFU",
            "France",
            "The Facility for Antiproton and Ion Research (FAIR) located at GSI (Darmstadt) in Germany addresses several fields of physics research within a single installation. One of the contribution of Irfu/SACM at CEA-Saclay to the FAIR linear proton accelerator concerns the development and construction of the ion source and the low energy line. The 2.45 GHz microwave ion source will deliver a 100 mA H+ beam pulsed at 4 Hz with an energy of 95 keV. A low energy beam transport (LEBT) line based on a dual solenoids focusing scheme allows the injection of the proton beam into the radio frequency quadrupole (RFQ) within an acceptance of 0.3π mm.mrad (norm.",
            "rms). An electrostatic chopper system located between the second solenoid and the RFQ is used to cut the beam macro pulse from the source to inject 36 μs long beam pulses into the RFQ. This article reports the finalization of the installation of the injector with the detail of dedicated diagnostics",
            "the first beam measurements and gives a planning of the different commissioning phases"
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp02.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP02",
          "page_number": "86",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP03",
          "title": "Never Run Your ECR Ion Source with Argon in Afterglow for 6 Months!",
          "authors": [
            "D. Küchler",
            "A.I. Michet",
            "J.A.F. Somoza",
            "V. Toivanen",
            "CERN",
            "Geneva",
            "Switzerland"
          ],
          "institutions": [
            "The fixed target experiment NA61 in the North Area of the SPS at CERN studies phase transitions in strongly interacting matter using the primary beams available from the CERN accelerator complex (protons and lead ions). In order to explore a wider range of energies and densities a primary argon beam was requested for the physics run in 2015. The GTS-LHC ECR ion source was running for many months during 2013 and 2014 to study the source behaviour and to setup the accelerator chain with argon ions. This paper reports the long term effects of the argon operation on the GTS-LHC ion source and the Low Energy Beam Transport (LEBT). Heavy sputtering inside the source caused a degradation of the plasma chamber and metal coating of insulators inside the beam extraction system. Iron ions could be found in the extracted beam. Also the pumping performance of ion getter pumps in the LEBT degraded significantly. Additional preventive maintenance was necessary to be able to run for long periods without risking serious damage to the ion source."
          ],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp03_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp03.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp03_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP03",
          "page_number": "89",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": true
        },
        {
          "paper_id": "WEPP05",
          "title": "Status Report on Metallic Beam Production at GANIL/SPIRAL 2",
          "authors": [
            "C. Barue",
            "O. Bajeat",
            "J.L. Flambard",
            "R. Frigot",
            "P. Jardin",
            "N. Lechartier",
            "F. Lemagnen",
            "L. Maunoury",
            "V. Metayer",
            "O. Osmond",
            "GANIL",
            "Caen",
            "France",
            "IN2P3 IPNL",
            "Villeurbanne",
            "France",
            "P. Sole",
            "T. Thuillier",
            "LPSC",
            "Grenoble Cedex",
            "France",
            "Primary ion beams from metallic elements are routinely produced at GANIL using ECR4 and ECR4M 'room temperature' ECR ion sources. Ionization efficiency measurements",
            "partially presented in the past",
            "are summarized in this report together with updated and new results obtained with Cd",
            "Mo and Ta. Preliminary results for Ni and Ca obtained with the room temperature Phoenix-V2 ECR ion source",
            "under commissioning for SPIRAL 2",
            "are also included. These ionization efficiencies are compared according to the production methods: oven",
            "sputtering",
            "MIVOC",
            "gaseous compounds. The presently SPIRAL 2 heavy ion injector designed for ions Q/A=1/3 shows clear limitations in terms of intensity for metallic ions with mass higher than 60 (intensity < 1 pμA). In order to choose the best ion source for a future Q/A=1/6",
            "1/7 injector",
            "best world results have been compiled for different existing 'room temperature' and superconducting ECR ion sources."
          ],
          "institutions": [],
          "abstract": "# christophe.barue@ganil.fr reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp05_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp05.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp05_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP05",
          "page_number": "92",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP08",
          "title": "Development of Compact H+ ECR Ion Source with Pulse Gas Valve",
          "authors": [
            "Y. Fuwa",
            "Y. Iwashita",
            "H. Tongu",
            "Kyoto ICR",
            "Uji",
            "Kyoto",
            "Japan",
            "QST",
            "Tokai",
            "Japan",
            "QST/Takasaki",
            "Takasaki",
            "Japan"
          ],
          "institutions": [],
          "abstract": "Compact H+ ECR Ion Source using permanent magnets is under development. A pulsed gas injection system achieved by a piezo gas valve can reduce the gas load to a vacuum evacuation system. This feature is suitable when the ion source is closely located to an RFQ. Results of a performance test will be presented. reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp08_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp08.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp08_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP08",
          "page_number": "98",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP09",
          "title": "Development of a New Compact 5.8 GHz ECR Ion Source",
          "authors": [
            "J. Angot",
            "L. Bonny",
            "J. Jacob",
            "T. Lamy",
            "P. Sole",
            "T. Thuillier",
            "F. Villa",
            "LPSC",
            "Grenoble Cedex",
            "France",
            "Polygon Physics",
            "Grenoble",
            "France",
            "LPSC is developing a new 5.8 GHz compact ion source to produce low charge state ion beams and study their capture in the PHOENIX charge breeder. The source was designed to meet criteria like stability",
            "compactness and low cost. It is mounted on a DN200 iso K flange and is fully under vaccum during operation. The technology brings modularity to ease the development. It can operate up to 60 kV. The plasma is heated by a 100W solid state amplifier. The ECRIS produces 1 mA of H+ beam with 20W of HF and low charge state Argon ions. It was tested under several microwave and magnetic configurations on a test bench equipped with a mass spectrometer and diagnostics. Given its excellent performances",
            "this source is being installed to drive the accelerator based neutron source",
            "GENEPI 2",
            "at LPSC. The developments of the source together with the results of the experiments will be presented. Future plans for this ion source will also be discussed. This work was supported by the ERA-NET NuPNET in the frame of the EMILIE project."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp09_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp09.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp09_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP09",
          "page_number": "101",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP14",
          "title": "A New ECRIS Installation at the Argonne Tandem Linac Accelerator System",
          "authors": [
            "R.H. Scott",
            "C. Dickerson",
            "R.C. Pardo",
            "R.C. Vondrasek",
            "ANL",
            "Argonne",
            "Illinois",
            "USA",
            "An existing all permanent magnet ECRIS",
            "the BIE100 [1]",
            "will be installed at ATLAS to recover operational flexibility by providing ATLAS with a second ECR ion source for stable beams. For years ATLAS has operated with two ECR ion sources",
            "ECR2 and the ECR charge breeder as well as a tandem electrostatic injector. The tandem was retired in 2013 and in mid-2015 the ECR charge breeder was decommissioned to make room for a new Electron Beam Ion Source exclusively for charge breeding radioactive ion beams. This left the facility with a single ECR source for virtually all stable ion beam pro-duction. Design",
            "installation plans and anticipated opera-tional parameters are discussed."
          ],
          "institutions": [
            "Funding: This work was supported by the U.S. Department of Energy, Office of Nuclear Physics, under Contract No. DE-AC02-06CH11357 and used resources of ANL's ATLAS facility, an Office of Science User Facility"
          ],
          "abstract": "*Dan Z. Xie, Rev. Sci. Instrum. 73, 531 (2002); http://dx.doi.org/10.1063/1.1429320 reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp14_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp14.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp14_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP14",
          "page_number": "106",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP15",
          "title": "Design, Construction and Commissioning of the New Superconducting Ion Source AISHa",
          "authors": [
            "L. Celona",
            "G. Castro",
            "F. Chines",
            "G. Ciavola",
            "G. Costa",
            "S. Gammino",
            "O. Leonardi",
            "S. Marletta",
            "D. Mascali",
            "F. Noto",
            "G. Pastore",
            "G. Torrisi",
            "S. Vinciguerra",
            "INFN/LNS",
            "Catania",
            "Italy",
            "At INFN-LNS a new superconducting ECRIS named AISHa has been designed with the aim to provide highly charged ion beams with low ripple",
            "high stability and high reproducibility",
            "also fulfilling the needs of hospital installations (e.g. L-He free",
            "easy to use",
            "etc.). It is a hybrid ion source based on a permanent magnet hexapole providing 1.3 T on plasma chamber walls",
            "and four superconducting coils for the axial trapping. The axial magnetic system is very flexible in order to minimize the hot electron component and to optimize the ECR heating by controlling the field gradients and the resonance length. The design of the hexapole aimed to minimize the demagnetization due to SC coils. The magnetic system measurement confirmed the effectiveness of the adopted solutions. Innovative solutions have been also implemented as it concerns the RF system design. It will permit to operate in single/double frequency mode",
            "supported by variable frequency high power klystron generators",
            "thus exploiting at the same time the FTE Frequency Tuning Effect and the Two Frequency Heating. The source has been assembled at the INFN-LNS site and the commissioning phase already started."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp15_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp15.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp15_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP15",
          "page_number": "109",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP18",
          "title": "Innovative Mechanical Solutions for the Design of the High Intensity Proton Injector for the European Spallation Source",
          "authors": [
            "G. Gallo",
            "L. Allegra",
            "L. Celonapresenter",
            "S. Gammino",
            "D. Mascali",
            "L. Neri",
            "G. Torrisi",
            "INFN/LNS",
            "Catania",
            "Italy",
            "The design of the 2.45 GHz",
            "0.1 T microwave discharge Proton Source for the European Spallation Source (PS-ESS) has required on-purpose solutions in order to maximize the beam brightness",
            "keeping a very high reliability figure. The mitigation of maintenance issues has been the main guideline through the design phase to maximize the MTBF and minimize the MTTR. The mechanical design has been based on advanced solutions in order to reduce as much as possible the venting time for the plasma chamber",
            "to facilitate the replacement of extraction electrodes and/or plasma chamber",
            "and to simplify any after-maintenance alignment procedure. The paper will describe the strategy which has driven the design phase",
            "the solutions adopted to fulfil the project goals and the results of the assembly phase recently concluded at INFN-LNS with successful first plasma."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp18_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp18.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp18_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP18",
          "page_number": "112",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP22",
          "title": "Versatile High Power Microwave System for Frequency Tuning  of the CAPRICE ECRIS",
          "authors": [
            "F. Maimone",
            "M. Endermann",
            "R. Lang",
            "J. Mäder",
            "P.T. Patchakui",
            "P. Spädtke",
            "K. Tinschert",
            "GSI",
            "Darmstadt",
            "Germany",
            "In the last years it was demonstrated that the variation of the microwave frequency generating the plasma inside ECR Ion Sources (ECRISs) allows to enhance the extracted current of highly charged ions both for gaseous and for metallic elements. In order to use this technique for the performance improvement of the CAPRICE-type ECRIS installed at the High Charge State Injector (HLI) of GSI",
            "the microwave system has been modified. The new arrangement includes - besides the existing Klystron high power amplifier (HPA; max. 2 kW at 14.5 GHz) - two combined Traveling Wave Tube Amplifiers (TWTA) covering a bandwidth of 12.75-14.5 GHz",
            "providing 750 W output power each",
            "which are driven by one or two synthesizer tuners. The new system has been used during the routine operation of the ECRIS for production of different ion beams to be injected into the RFQ of the HLI. A detailed description of the main components of the new microwave system is presented",
            "and the achieved characteristics of ion beam production using different microwave frequencies are described."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp22_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp22.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp22_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP22",
          "page_number": "115",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP32",
          "title": "Magnetic Field Design for 2.45 GHz Negative Hydrogen PMECRIS Chamber using FEM Simulation",
          "authors": [
            "C. Mallick",
            "M. Bandyopadhyay",
            "R.K. Kumarpresenter",
            "S.V. Tewari",
            "Institute for Plasma Research",
            "Bhat",
            "Gandhinagar",
            "India"
          ],
          "institutions": [
            "Funding: Institute For Plasma Research"
          ],
          "abstract": "Negative hydrogen ECRIS plasma is confined by NdFeB permanent magnet antenna around cylindrical cavity wall. Measured axial and radial magnetic field is benchmarked with the simulated data. Four axially magnetized ring magnets of remanance flux density of 1.17T is simulated using bounded current ampere's law technique. Gradient of radial and axial magnetic flux density is calculated to estimate lighter ions leaking out of the plasma wall sheath region. The peak values of radial magnetic field gradient between plasma sheath region and cavity outer wall surface increases from 0.1x107 A/m2 to -0.2x107 A/m2 respectively. Axial magnetic field gradient along inner ECR chamber wall increases from -2.1x107 A/m2 to 2.5x107 A/m2 .ECR contour dimensions of 875 Gauss which corresponds to microwave plasma resonating frequency of 2.45GHz is of thickness ~1mm and having major and minor radius of 30mm and 28mm respectively. reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp32_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp32.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp32_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP32",
          "page_number": "118",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP34",
          "title": "Recent Beam Dynamics Studies for the SCL Demo of RISP",
          "authors": [
            "H. Jin",
            "I.S. Hong",
            "J.-H. Jang",
            "IBS",
            "Daejeon",
            "Republic of Korea",
            "The Rare Isotope Science Project (RISP) has been developed the RAON accelerator to accelerate heavy ion and rare isotope beams for the various kinds of science programs. In the RAON accelerator",
            "the beams created by a superconducting electron cyclotron resonance ion source (ECR-IS) will be accelerated by the Radio Frequency Quadrupole (RFQ) after passing through the Low Energy Beam Transport (LEBT) section. These accelerated beams will pass the Medium Energy Beam Transport (MEBT) section for the beam matching and be re-accelerated by the superconducting linac (SCL) for the higher beam energy. Prior to the construction of the RAON accelerator",
            "the performance of each component of LEBT",
            "RFQ",
            "MEBT and SCL should be examined for the efficient mass production. Accordingly",
            "we have been constructing the test facility",
            "which is named SCL demo",
            "since 2015. First beam test with an oxygen beam will be carried out at the end of 2016 and the next test with a bismuth beam will be performed in 2017. In this paper",
            "we will present the beam dynamics studies with the recent lattice design of the SCL demo and describe the simulations results with the oxygen and bismuth beams."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp34_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp34.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp34_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP34",
          "page_number": "122",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP35",
          "title": "Four-Dimension Transverse Phase-Space Distribution Measured by a Pepper-Pot Emittance Meter",
          "authors": [
            "T. Nagatomo",
            "O. Kamigaito",
            "M. Kase",
            "T. Nakagawa",
            "RIKEN Nishina Center",
            "Wako",
            "Japan",
            "NSCL",
            "East Lansing",
            "Michigan",
            "USA",
            "Cockcroft Institute",
            "Warrington",
            "Cheshire",
            "United Kingdom",
            "Four-dimensional (4-D) transverse emittance of the highly charged heavy ion beam extracted from ECR ion source is invariant under linear 4-D symplectic operation. Thus",
            "it is essential quantity to improve the beam quality. Measurement of the 4-D phase-space distribution provides quantitative and essential information to improve the efficiency of beam transport. We have developed an on-line pepper-pot-type emittance meter",
            "which is a suitable device to obtain the 4-D phase-space distribution from an image of beamlets passing through the well-aligned pinholes. The emittance meter consists of a thin metal plate with a pinhole array",
            "which is translated along the beam axis",
            "and an imaging screen (P46) with a MCP. We optimized the analysis procedure to obtain the distribution so that the elapsed time of the process was shortened as less than 1 second",
            "and which was enough short for on-line measurements. We will discuss the quality of the obtained 4-D distribution by comparing it with the one obtained from a simulation. Further",
            "we will also discuss how the gas pressure of LEBT affects the 4-D distribution to establish to improve the beam brightness."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp35_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp35.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp35_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP35",
          "page_number": "125",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": true
        },
        {
          "paper_id": "WEPP40",
          "title": "Fast Sputtering Measurement Studies using Uranium with the NSCL ECR Ion Sources",
          "authors": [
            "D.E. Neben",
            "J. Fogleman",
            "A.N. Pham",
            "S. Renteria",
            "L. Tobos",
            "NSCL",
            "East Lansing",
            "Michigan",
            "USA",
            "LBNL",
            "Berkeley",
            "California",
            "USA",
            "FRIB",
            "East Lansing",
            "Michigan",
            "USA",
            "MSU",
            "East Lansing",
            "Michigan",
            "USA",
            "Michigan State University",
            "East Lansing",
            "Michigan",
            "USA",
            "*R. Vondrasek",
            "et. Al.",
            "Rev. Sci. Instrum. 73",
            "548 (2002)  **T. Ropponen",
            "et. Al.",
            "Proceedings of"
          ],
          "institutions": [
            "Funding: Michigan State University and the National Science Foundation: NSF Award Number PHY-1415462",
            "Existing heavy ion facilities such as the National Superconducting Cyclotron Laboratory (NSCL) at Michigan State University rely on Electron Cyclotron Resonance (ECR) ion sources as injectors of highly charged ion beams. Long ion confinement times are necessary to produce dense populations of highly charged ions because of steadily decreasing ionization cross sections with increasing charge state. To further understand ion extraction and confinement we are using a fast sputtering technique first developed at Argonne National Laboratory [1] to introduce a small amount of uranium metal into the plasma at a well-defined time. In addition we utilize an axial x-ray apparatus [2] to characterize the hot electron plasma population via its bremsstrahlung emission."
          ],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp40_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp40.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp40_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP40",
          "page_number": "129",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP41",
          "title": "Measurement of Microwave Frequencies Emitted by Instabilities of ECRIS Plasma with Waveguide Filters and Microwave Sensitive Diodes",
          "authors": [
            "J. Orpana",
            "T. Kalvas",
            "H. A. Koivisto",
            "R.J. Kronholm",
            "J.P. Laulainen",
            "O.A. Tarvainenpresenter",
            "JYFL",
            "Jyväskylä",
            "Finland",
            "I. Izotov",
            "D. Mansfeld",
            "V. Skalyga",
            "IAP/RAS",
            "Nizhny Novgorod",
            "Russia",
            "Periodic emission of strong microwave bursts at certain frequencies is a characteristic feature of kinetic instabilities in ECRIS plasmas. Precise measurement of the temporally evolving microwave frequency spectra requires a high bandwidth oscilloscope",
            "which can make the experiments prohibitively expensive to conduct. An alternative low-cost method to study the microwave emission in narrow frequency bands is to apply band-pass waveguide filters and microwave sensitive diodes. The microwave emission from the plasma of the JYFL 14 GHz ECRIS has been studied with both methods. The results of the experiments are compared and their interpretation is discussed. It is demonstrated that the method based on filters and diodes can provide useful information about the microwave emission spectra induced by electron cyclotron instabilities."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp41_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp41.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp41_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP41",
          "page_number": "134",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "WEPP42",
          "title": "Investigation of 2.45 GHz Microwave Radiated Argon Plasma under Magnetized Condition",
          "authors": [
            "C. Mallick",
            "M. Bandyopadhyay",
            "R.K. Kumarpresenter",
            "S.V. Tewari",
            "Institute for Plasma Research",
            "Bhat",
            "Gandhinagar",
            "India"
          ],
          "institutions": [
            "Funding: Institute for plasma research"
          ],
          "abstract": "Compact microwave discharged ECRIS is one of the most popular devices for space propulsion and material processing .This work models microwave plasma coupling in 2D axis symmetric and investigates plasma parameters and modified electric field in plasma environment. A microwave field of the order of 1.3 x105 V/m is obtained at the center of plasma chamber cavity for an input microwave power of 500W. Microwave radiated plasma has a maximum density of 9.04 x1016 / m3 after some microwave periods (0.01s).The steady state peak electron temperature is around 3eV under 1 mbar pressure of argon gas. Most of power deposition takes place on the ECR surface which is the 875G contour resonating with the electron frequency. Steady state argon plasma results show that beyond critical plasma density of 7.4x1016 / m3 most of the microwave power is deposited at the plasma edge. reference for this paper ※ https://doi.org/10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp42_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp42.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp42_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP42",
          "page_number": "138",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 16,
      "scrape_time": "2025-10-10 17:27:59"
    },
    {
      "session_info": {
        "id": "THAO",
        "name": "THAO - Status reports and new development IV",
        "url": "https://proceedings.jacow.org/ecris2016/html/thao.htm"
      },
      "papers": [
        {
          "paper_id": "THAO01",
          "title": "Recent production of intense high charge ion beams with VENUS",
          "authors": [
            "D. Xie",
            "J.Y. Benitez",
            "C.M. Lyneis",
            "D.S. Todd",
            "LBNL",
            "Berkeley",
            "California",
            "USA",
            "IMP/CAS",
            "Lanzhou",
            "People's Republic of China",
            "Several modifications have been made to the VENUS to enhance its performance at high microwave power and bring its performance closer to the levels predicted by scaling laws for 28 GHz operation. Two of these modifications improved its tolerance for operation at microwave power up to 10 kW. The cooling scheme on the plasma wall was improved to eliminate damage caused by localized electron heating. Similarly the extraction electrode was redesigned to transport away the electron heating more effectively. The third modification reduced the waveguide diameter",
            "which launches the 28 GHz power into the plasma chamber. The source now runs efficiently at 10 kW of injected power with a more favorable magnetic field configuration. The production of intense highly charged ion beams with VENUS has been substantially enhanced. It has produced a number of record CW beams: 4.5 emA of O6+",
            "0.40 emA of Ar16+ and 0.06 emA of Ar17+ and for the first time the VENUS has produced more than 1 emA of Ar12+ and O7+. Source tuning is currently underway to explore the potential of VENUS and the overall improved source performance will be presented."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/thao01_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/thao01.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/thao01_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-THAO01",
          "page_number": "142",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THAO02",
          "title": "Development Status of 28 GHz Superconducting ECR Ion Source for the KBSI Accelerator",
          "authors": [
            "S. Choi",
            "J. Bahng",
            "J.G. Hong",
            "S.J. Kim",
            "B.S. Lee",
            "J.W. Ok",
            "J.Y. Park",
            "M. Won",
            "J.H. Yoon",
            "Korea Basic Science Institute",
            "Busan",
            "Republic of Korea",
            "A 28 GHz superconducting ECR ion source has been developed as an injector apparatus for heavy ion accelerator of KBSI. The final goal of accelerated ion beam was aimed to generate fast neutrons with the proton target by p(Li",
            "n)Be reaction under inverse kinematics scheme. In 2014",
            "most of parts for ECR ion source was developed and assembled. We have made the first ECR plasma generation and ion beam extraction",
            "which was reported in 2014. For optimizing the operational issues of ECR ion source",
            "we carried out various experiments with respect to several species of ion beam. Recently",
            "we have encountered to maintain the cryogenics for superconudcting magnet due to the operating time of cryocooler and compressor. We modified three parts during maintanance: (1) installation of iron pole in the hexapole magnet to enhance the radial magnetic field",
            "(2)new recondensation device to increase the efficiency of the liquid helium liquification",
            "(3)bias disk modification for better beam extraction. We will present the current status and further modificaion effect on the 28 GHz superconducting ECR ion source of KBSI."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/thao02_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/ecris2016/papers/thao02.pdf",
          "poster_url": "https://proceedings.jacow.org/ecris2016/posters/thao02_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-THAO02",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 2,
      "scrape_time": "2025-10-10 17:28:02"
    }
  ],
  "all_papers": [
    {
      "paper_id": "MOAO01",
      "title": "Scaling Laws in Electron Cyclotron Resonance Ion Sources",
      "authors": [
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "In the last 43 years",
        "the performance of high charge state ECRIS has improved dramatically as a result of improvements to the magnetic field confinement",
        "increases in the microwave heating frequency and techniques to stabilize the plasma at high densities. For example",
        "in 1973 15 eμA of O6+ was produced in an ECRIS and now it is possible to produce as much as 4500 eμA. In this paper the parameters and performance of ECRIS are reviewed and compared to empirical scaling laws* to see what can be expected when fourth generation ECRIS begin to operate.",
        "* Geller",
        "Richard. Electron cyclotron resonance ion sources and ECR plasmas. CRC Press",
        "1996",
        "p 395"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moao01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moao01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moao01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOAO01",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOBO01",
      "title": "FECRAL - a 45 GHz Fourth Generation ECR Ion Source and Its Technical Challenge",
      "authors": [
        "H.W. Zhao",
        "L.T. Sun",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "A 45 GHz superconducting ECR ion source FECRAL (a Fourth generation ECR ion source with Advanced design in Lanzhou) is going to be built in the next few years as a key technology R&D of HIAF facility. HIAF injector of a superconducting heavy ion linac requests the ion source of delivering 50 pμA of 238U35+ pulsed beam and 25 pμA of 238U35+ CW beam. This presentation will present preliminary technical-design of FECRAL ECR ion source including magnetic field configuration produced by a Nb3Sn superconducting magnet with 6.5 Tesla axial mirror field and 3.5 Tesla sextupole field on the plasma chamber inner wall",
        "20 kW@45 GHz microwave coupling system and beam transport line. Obviously",
        "to build a 45 GHz FECRAL ECR ion source",
        "there will be many technical challenges",
        "such as engineering and fabrication of the Nb3Sn superconducting magnet with 12 Tesla maximum magnetic field on the conductor",
        "cryogenic system of the magnet",
        "efficient coupling of 45 GHz microwave power",
        "intense beam extraction and transmission to achieve good beam quality",
        "integration of the FECRAL ion source system and analyzing beam line at a high voltage platform."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mobo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mobo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mobo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOBO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOBO02",
      "title": "Possible Optimizations of Existing Magnet Structures for the Next Generation of ECRIS",
      "authors": [
        "D. Xie",
        "G.L. Sabbi",
        "D.S. Todd",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Constructing a minimum-B structure with higher magnetic fields is the prerequisite for the next generation of Electron Cyclotron Resonance Ion Sources (ECRIS): ion sources that will operate at substantially higher heating frequencies than those currently in use. There are three leading candidates of Nb3Sn coil structures for use in future ECRISs: a Mixed Axial and Radial field System (MARS) that merges the sextupole racetrack coils and partial end-solenoids into an exotic closed-loop-coil; a classical Sextupole-In-Solenoids design; and a Solenoids-In-Sextupole configuration. Focusing on efficient magnetic field generation",
        "this article briefly reviews the advantages and disadvantages of each of these magnet structures. Though Sextupole-In-Solenoids and Solenoids-In-Sextupole magnetic structures using NbTi conductor have been validated by current ECRISs",
        "improvements of these magnet structures remain possible. Possible optimizations to the two existing magnet structures",
        "such as using a non-conventional sextupole magnet consisting of either V-bend or skew racetrack coils",
        "are discussed. The development status of a MARS NbTi magnet at LBNL for a new ECRIS will be also presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mobo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mobo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mobo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOBO02",
      "page_number": "5",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOBO03",
      "title": "Current Status of a SC-ECRIS of the RAON Accelerator.",
      "authors": [
        "Y.H. Kim",
        "T. Hashimoto",
        "J. Heo",
        "H. Ishiyama",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "Raon is the heavy ion accelerator being built in Korea. It contains 3rd generation SC-ECRIS which uses 28GHz/18GHz microwave power to extract a heavy ion beam. We prepared and installed beam focusing devices and beam diagnostic devices to characterize the ion source. Now the ion source is in beam commissioning status after maintenance activities. After beam commissioning with oxygen beam",
        "a metal ion beam will be extracted at the end of this year using sputtering method."
      ],
      "institutions": [
        "Funding: This work was supported by the Rare Isotope Science Project funded by Ministry of Science, ICT and Future Planning (MSIP) and the National Research Foundation (NRF) of the Republic of Korea"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mobo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mobo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mobo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOBO03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOBO04",
      "title": "Recent Developments of RIKEN 28 GHz SC-ECRIS",
      "authors": [
        "Y. Higurashi",
        "H. Haba",
        "M. Kidera",
        "T. Nakagawa",
        "J. Ohnishi",
        "K. Ozeki",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "In the past two years",
        "we tried to improve the performance of the RIKEN 28GHz SC-ECRIS for production of intense U ion beam. Usually",
        "we used the sputtering method to produce U ion beam. Last year",
        "we produced ~200e μA of U35+ at the injected RF power of ~2.6kW",
        "when slightly adding the U vapor with high temperature oven. For RIKEN RIBF experiment",
        "we produced ~110 e μA of U35+ beam with sputtering method longer than one month without break. In this case",
        "we surly need very stable beam to increase the transmission efficiency in the accelerators and avoid the any damage of the components of the accelerator due to the high power beam. In this contribution",
        "we will report the beam intensity of highly charged U ions as a function of various parameters (magnetic field strength",
        "RF power",
        "sputtering voltage etc.) and the effect of these parameters on the beam stability in detail. We also present the experience of the long term operation of the ion source for the RIKEN RIBF experiments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mobo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mobo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mobo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOBO04",
      "page_number": "10",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCO01",
      "title": "Innovative Schemes of Plasma Heating for Future Multiply-Charged Ions Sources: Modeling and Experimental Investigation",
      "authors": [
        "D. Mascali",
        "C. Altana",
        "G. Castropresenter",
        "L. Celona",
        "S. Gammino",
        "O. Leonardi",
        "M. Mazzaglia",
        "D. Nicolosi",
        "R. Reitano",
        "F.P. Romano",
        "G. Sorbello",
        "G. Torrisi",
        "INFN/LNS",
        "Catania",
        "Italy",
        "M. Mazzaglia",
        "R. Reitano",
        "Universita Degli Studi Di Catania",
        "Catania",
        "Italy",
        "IBAM-CNR",
        "Catania",
        "Italy",
        "University of Catania",
        "Catania",
        "Italy",
        "The application of plasma heating methods alternative to the direct Electron Cyclotron Resonance coupling",
        "such as the Electron Bernstein Waves (EBW) heating",
        "is already a reality in large-size thermonuclear reactors. These plasma waves give the unique opportunity to largely overcome the cutoff density. EBW heating in compact traps such as ECRIS devices is still a challenge",
        "requiring advanced modelling and innovative diagnostics. At Istituto Nazionale di Fisica Nucleare-Laboratori Nazionali del Sud (INFN-LNS)",
        "the off-ECR heating (driven by Bernstein waves) has produced a highly overdense plasma. Interferometric measurements say the electron density has overcome by a factor ten the cutoff density at 3.76 GHz. More advanced schemes of wave launching have been designed and implemented on the new test-bench called Flexible Plasma Trap",
        "operating up to 7 GHz-0.5 T",
        "in ﬂat/simple mirror/beach magnetic conﬁguration. The paper will give an overview about modal-conversion investigation by a theoretical and experimental point of view",
        "including the description of the diagnostics developed to detect plasma emitted radiation in the RF",
        "optical",
        "soft-X and hard-X-ray domains."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moco01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moco01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moco01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOCO01",
      "page_number": "14",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCO02",
      "title": "Broadband Microwave Emission Spectrum Associated With Kinetic Instabilities in ECR Plasmas",
      "authors": [
        "I. Izotov",
        "D. Mansfeld",
        "V. Skalyga",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "I. Izotov",
        "V. Skalyga",
        "UNN",
        "Nizhny Novgorod",
        "Russia",
        "T. Kalvas",
        "H. A. Koivisto",
        "J. Komppula",
        "R.J. Kronholm",
        "J.P. Laulainen",
        "O.A. Tarvainen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "ECRISs are susceptible to kinetic instabilities due to resonance heating mechanism forming an anisotropic electron velocity distribution function. Well-known and frequently observed extracted ion beam current oscillations in case of high heating power and/or low magnetic field gradient are proven to be caused by the instabilities of cyclotron type leading to a notable reduction of highly-charged ion beam intensities. It has been shown recently that heating power level and magnetic field gradient affect the spectrum of microwave emission of plasma related to cyclotron instabilities",
        "being in the frequency range of 8-14 Ghz. More detailed study of microwave emission spectrum of ECR plasma conducted with an improved setup is presented in this work. It was found that frequencies of microwaves emitted by the plasma can be far beyond the primary heating frequency (14 GHz) and up to 25 GHz. Moreover",
        "a threshold transition from periodic pulsed emission to a CW emission has been observed in the experiment for the first time",
        "as was predicted theoretically*. The transition occurs at certain threshold levels of heating microwave power and magnetic field gradient.",
        "*A.G. Shalashov et all",
        "JETP Letters",
        "2006",
        "Vol. 84",
        "No. 6",
        "pp. 314-319 (2006)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moco02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moco02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moco02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOCO02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOCO03",
      "title": "Cavity Tuning Experiments with the JYFL 14 GHz ECRIS",
      "authors": [
        "O.A. Tarvainen",
        "T. Kalvas",
        "H. A. Koivisto",
        "R.J. Kronholm",
        "J.P. Laulainen",
        "J. Orpana",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "I. Izotov",
        "D. Mansfeld",
        "V. Skalyga",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "CERN",
        "Geneva",
        "Switzerland",
        "Experimental results showing the effect of cavity tuning on oxygen beam currents extracted from the AECR-type JYFL 14 GHz ECRIS are reported. The microwave-plasma coupling properties of the ion source were adjusted by inserting a conducting tuner stub through the injection plug",
        "thus changing the dimensions of the plasma chamber and affecting the cavity properties of the system. The beam currents of high charge state ions were observed to vary up to some tens of percent depending on the tuner position and the microwave frequency."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moco03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moco03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moco03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOCO03",
      "page_number": "18",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCO04",
      "title": "Recent Bremsstrahlung Measurements from the Superconducting Electron Cyclotron Resonance Ion Source VENUS",
      "authors": [
        "J.Y. Benitez",
        "C.M. Lyneis",
        "L. Phair",
        "D.S. Todd",
        "D. Xie",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Axial bremsstrahlung from the superconducting Electron Cyclotron Resonance ion source VENUS have been systematically measured as a function of RF heating frequency",
        "and the axial and radial field strengths. The work focuses on bremsstrahlung with energies greater than 10 keV to extract the spectral temperature Ts. The three axial coils and the radial coils in the superconducting VENUS can all be set independently and have a large dynamic range",
        "which makes it possible to decouple Bmin and Bgrad and study their effects on the bremsstrahlung independently. With typical pressure and RF power levels",
        "the measurements show that Ts depends approximately linearly on Bmin and is not correlated with the ∇BECR",
        "the magnetic field mirror ratios or the RF frequency. These results are important for the next generation of ECR ion sources",
        "which are designed to operate at frequencies above 40 GHz and significantly higher magnetic fields where bremsstrahlung is expected to cause a significant cryogenic heat load and increase the radiation shielding requirements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moco04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moco04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moco04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOCO04",
      "page_number": "23",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MODO01",
      "title": "Structural Information on the ECR Plasma by X-ray Imaging",
      "authors": [
        "R. Rácz",
        "S. Biri",
        "ATOMKI",
        "Debrecen",
        "Hungary",
        "C. Caliri",
        "G. Castro",
        "S. Gammino",
        "D. Mascali",
        "L. Neri",
        "F.P. Romano",
        "INFN/LNS",
        "Catania",
        "Italy",
        "DU",
        "Debrecen",
        "Hungary",
        "IBAM-CNR",
        "Catania",
        "Italy",
        "Precise knowledge on the density distribution of the Electron Cyclotron Resonance Ion Source plasma is needed by several reasons: i) in order to possibly improve the quality parameters of the extracted ion beam (emittance",
        "brightness) strongly linked to the plasma structure",
        "ii) to correctly investigate the recently observed plasma instabilities and/or the implementation of alternative heating methods (e.g. modal conversion) iii) in order to improve the general microwave-to-plasma coupling efficiency",
        "in view of a microwave-absorption oriented design of future ECRIS. The non-destructive spectroscopic diagnostic methods give information always corresponding to an integration over the whole plasma volume. X-ray imaging by pin-hole camera can partly overcome this limitation. We performed volumetric and space resolved X-ray measurements at the ATOMKI ECRIS operated at lower frequencies than usual. The experimental setup in detail and the methods how the working parameters were selected will be shown. The integrated and photon-counting analyses of the collected plasma images show a strong effect of the frequency and magnetic field on the plasma structure and local energy content."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/modo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/modo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/modo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MODO01",
      "page_number": "30",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MODO02",
      "title": "Angular Distributions of Bremsstrahlung X-ray Emission from ECR Plasma",
      "authors": [
        "Korea University",
        "Seoul",
        "Republic of Korea",
        "High-energy X-ray emission beyond a critical energy from ECR heating has long attracted much attention and its nature has yet been unsolved. We have measured bremsstrahlung X-rays from the 28-GHz ECR ion source at Busan Center of KBSI. The gamma-ray detection system consists of three NaI(Tl) scintillation detectors placed 55 cm radially from the beam axis at the extraction port",
        "and a NaI(Tl) scintillation detector for monitoring X-ray intensity at the beam axis. Bremsstrahlung X-ray energy spectra were measured at 9 azimuthal angular regions at RF power of 1kW. We also measured bremsstrahlung X-rays by exchanging detector positions for studying systematic uncertainties. Detection efficiency and shielding effect are taken into account for extracting real X-ray energy spectra from measured ones",
        "based on Geant4 simulation results. Preliminary results on the azimuthal angular distributions of bremsstrahlung X-rays with respect to energy region will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/modo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/modo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/modo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MODO02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOEO01",
      "title": "Microwave Power Injection Schemes Study at IMP with Superconducting ECR Ion Source SECRAL",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "The performance of electron cyclotron resonance ion sources (ECRIS) is critically dependent on the resonant absorption efficiency of microwave power. Over-sized round waveguide with a diameter about Ø33.0 mm excited in the TE01 mode has been typically adopted for microwave coupling to the ECR plasma with the superconducting ECRIS operated at 24 or 28 GHz",
        "such as SECRAL and VENUS. However",
        "it should be realized that this is not necessarily the optimal scheme for microwave power injection. In order to study the impact of different microwave power distribution on ECRH efficiency and especially the production of highly charged ions",
        "a set of compact and efficient mode convertors and mode transitions with different diameters applicable to 24 GHz SECRAL has been designed",
        "fabricated and tested. SECRAL has been tested with the different microwave power injection schemes for the production intense highly charged heavy ion beams of Ar and Xe. A general comparison of the performance working at the different injection schemes with SECRAL will be given",
        "and a preliminary analysis will be made in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moeo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moeo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moeo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOEO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOFO01",
      "title": "",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mofo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mofo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mofo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOFO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOFO02",
      "title": "Comparison of Residual Background in an ECR and an EBIS",
      "authors": [
        "R.C. Vondrasek",
        "C. Dickerson",
        "P.N. Ostroumov",
        "R.C. Pardo",
        "R.H. Scott",
        "G.P. Zinkann",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "An ECR charge breeder was developed some years ago as part of the Californium Rare Ion Breeder Upgrade (CARIBU) program at Argonne National Laboratory. The charge breeding efficiency and high charge state production of the source were at the forefront of ECR charge breeders",
        "but its overall performance as part of the accelerator system was limited by a pervasive stable ion background. Steps were taken to reduce the level of background contamination but met with limited success. As such",
        "the ECR charge breeder was decommissioned in late 2015 and replaced with an EBIS charge breeder. The EBIS has demonstrated good breeding efficiency in an off-line installation",
        "but the critical attribute of stable ion background has only begun to be characterized. We will present a comparison of the background levels from these two devices when coupled to the accelerator complex as well as possible solutions for background reduction in ECR charge breeders.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Funding: This work was supported by the U.S. Department of Energy, Office of Nuclear Physics, under Contract No. DE-AC02-06CH11357 and used resources of ANL ATLAS facility, an Office of Science User Facility"
      ],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mofo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mofo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mofo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOFO02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOFO03",
      "title": "Simulations of the ECR-based Charge Breeding Process at INFN: Status and Perspectives",
      "authors": [
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "D. Mascali",
        "L. Neri",
        "G. Torrisi",
        "INFN/LNS",
        "Catania",
        "Italy",
        "Since 2012",
        "the INFN ion source group has been undertaking an intense activity on numerical modelling",
        "in the European context of the EMILIE Project until 2014. The work concerns the study of the two main aspects influencing the performances of an ECR-based charge breeder: on one hand",
        "the interaction of the injected 1+ beam with the ECR plasma; on the other hand",
        "the energy coupling to plasma electrons by the microwave field set-up inside the plasma chamber. The first aspect has been addressed by developing a numerical code in a Matlab environment",
        "able to reproduce the capture and thermalization of an ion beam by the ECR plasma. Equations describing the process have been implemented trough the Langevin formalism",
        "including a plasma model of increasing complexity. The second aspect has been studied with the interplay between the 3D solver COMSOL Multiphysics and Matlab",
        "describing the plasma through its fully 3D dielectric permittivity tensor. This paper describes the state-of-the-art of the work on both the fronts: it will show an overview of the beam-plasma interaction",
        "offering some hints for the optimization of already existing devices or for the design of new ones."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/mofo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/mofo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/mofo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOFO03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUAO01",
      "title": "The Proton Source for the European Spallation Source (PS-ESS): Installation and Commissioning at INFN-LNS",
      "authors": [
        "L. Celona",
        "L. Allegra",
        "A. Amato",
        "G. Calabrese",
        "A.C. Caruso",
        "G. Castro",
        "F. Chines",
        "G. Gallo",
        "S. Gammino",
        "O. Leonardi",
        "A. Longhitano",
        "G. Manno",
        "S. Marletta",
        "D. Mascali",
        "A. Massara",
        "A. Maugeri",
        "M. Mazzaglia",
        "L. Neri",
        "S. Passarello",
        "G. Pastore",
        "A. Seminara",
        "A. Spartà",
        "G. Torrisi",
        "S. Vinciguerra",
        "INFN/LNS",
        "Catania",
        "Italy",
        "S. Di Martino",
        "P. Nicotra",
        "Si.A.Tel SRL",
        "Catania",
        "Italy",
        "A 2.45 GHz ' 0.1 T microwave discharge Proton Source has been designed and assembled at INFN-LNS for the European Spallation Source (PS-ESS) in order to produce pulsed beams of protons up to 74 mA nominal current",
        "at 75 keV of energy",
        "with a transverse emittance containing 99 % of the nominal proton current below 2.25 π mm mrad and a beam stability of ± 2 %. The challenging performances of the machine have triggered specific studies on the maximization of the proton fraction inside the plasma and of the overall plasma density",
        "including dedicated modelling of the wave-to-plasma interaction and ionization processes. The plasma conditioning phase started in July and excellent RF to plasma coupling",
        "more than 99.5% is evident since the beginning. Reflected power fluctuation less than 0.05 % was measured providing a great starting point to reach the beam stability requested by the ESS accelerator."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tuao01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tuao01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tuao01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUAO01",
      "page_number": "39",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUAO02",
      "title": "The Development of ECR Ion Source for Medical Applications",
      "authors": [
        "B.S. Lee",
        "J. Bahng",
        "S. Choi",
        "J.G. Hong",
        "H.G. Kim",
        "S.J. Kim",
        "J.W. Ok",
        "J.Y. Park",
        "M. Won",
        "J.H. Yoon",
        "Korea Basic Science Institute",
        "Busan",
        "Republic of Korea",
        "Kyungpook National University",
        "Daegu",
        "Republic of Korea",
        "Since 2009",
        "the ECR ion source for material researcher was developed at Korea Basic Science Institute (KBSI). From our efforts during 7 years",
        "The service of 28 GHz ECR ion source of KBSI was succeeded in this year. Our new project is started based on developed skills for 28GHz ECR ion source. In this year",
        "we are started proton ECR ion source with high current for medical application that is Boron Neutron Capture Therapy (BNCT)",
        "Proton Therapy. The first step is development of proton ECR ion source with beam current of 23mA. In this paper",
        "we will suggest design results and manufacturing status of proton ECR ion source for BNCT. Also",
        "we will introduce the future plan about development of compact proton therapy and will report plans for feasibility study."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tuao02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tuao02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tuao02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUAO02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUAO03",
      "title": "Injector Characteristics of 100-MeV Proton Linac at KOMAC",
      "authors": [
        "KAERI",
        "Daejon",
        "Republic of Korea",
        "Y.-S. Cho",
        "D.I. Kim",
        "H.-J. Kwon",
        "S.P. Yun",
        "Korea Atomic Energy Research Institute (KAERI)",
        "Gyeongbuk",
        "Republic of Korea",
        "A 100-MeV proton linac at Korea Multi-purpose Accelerator Complex (KOMAC) is under operation and has provided high-intensity proton beam to users since 2013. The injector part of the linac consists of a microwave ion source with 50 keV extraction energy",
        "two solenoids for beam matching to the 3-MeV RFQ and a vacuum box including beam diagnostics and vacuum pump. The design current of the injector is 20 mA with 0.2 pi.mmmrad transverse normalized rms emittance. The injector was characterized through emittance measurement and solenoids operating parameter sweep. The details of the injector characteristics will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tuao03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tuao03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tuao03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUAO03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUAO04",
      "title": "SECRAL II Ion Source Development and the First Commissioning at 28 GHz",
      "authors": [
        "L.T. Sun",
        "X. Fang",
        "Y.C. Feng",
        "J.W. Guo",
        "H.Y. Ma",
        "L.Z. Ma",
        "Y.M. Ma",
        "Z. Shen",
        "W. Wu",
        "T. Yang",
        "Y. Yang",
        "W.H. Zhang",
        "X.Z. Zhang",
        "B. Zhao",
        "H.W. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "SECRAL II ion source has been successfully designed and developed at IMP. This ion source is a 3rd generation ECR machine optimized for the operation at 28 GHz. As a second superconducting ECR ion source developed at IMP with the identical coldmass design as SECRAL ion source",
        "which has the sextupole coils external to the axial solenoids",
        "the magnet performance is more robust according the training test. After a short time beam test at 18 GHz",
        "SECRAL II has been commissioned at 28 GHz",
        "and some preliminary results have been achieved with high charge state ion beam production. This paper will present the magnet design and test results. The first beam at 28 GHz will also be given."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tuao04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tuao04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tuao04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUAO04",
      "page_number": "43",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUAO05",
      "title": "First Plasma of the PHOENIX V3 ECR Ion Source",
      "authors": [
        "T. Thuillier",
        "J. Angot",
        "L. Bonny",
        "J. Jacob",
        "T. Lamy",
        "P. Sole",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "J.L. Flambard",
        "L. Maunoury",
        "GANIL",
        "Caen",
        "France",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "IN2P3 IPNL",
        "Villeurbanne",
        "France"
      ],
      "institutions": [],
      "abstract": "PHOENIX V3 is an upgrade of the PHOENIX V2 ECR ion source granted by the European CRISP project. This new ECRIS features a larger plasma chamber and a re-duced vacuum pressure under operation. The V3 source will replace the V2 one on the",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tuao05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tuao05.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tuao05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUAO05",
      "page_number": "48",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUBO02",
      "title": "Numerical Studies of the Gas-Mixing Effect in ECRIS",
      "authors": [
        "V. Mironov",
        "S.L. Bogomolov",
        "A.E. Bondarchenko",
        "A.A. Efremov",
        "V.N. Loginov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The particle-in-cell MCC code NAM-ECRIS is used to simulate the ECRIS plasma sustained in a mixture of Kr with O2",
        "N2",
        "Ne and He. The model assumes that ions are electrostatically confined in ECR zone by a dip in the plasma potential. Gain in the extracted krypton ion currents is seen for the highest charge states; the gain is maximized when oxygen is used as the mixing gas. A special feature of oxygen is that most of singly charged oxygen ions are produced after dissociative ionization of oxygen molecules with the large kinetic energy release of around 5 eV per ion. Increased loss rate of energetic lowly charged ions of the mixing element requires building up of the retarding potential barrier close to ECR surface to equilibrate electron and ion losses out of the plasma. In the mixed plasmas",
        "the barrier value is large (~1 V) compared to the pure Kr plasma (~0.01 V)",
        "with the longer confinement times of krypton ions and with the much higher ion temperatures."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tubo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tubo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tubo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUBO02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUBO03",
      "title": "Simulations of High Intensity Low Mass Ion Sources",
      "authors": [
        "R. de Guiran",
        "A. Chancé",
        "R. Gobin",
        "O. Tuske",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "At CEA/Saclay",
        "in the framework of the HPPA devel-opment",
        "the Department of Accelerators",
        "Cryogenics and Magnetism (SACM) has designed and built low mass",
        "high intensity ECRIS for more than 15 years. Such skills are illustrated by the construction of injectors (sources and low energy beam transport lines) for several national and international projects such as"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/tubo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/tubo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/tubo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-TUBO03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEAO01",
      "title": "Recent Developments with the GTS-LHC ECR Ion Source at CERN",
      "authors": [
        "V. Toivanen",
        "G. Bellodi",
        "C. Fichera",
        "D. Küchler",
        "A.M. Lombardi",
        "M. Maintrot",
        "A.I. Michet",
        "M. O'Neil",
        "S. Sadovich",
        "F.J.C. Wenander",
        "CERN",
        "Geneva",
        "Switzerland",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "Linac3 is the first link in the chain of accelerators providing highly charged heavy ion beams for the CERN experimental program. The beams",
        "predominantly lead",
        "are produced with the GTS-LHC 14.5 GHz Electron Cyclotron Resonance (ECR) ion source",
        "operated in afterglow mode. In the framework of the LHC Injector Upgrade program (LIU)",
        "several activities have been carried out to improve the GTS-LHC and Linac3 performance",
        "in terms of delivered beam current. The extraction region of the GTS-LHC has been upgraded with redesigned apertures and the addition of an einzel lens",
        "yielding improved Linac3 output. Also",
        "a series of measurements has been performed to study the effects of two-frequency heating on the performance of the GTS-LHC. A Traveling Wave Tube Amplifier (TWTA) with variable frequency and pulse pattern was utilized as a secondary microwave source. The two-frequency effect commonly reported with CW operation of ECR ion sources boosting high charge state ion production was also observed in afterglow mode. Lastly",
        "for studies of metal ion beam production",
        "a dedicated test stand has been assembled to characterize the GTS-LHC resistively heated miniature oven performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO01",
      "page_number": "50",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAO02",
      "title": "Preliminary Design of a Hybrid Ion Source for 7Li+3 Generation",
      "authors": [
        "S.X. Peng",
        "J.E. Chen",
        "Z.Y. Guo",
        "H.T. Ren",
        "J.M. Wen",
        "W.B. Wu",
        "Y. Xu",
        "A.L. Zhang",
        "J.F. Zhang",
        "T. Zhang",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Graduate University",
        "Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "University of Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "To provide a novel directional fast-neutron via the p(7Li",
        "n) reaction for prompt fission γ -ray (PFG) spectra study",
        "a hybrid 7Li3+ ion source was designed at Peking University(PKU). It is a combination of a 6.5 GHz ECR (electron cyclotron resonance) ion source and a hot surface ionization source. The surface ionization source locates inside the ECR chamber and a 500 V bias voltage is set between the hot surface and the ECR chamber. Lithium vapor from an oven is guided into the surface source through a heating transfer pipe. Li+ ions generated on the hot surface will be extracted from the surface source and striped into Li3+ with the electron impact ionization. To avoid the lithium vapor attaching on the wall of the discharge chamber",
        "the whole plasma chamber will be heated up to 300 °C. A four-electrode extraction system will be used for Li3+ ion beam formation. Details will be presented in the paper.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEAO03",
      "title": "Practical Comparison of Two-Frequency Heating Phenomena in Different ECR Ion Sources",
      "authors": [
        "NIRS",
        "Chiba-shi",
        "Japan",
        "S. Biri",
        "R. Rácz",
        "ATOMKI",
        "Debrecen",
        "Hungary",
        "Osaka University",
        "Graduate School of Engineering",
        "Osaka",
        "Japan",
        "National Institute of Radiological Sciences",
        "Chiba",
        "Japan",
        "AEC",
        "Chiba",
        "Japan",
        "In order to improve highly-charged ion production from the 18GHz NIRS-HEC ECRIS",
        "our group has studied the mixture of two microwaves of which the frequencies were close together each. Our conclusion was that when an additional microwave is added to the primary microwave",
        "the plasma stability is improved. The output current of the highly charged ion beam was proportional to the total power of both microwaves. The dependence on the additional frequency showed the fine structure. Since this structure depended on the magnetic field",
        "vacuum pressure",
        "and so on",
        "the precise frequency adjustment for maximum output was required under each condition. Our interest is whether the above-mentioned phenomenon can be demonstrated using a different ion source where the two frequencies are even far from each other. We installed a 17.75-18.25 GHz microwave system in addition to the 14.3 GHz klystron amplifier of the ATOMKI ECRIS. Argon output currents at various values of the microwave power and frequency were studied. The dependence on the total power shows the similar tendency as at NIRS. The dependence on the additional frequency also shows the fine structure. Detailed data will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO03",
      "page_number": "55",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAO04",
      "title": "Installation and Commissioning of the 18 GHz High Temperature Superconducting Ecr Ion Source and Low Energy Beam Transport  System on a 200 kV High Voltage Platform",
      "authors": [
        "G.O. Rodrigues",
        "R. Ahuja",
        "P. Barua",
        "D. Kanjilal",
        "A. Kothari",
        "A. Malyadri",
        "A. Mandal",
        "Y.M. Mathur",
        "U.K. Rao",
        "A. Sharma",
        "IUAC",
        "New Delhi",
        "India",
        "The High Current Injector programme at the Inter University Accelerator Centre is presently in various stages of installation and commissioning. The main objective of the high current injector is to provide higher beam intensities (A/q ~ 6) over a wider mass range as compared to the presently operating 15UD",
        "16MV Tandem-LINAC combination. The injector is based on a reasonably high performing ECR ion source called PKDELIS. The 18 GHz high temperature superconducting ECR ion source",
        "PKDELIS and the low energy beam transport system has been recently installed and commissioned on a 200 kV high voltage platform. The details of the installation and commissioning results will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO04",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEAO05",
      "title": "SMASHI and MeLA ECR Ion Source at NFRI: One for Highly-Charged Ions and the Other for High Current Metal Ions",
      "authors": [
        "H.J. You",
        "W.I. Choo",
        "S.O. Jang",
        "NFRI",
        "Daejon",
        "Republic of Korea",
        "There are two type of ECR ion sources at NFRI. One is SMASHI(Superconducting Multi-Application Source of Highly-charged Ions)",
        "and the other MeLA(Magnet-embedded Lisitano Antenna) ion source. They are developed for highly-charged ions(HCI) and high current metal ions(HCMI) generation",
        "respectively. Firstly",
        "SMASHI is a 18 GHz superconducting ECR ion source",
        "which will be dedicated for future application of HCIs and matter interaction. SMASHI is featuring a liquid helium-free SC magnet having fast-excitation capability(>0.1 A/s) of coils",
        "two frequency heating(18",
        "18+Δ GHz)",
        "remotely-positional variable gap extraction system",
        "and two diagnostic ports for the extraction region. Secondly",
        "MeLA ion source is a scalable high current(>10 mA) metal ion source. the MeLA*",
        "originally developed for a large-area microwave ECR plasma source for semiconductor processing by our group",
        "is able to generate high density uniform ECR plasma by a waveguide directly-coupled and permanent Magnet-embedded Lisitano Antenna. In this presentation we describe design aspects of the sources in detail",
        "and then their performance results are provided.",
        "*H. J. You",
        "S. O. Jang",
        "Y. H. Jung",
        "and B. J. Lee",
        "\"Microwave Antenna for Generating Plasma\"",
        "U.S. Patent 8 648 534",
        "February",
        "2014."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao05.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEBO01",
      "title": "An ECRIS Facility for Investigating Nuclear Reactions in Astrophysical Plasmas",
      "authors": [
        "M. Kreller",
        "C. Baumgart",
        "G. Zschornack",
        "DREEBIT",
        "Dresden",
        "Germany",
        "K. Czerski",
        "M. Kaczmarski",
        "N. Targosz-Ślęczka",
        "University of Szczecin",
        "Institute of Physics",
        "Szczecin",
        "Poland",
        "A. Huke",
        "G. Ruprecht",
        "D. Weißbach",
        "IFK Berlin",
        "Berlin",
        "Germany",
        "Technische Universität Dresden",
        "Institut für Angewandte Physik",
        "Dresden",
        "Germany",
        "Nuclear reactions at low energies can be strongly enhanced due to screening of the Coulomb barrier by the surrounding electrons. This effect was studied for the deuteron fusion reactions taking place in metallic environments as a model for dense astrophysical plasmas. Experimentally determined screening energies corresponding to the reduction of the Coulomb barrier height are much larger than the theoretical predictions. One possible explanation is the excitation of a hypothetical threshold resonance in the 4He nucleus. As the energy dependence of the resonant reaction cross section differs to that of the electron screening effect",
        "one can distinguish between both processes expanding measurements down to the deuteron energies of 1keV. A novel ion accelerator was implemented at the University of Szczecin. Ions are produced by a Dresden ECRIS-2.45M as a high-current",
        "low-Z ion source. The following beam line is designed to work on HV potential for decelerating ions below a kinetic energy of 1keV and combined with a ultra-high vacuum target chamber to reduce target impurities. The ion irradiation facility as well as first experimental results are described and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/webo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/webo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/webo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEBO01",
      "page_number": "59",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBO02",
      "title": "Design of Compact ECR Ion Source for C5+ Production",
      "authors": [
        "M. Muramatsu",
        "Y. Iwata",
        "A. Kitagawa",
        "E. Noda",
        "M. Sekiguchi",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "K. Fukushima",
        "T. Sasano",
        "T. Suzuki",
        "K. Takahashi",
        "AEC",
        "Chiba",
        "Japan",
        "H. Murata",
        "T. Takahashi",
        "SHI",
        "Kanagawa",
        "Japan",
        "The Heavy Ion Medical Accelerator in Chiba (HIMAC) was constructed as the first medical dedicated heavy ion accelerator facility at National Institute of Radiological Sciences (NIRS). Over 9000 cancer patients have been treated with 140-430 MeV/u carbon beams since 1994. Compact ECR ion source with all permanent magnets",
        "named Kei2",
        "was developed for production of C4+ ions for medical treatment at NIRS. A compact ECR ion source for Gunma University (Gunma University Heavy Ion Medical Center: GHMC)",
        "Saga carbon-ion radiotherapy (Saga Heavy Ion Medical Accelerator in Tosu: SAGA HIMAT) and Kanagawa carbon-ion radiotherapy (Ion-beam Radiation Oncology Center in Kanagawa: i-ROCK) facility has been operated for medical use. It is a copy of the Kei2 which was developed by NIRS. In order to reduce operation cost of the injector for next designed carbon ion facility",
        "we start design of new compact ECR ion source for C5+ production. Some dependence (mirror field",
        "microwave power and frequency) were checked for optimal parameter of C5+ production at 18 GHz NIRS-HEC source. Results of experiments and specification of new compact source are described in this presentation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/webo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/webo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/webo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEBO02",
      "page_number": "64",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBO03",
      "title": "In-situ Observation of Phase Transformation During Ion Beam Irradiation",
      "authors": [
        "KBSI",
        "Deajeon",
        "Republic of Korea",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "The new method uses reflection high-energy electron diffraction (RHEED) to collect electron diffraction patterns while performing ion irradiation. We use a 50 keV electron beam impinging on a crystalline substrate at grazing incidence. In this presentation",
        "we report on ion irradiations of a single crystal. Irradiations were performed using 100 keV Ar ions at room temperature. Before the single crystal was bombarded with Ar ions",
        "a diffraction pattern with strong diffraction maxima was observed. During the Ar ion irradiation",
        "electron diffraction patterns were collected from the near surface region. The initially strong diffraction patterns gradually faded in intensity until no diffraction spots were visible on the phosphor screen at the fluence of 6~8x1014 ions/cm2. To confirm the presence of the ion-induced amorphization in the near surface region",
        "we used grazing incidence X-ray diffraction and electron diffraction in a transmission electron microscope. Both characterization techniques corroborated the RHEED in-situ measurement",
        "showing the existence of an amorphous region produced by the 100 keV Ar ions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/webo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/webo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/webo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEBO03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WECO01",
      "title": "Intermediate Commissioning Results of the Required 140 mA/100 keV CW D+ ECR Injector of LIPAc, IFMIF's Prototype",
      "authors": [
        "B. Bolzon",
        "N. Chauvin",
        "R. Gobin",
        "F. Senée",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "P.-Y. Beauvais",
        "H. Dzitko",
        "F4E",
        "Germany",
        "L. Bellan",
        "M. Comunian",
        "E. Fagotti",
        "A. Pisent",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "Univ. degli Studi di Padova",
        "Padova",
        "Italy",
        "P. Cara",
        "R. Heidinger",
        "Fusion for Energy",
        "Garching",
        "Germany",
        "CEA/DSM/IRFU",
        "France",
        "R. Ichimiya",
        "A. Ihara",
        "A. Kasugai",
        "T. Kitano",
        "M. Komata",
        "K. Kondo",
        "K. Sakamoto",
        "T. Shinya",
        "M. Sugimoto",
        "QST",
        "Aomori",
        "Japan",
        "J. Knaster",
        "A. Marqueta",
        "K. Nishiyama",
        "Y. Okumura",
        "G. Pruneri",
        "F. Scantamburlo",
        "IFMIF/EVEDA",
        "Rokkasho",
        "Japan"
      ],
      "institutions": [
        "The LIPAc accelerator aims to operate in Rokkasho Fusion Institute a 125 mA/CW deuteron beam at 9 MeV to validate the concept of IFMIF's accelerators that will operate in CW 125 mA at 40 MeV. The 2.45 GHz ECR injector developed by CEA-Saclay is designed to deliver 140 mA/100 keV CW D+ beam with 99% D+ fraction ratio. Its LEBT relies on a dual solenoid focusing system to transport and match the beam into the RFQ. The normalized RMS emittance at the RFQ injection cone is required to be within 0.25π mm·mrad to allow 96% transmission through the 9.81 m long RFQ. An equal perveance H+ beam of half current and half energy as nominal with D+ is used to avoid activation during commissioning. The injector commissioning at Rokkasho is divided into three phases to characterize the emittance between the two solenoids of the LEBT (A1) and just downstream the RFQ injection cone (A2) and the extraction system of the source (A3). Phase A1 has been achieved and phase A2 continues in 2016 in order to reach the required beam parameters and to match the beam into the RFQ. This paper reports the commissioning results of phase A1 and the intermediate ones of phase A2 for H+ and D+ beams."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weco01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weco01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weco01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WECO01",
      "page_number": "67",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECO02",
      "title": "Development of a Compact High Intensity Ion Source for Light Ions   at CEA-Saclay",
      "authors": [
        "O. Delferrière",
        "Y. Gauthier",
        "R. Gobin",
        "O. Tuske",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "CEA/DRF/IRFU",
        "Gif-sur-Yvette",
        "France",
        "During the past 5 years",
        "a R&D program has been launched to improve the beam quality of ECR 2.45 GHz high intensity light ion sources for high power accelerators. The main goal was to minimize the divergence and emittance growth of intense beams due to the space charge as early as possible on the low energy transfer line for a better injection in the second stage of acceleration (RFQ). This has been achieved by reducing the length of the extraction system",
        "to be able to put the first solenoid as close as possible to the extraction aperture. This was performed with the ALISES concept (Advanced Light Ion Source Extraction System). Encouraging results have been obtained in 2012 but with limitations due to Penning discharges in the accelerating column. Taking advantages of ALISES geometry",
        "intensive studies and simulations have been undertaken to eliminate the discharge phenomena. An Innovative and compact source geometry has been found and the source has been fabricated. This new prototype and its performances will be described",
        "as well as magnetic field configuration studies and its influence on the extracted beam."
      ],
      "institutions": [],
      "abstract": "This source developed at Saclay is under patent number FR 15 56871 and this patent is pending",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weco02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weco02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weco02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WECO02",
      "page_number": "73",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECO03",
      "title": "Transverse Coupling of Ion Beams From an RCR Ion Source",
      "authors": [
        "Y. Yang",
        "Y. Liu",
        "L.T. Sun",
        "Y.J. Yuan",
        "H.W. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "ECR ion source beam quality will deteriorate under the influence of beam transverse coupling and high-order magnetic field aberration. Ion beams from an ECR ion source will experience a descending axial magnetic field at the extraction region",
        "leading to a strong transverse coupling to the extracted beam",
        "with projection emittance growth both in horizontal and vertical and two eigen emittances separation. On the other hand",
        "sextupole field in the ECR and the sextupole component in the analyzing dipole can also degrade the beam quality by resulting in beam distortion. Proper adjusting of the extraction field strength of the ion source and the pre-focusing solenoid field can help to weaken the correlation in the inter-plane phase spaces and reduce the projection emittances. Another approach to improve the beam quality is to compensate for the high-order magnetic fields. This paper presents the property of beam coupling in the transverse phase space by analytical theory and simulations. Some experimental results are also presented and discussed. In addition",
        "a high-order compensation scheme is displayed",
        "whose feasibility has been verified by preliminary tests with SECRAL at IMP."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weco03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weco03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weco03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WECO03",
      "page_number": "76",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECO04",
      "title": "Progress of an Intense Ion Source and Low Energy Beam Transport System for  Jinping Underground Nuclear Astrophysics Experiments",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Jinping Underground Laboratory for Nuclear Astrophysics (JUNA) will take the advantage of the ultra low background and high current accelerator facility to study directly a number of important reactions at stellar energies",
        "such as 25Mg(p",
        "γ)26Al",
        "19F(p",
        "α)16O",
        "13C(α",
        "n)16O",
        "and 12C(α",
        "γ)16O reactions. As a key component of high current accelerator facility",
        "the performance of ion source has a very important effect on the beam quality. In order to produce the requested 10 emA H+",
        "10 emA He+ and 2.5 emA He2+ at the exit of low energy beam transport (LEBT) line",
        "an intense 2.45GHz ECR ion source operated at the maximum energy of 50keV/q will be developed for JUNA project. The ion beam extracted by a 3-electrode extraction system passes through a low energy beam transport system",
        "which is composed of identical solenoids and dipole magnet",
        "into the entrance of acceleration tube (AT). In this paper",
        "the main technique risks",
        "physics design of the ion source and LEBT will be discussed. The progress of the ion source and LEBT",
        "such as mechanical design",
        "magnetic elements",
        "beam diagnostic units of LEBT and development of ion source will be introduced.",
        "1. Q. Wu. Z.M. Zhang",
        "L.T. Sun et al. Rev. Sci. Instrum. 85.02A703. (2014)  2. ZHANG Meng",
        "PENG Shi-Xiang; SONG Zhi-Zhong etal. Chinese physics C",
        "2008 Vol. 32 (S1): 220-222"
      ],
      "institutions": [
        "Funding: This work is supported by the equipment research and development project of Chinese Academy of Sciences and National Natural Science Foundation of China under grant NO.11221064."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weco04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weco04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weco04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WECO04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPP01",
      "title": "High Intensity Beam Production at CEA/Saclay For The IPHI Project",
      "authors": [
        "R. Gobin",
        "D. Bogard",
        "O. Delferrière",
        "M. Desmons",
        "Y. Gauthier",
        "F. Harrault",
        "F. Peauger",
        "G. Perreu",
        "B. Pottin",
        "Y. Sauce",
        "J. Schwindling",
        "F. Senée",
        "O. Tuske",
        "D. Uriot",
        "T.V. Vacher",
        "CEA/DRF/IRFU",
        "Gif-sur-Yvette",
        "France",
        "CEA/Saclay is involved in high power proton accelerators for long years. This activity started in the 90's",
        "with the development of the SILHI source which routinely produces tens mA of proton beam. Several industrial difficulties led to a very long IPHI RFQ construction process. The 352 MHz RFQ conditioning is presently in progress. Before the completion of the conditioning in CW mode",
        "tests with pulsed proton beam have been decided. As a consequence",
        "the SILHI source recently produced very short H+ beam pulses in order to allow the first IPHI beam acceleration. Such very short pulses",
        "in the range of few hundred microseconds",
        "allowed analyzing the beam loading of the RFQ cavity as well as conditioning the middle energy diagnostic. This article will focus on the source parameters and beam characteristics in the low energy beam line leading to the best RFQ transmission."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP01",
      "page_number": "83",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP02",
      "title": "Commissioning of the High Intensity Proton Injector of the Facility for Anti Proton and Ion Research at CEA-Saclay",
      "authors": [
        "O. Tuske",
        "N. Chauvin",
        "O. Delferrière",
        "Y. Gauthier",
        "P. Girardot",
        "N. Misiara",
        "Y. Sauce",
        "F. Senée",
        "C. Simon",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "F. Ameil",
        "R. Berezov",
        "J. Fils",
        "R. Hollinger",
        "GSI",
        "Darmstadt",
        "Germany",
        "CEA/DSM/IRFU",
        "France",
        "The Facility for Antiproton and Ion Research (FAIR) located at GSI (Darmstadt) in Germany addresses several fields of physics research within a single installation. One of the contribution of Irfu/SACM at CEA-Saclay to the FAIR linear proton accelerator concerns the development and construction of the ion source and the low energy line. The 2.45 GHz microwave ion source will deliver a 100 mA H+ beam pulsed at 4 Hz with an energy of 95 keV. A low energy beam transport (LEBT) line based on a dual solenoids focusing scheme allows the injection of the proton beam into the radio frequency quadrupole (RFQ) within an acceptance of 0.3π mm.mrad (norm.",
        "rms). An electrostatic chopper system located between the second solenoid and the RFQ is used to cut the beam macro pulse from the source to inject 36 μs long beam pulses into the RFQ. This article reports the finalization of the installation of the injector with the detail of dedicated diagnostics",
        "the first beam measurements and gives a planning of the different commissioning phases"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP02",
      "page_number": "86",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP03",
      "title": "Never Run Your ECR Ion Source with Argon in Afterglow for 6 Months!",
      "authors": [
        "D. Küchler",
        "A.I. Michet",
        "J.A.F. Somoza",
        "V. Toivanen",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [
        "The fixed target experiment NA61 in the North Area of the SPS at CERN studies phase transitions in strongly interacting matter using the primary beams available from the CERN accelerator complex (protons and lead ions). In order to explore a wider range of energies and densities a primary argon beam was requested for the physics run in 2015. The GTS-LHC ECR ion source was running for many months during 2013 and 2014 to study the source behaviour and to setup the accelerator chain with argon ions. This paper reports the long term effects of the argon operation on the GTS-LHC ion source and the Low Energy Beam Transport (LEBT). Heavy sputtering inside the source caused a degradation of the plasma chamber and metal coating of insulators inside the beam extraction system. Iron ions could be found in the extracted beam. Also the pumping performance of ion getter pumps in the LEBT degraded significantly. Additional preventive maintenance was necessary to be able to run for long periods without risking serious damage to the ion source."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP03",
      "page_number": "89",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP05",
      "title": "Status Report on Metallic Beam Production at GANIL/SPIRAL 2",
      "authors": [
        "C. Barue",
        "O. Bajeat",
        "J.L. Flambard",
        "R. Frigot",
        "P. Jardin",
        "N. Lechartier",
        "F. Lemagnen",
        "L. Maunoury",
        "V. Metayer",
        "O. Osmond",
        "GANIL",
        "Caen",
        "France",
        "IN2P3 IPNL",
        "Villeurbanne",
        "France",
        "P. Sole",
        "T. Thuillier",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "Primary ion beams from metallic elements are routinely produced at GANIL using ECR4 and ECR4M 'room temperature' ECR ion sources. Ionization efficiency measurements",
        "partially presented in the past",
        "are summarized in this report together with updated and new results obtained with Cd",
        "Mo and Ta. Preliminary results for Ni and Ca obtained with the room temperature Phoenix-V2 ECR ion source",
        "under commissioning for SPIRAL 2",
        "are also included. These ionization efficiencies are compared according to the production methods: oven",
        "sputtering",
        "MIVOC",
        "gaseous compounds. The presently SPIRAL 2 heavy ion injector designed for ions Q/A=1/3 shows clear limitations in terms of intensity for metallic ions with mass higher than 60 (intensity < 1 pμA). In order to choose the best ion source for a future Q/A=1/6",
        "1/7 injector",
        "best world results have been compiled for different existing 'room temperature' and superconducting ECR ion sources."
      ],
      "institutions": [],
      "abstract": "# christophe.barue@ganil.fr reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp05.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP05",
      "page_number": "92",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP08",
      "title": "Development of Compact H+ ECR Ion Source with Pulse Gas Valve",
      "authors": [
        "Y. Fuwa",
        "Y. Iwashita",
        "H. Tongu",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "QST",
        "Tokai",
        "Japan",
        "QST/Takasaki",
        "Takasaki",
        "Japan"
      ],
      "institutions": [],
      "abstract": "Compact H+ ECR Ion Source using permanent magnets is under development. A pulsed gas injection system achieved by a piezo gas valve can reduce the gas load to a vacuum evacuation system. This feature is suitable when the ion source is closely located to an RFQ. Results of a performance test will be presented. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp08.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP08",
      "page_number": "98",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP09",
      "title": "Development of a New Compact 5.8 GHz ECR Ion Source",
      "authors": [
        "J. Angot",
        "L. Bonny",
        "J. Jacob",
        "T. Lamy",
        "P. Sole",
        "T. Thuillier",
        "F. Villa",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "Polygon Physics",
        "Grenoble",
        "France",
        "LPSC is developing a new 5.8 GHz compact ion source to produce low charge state ion beams and study their capture in the PHOENIX charge breeder. The source was designed to meet criteria like stability",
        "compactness and low cost. It is mounted on a DN200 iso K flange and is fully under vaccum during operation. The technology brings modularity to ease the development. It can operate up to 60 kV. The plasma is heated by a 100W solid state amplifier. The ECRIS produces 1 mA of H+ beam with 20W of HF and low charge state Argon ions. It was tested under several microwave and magnetic configurations on a test bench equipped with a mass spectrometer and diagnostics. Given its excellent performances",
        "this source is being installed to drive the accelerator based neutron source",
        "GENEPI 2",
        "at LPSC. The developments of the source together with the results of the experiments will be presented. Future plans for this ion source will also be discussed. This work was supported by the ERA-NET NuPNET in the frame of the EMILIE project."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp09.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP09",
      "page_number": "101",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP14",
      "title": "A New ECRIS Installation at the Argonne Tandem Linac Accelerator System",
      "authors": [
        "R.H. Scott",
        "C. Dickerson",
        "R.C. Pardo",
        "R.C. Vondrasek",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "An existing all permanent magnet ECRIS",
        "the BIE100 [1]",
        "will be installed at ATLAS to recover operational flexibility by providing ATLAS with a second ECR ion source for stable beams. For years ATLAS has operated with two ECR ion sources",
        "ECR2 and the ECR charge breeder as well as a tandem electrostatic injector. The tandem was retired in 2013 and in mid-2015 the ECR charge breeder was decommissioned to make room for a new Electron Beam Ion Source exclusively for charge breeding radioactive ion beams. This left the facility with a single ECR source for virtually all stable ion beam pro-duction. Design",
        "installation plans and anticipated opera-tional parameters are discussed."
      ],
      "institutions": [
        "Funding: This work was supported by the U.S. Department of Energy, Office of Nuclear Physics, under Contract No. DE-AC02-06CH11357 and used resources of ANL's ATLAS facility, an Office of Science User Facility"
      ],
      "abstract": "*Dan Z. Xie, Rev. Sci. Instrum. 73, 531 (2002); http://dx.doi.org/10.1063/1.1429320 reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp14.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP14",
      "page_number": "106",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP15",
      "title": "Design, Construction and Commissioning of the New Superconducting Ion Source AISHa",
      "authors": [
        "L. Celona",
        "G. Castro",
        "F. Chines",
        "G. Ciavola",
        "G. Costa",
        "S. Gammino",
        "O. Leonardi",
        "S. Marletta",
        "D. Mascali",
        "F. Noto",
        "G. Pastore",
        "G. Torrisi",
        "S. Vinciguerra",
        "INFN/LNS",
        "Catania",
        "Italy",
        "At INFN-LNS a new superconducting ECRIS named AISHa has been designed with the aim to provide highly charged ion beams with low ripple",
        "high stability and high reproducibility",
        "also fulfilling the needs of hospital installations (e.g. L-He free",
        "easy to use",
        "etc.). It is a hybrid ion source based on a permanent magnet hexapole providing 1.3 T on plasma chamber walls",
        "and four superconducting coils for the axial trapping. The axial magnetic system is very flexible in order to minimize the hot electron component and to optimize the ECR heating by controlling the field gradients and the resonance length. The design of the hexapole aimed to minimize the demagnetization due to SC coils. The magnetic system measurement confirmed the effectiveness of the adopted solutions. Innovative solutions have been also implemented as it concerns the RF system design. It will permit to operate in single/double frequency mode",
        "supported by variable frequency high power klystron generators",
        "thus exploiting at the same time the FTE Frequency Tuning Effect and the Two Frequency Heating. The source has been assembled at the INFN-LNS site and the commissioning phase already started."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp15.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP15",
      "page_number": "109",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP18",
      "title": "Innovative Mechanical Solutions for the Design of the High Intensity Proton Injector for the European Spallation Source",
      "authors": [
        "G. Gallo",
        "L. Allegra",
        "L. Celonapresenter",
        "S. Gammino",
        "D. Mascali",
        "L. Neri",
        "G. Torrisi",
        "INFN/LNS",
        "Catania",
        "Italy",
        "The design of the 2.45 GHz",
        "0.1 T microwave discharge Proton Source for the European Spallation Source (PS-ESS) has required on-purpose solutions in order to maximize the beam brightness",
        "keeping a very high reliability figure. The mitigation of maintenance issues has been the main guideline through the design phase to maximize the MTBF and minimize the MTTR. The mechanical design has been based on advanced solutions in order to reduce as much as possible the venting time for the plasma chamber",
        "to facilitate the replacement of extraction electrodes and/or plasma chamber",
        "and to simplify any after-maintenance alignment procedure. The paper will describe the strategy which has driven the design phase",
        "the solutions adopted to fulfil the project goals and the results of the assembly phase recently concluded at INFN-LNS with successful first plasma."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp18.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP18",
      "page_number": "112",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP22",
      "title": "Versatile High Power Microwave System for Frequency Tuning  of the CAPRICE ECRIS",
      "authors": [
        "F. Maimone",
        "M. Endermann",
        "R. Lang",
        "J. Mäder",
        "P.T. Patchakui",
        "P. Spädtke",
        "K. Tinschert",
        "GSI",
        "Darmstadt",
        "Germany",
        "In the last years it was demonstrated that the variation of the microwave frequency generating the plasma inside ECR Ion Sources (ECRISs) allows to enhance the extracted current of highly charged ions both for gaseous and for metallic elements. In order to use this technique for the performance improvement of the CAPRICE-type ECRIS installed at the High Charge State Injector (HLI) of GSI",
        "the microwave system has been modified. The new arrangement includes - besides the existing Klystron high power amplifier (HPA; max. 2 kW at 14.5 GHz) - two combined Traveling Wave Tube Amplifiers (TWTA) covering a bandwidth of 12.75-14.5 GHz",
        "providing 750 W output power each",
        "which are driven by one or two synthesizer tuners. The new system has been used during the routine operation of the ECRIS for production of different ion beams to be injected into the RFQ of the HLI. A detailed description of the main components of the new microwave system is presented",
        "and the achieved characteristics of ion beam production using different microwave frequencies are described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp22.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP22",
      "page_number": "115",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP32",
      "title": "Magnetic Field Design for 2.45 GHz Negative Hydrogen PMECRIS Chamber using FEM Simulation",
      "authors": [
        "C. Mallick",
        "M. Bandyopadhyay",
        "R.K. Kumarpresenter",
        "S.V. Tewari",
        "Institute for Plasma Research",
        "Bhat",
        "Gandhinagar",
        "India"
      ],
      "institutions": [
        "Funding: Institute For Plasma Research"
      ],
      "abstract": "Negative hydrogen ECRIS plasma is confined by NdFeB permanent magnet antenna around cylindrical cavity wall. Measured axial and radial magnetic field is benchmarked with the simulated data. Four axially magnetized ring magnets of remanance flux density of 1.17T is simulated using bounded current ampere's law technique. Gradient of radial and axial magnetic flux density is calculated to estimate lighter ions leaking out of the plasma wall sheath region. The peak values of radial magnetic field gradient between plasma sheath region and cavity outer wall surface increases from 0.1x107 A/m2 to -0.2x107 A/m2 respectively. Axial magnetic field gradient along inner ECR chamber wall increases from -2.1x107 A/m2 to 2.5x107 A/m2 .ECR contour dimensions of 875 Gauss which corresponds to microwave plasma resonating frequency of 2.45GHz is of thickness ~1mm and having major and minor radius of 30mm and 28mm respectively. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp32.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP32",
      "page_number": "118",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP34",
      "title": "Recent Beam Dynamics Studies for the SCL Demo of RISP",
      "authors": [
        "H. Jin",
        "I.S. Hong",
        "J.-H. Jang",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "The Rare Isotope Science Project (RISP) has been developed the RAON accelerator to accelerate heavy ion and rare isotope beams for the various kinds of science programs. In the RAON accelerator",
        "the beams created by a superconducting electron cyclotron resonance ion source (ECR-IS) will be accelerated by the Radio Frequency Quadrupole (RFQ) after passing through the Low Energy Beam Transport (LEBT) section. These accelerated beams will pass the Medium Energy Beam Transport (MEBT) section for the beam matching and be re-accelerated by the superconducting linac (SCL) for the higher beam energy. Prior to the construction of the RAON accelerator",
        "the performance of each component of LEBT",
        "RFQ",
        "MEBT and SCL should be examined for the efficient mass production. Accordingly",
        "we have been constructing the test facility",
        "which is named SCL demo",
        "since 2015. First beam test with an oxygen beam will be carried out at the end of 2016 and the next test with a bismuth beam will be performed in 2017. In this paper",
        "we will present the beam dynamics studies with the recent lattice design of the SCL demo and describe the simulations results with the oxygen and bismuth beams."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp34.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP34",
      "page_number": "122",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP35",
      "title": "Four-Dimension Transverse Phase-Space Distribution Measured by a Pepper-Pot Emittance Meter",
      "authors": [
        "T. Nagatomo",
        "O. Kamigaito",
        "M. Kase",
        "T. Nakagawa",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "NSCL",
        "East Lansing",
        "Michigan",
        "USA",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Four-dimensional (4-D) transverse emittance of the highly charged heavy ion beam extracted from ECR ion source is invariant under linear 4-D symplectic operation. Thus",
        "it is essential quantity to improve the beam quality. Measurement of the 4-D phase-space distribution provides quantitative and essential information to improve the efficiency of beam transport. We have developed an on-line pepper-pot-type emittance meter",
        "which is a suitable device to obtain the 4-D phase-space distribution from an image of beamlets passing through the well-aligned pinholes. The emittance meter consists of a thin metal plate with a pinhole array",
        "which is translated along the beam axis",
        "and an imaging screen (P46) with a MCP. We optimized the analysis procedure to obtain the distribution so that the elapsed time of the process was shortened as less than 1 second",
        "and which was enough short for on-line measurements. We will discuss the quality of the obtained 4-D distribution by comparing it with the one obtained from a simulation. Further",
        "we will also discuss how the gas pressure of LEBT affects the 4-D distribution to establish to improve the beam brightness."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp35.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP35",
      "page_number": "125",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPP40",
      "title": "Fast Sputtering Measurement Studies using Uranium with the NSCL ECR Ion Sources",
      "authors": [
        "D.E. Neben",
        "J. Fogleman",
        "A.N. Pham",
        "S. Renteria",
        "L. Tobos",
        "NSCL",
        "East Lansing",
        "Michigan",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "Michigan State University",
        "East Lansing",
        "Michigan",
        "USA",
        "*R. Vondrasek",
        "et. Al.",
        "Rev. Sci. Instrum. 73",
        "548 (2002)  **T. Ropponen",
        "et. Al.",
        "Proceedings of"
      ],
      "institutions": [
        "Funding: Michigan State University and the National Science Foundation: NSF Award Number PHY-1415462",
        "Existing heavy ion facilities such as the National Superconducting Cyclotron Laboratory (NSCL) at Michigan State University rely on Electron Cyclotron Resonance (ECR) ion sources as injectors of highly charged ion beams. Long ion confinement times are necessary to produce dense populations of highly charged ions because of steadily decreasing ionization cross sections with increasing charge state. To further understand ion extraction and confinement we are using a fast sputtering technique first developed at Argonne National Laboratory [1] to introduce a small amount of uranium metal into the plasma at a well-defined time. In addition we utilize an axial x-ray apparatus [2] to characterize the hot electron plasma population via its bremsstrahlung emission."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp40_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp40.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp40_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP40",
      "page_number": "129",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP41",
      "title": "Measurement of Microwave Frequencies Emitted by Instabilities of ECRIS Plasma with Waveguide Filters and Microwave Sensitive Diodes",
      "authors": [
        "J. Orpana",
        "T. Kalvas",
        "H. A. Koivisto",
        "R.J. Kronholm",
        "J.P. Laulainen",
        "O.A. Tarvainenpresenter",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "I. Izotov",
        "D. Mansfeld",
        "V. Skalyga",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "Periodic emission of strong microwave bursts at certain frequencies is a characteristic feature of kinetic instabilities in ECRIS plasmas. Precise measurement of the temporally evolving microwave frequency spectra requires a high bandwidth oscilloscope",
        "which can make the experiments prohibitively expensive to conduct. An alternative low-cost method to study the microwave emission in narrow frequency bands is to apply band-pass waveguide filters and microwave sensitive diodes. The microwave emission from the plasma of the JYFL 14 GHz ECRIS has been studied with both methods. The results of the experiments are compared and their interpretation is discussed. It is demonstrated that the method based on filters and diodes can provide useful information about the microwave emission spectra induced by electron cyclotron instabilities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp41_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp41.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp41_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP41",
      "page_number": "134",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPP42",
      "title": "Investigation of 2.45 GHz Microwave Radiated Argon Plasma under Magnetized Condition",
      "authors": [
        "C. Mallick",
        "M. Bandyopadhyay",
        "R.K. Kumarpresenter",
        "S.V. Tewari",
        "Institute for Plasma Research",
        "Bhat",
        "Gandhinagar",
        "India"
      ],
      "institutions": [
        "Funding: Institute for plasma research"
      ],
      "abstract": "Compact microwave discharged ECRIS is one of the most popular devices for space propulsion and material processing .This work models microwave plasma coupling in 2D axis symmetric and investigates plasma parameters and modified electric field in plasma environment. A microwave field of the order of 1.3 x105 V/m is obtained at the center of plasma chamber cavity for an input microwave power of 500W. Microwave radiated plasma has a maximum density of 9.04 x1016 / m3 after some microwave periods (0.01s).The steady state peak electron temperature is around 3eV under 1 mbar pressure of argon gas. Most of power deposition takes place on the ECR surface which is the 875G contour resonating with the electron frequency. Steady state argon plasma results show that beyond critical plasma density of 7.4x1016 / m3 most of the microwave power is deposited at the plasma edge. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/wepp42_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/wepp42.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/wepp42_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEPP42",
      "page_number": "138",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAO01",
      "title": "Recent production of intense high charge ion beams with VENUS",
      "authors": [
        "D. Xie",
        "J.Y. Benitez",
        "C.M. Lyneis",
        "D.S. Todd",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Several modifications have been made to the VENUS to enhance its performance at high microwave power and bring its performance closer to the levels predicted by scaling laws for 28 GHz operation. Two of these modifications improved its tolerance for operation at microwave power up to 10 kW. The cooling scheme on the plasma wall was improved to eliminate damage caused by localized electron heating. Similarly the extraction electrode was redesigned to transport away the electron heating more effectively. The third modification reduced the waveguide diameter",
        "which launches the 28 GHz power into the plasma chamber. The source now runs efficiently at 10 kW of injected power with a more favorable magnetic field configuration. The production of intense highly charged ion beams with VENUS has been substantially enhanced. It has produced a number of record CW beams: 4.5 emA of O6+",
        "0.40 emA of Ar16+ and 0.06 emA of Ar17+ and for the first time the VENUS has produced more than 1 emA of Ar12+ and O7+. Source tuning is currently underway to explore the potential of VENUS and the overall improved source performance will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/thao01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/thao01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/thao01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-THAO01",
      "page_number": "142",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAO02",
      "title": "Development Status of 28 GHz Superconducting ECR Ion Source for the KBSI Accelerator",
      "authors": [
        "S. Choi",
        "J. Bahng",
        "J.G. Hong",
        "S.J. Kim",
        "B.S. Lee",
        "J.W. Ok",
        "J.Y. Park",
        "M. Won",
        "J.H. Yoon",
        "Korea Basic Science Institute",
        "Busan",
        "Republic of Korea",
        "A 28 GHz superconducting ECR ion source has been developed as an injector apparatus for heavy ion accelerator of KBSI. The final goal of accelerated ion beam was aimed to generate fast neutrons with the proton target by p(Li",
        "n)Be reaction under inverse kinematics scheme. In 2014",
        "most of parts for ECR ion source was developed and assembled. We have made the first ECR plasma generation and ion beam extraction",
        "which was reported in 2014. For optimizing the operational issues of ECR ion source",
        "we carried out various experiments with respect to several species of ion beam. Recently",
        "we have encountered to maintain the cryogenics for superconudcting magnet due to the operating time of cryocooler and compressor. We modified three parts during maintanance: (1) installation of iron pole in the hexapole magnet to enhance the radial magnetic field",
        "(2)new recondensation device to increase the efficiency of the liquid helium liquification",
        "(3)bias disk modification for better beam extraction. We will present the current status and further modificaion effect on the 28 GHz superconducting ECR ion source of KBSI."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/thao02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/thao02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/thao02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-THAO02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "stats": {
    "total_sessions": 13,
    "total_papers": 52,
    "scrape_time": "2025-10-10 17:28:03"
  }
}