{
  "session_info": {
    "id": "TUMIB",
    "name": "TUMIB - Mini Oral 2",
    "url": "https://proceedings.jacow.org/ICALEPCS2013/html/tumib.htm"
  },
  "papers": [
    {
      "paper_id": "TUMIB01",
      "title": "Using Prince2 and ITIL Practices for Computing Projects and Service Management in a Scientific Installation",
      "authors": [
        "D.F.C. Fernández-Carreiras",
        "G. Cuní",
        "J. Klora",
        "M. Martin",
        "O. Matilla",
        "A. Nardella",
        "V. Prat",
        "A. Pérez Font",
        "D. Salvat",
        "CELLS-ALBA Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "The conscientious project management during the installation is a key factor keeping the schedule and costs in specifications. Methodologies like Prince2 for project management or ITIL best practices for service management",
        "supported by tools like Request Tracker",
        "Redmine or Track",
        "improve the communication between scientists and support groups",
        "speed up the time to respond",
        "and increase the satisfaction and quality perceived by the user. In the same way",
        "during operation",
        "some practices complemented with software tools",
        "may increase substantially the quality of the service with the resources available. This paper describes the use of these processes and methodologies in a scientific installation such as the synchrotron Alba. It also evaluates the strengths and the risks associated to the implementation as well as the achievements and the failures",
        "proposing some improvements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tumib01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tumib01.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tumib01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUMIB01",
      "page_number": "517",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUMIB02",
      "title": "A Control System for the ESRF Synchrotron Radiation Therapy Clinical Trials",
      "authors": [
        "C. Nemoz",
        "P. Berkvens",
        "G. Berruyer",
        "T. Brochard",
        "H. Gonzalez",
        "R. Hino",
        "M. Renier",
        "ESRF",
        "Grenoble",
        "France",
        "Université Joseph Fourier",
        "Saint Martin d'Hères",
        "France",
        "INSERM",
        "Grenoble Institut des Neurosciences",
        "La Tronche",
        "France",
        "The bio-medical beamline of the European Synchrotron Radiation Facility (ESRF) located in Grenoble",
        "France",
        "has recently started the Phase I-II Stereotactic Synchrotron Radiation Therapy (SSRT) clinical trials targeting brain tumours. This very first SSRT protocol consists in a combined therapy where monochromatic X-rays are delivered to the tumour pre-loaded with high Z element. The challenges of this technique are the accurate positioning of the target tumour with respect to the beam and the precision of the dose delivery whilst fully assuring the patient safety. The positioning system used for previous angiography clinical trials has been adapted to this new modality. 3-D imaging is performed for positioning purpose to fit to the treatment planning. The control system of this experiment will be described from the hardware and software point of view with emphasis on the constraints imposed by the Patient Safety System."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tumib02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tumib02.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tumib02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUMIB02",
      "page_number": "521",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUMIB04",
      "title": "Migrating to an EPICS Based Instrument Control System at the ISIS Spallation Neutron Source",
      "authors": [
        "F.A. Akeroyd",
        "K. V. L. Baker",
        "M.J. Clarke",
        "G.D. Howells",
        "D.P. Keymer",
        "K.J. Knowles",
        "C. Moreton-Smith",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Tessella",
        "Abingdon",
        "United Kingdom",
        "The beamline instruments at the ISIS spallation neutron source have been running successfully for many years using an in-house developed control system. The advent of new instruments and the desire for more complex experiments has led to a project being created to determine how best to meet these challenges. Though it would be possible to enhance the existing system",
        "migrating to an EPICS-based system offers many advantages in terms of flexibility",
        "software reuse and the potential for collaboration. While EPICS is well established for accelerator and synchrotron beamline control",
        "is it not currently widely used for neutron instruments",
        "but this is changing. The new control system is being developed to initially run in parallel with the existing system",
        "a first version being scheduled for testing on two newly constructed instruments starting summer 2013. In this paper",
        "we will discuss the design and implementation of the new control system",
        "including how our existing National Instruments LabVIEW controlled equipment was integrated",
        "and issues that we encountered during the migration process."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tumib04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tumib04.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tumib04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUMIB04",
      "page_number": "525",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUMIB05",
      "title": "ANSTO, Australian Synchrotron, Metadata Catalogues and the Australian National Data Service",
      "authors": [
        "N. Hauser",
        "S. Wimalaratne",
        "ANSTO",
        "Menai",
        "Australia",
        "SLSA",
        "Clayton",
        "Australia"
      ],
      "institutions": [
        "Data citation, management and discovery are important to ANSTO, the Australian Synchrotron and the scientists that use them. Gone are the days when raw data is written to a removable media and subsequently lost. The metadata catalogue *MyTardis is being used by both ANSTO and the Australian Synchrotron. Metadata is harvested from the neutron beam and X-ray instruments raw experimental files and catalogued in databases that are local to the facilities. The data is accessible via a web portal. Data policies are applied to embargo data prior to placing data in the public domain. Public domain data is published to the Australian Research Data Commons using the OAI-PMH standard. The Commons is run by the Australian National Data Service (ANDS), who was the project sponsor. The Commons is a web robot friendly site. ANDS also sponsors digital object identifiers (DOI) for deposited datasets, which allows raw data to now be a first class research output, allowing scientists that collect data to gain recognition in the same way as those who publish journal articles. Data is being discovered, cited, reused and collaborations initiated through the Commons."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tumib05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tumib05.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tumib05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUMIB05",
      "page_number": "529",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUMIB06",
      "title": "Development of a Scalable and Flexible Data Logging System Using NoSQL Databases",
      "authors": [
        "M. Kago",
        "A. Yamashita",
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "We have developed a scalable and flexible data logging system for SPring-8 accelerator control. The current SPring-8 data logging system powered by a relational database management system (RDBMS) has been storing log data for 16 years. With the experience",
        "we recognized the lack of RDBMS flexibility on data logging such as little adaptability of data format and data acquisition cycle",
        "complexity in data management and no horizontal scalability. To solve the problem",
        "we chose a combination of two NoSQL databases for the new system; Redis for real time data cache and Apache Cassandra for perpetual archive. Logging data are stored into both database serialized by MessagePack with flexible data format that is not limited to single integer or real value. Apache Cassandra is a scalable and highly available column oriented database",
        "which is suitable for time series logging data. Redis is a very fast on-memory key-value store that complements Cassandra's eventual consistent model. We developed a data logging system with ZeroMQ message and have proved its high performance and reliability in long term evaluation. It will be released for partial control system this summer."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tumib06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tumib06.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tumib06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUMIB06",
      "page_number": "532",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUMIB07",
      "title": "RASHPA: A Data Acquisition Framework for 2D XRays Detectors",
      "authors": [
        "F. Le Mentec",
        "P. Fajardo",
        "C. Herve",
        "A. Homs",
        "T. Le Caer",
        "ESRF",
        "Grenoble",
        "France",
        "ITER Organization",
        "St. Paul lez Durance",
        "France",
        "ESRF research programs",
        "along with the foreseen accelerator sources upgrade",
        "require state-of-the-art instrumentation devices with high data flow acquisition systems. This paper presents RASHPA",
        "a data acquisition framework targeting 2D XRay detectors. By combining a highly configurable multi link PCI Express over cable based data transmission engine and a carefully designed LINUX software stack",
        "RASHPA aims at reaching the performances required by current and future detectors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tumib07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tumib07.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tumib07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUMIB07",
      "page_number": "536",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUMIB08",
      "title": "ITER Contribution to Control System Studio (CSS) Development Effort",
      "authors": [
        "N. Utzel",
        "L. Abadie",
        "F. Di Maio",
        "J.Y. Journeaux",
        "A. Wallander",
        "I. Yonekawa",
        "ITER Organization",
        "St. Paul lez Durance",
        "France",
        "F. Arnaud",
        "G. Darcourt",
        "D. Dequidt",
        "Sopra Group",
        "Aix-en-Provence",
        "France",
        "In 2010",
        "Control System Studio (CSS) was chosen for CODAC - the central control system of ITER - as the development and runtime integrated environment for local control systems. It became quickly necessary to contribute to CSS development effort - after all",
        "CODAC team wants to be sure that the tools that are being used by the seven ITER members all over the world continue to be available and to be improved. In order to integrate CSS main components in its framework",
        "CODAC team needed first to adapt them to its standard platform based on Linux 64-bits and PostgreSQL database. Then",
        "user feedback started to emerge as well as the need for an industrial symbol library to represent pump",
        "valve or electrical breaker states on the operator interface and the requirement to automatically send an email when a new alarm is raised. It also soon became important for CODAC team to be able to publish its contributions quickly and to adapt its own infrastructure for that. This paper describes ITER increasing contribution to the CSS development effort and the future plans to address factory and site acceptance tests of the local control systems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tumib08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tumib08.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tumib08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUMIB08",
      "page_number": "540",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUMIB09",
      "title": "jddd: A Tool for Operators and Experts to Design Control System Panels",
      "authors": [
        "E. Sombrowski",
        "A. Petrosyan",
        "K. Rehlich",
        "W. Schütte",
        "DESY",
        "Hamburg",
        "Germany",
        "jddd",
        "a graphical tool for control system panel design",
        "has been developed at DESY to allow machine operators and experts the design of complex panels. No knowledge of a programming language nor compiling steps are required to generate highly dynamic panels with the jddd editor. After 5 years of development and implementing requirements for DESY-specific accelerator operations",
        "jddd has become mature and is increasingly used at DESY. The focus meanwhile has changed from pure feature development to new tasks as archiving/managing a huge number of control panels",
        "finding panel dependencies",
        "automatic refactoring of panel names",
        "book keeping and evaluation of panel usage and collecting Java exception messages in an automatic manner. Therefore technologies of the existing control system infrastructure like Servlets",
        "JMS",
        "Lucene",
        "SQL",
        "SVN are used. The concepts and technologies to further improve the quality and robustness of the tool are presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tumib09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tumib09.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tumib09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUMIB09",
      "page_number": "544",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUMIB10",
      "title": "Performance Testing of EPICS User Interfaces - an Attempt to Compare the Performance of MEDM, EDM, CSS-BOY,  and EPICS",
      "authors": [
        "R.I. Farnsworth",
        "J.P. Hammonds",
        "B.R. Pausma",
        "C.M. Suarez",
        "ANL",
        "Argonne",
        "USA",
        "A. Rhyder",
        "A. C. Starritt",
        "ASCo",
        "Clayton",
        "Victoria",
        "Australia",
        "Upgrading of the display manger or graphical user interface at EPICS sites reliant on older display technologies",
        "typically MEDM or EDM",
        "requires attention not only to functionality but also performance. For many sites",
        "performance is not an issue - all display managers will update small numbers of process variables at rates exceeding the human ability to discern changes; but for certain applications typically found at larger sites",
        "the ability to respond to updates rates at sub-Hertz frequencies for thousands of process variables is a requirement. This paper describes a series of tests performed on both older display managers – MEDM and EDM – and also the newer display managers CSS-BOY",
        "epicsQT",
        "and CaQtDM. Modestly performing modern hardware is used."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ICALEPCS2013/talks/tumib10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ICALEPCS2013/papers/tumib10.pdf",
      "poster_url": "https://proceedings.jacow.org/ICALEPCS2013/posters/tumib10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2013-TUMIB10",
      "page_number": "547",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 9,
  "scrape_time": "2025-10-10 18:26:19"
}