{
  "session_info": {
    "id": "MOYPLM",
    "name": "MOYPLM - Opening Plenaries",
    "url": "https://proceedings.jacow.org/ipac2019/html/moyplm.htm"
  },
  "papers": [
    {
      "paper_id": "MOYPLM1",
      "title": "Challenges to Higher Beam Power in J-PARC: Achieved Performance and Future Prospects",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "J-PARC is a world leading intensity frontier accelerator facility",
        "consisting of a 400-MeV H− linac",
        "a 3-GeV Rapid Cycling Synchrotron (RCS) and a 30-GeV slow cycling Main Ring synchrotron (MR). The RCS delivered a 500 kW beam (4.2·1013 particles per pulse (ppp)) to the Material and Life science experimental Facility (MLF) in April of 2018",
        "The design power of 1 MW will be delivered in the next few years. Construction of a second target station (2TS) of the MLF with beam power upgraded to 1.5 MW is now under discussion. The MR delivers proton beam to a long-baseline neutrino oscillation experiment",
        "T2K",
        "by fast extraction (FX) and to the hadron experimental facility by slow extraction (SX). For the FX",
        "the maximum beam power is 475 kW and 2.5·1014 ppp",
        "the world highest ppp in synchrotrons",
        "and for the SX 51 kW and 5.5·1013 ppp with an extremely high extraction efficiency of 99.5 %. To achieve 1.3 MW beam power for the neutrino experiment",
        "upgrades to allow operation with a higher repetition rate are planned. The talk will review recent progress of J-PARC facility by highlighting technical challenges toward higher beam power together with future prospects."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/moyplm1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/moyplm1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/moyplm1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-MOYPLM1",
      "page_number": "6",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOYPLM2",
      "title": "SRF Operation at XFEL: Lessons Learned After More Than One Year",
      "authors": [
        "D. Kostin",
        "V. Ayvazyan",
        "J. Branlard",
        "W. Decking",
        "L. Lilje",
        "M. Omet",
        "T. Schnautz",
        "E. Vogel",
        "N. Walker",
        "DESY",
        "Hamburg",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The European XFEL is the largest high-field SRF installation in the world and has now been in operation more than a year. It serves as a \"prototype\" for other facilities being constructed or in the planning stages. Performance of the operation of the SRF system over this period of time and the lessons learned will be discussed.",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/moyplm2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/moyplm2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/moyplm2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-MOYPLM2",
      "page_number": "12",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOYPLM3",
      "title": "Progress with the High Luminosity LHC Project at CERN",
      "authors": [
        "L. Rossi",
        "O.S. Brüning",
        "CERN",
        "Geneva",
        "Switzerland",
        "The High Luminosity LHC (HL-LHC) project aims at upgrading the LHC by increasing the peak luminosity by a factor five",
        "to allow to collect 3000 fb-1 for ATLAS and CMS experiments",
        "each",
        "which is ten times more than what is foreseen in the LHC. The upgrade is based on multiple factors. One factor is doubling the beam current",
        "also thanks to the injector upgrade (LIU) project",
        "and another one is operation in levelling mode. The most critical upgrade is the deploying of a stronger inner quadrupole triplet in the low-beta insertions with more than twice-larger aperture w.r.t. present LHC triplet",
        "thanks to the use of Nb3Sn superconductor",
        "a world first for accelerators",
        "with almost 12 T peak field in the coils. The novel concept of ATS optics allows to utilise the increased aperture efficiently by generating β* values 3 to 4 times below the nominal values of the LHC. We will make use of compact crab cavities for hadrons (also a novelty in accelerators) to allow almost head-on collisions despite the larger crossing angle. We are developing new collimator insertions in the dispersion suppressor region to handle the losses in the cold part of the machine (the beam halo stores 30 MJ) thanks to the use of a few 11 T dipoles based on Nb3Sn technology. We also aim at reducing drastically the impedance contribution of collimators by utilizing new materials and coating techniques. Many other technologies are developed for HL-LHC like new SC links of 100 kA: HL-LHC is critical as a technology turning point for HEP colliders as it is for Physics reach. The technologies developed for HL-LHC",
        "namely (but not only) the high field superconducting magnets",
        "are critical for the post-LHC hadron collider",
        "like a High Energy LHC or the 100 km Future Circular Collider"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/moyplm3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/moyplm3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/moyplm3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-MOYPLM3",
      "page_number": "17",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:04:06"
}