{
  "session_info": {
    "id": "WEVIR",
    "name": "WEVIR - MC5 & MC6 Presentations",
    "url": "https://proceedings.jacow.org/ipac2020/html/wevir.htm"
  },
  "papers": [
    {
      "paper_id": "WEVIR01",
      "title": "Use of Reverse Bending Magnets in MBA Lattices",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Including reverse bending magnets further reduces the equilibrium emittance of multi-bend achromat (MBA) lattices through decoupling of dispersion and horizontal beta function. This coupling is a shortcoming of the classical theoretical minimum emittance (TME) cell preventing it from reaching lowest emittance at realistic",
        "moderate focusing conditions. Rather small deflection angles of the reverse bends",
        "in the order of 10% of the unit cell bending angle",
        "are usually sufficient",
        "and realized through down-feed by displacing the horizontally focusing quadrupoles of the unit cell by a small amount towards the storage ring inside. Reverse bends are indispensable in particular to enable emittance reduction from dipoles with longitudinal field variation",
        "since these require very small dispersion at the central region of highest field strength. In past decades reverse bends were employed occasionally for isochronous lattices or to enhance damping. Now they are becoming an integral component of low emittance MBA lattices.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir01.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR02",
      "title": "Effect of Long Response Time Photocathode Materials on Microbunching Instability in Free Electron Laser Facilities",
      "authors": [
        "S. Bettoni",
        "A. Dax",
        "M. Huppert",
        "M. Pedrozzi",
        "A. Trisorio",
        "C. Vicario",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Microbunching instability may be initiated by any intensity modulation on the bunch at low energy or by shot-noise along the machine. This instability may also be very detrimental in Free Electron Laser (FEL) facilities",
        "because the resulting distortion of the beam phase space can strongly deteriorate the FEL intensity. The Laser Heater",
        "which induces an increase of the beam energy in a controlled way",
        "is used to mitigate this instability. In this paper we propose an alternative or complementary way to reduce the induced energy spread by using a long response time material as photocathode. By choosing a photocathode material with a response time larger than the value corresponding to the maximum amplification of the microbunching instability",
        "the photocathode acts as a low pass filter of the laser profile",
        "reducing in this way one of the possible sources of microbunching instability. The present experience shows that with this approach SwissFEL",
        "the FEL facility in user operation at the Paul Scherrer Institute",
        "efficiently lases without or with a very limited use of the laser heater.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir02.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR03",
      "title": "Microbunch Rotation as an Outcoupling Mechanism for Cavity-based X-Ray Free Electron Lasers",
      "authors": [
        "R.A. Margraf",
        "Z. Huang",
        "Stanford University",
        "Stanford",
        "California",
        "USA",
        "Z. Huang",
        "J.P. MacArthur",
        "G. Marcus",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Electron bunches in an undulator develop periodic density fluctuations",
        "or microbunches",
        "which enable the exponential gain of power in an X-ray free-electron laser (XFEL). For certain applications",
        "one would like to preserve this microbunching structure of the electron bunch as it experiences a dipole kick which bends its trajectory. This process",
        "called microbunch rotation",
        "rotates the microbunches and aligns them perpendicular to the new direction of electron travel. Microbunch rotation was demonstrated experimentally by MacArthur et al. with soft x-rays* and additional unpublished data demonstrated microbunch rotation with hard x-rays. Further investigations into the magnetic lattice used to rotate these microbunches showed that microbunches can be rotated using an achromatic lattice with a small R56",
        "connecting this technique to earlier studies of achromatic bends. Here",
        "we propose and study a practical way to rotate Angstrom-level microbunching as an out-coupling mechanism for the Optical Cavity-Based X-ray FEL (CBXFEL) project at SLAC.",
        "*J. P. MacArthur",
        "A. A. Lutman",
        "J. Krzywinski",
        "and Z. Huang",
        "\"Microbunch Rotation and Coherent Undulator Radiation from a Kicked Electron Beam\"",
        "Physical Review X",
        "vol. 8",
        "no. 4",
        "Nov. 2018."
      ],
      "institutions": [
        "Funding: This work was supported by the Department of Energy, Laboratory Directed Research and Development program at SLAC National Accelerator Laboratory, under contract DE-AC02-76SF00515."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir03.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR03",
      "page_number": "35",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR04",
      "title": "On-Axis Beam Accumulation Based on a Triple-Frequency RF System",
      "authors": [
        "G. Xu",
        "S.C. Jiang",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "Considering the incompatible off-axis injection scheme on the newly constructed light sources",
        "we have proposed a new on-axis accumulation scheme based on the so-called triple-frequency RF system [1]. By means of additional second harmonic cavities",
        "the original static longitudinal acceptance will be lengthened",
        "which will provide the sufficient time to raise a full-strength kicker pulse. Through imposing the specific restriction on the RF parameters",
        "the final bunch length can also be stretched to satisfy the functions of the conventional bunch lengthening system. In this paper",
        "we will move on to explain how to build this complex triple-frequency RF system",
        "and present the relevant simulation works.",
        "[1] S.C. Jiang",
        "G. Xu",
        "On-axis injection scheme based on a triplefrequency rf system for diffraction-limited storage rings. Phys.  Rev. ST Accel. Beams 21",
        "110701 (2018)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir04.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR04",
      "page_number": "40",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR05",
      "title": "Longitudinal Stability with Landau Cavities at MAX IV",
      "authors": [
        "F.J. Cullinan",
        "Å. Andersson",
        "P.F. Tavares",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "The use of Landau cavities was foreseen for both the 1.5 GeV and 3 GeV storage rings at the MAX IV facility from conception. Along with increasing the Touschek lifetime and reducing the emittance degradation due to intrabeam scattering",
        "their purpose is to stabilise the beam in the longitudinal plane. They now play a crucial role in the everyday operation of the two storage rings. This paper outlines the current status and the aspects of longitudinal beam stability that are affected",
        "positively or negatively",
        "by the presence of Landau cavities. Their effectiveness in the two storage rings is also compared."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir05.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR05",
      "page_number": "44",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR06",
      "title": "Hollow Electron Beams in a Photoinjector",
      "authors": [
        "A. Halavanau",
        "Y. Ding",
        "C.E. Mayes",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "S. Baturin",
        "P. Piot",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Photoinjectors have demonstrated the capability of electron beam transverse tailoring",
        "enabled by the microlens array (MLA) setup. For instance",
        "electron beams",
        "transversely segmented into periodic beamlet formations",
        "were successfully produced in several experiments at Argonne Wakefield Accelerator (AWA). In this proceeding",
        "we discuss necessary steps to demonstrate the hollow electron beam generation",
        "with an arbitrary diameter and width with the MLA. We also present beam dynamics simulations and highlight key features of the hollow beam transport in LCLS copper linac."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir06.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR06",
      "page_number": "49",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR07",
      "title": "Mitigation of Microbunching Instability for Improved FEL Spectral Brightness",
      "authors": [
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "Advances in electron beam optics control for suppression of the microbunching instability in high brightness linacs. Experimental demonstrations of the instability suppression confirm the validity of the theoretical model",
        "and promise simple and robust schemes for improvement of the spectral brightness at x-ray FELs.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir07.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR07",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR08",
      "title": "Terahertz Oscilloscope for Ultrashort Electron Beams Diagnostics",
      "authors": [
        "LLP",
        "Shanghai",
        "People’s Republic of China",
        "I base this proposal on paper PHYSICAL REVIEW LETTERS 122",
        "144801 (2019). The speaker should describe the design and demonstration of a terahertz (THz) oscilloscope for recording time information of an ultrashort electron beam. With such THz oscilloscope",
        "nearly 50-fold longitudinal compression of a relativistic electron beam to about 15 fs (rms) is directly visualized with its arrival time determined with 3 fs accuracy. This technique bridges the gap between streaking of photoelectrons with optical lasers and deflection of relativistic electron beams with radio-frequency deflectors",
        "and should have wide applications in many ultrashort electron-beam-based facilities. The speaker shall report on this work and review the world-wide efforts and progress in this domain.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir08.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR08",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR09",
      "title": "Review of Source Size Measurement Techniques for Low-Emittance Synchrotron Sources",
      "authors": [
        "University of Saskatchewan",
        "Saskatoon",
        "Canada",
        "L.D. Chapman",
        "L.O. Dallin",
        "CLS",
        "Saskatoon",
        "Saskatchewan",
        "Canada",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Three radiation-based techniques - pinhole imaging",
        "double-slit interferometry",
        "and a K-edge filter-based beam position and size monitor (ps-BPM) system - are studied in detail for measuring small electron source sizes at low-emittance light sources. Each method has its advantages and limitations and provides complementary information. Pinhole imaging is the most commonly used technique which has the simplest setup but with limited resolution. Double-slit interferometry gives the highest sensitivity among the three methods. The ps-BPM system has a reasonable resolution in measuring source size and divergence",
        "and at the same time",
        "provides real-time information on source position and angle. A combination of multiple techniques is recommended for the full characterization of the source",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir09.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR09",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR10",
      "title": "Adaptive Feedback Control and Machine Learning for Particle Accelerators",
      "authors": [
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "The precise control of charged particle beams",
        "such as an electron beam’s longitudinal phase space as well as the maximization of the output power of a free electron laser (FEL)",
        "or the minimization of beam loss in accelerators",
        "are challenging tasks. For example",
        "even when all FEL parameter set points are held constant both the beam phase space and the output power have high variance because of the uncertainty and time-variation of thousands of coupled parameters and of the electron distribution coming off of the photo cathode. Similarly",
        "all large accelerators face challenges due to time variation",
        "leading to beam losses and changing behavior even when all accelerator parameters are held fixed. We present recent efforts towards developing machine learning methods along with automatic",
        "model-independent feedback for automatic tuning of charge particle beams in particle accelerators. We present experimental results from the LANSCE linear accelerator at LANL",
        "the EuXFEL",
        "AWAKE at CERN",
        "FACET-II and the LCLS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir10.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR10",
      "page_number": "53",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR11",
      "title": "Safety System for the Respect of Nuclear Requirements of",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir11.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR11",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR12",
      "title": "Machine Learning Techniques for Optics Measurements and Corrections",
      "authors": [
        "E. Fol",
        "R. Tomás García",
        "CERN",
        "Meyrin",
        "Switzerland",
        "GSI",
        "Darmstadt",
        "Germany",
        "Recently",
        "various efforts have presented Machine Learning (ML) as a powerful tool for solving accelerator problems. In the LHC a decision tree-based algorithm has been applied to detect erroneous beam position monitors demonstrating successful results in operation. Supervised regression models trained on simulations of LHC optics with quadrupole errors promise to significantly speed-up optics corrections by finding local errors in the interaction regions. The implementation details",
        "results and future plans for these studies will be discussed following a brief introduction to ML concepts and its suitability to different problems in the domain of accelerator physics."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir12.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR12",
      "page_number": "61",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR13",
      "title": "Development of Digital Beam Position Monitor for HEPS",
      "authors": [
        "Y.Y. Du",
        "J.S. Cao",
        "Y.F. Ma",
        "Y.F. Sui",
        "S.J. Wei",
        "J. Yang",
        "Q. Ye",
        "J.H. Yue",
        "X.E. Zhang",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "High Energy Photon Source (HEPS) is a proposed the new generation light source with beam energy of 6GeV",
        "high brightness and ultra-low beam emittance. A Digital BPM has been designed in IHEP as a R&D program to meet all requirements of both injection system and storage ring. The RF BPM architecture consists of an Analog Front-End (AFE) board and a Digital Front-End board (DFE) based on a custom platform. In this paper",
        "we present the overall architecture of the RF BPM electronics system and performance evaluation of its first prototype",
        "comprehending beam current",
        "filling pattern and position measurement resolution as a function of the beam current.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir13.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR13",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR14",
      "title": "A New Scheme for Recording Electron Bunch Shapes with High Resolution and Record Recording Length: Principle and Tests at European XFEL",
      "authors": [
        "PhLAM/CERCLA",
        "Villeneuve d’Ascq Cedex",
        "France",
        "C. Evain",
        "E. Roussel",
        "C. Szwaj",
        "PhLAM/CERLA",
        "Villeneuve d’Ascq",
        "France",
        "C. Gerth",
        "B. Steffen",
        "DESY",
        "Hamburg",
        "Germany",
        "Non-destructive",
        "single-shot recording of longitudinal bunch profiles is a prerequisite for accelerator commissioning and operation. A common strategy for the measurement of ultra-short electron bunches is to sample the Coulomb field with femtosecond laser pulses. In recent years",
        "such electro-optic detection schemes evolved to compact and reliable techniques. However",
        "serious limitations on time resolution have been encountered",
        "when long recording lengths are required. This has been recognised as a fundamental bottleneck and coined the term \"Fourier limit\". We present here a novel electro-optic sampling strategy that is theoretically capable to overcome this limit and achieve femtosecond resolution for any recording length. This new approach is based on the mathematical concept of information diversity. We present first results obtained both with table-top experiments as well as at the European XFEL. This technique opens the way to ultrafast electric field shape characterization with femtosecond resolution in new situations",
        "including longitudinal bunch profile monitoring",
        "studies of microbunching instabilities",
        "and THz pulses generated at free-electron lasers.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir14.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR14",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR15",
      "title": "The PolariX TDS: Experimental Verification of a Next-Generation of Transverse Deflection Structure Working in the X-Band Frequency Regime",
      "authors": [
        "B. Marchetti",
        "R.W. Aßmann",
        "B. Beutner",
        "F. Christie",
        "B. Conrad",
        "M.K. Czwalinna",
        "R.T.P. D’Arcy",
        "P. Gonzalez-Caminal",
        "M. Hoffmann",
        "M. Hüning",
        "R. Jonas",
        "K. Klose",
        "O. Krebs",
        "S. Lederer",
        "D. Marx",
        "J. Osterhoff",
        "M. Reukauff",
        "J. Rönsch-Schulenburg",
        "H. Schlarb",
        "S. Schreiber",
        "G. Tews",
        "M. Vogt",
        "A. Wagner",
        "S. Wesch",
        "J. Zemella",
        "DESY",
        "Hamburg",
        "Germany",
        "M. Bopp",
        "H.-H. Braun",
        "A. Citterio",
        "P. Craievich",
        "R. Ganter",
        "T. Kleeb",
        "F. Marcellini",
        "M. Pedrozzi",
        "E. Prat",
        "S. Reiche",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "N. Catalán Lasheras",
        "A. Grudiev",
        "G. McMonagle",
        "W. Wuensch",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The PolariX TDS (Polarizable X-Band Transverse Deflection Structure) is an innovative TDS-design operating in the X-band frequency-range invented at CERN*. The design gives full control of the streaking plane",
        "which can be tuned in order to characterize the projections of the beam distribution in arbitrary transverse axes. This novel feature opens new opportunities for complete characterization of the electron beam including also the 3D reconstruction of the charge-density distribution of the bunch**. A collaboration of three research institutes (DESY",
        "CERN and PSI) was formed to realize the prototype structure in view of future in-series production***. This new RF-cavity design requires very high manufacturing precision. The prototype was assembled using the high-precision-tuning-free assembly procedure developed at PSI****. Late 2019 the first PolariX TDS was installed in the FLASHForward beamline at DESY",
        "where the expected performance of the structure has been validated during the first commissioning with electron beam. The experimental results open the path for novel and more extended beam characterization in the direction of multi-dimensional-beam-phase-space reconstruction.",
        "*Grudiev A.",
        "CLIC-Note-1067(2016).  **Marx D. et al.",
        "J.Phys.:Conf. Ser.874 012077(2017).  ***Marchetti B.et al.",
        "IPAC 2017"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir15.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR15",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEVIR16",
      "title": "A Novel Nondestructive Diagnostic Method for MeV Ultrafast Electron Diffraction",
      "authors": [
        "X. Yang",
        "M.G. Fedurin",
        "J.J. Li",
        "T.V. Shaftan",
        "V.V. Smaluk",
        "L. Wu",
        "L. Yu",
        "Y. Zhu",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "ShanghaiTech University",
        "Shanghai",
        "People’s Republic of China",
        "A real-time",
        "nondestructive",
        "Bragg-diffracted electron beam energy",
        "energy-spread and spatial-pointing jitter monitor is experimentally verified by encoding the electron beam energy and spatial-pointing jitter information into the mega-electron-volt ultrafast electron diffraction pattern. The shot-to-shot fluctuation of the diffraction pattern is then decomposed to two basic modes",
        "i.e.",
        "the distance between the Bragg peaks as well as its variation (radial mode) and the overall lateral shift of the whole pattern (drift mode). Since these two modes are completely decoupled",
        "the Bragg-diffraction method can simultaneously measure the shot-to-shot energy fluctuation from the radial mode with 2",
        "10-4 precision and spatial-pointing jitter from the drift mode having wide measurement span covering energy jitter range from 10-4 to 10-1. The key advantage of this method is that it allows us to extract the electron beam energy spread concurrently with the ongoing experiment and enables online optimization of the electron beam especially for future high charge single-shot ultrafast electron diffraction (UED) and ultrafast electron microscopy (UEM) experiments."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2020/talks/wevir16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2020/papers/wevir16.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2020/posters/wevir16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2020-WEVIR16",
      "page_number": "67",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 16,
  "scrape_time": "2025-10-10 19:02:13"
}