{
  "session_info": {
    "id": "TUOAB2",
    "name": "TUOAB2 - Contributed Oral Presentations (Synchrotron Light Sources and FELs)",
    "url": "https://proceedings.jacow.org/IPAC2013/html/tuoab2.htm"
  },
  "papers": [
    {
      "paper_id": "TUOAB201",
      "title": "Ultra-Short X-ray Pulse Generation by Electron Beam Slicing in Storage Rings",
      "authors": [
        "L.-H. Yu",
        "F.J. Willeke",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "We propose a new method to generate ultra-short x-ray pulses using focused short low energy (5-10MeV) electron bunch to slice a short electron bunch from the electron bunches in a synchrotron radiation storage ring. When the low energy electron bunch crosses from top the high energy electron bunch at right angle",
        "its coulomb force will kick a short slice of high energy electrons away from the core of the storage ring electron bunch. When the low energy electron bunch (about 50 pC) is focused to about 50 micron size and compressed to about 150fs bunch length and is positioned on top of the high energy electron bunch by a distance about 30 micron",
        "the coulomb force is sufficient to give a kick vertically to the electrons within a short slice of the storage ring bunch about 200 fs long with a deflection about 4 micro-radian. This is sufficient to deflect the slice away from the core by a separation of 5 times the angular divergence of the beam. The separated slice when passing through an undulator",
        "will radiate ulstra-short x-ray pulses at about 200 fs. We discuss the advantages and challenges of this new method. We provide data to demonstrate the feasibility of this method."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tuoab201_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tuoab201.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tuoab201_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUOAB201",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOAB202",
      "title": "ILSF, A Third Generation Light Source Laboratory in Iran",
      "authors": [
        "J. Rahighi",
        "M.R. Khabazi",
        "IPM",
        "Tehran",
        "Iran",
        "E. Ahmadi",
        "H. Ajam",
        "M. Akbari",
        "S. Amiri",
        "A. Babaei",
        "J. Dehghani",
        "R. Eghbali",
        "J. Etemad Moghadam",
        "S. Fatehi",
        "M. Fereidani",
        "H. Ghasem",
        "A. Gholampour",
        "A. Iraji",
        "M. Jafarzadeh",
        "B. Kamkari",
        "S. Kashani",
        "P. Khodadoost",
        "H. Khosroabadi",
        "M. Moradi",
        "H. Oveisi",
        "S. Pirani",
        "M. Rahimi",
        "M. Razazian",
        "A. Sadeghipanah",
        "F. Saeidi",
        "R. Safian",
        "E. Salimi",
        "Kh.S. Sarhadi",
        "O. Seify",
        "M.Sh. Shafiee",
        "A. Shahveh",
        "A. Shahverdi",
        "D. Shirangi",
        "E.H. Yousefi",
        "ILSF",
        "Tehran",
        "Iran",
        "CELLS-ALBA Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "The Iranian Light Source Facility (ILSF) project is a first large scale accelerator facility which is currently under planning in Iran. The circumference of the storage ring is 297.6 m with the energy of 3 GeV. The facility will be built on a land of 100 hectares area in the city of Qazvin",
        "located 150 km West of Tehran. The city is surrounded by many universities",
        "research centers and industrial companies. The design and construction of prototype items such as radio frequency solid state amplifier",
        "dipole magnets",
        "highly stable magnet power supplies and girders have already begun. A low field H-type dipole magnet with the central field of 0.5T at the gap of 34mm and length of 500mm was built and tested in site. Also a prototype storage ring quadrupole with a 18 T/m gradient and 233 iron length is in now in fabrication process. Site selection studies",
        "including geotechnical and seismological measurements are being performed. Conceptual Design Report",
        "CDR",
        "as the first milestone of the project has been published on October 2012."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tuoab202_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tuoab202.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tuoab202_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUOAB202",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOAB203",
      "title": "ESRF Upgrade Phase II",
      "authors": [
        "J.-L. Revol",
        "P. Berkvens",
        "J.C. Biasci",
        "J-F. B. Bouteille",
        "N. Carmignani",
        "F. Ewald",
        "L. Farvacque",
        "A. Franchi",
        "L. Goirand",
        "M. Hahn",
        "L. Hardy",
        "J. Jacob",
        "J.M. Koch",
        "G. Lebec",
        "S.M. Liuzzo",
        "B. Nash",
        "T.P. Perron",
        "E. Plouviez",
        "P. Raimondi",
        "K.B. Scheidt",
        "V. Serrière",
        "ESRF",
        "Grenoble",
        "France",
        "Four years after the launch of the Upgrade Programme",
        "the ESRF is midway through its first phase (2009-2015) and has defined the objectives for the ensuing second phase. The first phase paved the way to a new generation of nano-beam X-ray beamlines fed by an X-ray source itself substantially improved in terms of reliability",
        "stability and brilliance. The second phase envisions a major upgrade of the source to best serve the science case of this new generation of beamlines. In December 2012",
        "the ESRF Council endorsed Management's proposal to launch the technical design study of a new 7-bend achromat lattice. This new configuration will allow the ESRF storage ring to operate with a decrease in horizontal emittance by a factor of about 30 and a consequent increase in brilliance and coherence of the photon beam. The increase will be substantially higher at X-ray energies larger than 50 keV."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/tuoab203_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/tuoab203.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/tuoab203_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-TUOAB203",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 21:14:40"
}