{
  "session_info": {
    "id": "WEA1I",
    "name": "WEA1I - Wednesday Afternoon Invited Oral 1",
    "url": "https://proceedings.jacow.org/HIAT2015/html/wea1i.htm"
  },
  "papers": [
    {
      "paper_id": "WEA1I01",
      "title": "Progress and CW Beam Commissioning of China ADS",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "China Accelerator Driven System (ADS) project was proposed by CAS. It includes a superconducting proton linac",
        "a tungsten granular spallation target",
        "and a subcritical reactor with liquid lead-bismuth coolant",
        "and started in 2011. The project China Initiative Accelerator Driven Sub-critical System (CIADS) is approved",
        "consists of 250 MeV linac and 10 MWt sub-critical reactor. It will be constructed in 2022. The road map and progress are introduced in the presentation. A 25 MeV Demo Linac is developing at IMP and the first 25 MeV beam will be in Sept. 2016. It consists of 35 keV ECRIS",
        "162.5 MHz four-vane RFQ",
        "and four cryomodules. The first three are installed with six half wave resonators and the last one is installed with six spoke resonators. To verify integral technology and commissioning of high power CW beam",
        "a single-cavity cryomodule was developed and commissioned with ~11 mA proton beam in advance in Feb. 2015. Now",
        "the first cryomodule with 5 MeV CW beam is commissioning",
        "some results are presented. The progress of a 325 MHz front-end is also introduced.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "Slides WEA1I01 [20.013 MB] reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/wea1i01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/wea1i01.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/wea1i01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-WEA1I01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:38:49"
}