{
  "session_info": {
    "id": "MOPA",
    "name": "MOPA - Monday Poster Session (A)",
    "url": "https://proceedings.jacow.org/HIAT2015/html/mopa.htm"
  },
  "papers": [
    {
      "paper_id": "MOPA02",
      "title": "Beam Alignment Procedure for Scanned Ion-Beam Therapy",
      "authors": [
        "Y. Saraya",
        "T. Furukawa",
        "Y. Hara",
        "K. Mizushima",
        "K. Noda",
        "N. S. Saotome",
        "T. Shirai",
        "R. Tansho",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "Kanagawa Cancer Center",
        "Ion-beam Radiation Oncology Center in Kanagawa",
        "Kanagawa",
        "Japan",
        "It's important to control the beam position for the 3D pencil-beam scanning because the position accuracy of the beam has a serious matter on the alignment of the irradiation field. In order to suppress this matter",
        "we have been developed a simple procedure for the beam tuning. The fluctuation of the beam position is tuned with the steering magnets (ST) and the fluorescent screen monitors (SCN). At first",
        "the beam positions are measured by two SCN and the kick angles of two ST are calculated using deviates from the center of the beam position measured by SCN and the transfer matrix. After the tuning",
        "the beam position at the isocenter is checked on the verification system for the alignment of the beam consists of the SCN and the iron sphere phantom. If the beam position is deviated from the center",
        "one of ST placed on most downstream of the beam transport line will be corrected. These adjustments are iterated until the deviation for all energies of the beam are within 0.5 mm. We have been performed the beam commissioning using our procedure in Kanagawa Cancer Center. In this presentation",
        "we will report on the result of these measurements.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa02.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA02",
      "page_number": "36",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA03",
      "title": "A Novel Method of Beam Scanning Over a Large Sample Arear at PLF, Mumbai",
      "authors": [
        "C. Rozario",
        "J.N. Karande",
        "V. Nanal",
        "S. Palpresenter",
        "R.G. Pillay",
        "TIFR",
        "Mumbai",
        "India",
        "Many applications require uniform irradiation with heavy ion beams and special electric/magnetic devices are employed to scan the beam over the desired target area. We report a novel method of beam scanning using a magnetic steerer in the beam line. Indigenously developed magnetic steerers",
        "comprising a pair of coils with sine-cosine winding",
        "are installed in beam lines at PLF (Mumbai) for correcting the X-Y position of beam. This steerer is adapted to work as a scanner by employing a microcontroller and an interface unit for constant current bipolar power supply. A triangular waveform is applied to control the excitation current for scanning the beam simultaneously in both horizontal (X) and vertical (Y) planes. A programme generates a raster pattern governed by a pre-settable number of X sweeps for each Y sweep. The dwell time at each of X-Y position was adjusted considering the time constant arising due to the inductance of the steerer. Multiple raster scans were used to produce uniform irradiation over the sample. The scanner has been successfully employed for uniform irradiation of GaAs substrate for photoconductive THz applications using 12C beam.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa03.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA03",
      "page_number": "39",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA04",
      "title": "New High-energy Beam Transport Line Dedicated to Biological Applications in RIKEN RI Beam Factory",
      "authors": [
        "N. Fukunishi",
        "T. Abe",
        "M. Fujimaki",
        "T. Hirano",
        "M. Komiyama",
        "K. Kumagai",
        "T. Maie",
        "Y. Watanabe",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "RIKEN RI Beam Factory is one of the world-leading heavy-ion facilities where nuclear physics research and application research have been conducted. One important application",
        "performed more than twenty years at RIBF",
        "is breeding plants and others where energetic heavy ions are used as very effective mutagens. Our previous main accelerator RIKEN Ring Cyclotron has been used for this purpose but available beam energies and resultant ion ranges are limited for medium heavy ions such as argon and iron ions. Hence",
        "a new beam transport line delivering beams accelerated by one of our new-generation cyclotrons",
        "RIKEN Intermediate Ring Cyclotron",
        "to E5H experimental vault",
        "where biological samples are irradiated in air",
        "has been constructed. We will report design of the new beam line and the results obtained by the beam-commissioning test performed using a 160 MeV/nucleon argon beam in January 2015. We obtained performances as designed",
        "for example",
        "nearly 100% transmission efficiency",
        "and a threefold increase of ion ranges. The higher-energy argon beam delivered by the new beam line was used to induce seaweed mutations immediately after the beam test.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa04.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA04",
      "page_number": "42",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA06",
      "title": "Proposal for a High Power Deuteron Cyclotron at RISP",
      "authors": [
        "A. Calanna",
        "L. Calabretta",
        "INFN/LNS",
        "Catania",
        "Italy",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "MIT",
        "Cambridge",
        "Massachusetts",
        "USA",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "S.C. Jeong",
        "J.-W. Kim",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "A compact isochronous cyclotron able to deliver a 10 mA proton beam has been studied for the IsoDAR experiment",
        "which aim is to search sterile neutrino and to investigate the neutrino-electron scattering. The IsoDAR cyclotron has been designed to accelerate high current beam for any ion with q/A=0.5 up to the maximum energy of 60 AMeV. In the IsoDAR experiment H2+ ions will be used. However",
        "this cyclotron is also able to accelerate D+ or D- ions. In this operational mode",
        "it could be an excellent driver for radioactive facilities with a full beam power of 60 to 120 kW. The advantages to use IsoDAR cyclotron as driver for the RISP (Rare Isotope Science Project) facility in Daejeon",
        "Korea",
        "will be described. The different kinds of extraction by electrostatic deflectors and by stripper",
        "as well as the different advantages and disadvantages will be described too. The expected beam intensities for light ions as 12C6+",
        "16O8+ and 20Ne10+ will be also presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa06.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA06",
      "page_number": "45",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA07",
      "title": "Progress on the Upgrade for TRT at NIRS Cyclotron Facility",
      "authors": [
        "S. Hojo",
        "K. Katagiri",
        "M. Nakao",
        "A. Noda",
        "A. Sugiura",
        "T. Wakui",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "K. Nagatsu",
        "H. Suzuki",
        "National Institute of Radiological Sciences",
        "Inage",
        "Chiba",
        "Japan",
        "The cyclotron facility at National Institute of Radiological Science (NIRS) includes two cyclotrons",
        "a NIRS-930 cyclotron (Thomson-CSF",
        "Kb=110 MeV and Kf=90 MeV) and a small cyclotron HM-18 (Sumitomo-Heavy-Industry). The NIRS-930 cyclotron has been used for radionuclide production",
        "nuclear physics",
        "detector development and so on",
        "since the first beam in 1973. The HM-18 has been used for radionuclide production for PET since the 1994. In recent years",
        "the radionuclide production for Targeted Radionuclide Therapy (TRT) by using NIRS-930 has been one of the most important activities in NIRS. Since demand of radionuclide users on beam intensity is growing",
        "we have launched to upgrade the cyclotron facility",
        "such as installation of multi-harmonic beam buncher in NIRS-930 and a reinforcement of nuclear ventilation system in a cave. Progress on the upgrade for TRT at the cyclotron facility and status of the NIRS cyclotrons are to be presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa07.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA07",
      "page_number": "48",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA08",
      "title": "The Multi Particle Simulation for the Cyclotron NIRS-930",
      "authors": [
        "M. Nakao",
        "S. Hojo",
        "K. Katagiri",
        "A. Noda",
        "K. Noda",
        "A. Sugiura",
        "T. Wakui",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "Yamagata University",
        "Yamagata",
        "Japan",
        "V.L. Smirnov",
        "S.B. Vorozhtsov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The simulation of the beam for the cyclotron NIRS-930 at NIRS has been performed with the use of the SNOP program* in order to study beam dynamics in a cyclotron and to improve beam intensity. SNOP simulated from beam injection to extraction with the electric fields of the inflector",
        "the Dee electrodes and the deflector; the magnetic fields of the main coils",
        "the trim coils and the harmonic coils and the magnetic channel which were calculated by OPERA-3d. The simulation of proton with 30 MeV extraction energy with harmonic number of 1 was already performed and well simulated RF phase and extraction efficiency**. Then we tried to apply SNOP to 18 MeV protons with harmonic 2. We first formed isochronous magnetic field with main and trim coils for simulating single particle. Next we optimized electric deflector and magnetic channel in order to maximize extraction efficiency simulating the bunch of particles. Beam loss of the simulation was compared to the experiment. We intend to apply optimized simulation parameters for actual cyclotron operation to improve beam intensity and quality.",
        "* V.L. Smirnov",
        "S.B. Vorozhtsov",
        "Proc. of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa08.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA08",
      "page_number": "51",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA09",
      "title": "RIKEN Ring Cyclotron (RRC)",
      "authors": [
        "Y. Watanabe",
        "M. Fujimaki",
        "N. Fukunishi",
        "E. Ikezawa",
        "O. Kamigaito",
        "M. Kase",
        "K. Kumagai",
        "T. Maie",
        "J. Ohnishi",
        "H. Okuno",
        "K. Ozeki",
        "N. Sakamoto",
        "K. Suda",
        "S. Watanabe",
        "K. Yamada",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "S. Fukuzawa",
        "M. Hamanaka",
        "S. Ishikawa",
        "K. Kobayashi",
        "R. Koyama",
        "T. Nakamura",
        "M. Nishida",
        "M. Nishimura",
        "J. Shibata",
        "N. Tsukiori",
        "K. Yadomi",
        "SHI Accelerator Service Ltd.",
        "Tokyo",
        "Japan",
        "The RIKEN Ring Cyclotron (RRC) has been in stable operation over 28 years",
        "and has been used for supplying many types of heavy-ion beams for various experiments. Since 2007",
        "it has also been used for supplying beams to the three Ring Cyclotrons at the Radioactive Isotope Beam Factory (RIBF). The RRC has three types of injectors: the AVF cyclotron for comparatively light ions",
        "variable-frequency linac for heavy-ions (RILAC)",
        "and the RIKEN Heavy-ions Linac 2 ("
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa09.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA09",
      "page_number": "54",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA10",
      "title": "Development of Low-Energy Heavy-Ion Beams by the RIKEN AVF Cyclotron and Hyper ECR Ion Source of CNS",
      "authors": [
        "Y. Kotaka",
        "N. Imai",
        "H. Muto",
        "Y. Ohshiro",
        "S. Shimoura",
        "S.-I. Watanabe",
        "H. Yamaguchi",
        "CNS",
        "Saitama",
        "Japan",
        "Yamagata University",
        "Yamagata",
        "Japan",
        "RCNP",
        "Osaka",
        "Japan",
        "M. Kase",
        "S. Kubono",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "The application of low-energy heavy-ion beams enhances production of radioisotope (RI) and studies of nuclear astrophysics.　The Center for Nuclear Study (CNS) of the University of Tokyo and RIKEN Nishina Center have been developing the RIKEN AVF Cyclotron (AVF) and the Hyper ECR Ion Source (IS) of CNS to expand available ions and their acceleration energies as well as to increase the beam intensity for studies at the low-energy RI beam separator CRIB * and others. Renovation of central region of the AVF expands the acceptance of injection beam",
        "so that 4He beam is now available at a higher energy of 12.5MeV/u under the constraint that the maximal Dee voltage is 50kV. Intensities of metallic ions extracted from the IS have been increased by developing three kinds of vaporization methods",
        "multi-hole micro-oven",
        "non-axial rod and MIVOC. Plasma spectroscopy ** is applied to monitor the intensities of highly charged ions in the IS. For systematic study of transport efficiencies",
        "several beam diagnostic devices have been added. One key device is a set of a multi-hole slit and a viewer of the beam image (pepper-pot emittance monitor ***)",
        "which gives four-dimensional phase space.",
        "* Y. Yanagisawa et al.",
        "Nucl. Instr. and Meth. Phys. Res. A539 (2005) 74  ** H. Muto et al.",
        "Rev. Sci. Instr. 85 (2014) 02A905  *** T. Hoffmann et al.",
        "Proc. 9th BIW2000",
        "Cambridge",
        "USA",
        "PP.432-439",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa10.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA10",
      "page_number": "58",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA11",
      "title": "Phase Bunching in the Central Region of the JAEA AVF Cyclotron for Heavy-Ion Acceleration in the Third-Harmonic Mode",
      "authors": [
        "N. Miyawaki",
        "H. Kashiwagi",
        "S. Kurashima",
        "S. Okumura",
        "JAEA/TARRI",
        "Gunma-ken",
        "Japan",
        "RCNP",
        "Osaka",
        "Japan",
        "Phase bunching using a rising slope of a dee-voltage at the first acceleration gap was evaluated by analysis of a simplified geometric trajectory analysis model and the measurement of the internal beam phase distribution for the acceleration harmonic number (h) 3 to accelerate the heavy ion in the JAEA AVF cyclotron. The calculated correlation between the internal beam phase and the initial beam phase by the model was consistent with the measurement result of the beam phase distributions with the initial beam phase",
        "defined by adjusting the relative RF phase of the beam buncher. The measured correlation indicated that the initial beam phase width larger than 60 RF degrees was compressed to less than 15 RF degrees",
        "and the internal beam phase was independent of the initial beam phase. The phase bunching effect was almost equal to that for h = 2 with different geometric electrode from h = 3 in the central region.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa11.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA11",
      "page_number": "62",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA12",
      "title": "Status Report of the Operation of the RIKEN AVF Cyclotron",
      "authors": [
        "K. Suda",
        "M. Fujimaki",
        "N. Fukunishi",
        "T. Kageyama",
        "O. Kamigaito",
        "M. Kase",
        "M. Komiyama",
        "K. Kumagai",
        "T. Maie",
        "M. Nagase",
        "T. Nagatomo",
        "T. Nakagawa",
        "H. Okuno",
        "N. Sakamoto",
        "A. Uchiyama",
        "T. Watanabe",
        "Y. Watanabe",
        "K. Yamada",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "S. Fukuzawa",
        "M. Hamanaka",
        "S. Ishikawa",
        "K. Kobayashi",
        "R. Koyama",
        "T. Nakamura",
        "M. Nishida",
        "M. Nishimura",
        "J. Shibata",
        "N. Tsukiori",
        "K. Yadomi",
        "SHI Accelerator Service Ltd.",
        "Tokyo",
        "Japan",
        "Y. Kotaka",
        "Y. Ohshiro",
        "S. Yamaka",
        "CNS",
        "Saitama",
        "Japan",
        "The RIKEN AVF cyclotron was commissioned in 1989. Since then",
        "it has been operated as an injector for the RIKEN ring cyclotron. The AVF cyclotron also provides low energy ion beams for the Radio-Isotope Beam separator (CRIB) of the Center for Nuclear Study (CNS)",
        "the University of Tokyo",
        "as well as to produce RIs for commercial use. The operating time is more than 3",
        "000 hours per year. We will report the operating status (nuclear species",
        "energy",
        "supply destination of accelerated ions)",
        "troubles",
        "maintenance work",
        "and the improvement of ion sources and diagnostics tools for the period from August 2014 to July 2015.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa12.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA12",
      "page_number": "65",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA13",
      "title": "Improvement of Mass-to-Charge Ratio Resolution of the JAEA AVF Cyclotron Using a Beam Chopping System",
      "authors": [
        "S. Kurashima",
        "H. Kashiwagi",
        "N. Miyawaki",
        "JAEA/TARRI",
        "Gunma-ken",
        "Japan",
        "RCNP",
        "Osaka",
        "Japan",
        "A mass-to-charge ratio (M/Q) resolution of the JAEA cyclotron (K110) is about 3",
        "300 and this high-resolution enables us to quickly change the ion species to be accelerated by a cocktail beam acceleration technique. In this technique",
        "a few ion species having almost the same M/Q are injected into the cyclotron",
        "and the ion species whose cyclotron frequency is completely matches the acceleration frequency is extracted from the cyclotron. The ion species extracted from the cyclotron can be changed by adjusting the acceleration frequency corresponding to the M/Q difference. To improve the M/Q resolution",
        "a new technique is being developed by combining the cocktail beam acceleration and beam chopping techniques. The beam chopping system consists of a pre-beam kicker installed in the beam injection line and a post-beam kicker downstream of the cyclotron. The chopping system is able to pick up beam bunches arbitrarily from a pulse train of an ion beam. At present",
        "we have succeeded to separate the 250 MeV 40Ar10+ beam from the 225 MeV 36Ar9+",
        "and the M/Q resolution was significantly improved from 3",
        "300 to 25",
        "000 by this new method.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa13.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA13",
      "page_number": "68",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA14",
      "title": "Electrostatic Deflector of the Cyclotron DC-280 Axial Injection Channel",
      "authors": [
        "N.Yu. Kazarinov",
        "I.A. Ivanenkopresenter",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The spherical electrostatic deflector will be used in the axial injection channel of the DC-280 cyclotron for rotation of the ion beam onto vertical axis. The results of the simulation of beam dynamics in the deflector based on 3D electrical field map are discussed in this report. The results of simulation of the ion beam transport in the axial injection beam line of the cyclotron are presented also.",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa14.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA14",
      "page_number": "71",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA15",
      "title": "Cooling Stacking Injection in NICA Booster",
      "authors": [
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "The much cycling injection from the linear accelerator to the NICA booster is planned to use for storage of Au31+ ions at energy 3.1 MeV/u. The intensity of the stored ions is increased by 3-5 times at injection intensity of 5·108-109 ppp. The intensity of the stored beam is higher by one order of magnitude comparing with injection intensity of 108 ppp. The maximal intensity is restricted by the incoherent diffusion heating of the stack and the ion life time. The simulations of the cooling stacking injection were performed by BETACOL code. The coherent instability can be developed at a high ion intensity in presence of the electron cooling. The increment of instability essentially depends on the choice of the working point. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa15.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA15",
      "page_number": "74",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA16",
      "title": "Coherent Synchro-Beta Coupling in the KEK Digital Accelerator",
      "authors": [
        "T. Monma",
        "K. Takayama",
        "T. Yoshimoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "K. Takayama",
        "T. Yoshimoto",
        "TIT",
        "Yokohama",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "The required acceleration voltage per turn in any circular accelerator is written by Vacc=ρC0dB/dt",
        "where ρ",
        "C0",
        "and B are the bending radius",
        "circumference of the orbit",
        "and magnetic flux density",
        "respectively. Since the guiding magnetic fields of the KEK Digital Accelerator",
        "which is a fast cycling induction synchrotron",
        "are excited sinusoidally",
        "an ideal profile of Vacc is of half sine. From the engineering constraint of the current induction acceleration system",
        "however",
        "the output voltage is always constant between 1.5 kV and 2.0 kV. Thus the induction acceleration voltage pulse is discretely generated based on the specific pulse density program so as to satisfy a size of the required voltage integrated for a short time period. The induction acceleration cells are placed at the region where the magnitude of the momentum dispersion function is not zero but 1.4 m. It has been reported that the coherent motion of the beam centroid is strongly excited at the early stage of acceleration cycle *. Discrete acceleration at the finite momentum dispersion function region is suspected to cause such a coherent motion.",
        "* K.Takayama et al.",
        "\"Induction acceleration of heavy ions in the KEK digital accelerator: Demonstration of a fast-cycling induction synchrotron\"",
        "Phys. Rev. ST-AB 17",
        "010101(2014)",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa16.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA16",
      "page_number": "77",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA17",
      "title": "Super-Bunch Induction Acceleration Scheme  in the KEK Digital Accelerator",
      "authors": [
        "T. Yoshimoto",
        "K. Takayama",
        "TIT",
        "Yokohama",
        "Japan",
        "T. Adachi",
        "E. Kadokura",
        "T. Kawakubo",
        "X. Liu",
        "K. Okamura",
        "S. Takano",
        "K. Takayama",
        "KEK",
        "Ibaraki",
        "Japan",
        "T. Adachi",
        "K. Takayama",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "Tokyo City University",
        "Tokyo",
        "Japan",
        "Department of Energy Sciences",
        "Tokyo Institute of Technology",
        "Yokohama",
        "Japan",
        "One of our next missions for the KEK digital accelerator*",
        "** is to demonstrate super-bunch (very long beam) acceleration technique in which a beam length occupies over half of the ring at injection***. This machine uses an induction cell driven by a switching power supply (SPS) which can generate rectangular pulses with their timings precisely controlled by a field-programmable gate array (FPGA). A power supply for the SPS is planned to be upgraded from present DC setup to a time-varying type generating a beam-required acceleration voltage per turn. This suppresses an emittance blow-up longitudinally and allows the super-bunch acceleration stably. In this presentation",
        "we discuss concrete super-bunch acceleration scheme with simulation results and its hardware developments.",
        "* T. Iwashita et al",
        "Phys. Rev. ST-AB 14",
        "071301 (2011).  ** K. Takayama",
        "T. Yoshimoto et al",
        "Phys. Rev. ST-AB 17",
        "010101 (2014). *** K. Takayama et al",
        "Phys. Rev. Lett. 88",
        "144801 (2002).",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa17.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA17",
      "page_number": "80",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA18",
      "title": "A Racetrack-Shape Fixed Field Induction Accelerator for Giant Cluster Ions",
      "authors": [
        "K. Takayama",
        "T. Adachi",
        "K. Okamura",
        "M. Wake",
        "KEK",
        "Ibaraki",
        "Japan",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "A novel scheme for a racetrack-shape fixed field induction accelerator (RAFFIA) capable of accelerating extremely heavy cluster ions (giant cluster ions) * is described. The key feature of this scheme is rapid induction acceleration by localized induction cells. Triggering the induction voltages provided by the signals from the circulating bunch allows repeated acceleration of extremely heavy cluster ions. Under the hypothesis that the RAFFIA is an induction synchrotron ** with an adiabatically varying circumference",
        "the given RAFFIA example is capable of realizing the integrated acceleration voltage of 50 MV per acceleration cycle for C-60 (A=720 and Q=7). Using 90° bending magnets with a reversed field strip and field gradient is crucial for assuring orbit stability in the RAFFIA. Interesting beam physics such as resonance crossing during an acceleration cycle is discussed",
        "including the structural stability of the cluster ion itself in the bending fields.",
        "* K.Takayama",
        "T.Adachi",
        "M.Wake",
        "and K.Okamura",
        "Phys. Rev. ST-AB 18",
        "050101(2015).  ** K.Takayama and R.J. Briggs",
        "Chapter 11 and 12 in Induction Synchrotron (Springer",
        "Heidelberg",
        "2011).",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa18.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA18",
      "page_number": "83",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA19",
      "title": "Nuclotron at JINR: Operation Experience and Recent Development",
      "authors": [
        "A.D. Kovalenko",
        "N.N. Agapov",
        "A.V. Butenko",
        "E.D. Donets",
        "E.E. Donets",
        "A.V. Eliseev",
        "V.V. Fimushkin",
        "A. Govorov",
        "E.V. Ivanov",
        "V. Karpinsky",
        "V.D. Kekelidze",
        "H.G. Khodzhibagiyan",
        "V.A. Mikhailov",
        "V. Monchinsky",
        "S. Romanov",
        "A.O. Sidorin",
        "V. Slepnev",
        "A.V. Smirnov",
        "E. Syresinpresenter",
        "G.V. Trubnikov",
        "V. Volkov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "JINR/VBLHEP",
        "Moscow",
        "Russia",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [
        "Nuclotron is 6 AGeV superconducting synchrotron based on fast-cycled superferric 2T magnets. It was designed and constructed at the Laboratory of High Energies of JINR in the late 80s and put into operation in March 1993. The essential features of the new accelerator and magnet technology have been collected during 20 years of the machine work for the users are briefly reviewed. The further development plan is discussed."
      ],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa19.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA19",
      "page_number": "86",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA21",
      "title": "Particle Tracking Simulation With Space Charge Effects for an Induction Synchrotron and Preliminary Application to the Kek Digital Accelerator",
      "authors": [
        "Department of Energy Sciences",
        "Tokyo Institute of Technology",
        "Yokohama",
        "Japan",
        "In order to study the beam behaviour of the induction synchrotron which features low energy injection",
        "a dedicated particle tracking simulation code with a 2.5D space charge field solver",
        "which takes into account of the boundary condition",
        "has been developed. The beam dynamics included in this code are discussed and simulation results assuming parameters of the KEK Digital Accelerator are presented. This code will help to understand the various features of the beam behaviour in the present beam commissioning and serve as a tool for the design of the future induction synchrotrons."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa21.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA21",
      "page_number": "89",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPA22",
      "title": "Beam Confinement Dynmics in a Barrier Bucket",
      "authors": [
        "Tokyo City University",
        "Tokyo",
        "Japan",
        "X. Liu",
        "K. Takayama",
        "T. Yoshimoto",
        "TIT",
        "Yokohama",
        "Japan",
        "X. Liu",
        "K. Takayama",
        "T. Yoshimoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "* J. Griffin et al.",
        "IEEE Trans. Nucl. Sci. NS-30",
        "3502",
        "21-23 Mar. 1983. ** Ken Takayamaet et al.",
        "\"Induction Synchrotron\" (Springer",
        "Heidelberg",
        "2011).",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "Barrier bucket beam trapping has some history. For the first time Griffin proposed this method and demonstrated in Tevatron project in 1983*. There the barrier voltage has been generated in the way that higher harmonic components of RF voltage are superimposed. Since then several groups tried this method and it has been utilized in a routine operation of Fermilab Antiproton Recycler . The induction synchrotron concept was proposed in 2000. Barrier bucket created by the pulse voltages has been assumed for beam confinement in this accelerator. Its concept was confirmed in the experiment using the 12 GeV PS in 2006**. From the early days of barrier bucket development chaotic-like motions of trapped particles in the phase space have attracted our concerns . However there are no systematic studies focusing on this point. The paper will discuss what causes such chaotic motions and how it is sensitive to barrier bucket parameters such as the voltage pulse profile with a finite rising/falling time and its amplitude. We will propose what counter measures are effective in order to mitigate increasing of the longitudinal emittance caused by this instability. reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa22.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA22",
      "page_number": "92",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA23",
      "title": "Performance of a Fast Kicker Magnet for Rare-RI Ring",
      "authors": [
        "H. Miura",
        "I. Kato",
        "T. Nishimura",
        "S. Omika",
        "T. Suzuki",
        "N. Tadano",
        "Y. Takeuchi",
        "T. Yamaguchi",
        "Saitama University",
        "Saitama",
        "Japan",
        "Y. Abe",
        "Y. Yamaguchi",
        "RIKEN",
        "Saitama",
        "Japan",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "K. Hiraishi",
        "Y. Ichikawa",
        "A. Ozawa",
        "S. Suzuki",
        "Y. Tajiri",
        "University of Tsukuba",
        "Graduate School of Pure and Applied Sciences",
        "Tsukuba",
        "Ibaraki",
        "Japan",
        "UTTAC",
        "Tsukuba",
        "Ibaraki",
        "Japan",
        "D. Nagae",
        "S. Naimi",
        "F. Suzaki",
        "T. Uesaka",
        "M. Wakasugi",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "We developed a fast kicker magnet for the Rare-RI Ring at the RI Beam Factory (RIBF) in RIKEN. The Rare-RI Ring is a storage ring developed to measure masses of unstable nuclei with a precision in the order of 10-6 *. The unstable nuclei are randomly produced in secondary beams by nuclear reactions of a DC primary beam from the RIBF accelerator complex",
        "and their yields are as small as 1 event/day. Therefore",
        "we apply the individual injection method to perform mass measurements of rare RI efficiently **. The developed kicker magnet is distributed constant type. The shape of magnetic ﬁeld is essential to the individual injection",
        "and the timing property is given by the inductance and capacitance components of the kicker. Based on results of simulations conducted for the equivalent electronic circuit",
        "we optimized the electrodes and ferrite cores of the kicker. In June",
        "we carried out the first commissioning of Rare-RI Ring using a 78Kr36+ beam with an energy of 167 MeV/nucleon. We succeeded in injecting and extracting particle-by-particle by using the kicker system. In this contribution",
        "we will report details of the kicker magnet and will show the performance evidenced at the commissioning.",
        "* A. Ozawa et al.",
        "Prog. Theor. Exp. Phys. 2012 (2012) 03C009. ** I.Meshkov et al.",
        "Proceedings of EPAC 2004",
        "Lucerne",
        "Switzerland.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa23.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA23",
      "page_number": "95",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA24",
      "title": "Performance of a Resonant Schottky Pick-up in the Commissioning of Rare-RI Ring",
      "authors": [
        "F. Suzaki",
        "D. Nagae",
        "S. Naimi",
        "T. Uesaka",
        "M. Wakasugi",
        "T. Watanabe",
        "K. Yamada",
        "Y. Yano",
        "J. Zenihiro",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "Y. Abe",
        "Y. Yamaguchi",
        "RIKEN",
        "Saitama",
        "Japan",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "K. Hiraishi",
        "Y. Ichikawa",
        "A. Ozawa",
        "S. Suzuki",
        "Y. Tajiri",
        "University of Tsukuba",
        "Graduate School of Pure and Applied Sciences",
        "Tsukuba",
        "Ibaraki",
        "Japan",
        "I. Kato",
        "H. Miura",
        "T. Nishimura",
        "S. Omika",
        "T. Suzuki",
        "N. Tadano",
        "Y. Takeuchi",
        "T. Yamaguchi",
        "Saitama University",
        "Saitama",
        "Japan",
        "UTTAC",
        "Tsukuba",
        "Ibaraki",
        "Japan",
        "Rare-RI Ring *",
        "** is a storage ring dedicated for precise mass measurements of unstable nuclei to make clear the astrophysical r-process path. We employ the Isochronous mass spectrometry method in the order of 10-6. For precise tuning of the isochronous field",
        "we developed a resonant Schottky pick-up which had a resonant cavity. We acquired the quantities by the offline test: shunt impedance",
        "and unloaded quality factor. Using the quantities",
        "we estimated the output signal power which is corresponding to a single ion with charge q on resonance ***. Comparing to thermal noise",
        "present Schottky pick-up can detect a single ion with charge over 16. In June",
        "we carried out the first commissioning of Rare-RI Ring using 78Kr38+ beam with the energy of 167 MeV/nucleon. By using the individual injection method with the fast kicker system",
        "we succeeded in injecting",
        "storing",
        "and extracting 78Kr38+ ions. The Schottky pick-up successfully detected single 78Kr38+ ions. Also we confirmed that 78Kr38+ was stored for more than 2 seconds in a vacuum of 10-5 Pa. In this contribution",
        "we will present recent status of the Schottky pick-up focusing on the results of the experiment.",
        "* Y. Yamaguchi et al.",
        "Nucl. Instr. Meth. B 317 (2013) 629.  ** A. Ozawa et al.",
        "Prog. Theor. Exp. Phys. 2012 (2012) 03C009. *** F. Nolden et al.",
        "Nucl. Instr. Meth. A 659 (2011) 69.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa24.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA24",
      "page_number": "98",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA26",
      "title": "SI-Thyristor Matrix Array Driven Electrostatic Injection Kicker for the KEK Digital Accelerator and Beam Dynamics Analysis of Injection",
      "authors": [
        "Tokyo City University",
        "Tokyo",
        "Japan",
        "T. Adachi",
        "T. Kawakubo",
        "KEK",
        "Ibaraki",
        "Japan",
        "TIT",
        "Yokohama",
        "Japan",
        "For heavy ion beam injection into the KEK-DA ring [*]",
        "the electrostatic (ES) kicker is used [**]. A voltage of 20 kV is put across the electrostatic electrodes before injection so as to deflect the injected beam on the ring orbit. The ES-Kicker excitation circuit where a coaxial cable is charged to the required voltage by a resonant charging power supply and discharged just after beam injection. The SI-Thyristor Matrix Array (SI-Thy MA) as a discharging device has been developed to replace the conventional thyratron. The developed SI-Thy MA has proved to be quite useful in getting rid of inherent issues associated with thyratron's use. Recently it has turned out that ringing in a voltage pulse of 3.5 μs",
        "which is originated from its longer switching time than that of the thyratron",
        "affects on beam injection dynamics",
        "resulting inμbunch formation. In order to understand this phenomenon",
        "a computer simulation code including the longitudinal space-charge effects has been developed. Comparisons of the experimental results obtained for various parameters with the computer simulation will be discussed.",
        "[*] T.Iwashita et al.",
        "\"KEK Digital Accelerator\"",
        "Phys. Rev.ST-AB 14",
        "071301(2011). [**] T.Adachi and T.Kawakubo",
        "\"Electrostatic Injection Kicker for KEK-DA\"",
        "Phys. Rev.ST-AB 16",
        "053501 (2013).",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa26.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA26",
      "page_number": "101",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA27",
      "title": "Recent Updates on the RIKEN RI Beam Factory Control System",
      "authors": [
        "M. Komiyama",
        "M. Fujimaki",
        "N. Fukunishi",
        "K. Kumagai",
        "A. Uchiyama",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "SHI Accelerator Service Ltd.",
        "Tokyo",
        "Japan",
        "RIKEN Radioactive Isotope Beam Factory (RIBF) is a heavy-ion accelerator facility producing unstable nuclei and studying their properties. The major part of the RIBF accelerator complex has been controlled by Experimental Physics and Industrial Control System (EPICS). After the first beam extraction from Superconducting Ring Cyclotron (SRC)",
        "the final stage accelerator of RIBF",
        "in 2006",
        "several kinds of extensions and updates have been performed in the EPICS-based RIBF control system as well as the accelerators and their components. We will here present the overview of the EPICS-based RIBF control system and its two latest updates. One is a newly installed safety system in addition to the existing two kinds of RIBF beam interlock systems following significant increase of the beam intensity extracted from the SRC. The other is development of some kinds of successors that are designed to be compatible with the existing aged controllers for magnet power supplies.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa27.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA27",
      "page_number": "104",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPA29",
      "title": "A Fast, Compact Particle Detector for Tuning Radioactive Beams at ATLAS",
      "authors": [
        "C. Dickerson",
        "B. DiGiovine",
        "C.R. Hoffman",
        "L.Y. Lin",
        "R.C. Pardo",
        "E. Rehm",
        "G. Savard",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "C. Deibel",
        "J. Lai",
        "D. Santiago-Gonzalez",
        "LSU",
        "Baton Rouge",
        "Louisiana",
        "USA",
        "Radioactive ion beams (RIB) at the Argonne Tandem Linear Accelerator System (ATLAS) are produced either from the in-flight method at 5-15 MeV/u for A < 30",
        "or via reacceleration of fission fragments from the CAlifornium Rare Isotope Breeder Upgrade (CARIBU) at 4-10 MeV/u for 80 < A < 160. These RIB are typically accompanied by contaminant beams >100x more intense. The goal of this work is to develop a fast (>105 pps)",
        "compact (retractable from the beam line) particle detector capable of A and Z identification to enable accelerator optimization on the exact species of interest. The detector should have an energy resolution of ≤5% and be resistant to radiation damage. A gas ionization chamber supplemented with an inorganic scintillator was chosen as the basic conceptual design. GSO:Ce was chosen as the primary candidate scintillator due to a demonstrated energy resolution of ~3% for 15 MeV/u He and less irradiation induced performance degradation than other candidate materials.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text",
        "※ RIS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/HIAT2015/talks/mopa29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HIAT2015/papers/mopa29.pdf",
      "poster_url": "https://proceedings.jacow.org/HIAT2015/posters/mopa29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2015-MOPA29",
      "page_number": "107",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 24,
  "scrape_time": "2025-10-10 17:38:20"
}