{
  "session_info": {
    "id": "WEPCAV",
    "name": "WEPCAV - Wednesday Poster Cavities",
    "url": "https://proceedings.jacow.org/srf2021/html/wepcav.htm"
  },
  "papers": [
    {
      "paper_id": "WEPCAV001",
      "title": "Study of the Niobium Oxide Structure and Microscopic Effect of Plasma Processing on the Niobium Surface",
      "authors": [
        "B. Giaccone",
        "M. Martinello",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "B. Giaccone",
        "J. Zasadzinski",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "A study of the niobium oxide structure is presented here",
        "with particular focus on the niobium suboxides. Multiple steps of argon sputtering and XPS measurements were carried out until the metal surface was exposed. The sample was then exposed to air and the oxide regrowth was studied. In addition",
        "three Nb samples prepared with different surface treatments were studied before and after being subjected to plasma processing. The scope is investigating the microscopic effect that the reactive oxygen contained in the glow discharge may have on the niobium surface. This study suggests that the Nb2O5 thickness may increase",
        "although no negative change in the cavity performance is measured since the pentoxide is a dielectric."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepcav001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepcav001.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepcav001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPCAV001",
      "page_number": "585",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPCAV002",
      "title": "Improvement of Chemical Etching Capabilities (BCP) for SRF Spoke Resonators at IJCLab",
      "authors": [
        "J. Demercastel-Soulier",
        "P. Duchesne",
        "D. Longuevergne",
        "G. Olry",
        "T. Pépin-Donat",
        "F. Rabehasy",
        "D. Reynet",
        "S. Roset",
        "L.M. Vogt",
        "Université Paris-Saclay",
        "CNRS/IN2P3",
        "IJCLab",
        "Orsay",
        "France",
        "Buffered chemical polishing (BPC) is the reference surface polishing adopted for ESS and MYRRHA SRF spoke resonators at IJCLab. This chemical treatment",
        "in addition to improving the RF performance",
        "fits into the frequency adjustment strategy of the jacketed cavity during its preparation phase. In the framework of the collaboration with Fermilab for PIP-II project",
        "IJCLab has developed a new setup to perform rotational BCP. The implementation of a rotation during chemical etching improves significantly the homogeneity and quality of surface polishing. In this paper",
        "we present the numerical analysis based on a fluid dynamics model. The goal is to estimate the acid flow characteristics inside the cavity",
        "determine the influence of several parameters as mass flow rate and rotation speed and propose the best configuration for the new experimental setup"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepcav002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepcav002.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepcav002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPCAV002",
      "page_number": "590",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPCAV006",
      "title": "MHz Elliptical Cavities in IMP for CiADS Project",
      "authors": [
        "Y.L. Huang",
        "H. Guo",
        "Y. He",
        "C.L. Li",
        "T. Liu",
        "R.X. Wang",
        "Z.J. Wang",
        "M. Xu",
        "Z.Q. Yang",
        "S.X. Zhang",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "650MHz multi-cell superconducting elliptical cavities with optimum beta equal to 0.62 and 0.82 were adopted in the driver linac of Chinese initiative Accelerator Driven Subcritical System (CiADS) to accelerate the 10 mA proton beam from 175 MeV up to 500 MeV",
        "with the possibility to upgrade the energy to 1 GeV and higher. Mechanical design and optimization of the niobium cavity-titanium helium vessel assembly will be summarized in this paper. Vertical test results of three single cell prototype cavities will also be discussed",
        "with comparisons with the simulation values."
      ],
      "institutions": [
        "Funding: Large Research Infrastructures \"China initiative Accelerator Driven System\"(Grant No.2017-000052-75-01-000590 ) and National Natural Science Foundation of China (Grant NO. 11805249)",
        "*Work supported by Large Research Infrastructures \"China initiative Accelerator Driven System’(Grant No.2017-000052-75-01-000590 ) and National Natural Science Foundation of China (Grant NO. 11805249)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepcav006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepcav006.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepcav006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPCAV006",
      "page_number": "594",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPCAV007",
      "title": "Status and First Tests of the Reduced-Beta Capture Cavity for the S-DALINAC",
      "authors": [
        "S. Weih",
        "M. Arnold",
        "M. Dutine",
        "J. Enders",
        "R. Grewe",
        "L.E. Jürgensen",
        "N. Pietralla",
        "F. Schließmann",
        "M. Steinhorst",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "The superconducting part of the injector section of the superconducting Darmstadt electron linear accelerator (S-DALINAC) [1] consisted of one five-cell capture cavity and two 20-cell cavities at 3 GHz resonance frequency. All of them were geometrically adapted to electron velocities with a beta of 1",
        "while the thermionic gun provides electrons with a beta of 0.74. This mismatch resulted in an insufficient capture process for optimum beam quality. For this reason",
        "a new six-cell capture cavity with a beta of 0.86 has been designed and built. Field flatness tuning",
        "a test in the vertical bath cryostat",
        "and a UHV furnace treatment have been carried out in-house to finalize the cavity processing. The cryostat module was adapted to house the new cavity",
        "which has been recently installed. Following the module assembly",
        "a first RF test run was conducted at the S-DALINAC. We report on these latest advancements towards the implementation of the injector upgrade.",
        "* N. Pietralla",
        "Nuclear Physics News",
        "Vol. 28",
        "No. 2",
        "4 (2018)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepcav007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepcav007.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepcav007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPCAV007",
      "page_number": "597",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPCAV008",
      "title": "A Fast Mechanical Tuner for SRF Cavities",
      "authors": [
        "Euclid TechLabs",
        "Solon",
        "Ohio",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "There is a particular need for fast tuners and phase shifters for advanced superconducting accelerator RF systems. The tuners based on ferrite",
        "ferroelectric and piezo materials are commonly used. However",
        "those methods suffer from one or another issue of high power loss",
        "slow response",
        "and narrow tuning range. We propose a robust",
        "fast (up to ~5 MHz/sec)",
        "high efficient mechanical tuner for SRF cavities operating at the frequency 50 MHz. We develop an external mechanical tuner that is strongly coupled to the cavity. The tuner design represents a trade-off of high efficiency (low RF losses and low heat flux) and frequency tunability range. Our approach solves this trade-off issue. We propose RF design which exploits two coupled resonators so that a main high-field cavity is controlled with a small tunable resonator with a flexible metallic wall operating in a relatively low RF field. Simulations",
        "carried out for a 7.5 MV/m 50 MHz SRF Quarter Wave Resonator (QWR)",
        "show that frequency tunability at level 10-3 is obtainable."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepcav008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepcav008.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepcav008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPCAV008",
      "page_number": "600",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPCAV009",
      "title": "Conceptual Design of Balloon Double Spoke Resonator",
      "authors": [
        "Z.Y. Yao",
        "R.E. Laxdal",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "The balloon variant of the spoke resonator was proposed to eliminate the intensive multipacting (MP) barriers around the operating field level by modifying the local electro-magnetic (EM) fields. TRIUMF has previously reported the prototyping of a 325MHz β=0.3 single spoke resonator (SSR) that demonstrated the principle of the balloon concept. To extend the benefits of the balloon variant to multi-spoke resonators",
        "this paper will report a conceptual design of a 325MHz β=0.5 balloon double spoke resonator (DSR). The consequences from the balloon SSR design",
        "such as the relations between EM field distributions and the field levels of the MP barriers",
        "were applied to the DSR design. Other particular geometry features were also added due to the characters of DSRs. The simulated MP barriers were significantly squeezed to the lower field level compared to a conventional DSR design. Simulation results and conceptual design will be reported."
      ],
      "institutions": [
        "Funding: TRIUMF receives funding via a contribution through the National Research Council Canada."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepcav009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepcav009.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepcav009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPCAV009",
      "page_number": "604",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPCAV010",
      "title": "Comparison of Electromagnetic Properties During Fabrication of Copper and Niobium Prototypes of 325 MHz Coaxial Half-Wave Resonator",
      "authors": [
        "D. Bychanok",
        "V. Bayev",
        "S. Huseu",
        "S.A. Maksimenko",
        "A.E. Sukhotski",
        "E. Vasilevich",
        "INP BSU",
        "Minsk",
        "Belarus",
        "A.V. Butenko",
        "E. Syresin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "M. Gusarova",
        "M.V. Lalayan",
        "S.M. Polozov",
        "MEPhI",
        "Moscow",
        "Russia",
        "V.S. Petrakovsky",
        "A.I. Pokrovsky",
        "A. Shvedov",
        "S.V. Yurevich",
        "Physical-Technical Institute of the National Academy of Sciences of Belarus",
        "Minsk",
        "Belarus",
        "HZB",
        "Berlin",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The main fabrication stages of niobium and copper prototypes of coaxial half-wave resonators (HWR) operating at frequency 325 MHz for the Nuclotron-based Ion Collider fAcility (NICA) injector are presented and discussed. Results of intermediate measurements and electromagnetic properties control for niobium and copper cavities of equivalent geometrical characteristics are compared and analyzed. The comparison of electromagnetic properties of Cu- and Nb-prototypes allows estimating specific features and differences of intermediate \"warm\" measurements of niobium and copper cavities. The presented results will be used for further development and production of superconductive niobium cavities with a similar design for the NICA-project.",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepcav010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepcav010.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepcav010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPCAV010",
      "page_number": "609",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPCAV011",
      "title": "Present Status of the Spoke Cavity Prototyping for the JAEA-ADS Linac",
      "authors": [
        "J. Tamura",
        "Y. Kondo",
        "F. Maekawa",
        "S.I. Meigo",
        "B. Yee-Rendón",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "T. Dohmae",
        "E. Kako",
        "H. Sakai",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "The Japan Atomic Energy Agency (JAEA) is proposing an accelerator-driven subcritical system (ADS) for efficient reduction of high-level radioactive waste generated in nuclear power plants. One of the challenging R¥&Ds for ADS is the reliability of the accelerator. In preparation for the full-scale design of the proton linac for the JAEA-ADS",
        "we are now prototyping a single-spoke cavity for low-beta (around 0.2) beam acceleration. As there is no experience of manufacturing a superconducting spoke cavity in Japan",
        "the cavity prototyping and performance testing are essential to ensure the feasibility of the JAEA-ADS linac. To proceed to an actual cavity fabrication",
        "we have carefully reviewed the fabrication process. And then",
        "we examined the electron-beam welding using niobium test pieces and investigated the welding condition for realizing the smooth underbead. We have finally started the press forming of niobium sheets and the machine work to shape the cavity parts. Now",
        "we are parparing for the electron-beam welding of the shaped niobium parts."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepcav011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepcav011.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepcav011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPCAV011",
      "page_number": "612",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPCAV012",
      "title": "Research and Development of 650 MHz Cavities for CEPC",
      "authors": [
        "P. Sha",
        "C. Dong",
        "F.S. He",
        "S. Jin",
        "Z.Q. Li",
        "B.Q. Liu",
        "Z.H. Mi",
        "W.M. Pan",
        "J.Y. Zhai",
        "X.Y. Zhang",
        "H.J. Zheng",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "650 MHz 2-cell superconducting cavities are proposed for the main ring of the Circular Electron Positron Collider (CEPC). The design",
        "fabrication",
        "surface treatment (buffered chemical polishing) and vertical tests of the cavities with HOM couplers were conducted. The performance of the cavity at 2 K is not affected by the HOM coupler. The maximum intrinsic quality factor of the cavity with the HOM coupler reached 3.1·1010 at 20 MV/m. The vertical test results showed that the fundamental mode external quality factor of all HOM couplers is an order of magnitude larger than quality factor of the cavity. The HOM damping results for the 650 MHz 2-cell cavity were also measured at cryogenic temperature and compared with the simulated and measured results at room temperature. Two 650 MHz 2-cell cavities jacketed have been integrated into a test cryomodule for CEPC. Another 650 MHz 2-cell cavity reached 6·1010 at 22 MV/m after nitrogen infusion. In addition",
        "two 650 MHz 1-cell cavities reached 2.7·1010 at 35 MV/m (fine grain) and 3.6·1010 at 32 MV/m (large grain) after electro-polishing",
        "respectively. In future",
        "electro-polishing will be applied to 650 MHz 2-cell cavity soon."
      ],
      "institutions": [
        "Funding: This work was supported by the National Key Programme for S&T Research and Development (No. 2016YFA0400400), the Platform of Advanced Photon Source Technology R&D."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepcav012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepcav012.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepcav012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPCAV012",
      "page_number": "616",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPCAV013",
      "title": "Occurring Dependency between Adjustable Coupling and Q₀ - Finding and Solving a Problem during Vertical Cavity Testing at DESY",
      "authors": [
        "Y.F. Liu",
        "C. Luo",
        "SARI-CAS",
        "Pudong",
        "Shanghai",
        "People’s Republic of China",
        "D. Reschke",
        "L. Steder",
        "M. Wiencek",
        "DESY",
        "Hamburg",
        "Germany",
        "In the AMTF (Accelerator Module Test Facility) hall at DESY",
        "various types of cavities have been tested for different accelerators and R&D projects during the last years. For R&D purposes",
        "dedicated inserts with additional auxiliaries like a movable INPUT antenna can be used to perform accurate measurements at different temperatures between 1.4 K and 4 K. Since 2017 more than hundred vertical tests were conducted in these inserts without troubles besides rare expected occurrences of cold leaks or even rarer a loose antenna. However",
        "in the last months",
        "an unexpected dependency between the measured quality factor and the coupling coefficient ß has been observed. In order to understand the source of this measurement uncertainty",
        "several different special checks have been performed. In a logical sequence of measurements with different cryostats",
        "inserts and cavities the problem has been encircled and in the end was identified and solved. In this paper",
        "the observed problem is described in detail as well as the entire path leading to its solution."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepcav013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepcav013.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepcav013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPCAV013",
      "page_number": "619",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPCAV014",
      "title": "HOM Damper Design for BNL EIC 197 MHz Crab Cavity",
      "authors": [
        "B.P. Xiao",
        "Q. Wu",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "S.U. De Silva",
        "J.R. Delayen",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "J.R. Delayen",
        "R.A. Rimmer",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Brookhaven National Laboratory (BNL)",
        "Electron-Ion Collider",
        "Upton",
        "New York",
        "USA",
        "The interaction region (IR) crab cavity system is a special RF system to compensate the loss of luminosity due to a 25 mrad crossing angle at the interaction point (IP) for BNL EIC. There will be six crab cavities",
        "with four 197 MHz crab cavities and two 394 MHz crab cavities",
        "installed on each side of the IP in the proton/ion ring",
        "and one 394 MHz crab cavity on each side of the IP in the electron ring. Both rings share identical 394 MHz crab cavity design to minimize the cost and risk in designing a new RF system",
        "and it will be scaled from 197 MHz crab cavity. In this paper",
        "the HOM damper design for 197 MHz crab cavity is introduced."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepcav014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepcav014.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepcav014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPCAV014",
      "page_number": "624",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPCAV015",
      "title": "Refurbishment and Testing of the WiFEL E-Gun at Argonne",
      "authors": [
        "T.B. Petersen",
        "G. Chen",
        "M.V. Fisher",
        "M. Kedzie",
        "M.P. Kelly",
        "T. Reid",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "We report on the refurbishment and testing of the Wisconsin Free Electron Laser (WiFEL) superconducting radiofrequency electron gun with application as an electron injector for DOE accelerators and as a possible future stand-alone tool for electron microscopy. Initial testing at ANL showed the cavity had a very low quality factor",
        "~107",
        "later determined to be due to contamination some-time since the initial assembly. Following ultrasonic cleaning",
        "high-pressure water rinsing",
        "reassembly",
        "and cold testing",
        "the e-gun has largely recovered with Q~109 and surface electric fields ~15 MV/m. We intend that WiFEL be available as a testbed for future high brightness sources and",
        "in particular",
        "for testing an SRF gun photocathode loader design; an essential",
        "and as yet",
        "not sufficiently proven technology. We report here on many operationally important properties of a quarter-wave SRF cavity for application as an e-gun",
        "including microphonics",
        "pressure sensitivity",
        "and mechanical tuning. New electromagnetic simulations show that the WiFEL cavity shape and design can be optimized in several respects."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepcav015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepcav015.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepcav015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPCAV015",
      "page_number": "627",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 12,
  "scrape_time": "2025-10-11 03:06:33"
}