{
  "session_info": {
    "id": "TUPF",
    "name": "TUPF - Tuesday Poster Session",
    "url": "https://proceedings.jacow.org/IBIC2013/html/tupf.htm"
  },
  "papers": [
    {
      "paper_id": "TUPF01",
      "title": "Proton Emittance Measurements in the Brookhaven AGS",
      "authors": [
        "H. Huang",
        "R. Connolly",
        "C.W. Dawson",
        "D.M. Gassner",
        "C.E. Harper",
        "S.E. Jao",
        "W. Meng",
        "F. Méot",
        "R.J. Michnoff",
        "M.G. Minty",
        "V. Schoefer",
        "T. Summers",
        "S. Tepikian",
        "K. Yip",
        "K. Zeno",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "High luminosity and high polarization in RHIC require good control and measurement of emittance in its injector",
        "the Brookhaven AGS. In the past",
        "the AGS emittance has been measured by using an ion collecting IPM during the whole cycle and a multi-wire at injection. The beam profiles from this IPM are distorted by space charge forces at higher energy",
        "which makes the emittance determination very hard. In addition",
        "helical superconducting snake magnets and near integer vertical tune for polarized proton operation distort the lattice in the AGS and introduce large beta beating. For more precise measurements of the emittance",
        "we need TBT measurements near injection and beta function measurements at the location of devices used to measure the emittance. A Polarimeter target has been used as flying wire for proton emittance measurement. A new type electron collecting IPM has been installed and tested in the AGS with proton beam. The Beta functions at the IPM locations have been measured with Orbit Response Matrix (ORM) methods and with a local corrector at IPM. This paper summarizes our current understanding of AGS emittances and plans for further improvements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf01.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF01",
      "page_number": "492",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF02",
      "title": "Secondary Emission Monitor for keV Ion and Antiproton Beams",
      "authors": [
        "A.G. Sosa",
        "E. Bravin",
        "A. Jeff",
        "CERN",
        "Geneva",
        "Switzerland",
        "J. Harasimowicz",
        "A. Jeff",
        "A.G. Sosa",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "J. Harasimowicz",
        "A. Jeff",
        "A.G. Sosa",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom"
      ],
      "institutions": [
        "Funding: Work supported by the EU within the DITANET and CATHI projects under contracts 215080 and 264330, HGF and GSI under contract VH-NG-328 and STFC under the Cockcroft Institute core grant ST/G008248/1.",
        "Beam profile monitoring of low intensity keV ion and antiproton beams remains a challenging task. A Secondary electron Emission Monitor (SEM) has been designed to measure profiles of beams with intensities below 107 and energies as low as 20 keV. The monitor is based on a two stage microchannel plate (MCP) and a phosphor screen facing a CCD camera. Its modular design allows two different operational setups. In this contribution we present the design of a prototype and discuss results from measurements with protons at INFN-LNF and antiprotons at the AEgIS experiment at CERN*. This is then used for a characterization of the monitor with regard to its possible future use at different facilities."
      ],
      "abstract": "* Measurements at the AD carried out with the AEgIS collaboration.",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf02.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF02",
      "page_number": "495",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF03",
      "title": "Performance Assessment of Wire-Scanners at CERN",
      "authors": [
        "G. Baud",
        "B. Dehning",
        "J. Emery",
        "J-J. Gras",
        "A. Guerrero",
        "E.P. Piselli",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [
        "This article describes the current fast wire-scanner devices installed in circular accelerators at CERN with an emphasis of the error studies carried out during the last two runs. At present the wire-scanners have similar acquisition systems but are varied in terms of mechanics. Several measurement campaigns were performed aimed at establishing optimal operational settings and to identify and assess systematic errors. In several cases the results led to direct performance improvements while in others this helped in defining the requirements for new detectors."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf03.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF03",
      "page_number": "499",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF05",
      "title": "Particle Tracking for the FETS Laser Wire Emittance Scanner",
      "authors": [
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "The Front End Test Stand (FETS) is an R&D project at Rutherford Appleton Laboratory (RAL) with the aim to demonstrate a high power (60 mA",
        "3 MeV with 50 pps and 10 % duty cycle)",
        "fast chopped H− ion beam. The diagnostics of high power particle beams is difficult due to the power deposition on diagnostics elements introduced in the beam so non-invasive instrumentation is highly desirable. The laser wire emittance scanner under construction is based on a photo-detachment process utilizing the neutralized particles produced in the interaction between Laser and H− beam for beam diagnostics purposes. The principle is appropriate to determine the transversal beam density distribution as well as the transversal and longitudinal beam emittance behind the RFQ. The instrument will be located at the end of the MEBT with the detachment taking place inside a dipole field. Extensive particle tracking simulations have been performed for various settings of the MEBT quadrupoles to investigate the best placement and size of the 2D scintillating detector and to determine the range and resolution of the instrument. Additionally the power distribution in the following beam dumps has been determined."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf05.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF05",
      "page_number": "503",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF06",
      "title": "D Wire Grid Integrated with Faraday Cup for Low Energy H− Beam Analysis at Siemens Novel Electrostatic Accelerator",
      "authors": [
        "JAI",
        "Oxford",
        "United Kingdom",
        "P. Beasley",
        "O. Heid",
        "Siemens AG",
        "Erlangen",
        "Germany",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Marcham Scientific Ltd",
        "Hungerford",
        "United Kingdom",
        "Inspired Engineering Ltd",
        "Climping",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "H. von Jagwitz-Biegnitz A wire grid with 21 wires each vertically and horizontally with a spacing of 1 mm has been developed for beam analysis at Siemens' novel electrostatic accelerator. The wire grid is integrated in a Faraday Cup and profile measurements can therefore be combined with current measurements. The grid is used to analyse the 10 keV H− beam coming from the ion source and the obtained beam parameters will be used as input for simulations of the beam transport in the accelerator. All 42 wires can be read out simultaneously with a multi-channel precision electrometer and the data can be fitted instantly with LabVIEW code that was developed for this purpose. This paper reports on some details of the mechanical design and the data analysis procedure in LabVIEW as well as some results of first measurements at the novel accelerator.",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf06.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF06",
      "page_number": "507",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF07",
      "title": "Covariance and Temporal Causality in the Transition Radiation Emission by an Electron Bunch",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A model of the transition radiation emission by a N electron bunch must conform to covariance and causality. The covariance of the charge density must imprint the transition radiation energy spectrum via a proper formulation of the charge form factor. The emission phases of the radiation pulse must be causality correlated with the temporal sequence of the N electron collisions onto the metallic screen. Covariance and temporal causality are the two faces of the same coin: failing in implementing one of the two constraints into the model necessarily implies betraying the other one. The main formal aspects of a covariance and temporal-causality consistent formulation of the transition radiation energy spectrum by an N electron beam are here described. In the case of a transition radiator with a round surface",
        "explicit formal results are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf07.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF07",
      "page_number": "511",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF08",
      "title": "Characterization of Compressed Bunches in the SwissFEL Injector Test Facility",
      "authors": [
        "G.L. Orlandi",
        "M. Aiba",
        "F. Baerenbold",
        "S. Bettoni",
        "B. Beutner",
        "H. Brands",
        "P. Craievich",
        "F. Frei",
        "R. Ischebeck",
        "E. Prat",
        "T. Schietinger",
        "V. Schlott",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The quality of the beam transverse emittance at the cathode and the uniformity of the longitudinal compression of the electron bunch are essential for the lasing efficiency of a Free Electron Laser. In SwissFEL the longitudinal compression of the electron beam is performed by means of two magnetic chicanes and an off-crest acceleration scheme. The curvature induced on the beam longitudinal phase-space during the compression can be compensated by means of an X-band cavity. The beam longitudinal phase-space can be experimentally characterized by means of a Transverse Deflecting Cavity (TDC) and a profile monitor in a dispersive section. Longitudinal phase-space measurements at the SwissFEL Injector Test Facility under compression with and without X-band linearizer are presented. In addition",
        "energy spread measurements done by monitoring the Synchrotron Radiation (SR) emitted by the electron beam in the dispersive section of the chicane are shown. A comparison with numerical simulations is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf08.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF08",
      "page_number": "515",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF09",
      "title": "Commissioning Experience and First Results From the New SLS Beam Size Monitor",
      "authors": [
        "V. Schlott",
        "M. Rohrer",
        "Á. Saá Hernández",
        "A. Streun",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Å. Andersson",
        "J. Breunlin",
        "MAX-lab",
        "Lund",
        "Sweden",
        "LNLS",
        "Campinas",
        "Brazil",
        "In the context of the TIARA work package “SLS vertical emittance tuning” (SVET)",
        "an extremely small vertical beam size of 3.6 μm",
        "corresponding to a vertical emittance of 0.9 pm",
        "was verified using an optical monitor based on imaging of pi-polarized light. Since the existing beam size monitor reached its limit of resolution",
        "a new monitor beam line was designed and installed at the 08BD bending magnet of the storage ring of the Swiss Light Source SLS. Larger magnification and operation at shorter wavelength provide improved spatial resolution. Reflective optics enables convenient switching between different wavelengths. An optical table is located in a hutch outside the storage ring tunnel to provide access during operation. Movable obstacles in the beam path create interference patterns and thus provide redundancy of model based analysis of the images. In this paper we report on our commissioning experience and provide a comparison of the different measurement methods at different wavelengths."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf09.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF09",
      "page_number": "519",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF10",
      "title": "A Non-Intercepting Beam Emittance Measurement Device Based on Neutral Beam Fluorescence Method at PKU",
      "authors": [
        "S.X. Peng",
        "J. Chen",
        "Z.Y. Guo",
        "H.T. Ren",
        "Y. Xu",
        "J. Zhao",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "J.E. Chen",
        "A.L. Zhang",
        "Graduate University",
        "Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "L.T. Sun",
        "H.W. Zhao",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "A new concept to attain ion beam emmitance through measuring the forward neutral beam without intercepting the beam transportion was proposed at PKU. The forward neutral beam produced by space charge compensation and separated from the transporting ion beam with the help of a deflecting magnetic field",
        "carries the entire emittance information of the original particle beam and becomes a fast and non-interceptive beam diagnostic tool. This idea was tested on PKU ion source test bench and the experimental results show that the neutral beam fluorescence method is feasible. Bases on these qualification results",
        "a formal non-intercepting emittance measurement device was designed. It is a 90 degree full-scale dipole analysis magnet combining with the classical pepper-pot technique. Test and commissioning of the device are in progress. Details of design and comnissioning results will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf10.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF10",
      "page_number": "522",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF11",
      "title": "Design and Initial Demonstration Results of Laser Wire Scanner for Energy Recovery Linacs",
      "authors": [
        "B.T. Jacobson",
        "T.J. Campese",
        "A.Y. Murokh",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "A.C. Bartnik",
        "B.M. Dunham",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Energy Recovery LINACs (ERL's) can produce electron beams of smaller emittance than in synchrotron rings",
        "with high average current",
        "and without inefficiencies involved in dumping a high-powered accelerated beam. The ERL group at the Cornell Lab for Accelerator-based ScienceS and Education (CLASSE) is currently testing an injector for an ERL based X-ray light source: a superconducting RF (SRF) accelerator coupled to a DC electron gun and high rep rate (1.3 GHz) photocathode drive laser",
        "capable of producing a CW beam of 80 pC bunches (100 mA ave current). Traditional transverse diagnostics are incapable of operation with such high average currents",
        "motivating the the use of a Laser Wire Scanner (LWS). RadiaBeam Technologies",
        "in collaboration with the Cornell ERL group",
        "is developing a LWS system capable of measuring e-beam profiles in both transverse dimensions as well as obtaining the longitudinal beam profile. Due to the low energy of the injector output (5-15 MeV) and beam halo scraping",
        "detection of laser-scattered photons is significantly more challenging than in previous LWS system. This contribution presents a LWS prototype design and initial demonstration results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf11.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF11",
      "page_number": "525",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF12",
      "title": "Development of High Resolution Beam Profile Imaging Diagnostics",
      "authors": [
        "A.Y. Murokh",
        "G. Andonian",
        "A.A. Bechtel",
        "B.T. Jacobson",
        "M. Ruelas",
        "S. Wu",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "Accurate characterization of an electron beam profile is often a critical instrumentation task at modern light sources and advanced acceleration facilities. Yet ultra-small emittances presently achievable in photo-injectors are often testing the limits of the traditional diagnostic systems such as scintillating screens or optical transition radiation (OTR) monitors. To mitigate some of the limitations on resolution and accuracy of beam profile measurements",
        "a number of novel experimental approaches are presently under development at RadiaBeam",
        "including optical fiber based Cerenkov radiation monitors",
        "all-reflective optics OTR monitors",
        "and DUV/EUV transition radiation monitors with sub-micron resolution. We report development status and initial experimental results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf12.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF12",
      "page_number": "526",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF14",
      "title": "Description of Laser Transport and Delivery System for the FETS Laserwire Emittance Scanner",
      "authors": [
        "A. Bosco",
        "G.E. Boorman",
        "S. Emery",
        "S.M. Gibson",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "CERN",
        "Geneva",
        "Switzerland",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "J.K. Pozimski",
        "P. Savage",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "A beam emittance monitor for H− beams based on laser-induced ions neutralization is being developed at the Front End Test Stand (FETS) at the Rutherford Appleton Laboratory (RAL). The laser system that will be used for the photo-neutralization of the H− beam is a fiber laser emitting 110 ns pulses at λ=1064nm",
        "with a repetition rate of 30 kHz and peak power of 8 kW. The laser will be conveyed to the interaction area over a distance of 70 m via an optical fiber. An assembly of two remotely controlled motorized translation stages will enable the system to scan across the H− beam along its vertical profile. A motorized beam expander will control the output size of the collimated laser beam in order to enable the system to operate with different spatial characteristics of the ions beam. In this paper we present a full account of the laser characteristics",
        "the optical transport system and the final delivery assembly. All the relevant measurements such as power",
        "spatial and temporal characteristics of the laser",
        "fiber transport efficiency and final delivery laser beam parameters will be reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf14.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF14",
      "page_number": "527",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF15",
      "title": "Overview of Laserwire Beam Profile and Emittance Measurements for High Power Proton Accelerators",
      "authors": [
        "S.M. Gibson",
        "G.E. Boorman",
        "A. Bosco",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "G.E. Boorman",
        "A. Bosco",
        "S.M. Gibson",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "CERN",
        "Geneva",
        "Switzerland",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "J.K. Pozimski",
        "P. Savage",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "Laserwires were originally developed to measure micron-sized electron beams via Compton scattering",
        "where traditional wire scanners are at the limit of their resolution. Laserwires have since been applied to larger beam-size",
        "high power H− ion beams",
        "where the non-invasive method can probe beam densities that would damage traditional diagnostics. While photo-detachment of H− ions is now routine to measure beam profiles",
        "extending the technique to transverse and longitudinal emittance measurements is a key aim of the laserwire emittance scanner under construction at the Front End Test Stand (FETS) at the RAL. A pulsed",
        "30kHz",
        "8kW peak power laser is fibre-coupled to motorized collimating optics",
        "which controls the position and thickness of the laserwire delivered to the H− interaction chamber. The laserwire slices out a beamlet of neutralized particles",
        "which propagate to a downstream scintillator and camera. The emittance is reconstructed from 2D images as the laserwire position is scanned. Results from the delivery optics",
        "scintillator tests and particle tracking simulations of the full system are reviewed. Plans to deploy the FETS laser system at the Linac4 at CERN are outlined."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf15.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF15",
      "page_number": "531",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF16",
      "title": "Analysis of Measurement Errors of INR Linac Ionization Beam Cross Section Monitor",
      "authors": [
        "S.A. Gavrilov",
        "A. Feschenko",
        "P.I. Reinhardt-Nickoulin",
        "I.V. Vasilyev",
        "RAS/INR",
        "Moscow",
        "Russia",
        "A. Feschenko",
        "S.A. Gavrilov",
        "MIPT",
        "Dolgoprudniy",
        "Moscow Region",
        "Russia",
        "Residual gas ionization beam cross section monitors (BCSM) are installed at LEBT and HEBT of INR RAS proton linac to measure cross section",
        "profiles and position of the beam. BCSMs provide two-dimensional non-destructive real-time beam diagnostics at LINAC operation with repetition frequency from 1 to 50 Hz",
        "pulses duration from 0.3 to 170 μs and wide range of amplitudes",
        "particle energy 400 keV and 209 MeV. The analysis of systematic measurements errors (accuracy) because of nonuniform electrostatic fields",
        "determined by BCSM design features",
        "is presented. New detector model",
        "minimizing these nonuniformities",
        "is shown. Besides that",
        "the analysis of statistical errors (precision) due to the method features",
        "in particular",
        "ions thermal motion and a beam space charge",
        "is done. The simulation results make it possible to estimate measured cross sections size",
        "profiles and beam positions and to draw conclusions about the reliability of BCSM results for beams with various parameters."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf16.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF16",
      "page_number": "535",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF17",
      "title": "Phase Space Measurement using X-ray Pinhole Camera at SSRF",
      "authors": [
        "K.R. Ye",
        "J. Chen",
        "Z.C. Chen",
        "G.Q. Huang",
        "Y.B. Leng",
        "L.Y. Yu",
        "W.M. Zhou",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "Since 2009 an X-ray pinhole camera that has been used to present the transverse beam size on diagnostic beamline of the storage ring in Shanghai Synchrotron Radiation Facility (SSRF). Transverse beam profiles in the real(x",
        "y) and phase(Y",
        "Y’) spaces are obtained by an X-ray pinhole camera sensitive by moving one pinhole. The large amount of collected data has allowed a detailed reconstruction of the transverse phase space evolution in this paper. An image on a fluorescent screen is observed by a CCD camera，digitized and stored",
        "then the phase space and the real space profiles are reconstructed．A non-linear least square program fits the resultant profiles to a vertical dimensional Gaussian distributions to derive the phase space and emittances for SSRF storage ring．"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf17.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF17",
      "page_number": "539",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF18",
      "title": "Vertical Undulator Emittance Measurement: A Statistical Approach",
      "authors": [
        "K.P. Wootton",
        "R.P. Rassool",
        "The University of Melbourne",
        "Melbourne",
        "Australia",
        "M.J. Boland",
        "B.C.C. Cowie",
        "R.T. Dowd",
        "SLSA",
        "Clayton",
        "Australia",
        "Direct measurement of low vertical emittance in storage rings is typically achieved via interferometric techniques. Proof of low vertical emittance is demonstrated by the measurement of a null radiation field",
        "which is also the crux of the vertical undulator emittance measurement. Here we present strategies to improve the sensitivity to low vertical emittance beams. We move away from photon spectrum analysis to a statistical analysis of undulator radiation",
        "showing the measured increase in signal-to-background. Reproducing simulations of previous work",
        "we demonstrate that photon beam polarisation extends the linearity of the technique by several decades in emittance. These statistical and polarisation improvements to the signal-to-background allow realistic measurement of smallest vertical emittance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf18.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF18",
      "page_number": "543",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF19",
      "title": "APPLE-II Undulator Magnetic Fields Characterised from Undulator Radiation",
      "authors": [
        "K.P. Wootton",
        "R.P. Rassool",
        "The University of Melbourne",
        "Melbourne",
        "Australia",
        "M.J. Boland",
        "B.C.C. Cowie",
        "SLSA",
        "Clayton",
        "Australia",
        "The spatial profile of APPLE-II undulator radiation has been measured at high undulator deflection parameter",
        "high harmonic and very small emittance. Undulators are typically designed to operate with small deflection parameter to push the fundamental mode to high photon energies. This unusual choice of parameters is desirable for measurement of vertical emittance with a vertical undulator. We present 1-D and 2-D measured profiles of undulator radiation",
        "and show that this is reproduced in numerical models using the measured magnetic field of the insertion device. Importantly these measurements confirm that for these parameters",
        "the spatial intensity distribution departs significantly from usual Gaussian approximations",
        "instead resembling a double-slit diffraction pattern. This could be an important consideration for photon beamlines of ultimate storage ring light sources."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf19.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF19",
      "page_number": "546",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF20",
      "title": "Low Noise and High Dynamic Range Optical Interferometer Beamsize Measurements",
      "authors": [
        "SLSA",
        "Clayton",
        "Australia",
        "KEK",
        "Ibaraki",
        "Japan",
        "The University of Melbourne",
        "Melbourne",
        "Australia"
      ],
      "institutions": [
        "The technique of optical interferometry to measure beam sizes requires a low noise and high dynamic range digitisation system to push the performance to ultra low emittance on storage rings. The next generation of camera sensor Scientific CMOS (sCMOS) promises to provide the technology to improve optical interferometry. A series of measurements was performed on the Australian Synchrotron storage ring using a sCMOS and a intensity imbalance optical interferometer. The coupling in the storage ring was varied from maximum to minimum using the skew quadrupoles and the beam size at the optical diagnostic beamline was varied from over 100 microns to around 1 micron. A comparison is made between interferometer measurements using the sCMOS with and without an intensity imbalance and with previous measurements using a CCD system."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf20.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF20",
      "page_number": "550",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF21",
      "title": "Response of Scintillating Screens to Fast and Slow Extracted Ion Beams",
      "authors": [
        "A. Lieberwirth",
        "W. Ensinger",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "P. Forck",
        "B. Walasek-Höhne",
        "GSI",
        "Darmstadt",
        "Germany",
        "For the FAIR project",
        "imaging properties of inorganic scintillators for high energetic heavy ion beams were studied. In order to investigate the characteristics of scintillation response and transverse beam profile",
        "several experiments were conducted with slow (200 ms) and fast (1 μs) extracted 350 MeV/u Uranium beams from SIS18. The extracted particle number was varied between 105 and 109 particles per pulse for the irradiation of seven different scintillators: YAG:Ce-crystals with different qualities",
        "pure and Cr-doped alumina as well as two phosphors P43 and P46. Additionally radiation resistance tests for all phosphor screens and the Cr-doped alumina screen were performed by irradiating with more than 700 pulses with 109 ions each. Linear response in scintillation light output as well as realistic statistical moments over the large range of ion intensities are presented for each material. Only minor changing in target response was observed after 45 minutes of permanent irradiation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf21.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF21",
      "page_number": "553",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF22",
      "title": "Beam Halo Monitor Based on an HD Digital Micro Mirror Array",
      "authors": [
        "B.B.D. Lomberg",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "B.B.D. Lomberg",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A beam halo monitor is an essential device to pursue studies of halo particles produced in any particle accelerator as to investigate the effects of disturbances",
        "such as field kicks",
        "gradient errors",
        "etc. A fast",
        "least intrusive",
        "high dynamic range monitor will allow the detection and potentially control of particles at the tail of a transverse beam distribution. Light generated by a beam of charged particles is routinely used for beam diagnostic purposes. A halo monitor based on a digital micro-mirror device (DMD) used to generate an adaptive optical mask to block light in the core of the emitted light profile and hence limit observation to halo particles has been developed in close collaboration with CERN and University of Maryland. In this contribution an evolution of this monitor is presented. A high definition micro-mirror array with 1920x1080 pixels has been embedded into a MATLAB-based control system",
        "giving access to even higher monitor resolution. A masking algorithm has also been developed that automates mask generation based on user-definable thresholds",
        "converts between CCD and DMD geometries",
        "processes and analyses the beam halo signal and is presented in detail."
      ],
      "institutions": [
        "Funding: This work is supported by the European Union under contract PITN-GA-2011-289485 and by STFC under the Cockcroft Institute Core Grant No. ST/G008248/1."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf22.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF22",
      "page_number": "557",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF24",
      "title": "Instrumentation for the Proposed Low Energy RHIC Electron Cooling Project",
      "authors": [
        "D.M. Gassner",
        "A.V. Fedotov",
        "D. Kayran",
        "V. Litvinenko",
        "R.J. Michnoff",
        "T.A. Miller",
        "M.G. Minty",
        "I. Pinayev",
        "M. Wilinski",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "There is a strong interest in running RHIC at low ion beam energies of 2.5-20GeV/nucleon; this is much lower than the typical operations with 100GeV/nucleon. The primary motivation for this effort is to explore the existence and location of the critical point on the QCD phase diagram. Electron cooling can increase the average integrated luminosity and increase the length of the stored lifetime. Simulations and conceptual cooling sub-system designs are underway. The present plan is to provide 10–50mA of bunched electron beam with adequate quality and an energy range of 0.9–5MeV. The preliminary cooling facility configuration planned to be fully inside the RHIC tunnel will include a 102.74MHz SRF gun",
        "a booster cavity",
        "a beam transport to the Blue ring to allow electron-ion co-propagation for ~10-20m",
        "then a 180 degree u-turn electron transport so the same electron beam can similarly cool the Yellow ion beam",
        "then to a dump. The electron beam instrumentation systems that will be described include current transformers",
        "BPMs",
        "profile monitors",
        "a pepper pot emittance station and loss monitors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf24.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF24",
      "page_number": "561",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF25",
      "title": "Beam Current Measurement System in CSNS LINAC",
      "authors": [
        "P. Li",
        "F. Li",
        "M. Meng",
        "T.G. Xu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The China Spallation Neutron Source is being constructed at Dongguan",
        "Guangdogn province. Before RCS Ring there are three beam transport sections in CSNS LINAC : LEBT",
        "MEBT",
        "LRBT",
        "where various beam measurement monitors will be installed. Beam Current Transformers (BCTs) have been designed to measure beam macro-pulse current that will operate between 5mA to 80mA . The BCTs have the same inductance but different size in these three sections. Besides",
        "beam parameters should be monitored also between the DTL four parts. There is no BCT but a FCT would be installed after DTL1 due to space limit. So this FCT is planned to measure the macro-pulse current",
        "and we have to proceed the acquired data to show the original macro-pulse waveform due to the FCT’s low inductance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf25.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF25",
      "page_number": "565",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF26",
      "title": "Laser-Based Beam Instrumentation R&D within LA3NET",
      "authors": [
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "Within LA3NET",
        "Laser Applications for Accelerators are being developed by an international NETwork of more than 30 partner institutions from across the world. Laser-based beam instrumentation is at the core of this EU-funded project which will train 17 fellows during its four year project duration. In this contribution",
        "we will present the consortium's recent research results in beam diagnostics",
        "ranging from development of a laser velocimeter and laser emittance meter",
        "over measurement of the bunch shape with electro-optical sampling in an electron accelerator and precision determination of electron beam energy with Compton backscattered laser photons to measurement of electron bunches with a time resolution of better than 20 femtoseconds. We will also provide a summary of past training events organized by the consortium and give an overview of future workshops",
        "conferences and schools."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf26.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF26",
      "page_number": "567",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF27",
      "title": "An Ultra Low-Noise AC Beam Transformer and Digital Signal Processing System for CERN’s ELENA Ring",
      "authors": [
        "M.E. Angoletta",
        "C. Carli",
        "F. Caspers",
        "S. Federmann",
        "J.C. Molendijk",
        "F. Pedersen",
        "J. Sanchez-Quesada",
        "CERN",
        "Geneva",
        "Switzerland",
        "CERN’s Extra Low ENergy Antiproton (ELENA) Ring is a new synchrotron that will be commissioned in 2016 to further decelerate the antiprotons coming from CERN’s Antiproton Decelerator. Essential longitudinal diagnostics required for commissioning and operation include the intensity measurement for bunched and debunched beams and the measurement of Dp/p for debunched beams to assess the electron cooling performance. The beam phase information is also needed by the low-level RF system. The baseline system for providing the required beam parameters and signals is based upon two ultra-low-noise AC beam transformers and associated digital signal processing. The AC beam transformers cover different frequency regions and are an adaptation to the ELENA layout of those used in the AD. Two AC beam transformers will also be installed in the extraction lines to provide beam intensity and bunch shape measurements. The digital signal processing will be carried out with the leading-edge hardware family used for ELENA’s low-level RF system. The paper provides an overview of the beam transformer and head amplifier",
        "as well as of the associated digital signal processing."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf27.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF27",
      "page_number": "571",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF28",
      "title": "A Leading-Edge Hardware Family for Diagnostics Applications and Low-Level RF in CERN’s ELENA Ring",
      "authors": [
        "M.E. Angoletta",
        "A. Blas",
        "M. Jaussi",
        "P.M. Leinonen",
        "T.E. Levens",
        "J.C. Molendijk",
        "J. Sanchez-Quesada",
        "J. Simonin",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN Extra Low ENergy Antiproton (ELENA) Ring is a new synchrotron that will be commissioned in 2016 to further decelerate the antiprotons transferred from the CERN’s Antiproton Decelerator (AD). The requirements for the acquisition and treatment of signals for longitudinal diagnostics are very demanding",
        "owing to the revolution frequency swing as well as to the digital signal processing required. The requirements for the Low-Level RF (LLRF) system are very demanding as well",
        "especially in terms of revolution frequency swing",
        "dynamic range and low noise required by the cavity voltage control and digital signal processing to be performed. Both sets of requirements will be satisfied by using a leading-edge hardware family",
        "developed to cover the LLRF needs of all synchrotrons in the Meyrin site; it will be first deployed in 2014 in the CERN’s PSB and in the medical machine MedAustron. This paper gives an overview of the main building blocks of the hardware family and of the associated firmware and IP cores. The performance of some blocks will also be detailed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf28.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF28",
      "page_number": "575",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF29",
      "title": "Tune Measurement from Transverse Feedback Signals in LHC",
      "authors": [
        "F. Dubouchet",
        "W. Höfle",
        "G. Kotzian",
        "T.E. Levens",
        "D. Valuch",
        "CERN",
        "Geneva",
        "Switzerland",
        "HES-SO//Geneva",
        "Geneva",
        "Switzerland",
        "We show how bunch-by-bunch position data from the LHC transverse feedback system can be used to determine the transverse tunes. Results from machine development experiments are presented and compared with theoretical predictions. In the absence of external beam excitations the tune is visible in the spectra of the position data with the feedback loop as a dip",
        "while with external excitation a peak is visible. Both options",
        "observation with and without excitation",
        "are demonstrated to be complementary. Periodic excitation and observation of the free oscillation can also be used to determine the damping time of the feedback in addition to the coherent tune. Plans are outlined for hardware upgrades of the LHC transverse feedback system that will enable fast online processing of bunch-by-bunch",
        "turn-by-turn data using Graphical Processing Units (GPU). By using GPUs we gain the ability to compute and store the spectrum of all bunches in real-time and the possibility to reconfigure test and deploy algorithms. This data acquisition and analysis architecture also allows changes to be made without disturbing the operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf29.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF29",
      "page_number": "579",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF30",
      "title": "Measurements with the Upgraded Cryogenic Current Comparator",
      "authors": [
        "F. Kurian",
        "P. Hülsmann",
        "P. Kowina",
        "H. Reeg",
        "M. Schwickert",
        "GSI",
        "Darmstadt",
        "Germany",
        "R. Geithner",
        "R. Neubert",
        "W. Vodel",
        "FSU Jena",
        "Jena",
        "Germany",
        "R. Geithner",
        "W. Vodel",
        "HIJ",
        "Jena",
        "Germany",
        "For the measurement of the very low ion beam current -down to nA range- foreseen in the High Energy Transport sections of the upcoming FAIR facility",
        "an improved Cryogenic Current Comparator (CCC) is under development at GSI. The existing CCC unit",
        "initially operated at the high energy beam transport section after the GSI synchrotron SIS18",
        "has been upgraded as a prototype for FAIR. The upgraded CCC is presently being re-commissioned. In this contribution we report on beam current measurements with the improved detector unit down to 5 nA simulated by a wire loop wound around the magnetic sensor. As mechanical vibrations strongly influence the sensitive SQUID detector",
        "vibration analyses have been carried out using an accelerometer. Noise contributions from various mechanical as well as electrical sources were studied and the achieved detector performance is presented"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf30.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF30",
      "page_number": "583",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF31",
      "title": "Intensity Control in GANIL’s Experimental Rooms",
      "authors": [
        "C. Courtois",
        "C. Doutresssoulles",
        "B. Ducoudret",
        "C. Jamet",
        "W. Le Coz",
        "G. Ledu",
        "C. Potier de courcy",
        "GANIL",
        "Caen",
        "France",
        "The safety re-examination of existing GANIL facilities requires the implementation of a safety system which makes a control of beam intensities sent in the experimental rooms possible. The aim is to demonstrate that beam intensities are below the authorized limits. The required characteristics should enable the measurement",
        "by a non-interceptive method",
        "of beam intensities from 5 nA to 5μA with a maximum uncertainty of 5%",
        "independently of the frequency and the beam energy. After a comparative study",
        "two types of high frequency diagnostics were selected",
        "the capacitive peak-up and the Fast current transformer. This paper presents the signal simulations from diagnostics with different beam energies",
        "the uncertainty calculations and the results of the first tests with beam."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf31.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF31",
      "page_number": "587",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF32",
      "title": "A Cryogenic Current Comparator for FAIR with Improved Resolution",
      "authors": [
        "R. Geithner",
        "W. Vodel",
        "HIJ",
        "Jena",
        "Germany",
        "R. Geithner",
        "R. Neubert",
        "P. Seidel",
        "FSU Jena",
        "Jena",
        "Germany",
        "F. Kurian",
        "H. Reeg",
        "M. Schwickert",
        "GSI",
        "Darmstadt",
        "Germany",
        "A Cryogenic Current Comparator is a highly sensitive tool for the non-destructive online monitoring of continuous as well as bunched beams of very low intensities. The noise-limited current resolution of such a device depends on the ferromagnetic material embedded in the pickup coil of the CCC. Therefore",
        "the main focus of research was on the low temperature properties of ferromagnetic core materials. In this contribution we present first results of the completed Cryogenic Current Comparator for FAIR working in a laboratory environment",
        "regarding the improvements in resolution due to the use of suitable ferromagnetic core materials."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf32.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF32",
      "page_number": "590",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF33",
      "title": "Electron Beam Diagnostics Using Radiation from a Free Electron Laser",
      "authors": [
        "H.I.T.",
        "Holon",
        "Israel",
        "Ariel University Center of Samaria",
        "Faculty of Engineering",
        "Ariel",
        "Israel",
        "In most devices based on a high energy electron beam",
        "which used for electromagnetic radiation production",
        "great efforts are focused on the electron beam quality improvement. This is the case in a Free-Electron Laser (FEL) where electron beam with a low normalized emittance is required. Thus",
        "diagnostic tools are required to investigate e-beam properties",
        "such as beam emittance",
        "longitudinal space charge",
        "energy spread and velocity spread. In this paper we present analysis of radiation measurements obtained from a pre-bunched e-beam FEL. The measurements were made for a wide range of frequencies and for beam currents from low currents to high currents",
        "where space charge effects can not neglected. We apply a frequency domain formulation to analyze the measured radiation. The spectral signature of the radiation emission obtained from a pre-bunched e-beam can provide vital information on e-beam properties. We show that a rigorous analysis of the measured radiation",
        "allows characterization of the e-beam parameters. This analysis can provide some insights to the development of e-beam accelerators and radiation sources devices and to help physicists interpreting radiated signals."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf33.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF33",
      "page_number": "593",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPF34",
      "title": "Resonant TE Wave Measurement of Electron Cloud Density Using Multiple Sidebands",
      "authors": [
        "J.P. Sikora",
        "J.A. Crittenden",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "ISU",
        "Pocatello",
        "Idaho",
        "USA",
        "A change in electron cloud (EC) density will change the resonant frequency of a section of beam-pipe. With a fixed drive frequency",
        "the resulting dynamic phase shift across the resonant section will include the convolution of the frequency shift with the impulse response of the resonance. The effect of the convolution on the calculated modulation sidebands is in agreement with measured data",
        "including the absolute value of the EC density obtained from ECLOUD simulations. These measurements were made at the Cornell Electron Storage Ring (CESR) which has been reconfigured as a test accelerator (CesrTA) with positron or electron beam energies ranging from 2 GeV to 5 GeV."
      ],
      "institutions": [
        "Funding: This work is supported by the US National Science Foundation PHY-0734867, PHY-1002467, and the US Department of Energy DE-FC02-08ER41538, DE-SC0006505."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf34.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF34",
      "page_number": "597",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF35",
      "title": "Resonant TE Wave Measurement of Electron Cloud Density Using Phase Detection",
      "authors": [
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA"
      ],
      "institutions": [
        "Funding: This work is supported by the US National Science Foundation PHY-0734867, PHY-1002467, and the US Department of Energy DE-FC02-08ER41538, DE-SC0006505."
      ],
      "abstract": "The resonant TE wave technique can use modulation sidebands for the calculation of electron cloud (EC) density. An alternative is to mix the drive and received signals to form a phase detector. Using this technique, the phase shift across the resonant section of beam-pipe can be observed directly on an oscilloscope. The growth and decay of the EC density has a time constant of roughly 100 ns, while the measured phase shift will include a convolution of the EC density with the impulse response of the resonant beam-pipe - typically about 500 ns. So any estimate of the growth/decay of the cloud requires deconvolution of the measured signal with the response time of the resonance. We have also used this technique to look for evidence of EC density with a lifetime that is long compare to the revolution period of the stored beam. These measurements were made at the Cornell Electron Storage Ring (CESR) which has been reconfigured as a test accelerator (CesrTA) with positron or electron beam energies ranging from 2 GeV to 5 GeV.",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf35.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF35",
      "page_number": "601",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPF36",
      "title": "Analysis of Modulation Signals Generated in the TE Wave Detection Method For Electron Cloud Measurements",
      "authors": [
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The evaluation of the electron cloud density in storage rings by measuring its effects on the transmission of electromagnetic signals across portions of the beampipe is a widely used technique and the most suited for measurements over extended regions. Recent results show that in a majority of cases the RF signal transmission takes place by coupling to standing waves excited in the vacuum chamber. In such a case the effect of a varying cloud density is a simultaneous amplitude",
        "phase and frequency modulation of a fixed frequency drive signal. The characteristics of the modulation depend not only on the cloud density values and spatial distribution",
        "but also on its temporal evolution and on the damping time of the standing waves. In this paper we evaluate the relationship between measured modulation sidebands amplitude and the electron cloud density when cloud and electromagnetic resonance rise and fall times are of the same order of magnitude",
        "as it is the case in the accelerators where we have conducted our experiments."
      ],
      "institutions": [
        "Funding: Work supported by the U.S. Department of Energy and by the US National Science Foundation under Contracts No. DE-AC02-05CH11231, DE-FC02-08ER41538, DE-SC0006505, PHY-0734867, PHY-1002467."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tupf36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tupf36.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tupf36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUPF36",
      "page_number": "605",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 33,
  "scrape_time": "2025-10-10 18:00:16"
}