{
  "session_info": {
    "id": "TUOBA",
    "name": "TUOBA - Contributed Oral Presentations, Circular and Linear Colliders",
    "url": "https://proceedings.jacow.org/IPAC2014/html/tuoba.htm"
  },
  "papers": [
    {
      "paper_id": "TUOBA01",
      "title": "Electron Lenses for the Large Hadron Collider",
      "authors": [
        "G. Stancari",
        "A. Valishev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "R. Bruce",
        "S. Redaelli",
        "A. Rossi",
        "B. Salvachua",
        "CERN",
        "Geneva",
        "Switzerland",
        "Electron lenses are pulsed",
        "magnetically confined electron beams whose current-density profile is shaped to obtain the desired effect on the circulating beam. Electron lenses were used in the Fermilab Tevatron collider for bunch-by-bunch compensation of long-range beam-beam tune shifts",
        "for removal of uncaptured particles in the abort gap",
        "for preliminary experiments on head-on beam-beam compensation",
        "and for the demonstration of halo scraping with hollow electron beams. Electron lenses for beam-beam compensation are being commissioned in RHIC at BNL. Within the US LHC Accelerator Research Program and the European HiLumi LHC Design Study",
        "hollow electron beam collimation was studied as an option to complement the collimation system for the LHC upgrades. This project is moving towards a technical design in 2014",
        "with the goal to build the devices in 2015-2017",
        "after resuming LHC operations and re-assessing needs and requirements at 6.5 TeV. Because of their electric charge and the absence of materials close to the proton beam",
        "electron lenses may also provide an alternative to wires for long-range beam-beam compensation in LHC luminosity upgrade scenarios with small crossing angles."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/tuoba01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/tuoba01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/tuoba01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-TUOBA01",
      "page_number": "918",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOBA02",
      "title": "Design Study of an ERL Test Facility at CERN",
      "authors": [
        "E. Jensen",
        "C. Bracco",
        "O.S. Brüning",
        "R. Calaga",
        "N. Catalán Lasheras",
        "B. Goddard",
        "R. Torres-Sanchez",
        "A. Valloni",
        "CERN",
        "Geneva",
        "Switzerland",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "The modern concept of an Energy Recovery Linac allows providing large electron currents at large beam energy with low power consumption. This concept is used in FEL’s",
        "electron-ion colliders and electron coolers. CERN has started a Design Study of an ERL Test Facility with the purpose of 1) studying the ERL principle",
        "its specific beam dynamics and operational issues",
        "as relevant for LHeC",
        "2) providing a test bed for superconducting cavity modules",
        "cryogenics and integration",
        "3) studying beam induced quenches in superconducting magnets and protection methods",
        "4) providing test beams for detector R&D and other applications. It will be complementary to existing or planned facilities and is fostering international collaboration. The operating frequency of 802 MHz was chosen for performance and for optimum synergy with SPS and LHC; the design of the cryomodule has started. The ERL Test Facility can be constructed in stages from initially 150 MeV to ultimately 1 GeV in 3 passes",
        "with beam currents of up to 80 mA. Parameters to serve the above-mentioned purposes are well defined and possible lattice designs have well advanced."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/tuoba02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/tuoba02.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/tuoba02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-TUOBA02",
      "page_number": "921",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOBA03",
      "title": "Recent Beam-beam Effects and Luminosity at VEPP-2000",
      "authors": [
        "D.B. Shwartz",
        "D.E. Berkaev",
        "A.S. Kasaev",
        "I. Koop",
        "A.N. Kyrpotin",
        "A.P. Lysenko",
        "E. Perevedentsev",
        "V.P. Prosvetov",
        "Yu. A. Rogovsky",
        "A.L. Romanov",
        "A.I. Senchenko",
        "P.Yu. Shatunov",
        "Y.M. Shatunov",
        "I.M. Zemlyansky",
        "Yu.M. Zharinov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "VEPP-2000's last season was dedicated to the energy range of 160-520 MeV per beam. The application of round colliding beams concept along with the accurate orbit and lattice correction yielded the high peak luminosity of 1.2*1031 cm-2s−1 at 500 MeV with average luminosity of 0.9*1031 cm-2s−1 per run. The total beam-beam tune shift up to 0.174 was achieved in the runs at 392.5 MeV. This corresponds to beam-beam parameter ksi = 0.125 per one interaction point. The injection system is currently being upgraded to allow for the injection at the top energy of VEPP-2000 collider and to eliminate the present lack of positrons.",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/tuoba03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/tuoba03.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/tuoba03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-TUOBA03",
      "page_number": "924",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 20:40:18"
}