{
  "session_info": {
    "id": "TUXGBF",
    "name": "TUXGBF - MC5 Orals",
    "url": "https://proceedings.jacow.org/ipac2018/html/tuxgbf.htm"
  },
  "papers": [
    {
      "paper_id": "TUXGBF1",
      "title": "XFEL Impedance Effects and Mitigation",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "A detailed impedance budget has been set up for the European XFEL",
        "including the contributions from 2000 components",
        "such as 824 cavities",
        "500 flanges",
        "220 BPMs (5 types",
        "78 pumps",
        "20 OTR screens",
        "7 collimators",
        "5 BAMs",
        "3 kickers",
        "warm pipe etc. Both surface effects and geometric effects are important. Bunch compression and warm beam pipe require additional consideration. Most important are possible beam degradation affecting the FEL operation. Longitudinal wake fields lead to energy losses and unwanted energy spread. Even with mitigation",
        "the wake-induced energy loss are larger than the energy losses due to the FEL lasing process. Various technical solutions have been developed to minimize the effects. This invited talk presents the basis for these simulations",
        "their results",
        "and comparisons with recent beam measurements in the European XFEL."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tuxgbf1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tuxgbf1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tuxgbf1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUXGBF1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXGBF2",
      "title": "Higher-Order-Mode Effects in Tesla-Type Superconducting RF Cavities on Electron Beam Quality",
      "authors": [
        "A.H. Lumpkin",
        "N. Eddy",
        "D.R. Edstrom",
        "P.S. Prieto",
        "J. Ruan",
        "R.M. Thurman-Keup",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "K. Bishofberger",
        "B.E. Carlsten",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "CEA/DSM/IRFU",
        "France",
        "We report the direct observations of the correlation of higher order modes (HOMs) generated by off-axis electron beam steering in TESLA-type SCRF cavities and sub-macropulse beam centroid shifts (with the concomitant effect on averaged beam size and emittance). The experiments were performed at the Fermilab Accelerator Science and Technology (FAST) facility using its unique configuration of a PC rf gun injecting beam into two separated 9-cell cavities in series with corrector magnets and beam position monitors (BPMs) located before",
        "between",
        "and after them. The ~100-kHz oscillations with up to 300-μm amplitudes at downstream locations were observed in a 3-MHz micropulse repetition rate beam with charges of 500 and 1000 pC/b",
        "although the effects were much reduced at 100 pC/b. The studies were based on HOM detector circuitry targeting the first and second dipole passbands",
        "rf BPM bunch-by-bunch data",
        "and imaging cameras viewing multi-slit images for emittance assessments at 33 MeV. Initial calculations reproduced a key feature of the phenomena. In principle",
        "these results may be scaled to cryomodule configurations of major accelerator facilities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tuxgbf2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tuxgbf2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tuxgbf2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUXGBF2",
      "page_number": "612",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXGBF3",
      "title": "Reduction of the Kicker Impedance Maintaining the Performance of Present Kicker Magnet at RCS in J-PARC",
      "authors": [
        "Y. Shobuda",
        "Y. Irie",
        "T. Takayanagi",
        "T. Togashi",
        "K. Yamamoto",
        "M. Yamamoto",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "The present kicker at RCS in J-PARC is designed to make a waveform by superposing the forward and backward currents from the power source to extract beams",
        "so that one terminal of the kicker is shorted and the other one is open. On the other hand",
        "the kicker impedance is the dominant source of the beam instability at the RCS. This report proposes a scheme to reduce the kicker impedance",
        "maintaining the beneficial of the superposition of currents with the present kicker magnet."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tuxgbf3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tuxgbf3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tuxgbf3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUXGBF3",
      "page_number": "616",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXGBF4",
      "title": "ORBIT Simulation, Measurement and Mitigation of Transverse Beam Instability in the Presence of Strong Space Charge in the 3-GeV RCS of J-PARC",
      "authors": [
        "P.K. Saha",
        "H. Harada",
        "N. Hayashi",
        "H. Hotchi",
        "Y. Shobuda",
        "F. Tamura",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "The transverse impedance of eight extraction pulse kicker magnets (KM) is extremely strong source of transverse beam instability in the 3-GeV RCS (Rapid Cycling Synchrotron) at J-PARC. To realize the designed 1 MW beam power",
        "collective beam dynamics with including the space charge effect for the coupled bunch instabilities excited by the KM impedance and associated measures were studied by incorporating all realistic time-dependent machine parameters in the ORBIT 3-D particle tracking code. The simulation results were all reproduced by measurements and",
        "as a consequence",
        "an acceleration of 1 MW beam power has been successfully demonstrated. In order to maintain variation of the RCS parameters required for multi-user operation",
        "realistic measures for beam instability mitigation were proposed and also been successfully implemented in reality. To further increase the RCS beam power",
        "beam stability issues and possible measures beyond 1 MW beam power are also considered."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tuxgbf4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tuxgbf4.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tuxgbf4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUXGBF4",
      "page_number": "620",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 19:24:26"
}