{
  "session_info": {
    "id": "TUXB",
    "name": "TUXB - Invited Oral Presentation, Beam Dynamics and Electromagnetic Fields",
    "url": "https://proceedings.jacow.org/ipac2016/html/tuxb.htm"
  },
  "papers": [
    {
      "paper_id": "TUXB01",
      "title": "High Power Radiation Sources using the Steady-state Microbunching Mechanism",
      "authors": [
        "A. Chao",
        "E. Granados",
        "X. Huang",
        "D.F. Ratner",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "NTHU",
        "Hsinchu",
        "Taiwan",
        "The mechanism of steady-state microbunching (SSMB) was proposed for providing high power coherent radiation using electron storage rings. The mechanism follows closely the RF bunching in conventional storage rings",
        "except that the energy modulation of by an RF system at a microwave wavelength is replaced by a seeded laser in an undulator at an optical wavelength. No FEL mechanism",
        "and thus no FEL energy heating",
        "is invoked. The basic idea is firstly to make the beam microbunched so that its radiation becomes coherent",
        "and secondly to make the microbunching a steady state so that the coherent radiation is maintained at every turn. The combination of the high repetition rate of a storage ring and the enhanced radiation power by a factor of N (the number of electrons in the microbunches within one coherence length) opens the possibility as well as challenges of very high power SSMB sources. To explore its potential reach",
        "we apply SSMB to the infrared",
        "deep ultraviolet and EUV regions and estimate their respective power levels using"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/tuxb01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/tuxb01.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/tuxb01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-TUXB01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 20:06:04"
}