{
  "session_info": {
    "id": "THAL",
    "name": "THAL - Instrumentation News",
    "url": "https://proceedings.jacow.org/ibic2016/html/thal.htm"
  },
  "papers": [
    {
      "paper_id": "THAL01",
      "title": "PALM Concepts and Considerations",
      "authors": [
        "P.N. Juranič",
        "R. Abela",
        "I. Gorgisyan",
        "C.P. Hauri",
        "R. Ischebeck",
        "B. Monoszlai",
        "L. Patthey",
        "C. Pradervand",
        "M. Radović",
        "L. Rivkin",
        "V. Schlott",
        "A.G. Stepanov",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "C.P. Hauri",
        "L. Rivkin",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "R. Ivanov",
        "P. Peier",
        "DESY",
        "Hamburg",
        "Germany",
        "XFEL. EU",
        "Hamburg",
        "Germany",
        "K. Ogawa",
        "T. Togashi",
        "M. Yabashi",
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "JASRI/RIKEN",
        "Hyogo",
        "Japan",
        "The Photon Arrival and Length Monitor (PALM)",
        "a THz streak camera device developed by PSI for non-destructive hard x-ray measurements of photon pulse length and arrival time versus a pump laser*",
        "was brought to the SACLA XFEL** in Japan in a cross-calibration temporal diagnostics campaign after an initial experiment where only the PALM was being used***. The device was used with 9 keV pink beam and a 9.0 and 8.8 keV two-color mode",
        "successfully measuring the arrival time and pulse lengths for several different FEL operating conditions. The device has shown itself to be very robust and transparent to the FEL beam",
        "with temporal characterization accuracies of 15 fs or better. SwissFEL will employ two such devices at the end stations for use by both operators and experimenters to improve the operation of the FEL and to better interpret experimental data. This report presents the PALM and its uses and capabilities",
        "and discusses the results from the SACLA cross-calibration experiments.",
        "* P. N. Juranic et. al",
        "Journal of Instrumentation (2014) 9.  ** T. Ishikawa et. al.",
        "Nature Photonics (2012) 6(8).   *** P. N. Juranic et. al.",
        "Optics Express (2014) 22."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/thal01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/thal01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/thal01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-THAL01",
      "page_number": "848",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAL02",
      "title": "Recent Developments for Instability Monitoring at the LHC",
      "authors": [
        "T.E. Levens",
        "K. Łasocha",
        "T. Lefèvre",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [],
      "abstract": "A limiting factor on the maximum beam intensity that can be stored in the Large Hadron Collider (LHC) is the growth of transverse beam instabilities. Understanding and mitigating these effects requires a good knowledge of the beam parameters during the instability in order to identify the cause and provide the necessary corrections. This paper presents the suite of beam diagnostics that have been put into operation to monitor these beam instabilities and the development of a trigger system to allow measurements to be made synchronously with multiple instruments as soon as any instability is detected.",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/thal02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/thal02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/thal02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-THAL02",
      "page_number": "852",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THAL03",
      "title": "Multi-Laser-Wire Diagnostic for the Beam Profile Measurement of a Negative Hydrogen Ion Beam in the J-PARC LINAC",
      "authors": [
        "A. Miura",
        "K. Okabe",
        "M. Yoshimoto",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "KEK",
        "Ibaraki",
        "Japan",
        "In the J-PARC linac",
        "the negative hydrogen ion beam is acceralated to be 400 MeV. Repitition rate will be increased to be from 25 Hz to 50 Hz. The half of 400 MeV beams are injected to the downstream scynchlotoron (RCS) and the other half will be transported to the planned experimental laboratory of the accelerator driven transmutation facility. One of the important issues for the high-current and high-brilliance accelerators is to understand the beam dynamics. The wire scanner monitor is reliably operated in many accelerator facilities around the world. Because the heat loading on a wire is getting increaced in high-current beam tuning",
        "we focused to use a laser wire system. Ionization potential of the negative hydrogen ion is 0.75 eV and one electron is easily detached by a laser beam whose wavelength is adjusted by the Doppler-shift to a large cross-section point. In addition",
        "we propose to use a new multi-laser-wire system. In the new system",
        "we use a pair of concave millors with different diameters to make multi-paths of laser beam",
        "and the beam waists of the laser paths are aligned in principle. In the paper",
        "we propose the multi-laser-wire system and its application."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/thal03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/thal03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/thal03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-THAL03",
      "page_number": "856",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:53:19"
}