{
  "session_info": {
    "id": "TUIYSP",
    "name": "TUIYSP - Invited Orals: Photon Sources and Electron Accelerators",
    "url": "https://proceedings.jacow.org/ipac2022/html/tuiysp.htm"
  },
  "papers": [
    {
      "paper_id": "TUIYSP1",
      "title": "Science Highlights From Hard X-Ray FELs",
      "authors": [
        "EuXFEL",
        "Hamburg",
        "Germany",
        "X-ray Free-Electron Lasers (XFELs)",
        "using high energy electron accelerators",
        "are in operation since little more than a decade and have become a highly successful platform for scientific applications. From physics via chemistry and life-science to materials and planetary sciences XFELs are used to study atomic and electronic structure with angstrom and femtosecond resolution. The presentation will show examples of high impact research at the various facilities. A relation between the special features these XFEL facilities provide and the science enabled by them will be discussed. In the last part emphasis will be given to on-going and future developments adding capability to the XFEL facilities with the goal to widen the scientific applications and thus societal impact."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/tuiysp1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/tuiysp1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/tuiysp1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-TUIYSP1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUIYSP2",
      "title": "Self-Amplification of Coherent Energy Modulation in Seeded Free-Electron Lasers",
      "authors": [
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "We report a novel self-amplification method for enhancing laser-induced energy modulation",
        "thereby significantly reducing requirements on the external laser system in a seeded free-electron laser (FEL). Driven by this scheme",
        "we experimentally realized high harmonic generation in a seeded FEL using an unprecedentedly small external laser-induced energy modulation. An electron beam with the laser-induced energy modulation as small as 1.8 times the slice energy spread has been used for lasing at the seventh harmonic of 266-nm seed laser in a single-stage high-gain harmonic generation (HGHG) setup and the 30th harmonic of the seed laser in a two-stage HGHG setup. The results mark a major step towards a high-repetition-rate",
        "fully coherent X-ray FEL."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/tuiysp2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/tuiysp2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/tuiysp2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-TUIYSP2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUIYSP3",
      "title": "Research and Development Towards Cavity-Based X-ray Free-Electron Lasers",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Cavity-based X-ray free-electron laser concepts such as the regenerative amplifier FELs (RAFEL) and the X-ray FEL oscillator (XFELO) offer a promising path towards enhancing the brightness of XFELs by up to two orders of magnitude. We will present the ongoing research effort at the SLAC National Accelerator Laboratory and Argonne National Laboratory to demonstrate these concepts. We will discuss recent experimental tests of X-ray cavity performance and present plans for a proof-of-principle experiment at LCLS",
        "as well as ideas for future cavity-based XFEL facilities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/tuiysp3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/tuiysp3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/tuiysp3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-TUIYSP3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 18:36:39"
}