{
  "session_info": {
    "id": "TUPSO",
    "name": "TUPSO - Technology I & III",
    "url": "https://proceedings.jacow.org/FEL2013/html/tupso.htm"
  },
  "papers": [
    {
      "paper_id": "TUPSO01",
      "title": "Corrector Response Based Alignment at FERMI",
      "authors": [
        "M. Aiba",
        "M. Böge",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "D. Castronovo",
        "S. Di Mitri",
        "L. Fröhlich",
        "G. Gaio",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "The components of an FEL accelerator generally need to be beam-based aligned in order to meet the design performance. We are developing new technique",
        "where dipole corrector responses are used instead of orbit difference measurements. When an orbit feedback is running",
        "any change in beam orbit is compensated by the actuators",
        "i.e.",
        "the dipole correctors. For example",
        "the spurious dispersion through linac rf structures",
        "which is a source of emittance degradation",
        "is measured through orbit differences for various beam momenta in the conventional way while dipole corrector responses are examined in the new method. The advantages are localization of misalignments",
        "stable measurement as the orbit is kept constant",
        "and automatic averaging and beam jitter filtering by the feedback loop. Furthermore",
        "this method potentially allows us to detect transverse wakefield kicks",
        "which are also an emittance degradation source",
        "by looking into the dipole corrector responses to a change in bunch charge or bunch length. The results from a series of machine development shifts will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso01.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO01",
      "page_number": "205",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO03",
      "title": "Dark Current Transport and Collimation Studies for SwissFEL",
      "authors": [
        "S. Bettoni",
        "P. Craievich",
        "M. Pedrozzi",
        "S. Reiche",
        "L. Stingelin",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "In all accelerating cavities a non negligible background of electrons can be generated by field emission (dark current)",
        "transported and further accelerated. A careful estimate of the transport of the dark current is crucial in order to minimize radiation damage to the components and activation of the machine. This paper describes the generation and the transport of dark current from the SwissFEL photo injector downstream of the accelerator. The analysis is based on numerical simulations and experimental measurements performed at the SwissFEL Injector Test Facility (SITF). In the simulations the charge distribution is generated by an emission model based on the Fowler-Nordheim equation taking into account the filling time of the cavity and then tracked through the machine. This model has been used to analyze the impact of a low energy collimation system upstream of the first travelling wave accelerating structure on the dark current transport. A slit with several apertures has been installed in the SITF to benchmark the simulations and to verify the impact of the wakefields on the nominal beam."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso03.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO03",
      "page_number": "209",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO04",
      "title": "Simulations of a Corrugated Beam Pipe for the Chirp Compensation in SwissFEL",
      "authors": [
        "S. Bettoni",
        "P. Craievich",
        "M. Pedrozzi",
        "S. Reiche",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "In short wavelength FEL designs",
        "bunch compression is obtained by making the beam passing through a magnetic chicane with an energy chirp typically of a percent level. At SwissFEL",
        "before injection into the undulator it is foreseen to remove the residual chirp using the wakes in the C-band accelerating structures of the linac. This scheme works well for the hard X-ray undulator line",
        "which includes the largest accumulation of wakefields",
        "but it leaves a residual chirp in the other undulator line for the soft X-ray beam line",
        "midway in the main linac. Another possibility to remove the residual chirp consists in using the longitudinal wakefields generated by a corrugated beam pipe",
        "as recently proposed by G. Stupakov et al. Before planning a dechirper section in a FEL",
        "an experimental verification of the analytical formulae describing the wakefields is crucial. The SwissFEL injector test facility (SITF) fulfils all the necessary criteria to perform such a proof of principle. We are investigating the technical implementation to perform an experiment in SITF in the second half of 2014. In this paper we present the tracking studies performed to optimize the experiment layout."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso04.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO04",
      "page_number": "214",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO07",
      "title": "SwissFEL Injector Design: An Automatic Procedure",
      "authors": [
        "S. Bettoni",
        "M. Pedrozzi",
        "S. Reiche",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The first section of photo-injectors are dominated by space charge effects due to the low beam energy and the high charge density. An optimization of several parameters such as the emittance and the mismatch along the bunch has to be carried out in order to optimize the final performances of the machine. We focus on the performances of the gun developed at PSI",
        "planned to be installed in the mid of this year in the SwissFEL Injector Test Facility (SITF). Due to the number of variables and constraints we developed a code to automatically perform such an optimization. We used this code to optimize the 200 pC operating point of SwissFEL and to fine tune other charges configurations from 10 pC",
        "obtaining considerably reduction of the slice emittance as compared to the CTF gun",
        "presently installed in the SITF and on which the old lattice optimization was based. The same code with minor modifications has been successfully applied to the facility."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso07.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO07",
      "page_number": "219",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO12",
      "title": "RF Design Approach for an NGLS Linac",
      "authors": [
        "A. Ratti",
        "J.M. Byrd",
        "J.N. Corlett",
        "L.R. Doolittle",
        "P. Emma",
        "M. Venturini",
        "R.P. Wells",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "C. Adolphsen",
        "C.D. Nantista",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "D. Arenius",
        "S.V. Benson",
        "D. Douglas",
        "A. Hutton",
        "G. Neil",
        "W. Oren",
        "G.P. Williams",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "C.M. Ginsburg",
        "R.D. Kephart",
        "T.J. Peterson",
        "A.I. Sukhanov",
        "Fermilab",
        "Batavia",
        "USA",
        "The Next Generation Light Source (NGLS) is a design concept for a multibeamline soft x-ray FEL array powered by a ~2.4 GeV CW superconducting linear accelerator",
        "operating with a 1 MHz bunch repetition rate. This paper describes the concepts for the cavity and cryostat design operating at 1.3 GHZ and based on minimal modifications to the design of ILC cryomodules",
        "This leverages the extensive experience derived from R&D that resulted in the ILC design. Due to the different nature of the two applications",
        "particular attention is given now to high loaded Q operation and microphonics control",
        "as well as high reliability and expected up time. The work describes the design and configuration of the linac",
        "including choice of gradient",
        "possible modes of operation",
        "cavity design and RF power",
        "as well as the consequent requirements for the cryogenic system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso12.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO12",
      "page_number": "226",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO13",
      "title": "Superconducting Linac Design Concepts for a Next Generation Light Source at LBNL",
      "authors": [
        "J.N. Corlett",
        "J.M. Byrd",
        "L.R. Doolittle",
        "P. Emma",
        "A. Ratti",
        "F. Sannibale",
        "M. Venturini",
        "R.P. Wells",
        "S. Zimmermann",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "C. Adolphsen",
        "C.D. Nantista",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "D. Arenius",
        "G. Neil",
        "T. Powers",
        "J.P. Preble",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "C.M. Ginsburg",
        "R.D. Kephart",
        "A.L. Klebaner",
        "T.J. Peterson",
        "A.I. Sukhanov",
        "Fermilab",
        "Batavia",
        "USA",
        "The NGLS collaboration is developing design concepts for a multi-beamline soft X-ray FEL array powered by a superconducting linear accelerator",
        "operating in CW mode",
        "with a high bunch repetition rate of approximately 1 MHz. The superconducting linear accelerator design concept is based on existing TESLA and ILC technology",
        "developed for this CW application in a light source. In this paper we describe design options and preferred approaches for the NGLS SRF linac components",
        "cryomodules",
        "and cryosystems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso13.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO13",
      "page_number": "229",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO14",
      "title": "Transverse Deflecting Structures for Bunch Length and Slice Emittance Measurements on SwissFEL",
      "authors": [
        "P. Craievich",
        "R. Ischebeck",
        "F. Löhl",
        "G.L. Orlandi",
        "E. Prat",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The SwissFEL project",
        "under development at the Paul Scherrer Institut",
        "will produce FEL radiation in a wavelength range from 0.1 nm to 7 nm. The facility consists of an S-band rf-gun and booster",
        "and a C-band main linac which accelerates the beam up to 5.8 GeV. Two magnetic chicanes will compress the beam between 2.5 fs rms and 25 fs rms depending on the operation mode. The bunch length and slice parameters will be measured after the first bunch compressor (330 MeV) by using an S-band transverse deflecting structure (TDS). A C-band TDS will be employed to measure the longitudinal parameters of the beam just upstream the undulator beamline (5.8 GeV). With the designed transverse beam optics",
        "an integrated deflecting voltage of 70 MV is required in order to achieve a longitudinal resolution on the femtosecond time scale. In this paper we present the TDS measurement systems to be used at SwissFEL",
        "with a particular emphasis on the new C-band device",
        "including hardware",
        "lattice layout and beam optics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso14.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO14",
      "page_number": "236",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO15",
      "title": "Beam Diagnostic Requirements for the Next Generation Light Source",
      "authors": [
        "S. De Santis",
        "J.M. Byrd",
        "J.N. Corlett",
        "P. Emma",
        "D. Filippetto",
        "M. Placidi",
        "H.J. Qian",
        "F. Sannibale",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The NGLS project consists in a 2.4 GeV superconducting linac accelerating sub-1 μm normalized emittance bunches used to produce high intensity soft X-ray short pulses from multiple FEL beamlines. The 1 MHz bunch repetition rate",
        "and the consequent high beam power",
        "present special challenges",
        "but also opportunities",
        "in the design of the various electron beam diagnostic devices. The wide range of beam characteristics",
        "from the photoinjector to the undulators",
        "require the adoption of different diagnostics optimized to each machine section and to the specific application of each individual measurement. In this paper we present our plans for the NGLS beam diagnostics",
        "discussing the special requirements and challenges."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso15.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO15",
      "page_number": "242",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO17",
      "title": "Status of the Manufacturing Process for the SwissFEL C-Band Accelerating Structures",
      "authors": [
        "U. Ellenberger",
        "H. Blumer",
        "L. Paly",
        "C. Zumbach",
        "Paul Scherrer Institute",
        "Villigen PSI",
        "Switzerland",
        "M. Bopp",
        "H. Fitze",
        "F. Löhl",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "For the SwissFEL project a total of 104 C-band (or approximately 6 GHz for 5’712 MHz required) accelerating structures are needed. After developing and RF-testing of several short structures (0.5m)",
        "three 2meter prototypes have been produced successfully in-house. Avoiding any RF-tuning after fabrication",
        "a high precision machining of the components is necessary. Special procedures were developed and handling equipment was built in order to maintain the accuracy during stacking and vacuum brazing of the parts for the C-band structures. This paper summarizes the manufacturing techniques and the mechanical test results for constant subvolumes to match the required klystron frequency of 5’712 MHz"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso17.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO17",
      "page_number": "245",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO18",
      "title": "Optimization of Dielectric Loaded Metal Waveguides for Acceleration of Electron Bunches using Short THz Pulses",
      "authors": [
        "A. Fallahi",
        "F.X. Kaertner",
        "CFEL",
        "Hamburg",
        "Germany",
        "F.X. Kaertner",
        "A. Sell",
        "L.J. Wong",
        "MIT",
        "Cambridge",
        "Massachusetts",
        "USA",
        "The last decade has witnessed extensive research efforts to reduce the size of charged particle accelerators to achieve compact devices for providing relativistic particles. To this end",
        "various methods such as laser plasma and dielectric wakefield acceleration are investigated and their pros and cons are studied. With the advent of efficient THz generation techniques based on optical rectification",
        "THz waveguides are also considered to be proper candidates for compact accelerators. Sofar",
        "the proposed schemes toward high power THz generation are capable of producing short pulses",
        "which dictates the study of particle acceleration in the pulsed regime rather than continuous-wave regime. Therefore",
        "THz waveguides are more suitable than cavities for the considered purpose*. Consequently",
        "various effects such as group velocity mismatch and group velocity dispersion start to influence the acceleration scenario and impose limits on the maximum energy gain from the pulse. In this contribution",
        "we investigate electron bunch acceleration and compression in dielectrically loaded metal waveguides for the THz wavelength range and present design methodologies to optimize their performance.",
        "* Liang Jie Wong",
        "Arya Fallahi",
        "and Franz X. Kärtner. \"Compact electron acceleration and bunch compression in THz waveguides.\" Optics Express 21",
        "no. 8 (2013): 9792-9806."
      ],
      "institutions": [
        "Funding: DARPA contract number N66001-11-1-4192 and the Center for Free-Electron Laser Science, DESY Hamburg"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso18.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO18",
      "page_number": "250",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO19",
      "title": "The Photocathode Laser System for the APEX High Repetition Rate Photoinjector",
      "authors": [
        "D. Filippetto",
        "L.R. Doolittle",
        "G. Huang",
        "G. Marcus",
        "H.J. Qian",
        "F. Sannibale",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The APEX injector has been built and commissioned at LBNL. A CW-RF Gun accelerates electron bunches to up 750 keV at MHz repetition rate. Different high efficiency photocathodes with different work functions are being tested with the help of a load lock system. The photocathode drive laser is thus conceived to provide up to 40 nJ per pulse in the UV and 200 nJ per pulse in the green at 1 MHz",
        "with transverse and longitudinal shaping (flat top",
        "up to 60 ps) for electron beam creation. A transfer line of about 15 meters has been designed and optimized for minimal jitters. Remote control of repetition rate",
        "energy and position have been implemented on the system",
        "together with offline and online diagnostic for beam monitoring. Here we present the laser system setup as well as the first measurements on longitudinal pulse shaping and jitter characterization."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso19.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO19",
      "page_number": "255",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO21",
      "title": "SwissFEL Cathode Load-lock System",
      "authors": [
        "R. Ganter",
        "M. Bopp",
        "N. Gaiffi",
        "T. Le Quang",
        "M. Pedrozzi",
        "M. Schaer",
        "T. Schietinger",
        "L. Schulz",
        "L. Stingelin",
        "A. Trisorio",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The SwissFEL electron source is an RF photo-injector in which the photo-cathode plug can be exchanged. Without load-lock",
        "the cathode exchange takes about one week and cathode surface gets contaminated in the atmosphere during installation",
        "leading to unpredictable quantum efficiency (QE) fluctuations. This motivated the construction of a load lock system to prepare and insert cathodes in the photo-injector. This load lock system consists of three parts: the preparation chamber",
        "the transportable vacuum suitcase and the gun load lock chamber. This three parts system gives the possibility to prepare the cathode surface with methods like vacuum firing and plasma cleaning. The QE can be checked and the plug can be inserted in the gun without breaking vacuum. This will allow establishing an optimized a reproducible cathode preparation procedure. Since several cathodes can be loaded in advance",
        "the exchange procedure reduces the machine shutdown to a few hours (shorter RF conditioning). The system is described and first experience with its use is reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso21.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO21",
      "page_number": "259",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO22",
      "title": "Status of SwissFEL Undulator Lines",
      "authors": [
        "R. Ganter",
        "M. Aiba",
        "H.-H. Braun",
        "M. Calvi",
        "P. Heimgartner",
        "G. Janzi",
        "H. Jöhri",
        "R. Kobler",
        "F. Löhl",
        "M. Negrazus",
        "L. Patthey",
        "E. Prat",
        "S. Reiche",
        "S. Sanfilippo",
        "U. Schaer",
        "T. Schmidt",
        "L. Schulz",
        "V. Vranković",
        "J. Wickstroem",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "An overview of the Aramis Hard-X ray FEL line of SwissFEL is presented",
        "showing its future integration in the tunnel as well as the space reservation for possible future upgrades: Athos Soft X-ray FEL line",
        "post-undulator deflecting cavities. The design of the FEL components like the energy collimator",
        "the matching sections or the dog leg transfer line linking the linac to the future Athos line are almost completed. The characterization of the in-vacuum undulator prototype is described in a companion paper. The installation of the components will start in spring 2015 while the first photons are planned for December 2016 with the alignment and adjustment of the undulators foreseen for first SASE operation by spring 2017 ."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso22.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO22",
      "page_number": "263",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO24",
      "title": "Dispersion Based Beam Tilt Correction",
      "authors": [
        "M.W. Guetg",
        "B. Beutner",
        "E. Prat",
        "S. Reiche",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "In Free Electron Lasers (FEL)",
        "a transverse centroid misalignment of longitudinal slices in an electron bunch reduces the effective overlap between radiation field and electron bunch and therefore the FEL performance. The dominant sources of slice misalignments for FELs are the incoherent and coherent synchrotron radiation within bunch compressors as well as transverse wake fields in the accelerating cavities. This is of particular importance for over-compression which is required for one of the key operation modes for the SwissFEL planned at the Paul Scherrer Institute. The centroid shift is corrected using corrector magnets in dispersive sections",
        "e.g. the bunch compressors. First and second order corrections are achieved by pairs of sextupole and quadrupole magnets in the horizontal plane while skew quadrupoles correct to first order in the vertical plane. Simulations and measurements at the SwissFEL Injector Test Facility are done to investigate the proposed correction scheme for SwissFEL. This paper presents the methods and results obtained."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso24.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO24",
      "page_number": "267",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO25",
      "title": "Status of the EU-XFELl Laser Heater",
      "authors": [
        "M. Hamberg",
        "V.G. Ziemann",
        "Uppsala University",
        "Uppsala",
        "Sweden"
      ],
      "institutions": [],
      "abstract": "We describe the technical layout and the status of the laser heater system for the EuXFEL. The laser heater is needed to increase the momentum spread of the electron beam to prevent micro-bunching instabilities in the linac.",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso25.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO25",
      "page_number": "271",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO27",
      "title": "Design for a Fast, XFEL-Quality Wire Scanner",
      "authors": [
        "M.A. Harrison",
        "R.B. Agustsson",
        "T.J. Campese",
        "P.S. Chang",
        "A.Y. Murokh",
        "M. Ruelas",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "RadiaBeam Technologies has designed and manufactured a new wire scanner for high-speed emittance measurements of XFEL-type beams of energy 139 MeV. Using three 25-micron thick tungsten wires",
        "this wire scanner measures vertical and horizontal beam size as well as transverse spatial correlation in one pass. The intensity of the beam at a wire position is determined from emitted bremsstrahlung photons as measured by a BGO scintillator system. The wires are transported on a two-ended support structure moved by a ball-screw linear stage. The double-ended structure reduces vibrations in the wire holder",
        "and the two-bellows design negates the effects of air pressure on the motion. The expected minimum beam size measurable by this system is on the order of 10 microns with 0.1-micron accuracy. To achieve this",
        "new algorithms are presented that reduce the effect of the non-zero thickness of the wire on the wire scan output. In addition",
        "novel calculations are presented for determining the elliptical geometric parameters (vertical and horizontal beam size and correlation",
        "or alternatively",
        "the axis lengths and rotation) of the beam from the wire scanner measurements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso27.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO27",
      "page_number": "276",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO28",
      "title": "Development of Photocathode RF-gun at PAL",
      "authors": [
        "J.H. Hong",
        "J.H. Han",
        "H.-S. Kang",
        "Y.W. Parc",
        "S.J. Park",
        "Y.J. Park",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "POSTECH",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea"
      ],
      "institutions": [
        "We are developing two types of S-band photocathode RF-guns for the X-ray free electron laser (XFEL) at Pohang Accelerator Laboratory (PAL). One is a 1.6-cell RF-gun with a dual side coupler and two pumping ports. This RF-gun is similar to the earlier guns developed at PAL. The other one is a 1.5-cell RF-gun with a coaxial coupler and a cathode preparation system. This RF-gun is similar to the DESY-type L-band RF-gun. We have designed and fabricated two types of RF-guns. In this paper we introduce and compare two different RF-guns."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso28.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO28",
      "page_number": "279",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO30",
      "title": "Conditioning Status of the First XFEL Gun at PITZ",
      "authors": [
        "I.I. Isaev",
        "J.D. Good",
        "M. Groß",
        "L. Hakobyan",
        "L. Jachmann",
        "M. Khojoyan",
        "W. Köhler",
        "G. Kourkafas",
        "M. Krasilnikov",
        "D. Malyutin",
        "B. Marchetti",
        "R. Martin",
        "A. Oppelt",
        "M. Otevřel",
        "B. Petrosyan",
        "D. Richter",
        "A. Shapovalov",
        "F. Stephan",
        "G. Vashchenko",
        "R.W. Wenndorff",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "INRNE",
        "Sofia",
        "Bulgaria",
        "P. Boonpornprasert",
        "S. Rimjaem",
        "Chiang Mai University",
        "Chiang Mai",
        "Thailand",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Uni HH",
        "Hamburg",
        "Germany",
        "The paper describes the recent results of conditioning and dark current measurements for the photocathode RF gun at the photoinjector test facility at DESY",
        "Zeuthen site (PITZ). The aim of PITZ is to develop and operate an optimized photo injector for free electron lasers and linear accelerators which require high quality beams. In order to get high gradients in the RF gun extensive conditioning is required. A data analysis of the conditioning process is based on data saved by a Data Acquisition system (DAQ). Conditioning results of the first gun cavity for the XFEL is presented. The events which occurred during the conditioning are briefly described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso30.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO30",
      "page_number": "282",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO32",
      "title": "Project of the Short Pulse Facility at KAERI",
      "authors": [
        "N. Vinokurov",
        "S.V. Miginsky",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "S. Bae",
        "B.A. Gudkov",
        "B. Han",
        "K.H. Jang",
        "Y.U. Jeong",
        "H.W. Kim",
        "K. Lee",
        "S.V. Miginsky",
        "J. Mun",
        "S. H. Park",
        "G.I. Shim",
        "N. Vinokurov",
        "KAERI",
        "Daejon",
        "Republic of Korea",
        "NSU",
        "Novosibirsk",
        "Russia",
        "The low-energy electron accelerator with subpicosecond electron bunches is under construction at Korea Atomic Energy Research Institute (KAERI). It will serve as the user facility for high-energy ultrafast electron difraction and synchronized high-power terahertz pulse and short x-ray pulse generation. The accelerator consists of RF gun with photocathode and 20-MeV linac. The bunching of accelerated beam is achieved in the ninety-degree achromatic bend. After that fast kicker deflects some of bunches to the target for x-ray generation",
        "other bunches come to terahertz radiator (undulator or multifoil). Bunches from the RF gun are also planned to use for ultrafast electron difraction. Some detailes of the design",
        "current status of the project and future plans are described."
      ],
      "institutions": [
        "Funding: This work is supported by the WCI Program of the National Research Foundation of Korea funded by the Ministry of Education, Science, and Technology of Korea (NRF Grant No. WCI 2011-001)."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso32.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO32",
      "page_number": "287",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO33",
      "title": "The Commissioning of Tess: An Experimental Facility for Measuring the Electron Energy Distribution From Photocathodes",
      "authors": [
        "L.B. Jones",
        "R.J. Cash",
        "B.D. Fell",
        "K.J. Middleman",
        "B.L. Militsyn",
        "T.C.Q. Noakes",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "D.V. Gorshkov",
        "H.E. Scheibler",
        "A.S. Terekhov",
        "ISP",
        "Novosibirsk",
        "Russia",
        "ASTeC have developed a Transverse Energy Spread Spectrometer (TESS) – an experimental facility to characterise the energy distribution of electrons emitted by a photocathode. Electron injector brightness is fundamentally limited by the width of this distribution or energy spread",
        "and brightness will be increased significantly by reducing the longitudinal and transverse energy spread at source. TESS supports photocathode performance measurements at room and LN2-temperature under illumination from a range of fixed- and variable-wavelength light sources",
        "allowing characterisation of both metal and semiconductor photocathodes. Preliminary work with GaAs* has shown that electron energy spread is dependent on the quantum efficiency (Q.E.) of the photocathode source",
        "and TESS includes a piezo-electric leak valve to allow controlled degradation of the photocathode Q.E. whilst monitoring the energy spread of emitted electrons. This system offers huge potential to support future photocathode R&D work into a range of photocathode materials. Using GaAs photocathodes activated to high levels of Q.E. in our photocathode preparation facility**",
        "we present commissioning results for TESS.",
        "* Proc. IPAC ’12"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso33.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO33",
      "page_number": "290",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO35",
      "title": "The MAX IV Linac as X-Ray FEL Injector: Comparison of Two Compression Schemes",
      "authors": [
        "O. Karlberg",
        "F. Curbis",
        "S. Thorin",
        "S. Werin",
        "MAX-lab",
        "Lund",
        "Sweden"
      ],
      "institutions": [],
      "abstract": "The MAX IV linac will be used for injections and top up of two storage rings and at the same time provide a high brightness pulses to a short pulse facility (SPF) and an X-ray FEL (phase 2). Compression in the linac is done in two double achromats which implies a positive R56 unlike the commonly used chicane compressor scheme with negative R56. Compression using the achromats scheme requires the electron bunch to be accelerated on a falling RF slope resulting in an energy chirp that longitudinal wakefields will boost along the linac. This permits a stronger compression. In this proceeding we will present how the longitudinal wakefields interact with the bunch compression in the double achromat scheme compared with the chicane compression case. Focus is brought on how the unique MAX IV linac lattice is fully capable to cope with the high demands of an FEL injector. The charge related electron beam jitter in both set-ups will also be investigated.",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso35.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO35",
      "page_number": "294",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO36",
      "title": "Beam Dynamics Optimization for the High Brightness PITZ Photo Injector Using 3D Ellipsoidal Cathode Laser Pulses",
      "authors": [
        "M. Khojoyan",
        "M. Krasilnikov",
        "F. Stephan",
        "G. Vashchenko",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "The Photo Injector Test facility at DESY",
        "Zeuthen Site (PITZ) is one of the leading producers of high brightness electron beams for linac based Free Electron Lasers (FELs) with a specific focus on the requirements of FLASH and the European XFEL. The main activities at PITZ are devoted to the detailed characterization and optimization of electron sources yielding to an extremely small transverse beam emittance. The cathode laser pulse shaping is considered as one of the key issues for the high brightness photo injector. Beam dynamics simulations show that the injector performance could be further improved by replacing the typical cylindrically shaped PITZ bunches by uniformly filled 3D ellipsoidal shaped electron beams. A set of numerical simulations were performed to study the beam dynamics of uniformly filled 3D ellipsoidal bunches with 1 nC charge in order to find an optimum PITZ machine setup which will yield the best transverse emittance. Simulation results comparing both options of cylindrical and 3D ellipsoidal beams are also presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso36.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO36",
      "page_number": "298",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO39",
      "title": "Development of a Photo Cathode Laser System for Quasi Ellipsoidal Bunches at PITZ",
      "authors": [
        "M. Krasilnikov",
        "M. Khojoyan",
        "F. Stephan",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "A. Andrianov",
        "E. Gacheva",
        "E. Khazanov",
        "S. Mironov",
        "A. Poteomkin",
        "V. Zelenogorsky",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Cathode laser pulse shaping is one of the key issues for high brightness photo injector optimization. A flat-top temporal profile of the cylindrical pulses reduces significantly the transverse emittance of space charge dominated beams. As a next step towards further improvement in photo injector performance a 3D pulse shaping is considered. An ellipsoid with uniform photon density is the goal of studies in the frame of a Joint German-Russian Research Group",
        "including the Institute of Applied Physics (Nizhny Novgorod)",
        "Joint Institute of Nuclear Research (Dubna) and the Photo Injector test facility at DESY",
        "Zeuthen site (PITZ). The major purpose of the project is the development of a laser system capable of producing 3D quasi ellipsoidal bunches and supporting a bunch train structure close to the European XFEL specifications. The laser pulse shaping is realized using the spatial light modulator technique. The laser pulse shape diagnostics based on a cross-correlator is under development as well. Experimental tests of the new laser system with electron beam production are foreseen at PITZ. First results on the quasi ellipsoidal laser pulse shaping will be reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso39_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso39.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso39_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO39",
      "page_number": "303",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO41",
      "title": "The Ultrashort Beam Linac System and Proposed Coherent THz Radiation Sources at NSRRC",
      "authors": [
        "W.K. Lau",
        "A.P. Lee",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "N.Y. Huang",
        "Z.Y. Wei",
        "NTHU",
        "Hsinchu",
        "Taiwan",
        "The NSRRC ultrashort beam facility is a low energy linac system which is being built to produce femtosecond electron beam for novel light source development. Experiments on prebunched THz FEL and inverse Compton scattering x-ray source are under study. The electron source is a 2998 MHz",
        "1.5-cell thermionic rf gun with uneven full-cell to half-cell field ratio that is optimized to produce a energy-chirped electron beam. With movable slits in its vacuum vessel",
        "the alpha magnet system is served also as a beam selector. Further bunch compression is done by velocity bunching in the rf linac. Recent progress of the construction of this facility as well as the design study of a prebunched THz FEL with this ultrashort electron beam will be reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso41_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso41.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso41_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO41",
      "page_number": "309",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO42",
      "title": "Shimming Strategy for the Phase Shifters Used in the European XFEL",
      "authors": [
        "Y. Li",
        "J. Pflüger",
        "F. Wolff-Fabris",
        "XFEL. EU",
        "Hamburg",
        "Germany",
        "H.H. Lu",
        "Y.F. Yang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The undulator systems of the European XFEL need a total of 91 Phase Shifters. The 1st field integral of these devices must not exceed 0.004Tmm for working gaps > 16mm. For smaller gaps it is slightly released. In spite of the highly magnetically symmetric design and considerable effort such as the selection and sorting of the magnets small 1st field integral errors cannot be excluded. In this paper a strategy is studied to correct small gap dependent kicking errors as expected for the phase shifters of the XFEL. EU.by using shims of different geometries and sizes. It is found",
        "that small gap dependent kicking errors can well be corrected for using this method. This is a systematic effort to provide effective fast tuning methods",
        "which can be applied for the mass production. The meaning of shim signature will be explained in this paper. The method is demonstrated by simulations and measurements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso42_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso42.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso42_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO42",
      "page_number": "313",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO43",
      "title": "Status of the SwissFEL C-band Linear Accelerator",
      "authors": [
        "F. Löhl",
        "J. Alex",
        "H. Blumer",
        "M. Bopp",
        "H.-H. Braun",
        "A. Citterio",
        "H. Fitze",
        "H. Jöhri",
        "T. Kleeb",
        "L. Paly",
        "J.-Y. Raguin",
        "L. Schulz",
        "R. Zennaro",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Paul Scherrer Institute",
        "Villigen PSI",
        "Switzerland",
        "This paper will summarize the status of the linear accelerator of the Swiss free-electron laser SwissFEL. It will be based on C-band technology and will use solid-state modulators and a novel type of C-band accelerating structures which has been designed at PSI. Initial test results of first 2 m long structures will be presented together with measurements performed with the first BOC-type pulse compressors. Furthermore",
        "we will present first results of a water cooling system for the accelerating structures and the pulse compressors."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso43_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso43.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso43_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO43",
      "page_number": "317",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO44",
      "title": "Transverse Emittance Measurement by Slit-scan Method for an SRF Photo Injector",
      "authors": [
        "P.N. Lu",
        "A. Arnold",
        "P. Michel",
        "P. Murcek",
        "J. Teichert",
        "H. Vennekate",
        "R. Xiang",
        "HZDR",
        "Dresden",
        "Germany",
        "A 3½-cell SRF-gun has been developed and commissioned in Helmholtz-Zentrum Dresden-Rossendorf (HZDR) since 2004. The emittance of this gun was measured before by both solenoid/quadrupole scanning method and multiple slits method. Recently we did new measurements by single slit scanning method which outputs a detailed phase space with higher space resolution and no overlapping problem. This contribution will first describe our diagnostics beam line and software functions",
        "focusing on data processing algorithm. Then an investigation will be presented on the emittance dependence on several important gun parameters as bunch charge",
        "laser phase and DC voltage on the photo cathode. For the bunch charge",
        "a linear increasing relation with the emittance was found. Lower laser phase and higher DC voltage result in lower beam emittance. The influence of a downstream solenoid is studied for the preliminary understanding of the emittance compensation. The contribution will discuss the measurement errors and compare results with other methods. Also",
        "ASTRA simulations of the SRF-gun beams with same parameters will be presented which have similar trends like our measurements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso44_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso44.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso44_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO44",
      "page_number": "322",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO45",
      "title": "Initial Streak Camera Measurements of the S-band Linac Beam for the University of Hawaii FEL Oscillator",
      "authors": [
        "Fermilab",
        "Batavia",
        "USA",
        "M.R. Hadmack",
        "J.M.D. Kowalczyk",
        "J. Madey",
        "E.B. Szarmes",
        "University of Hawaii",
        "Honolulu",
        "HI",
        "USA",
        "The S-band linac driven Mark V free-electron laser oscillator (FELO) at the University of Hawai‘i operates in the mid-IR at electron beam energies of 40-45 MeV with a four microsecond macropulse length. Recently investigations of the electron beam micropulse bunch length and phase as a function of macropulse time became of interest for potentially optimizing the FELO performance. These studies involved the implementation of a Hamamatsu C5680 streak camera with dual sweep capabilities and the transport of optical transition radiation (OTR) generated at an upstream Cu mirror and of coherent spontaneous emission radiation (CSER) generated in the undulator to the streak camera location outside of the linac tunnel. Both a fast single-sweep vertical unit and a synchroscan unit tuned to 119.0 MHz were used. Initial results include measurements of the individual CSER (on the FEL7th harmonic at 652 nm) micropulse bunch lengths (3 to 5 ps FWHM)",
        "the CSER signal intensity variation along macropulse time",
        "and a detected phase slew of 4 ps over the last 700 ns of the macropulse. Complementary OTR measurements are also being evaluated and will be presented as available."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso45_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso45.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso45_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO45",
      "page_number": "325",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO46",
      "title": "Analysis and Measurement of Focusing Effects in a Traveling Wave Linear Accelerator",
      "authors": [
        "H. Maesaka",
        "T. Asaka",
        "H. Ego",
        "T. Hara",
        "T. Inagaki",
        "Y. Otake",
        "T. Sakurai",
        "H. Tanaka",
        "K. Togawa",
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "We propose a further precise model of the transverse dynamics in a traveling wave linear accelerator (TWA) and report experimental results to demonstrate the validity of the model. In SACLA",
        "the beam orbit is calculated by using a transfer matrix based on the transverse dynamics model of each component and the matrix is utilized for orbit stabilization",
        "beam envelop matching etc. For the TWA part",
        "a transfer matrix including an emittance damping effect and an edge focusing effect [*] is employed. However",
        "the beam orbit measured by rf cavity beam position monitors (RF-BPM) [**] did not agree with the calculated orbit",
        "especially for the off-crest acceleration part. Therefore",
        "focusing effects in a TWA structure were analyzed by using a 3-dimensional rf simulation code. The analysis indicated that the transverse dynamics model of the TWA should include an additional quadrupole edge focusing effect. The amount of the additional focusing effect of the TWA was measured in SACLA and the rf simulation result was confirmed to be consistent with the measurement. After the modification of the transverse dynamics model",
        "the beam orbit measured by RF-BPM agrees with the calculation.",
        "* T. Hara et al.",
        "Nucl. Instrum. Methods A 624",
        "65 (2010).  ** H. Maesaka et al.",
        "Nucl. Instrum. Methods A 696",
        "66 (2012)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso46_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso46.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso46_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO46",
      "page_number": "329",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO47",
      "title": "First Results of a Longitudinal Phase Space Tomography at PITZ",
      "authors": [
        "D. Malyutin",
        "M. Groß",
        "I.I. Isaev",
        "M. Khojoyan",
        "G. Kourkafas",
        "M. Krasilnikov",
        "B. Marchetti",
        "F. Stephan",
        "G. Vashchenko",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "The Photo Injector Test facility at DESY",
        "Zeuthen Site (PITZ)",
        "was established as a test stand of the electron source for FLASH and the European X-ray Free Electron Laser (XFEL). One of the tasks at PITZ is the detailed characterization of longitudinal properties of the produced electron bunches. The measurements of the electron bunch longitudinal phase space can be done by tomographic methods using measurements of the momentum spectra by varying the electron bunch energy chirp. At PITZ the energy chirp of the electron bunch can be changed by varying the RF phase of the accelerating structure downstream the gun. The resulting momentum distribution can be measured in a dispersive section installed downstream the accelerating structure. The idea of the measurement and the tomographic reconstruction technique is described in this paper. The setup and first measurement results of the bunch longitudinal phase space measurements using the tomographic technique for several electron bunch charges",
        "including 20 pC",
        "100 pC and 1 nC",
        "are presented as well."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso47_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso47.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso47_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO47",
      "page_number": "334",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO49",
      "title": "Electric Field Dependence of Photoemission From n- and p- Type SI Crystals",
      "authors": [
        "S. Mingels",
        "B. Bornmann",
        "D. Lützenkirchen-Hecht",
        "G. Müller",
        "Bergische Universität Wuppertal",
        "Wuppertal",
        "Germany",
        "C. Langer",
        "C. Prommesberger",
        "R. Schreiner",
        "Regensburg University of Applied Sciences",
        "Regensburg",
        "Germany",
        "The performance of free electron lasers depends on the brilliance of the electron source*. Nowadays photocathodes (e.g. Cs­2Te) are used despite of their high emittance. To develop robust and more brilliant cathodes we have built up an UHV system which enables systematic photoemission (PE) measurements with a tunable pulsed laser (W=0.5-5.9 eV) at high electric fields (E<400 MV/m)**. First results on Au and Ag crystals revealed only low quantum efficiency (QE) due to fast electron relaxation. Hence",
        "we have started QE(W",
        "E) investigations on n- and p-Si wafers. Resonant PE was observed above as well as below the work function F",
        "which can be allocated to optical transitions in the band structure of Si or explained by thermally excited states at the bottom of the conduction band. As expected",
        "only low QE values were achieved even for n-Si probably due to surface oxide. Moreover",
        "a significant rise of the QE peaks above F were obtained for n-Si already at E=8-9 MV/m",
        "which was limited by discharges due to surface pollution. Detailed results and a discussion on the potential of semiconductors as highly brilliant photo-induced field emission cathodes will be presented at the conference.",
        "*D.H. Dowell et al.",
        "Nucl. Instr. And Meth. Phys. A 622",
        "685-697 (2010) **B. Bornmann et al.",
        "Rev. Sci. Instrum. 83",
        "013302 (2012)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso49_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso49.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso49_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO49",
      "page_number": "339",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO50",
      "title": "Numerical Study on Electron Beam Properties in Triode Type Thermionic RF Gun",
      "authors": [
        "M. Mishima",
        "M. Inukai",
        "T. Kii",
        "K. Masuda",
        "H. Negm",
        "H. Ohgaki",
        "K. Okumura",
        "M. Omer",
        "K. Torgasin",
        "K. Yoshida",
        "H. Zen",
        "Kyoto University",
        "Institute for Advanced Energy",
        "Kyoto",
        "Japan",
        "The KU-FEL(Kyoto University- Free Electron Laser) facility uses a thermionic 4.5 cell S-band RF gun for electron beam generation because of such advantages over photocathode rf guns as lower cost",
        "higher average current",
        "longer cathode lifetime",
        "and less vacuum requirement. The main disadvantage of using a thermionic RF gun is the back bombardment effect",
        "which causes energy drop in macro pulse of FEL. A triode structure for RF gun was designed in order to minimize the inherent back-bombardment effect. The 2D-simulation has shown significant reduction of back-bombardment power",
        "longitudinal emittance",
        "and an increase of peak current*. A coaxial RF cavity was fabricated based on the design for modification of the existing RF gun to a triode type one. The coaxial RF cavity is equipped with gasket tuning system in order to adjust the cavity resonance frequency**. However the frequency adjustment by variation of gasket thickness changes the coaxial cavity geometry and might affect the predicted beam optics. Another parameter influencing beam optics is the position of thermionic cathode to be installed in the coaxial cavity",
        "which might vary due to misalignment.",
        "*K. Masuda",
        "et al.",
        "Proceedings of FEL 2009",
        "Liverpool",
        "Pages 281-284 (2009).  **K. Torgasin",
        "et al.",
        "Proceedings of FEL 2012",
        "Nara(2012)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso50_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso50.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso50_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO50",
      "page_number": "344",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO52",
      "title": "R&D Towards a Delta-type Undulator for the LCLS",
      "authors": [
        "H.-D. Nuhn",
        "S.D. Anderson",
        "G.B. Bowden",
        "Y. Ding",
        "G.L. Gassner",
        "Z. Huang",
        "E.M. Kraft",
        "Yu.I. Levashov",
        "F. Peters",
        "F.E. Reese",
        "J.J. Welch",
        "Z.R. Wolf",
        "J. Wu",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The LCLS generates linearly polarized",
        "intense",
        "high brightness x-ray pulses from planar fixed-gap undulators. While the fixed-gap design supports a very successful and tightly controlled alignment concept",
        "it provides only limited taper capability (up to 1% through canted pole and horizontal position adjustability) and lacks polarization control. The latter is of great importance for soft x-ray experiments. A new compact undulator design (Delta) has been developed and tested with a 30-cm-long in-vacuum prototype at Cornell University",
        "which adds those missing properties to the LCLS undulator design and is readily adapted to the LCLS alignment concept. Tuning Delta undulators within tight",
        "FEL type tolerances is a challenge due to the fact that the magnetic axis and the magnet blocks are not easily accessible for measurements and tuning in the fully assembled state. An R&D project is underway to install a 3.2-m long out-of-vacuum device in place of the last LCLS undulator",
        "to provide controllable levels of polarized radiation and to develop measurement and tuning techniques to achieve x-ray FEL type tolerances. Presently",
        "the installation of the device is scheduled for August 2013."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso52_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso52.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso52_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO52",
      "page_number": "348",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO54",
      "title": "Undulators for Free Electron Lasers",
      "authors": [
        "C.W. Ostenfeld",
        "M. Pedersen",
        "Danfysik A/S",
        "Taastrup",
        "Denmark",
        "Danfysik has produced insertion devices for the FEL community for almost 10 years. In this poster",
        "we describe two recent undulator deliveries: a 2.8 m long undulator for the FELIX free electron laser",
        "and a 4.5 m device for the FLARE project",
        "both at Radboud University in Nijmegen",
        "in the Netherlands. The device for FELIX is a 2.8 m PPM device",
        "with a peak field of 0.483 T",
        "and a minimum gap of 22 mm. The device for FLARE",
        "is a 4.5 m hybrid device",
        "with special poles",
        "which allow for double focusing. For both devices",
        "we describe the magnetic modelling",
        "and the magnetic performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso54_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso54.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso54_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO54",
      "page_number": "351",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO55",
      "title": "mm Electromagnetic Wiggler for ELBE",
      "authors": [
        "C.W. Ostenfeld",
        "M. Pedersen",
        "Danfysik A/S",
        "Taastrup",
        "Denmark",
        "Danfysik has designed and built a 300 mm fixed-gap electromagnetic wiggler for the ELBE radiation source at Helmholz Zentrum Dresden Rossendorff. This wiggler will serve as a source of narrow-band THz radiation in the 100 μm to 10 mm range. Due to careful magnetic modelling",
        "and an effective shimming process",
        "we were able to deliver magnetic performance at a high level. We present the details of the modelling",
        "as well as magnetic results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso55_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso55.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso55_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO55",
      "page_number": "353",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO57",
      "title": "Generation of Ultrafast, High-brightness Electron Beams",
      "authors": [
        "J.H. Park",
        "H. Bluem",
        "J. Rathke",
        "T. Schultheiss",
        "A.M.M. Todd",
        "AES",
        "Princeton",
        "New Jersey",
        "USA",
        "The production and preservation of ultrafast",
        "high-brightness electron beams is a major R&D challenge for free electron laser (FEL) and ultrafast electron diffraction (UED) because transverse and longitudinal space charge forces drive emittance dilution and bunch lengthening in such beams. Several approaches",
        "such as velocity bunching and magnetic compression",
        "have been considered to solve this problem but each has drawbacks. We present a concept that uses radial bunch compression in an X-band photocathode radio frequency electron gun. By compensating for the path length differential with a curved cathode in an extremely high acceleration gradient cavity",
        "we have demonstrated numerically the possibility of achieving more than an order of magnitude increase in beam brightness over existing electron guns. The initial thermo-structural analysis and mechanical conceptual design of this electron source are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso57_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso57.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso57_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO57",
      "page_number": "355",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO58",
      "title": "Developments of a High-average-current Thermionic RF Gun for ERLs and FELs",
      "authors": [
        "J.H. Park",
        "H. Bluem",
        "J. Rathke",
        "T. Schultheiss",
        "A.M.M. Todd",
        "AES",
        "Princeton",
        "New Jersey",
        "USA",
        "The development of a high-average-current thermionic RF gun with the required beam performance for lasing would provide significant cost of ownership and reliability gains for high-average-power energy recovery linac (ERL) and free electron laser (FEL) devices. The beam for these applications requires high quality and high performance",
        "specifically: low transverse emittance",
        "short pulse duration and high average current. We are developing a gridded thermionic cathode embedded in a copper one-and-half cell UHF cavity to generate the electron beam. The fundamental RF and higher harmonics are combined on the grid and a gated DC voltage controls the beam emission from the cathode. Simulations indicate that short pulse ~ 10 psec",
        "< 1 MeV electron beams with low-emittance ~ 15 mm-mrad at currents ≥ 100 mA can be generated. The elimination of sensitive photocathodes and their drive laser systems would provide significant capital cost saving",
        "improved reliability and uptime due to increased robustness and hence operating and lifecycle cost savings as well. We will present the gun design and performance simulations and the progress achieved to date in optimizing the device."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso58_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso58.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso58_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO58",
      "page_number": "359",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO59",
      "title": "Study of a Photocathode-based Microtron using a PIC Code",
      "authors": [
        "Kyungpook National University",
        "Daegu",
        "Republic of Korea",
        "K.H. Jang",
        "Y.U. Jeong",
        "S. H. Park",
        "N. Vinokurov",
        "KAERI",
        "Daejon",
        "Republic of Korea",
        "KNU",
        "Deagu",
        "Republic of Korea",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Korea Atomic Energy Research Institute (KAERI) has used thermionic cathode-based microtron accelerator for operating compact THz FEL due to its compact size and high energy resolution. In this thermionic cathode-based microtron",
        "rightly phased electron bunch train are automatically accelerated during the RF macro-pulse over threshold power for their emission. But",
        "the thermionic cathode should be replaced with a photocathode for applying the microtron to UED or THz/X-ray pump prove experiment requiring femto-second and high peak current. But",
        "it is needed to analyze precisely the electron beam dynamics in a microtron",
        "especially",
        "the relation between the RF phase in a microtron cavity and Laser input time for adapting the photocathode to a microtron. Hence",
        "we conduct computer simulation with 3D PIC-code to find those optimized conditions for operating photocathode-based microtron."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso59_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso59.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso59_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO59",
      "page_number": "363",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO60",
      "title": "Status of the Undulator Systems for the European X-ray Free Electron Laser",
      "authors": [
        "J. Pflüger",
        "M. Bagha-Shanjani",
        "A. Beckmann",
        "K.H. Berndgen",
        "P. Biermordt",
        "G. Deron",
        "U. Englisch",
        "S. Karabekyan",
        "B. Ketenoğlu",
        "M. Knoll",
        "Y. Li",
        "F. Wolff-Fabris",
        "M. Yakopov",
        "XFEL. EU",
        "Hamburg",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The three undulator systems for the European XFEL consist of a total of 91 Undulator Cells. Each cell consists of an Undulator Segment and an intersection. They will be operational by end of 2015. The serial production of the 91 Undulator Segments is a great challenge and without precedence. It is now in full swing. This contribution gives an overview over the most important design aspects as well as the experience and strategy with the serial production. Representative results of magnetic performance are given. The status of the other system components is briefly described.",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso60_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso60.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso60_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO60",
      "page_number": "367",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO62",
      "title": "Status of the Planar Undulator Applied in HUST THz-FEL Oscillator",
      "authors": [
        "B. Qin",
        "X. Lei",
        "K.F. Liu",
        "X. Liu",
        "P. Tan",
        "Y.Q. Xiong",
        "J. Yang",
        "L. Yang",
        "HUST",
        "Wuhan",
        "People's Republic of China",
        "Huazhong University of Science and Technology",
        "State Key Laboratory of Advanced Electromagnetic Engineering and Technology",
        "Hubei",
        "People's Republic of China",
        "To fulfill the physical requirement of a 50-100 um Free Electron Laser (FEL) oscillator",
        "design considerations of a planar undulator are described. Some technical issues",
        "including the tolerances study",
        "the beam match",
        "the field measurement setup and the influence on the magnetic field by the waveguide are discussed as well."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso62_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso62.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso62_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO62",
      "page_number": "372",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO63",
      "title": "High Average Brightness Photocathode Development for FEL Applications",
      "authors": [
        "T. Rao",
        "I. Ben-Zvi",
        "J. Skaritka",
        "E. Wang",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Next generation",
        "high average flux",
        "light sources call for electron beams with high average current as well as high peak brightness. Alkali antimonide cathodes",
        "especially K2CsSb show great promise in delivering electron beams to meet these requirements. In the past few years",
        "there have been a number of experiments geared towards understanding the stoichiometry",
        "crystalline structure",
        "surface properties and sensitivity of these cathodes. At BNL",
        "we have used the x-ray beams from NSLS",
        "CFN and CHESS for in-situ characterization of K-Cs-Sb cathode growth. We have also designed and built several load-lock systems for ex-situ cathode fabrication and quick cathode exchange",
        "to be used with a number of guns. One load-lock system/cathode combination has been tested with a DC gun and the others will be tested with SRF guns operating at 112 and 704 MHz. In this paper we will present the results on improving the QE with excimer laser and the performance of the load-lock/cathode combination in the guns."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso63_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso63.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso63_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO63",
      "page_number": "376",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO64",
      "title": "Short SASE-FEL Pulses at FLASH",
      "authors": [
        "J. Rönsch-Schulenburg",
        "E. Hass",
        "A. Kuhl",
        "T. Plath",
        "M. Rehders",
        "J. Roßbach",
        "Uni HH",
        "Hamburg",
        "Germany",
        "G. Brenner",
        "C. Gerth",
        "U. Mavrič",
        "H. Schlarb",
        "E. Schneidmiller",
        "S. Schreiber",
        "B. Steffen",
        "M. Yan",
        "M.V. Yurkov",
        "DESY",
        "Hamburg",
        "Germany",
        "FLASH is a high-gain free-electron laser (FEL) in the soft x-ray range. This paper discusses the production of very short FEL pulses in the SASE-mode without an external seeding signal at FLASH in the optimal case the single-spike operation. A new photo-injector laser has been commissioned",
        "which allows the generation of shorter bunches with low bunch charge directly at the photo-cathode. This shorter injector laser reduces the required bunch compression for short pulses and thus allows a stable SASE performance with shorter pulses. First SASE performance using the new injector laser has been demonstrated and electron bunch and FEL radiation properties have been measured. Beam dynamics as well as the optimization of bunch diagnostics for low charge and short bunches are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso64_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso64.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso64_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO64",
      "page_number": "379",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO66",
      "title": "Transport of Terahertz-Wave Coherent Synchrotron Radiation With a Free-electron Laser Beamline at LEBRA",
      "authors": [
        "N. Sei",
        "H. Ogawa",
        "AIST",
        "Tsukuba",
        "Ibaraki",
        "Japan",
        "K. Hayakawa",
        "Y. Hayakawa",
        "M. Inagaki",
        "K. Nakao",
        "K. Nogami",
        "T. Sakai",
        "T. Tanaka",
        "LEBRA",
        "Funabashi",
        "Japan",
        "Nihon University and AIST have jointly developed terahertz-wave coherent synchrotron radiation (CSR) at Laboratory for Electron Beam Research and Application (LEBRA) in Nihon University. We have already observed intense terahertz-wave radiation from a bending magnet located above an undulator",
        "and confirmed it to be CSR*. To avoid a damage caused by ionizing radiation",
        "we worked on transporting the CSR to an experimental room which was next to the accelerator room. By using a beamline of an infrared free-electron laser",
        "the CSR more than 1 mW was successfully transported to the experimental room. The transport of the CSR and imaging experiments with the CSR at LEBARA will be reported.",
        "*: N. Sei et al.",
        "“Observation of intense terahertz-wave coherent synchrotron radiation at LEBRA”",
        "J. Phys. D",
        "46 (2013) 045104."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso66_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso66.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso66_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO66",
      "page_number": "383",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO67",
      "title": "Design Optimization of 100 Kv DC Gun Wehnelt Electrode for FEL Linac at LEBRA",
      "authors": [
        "T. Sakai",
        "K. Hayakawa",
        "Y. Hayakawa",
        "M. Inagaki",
        "K. Nakao",
        "K. Nogami",
        "T. Tanaka",
        "LEBRA",
        "Funabashi",
        "Japan",
        "The 125-MeV electron linac at the Laboratory for Electron Beam Research and Application (LEBRA) in Nihon University has been used for generation of the near infrared FEL and the Parametric X-ray Radiation. In addition",
        "the THz beam generated in a bending magnet became available in the FEL experimental rooms in 2012 by transporting in the FEL optical beam line. The electron gun system for the LEBRA linac can extract the electron beam in three modes",
        "the full bunch",
        "the superimposed and the burst modes. However",
        "the shape of the electron gun wehnelt electrode has not been optimized for the operation with the superimposed or the burst modes; the wehnelt was designed for use in the full bunch operation. The beam trace simulation suggested that the beam extracted from the cathode in the superimposed and the burst modes was slightly lost at the anode due to the strong space charge effect resulted from a high peak extraction current. Therefore",
        "simulation of the beam trace was carried out to optimize the wehnelt shape for the maximum beam extraction efficiency for all the beam operation modes. The present paper reports the result of the simulation on the optimized electron gun design."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso67_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso67.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso67_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO67",
      "page_number": "387",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO69",
      "title": "Injector Design Studies for NGLS",
      "authors": [
        "C. F. Papadopoulos",
        "P. Emma",
        "D. Filippetto",
        "H.J. Qian",
        "F. Sannibale",
        "M. Venturini",
        "R.P. Wells",
        "LBNL",
        "Berkeley",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso69_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso69.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso69_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO69",
      "page_number": "391",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO74",
      "title": "A Coaxially Coupled Deflecting-accelerating Mode Cavity System for Phase-space Exchange (PSEX)",
      "authors": [
        "Y.-M. Shin",
        "P. Piot",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "Fermilab",
        "Batavia",
        "USA",
        "J.H. Park",
        "A.M.M. Todd",
        "AES",
        "Princeton",
        "New Jersey",
        "USA",
        "A feasible method to readily remove energy spread (R56 term) due to thick lens effect of a deflecting mode RF-cavity has been widely investigated for emittance exchange in 6D phase-space*",
        "**. By means of theoretical calculation and numerical analysis",
        "it was found that an accelerating cavity effectively cancel the longitudinal phase space chirp. We have extensively investigated the combined deflecting-accelerating mode phase-space exchanger with the simple RF distribution system of the beam-pipe coaxial coupler. EM simulations proved the coupling scheme with eigenmode and S-parameter analyses. Currently we are looking into 3D beam dynamics in the system with tracking/particle-in-cell (PIC) simulations and wakefield analysis. Proof-of-concept (POC) experiment is planned with a high-Q normal conducting cavity built in a cryogenic cooling system (liquid nitrogen) in Fermilab.",
        "* P. Emma",
        "et. al.",
        "Phys. Rev. ST Accel. Beams 9",
        "100702 (2006)  ** Zholents and M. Zolotorev",
        "LBNL CBP Seminar (2010) and No. ANL/APS/LS-327(2011)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso74_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso74.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso74_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO74",
      "page_number": "395",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO75",
      "title": "Design Analysis and High Power RF Test of a 3.9 GHz 5-cell Deflecting-mode Cavity in a Cryogenic Operation",
      "authors": [
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "Fermilab",
        "Batavia",
        "USA",
        "A 3.9 GHz deflecting mode (π",
        "TM110) cavity has been long used for six-dimensional phase-space beam manipulation tests [1 - 5] at the A0 Photo-Injector Lab (16 MeV) in Fermilab and their extended applications with vacuum cryomodules are currently planned at the Advanced Superconducting Test Accelerator (ASTA) user facility (> 50 MeV). Despite the successful test results",
        "the cavity",
        "however",
        "demonstrated limited RF performance during liquid nitrogen (LN2) ambient operation that was inferior to theoretical prediction. We have been performing full analysis of the designed cavity by analytic calculation and comprehensive system simulation analysis to solve complex thermodynamics and mechanical stresses. The re-assembled cryomodule is currently under the test with a 50 kW klystron at the Fermilab A0 beamline",
        "which will benchmark the modeling analysis. The test result will be used to design vacuum cryomodules for the 3.9 GHz deflecting mode cavity that will be employed at the ASTA facility for beam diagnostics and phase-space control.",
        "[1] D. A. Edwards",
        "LINAC 2002  [2] Y.-E Sun",
        "PRTAB 2004  [3] P. Piot"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso75_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso75.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso75_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO75",
      "page_number": "399",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO76",
      "title": "In Situ Characterization of ALKALI Antimonide Photocathodes",
      "authors": [
        "J. Smedley",
        "K. Attenkofer",
        "S.G. Schubert",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "I. Ben-Zvi",
        "X. Liang",
        "E.M. Muller",
        "M. Ruiz-Osés",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "Fermilab",
        "Batavia",
        "USA",
        "H.A. Padmore",
        "J.J. Wong",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "ANL",
        "Argonne",
        "USA",
        "Alkali antimonide photocathodes are a prime candidate for use in high-brightness photoinjectors of free electron lasers and 4th generation light sources. These materials have complex growth kinetics - many methods exist for forming the compounds",
        "each with different grain size",
        "roughness",
        "and crystalline texture. These parameters impact the performance of the cathodes",
        "including efficiency",
        "intrinsic emittance and lifetime. In situ analysis of the growth of these materials has allowed investigation of correlations between cathode structure and growth parameters and the resulting quantum efficiency (QE). The best cathodes have a QE at 532 nm in excess of 6% and are structurally textured K2CsSb with grain sizes in excess of 20 nm. X-ray reflection (XRR) has been used to characterize the roughness evolution of the cathode",
        "while X-ray Diffraction (XRD) has been used to characterize the texture",
        "grain size and stoichometry."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso76_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso76.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso76_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO76",
      "page_number": "403",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO77",
      "title": "Analytical and Numerical Analysis of Electron Trajectories in a 3-D Undulator Magnetic Field",
      "authors": [
        "N.V. Smolyakov",
        "S.I. Tomin",
        "NRC",
        "Moscow",
        "Russia",
        "XFEL. EU",
        "Hamburg",
        "Germany",
        "In this contribution we present an analysis of electron trajectories in the three dimensional magnetic field from a planar undulator. The electron trajectory is influenced by the focusing properties of the undulator field. These focusing properties should be taken into account in simulations of spontaneous radiation",
        "which constitutes the background signal of the FEL. The ideal magnetic field of an undulator can be described",
        "in agreement with Maxwell equations",
        "by a sinusoidal vertical magnetic field on the undulator axis",
        "and by horizontal and longitudinal field components that appear out of axis. Exploiting this description for the ideal case",
        "the differential equations of motion were solved by means of a perturbation theory approach",
        "and the corresponding expressions for the electrons velocities and trajectories are derived. A computer code was also written",
        "which relies on the Runge-Kutta algorithm. The analytical and numerical methods could then be compared",
        "showing a good agreement."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso77_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso77.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso77_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO77",
      "page_number": "406",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO78",
      "title": "Design of a Collimation System for the Next Generation Light Source at LBNL",
      "authors": [
        "C. Steier",
        "P. Emma",
        "H. Nishimura",
        "C. F. Papadopoulos",
        "H.J. Qian",
        "F. Sannibale",
        "C. Sun",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The planned Next Generation Light Source at LBNL is designed to deliver MHz repetition rate electron beams to an array of free electron lasers. Because of the high beam power approaching one MW in such a facility",
        "effective beam collimation is extremely important to minimize radiation damage",
        "prevent quenches of superconducting cavities",
        "limit dose rates outside of the accelerator tunnel and prevent equipment damage. We describe the conceptual design of a collimation system",
        "including detailed simulations to verify its effectiveness."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso78_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso78.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso78_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO78",
      "page_number": "410",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO80",
      "title": "The MAX IV Linac and First Design for an Upgrade to 5 GeV to Drive an X-ray FEL",
      "authors": [
        "S. Thorin",
        "F. Curbis",
        "N. Čutić",
        "M. Eriksson",
        "O. Karlberg",
        "F. Lindau",
        "A.W.L. Mak",
        "E. Mansten",
        "S. Werin",
        "MAX-lab",
        "Lund",
        "Sweden",
        "The installation of the MAX IV linear accelerator is in full progress",
        "and commissioning is planned to start in the second quarter of 2014. The 3 GeV linac will be used as a full energy injector for the two storage rings",
        "and as a high brightness driver for a Short Pulse linac light source. The linac has been deigned to also handle the high demands of an FEL injector. The long term strategic plan for the MAX IV laboratory includes an extension of the linac to 5 GeV and an X-ray FEL. In this paper we present the both design concept and status of the MAX IV linac along with parameters of the 3 GeV high quality electron pulses. We also present the first design and simulation results of the upgrade to a 5 GeV X-ray FEL driver."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso80_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso80.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso80_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO80",
      "page_number": "413",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO81",
      "title": "Challenges for Detection of Highly Intense FEL Radiation: Photon Beam Diagnostics at",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso81_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso81.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso81_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO81",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO82",
      "title": "Spectroscopy System for LCLS Photocathodes",
      "authors": [
        "P. Stefan",
        "A. Brachmann",
        "T. Vecchione",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Photocathode reliability is important from an operational standpoint. Unfortunately LCLS copper photocathodes have not always been reliable. Some have operated well for long periods of time while others have required continual maintenance. It is believed that the observed variations in quantum efficiency",
        "emittance and lifetimes are inherently surface related",
        "corresponding to changes in composition or morphology. The RF Electron-gun Cathode",
        "Electron Surface Spectrometer",
        "or RECESS",
        "system has been commissioned to study this by making essential measurements that could not be obtained otherwise. These involve photocathode surface chemical characterization. The system is designed to use a combination of angle-resolved ultraviolet and x-ray photoelectron spectroscopy and is capable of either stand-alone operation or interoperability with a beam line at SSRL. Here we report on the first commissioning spectra and the direction of the project going forward."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso82_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso82.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso82_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO82",
      "page_number": "421",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO83",
      "title": "Quantum Efficiency and Transverse Momentum From Metals",
      "authors": [
        "T. Vecchione",
        "D. Dowell",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "J. Feng",
        "H.A. Padmore",
        "W. Wan",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "QE and transverse momentum are key parameters limiting the achievable brightness of FELs. Despite the importance",
        "little data is available to substantiate current models. Expressions for each and experimental confirmation of each expression with respect to excess energy are presented. Novel instrumentation and analysis techniques developed are described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso83_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso83.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso83_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO83",
      "page_number": "424",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO84",
      "title": "SLAC RF Gun Photocathode Test Facility",
      "authors": [
        "T. Vecchione",
        "A. Brachmann",
        "W.J. Corbett",
        "M.J. Ferreira",
        "S. Gilevich",
        "E.N. Jongewaard",
        "H. Loos",
        "J. Sheppard",
        "S.P. Weathersby",
        "F. Zhou",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "A RF gun photocathode test facility has been commissioned at SLAC. The facility consists of a S-band gun",
        "high power RF",
        "a UV drive laser and beam diagnostics. Here we report on the capabilities of the facility demonstrated during commissioning. Currently the facility is being used to study in-situ laser processing of copper photocathodes. In the future the facility will be used to study fundamental gun and photocathode performance limitations and enhancement strategies. Eventually it is envisioned to integrate a load lock and plug into the gun enabling the evaluation of high performance surface sensitive semiconductor photocathodes and the incorporation of ex-situ surface science analytical techniques."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso84_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso84.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso84_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO84",
      "page_number": "427",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO85",
      "title": "High Brightness Electron Beams from a Multi-filamentary Niobium-tin Photocathode",
      "authors": [
        "C. Vicario",
        "A. Anghel",
        "F. Ardana-Lamas",
        "C.P. Hauri",
        "F. Le Pimpec",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "High-brightness electron sources are of fundamental interest for modern FELs. Inspired by the micro-structure of field emitter arrays",
        "we propose a new type of metallic photo-cathode consisting of thousands of Nb3Sn micro-columns. With this metallic photo-cathode quantum efficiencies up to 0.5% are achieved under stable operation",
        "and preliminary emittance measurements are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso85_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso85.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso85_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO85",
      "page_number": "431",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO86",
      "title": "Photocathode Laser Wavelength-tuning for Thermal Emittance and Quantum Efficiency Studies",
      "authors": [
        "C. Vicario",
        "S. Bettoni",
        "B. Beutner",
        "M.C. Divall",
        "C.P. Hauri",
        "E. Prat",
        "T. Schietinger",
        "A. Trisorio",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "SwissFEL compact design is based on extremely low emittance electron beam from an RF photoinjector. Proper temporal and spatial shaping of the photocathode drive laser is employed to reduce the space charge emittance contribution. However",
        "the ultimate limit for the beam emittance is the thermal emittance",
        "which depends on the excess energy of the emitted photoelectrons. By varying the photocathode laser wavelength it is possible to reduce the thermal emittance. For this purpose",
        "we developed a tunable Ti:sapphire laser and an optical parametric amplifier which allow to scan the wavelength between 250 and 305 nm. The system permits to study the thermal emittance and the quantum efficiency evolution as function of the laser wavelength for the copper photocathode in the RF gun of the SwissFEL injector test facility. The results are presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso86_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso86.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso86_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO86",
      "page_number": "434",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO87",
      "title": "High-Field Laser-Based Terahertz Source for SwissFEL",
      "authors": [
        "C. Vicario",
        "C.P. Hauri",
        "B. Monoszlai",
        "C. Ruchert",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "We present efficient laser-driven THz generation by optical rectification in various organic materials yielding transient fields up to 150 MV/m and 0.5 Tesla. The generated spectra extend over the entire THz gap (0.1-10 THz). Manipulation of the absolute phase by dispersion control is demonstrated for 5-octave spanning",
        "single-cycle pulses. The presented source will be applied to the future SwissFEL as Xray photon temporal diagnostics and for pump-and-probe experiments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso87_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso87.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso87_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO87",
      "page_number": "438",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO88",
      "title": "New Concept for the SwissFEL Gun Laser",
      "authors": [
        "A. Trisorio",
        "M.C. Divall",
        "C.P. Hauri",
        "C. Vicario",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Amplitude Systemes",
        "Pessac",
        "France",
        "The operation of Swiss FEL put very stringent constrains on the gun laser system. First the parameters",
        "such as energy stability",
        "timing jitter",
        "double pulse operation",
        "temporal and spatial pulse shape of the ultra-violet laser pulses used to generate the photo-electrons are challenging even for the state of the art laser technologies. Second",
        "the laser system must be extremely stable",
        "reliable and its maintenance cost as low as possible. In this perspective",
        "we prospected for alternative technologies to the well known",
        "commonly used but costly Ti:sapphire laser systems. We show that a hybrid Yb fiber and solid state Yb:CaF2 amplifier system can be a very interesting approach. This gain medium allows the production of sub-500 fs",
        "high fidelity",
        "high stability",
        "high energy pulses in the ultra-violet with low timing jitter. The system profits of the mature",
        "stable direct diode pumping technology and optimized design. It delivers the two high-energy",
        "shaped UV pulses separated by 28 ns to produce the photo-electrons",
        "a short IR probe (<100 fs FWHM) to temporally characterize those pulses and the two stretched IR pulses ( 50 ps FWHM) necessary for the laser heater."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso88_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso88.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso88_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO88",
      "page_number": "442",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO89",
      "title": "A Femtosecond Resolution Electro-optic Diagnostic Using a Nanosecond-pulse Laser",
      "authors": [
        "D.A. Walsh",
        "W.A. Gillespie",
        "University of  Dundee",
        "Nethergate",
        "Dundee",
        "Scotland",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Electro-optic diagnostics with a target time resolution of 20fs RMS",
        "and with intrinsically improved stability and reliability",
        "are being developed. The new system is based on explicit temporal measurement of an electro-optically upconverted pulse",
        "following interaction of the bunch with a quasi-CW probe pulse. The electro-optic effect generates an “optical-replica” of the longitudinal charge distribution from the narrow-bandwidth probe",
        "simultaneously up-converting the bunch spectrum to optical frequencies. By using Frequency Resolved Optical Gating (FROG)",
        "an extension of autocorrelation",
        "the optical replica can then be characterised on a femtosecond time scale. This scheme therefore bypasses the requirement for unreliable femtosecond laser systems. The high pulse energy required for single-shot pulse measurement via FROG will be produced through optical parametric amplification of the optical-replica pulses. The complete system will be based on a single nanosecond-pulse laser – resulting in a reliable system with greatly relaxed timing requirements."
      ],
      "institutions": [
        "Funding: This project has been funded by CERN as part of the CLIC-UK programme Contract Number KE1865/DG/CLIC"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso89_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso89.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso89_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO89",
      "page_number": "447",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO91",
      "title": "FEL R&D Within LA3NET",
      "authors": [
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "The detailed diagnostics of the shortest beam pulses in free-electron lasers still pose significant challenges to beam instrumentation. Electro-optical methods are a promising approach for the non-intercepting measurement of electron bunches with a time resolution of better than 50 fs",
        "but suitable optical materials need to be better understood and carefully studied. In addition",
        "adequate timing systems with stability in the fs regime based on mode-locked fibre laser optical clocks",
        "and actively length-stabilised optical fibre distribution require further investigation. Within the EU-funded LA³NET project these important problems are being addressed by an international consortium of research centres",
        "universities",
        "and industry partners. This contribution gives an overview of the LA3NET project and results from initial studies in both areas. It also describes the events",
        "such as schools",
        "topical workshops and conferences that LA3NET will organize."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso91_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso91.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso91_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO91",
      "page_number": "452",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSO92",
      "title": "Dark Current Measurements at the Rossendorf SRF Gun",
      "authors": [
        "R. Xiang",
        "A. Arnold",
        "P.N. Lu",
        "P. Murcek",
        "J. Teichert",
        "H. Vennekate",
        "HZDR",
        "Dresden",
        "Germany",
        "R. Barday",
        "T. Kamps",
        "HZB",
        "Berlin",
        "Germany",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "In high gradient photo injectors electron field emission creates so-called dark current. The dark current produces beam loss that increases the radiation level",
        "causes damages to the accelerator components",
        "and produces additional background for the users. Field emitted electrons which stay inside the gun",
        "increases RF power consumption and heat load for the superconducting cavities. It is also believed that dark current is the source of local outgassing and plasma formation which can damage sensitive photocathodes. Thus",
        "to understand and control the dark current has become increasingly important for accelerators. In this presentation",
        "we report on dark current measurement at the ELBE SRF Gun at HZDR. The measurements were carried out with the 3.5 cell-cavity SRF gun and Cs2Te photocathodes. We discuss the dark current behavior for different cavity gradients and various solenoid fields. Simulations have been done to understand the experimental results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2013/talks/tupso92_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2013/papers/tupso92.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2013/posters/tupso92_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2013-TUPSO92",
      "page_number": "455",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 62,
  "scrape_time": "2025-10-10 17:31:56"
}