{
  "session_info": {
    "id": "FRXAUD",
    "name": "FRXAUD - Electron Cooling III",
    "url": "https://proceedings.jacow.org/cool2015/html/frxaud.htm"
  },
  "papers": [
    {
      "paper_id": "FRXAUD01",
      "title": "Anti-Particle Accumulation for Low Energy Exotic Beams",
      "authors": [
        "Hiroshima University",
        "Higashi-Hiroshima",
        "Japan",
        "On behalf of ASACUSA-MUSASHI collaboration",
        "the recent result for the production of low energy antihydrogen beams is presented. In Antiproton Decelerator (AD) at CERN",
        "low energy antiproton beams of 5.6 MeV have been delivered for physics experiments since 1999. With the help of RF group at CERN",
        "Atomic Spectroscopy And Collisions Using Slow Antiprotons (ASACUSA) collaboration installed the unique RFQ decelerator (RFQD)",
        "which can provide ~100 keV pulsed antiproton beams for its various experimental programs. Furthermore",
        "the Mono-energetic Ultra Slow Antiproton Source for High-precision Investigations (MUSASHI) used a Penning-Malmberg trap to produce antiproton beams with the energy of 100 to 1000 eV. In 2010",
        "the synthesis of low energy anti-hydrogen atoms in the Cusp trap with the use of 150eV antiproton beams from MUSASHI trap was reported. The purpose of producing low energy anti-hydrogen atoms in a cusped magnetic field is to extract a polarized anti-hydrogen beam to a field free region",
        "so that the hyperfine structure of anti-hydrogen atoms can be measured with a necessary precision."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/frxaud01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/frxaud01.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/frxaud01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-FRXAUD01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FRXAUD02",
      "title": "Lepta - the Facility for Fundamental and Applied Research",
      "authors": [
        "A.G. Kobets",
        "E.V. Ahmanova",
        "P. Horodek",
        "I.N. Meshkov",
        "O. Orlov",
        "A.A. Sidorin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "NAFU",
        "Arkhangelsk",
        "Russia",
        "The project of the Low Energy Positron Toroidal Accumulator (LEPTA) is under development at JINR. The LEPTA facility is a small positron storage ring equipped with the electron cooling system. The project positron energy is of 2 ' 10 keV. The main goal of the facility is to generate an intense flux of positronium atoms ' the bound state of electron and positron. Storage ring of LEPTA facility was commissioned in September 2004 and is under development up to now. The positron injector has been constructed in 2005 / 2010",
        "and beam transfer channel ' in 2011. By the end of August 2011 the experiments on injection into the ring of electrons and positrons stored in the trap were carried out. In 2012 - 2015",
        "the LEPTA trap optimization and new experiments on accumulation of electrons and positrons in the trap has been performed. Furthermore new cooler for positrons source has been designed and manufactured",
        "its assembling is in progress. The recent results are presented here."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/frxaud02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/frxaud02.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/frxaud02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-FRXAUD02",
      "page_number": "179",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 17:21:26"
}