{
  "session_info": {
    "id": "THPV",
    "name": "THPV - Posters",
    "url": "https://proceedings.jacow.org/icalepcs2021/html/thpv.htm"
  },
  "papers": [
    {
      "paper_id": "THPV001",
      "title": "Supervisory System for the Sirius Scientific Facilities",
      "authors": [
        "L.C. Arruda",
        "G.T. Barreto",
        "M.P. Calcanhapresenter",
        "H.F. Canova",
        "J.V.B. Franca",
        "LNLS",
        "Campinas",
        "Brazil",
        "A general supervisory system for the scientific facilities is under development at Sirius",
        "the Brazilian 4th generation synchrotron light source. The data generated by different classes of equipment are generally available via EPICS or industrial protocols such as OPC-UA provided by commercial automation systems. However",
        "as the number of beamlines and laboratories expands",
        "the effort to properly gather",
        "display and manage this data also scales up. For this reason",
        "an aggregating supervisory system is proposed to monitor the systems: power distribution",
        "personal safety",
        "beamline components",
        "cryogenic fluids; mechanical utilities",
        "air conditioning",
        "among others. This work presents the overall system architecture",
        "functionalities",
        "and some user interfaces."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv001.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV001",
      "page_number": "858",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV004",
      "title": "Open-Hardware Knob System for Acceleration Control Operations",
      "authors": [
        "E. Munaron",
        "M. Montis",
        "L. Pranovi",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "Nowadays technologies in LINAc facilities brought the common Human-Machine Interfaces (HMIs) to be more aligned to the standards coming from the information technology (IT) and the operators started to interact to the apparatus with the common computers’ instruments: mouse and keyboard. This approach has both pro and cons. In order to minimize the cons and with the idea of providing an alternative to interact with HMIs",
        "we tried to design and realize an open-hardware knob system solution."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv004.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV004",
      "page_number": "861",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV005",
      "title": "Virtual Reality and Control Systems: How a 3D System Looks Like",
      "authors": [
        "L. Pranovi",
        "M. Montis",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "Virtual Reality (VR) technology and its derivatives are mature enough to be used in environments like a nuclear research laboratory",
        "to provide useful tools and procedures to optimize the tasks of developers and operators. Preliminary tests were performed [*] to understand the feasibility of this technology applied to a nuclear physics laboratory with promising feedback. Due to the fact this technology is rapidly diffusing in several different professional heterogeneous environments",
        "such as medicine",
        "architecture",
        "the military and industry",
        "we tried to evaluate the impact coming from a new kind of Human-Machine Interface based on VR.",
        "* L.Pranovi et al.",
        "’Vr as a Service: Use of Virtual Reality in a Nuclear Accelerator Facility’",
        "ICALEPCS 2019",
        "New York",
        "NY",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv005.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV005",
      "page_number": "864",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV006",
      "title": "Design of Real-Time Alarm System for CAFe",
      "authors": [
        "N. Xie",
        "Y.H. Guo",
        "B.J. Wang",
        "R. Wang",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "In accelerator control",
        "the alarm system is a very im-portant real-time monitoring and control system. In order to find specific failures of accelerator-related equipment in time",
        "improve the high availability of the equipment",
        "and ensure the long-term operation of the accelerator. An accelerator alarm system based on Kafka was designed and built on the CAFe. The system uses Phoebus for ar-chitecture deployment. Kafka is used as the streaming platform of the alarm system",
        "which effectively improves the throughput of the system and realizes real-time alarms. In order to realize the function of remote monitor-ing of data in the central control room",
        "CS-Studio is used to draw the opi interface to deploy to the enterprise WeChat platform to realize remote data monitoring. This system greatly improves the response speed of fault han-dling and saves a lot of valuable time for accelerator fault handling."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv006.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV006",
      "page_number": "867",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV007",
      "title": "Fast Creation of Control and Monitor Graphical User Interface for PEPC of Laser Fusion Facility Based on ICSFF",
      "authors": [
        "L. Li",
        "J. Luo",
        "Z. Ni",
        "CAEP",
        "Sichuan",
        "People’s Republic of China",
        "Plasma electrode Pockels cell (PEPC) is the key unit of the multi-pass amplify system in laser fusion facility",
        "whether the PEPC is effective determined the success rate of the facility experiment directly. The operator needs to conduct remote control and monitor during the facility is running",
        "also can automatically judge whether the pulse discharge waveform is regular online. We have designed a software framework (ICSFF) that loads all GUI widget elements related to control and monitor into board through plug-ins",
        "and then by setting the respective properties",
        "data source and built-in script of each widget achieve patterns like point control",
        "flow control and other complex combined control",
        "can also achieve data acquisition and varied display effects. It allows the operator drag and drop widget freely and configure the widget properties through the interface in a non-programming mode to quickly build the GUI they need. It not only apply to PEPC in facility",
        "but also to other system in the same facility. ICSFF supports Tango control system right now",
        "and more control systems will be supported in the future."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv007.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV007",
      "page_number": "871",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV008",
      "title": "Signal metadata management interface for Spring-8",
      "authors": [
        "S2Innovation",
        "Kraków",
        "Poland",
        "COSYLAB Japan",
        "Ibaraki",
        "Japan",
        "The system for handling the synchrotron metadata registration process at Spring 8 was developed by Cosylab/S2Innovation. Web application was based on Tornado",
        "a Python framework which was chosen for it’s support for non-blocking network I/O",
        "making it ideal for long polling and enabling it to scale to large number of open connections. Main functionalities that were implemented include: signal metadata check",
        "signal registration",
        "database backup/restore and signal registration history administration. The paper presents result of the project and challenges faced during it’s realization."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv008.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "THPV009",
      "title": "Web Gui Development and Integration in Libera Instrumentation",
      "authors": [
        "D. Bisiach",
        "M. Cargnelutti",
        "P. Leban",
        "P. Paglovec",
        "L. Rahne",
        "M. Škabar",
        "A. Vigali",
        "I-Tech",
        "Solkan",
        "Slovenia",
        "During the past 5 years",
        "Instrumentation Technologies expanded and added to the embedded OS running on Libera instruments (beam position instrumentation",
        "LLRF) a lot of data access interfaces to allow faster access to the signals retrieved by the instrument. Some of the access interfaces are strictly related to the user environment Machine control system (Epics/Tango)",
        "and others related to the user software preferences (Matlab/Python). In the last years",
        "the requirement for easier data streaming was raised to allow easier data access using PC and mobile phones through a web browser. This paper aims to present the development of the web backend server and the realization of a web frontend capable to process the data retrieved by the instrument. A use-case will be presented",
        "the realization of the Libera Current Meter Web GUI as a first development example of a Web GUI interface for a Libera instrument and the starting point for the Web GUI pipeline integration on other instruments. The HTTP access interface will become in the next years a standard in data access for Libera instrumentation for quick testing/diagnostics and will allow the final user to customize it autonomously."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv009.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV009",
      "page_number": "875",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV010",
      "title": "Scaling Up the ALBA Cabling Database and Plans to Turn into an Asset Management System",
      "authors": [
        "I. Costa",
        "A. Camps Gimenez",
        "R. Cazorla",
        "T. Fernández Maltas",
        "D. Salvat",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "The \"Cabling and Controls Database\" (CCDB) is a central repository where the different teams of ALBA manage the information of installed racks",
        "equipment",
        "cables and connectors",
        "and their connections and technical specifications. ALBA has modernized this web application for sustainability reasons and fit new needs detected throughout the last years of operation in our facility. The application has been linked to Jira to allow tracking problems in specific installed equipment or locations. In addition",
        "it also connects to the ALBA Inventory Pools application",
        "the warehouse management system",
        "where the stock of physical equipment and components are maintained to get information on the life cycle of the different devices. These new features",
        "integrated with proprietary products like Jira and Insight",
        "aim to become ALBA’s asset management system. This paper aims to describe the main features of the recent application upgrade",
        "currently in continuous development."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv010.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV010",
      "page_number": "878",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV011",
      "title": "Notifications with Native Mobile Application",
      "authors": [
        "B. Bertrand",
        "J. Forsberg",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "E. Laface",
        "G. Weiss",
        "ESS",
        "Lund",
        "Sweden",
        "Notifications are an essential part of any control system. Many people want to be notified of specific events. There are several ways to send notifications: SMS",
        "e-mails or messaging applications like Slack and Telegram are some common ones. Those solutions frequently require some central configuration to record who will receive messages",
        "which is difficult to maintain. ESS developed a native mobile application",
        "both for iOS and Android",
        "to manage notifications. The application allows the users to subscribe to the topics they are interested in",
        "removing the need for a central configuration. A web server is used as gateway to send all notifications following Apple and Google protocols. This server exposes a REST API that is used both by clients to send messages and mobile applications to retrieve and manage those messages. This paper will detail the technical implementation as well as the lessons learnt from this approach."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv011.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV011",
      "page_number": "883",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV012",
      "title": "LHC Collimation Controls System for Run III Operation",
      "authors": [
        "G. Azzopardi",
        "M. Di Castro",
        "S. Redaelli",
        "B. Salvachua",
        "M. Solfaroli Camillocci",
        "CERN",
        "Geneva",
        "Switzerland",
        "University of Malta",
        "Information and Communication Technology",
        "Msida",
        "Malta",
        "The Large Hadron Collider (LHC) collimation system is designed to protect the machine against unavoidable beam losses. The collimation system for the LHC Run 3",
        "starting in 2022",
        "consists of more than 100 movable collimators located along the 27 km long ring and in the transfer lines. The cleaning performance and machine protection role of the system critically depend on the accurate positioning of the collimator jaws. The collimation control system in place enables remote control and appropriate diagnostics of the relevant parameters. This ensures that the collimators dynamically follow optimum settings in all phases of the LHC operational cycle. In this paper",
        "an overview of the top-level software tools available for collimation control from the control room is given. These tools range from collimator alignment applications to generation tools for collimator settings",
        "as well as collimator scans",
        "settings checks and machine protection sequences. Amongst these tools the key upgrades and newly introduced tools for the Run 3 are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv012.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV012",
      "page_number": "888",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV013",
      "title": "WRAP - A Web-Based Rapid Application Development Framework for CERN’s Controls Infrastructure",
      "authors": [
        "E. Galatas",
        "A. Asko",
        "E. Matli",
        "C. Roderick",
        "CERN",
        "Geneva",
        "Switzerland",
        "To ensure stable operation of CERN’s accelerator complex",
        "many Devices need to be controlled. To meet this need",
        "over 500 custom Graphical User Interfaces (GUI) have been developed using Java Swing",
        "Java FX",
        "NetBeans",
        "Eclipse SWT",
        "etc. These represent a high maintenance cost",
        "particularly considering the global evolution of the GUI technology landscape. The new Web-based Rapid Application Platform (WRAP) provides a centralized",
        "zero-code",
        "drag-n-drop means of GUI creation. It aims to replace a significant percentage of existing GUIs and ease new developments. Integration with the Controls Configuration Service (CCS) provides rich infrastructure metadata to support application configuration",
        "whilst following the associated equipment lifecycle (e.g. renames",
        "upgrades",
        "dismantling). Leveraging the CERN Accelerator Logging Service (NXCALS) and the Unified Controls Acquisition and Processing (UCAP) platform",
        "allows WRAP users to respectively",
        "create GUIs showing historical data",
        "and interface with complex data-stream processing. The plugin architecture will allow teams to further extend the tool as needed. This paper describes the WRAP architecture",
        "design",
        "status",
        "and outlook."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv013.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV013",
      "page_number": "894",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV014",
      "title": "Adopting PyQt for Beam Instrumentation GUI Development at CERN",
      "authors": [
        "S. Zanzottera",
        "S. Jackson",
        "S. Jensen",
        "CERN",
        "Geneva",
        "Switzerland",
        "As Java GUI toolkits become deprecated",
        "the Beam Instrumentation (BI)group at CERN has investigated alternatives and selected PyQt as one of the suitable technologies for future GUIs",
        "in accordance with the paper presented at"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv014.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV014",
      "page_number": "899",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV015",
      "title": "New Timing Sequencer Application in Python with Qt - Development Workflow and Lessons Learnt",
      "authors": [
        "Zs. Kovari",
        "G. Kruk",
        "CERN",
        "Meyrin",
        "Switzerland",
        "PyQt is a Python binding for the popular Qt framework for the development of desktop applications. By using PyQt one can leverage Qt’s aspects to implement modern",
        "intuitive",
        "and cross-platform applications while benefiting from Python’s flexibility. Recently",
        "we successfully used PyQt 5 to renovate the Graphical User Interface (GUI) used to control the CERN accelerator timing system. The GUI application interfaces with a Java-based service behind the scenes. In this paper we introduce the generic architecture used for this project",
        "our development workflow as well as the challenges and lessons we learned from using Python with Qt. We present our approach to delivering an operational application with a particular focus on testing",
        "quality assurance",
        "and continuous integration."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv015.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV015",
      "page_number": "904",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPV016",
      "title": "Developing an Alarm Philosophy for the EPICS Control System at ISIS",
      "authors": [
        "S.A. Medley",
        "I.D. Finch",
        "S.M. Malinowski",
        "M. Romanovschi",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The ISIS Muon and Neutron Source control system alarms have been growing organically during the 30+ years of ISIS’s operation. The upcoming migration from the Vista Control Systems product Vsystem to EPICS provides the right opportunity and framework for a ‘fresh start’ to review and rationalise the alarms. Internationally recognised good engineering practice is defined in the IEC-62682 / ISA 18.2 Standards for the Management of Alarm Systems for the Process Industries",
        "which describe the Alarm Management Lifecycle: an ongoing process of continuous improvement to be used to manage alarms in control systems. The Lifecycle begins with the development of an Alarm Philosophy",
        "which establishes the basic definitions",
        "principles and processes to design",
        "implement and maintain an alarm system. The development of an Alarm Philosophy for the new EPICS Control system at ISIS is outlined",
        "setting out the basis for the identification",
        "classification and prioritisation of alarms. The challenges of managing the transition of the alarms from Vsystem to EPICS are discussed",
        "including the outcome of initial work applying the Alarm Philosophy to rationalising the existing Vsystem alarms."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv016.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "THPV017",
      "title": "A cloud based toolbox for accelerator controls interfaces and optimization",
      "authors": [
        "J.P. Edelen",
        "E.G. Carlin",
        "M.V. Keilman",
        "P. Moeller",
        "R. Nagler",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "Modern particle accelerator facilities generate large amounts of data and face increasing demands on their operational performance. As the demand on accelerator operations increases so does the need for automated tuning algorithms and control to maximize uptime with reduced operator intervention. Existing tools are insufficient to meet the broad demands on controls",
        "visualization",
        "and analysis. We have developed a cloud based toolbox featuring a generic virtual accelerator control room for the development of automated tuning algorithms and the analysis of large complex datasets. This framework utilizes tracking codes combined with with algorithms for machine drift",
        "low-level control systems",
        "and other complications to create realistic models of accelerators. These models are directly interfaced with control toolboxes allowing for rapid prototyping of tuning algorithms. In this paper",
        "we will provide an overview of our interface and demonstrate its utility for building beamline controls displays directly from accelerator simulation lattices. We will also demonstrate the use of our interface for testing online optimization and control algorithms."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv017.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "THPV018",
      "title": "Infrastructure-independent Device Control",
      "authors": [
        "A. Sukhanov",
        "J.P. Jamilkowski",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "In modern accelerator control systems there is often a need for controlling devices which have been developed with interface to a different control infrastructure. For example",
        "the future EIC collider will have mixture of EPICS-controlled and ADO-controlled devices. In this paper we describe the control tools and middle-level interface which allows to control the devices independently of their dedicated architecture. The tools are implemented in python and currently they include a pypet",
        "an imageViewer",
        "and a pvplot. The pypet a spreadsheet-based advanced parameter editing tool which covers functionality of the EDM",
        "MEDM and PET. The imageViewer is interactive image analysis tool",
        "supporting AreaDetector",
        "USB and ADO - controlled cameras. The pvplot is simple parameter plotting tool. The tools are operational at RHIC collider and they provide control for devices from various infrastructures (ADO",
        "EPICS and liteServer)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv018.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "THPV021",
      "title": "TATU: A Flexible FPGA-Based Trigger and Timer Unit Created on CompactRIO for the First Sirius Beamlines",
      "authors": [
        "J.R. Piton",
        "D. Alnajjar",
        "D.H.C. Araujo",
        "J.L. Brito Neto",
        "L.P. Do Carmo",
        "L.C. Guedes",
        "M.A.L. Moraes",
        "LNLS",
        "Campinas",
        "Brazil",
        "In the modern synchrotron light sources",
        "the higher brilliance leads to shorter acquisition times at the experimental stations. For most beamlines of the fourth-generation source SIRIUS",
        "it was imperative to shift from the usual software-based synchronization of operations to the much faster triggering by hardware of some key equipment involved in the experiments. As a basis of their control system for devices",
        "the SIRIUS beamlines have standard CompactRIO controllers and I/O modules along the hutches. Equipped with a FPGA and a hard processor running Linux Real-Time",
        "this platform could deal with the triggers from and to other devices",
        "in the order of ms and µs. TATU (Time and Trigger Unit) is a code running in a CompactRIO unit to coordinate multiple triggering conditions and actions. TATU can be either the master pulse generator or the follower of other signals. Complex trigger pattern generation is set from a user-friendly standardized interface. EPICS process variables (by means of LNLS Nheengatu*) are used to set parameters and to follow the execution status. The concept and first field test results in at least four SIRIUS beamlines are presented.",
        "* D. Alnajjar",
        "G. S. Fedel",
        "and J. R. Piton",
        "\"Project Nheengatu: EPICS support for CompactRIO FPGA and LabVIEW-RT\"",
        "ICALEPCS’19",
        "New York",
        "NY",
        "USA",
        "Oct. 2019",
        "paper"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv021.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV021",
      "page_number": "908",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV022",
      "title": "MRF Timing System Design at SARAF",
      "authors": [
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "CEA Saclay Irfu is in charge of an important part of the control system of the SARAF LINAC accelerator based at Soreq (Israel). This includes",
        "among other",
        "the control of the timing system (synchronization and timestamping). CEA has already installed and uses successfully the timing distribution with MRF on test benches for ESS or IPHI",
        "so it has been decided to use the same technologies. The reference frequency will be distributed along the accelerator by a master oscillator Wenzel and the UTC time will be based on a Meridian II GPS",
        "these 2 devices will be connected to the Event Master (EVM) card which is the main element of the timing system architecture. Through an optical fiber network",
        "the MRF timing system allows to distribute downstream and upstream events with a µs propagation time. Currently",
        "we are working on development in order to also use it for the machine protection system of the accelerator. In this paper",
        "hardware",
        "timing architecture",
        "software developments and tests will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv022.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV022",
      "page_number": "912",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV025",
      "title": "A New Timing System for PETRA IV",
      "authors": [
        "T. Wilksen",
        "A. Aghababyan",
        "K. Brede",
        "H.T. Duhme",
        "M. Fenner",
        "U. Hurdelbrink",
        "H. Kay",
        "H. Lippek",
        "H. Schlarb",
        "DESY",
        "Hamburg",
        "Germany",
        "At DESY an upgrade of the PETRA III synchrotron light source towards a fourth-generation",
        "low emittance machine PETRA IV is currently being actively pursued. The realization of this new machine implies a new design of the timing and synchronization system since requirements on beam quality and controls will significantly change from the existing implementation at PETRA III. The technical design phase of the PETRA IV project is in mid-phase and supposed to deliver a Technical Design Report by end of next year. The conceptual layout of the timing system will follow the successful MTCA.4-based approach as in use at the European XFEL. It will be enhanced to meet the requirements of a synchrotron facility and its booster and linac pre-accelerators. We present general concepts of the timing system",
        "its integration into the control system as well as first specifications of the MTCA.4-based hardware components."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv025.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV025",
      "page_number": "916",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPV027",
      "title": "Application of the White Rabbit System at SuperKEKB",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "EJIT",
        "Hitachi",
        "Ibaraki",
        "Japan"
      ],
      "institutions": [
        "We employ the White Rabbit system to satisfy the increasing requests from the SuperKEKB operations. The SuperKEKB-type slave node was developed based on the SPEC board and FMC-DIO card. The firmware was customized slightly to realize the SuperKEKB needs. The device/driver for EPICS was developed. The five slave nodes have been operated since the 2021 autumn run. The delivery of the beam permission signal from the central control building to the injector linac is taken care of by new slave nodes. The timing of the abort request signal and the trigger for the abort kicker magnet are recorded with the distributed TDC system. More slave nodes will be installed in the next year to enhance the role of the distributed TDC system."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv027.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV027",
      "page_number": "919",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV028",
      "title": "Analysis of AC Line Fluctuation for Timing System at KEK",
      "authors": [
        "Sokendai",
        "Ibaraki",
        "Japan",
        "Y. Enomoto",
        "K. Furukawa",
        "H. Kaji",
        "F. Miyahara",
        "M. Sato",
        "H. Sugimura",
        "KEK",
        "Ibaraki",
        "Japan",
        "The timing system controls the injection procedure of the accelerator by performing signal synchronization and trigger delivery to the devices all over the installations at KEK. The trigger signals is usually generated at the same phase of an AC power line to reduce the unwanted variation of the beam quality. This requirement originates from the power supply systems. However",
        "the AC line synchronization conflicts with the bucket selection process of SuperKEKB low energy ring (LER) which stores the positron beam. The positron beam is firstly injected into a damping ring (DR) to lower the emittance before entering desired RF bucket in LER. A long bucket selection cycle for DR and LER makes it difficult to coincide with AC line every injection pulse. This trouble is solved by grouping several injection pulses into various of injection sequences and manipulating the length of sequences to adjust the AC line arrival timing. Therefore",
        "the timing system is sensitive to drastically AC line fluctuation. The failure of timing system caused by strong AC line fluctuation and solutions are introduced in this work."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv028.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV028",
      "page_number": "923",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV029",
      "title": "Development of Timing Read-Back System for Stable Operation of J-PARC",
      "authors": [
        "Sokendai",
        "Ibaraki",
        "Japan",
        "KEK",
        "Ibaraki",
        "Japan",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "J-PARC",
        "KEK & JAEA",
        "Ibaraki-ken",
        "Japan",
        "Kanto Information Service (KIS)",
        "Accelerator Group",
        "Ibaraki",
        "Japan",
        "Since 2006",
        "the Japan Proton Accelerator Research Complex (J-PARC) timing system has been operated successfully. However",
        "there were some unexpected trig-ger-failure events",
        "typically missing trigger events",
        "during the operation over 15 years. When a trigger-failure event occurred",
        "it was often tough to find the one with the fault among many suspected modules. To solve the problem more easily",
        "a unique device",
        "triggered scaler",
        "was devel-oped for reading back accelerator signals. The performance of the module has been evaluated in 2018. In 2021",
        "we measured and observed an LLRF sig-nal as the first signal of the read-back system for beam operation. After firmware upgrades of the module",
        "some customized timing read-back systems were developed",
        "and successfully demonstrated as coping strategies for past trigger-failure events. In addition",
        "a future plan to apply the read-back system to other facilities is discussed. More details are given in the paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv029.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV029",
      "page_number": "927",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPV031",
      "title": "Upgrade of Timing System at HZDR ELBE Facility",
      "authors": [
        "Ž. Oven",
        "L. Krmpotić",
        "U. Legat",
        "U. Rojec",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "M. Justus",
        "M. Kuntzsch",
        "A. Schwarz",
        "K. Zenker",
        "HZDR",
        "Dresden",
        "Germany",
        "The ELBE center for high power radiation sources is operating an electron linear accelerator to generate various secondary radiation like neutrons",
        "positrons",
        "intense THz and IR pulses and Bremsstrahlung. Timing system",
        "that is currently in operation",
        "has been modified and extended in the last two decades to enable new experiments. At the moment parts of this timing system are using obsolete components which makes maintenance a very challenging endeavour. To make ELBE timing system again a more homogenous system",
        "that will allow for easier adaption to new and more complex trigger patterns",
        "an upgrade based on Micro Research Finland (MRF) hardware platform is currently in progress. This upgrade will enable parallel operation of two electron sources and subsequent kickers to serve multiple end stations at the same time. Selected hardware enables low jitter emission of timing patterns and a long-term delay compensation of the distribution network. We are currently in the final phase of development and with plans for commissioning to be completed in 2022."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv031.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV031",
      "page_number": "931",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV032",
      "title": "The Demonstrator of the HL-LHC ATLAS Tile Calorimeter",
      "authors": [
        "Tbilisi State University",
        "T’bilisi",
        "Georgia",
        "The High Luminosity Large Hadron Collider (HL-LHC) has motivated R&D to upgrade the ATLAS Tile Calorimeter. The new system consists on an optimized analogue design engineered with selected radiation-tolerant COTS and redundancy layers to avoid single points of failure. The design will provide better timing",
        "improved energy resolution",
        "lower noise and less sensitivity to out-of-time pileup. Multiple types of FPGAs",
        "CERN custom rad-hard ASICs (GBTx)",
        "and multi-Gbps optical links are used to distribute LHC timing",
        "read out fully digital data of the whole TileCal",
        "transmit timing and calibrated energy per cell to the Trigger system at 40 MHz",
        "and provide triggered data at 1 MHz. To test the upgraded electronics in real ATLAS conditions",
        "a hybrid demonstrator prototype module containing the new calorimeter module electronics",
        "but still compatible with TileCal’s legacy system was tested in ATLAS during 2019-2021. An upgraded version of the demonstrator with finalized HL-LHC electronics is being assembled to be tested in testbeam campaigns at the Super Proton Syncrotron (SPS) at CERN. We present current status and results for the different tests done with the upgraded demonstrator system."
      ],
      "institutions": [],
      "abstract": "Presented on behalf of the ATLAS Tile Calorimeter System",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv032.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV032",
      "page_number": "935",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV033",
      "title": "Reusable Real-Time Software Components for the SPS Low Level RF Control System",
      "authors": [
        "M. Sumiński",
        "K. Adrianek",
        "B. Bielawski",
        "A.C. Butterworth",
        "J. Egli",
        "G. Hagmann",
        "P. Kuzmanović",
        "S. Novel González",
        "A. Rey",
        "A. Spierer",
        "CERN",
        "Geneva",
        "Switzerland",
        "In 2021 the Super Proton Synchrotron has been recommissioned after a complete renovation of its low level RF system (LLRF). The new system has largely moved to digital signal processing implemented as a set of functional blocks (IP cores) in Field Programmable Gate Arrays (FPGAs) with associated software to control them. Some of these IP cores provide generic functionalities such as timing",
        "function generation",
        "data resampling and signal acquisition",
        "and are reused in several components",
        "with a potential application in other accelerators. To take full advantage of the modular approach",
        "IP core flexibility must be complemented by the software stack. In this paper we present steps we have taken to reach this goal from the software point of view",
        "and describe the custom tools and procedures used to implement the various software layers."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv033.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV033",
      "page_number": "939",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV034",
      "title": "Data Analysis and Rapid Prototyping using Dashboards",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "Today most control system frameworks offer sophisticated GUI toolkits and designers. Despite its capabilities in data visualisation these toolkits still require additional processing and computation power when it comes to the exploration of new kinds of data and its hidden analysis potential. Modern dashboard technologies as used in data science do not offer only rapid prototyping of the data analysis chain but also provide complex processing power combined with smart visualisation techniques. This enables a quick turn-around when modifying and adapting the data analysis implementation itself. In modern data analytics dashboards are considered to be a key element for enabling investigative data science. For a project analysing the accelerator machine availability",
        "we implemented a web application using the Streamlit framework. The ease of use and the rich set of possibilities further encouraged us to use this technology for some data science related tasks. The seamless interplay between complex preprocessing and the multitude of visualisation possibilities demonstrate",
        "that these dashboard technologies are very well suited for explorative science related projects."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv034.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "THPV036",
      "title": "Laser Driver State Estimation Oriented Data Governance",
      "authors": [
        "J. Luo",
        "L. Li",
        "Z. Ni",
        "X. Zhou",
        "CAEP",
        "Sichuan",
        "People’s Republic of China",
        "Laser driver state estimation is an important task dur-ing the operation process for the high-power laser facility",
        "by utilizing measured data to analyze experiment results and laser driver performances. It involves complicated data processing jobs",
        "including data extraction",
        "data cleaning",
        "data fusion",
        "data visualization and so on. Data governance aims to improve the efficiency and quality of data analysis for laser driver state estimation",
        "which fo-cuses on 4 aspects ’ data specification",
        "data cleaning",
        "data exchange",
        "and data integration. The achievements of data governance contribute to not only laser driver state estimation",
        "but also other experimental data analy-sis applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv036.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV036",
      "page_number": "942",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV037",
      "title": "The Implementation of the Beam Profile Application for KOMAC Beam Emittance",
      "authors": [
        "J.H. Kim",
        "S.Y. Cho",
        "S. Lee",
        "Y.G. Song",
        "S.P. Yun",
        "KOMAC",
        "KAERI",
        "Gyeongju",
        "Republic of Korea",
        "Korea Multi-purpose Accelerator Complex(KOMAC) has been operating a 100 MeV proton linear accelerator that accelerates a beam using ion source",
        "a radio frequency quadrupole(RFQ)",
        "11 drift tube linac(DTL). And the accelerated protons are transported to target rooms that meets the conditions required by the users. It is important to figure out the beam profile of the proton linac to provide the proper beam condition to users. We installed 8 wire scanners to measure beam emittance of KOMAC at beam lines. And beam profile application to measure beam emittance has been implemented using EPICS and python. This paper will describe the implementation of the beam profile application for KOMAC beam emittance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv037.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV037",
      "page_number": "947",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV038",
      "title": "Plug-in-Based Ptychography & CDI Reconstruction User Interface Development",
      "authors": [
        "S.W. Kim",
        "K.H. Ku",
        "W.W. Lee",
        "PAL",
        "Pohang",
        "Republic of Korea",
        "Synchrotron beamlines have a wide range of fields",
        "and accordingly",
        "various open source and commercial softwares are being used for data analysis. Inevitable",
        "the user interface differs between programs and there is little shared part",
        "so the user had to spend a lot of effort to perform a new experimental analysis and learn how to use the program newly. In order to overcome these shortcomings",
        "the same user interface was maintained using the Xi-cam framework",
        "and different analysis algorithms for each field were introduced in a plugin method. In this presentation",
        "user interfaces designed for ptychography and cdi reconstruction will be introduced."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv038.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV038",
      "page_number": "950",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV039",
      "title": "Machine learning applications for accelerator failure prevention at MAX IV",
      "authors": [
        "J.E. Petersson",
        "B. Meirose",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "Machine learning (ML) applications have received renewed interest in recent years. The reason behind this lies in advances in ML methods, data availability and increased computational power. Application of ML techniques to diagnose or even prevent accelerator failures is an area of particular interest not least because of the ample data that is routinely gathered in all modern accelerators to conduct reliability studies. In this contribution we present preliminary results of the application of unsupervised learning to diagnose and decrease accelerator failure rates at MAX IV, focusing on systems and methods that presented the best results. reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv039.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPV040",
      "title": "New Machine Learning Model Application for the Automatic LHC Collimator Beam-Based Alignment",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "Sapienza University of Rome",
        "Rome",
        "Italy",
        "A collimation system is installed in the Large Hadron Collider (LHC) to protect its sensitive equipment from unavoidable beam losses. An alignment procedure determines the settings of each collimator",
        "by moving the collimator jaws towards the beam until a characteristic loss pattern",
        "consisting of a sharp rise followed by a slow decay",
        "is observed in downstream beam loss monitors. This indicates that the collimator jaw intercepted the reference beam halo and is thus aligned to the beam. The latest alignment software introduced in 2018 relies on supervised machine learning (ML) to detect such spike patterns in real-time*. This enables the automatic alignment of the collimators with a significant reduction in the alignment time**. This paper analyses the first-use performance of this new software focusing on solutions to the identified bottleneck caused by waiting a fixed duration of time when detecting spikes. It is proposed to replace the supervised ML model with a Long-Short Term Memory model able to detect spikes in time windows of varying lengths",
        "waiting for a variable duration of time determined by the spike itself. This will allow to further speed up the automatic alignment.",
        "*G. Azzopardi et al.",
        "\"Automatic spike detection in beam loss signals for LHC collimator alignment\"",
        "NIMA 2019. **G. Azzopardi et al.",
        "\"Operational Results of LHC collimator alignment using ML\"",
        "IPAC’19."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv040.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV040",
      "page_number": "953",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV041",
      "title": "Innovative Methodology Dedicated to the CERN LHC Cryogenic Valves Based on Modern Algorithm for Fault Detection and Predictive Diagnostics",
      "authors": [
        "M. Pezzetti",
        "A. Amodio",
        "Y. Donon",
        "L. Iodice",
        "CERN",
        "Geneva",
        "Switzerland",
        "Naples University Federico II",
        "Science and Technology Pole",
        "Napoli",
        "Italy",
        "University of Naples Federico II",
        "Naples",
        "Italy",
        "The European Organization for Nuclear Research (CERN) cryogenic infrastructure is composed of many equipment",
        "among them there are the cryogenic valves widely used in the Large Hadron Collider (LHC) cryogenic facility. At present time",
        "diagnostic solutions that can be integrated into the process control systems",
        "capable to identify leak failures in valves bellows",
        "are not available. The authors goal has been the development of a system that allows the detection of helium leaking valves during normal operation using available data extracted from the control system. The design constraints has driven the development towards a solution integrated in the monitoring systems in use",
        "not requiring manual interventions. The methodology presented in this article is based on the extraction of distinctive features (analyzing the data in time and frequency domain) which are exploited in the next phase of machine learning. The aim is to identify a list of candidate valves with a high probability of helium leakage. The proposed methodology",
        "which is at very early stage now",
        "with the evolution of the data set and the iterative approach is aiming toward a cryogenic valves targeted maintenance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv041.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV041",
      "page_number": "959",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV042",
      "title": "Evolution of the CERN Beam Instrumentation Offline Analysis Framework (OAF)",
      "authors": [
        "A. Samantas",
        "M. Gonzalez-Berges",
        "J-J. Gras",
        "S. Zanzottera",
        "CERN",
        "Geneva 23",
        "Switzerland",
        "The CERN accelerators require a large number of instruments",
        "measuring different beam parameters like position",
        "losses",
        "current etc. The instruments’ associated electronics and software also produce information about their status. All these data are stored in a database for later analysis. The Beam Instrumentation group developed the Offline Analysis Framework some years ago to regularly and systematically analyze these data. The framework has been successfully used for nearly 100 different analyses that ran regularly by the end of the LHC run 2. Currently it is being updated for run 3 with modern and efficient tools to improve its usability and data analysis power. In particular",
        "the architecture has been reviewed to have a modular design to facilitate the maintenance and the future evolution of the tool. A new web based application is being developed to facilitate the users’ access both to online configuration and to results. This paper will describe all these evolutions and outline possible lines of work for further improvements.",
        "* \"A Framework for Off-Line Verification of Beam Instrumentation Systems at CERN\"",
        "S. Jackson et al.",
        "ICALEPCS 2013 San Francisco"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv042.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV042",
      "page_number": "965",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV043",
      "title": "Using AI for Management of Field Emission in SRF Linacs",
      "authors": [
        "A. Carpenter",
        "P. Degtiarenko",
        "R. Suleiman",
        "C. Tennant",
        "D.L. Turner",
        "L.S. Vidyaratnepresenter",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "K.M. Iftekharuddin",
        "M. Rahman",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "Field emission control",
        "mitigation",
        "and reduction is critical for reliable operation of high gradient superconducting radio-frequency (SRF) accelerators. With the SRF cavities at high gradients",
        "the field emission of electrons from cavity walls can occur and will impact the operational gradient",
        "radiological environment via activated components",
        "and reliability of CEBAF’s two linacs. A new effort has started to minimize field emission in the CEBAF linacs by re-distributing cavity gradients. To measure radiation levels",
        "newly designed neutron and gamma radiation dose rate monitors have been installed in both linacs. Artificial intelligence (AI) techniques will be used to identify cavities with high levels of field emission based on control system data such as radiation levels",
        "cryogenic readbacks",
        "and vacuum loads. The gradients on the most offending cavities will be reduced and compensated for by increasing the gradients on least offensive cavities. Training data will be collected during this year’s operational program and initial implementation of AI models will be deployed. Preliminary results and future plans are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv043.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV043",
      "page_number": "970",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV045",
      "title": "Monitoring, Logging and Alarm Systems for the Cherenkov Telescope Array: Architecture and Deployment",
      "authors": [
        "A. Costa",
        "E. Sciacca",
        "INAF-OACT",
        "Catania",
        "Italy",
        "The Array Control and Data Acquisition System (ACADA) is responsible for the telescope control operations in The Cherenkov Telescope Array (CTA). We present the software architecture of the Monitoring",
        "Logging and Alarm subsystems in the ACADA framework. The Monitoring System (MON) is the subsystem that addresses the acquisition of the monitoring and logging information from the CTA array elements. The MON will also support corrective and predictive maintenance to minimize the downtime of the system. The Array Alarm System (AAS) is the subsystem that is responsible for collecting alarms from telescopes",
        "array calibration and environmental monitoring instruments",
        "and the ACADA systems itself. The final software deployment is expected to manage about 200.000 monitoring points sampled between 1 and 5 Hz for a maximum data rate for writing operations of 26 Mbps for the monitoring system including the alarms",
        "and a maximum rate of about 1 Gbps for the aggregated log information. This paper presents the architecture and deployment for MON and AAS subsystems which are  currently being tested with a simulated set of monitoring points and log events.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv045.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPV046",
      "title": "Virtualized Control System Infrastructure at LINAC Project, PINSTECH",
      "authors": [
        "N.U. Saqib",
        "F. Sher",
        "PINSTECH",
        "Islamabad",
        "Pakistan",
        "IT infrastructure is backbone of modern big science accelerator control systems. Accelerator Controls and Electronics (ACE) Group is responsible for controls",
        "electronics and IT infrastructure for Medical and Industrial NDT (Non-Destructive Testing) linear accelerator prototypes at LINAC Project",
        "PINSTECH. All of the control system components such as EPICS IOCs",
        "Operator Interfaces",
        "Databases and various servers are virtualized using VMware vSphere and VMware Horizon technologies. This paper describes the current IT design and development structure that is supporting the control systems of the linear accelerators efficiently and effectively."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv046.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV046",
      "page_number": "975",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV047",
      "title": "Status of High Level Application Development for HEPS",
      "authors": [
        "IHEP CSNS",
        "Guangdong Province",
        "People’s Republic of China",
        "H.F. Ji",
        "Y. Jiao",
        "J.Y. Li",
        "C. Meng",
        "Y.M. Peng",
        "G. Xu",
        "Q. Ye",
        "Y.L. Zhao",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "The High Energy Photon Source (HEPS) is a 6 GeV",
        "1.3 km",
        "ultralow emittance ring-based light source in China. The construction started in 2019. In this year",
        "the development of beam commissioning software of HEPS started. It was planned to use EPICS as the control system and Python as the main development tools for high level applications (HLAs). Python has very rich and mature modules to meet the challenging requirements of HEPS commissioning and operation",
        "such as PyQt5 for graphical user interface (GUI) application development",
        "PyEPICS and P4P for communicating with EPICS. A client-server framework was proposed for online calculations and always-running programs. Model based control is also one important design criteria",
        "all the online commissioning software should be easily connected to a powerful virtual accelerator (VA) for comparison and predicting actual beam behaviour. It was planned to use elegant and Ocelot as the core calculation model of VA"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv047.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV047",
      "page_number": "978",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPV048",
      "title": "Novel Control System for the LHCb Scintillating Fibre Tracker Detector Infrastructure",
      "authors": [
        "M. Ostrega",
        "M.A. Ciupinski",
        "S. Jakobsen",
        "X. Pons",
        "CERN",
        "Geneva",
        "Switzerland",
        "During the Long Shutdown 2 of the LHC at CERN",
        "the LHCb detector is upgraded to cope with higher instantaneous luminosities. The largest of the new trackers is based on the scintillating fibres (SciFi) read out by SIlicon PhotoMultipliers (SiPMs). The SiPMs will be cooled down to -40°C to minimize noise. For performance and space reasons",
        "the cooling lines are vacuum insulated. Ionizing radiation requires detaching and displace the readout electronics from Pirani gauges to a lower radiation area. To avoid condensation inside the SiPM boxes",
        "the atmosphere inside must have a dew point of at most -45°C. The low dew point will be achieved by flushing a dry gas through the box. 576 flowmeters devices will be installed to monitor the gas flow continuously. A Condensation Prevention System (CPS) has been introduced as condensation was observed. The CPS powers heating wires installed around the SiPM boxes and the vacuum bellows isolating the cooling lines. The CPS also includes 672 temperature sensors to monitor that all parts are warmer than the cavern dew point. The temperature readout systems are based on multiplexing technology at the in the front-end and a PLC in the back-end."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv048.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV048",
      "page_number": "981",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "THPV049",
      "title": "Virtualisation and Software Appliances as Means for Deployment of SCADA in Isolated Systems",
      "authors": [
        "P. Golonka",
        "L. Davoine",
        "M.Z. Zimny",
        "L. Zwalinski",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The paper discusses the use of virtualisation as a way to deliver a complete pre-configured SCADA (Supervisory Control And Data Acquisition) application as a software appliance to ease its deployment and maintenance. For the off-premise control systems",
        "it allows for deployment to be performed by the local IT servicing teams with no particular control-specific knowledge",
        "providing a \"turn-key\" solution. The virtualisation of a complete desktop allows to deliver and reuse the existing feature-rich Human-Machine Interface experience for local operation; it also resolves the issues of hardware and software compatibilities in the deployment sites. The approach presented here was employed to provide replicas of the \"LUCASZ\" cooling system to collaborating laboratories",
        "where the on-site knowledge of underlying technologies was not available and required to encapsulate the controls as a \"black-box\" so that for users",
        "the system is operational soon after power is applied. The approach is generally applicable for international collaborations where control systems are contributed and need to be maintained by remote teams"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/thpv049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/thpv049.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/thpv049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-THPV049",
      "page_number": "985",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 39,
  "scrape_time": "2025-10-10 18:07:30"
}