{
  "session_info": {
    "id": "WEPOB",
    "name": "WEPOB - Poster Session (MC2)",
    "url": "https://proceedings.jacow.org/napac2016/html/wepob.htm"
  },
  "papers": [
    {
      "paper_id": "WEPOB01",
      "title": "Lower Emittance Lattice for the Advanced Photon Source Upgrade Using Reverse Bending Magnets",
      "authors": [
        "M. Borland",
        "T.G. Berenc",
        "R.R. Lindberg",
        "V. Sajaev",
        "Y.P. Sun",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "he Advanced Photon Source (APS) is pursuing an upgrade to the storage ring to a hybrid seven-bend-achromat design*. The nominal design provides a natural emittance of 67 pm. By adding reverse dipole fields to several quadrupoles**",
        "we can reduce the natural emittance to 41 pm while simultaneously providing more optimal beta functions in the insertion devices. The improved emittance results from a combination of increased energy loss per turn and a change in the damping partition. At the same time",
        "the nonlinear dynamics performance is very similar",
        "thanks in part to increased dispersion in the sextupoles. This paper describes the properties",
        "optimization",
        "and performance of the new lattice.",
        "* L. Farvacque et al."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob01.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB01",
      "page_number": "877",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB02",
      "title": "Simulation of Swap-Out Reliability for the Advance Photon Source Upgrade",
      "authors": [
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The proposed upgrade of the Advanced Photon Source (APS) to a multibend achromat lattice relies on the use of swap-out injection to accommodate the small dynamic acceptance",
        "allow use of unusual insertion devices",
        "and minimize collective effects at high single-bunch charge. This",
        "combined with the short beam lifetime",
        "will make injector reliability even more important than it is for top-up operation. We used historical data for the APS injector complex to obtain probability distributions for injector up-time and down-time durations. Using these distributions",
        "we simulated several years of swap-out operation for the upgraded lattice for several operating modes. The results indicate that obtaining very high availability of beam in the storage ring will require improvements to injector reliability."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob02.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB02",
      "page_number": "881",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB03",
      "title": "Magnetic Measurements of Storage Ring Magnets for the APS Upgrade Project",
      "authors": [
        "R.J. Dejus",
        "H. Cease",
        "J.T. Collins",
        "G. Decker",
        "A.T. Donnelly",
        "C.L. Doose",
        "W.G. Jansma",
        "M.S. Jaski",
        "J. Liu",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Extensive prototyping of storage ring magnets is ongoing at the Advanced Photon Source (APS) in support of the APS Multi-Bend Achromat upgrade (APS-U) project. As part of the R&D activities 4 quadrupole magnets with slightly different geometries and pole tip materials",
        "and one sextupole magnet with vanadium permendur pole tips were designed",
        "built and tested. Magnets were measured individually using a rotating coil and a Hall probe for detailed mapping of the magnetic field. Magnets were then assembled and aligned relative to each other on a steel support plate and concrete plinth using precision machined surfaces to gain experience with the alignment method chosen for the APS-U storage ring magnets. The required alignment of magnets on a common support structure is 30 micron rms. Measurements of magnetic field quality",
        "strength and magnet alignment after subjecting the magnets and assemblies to different tests will be presented."
      ],
      "institutions": [
        "Funding: * Work supported by U.S. Department of Energy, Office of Science, under contract number DE-AC02-06CH11357, and contract number DE-SC0012704 for work associated with Brookhaven National Laboratory."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob03.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB03",
      "page_number": "884",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPOB04",
      "title": "Beamline-Controlled Steering of Source-Point Angle at the Advanced Photon Source",
      "authors": [
        "L. Emery",
        "G.I. Fystro",
        "H. Shang",
        "M.L. Smith",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "An EPICS-based steering software system has been implemented for beamline personnel to directly steer the angle of the synchrotron radiation sources at the Advanced Photon Source. A script running on a workstation monitors \"start steering\" beamline EPICS records",
        "and effects a steering by the value of \"angle request\" EPICS records that beamlines have set. The new system effectively bypasses floor coordinators and MCR operators",
        "and makes the steering process much faster than before",
        "although these older protocols can still be used. As with the original steering there are EPICS alarm limits that prevent large steering from occurring and avoid other problems. Error messages and statuses",
        "OPI windows and alarm configurations are provided to the beamlines and the accelerator operators. Underpinning this new steering protocol is the recent refinement of the global orbit feedback process whereby feedforward of dipole corrector set points and orbit set points are used to create a local steering bump in a rapid and seamless way. In principle and in practice",
        "many simultaneous steering commands from many beamlines are possible. We report on a complete 3-month run of experience."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob04.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB04",
      "page_number": "887",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB05",
      "title": "Operational Experience With Beam Abort System for Superconducting Undulator Quench Mitigation",
      "authors": [
        "K.C. Harkay",
        "J.C. Dooling",
        "V. Sajaev",
        "J. Wang",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "A beam abort system has been implemented in the Advanced Photon Source storage ring. The abort system works in tandem with the existing machine protection system (MPS)",
        "and its purpose is to control the beam loss location and",
        "thereby",
        "minimize beam loss-induced quenches at the two superconducting undulators (SCUs). The abort system consists of a dedicated horizontal kicker designed to kick out all the bunches in a few turns after being triggered by MPS. The abort system concept was developed on the basis of single- and multi-particle tracking simulations using elegant and bench measurements of the kicker pulse. Performance of the abort system–kick amplitudes and loss distributions of all bunches–was analyzed using beam position monitor (BPM) turn histories",
        "and agrees reasonably well with the model. Beam loss locations indicated by the BPMs are consistent with the fast fiber-optic beam loss diagnostics described elsewhere [1]. Operational experience with the abort system",
        "various issues that were encountered",
        "limitations of the system",
        "and quench statistics are described.",
        "[1] J. Dooling et al.",
        "these proceedings."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob05.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB05",
      "page_number": "890",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB06",
      "title": "Parameterization of Helical Superconducting Undulator Magnetic Field*",
      "authors": [
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Using a scaling law",
        "the magnetic fields of helical superconducting undulators (HSCUs) for a period range of 10 ' 50 mm are parameterized from the field calculations of one reference HSCU with a period of 30 mm. The on-axis fields are calculated at the critical current densities of the NbTi and Nb3Sn superconducting coils at 4.2 K. The parametrized on-axis fields for the period range are expressed in terms of the period and inner radius of the helical coils. The corresponding critical current densities and coil maximum fields are also included. The parameterization procedures are described in detail and some field deviations are discussed.",
        "*Work supported by the U.S. Department of Energy",
        "Office of Science",
        "under Contract No. DE-AC02-06CH11357.  Associate of Seville",
        "Advanced Photon Source   'shkim@aps.anl.gov",
        "shkim242@gmail.com"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob06.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB06",
      "page_number": "894",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB07",
      "title": "Dielectrically-Loaded Waveguide as a Short Period Superconducting Microwave Undulator",
      "authors": [
        "R. Kustom",
        "A. Nassiri",
        "K.J. Suthar",
        "G.J. Waldschmidt",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The HEM12 mode in a cylindrical",
        "dielectrically-loaded waveguide provides E and H fields on the central axis that are significantly higher than the fields on the conducting walls. The waveguide is designed to operate near its cutoff frequency where the wavelength and phase velocity vary significantly to enable tuning of the equivalent undulator wavelength. The operating frequency would range from 18 - 24 GHz. It would be possible to generate coherent",
        "high-energy 45 - 65 KeV x-rays from the fundamental mode which are tunable over a 20% energy range by changing the source frequency while maintaining constant field strengths. The x-ray brilliance of the microwave undulator would be 3 times higher at 56-KeV and 7 times higher at 66 KeV than what is available with the APS 1.8 cm period Superconducting Wire Undulator. Since the loss factor of sapphire is very low at cryogenic temperatures",
        "it is possible to consider a superconducting microwave undulator",
        "although resistive losses of ~200 to 700 W/m may be a bit too high for CW operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob07.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB07",
      "page_number": "897",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB08",
      "title": "Collective Effects at Injection for the APS-U MBA Lattice",
      "authors": [
        "R.R. Lindberg",
        "M. Borland",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The Advanced Photon Source has proposed an upgrade to a multi-bend achromat (MBA) with a proposed timing mode calls for 48 bunches of 15 nC each. In this mode of operation we find that phase space mismatch from the booster can drive large wakefields that in turn may limit the current below that of the nominal collective instability threshold. We show that collective effects at injection lead to emittance growth that makes usual off-axis accumulation very challenging. On-axis injection ameliorates many of these issues",
        "but we find that transverse feedback is still required. We explore the role of impedance",
        "feedback",
        "and phase-space mismatch on transverse instabilities at injection."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob08.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB08",
      "page_number": "901",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB09",
      "title": "Field Quality from Tolerance Stack Up in R&D Quadrupoles for the Advanced Photon Source Upgrade",
      "authors": [
        "J. Liu",
        "M. Borland",
        "R.J. Dejus",
        "A.T. Donnelly",
        "C.L. Doose",
        "J.S. Downey",
        "M.S. Jaski",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The Advanced Photon Source (APS) at Argonne National Laboratory (ANL) is considering upgrading the current double-bend",
        "7-GeV",
        "3rd generation storage ring to a 6-GeV",
        "4th generation storage ring with a Multibend Achromat (MBA) lattice. In this study",
        "a novel method is proposed to determine fabrication and assembly tolerances through a combination of magnetic and mechanical tolerance analyses. Mechanical tolerance stackup analyses using Teamcenter Variation Analysis are carried out to determine the part and assembly level fabrication tolerances. Finite element analyses using OPERA are conducted to estimate the effect of fabrication and assembly errors on the magnetic field of a quadrupole magnet and to determine the allowable tolerances to achieve the desired magnetic performance. Finally",
        "results of measurements in R&D quadrupole prototypes are compared with the analysis results."
      ],
      "institutions": [
        "Funding: *Work supported by U.S. Department of Energy, Office of Science, under contract No. DE-AC02-06CH11357 and contract number DE-SC0012704 for work associated with Brookhaven National Laboratory."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob09.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB09",
      "page_number": "904",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB10",
      "title": "Simulation Study of the Helical Superconducting Undulator Installation at the Advanced Photon Source",
      "authors": [
        "V. Sajaev",
        "M. Borland",
        "Y.P. Sun",
        "A. Xiao",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "A helical superconducting undulator is planned for installation at the APS. Such an installation would be first of its kind – helical devices were never installed in synchrotron light sources before. Due to its reduced horizontal aperture",
        "a lattice modification is required to accommodate for large horizontal oscillations during injection. We describe the lattice change details and show the new lattice experimental test results. To understand the effect of the undulator on single-particle dynamics",
        "first",
        "its kick maps were computed using different methods. We have found that often-used Elleaume formula* for kick maps gives wrong results for this undulator. We then used the kick maps obtained by other methods to simulate the effect of the undulator on injection and lifetime.",
        "*P. Elleaume",
        "EPAC 1992"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob10.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB10",
      "page_number": "907",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB11",
      "title": "Tuning of the APS Linac Accelerating Cavities After Structural Re-Alignment",
      "authors": [
        "T.L. Smith",
        "G.J. Waldschmidt",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "A new S-band LCLS type Photo-cathode (PC) gun was recently installed in the APS linac. As a consequence",
        "it was recognized that many of the linac accelerating structures were out of their 1mm straightness tolerances. In order to reduce the effects of wakefield on the beam",
        "several of the misaligned structures were straightened. This paper discusses the bead-pull RF measurements",
        "the effect of the straightening efforts on rf and the cell to cell retuning efforts that were performed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob11.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB11",
      "page_number": "910",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB12",
      "title": "Multi-Objective Online Optimization of Beam Lifetime at APS",
      "authors": [
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "In this paper",
        "online optimization of beam lifetime at the APS (Advanced Photon Source) storage ring is presented. A general genetic algorithm (GA) is developed and employed for some online optimizations in the APS storage ring. Sextupole magnets in 40 sectors of the APS storage ring are employed as variables for the online nonlinear beam dynamics optimization. The algorithm employs several optimization objectives and is designed to run with topup mode or beam current decay mode. Up to 50\\% improvement of beam lifetime is demonstrated",
        "without affecting the transverse beam sizes and other relevant parameters. In some cases",
        "the top-up injection efficiency is also improved."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob12.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB12",
      "page_number": "913",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB13",
      "title": "Online Minimization of Vertical Beam Sizes at APS",
      "authors": [
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "In this paper",
        "online minimization of vertical beam sizes along the APS (Advanced Photon Source) storage ring is presented. A genetic algorithm (GA) was developed and employed for the online optimization in the APS storage ring. A total of 59 families of skew quadrupole magnets were employed as knobs to adjust the coupling and the vertical dispersion in the APS storage ring. Starting from initially zero current skew quadrupoles",
        "small vertical beam sizes along the APS storage ring were achieved in a short optimization time of one hour. The optimization results from this method are briefly compared with the one from LOCO (Linear Optics from Closed Orbits) response matrix correction."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob13.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB13",
      "page_number": "916",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB14",
      "title": "APS-U Lattice Design for Off-Axis Accumulation",
      "authors": [
        "Y.P. Sun",
        "M. Borland",
        "R.R. Lindberg",
        "V. Sajaev",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "A 67-pm hybrid-seven-bend achromat (H7BA) lattice is being proposed for a future Advanced Photon Source (APS) multi-bend-achromat (MBA) upgrade project. This lattice design pushes for smaller emittance and requires use of a swap-out (on-axis) injection scheme due to limited dynamic acceptance. Alternate lattice design work has also been performed for the APS upgrade to achieve better beam dynamics performance than the nominal APS MBA lattice",
        "in order to allow off-axis accumulation. Two such alternate H7BA lattice designs",
        "which target a still-low emittance of 90 pm",
        "are discussed in detail in this paper. Although the single-particle-dynamics performance is good",
        "simulations of collective effects indicate that surprising difficulty would be expected accumulating high single-bunch charge in this lattice. The brightness of the 90-pm lattice is also a factor of two lower than the 67-pm H7BA lattice."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob14.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB14",
      "page_number": "920",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB15",
      "title": "Comparison of Nonlinear Dynamics Optimization Methods for APS-U",
      "authors": [
        "Y.P. Sun",
        "M. Borland",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Many different objectives and genetic algorithms have been proposed for storage ring nonlinear dynamics performance optimization. These optimization objectives include nonlinear chromaticities and driving/detuning terms",
        "on-momentum and off-momentum dynamic acceptance",
        "chromatic detuning",
        "local momentum acceptance",
        "variation of transverse invariant",
        "Touschek lifetime",
        "etc. In this paper",
        "the effectiveness of several different optimization methods and objectives are compared for the nonlinear beam dynamics optimization of the Advanced Photon Source upgrade (APS-U) lattice. The optimized solutions from these different methods are preliminarily compared in terms of the dynamic acceptance",
        "local momentum acceptance",
        "chromatic detuning",
        "and other performance measures."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob15.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB15",
      "page_number": "924",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB16",
      "title": "Simulation Studies of a Prototype Stripline Kicker for the APS-MBA Upgrade",
      "authors": [
        "X. Sun",
        "C. Yao",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "A prototype dual-blade stripline kicker for the APS multi-bend achromat (MBA) upgrade has been designed and developed. It was optimized with 3D CST Micro-wave Studio. The high voltage (HV) feedthrough and air-side connector were designed and optimized. The elec-tromagnetic fields along the beam path",
        "deflecting angle and high electric fields with their locations were calculat-ed with 15 kV differential pulse voltage applied to the kicker blades through the feedthroughs. The beam im-pedance and power dissipation on different parts of the kicker and external loads were studied for a 48-bunch fill pattern. Our simulation results show that the prototype kicker with its HV feedthroughs meets the specified re-quirements. The results of TDR (time-domain reflectome-ter) test",
        "high voltage pulse test and beam test of the pro-totype kicker assembly agreed with the simulations."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob16.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB16",
      "page_number": "928",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB18",
      "title": "Bend Magnet Head Loads and Out of Orbit Scenarios",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob18.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB18",
      "page_number": "931",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPOB19",
      "title": "Summary of Cs2te Photocathode Performance and Improvements in the High-Gradient, High-Charge AWA Drive Gun",
      "authors": [
        "E.E. Wisniewski",
        "S.P. Antipov",
        "M.E. Conde",
        "D.S. Doran",
        "W. Gai",
        "C.-J. Jing",
        "W. Liu",
        "J.G. Power",
        "J.Q. Qiu",
        "C. Whiteford",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "S.P. Antipov",
        "C.-J. Jing",
        "J.Q. Qiu",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "The AWA L-band",
        "high-charge photoinjector for the 70 MeV drive beamline has been operating for almost 3 years at the Argonne Wakefield Accelerator (AWA) facility. at Argonne National Laboratory (ANL). The gun operates at high-field (85 MV/m peak field on the cathode) and has a high quantum efficiency (QE) Cesium telluride photocathode with a large area (30 mm diameter). It produces high-charge",
        "short pulse",
        "single bunches (Q > 100 nC) as well as long bunch-trains (Q > 600 nC) for wakefield experiments (high peak current). During the first two years of operation",
        "photocathode performance was evaluated and areas of improvement were identified. After study",
        "consideration and consultation",
        "steps were taken to improve the performance of the photocathode. So far",
        "in total",
        "three photocathodes have been fabricated on-site",
        "installed and operated in the gun. Improvements made to the photocathode plug",
        "vacuum system",
        "and gun operation are detailed. The results include vastly improved conditioning times",
        "better cathode performance",
        "and QE above 4% for over 11 months."
      ],
      "institutions": [
        "Funding: Argonne, a U.S.A. Department of Energy Office of Science laboratory, is operated under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob19.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB19",
      "page_number": "934",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB20",
      "title": "Multiple Scattering Effects on a Short Pulse Electron Beam Travelling Through Thin Beryllium Foils",
      "authors": [
        "E.E. Wisniewski",
        "S.P. Antipov",
        "M.E. Conde",
        "D.S. Doran",
        "W. Gai",
        "Q. Gao",
        "C.-J. Jing",
        "W. Liu",
        "J.G. Power",
        "C. Whiteford",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "S.P. Antipov",
        "C.-J. Jing",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "POSTECH",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "The Argonne Wakefield Accelerator beamlines have stringent vacuum requirements (100 picotorr) necessitated by the Cesium telluride photoinjector. In direct conflict with this",
        "the structures-based wakefield accelerator research program sometimes includes worthy but complex experimental installations with components or structures unable to meet the vacuum standards. A proposed chamber to sequester such experiments safely behind a thin beryllium (Be) window is described and the results of a study of beam-quality issues due to the multiple scattering of the beam through the window are presented and compared to"
      ],
      "institutions": [
        "Funding: Argonne, a U.S.A. Department of Energy Office of Science laboratory, is operated under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob20.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB20",
      "page_number": "937",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB21",
      "title": "Benchmarking of Touschek Beam Lifetime Calculations for the Advanced Photon Source",
      "authors": [
        "A. Xiao",
        "B.X. Yangpresenter",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Particle loss from Touschek scattering is one of the most significant issues faced by present and future synchrotron light source storage rings. For example",
        "the predicted",
        "Touschek-dominated beam lifetime for the Advanced Photon Source (APS) Upgrade lattice in 48-bunch",
        "200-mA timing mode is only ~2 h. In order to understand the reliability of the predicted lifetime",
        "a series of measurements with various beam parameters was performed on the present APS storage ring. This paper first describes the entire process of beam lifetime measurement",
        "then compares measured lifetime with the calculated one by applying the measured beam parameters. The results show very good agreement."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob21.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB21",
      "page_number": "940",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB22",
      "title": "Beam Loss Simulation and Collimator System Configurations for the Advanced Photon Source Upgrade",
      "authors": [
        "A. Xiao",
        "M. Borlandpresenter",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The proposed multi-bend achromat lattice for the Advanced Photon Source upgrade (APS-U) has a design emittance of less than 70 pm. The Touschek loss rate is high: compared with the current APS ring",
        "which has an average beam lifetime  ∼  10 h",
        "the simulated beam lifetime for APS-U is only ~2 h when operated in the high flux mode (I=200 mA in 48 bunches). An additional consequence of the short lifetime is that injection must be more frequent",
        "which provides another potential source of particle loss. In order to provide information for the radiation shielding system evaluation and to avoid particle loss in sensitive locations around the ring (for example",
        "insertion device straight sections)",
        "simulations of the detailed beam loss distribution have been performed. Several possible collimation configurations have been simulated and compared."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob22.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB22",
      "page_number": "943",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB23",
      "title": "Performance of the Full-Length Vertical Polarizing Undulator Prototype for LCLS-II",
      "authors": [
        "N.O. Strelnikov",
        "E. Gluskin",
        "I. Vasserman",
        "J.Z. Xupresenter",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "As part of the LCLS-II R&D program",
        "a novel 3.4-meter long undulator prototype with horizontal main magnetic field and dynamic force compensation - called the horizontal gap vertical polarization undulator (HGVPU) - has recently been developed at the Advanced Photon Source (APS). Initial steps of the project included designing",
        "building",
        "and a testing 0.8-meter long prototype. Extensive mechanical testing of the HGVPU has been carried out. The magnetic tuning was accomplished by applying a set of magnetic shims. As a result",
        "the performance of the HGVPU meets all the stringent requirements for the LCLS-II insertion device",
        "which includes limits on the field integrals and phase errors for all operational gaps",
        "as well as the reproducibility and accuracy of the gap settings. The HGVPU has been included in the baseline of the LCLS-II project for the hard x-ray undulator line."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob23.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB23",
      "page_number": "946",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB24",
      "title": "Preliminary Test Results of a Prototype Fast Kicker for APS MBA Upgrade",
      "authors": [
        "C. Yao",
        "A. Barcikowski",
        "A.R. Brill",
        "J. Carwardine",
        "T.K. Clute",
        "Z.A. Conway",
        "A.R. Cours",
        "G. Decker",
        "R.T. Keane",
        "F. Lenkszus",
        "L.H. Morrison",
        "X. Sun",
        "J. Wang",
        "F. Westferro",
        "A. Xiao",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The APS multi-bend achromatic (MBA) upgrade storage ring plans to support two bunch fill patterns: a 48-bunch and a 324-bunch. A \"swap out\" injection scheme is required. In order provide the required kick to injected beam",
        "to minimize the beam loss and residual oscillation of injected beam",
        "and to minimize the perturbation to stored beam during injection",
        "the rise",
        "fall",
        "and flat-top parts of the kicker pulse must be within a 16.9-ns interval. Stripling-type kickers are chosen for both injection and extraction. We developed a prototype kicker that supports a ±15kV differential pulse voltage. We performed high voltage discharge",
        "TDR measurement",
        "high voltage pulse test and beam test of the kicker. We report the design of the fast kicker and the test results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob24.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB24",
      "page_number": "950",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB25",
      "title": "Analytical Modeling of Electron Back-Bombardment Induced Current Increase in Un-Gated Thermionic Cathode Rf Guns",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Directed Energy Directorate",
        "Air Force Research Laboratory",
        "Albuquerque",
        "USA",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "In this paper we derive analytical expressions for the output current of an un-gated thermionic cathode RF gun in the presence of back-bombardment heating. We provide a brief overview of back-bombardment theory and discuss comparisons between the analytical back-bombardment predictions and simulation models. We then derive an expression for the output current as a function of the RF repetition rate and discuss relationships between back-bombardment",
        "field-enhancement",
        "and output current. We discuss in detail the relevant approximations and then provide predictions about how the output current should vary as a function of repetition rate for some given system configurations."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob25.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB25",
      "page_number": "953",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB26",
      "title": "Observation of Repetition-Rate Dependent Emission From an Un-Gated Thermionic Cathode Rf Gun",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Directed Energy Directorate",
        "Air Force Research Laboratory",
        "Albuquerque",
        "USA",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Recent work at Fermilab in collaboration with the Advanced Photon Source and members of other national labs",
        "designed an experiment to study the relationship between the RF repetition rate and the average current per RF pulse. While existing models anticipate a direct relationship between these two parameters we observed an inverse relationship. We believe this is a result of damage to the barium coating on the cathode surface caused by a change in back-bombardment power that is unaccounted for in the existing theories. These observations shed new light on the challenges and fundamental limitations associated with scaling an un-gated thermionic cathode RF gun to high average current."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob26.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB26",
      "page_number": "956",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB27",
      "title": "Modification of 3rd Harmonic Cavity for CW Operation in LCLS-II Accelerator",
      "authors": [
        "T.N. Khabiboulline",
        "M.H. Awida",
        "I.V. Gonin",
        "A. Lunin",
        "N. Solyak",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [
        "A 3.9 GHz 3rd harmonic cavity was developed at FNAL and it is currently used in the FLASH accelerator at DESY in order to improve FEL operation. The European XFEL accelerator in Hamburg also adapted the same cavity design for a pulsed linac operation. The 3rd harmonic cavity for the LCLS-II accelerator at SLAC will operate in a continuous wave (CW) regime. A CW operation and a high average current in the LCLS-II linac result in in-creased heat loads to main and HOM couplers of the cavity. Several cavity design modifications were pro-posed and investigated for improving a cavity perfor-mance in the CW regime. In this paper we present results of the design review for proposed modifications"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob27.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB27",
      "page_number": "960",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB29",
      "title": "Modeling of Dark Current Generation and Transport Using the IMPACT-T Code",
      "authors": [
        "J. Qiang",
        "K. Hwang",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Dark current from unwanted electrons in photoinjector can present significant danger to the accelerator operation by causing damage to photocathode and power deposition onto conducting wall. In this paper",
        "we present numerical models of dark current generation from the field emission and from the electron impact ionization of the residual gas that were recently developed in the IMPACT-T code. We also report on the application of above numerical model to an LCLS-II like photoinjector."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob29.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB29",
      "page_number": "964",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB30",
      "title": "Simulation of the Shot-Noise Driven Microbunching Instability Experiment at the LCLS",
      "authors": [
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Y. Ding",
        "P. Emma",
        "Z. Huang",
        "D.F. Ratner",
        "T.O. Raubenheimer",
        "F. Zhou",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The shot-noise driven microbunching instability can significantly degrade electron beam quality in next generation light sources. Experiments were carried out at the Linac Coherent Light Source (LCLS) to study this instability. In this paper",
        "we will present start-to-end simulation of the shot-noise driven microbunching instability experiment at the LCLS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob30.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB30",
      "page_number": "967",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB31",
      "title": "Dark Current Study of a Standing Wave Disk-Loaded Waveguide Structure at 17 GHz",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob31.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB31",
      "page_number": "971",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB32",
      "title": "Performance of a Combined System Using an X-Ray FEL Oscillator and a High-Gain FEL Amplifier",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob32.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB32",
      "page_number": "974",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB35",
      "title": "LLNL Laser-Compton X-Ray Characterization",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob35.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB35",
      "page_number": "977",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPOB36",
      "title": "Upgrade of the Cornell Electron Storage Ring as a Synchrotron Light Source",
      "authors": [
        "D. L. Rubin",
        "J.A. Crittendenpresenter",
        "J.P. Shanks",
        "S. Wang",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The planned upgrade of the Cornell Electron Storage Ring as an X-ray source for CHESS will include an increase in beam energy and decrease in emittance from 100 nm-rad at 5.3 GeV to 30 nm-rad at 6 GeV",
        "increase in beam current from 120 to 200 mA",
        "continuous top-off injection of the single circulating beam",
        "and four new zero dispersion inser- tion straights that can each accommodate a pair of canted undulators. The existing sextant of the storage ring arc that serves as the source for all of the CHESS X-ray beam lines will be reconfigured with 6 double-bend achromats",
        "each consisting of two pairs of horizontally focusing quadrupoles",
        "and a single pair of combined-function gradient bend magnets. The chromaticity will be compensated by the existing sextupoles in the legacy FODO arcs. We describe details of the linear optics",
        "sextupole distributions to maximize dynamic aperture and injection efficiency",
        "and characterization of magnetic field and alignment error tolerance."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob36.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB36",
      "page_number": "980",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB39",
      "title": "Photo-Injector Optimization and Validation Study with the OPAL Beam Simulation Code",
      "authors": [
        "L.D. Duffy",
        "K. Bishofberger",
        "J.W. Lewellen",
        "S.J. Russell",
        "D.Y. Shchegolkov",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "A 42 keV x-ray free electron laser (XFEL) is a plausible technology alternative for the Matter Radiation Interactions in Extremes (MaRIE) experimental project",
        "a concept developed by Los Alamos National Laboratory. An early pre-conceptual design for such an XFEL calls for 100 pC electron bunches with very low emittance and energy spread. High fidelity simulations that capture all beamline physics will be required to ensure a successful design. We expect to use the beam simulation code OPAL as one of the tools in this process. In this study",
        "we validate OPAL as a photo-injector design tool by comparing its performance with published PITZ experimental data and simulations."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob39_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob39.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob39_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB39",
      "page_number": "984",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB41",
      "title": "Quality Factor in High Power Tests of Cryogenic Copper Accelerating Cavities",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob41_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob41.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob41_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB41",
      "page_number": "987",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB42",
      "title": "High Gradient S-Band Cryogenic Accelerating Structure for RF Breakdown Studies",
      "authors": [
        "A.D. Cahill",
        "A. Fukasawa",
        "J.B. Rosenzweig",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "G.B. Bowden",
        "V.A. Dolgashev",
        "S.G. Tantawi",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Operating accelerating gradient in normal conducting accelerating structures is often limited by rf breakdowns. The limit depends on multiple parameters",
        "including input rf power",
        "rf circuit",
        "cavity shape",
        "cavity temperature",
        "and material. Experimental and theoretical study of the effects of these parameters on the breakdown physics is ongoing at SLAC. As of now",
        "most of the data has been obtained at 11.4 GHz. We are extending this research to S-band. We have designed a single cell accelerating structure",
        "based on the extensively tested X-band cavities. The setup uses matched TM01 mode launcher to feed rf power into the test cavity. Our ongoing study of the physics of rf breakdown in cryogenically X-band accelerating cavities shows improved breakdown performance. Therefore",
        "this S-band experiment is designed to cool the cavity to cryogenic temperatures. We use operating frequencies near 2.856 GHz. We present the rf design and discuss the experimental setup."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob42_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob42.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob42_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB42",
      "page_number": "991",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB46",
      "title": "Technology Development Toward High Duty Cycle Inverse Compton Scattering X-Ray Source",
      "authors": [
        "A.Y. Murokh",
        "R.B. Agustsson",
        "T.J. Campese",
        "A.G. Ovodenko",
        "RadiaBeam",
        "Santa Monica",
        "California",
        "USA",
        "M. Babzien",
        "M.G. Fedurin",
        "I. Pogorelsky",
        "M.N. Polyanskiy",
        "T.V. Shaftan",
        "C. Swinson",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "J.B. Rosenzweig",
        "Y. Sakai",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "An important challenge in the development of practical X-ray sources based on Inverse Compton Scattering is the implementation of a reliable",
        "increased-repetition-rate operation cycle. To this end",
        "we report the first demonstration of an actively re-amplified CO2 laser intra-cavity ICS source",
        "which matches the electron linac pulse structure at 40 MHz repetition rate. Multi-bunch interaction with 5- and 15-pulse trains was demonstrated",
        "and near linear photon yield gain from multi-pulse interaction was demonstrated. The system shows noticeably higher operational reliability than several contemporary single shot systems",
        "as well as a great potential for future scalability."
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob46_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob46.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob46_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB46",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB47",
      "title": "Development of a Short Period Cryogenic Undulator at RadiaBeam",
      "authors": [
        "F.H. O'Shea",
        "R.B. Agustsson",
        "Y.C. Chen",
        "A.J. Palmowski",
        "E. Spranza",
        "RadiaBeam",
        "Santa Monica",
        "California",
        "USA",
        "RadiaBeam Technologies has developed a 7-mm period length cryogenic undulator prototype to test fabrications techniques in cryogenic undulator production. We present here our first prototype",
        "the production techniques used to fabricate it",
        "its magnetic performance at room temperature and the temperature uniformity after cool down."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob47_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob47.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob47_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB47",
      "page_number": "995",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPOB48",
      "title": "THz and Sub-THz Capabilities of a Table-Top Radiation Source Driven by an RF Thermionic Electron Gun",
      "authors": [
        "A.V. Smirnov",
        "R.B. Agustsson",
        "S. Boucher",
        "T.J. Campese",
        "Y.C. Chen",
        "J.J. Hartzell",
        "B.T. Jacobson",
        "A.Y. Murokh",
        "F.H. O'Shea",
        "E. Spranza",
        "RadiaBeam",
        "Santa Monica",
        "California",
        "USA",
        "W. Berg",
        "M. Borland",
        "J.C. Dooling",
        "L. Erwin",
        "R.R. Lindberg",
        "S.J. Pasky",
        "N. Sereno",
        "Y. Sun",
        "A. Zholents",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "WBFB",
        "Berlin",
        "Germany",
        "M.J. de Loos",
        "S.B. van der Geer",
        "Pulsar Physics",
        "Eindhoven",
        "The Netherlands",
        "Design features and experimental results are presented for a sub-mm wave source [1] based on APS RF thermionic electron gun. The setup includes compact alpha-magnet",
        "quadrupoles",
        "sub-mm-wave radiators",
        "and THz optics. The sub-THz radiator is a planar",
        "oversized structure with gratings. Source upgrade for generation frequencies above 1 THz is discussed. The THz radiator will use a short-period undulator having 1 T field amplitude",
        "~20 cm length",
        "and integrated with a low-loss oversized waveguide. Both radiators are integrated with a miniature horn antenna and a small ~90°-degree in-vacuum bending magnet. The electron beamline is designed to operate different modes including conversion to a flat beam interacting efficiently with the radiator. The source can be used for cancer diagnostics",
        "surface defectoscopy",
        "and non-destructive testing. Sub-THz experiment demonstrated a good potential of a robust",
        "table-top system for generation of a narrow bandwidth THz radiation. This setup can be considered as a prototype of a compact",
        "laser-free",
        "flexible source capable of generation of long trains of Sub-THz and THz pulses with repetition rates not available with laser-driven sources.",
        "[1] A. V. Smirnov",
        "R. Agustsson",
        "W. J. Berg et al.",
        "Phys. Rev. ST Accel. Beams 18",
        "090703(2015)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob48_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob48.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob48_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB48",
      "page_number": "998",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPOB49",
      "title": "LCLS Injector Laser Profile Shaping Using Digital Micromirror Device",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob49_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob49.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob49_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB49",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPOB53",
      "title": "Computation of Synchrotron Radiation",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "This presentation introduces a new open-source software development for the computation of radiation from charged particles and beams in magnetic and electric fields. The computations are valid in the near-field regime for both relativistic and non-relativistic scenarios. This project is being developed",
        "and is currently in use",
        "at Brookhaven National Laboratory's National Synchrotron Light Source II. Primary applications include",
        "but are not limited to",
        "the computation of spectra",
        "photon flux densities",
        "and power density distributions from undulators",
        "wigglers",
        "and bending magnets on arbitrary shaped surfaces in 3D making possible detailed study of sensitive accelerator and beam-line equipment. Application interfaces are available in Python",
        "Mathematica",
        "and C. Practical use cases are demonstrated and benchmarked. Additionally",
        "future upgrades will be elaborated on."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob53_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob53.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob53_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB53",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPOB54",
      "title": "DC Photogun Gun Test for RHIC Low Energy Electron Cooler (LEReC).",
      "authors": [
        "D. Kayran",
        "Z. Altinbas",
        "D.R. Beavis",
        "S. Bellavia",
        "D. Bruno",
        "M.R. Costanzo",
        "A.V. Fedotov",
        "D.M. Gassner",
        "J. Halinski",
        "K. Hamdi",
        "J.P. Jamilkowski",
        "J. Kewisch",
        "C.J. Liaw",
        "G.J. Mahler",
        "T.A. Miller",
        "S.K. Nayak",
        "T. Rao",
        "S. Seletskiy",
        "B. Sheehy",
        "J.E. Tuozzolo",
        "Z. Zhao",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Non-magnetized bunched electron cooling of low-energy RHIC requires electron beam energy in range of 1.6-2.6 MeV",
        "with average current up to 45 mA",
        "very small energy spread",
        "and low emittance [1]. A 400 kV DC gun equipped with photocathode and laser delivery system will serve as a source of high-quality electron beam. Acceleration will be achieved by an SRF 704 MHz booster cavity and other RF components that are scheduled to be operational in early 2018. The DC gun testing in its installed location in RHIC will start in early 2017. During this stage we plan to test the critical equipment in close to operation conditions: laser beam delivery system",
        "cathode QE lifetime",
        "DC gun",
        "beam instrumentation",
        "high power beam dump system",
        "and controls. In this paper",
        "we describe the gun test set up",
        "major components",
        "and parameters to be achieved and measured during the gun beam test.",
        "[1] A. Fedotov. Bunched beam electron cooling for Low Energy RHIC operation. ICFA Beam Dynamics letter",
        "No. 65",
        "p. 22 (December 2014)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob54_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob54.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob54_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB54",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB55",
      "title": "Simulation of Stray Electrons in the RHIC Low Energy Cooler",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The Low Energy RHIC electron Cooler",
        "under construction at BNL",
        "accelerates electrons with a 400 kV DC gun and a 2.2 MeV SRF booster cavity. Electrons which leave the cathode at the wrong time will not be accelerated to the correct energies and will not reach the beam dump at the end of the accelerator. Thy may impact the beam pipe after incorrect deflection in dipoles or after being slowed down longitudinally in the booster while the transverse momentum is not affected. In some cases their direction is reversed in the booster and they will impact the cathode. We simulated the trajectories of these electrons using the GPT tracking code. The results are qualitative",
        "not quantitative",
        "since the sources and numbers of the stray electrons are unknown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob55_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob55.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob55_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB55",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB56",
      "title": "Beam Optics for the RHIC Low Energy Electron Cooler  (LEReC)",
      "authors": [
        "J. Kewisch",
        "A.V. Fedotov",
        "D. Kayran",
        "S. Seletskiy",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A Low-energy RHIC Electron Cooler (LEReC) system is presently under construction at Brookhaven National Laboratory. This device shall enable gold ion collisions at energies below the design injection energy with sufficient luminosity. Electron beam with energies between 1.6",
        "2.0 and 2.6 MeV are necessary. This machine will be the first to attempt electron cooling using bunched electron beam",
        "using a 703 MHz SRF cavity for acceleration. Special consideration must be given to the effect of space charge forces on the transverse and longitudinal beam quality. We will present the current layout of the cooler and beam parameter simulations using the computer codes PARMELA."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob56_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob56.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob56_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB56",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB57",
      "title": "Magnetic Optimization of Long EPUs at NSLS-II",
      "authors": [
        "C.A. Kitegi",
        "P.L. Cappadoro",
        "O.V. Chubar",
        "T.M. Corwin",
        "H.C. Fernandes",
        "D.A. Harder",
        "D.A. Hidas",
        "W. Licciardi",
        "M. Musardo",
        "J. Rank",
        "C. Rhein",
        "T. Tanabe",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The Soft Inelastic X-ray scattering (SIX) and the Elec-tron-Spectro-Microscopy (ESM) are two beamlines under construction at National Synchrotron Light Source-II (NSLS-II). The specifics of these two beamlines requested the use of two long Advanced Planar Polarized Light Emitter-II (APPLE-II) undulators",
        "as a source that provides circularly and vertically polarized radiation. Thus we designed 3.5 m and 2.7m long APPLE-II type undulators for SIX and ESM. The NSLS-II ID group is responsible for the magnetic optimization of these two long undulators. In this paper",
        "we first summarize the APPLE-II magnetic and mechanical design. Then",
        "we discuss the magnetic performance of the first APPLE-II achieved with the shimming performed at BNL."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob57_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob57.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob57_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB57",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB58",
      "title": "Cathode Puck Insertion System Design for the LEReC Photoemission DC Electron Gun",
      "authors": [
        "C.J. Liaw",
        "V. De Monte",
        "L. DeSanto",
        "K. Hamdi",
        "M. Mapes",
        "T. Rao",
        "A.N. Steszyn",
        "J.E. Tuozzolo",
        "J. Walsh",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "The operation of LEReC is to provide an electron cooling to improve the luminosity of the RHIC heavy ion beam at lower energies in a range of 2.5-25 GeV/nucleon. The electron beam is generated in a DC Electron Gun (DC gun) designed and built by the Cornell High Energy Synchrotron Source Group. This DC gun will operate around the clock for at least two weeks without maintenance. This paper presents the design of a reliable cathode puck insertion system",
        "which includes a multi-pucks storage device",
        "a transfer mechanism",
        "a puck insertion device",
        "a vacuum/control system",
        "and a transport scheme."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob58_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob58.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob58_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB58",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB59",
      "title": "Performance of CEC Pop Gun During Commissioning",
      "authors": [
        "I. Pinayev",
        "W. Fu",
        "Y. Hao",
        "M. Harvey",
        "T. Hayes",
        "J.P. Jamilkowski",
        "Y.C. Jing",
        "P. K. Kankiya",
        "D. Kayran",
        "R. Kellermann",
        "V. Litvinenko",
        "G.J. Mahler",
        "M. Mapes",
        "K. Mernick",
        "K. Mihara",
        "T.A. Miller",
        "G. Narayan",
        "M.C. Paniccia",
        "W.E. Pekrul",
        "T. Rao",
        "F. Severino",
        "B. Sheehy",
        "J. Skaritka",
        "K.S. Smith",
        "J.E. Tuozzolo",
        "E. Wang",
        "G. Wang",
        "W. Xu",
        "A. Zaltsman",
        "Z. Zhao",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "SUNY SB",
        "Stony Brook",
        "New York",
        "USA",
        "The Coherent Electron Cooling Proof-of-Principle (CeC PoP) experiment employs a high-gradient CW photo-injector based on the superconducting RF cavity. Such guns operating at high accelerating gradients promise to revolutionize many sciences and applications. They can establish the basis for super-bright monochromatic X-ray and gamma ray sources",
        "high luminosity hadron colliders",
        "nuclear waste transmutation or a new generation of microchip production. In this paper we report on our operation of a superconducting RF electron gun with a high accelerating gradient at the CsK2Sb photo-cathode (i.e. ~ 20 MV/m) generating a record-high bunch charge (above 4 nC). We give short description of the system and then detail our experimental results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob59_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob59.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob59_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB59",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB60",
      "title": "Commissioning of CeC PoP Accelerator",
      "authors": [
        "I. Pinayev",
        "Z. Altinbas",
        "J.C.B. Brutus",
        "A.J. Curcio",
        "A. Di Lieto",
        "C. Folz",
        "W. Fu",
        "D.M. Gassner",
        "Y. Hao",
        "M. Harvey",
        "T. Hayes",
        "R.L. Hulsart",
        "J.P. Jamilkowski",
        "Y.C. Jing",
        "P. K. Kankiya",
        "D. Kayran",
        "R. Kellermann",
        "V. Litvinenko",
        "G.J. Mahler",
        "M. Mapes",
        "K. Mernick",
        "R.J. Michnoff",
        "K. Mihara",
        "T.A. Miller",
        "G. Narayan",
        "P. Orfin",
        "M.C. Paniccia",
        "D. Phillips",
        "T. Rao",
        "F. Severino",
        "B. Sheehy",
        "J. Skaritka",
        "L. Smart",
        "K.S. Smith",
        "V. Soria",
        "Z. Sorrell",
        "R. Than",
        "J.E. Tuozzolo",
        "E. Wang",
        "G. Wang",
        "B. P. Xiao",
        "W. Xu",
        "A. Zaltsman",
        "Z. Zhao",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "SUNY SB",
        "Stony Brook",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "Coherent electron cooling is new cooling technique to be tested at BNL. Presently we are in the commissioning stage of the accelerator system. In this paper we present status of various systems and achieved beam parameters as well as operational experience. Near term future plans are also discussed. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob60_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob60.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob60_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB60",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB61",
      "title": "Magnetic Shielding of LEReC Cooling Section",
      "authors": [
        "S. Seletskiy",
        "A.V. Fedotov",
        "D.M. Gassner",
        "D. Kayran",
        "G.J. Mahler",
        "W. Meng",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The transverse angle of the electron beam trajectory in the low energy RHIC Electron Cooling (LEReC) accelerator cooling section (CS) must be much smaller than 100 urad. This requirement sets 2.3 mG limit on the ambient transverse magnetic field. The maximum ambient field in the RHIC tunnel along the cooling section was measured to be 0.52 G. In this paper we discuss the design of the proposed LEReC CS magnetic shielding",
        "which is capable of providing required attenuation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob61_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob61.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob61_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB61",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB62",
      "title": "Absolute Energy Measurement of the LEReC Electron Beam",
      "authors": [
        "S. Seletskiy",
        "M. Blaskiewicz",
        "A.V. Fedotov",
        "D. Kayran",
        "J. Kewisch",
        "T.A. Miller",
        "P. Thieberger",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The goal of future operation of the low energy RHIC Electron Cooling (LEReC) accelerator is to cool the RHIC ion beams. To provide successful cooling",
        "the velocities of the RHIC ion beam and the LEReC electron beam must be matched with 10-4 accuracy. While the energy of ions will be known with the required accuracy",
        "the e-beam energy can have an initial offset as large as 5%. The final setting of the e-beam energy will be performed by observing either the Schottky spectrum of debunched ions co-traveling with the e-beam or the recombination signal. Yet",
        "to start observing such signals one has to set the absolute energy of the electron beam with an accuracy better than 10-2",
        "preferably better than 5·10-3. In this paper we discuss how such accuracy can be reached by utilizing the LEReC 180 degree bend as a spectrometer."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob62_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob62.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob62_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB62",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB65",
      "title": "Experiments of Lossless Crossing - Resonance With Tune Modulation by Synchrotron Oscillations",
      "authors": [
        "G.M. Wang",
        "B. Holub",
        "Y. Li",
        "J. Rose",
        "T.V. Shaftan",
        "V.V. Smaluk",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "It had become a standard practice to constrain particle's tune footprint while designing the storage ring lattice so that the tunes fit between harmful resonances that limit ring dynamic aperture (DA). However",
        "in recent ultra-bright light source design",
        "the nonlinearities of storage ring lattices are much enhanced as compared with the 3rd generation light source one. It is becoming more and more difficult to keep the off-momentum tune footprint confined and even more",
        "the solution cannot be found to confine off-energy tune footprint in certain cases. The questions have been asked whether crossing of a resonance stopband from off-momentum particle will necessarily lead to particle loss. In NSLS-II",
        "we modified the lattice working point to mimic machine tune footprint crossing half integer with beam synchrotron oscillation excitation and demonstrated that beam can cross a resonance without loss with control of stopband width and high order chromaticity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob65_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob65.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob65_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB65",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB66",
      "title": "NSLS-II Post Mortem Function Development and Data Analysis of Beam Dump",
      "authors": [
        "G.M. Wang",
        "W.X. Cheng",
        "J. Choi",
        "L. Doom",
        "K. Ha",
        "T.V. Shaftan",
        "R.M. Smith",
        "J. Tagger",
        "Y. Tian",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "University of Orleans",
        "Orleans",
        "France",
        "The National Synchrotron Light Source II (NSLS-II) is a state of the art 3 GeV third generation light source at Brookhaven National Laboratory. The storage ring was commissioned in 2014 and transitioned to routine operations in the December of the same year. At this point the facility hosts 14 operating beam lines with beam current upto 250 mA. During beamline operation",
        "various sources (protection system or subsystem malfunction) may cause beam dump. To identify the beam trip sources and improve the operation reliability",
        "post mortem function was developed in NSLS-II to capture the sub-systems status and beam information prior and after beam dump",
        "including RF system",
        "power supply",
        "BPMs and active interlock system. Most of the trip events have been identified and related source was improved. In this paper",
        "we'll present the post mortem function and data application."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob66_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob66.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob66_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB66",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB67",
      "title": "K2CsSb Photocathode Performance in QWR SRF Gun",
      "authors": [
        "E. Wang",
        "Y. Hao",
        "Y.C. Jing",
        "V. Litvinenko",
        "I. Pinayev",
        "T. Rao",
        "J. Skaritka",
        "G. Wang",
        "T. Xin",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "In 2016 run of Coherent Electron Cooling",
        "we have successfully tested the performance of a number of K2CsSb cathodes. These cathodes with QE of 6%-10% were fabricated in Instrumentation Division",
        "a few miles away",
        "transported to RHIC tunnel under UHV conditions",
        "attached to the CeC gun",
        "kept in storage",
        "and inserted in the gun as needed. A maximum bunch charge of 4.6 nC was generated in the gun when the QE was 1.8 %. With careful conditioning at increasing accelerating fields",
        "it was possible to maintain the QE of several cathodes for more than a week. For the cathodes that experienced degradation",
        "the primary cause was multipacting when the power into the gun was increased. In the initial runs",
        "the entire 20 mm substrate face was coated with the cathode material causing cathode induced multipacting. For subsequent measurements",
        "the substrate was masked to coat only the central 9 mm of the substrate. By optimizing the procedure for boosting the power to the gun and covering all viewports to minimize dark current",
        "we were able to minimize QE degradation. In this paper we discuss the cathode preparation",
        "transfer to the gun and operational experience with the cathodes in 112 MHz gun."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob67_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob67.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob67_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB67",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB68",
      "title": "DESIGN AND SIMULATION OF EMITTANCE MEASUREMENT WITH MULTI-SLIT FOR LEREC",
      "authors": [
        "C. Liu",
        "A.V. Fedotov",
        "J. Kewisch",
        "M.G. Minty",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "To improve the luminosity of beam energy scan of low energy Au-Au collision",
        "a electron machine is under con- struction to cool ion beams in both RHIC rings with pulsed electron beam. Over the course of the project",
        "a multi- slit device is needed to characterize the transverse beam emittance of three energies",
        "0.4",
        "1.6 and 2.6 MeV. This re- port shows the optimization and compromise of the design",
        "which include the slit width",
        "slit spacing",
        "and drift space from the multi-slit to the downstream profile monitor."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob68_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob68.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob68_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB68",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB69",
      "title": "Impedance Simulation for LEReC Booster Cavity Transformed from ERL Gun Cavity",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA"
      ],
      "institutions": [],
      "abstract": "Wake impedance induced energy spread is a concern for the electron beam to be used for electron cooling of the low energy ion beams in RHIC. The impedance simulation of the booster cavity for the Low Energy RHIC electron cooling (LEReC) project is presented in this report. The simulation is done for both non-relativistic and ultra-relativistic cases. The space charge impedance in the first case is discussed. For an impedance budget consideration of the electron machine only a simulation of the geometrical impedance in the latter case is necessary since space charge is considered separately. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob69_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob69.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob69_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB69",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOB70",
      "title": "Mechanical Straightening of the 3-m Accelerating Structures at the Advanced Photon Source",
      "authors": [
        "D.J. Bromberek",
        "W.G. Jansma",
        "T.L. Smith",
        "G.J. Waldschmidt",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "A project is underway at the Advanced Photon Source to mechanically straighten the thirteen 3 meter accelerating structures in the Linac in order to minimize transverse wakefield",
        "and improve charge transport efficiency and beam quality. Flexure supports allow positioning of the structures in the X & Y directions. Mechanical design of the flexure support system",
        "straightening techniques",
        "mechanical measurement methods",
        "and mechanical & RF results will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2016/talks/wepob70_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2016/papers/wepob70.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2016/posters/wepob70_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2016-WEPOB70",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 55,
  "scrape_time": "2025-10-11 01:21:35"
}