{
  "session_info": {
    "id": "TIOM",
    "name": "TIOM - Morning Plenary Talk",
    "url": "https://proceedings.jacow.org/PCaPAC2014/html/tiom.htm"
  },
  "papers": [
    {
      "paper_id": "TIOM02",
      "title": "Current Trends in Software Development Management",
      "authors": [
        "G. Gryczan",
        "C. Lilienthal",
        "WPS",
        "Hamburg",
        "Germany",
        "Over the past decades the Software Engineering community has proposed (and later rejected) numerous methods to tackle essential problems of software development. In this talk we summarize which of these methods and techniques to our understanding contribute to successful development projects. A special emphasis will be given to so called \"agile development methods\". We will outline how these methods",
        "in particular extreme Programming and Scrum",
        "help to identify problems of development projects at early points of time. In addition the talk will try to summarize which architectural and programming guidelines have proven successful to implement maintainable software",
        "for example design by contract. WPS Workplace Solutions GmbH is a spin off of the University of Hamburg",
        "Department of Informatics. WPS manages and implements medium size to large software projects. WPS's experience covers the whole range of Software Engineering methods and techniques from code analysis of legacy software and software requirements elicitation to software design and implementation - in long term projects and in big teams."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PCaPAC2014/talks/tiom02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PCaPAC2014/papers/tiom02.pdf",
      "poster_url": "https://proceedings.jacow.org/PCaPAC2014/posters/tiom02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2014-TIOM02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-11 02:04:58"
}