{
  "session_info": {
    "id": "MOCOYBS",
    "name": "MOCOYBS - WG5: ERL applications",
    "url": "https://proceedings.jacow.org/erl2019/html/mocoybs.htm"
  },
  "papers": [
    {
      "paper_id": "MOCOYBS01",
      "title": "PERLE: A High Power Energy Recovery Facility at Orsay",
      "authors": [
        "Université Paris-Saclay",
        "CNRS/IN2P3",
        "IJCLab",
        "Orsay",
        "France",
        "PERLE is a proposed high power Energy Recovery Linac",
        "designed on multi-turn configuration",
        "based on SRF technology",
        "to be hosted at Orsay-France in a collaborative effort between local laboratories: LAL and IPNO",
        "together with an international collaboration involving today: CERN",
        "JLAB",
        "AsTEC Daresbury",
        "Liverpool University and BINP Novosibirsk. A part from its experimental program",
        "PERLE will be a unique leading edge facility designed to push advances in accelerator technology",
        "to provide intense and highly flexible test beams for component development. In its final configuration",
        "PERLE provides a 500 MeV electron beam using high current (20 mA) acceleration during three passes through 801.6 MHz cavities. This presentation outlines the Status and further plans of the project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/mocoybs01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/mocoybs01.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/mocoybs01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-MOCOYBS01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOCOYBS02",
      "title": "A Hard X-Ray FEL and Nuclear Physics Facility Based on a Multi-Pass Recirculating Superconducting CW Linac with Energy Recovery",
      "authors": [
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A multi-pass recirculating superconducting CW linac offers a cost effective path to a multi-user facility with unprecedented scientific and industrial reach over a wide range of disciplines. We propose such a facility to be constructed in stages. The first stage constitutes an option for a potential UK-XFEL; the linac will simultaneously drive a suite of short wavelength Free Electron Lasers (FELs) capable of providing high average power (MHz repetition rate) at up to 10 keV photons and high pulse energy (3 mJ) 25 keV photons. The system architecture is chosen to enable additional coherent sources at longer wavelengths",
        "depending on community need. In later stages the scope of the project expands; we propose beam transport modifications to enable operation in Energy Recovery mode. This enables multi-MHz FEL sources",
        "e.g. an X-ray FEL oscillator. Combining with lasers and / or self-interaction will provide access to MeV and GeV gamma-rays via inverse Compton scattering at high average power. Opportunities are also created for internal target and fixed target experiments. We explore possible system architectures and outline a path to confirm feasibility through experiments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/mocoybs02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/mocoybs02.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/mocoybs02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-MOCOYBS02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOCOYBS03",
      "title": "Nuclear Photonics with an ERL-Based Hard X-Ray Source",
      "authors": [
        "TU Darmstadt",
        "Darmstadt",
        "Germany"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/mocoybs03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/mocoybs03.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/mocoybs03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-MOCOYBS03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOCOYBS04",
      "title": "Electrodisintegration of 16O and the Rate Determination of the Radiative Alpha Capture on 12C at Stellar Energies",
      "authors": [
        "I. Friščić",
        "T.W. Donnelly",
        "R. Milner",
        "MIT",
        "Cambridge",
        "Massachusetts",
        "USA",
        "For over five decades one of the most important goals of experimental nuclear astrophysics has been to reduce the uncertainty in the S-factor of radiative alpha capture on 12C at stellar energies. We have developed a simple model",
        "which relates the radiative capture reaction and the exclusive electrodisintegration reaction. We then show that by measuring the rate of electrodisintegration of 16O in a high luminosity experiment using a state-of-the-art gas target and a new generation of energy-recovery linear (ERL) electron accelerators under development",
        "it is possible to significantly improve the statistical uncertainty of the radiative alpha capture on 12C in terms of E1 and E2 S-factors in the astrophysically interesting region",
        "which are the key inputs for any nucleosynthesis and stellar evolution models. The model needs to be validated experimentally",
        "but",
        "if successful",
        "it can be used to improve the precision of other astrophysically-relevant",
        "radiative capture reactions",
        "thus opening a significant avenue of research that spans nuclear structure",
        "astrophysics and high-power accelerator technology."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/erl2019/talks/mocoybs04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/erl2019/papers/mocoybs04.pdf",
      "poster_url": "https://proceedings.jacow.org/erl2019/posters/mocoybs04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2019-MOCOYBS04",
      "page_number": "18",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-11 08:38:27"
}