{
  "session_info": {
    "id": "TULAB",
    "name": "TULAB - Public Lecture",
    "url": "https://proceedings.jacow.org/ibic2017/html/tulab.htm"
  },
  "papers": [
    {
      "paper_id": "TULAB1",
      "title": "Development of the Electromagnetic Boom and MOP System (EMOP)",
      "authors": [
        "A. Warner",
        "D. Cathey",
        "G. Cullen",
        "J. Nelson",
        "Natural Science",
        "LLC",
        "Big Rock",
        "USA",
        "P.H. Kasper",
        "A.H. Lumpkin",
        "Natural Science LLC",
        "Naperville",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Several large-scale oil spills typically occur in the USA and other places around the world. Such events threaten the Great Lakes as well. The cleanup process is not necessarily efficient or environmentally safe. In addition",
        "the remediation and recovery process is time consuming",
        "expensive and can lead to harmful environmental effects. An innovative electromagnetic approach by Natural Science",
        "LLC uses materials that are reusable",
        "recoverable",
        "and environmentally safe. When micron-sized magnetite (Fe3O4) particles are dispersed in oil on water",
        "the particles form a unique and preferential bond with the oil due to a combination of forces",
        "e.g. Van der Waals. Magnetic fields can then be used to manipulate",
        "trap and remove the oil in an environmentally safe manner with high efficiency. In the case of oil spills on water",
        "the water becomes the primary transport medium for manipulating the oil. Videos demonstrating the process will be shown. Both the particles and the oil are recaptured and separated for reuse. This process is being applied to electromagnetic systems that can replace and/or increase the efficiency of the passive boom and skimmer systems used today."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2017/talks/tulab1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2017/papers/tulab1.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2017/posters/tulab1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2017-TULAB1",
      "page_number": "304",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:49:26"
}