{
  "session_info": {
    "id": "WECLA",
    "name": "WECLA - Beam Charge Monitors and Other Instruments",
    "url": "https://proceedings.jacow.org/IBIC2015/html/wecla.htm"
  },
  "papers": [
    {
      "paper_id": "WECLA02",
      "title": "Commissioning of the New Online-Radiation-Monitoring-System at the New European XFEL Injector with First Tests of the High-Sensitivity-Mode for Intra-Tunnel Rack Surveillance",
      "authors": [
        "F. Schmidt-Föhre",
        "L. Fröhlich",
        "D. Nölle",
        "R. Susen",
        "K. Wittenburg",
        "DESY",
        "Hamburg",
        "Germany",
        "The new Embedded Online-Radiation-Monitoring-System",
        "developed for the 17.5 GeV superconducting European XFEL (E-XFEL) that is currently being built between the DESY campus at Hamburg and Schenefeld at Schleswig-Holstein [1",
        "2]",
        "has been commissioned in a first system test setup at the E-XFEL Injector. As most of the electronic systems for machine control",
        "diagnostics and safety of the E-XFEL will be located in cabinets inside the accelerator tunnel",
        "the test setup incorporates all system parts like cabinet-internal and -external monitor electronics",
        "infrastructure interface boards",
        "firmware",
        "software",
        "cabling and sensors. Hence the commissioning system setup gives the possibility for first operation of the complete online radiation monitoring system under realistic environmental conditions in terms of irradiation",
        "electromagnetic interference (EMI) inside the injector tunnel",
        "as well as operational and control system aspects. Commissioning results and measurements based on different internal and external sensor channels will be presented here",
        "together with recent measurements done at different radiation sources using the high-sensibility mode for intra-rack radiation monitoring."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2015/talks/wecla02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2015/papers/wecla02.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2015/posters/wecla02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2015-WECLA02",
      "page_number": "585",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECLA03",
      "title": "HTc-SQUID Beam Current Monitor at the RIBF",
      "authors": [
        "T. Watanabe",
        "N. Fukunishi",
        "M. Kase",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "S.I. Inamori",
        "K. Kon",
        "TEP Corporation",
        "Tokyo",
        "Japan",
        "A high critical temperature (HTc) superconducting quantum interference device (SQUID) beam current monitor (SQUID monitor) has been built and installed in the beam transport line in the radioactive isotope beam factory (RIBF) at RIKEN in Japan. The SQUID monitor can measure the DC current of heavy-ion beams non-destructively at high resolution. Unlike at other existing facilities",
        "as a low vibration",
        "pulse-tube refrigerator cools the HTc fabrications including the SQUID",
        "the size of the system is reduced and the running costs are lowered. Recently",
        "the magnetic shielding system has been greatly reinforced. The measurement resolution is determined by the signal to noise ratio",
        "which is improved by attenuating the external magnetic noise. Furthermore",
        "the data acquisition and control program",
        "currently being written using LabVIEW is providing the trend graph of the measured beam current. In this graph it was observed that the amplitude of ripples in the modulated beam current increased with the beam current. Here we report the details of SQUID monitoring system and the results of the beam measurement."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2015/talks/wecla03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2015/papers/wecla03.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2015/posters/wecla03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2015-WECLA03",
      "page_number": "590",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECLA04",
      "title": "Wideband Vertical Intra-Bunch Feedback at the SPS  - Technology Development, Recent Accelerator Measurements and Next Steps",
      "authors": [
        "J.D. Fox",
        "J.E. Dusatko",
        "C.H. Rivetta",
        "O. Turgut",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "H. Bartosik",
        "W. Höfle",
        "B. Salvant",
        "U. Wehrle",
        "CERN",
        "Geneva",
        "Switzerland",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "A wideband vertical intra-bunch feedback system is in development at the CERN SPS for use to control potential Ecloud and TMCI instabilities. The work is motivated by planned intensity increases from the LIU and HL-LHC upgrade programs. System technical features include pickups",
        "upgraded kickers and related RF power amplifiers",
        "analog processing with 1 GHz bandwidth",
        "with a with 4 GS/sec reconfigurable digital signal processing system. Recent results include driven beam experiments and beam simulation methods to verify the damping provided by the wideband system",
        "and validate reduced MIMO models and model-based controllers. Noise effects and uncertainties in the model are evaluated via SPS measurements to predict the limits of control techniques applied to stabilize the intrabunch dynamics. We present data showing the excitation and damping of unstable modes. The plans for the next year",
        "including experimental measurements",
        "hardware upgrades and future control developments are described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2015/talks/wecla04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2015/papers/wecla04.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2015/posters/wecla04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2015-WECLA04",
      "page_number": "595",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:55:20"
}