{
  "session_info": {
    "id": "MODO",
    "name": "MODO - Plasma investigations II",
    "url": "https://proceedings.jacow.org/ecris2016/html/modo.htm"
  },
  "papers": [
    {
      "paper_id": "MODO01",
      "title": "Structural Information on the ECR Plasma by X-ray Imaging",
      "authors": [
        "R. Rácz",
        "S. Biri",
        "ATOMKI",
        "Debrecen",
        "Hungary",
        "C. Caliri",
        "G. Castro",
        "S. Gammino",
        "D. Mascali",
        "L. Neri",
        "F.P. Romano",
        "INFN/LNS",
        "Catania",
        "Italy",
        "DU",
        "Debrecen",
        "Hungary",
        "IBAM-CNR",
        "Catania",
        "Italy",
        "Precise knowledge on the density distribution of the Electron Cyclotron Resonance Ion Source plasma is needed by several reasons: i) in order to possibly improve the quality parameters of the extracted ion beam (emittance",
        "brightness) strongly linked to the plasma structure",
        "ii) to correctly investigate the recently observed plasma instabilities and/or the implementation of alternative heating methods (e.g. modal conversion) iii) in order to improve the general microwave-to-plasma coupling efficiency",
        "in view of a microwave-absorption oriented design of future ECRIS. The non-destructive spectroscopic diagnostic methods give information always corresponding to an integration over the whole plasma volume. X-ray imaging by pin-hole camera can partly overcome this limitation. We performed volumetric and space resolved X-ray measurements at the ATOMKI ECRIS operated at lower frequencies than usual. The experimental setup in detail and the methods how the working parameters were selected will be shown. The integrated and photon-counting analyses of the collected plasma images show a strong effect of the frequency and magnetic field on the plasma structure and local energy content."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/modo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/modo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/modo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MODO01",
      "page_number": "30",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MODO02",
      "title": "Angular Distributions of Bremsstrahlung X-ray Emission from ECR Plasma",
      "authors": [
        "Korea University",
        "Seoul",
        "Republic of Korea",
        "High-energy X-ray emission beyond a critical energy from ECR heating has long attracted much attention and its nature has yet been unsolved. We have measured bremsstrahlung X-rays from the 28-GHz ECR ion source at Busan Center of KBSI. The gamma-ray detection system consists of three NaI(Tl) scintillation detectors placed 55 cm radially from the beam axis at the extraction port",
        "and a NaI(Tl) scintillation detector for monitoring X-ray intensity at the beam axis. Bremsstrahlung X-ray energy spectra were measured at 9 azimuthal angular regions at RF power of 1kW. We also measured bremsstrahlung X-rays by exchanging detector positions for studying systematic uncertainties. Detection efficiency and shielding effect are taken into account for extracting real X-ray energy spectra from measured ones",
        "based on Geant4 simulation results. Preliminary results on the azimuthal angular distributions of bremsstrahlung X-rays with respect to energy region will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/modo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/modo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/modo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MODO02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 17:27:21"
}