{
  "session_info": {
    "id": "WEPFAV",
    "name": "WEPFAV - Wednesday Poster facilities",
    "url": "https://proceedings.jacow.org/srf2021/html/wepfav.htm"
  },
  "papers": [
    {
      "paper_id": "WEPFAV001",
      "title": "Cryomodule Development for the Materials Irradiation Facility: From IFMIF-EVEDA to IFMIF-DONES",
      "authors": [
        "N. Bazin",
        "S. Chel",
        "CEA-DRF-IRFU",
        "France",
        "For several years",
        "CEA has been involved in the development of superconducting linac for fusion related project",
        "with the goal to develop an high flux neutrons source to test and qualify specific materials to be used in fusion power plants. In the framework of the ITER Broder Approch",
        "a prototype cryomodule is under construction in Japan for the IFMIF/EVEDA phase(Engineering Validation and Engineering Design Activities) and the construction of the Accelerator Prototype (LIPAc) at Rokkasho",
        "fully representative of the IFMIF low energy (9 MeV) accelerator (125 mA of D+beam in continuous wave). Meanwhile",
        "the design studies of a plant called DONES (Demo Oriented NEutron Source",
        "derived from IFMIF) started",
        "with a superconducting linac made of 5 cryomodules. These one are based on the same principles as the one developed for IFMIF/EVEDA",
        "but taking into account the lessons learnt from the prototype. This paper will present the similarities but also the differences between the cryomodules for IFMIF/EVEDA and DONES."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepfav001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepfav001.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepfav001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPFAV001",
      "page_number": "534",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPFAV004",
      "title": "Status of the Cryogenic Infrastructure for MESA",
      "authors": [
        "T. Stengler",
        "K. Aulenbacher",
        "F. Hug",
        "D. Simon",
        "KPH",
        "Mainz",
        "Germany",
        "The Institute of Nuclear Physics at the Johannes Gutenberg University Mainz",
        "Germany is currently constructing the Mainz Energy-recovering Superconducting Accelerator (MESA). The centerpiece of the MESA consists of two superconducting cryomodules of the ELBE/Rossendorf type",
        "which are operated at 1.8 K. Furthermore",
        "accelerator elements for polarimetry",
        "a 10 T solenoid",
        "and the external SRF test facility of the Helmholtz Institute Mainz have to be supplied with 4 K helium. One challenge here is to supply the components located throughout the accelerator according to their requirements and to establish a 16mbar system for 1.8 K operation. To ensure the required supply of helium at the different temperature levels",
        "the existing helium liquefier has to be upgraded. The cryogenic infrastructure has to be adapted to the accelerator. The concept of the future cryogenic distribution network is presented in this paper and the design of the cryogenic facilities including the modifications is described in detail."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepfav004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepfav004.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepfav004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPFAV004",
      "page_number": "539",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPFAV005",
      "title": "Design Optimization of the 166-MHz and 500-MHz Fundamental Power Couplers for Superconducting RF Cavities at High Energy Photon Source",
      "authors": [
        "T.M. Huang",
        "Z.Z. Chang",
        "L. Guo",
        "H.Y. Lin",
        "Q. Ma",
        "W.M. Pan",
        "P. Zhang",
        "X.Y. Zhang",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "Five 166-MHz quarter-wave ß=1 cavities have been chosen for the fundamental srf system while two 500-MHz single-cell elliptical cavities for the third-harmonic system for High Energy Photon Source (HEPS). Each cavity will be equipped with one fundamental power coupler (FPC) capable of delivering 250-kW continuous-wave rf power. For the 166-MHz FPC",
        "two prototypes were developed and excellent performances were demonstrated in the high-power operations. However",
        "the inner air part was observed to be warmer than predictions. Therefore",
        "an innovative cooling scheme was adopted. In addition",
        "the Nb extension tube has been elongated to solve the overheating in the cavity-coupler interface region. Concerning the 500-MHz FPC",
        "several improvements were proposed. First",
        "a doorknob adopting WR1800 instead of WR1500 waveguide was chosen to better match the operating frequency; Second",
        "the window position was optimized to ensure multipacting-free on the window; Third",
        "the cryogenic heat load was estimated carefully to obtain an optimum helium gas cooling. The main parameters and the design optimizations of the 166-MHz and 500-MHz FPCs are presented in this paper."
      ],
      "institutions": [
        "Funding: Supported in part by High Energy Photon Source, a major national science and technology infrastructure in China, and in part by the National Natural Science Foundation of China under Grant 12075263."
      ],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepfav005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepfav005.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepfav005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPFAV005",
      "page_number": "544",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPFAV006",
      "title": "ILC Energy Upgrade Paths to 3 TeV",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "We consider ILC upgrade paths beyond 1 TeV: (1) to 2 TeV and (2) to 3 TeV depending on the needs of high energy physics. Parameters for four scenarios will be presented and challenges discussed. 1. From 1 TeV to 2 TeV based on: a. Gradient advances of Nb cavities to 55 MV/m anticipated from on-going SRF R&D on Nb structures discussed in Section 4.3.x. b. Radically new travelling wave (TW) superconducting structures [1",
        "2] optimized for effective gradients of 70+ MV/m",
        "along with 100% increase in R/Q (discussed in more detail in Section 4.3.x). The large gain in R/Q has a major beneficial impact on the refrigerator heat load",
        "the RF power",
        "and the AC operating power. OR 2. From 1 TeV to 3 TeV based on a. Radically new travelling wave (TW) superconducting structures [1",
        "2] optimized for effective gradients of 70+ MV/m",
        "along with 100% increase in R/Q. The large gain in R/Q has a major beneficial impact on heat load",
        "RF power",
        "and the AC operating power. b. 80 MV/m gradient potential for Nb3Sn [3] with Q of 1x1010",
        "based on extrapolations from high power pulsed measurements on single cell Nb3Sn cavities. Further",
        "the operating temperature is 4.2 K instead of 2K."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/wepfav006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/wepfav006.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/wepfav006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-WEPFAV006",
      "page_number": "549",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-11 03:05:58"
}