{
  "session_info": {
    "id": "WEAL",
    "name": "WEAL - Beam Charge Monitors and Other Instrumentation",
    "url": "https://proceedings.jacow.org/ibic2016/html/weal.htm"
  },
  "papers": [
    {
      "paper_id": "WEAL01",
      "title": "Longitudinal Diagnostics Methods and Limits for Hadron Linacs",
      "authors": [
        "A.P. Shishlo",
        "A.V. Aleksandrov",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "A summary of the longitudinal diagnostics for linacs is presented based on the Spallation Neutron Source (SNS) linac example. It includes acceptance phase scans",
        "Bunch Shape Monitors (BSM)",
        "and a method based on the analysis of the stripline Beam Position Monitors (BPM) signals. The last method can deliver the longitudinal Twiss parameters of the beam. The accuracy",
        "applicability",
        "and limitations of this method are presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/weal01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/weal01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/weal01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEAL01",
      "page_number": "563",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAL02",
      "title": "The Wall Current Transformer - a New Sensor for Precise Bunch-by-Bunch Intensity Measurements in the LHC",
      "authors": [
        "M. Krupa",
        "M. Gąsior",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Wall Current Transformer (WCT) is a new bunch-by-bunch intensity monitor developed by the CERN Beam Instrumentation Group to overcome the performance issues of commercial Fast Beam Current Transformers (FBCT) observed during Run 1 of the LHC. In the WCT the large magnetic cores commonly used in FBCTs are replaced with small RF transformers distributed around the beam pipe. Rather than directly measuring the beam current",
        "the WCT measures the image current induced by the beam on the walls of the vacuum chamber. The image current is forced to flow through a number of screws which form the single-turn primary windings of the RF transformers. The signals of the secondary windings are combined and the resulting pulse is filtered",
        "amplified and sent to the acquisition system. This paper presents the principle of operation of the WCT and its performance based on laboratory and beam measurements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/weal02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/weal02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/weal02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEAL02",
      "page_number": "568",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAL03",
      "title": "Diagnostic Data Acquisition Strategies at FRIB",
      "authors": [
        "S. Cogan",
        "S.M. Lidia",
        "R.C. Webber",
        "FRIB",
        "East Lansing",
        "USA",
        "Strategies for data acquisition and processing will be discussed in the context of the Facility for Rare Isotope Beams (FRIB). Design decisions include selecting and designing electronics hardware",
        "data acquisition cards",
        "firmware design",
        "and how to integrate with EPICS control system. With over 300 diagnostic devices and 16 unique types of devices",
        "timing for synchronous data acquisition is important. Strategies to accelerate development as well as reduce maintenance requirements will be dis-cussed",
        "including using common hardware and firmware whenever possible",
        "and defining a common data report-ing structure for use by most devices. MicroTCA.4 plat-form is used to integrate data acquisition cards",
        "distribute timing information",
        "and machine protection signals."
      ],
      "institutions": [
        "Funding: This material is based upon work supported by the U.S. Department of Energy Office of Science under Cooperative Agreement DE-SC0000661, the State of Michigan and Michigan State University."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2016/talks/weal03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2016/papers/weal03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2016/posters/weal03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2016-WEAL03",
      "page_number": "572",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:52:21"
}