{
  "session_info": {
    "id": "WEOAA",
    "name": "WEOAA - Contributed Oral Presentations, Photon Sources and Electron Accelerators",
    "url": "https://proceedings.jacow.org/ipac2016/html/weoaa.htm"
  },
  "papers": [
    {
      "paper_id": "WEOAA01",
      "title": "Transverse Emittance Exchange for Improved Injection Efficiency",
      "authors": [
        "P. Kuske",
        "F. Kramer",
        "HZB",
        "Berlin",
        "Germany"
      ],
      "institutions": [],
      "abstract": "In most cases beam is injected into electron storage rings in the horizontal plane and off-axis. The larger the horizontal emittance of the injected beam the larger the acceptance of the ring has to be. The injected beam is usually delivered by a synchrotron. In case the vertical acceptance of the ring is sufficiently large one can take advantage of the small vertical emittance reached in well aligned and tuned synchrotrons since the transverse emit-tances can be exchanged with the help of skew quadru-pole magnets. A few possible processes will be discussed: emittance exchange with static magnets in the transfer line between synchrotron and ring or emittance exchange in the synchrotron shortly before extraction with time dependent magnets. This could be a suddenly switched-on normal or skew quadrupole magnet or skew quadru-pole fields oscillating at a frequency fulfilling the reso-nance condition. Estimates for these magnets and their design will be given.",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/weoaa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/weoaa01.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/weoaa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEOAA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAA02",
      "title": "On-axis Beam Accumulation Enabled by Phase Adjustment of a Double-frequency RF System for Diffraction-limited Storage Rings",
      "authors": [
        "G. Xu",
        "J. Chen",
        "Z. Duan",
        "J. Qiu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Future synchrotron light sources aim to achieve ultra- low emittances on both transverse planes",
        "approaching or even reaching the diffraction limit of X-ray photon energies. These diffraction-limited storage rings (DLSRs) feature very strong lattice nonlinearities and thus very small dynamic aperture",
        "which exclude off-axis injection schemes. In this paper",
        "we propose a longitudinal on-axis injection scheme",
        "which is based on a double-frequency RF system and in- dependently adjustment of the RF phase of each cavity to enable RF gymnastics. Such a scheme looks feasible with the state-of-art technology of fast injection kicker. Compari- son with other on-axis injection schemes is also discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/weoaa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/weoaa02.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/weoaa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEOAA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAA03",
      "title": "Experimental Study on Optical Vortex from a Helical Undulator at UVSOR-III",
      "authors": [
        "Nagoya University",
        "Nagoya",
        "Japan",
        "M. Katoh",
        "N.S. Mirian",
        "UVSOR",
        "Okazaki",
        "Japan",
        "T. Konomi",
        "N. Yamamoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "ISSP",
        "Kashiwa-shi",
        "Japan",
        "K. Miyamoto",
        "S. Sasaki",
        "HSRC",
        "Higashi-Hiroshima",
        "Japan",
        "A relativistic electron in helical undulator emits an optical vortex which carries orbital angular momentum. Sasaki and McNulty predicted theoretically that higher harmonics of helical undulator is optical vortex* and the experimental verification was made at BESSY** and UVSOR-III***. Further",
        "we have made a systematic study to characterize the optical vortex from a helical undulator at UVSOR-III. Synchrotron radiation in UV region from an optical klystron undulator system consisting of two APPLE-II helical undulators and a buncher was used for the experiment. Patterns resulting from inferences between two undulator radiation carrying different angular momentums were clearly observed. To investigate the optical properties of the radiation",
        "diffraction experiments were carried out. Specific diffraction patterns due to the phase singularity in the radiation center were clearly observed. The experimental results are compared with simulation.",
        "* S. Sasaki",
        "I. McNulty",
        "Phys. Rev. Lett. 100",
        "124801 (2008)  ** J. Bahrdt et al.",
        "Phys. Rev. Lett. 111",
        "034801 (2013)  *** e.g. S. Sasaki et al.",
        "presented in SRI2015 (2015)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/weoaa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/weoaa03.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/weoaa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEOAA03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 20:09:53"
}