{
  "session_info": {
    "id": "SUWSM",
    "name": "SUWSM - Thom Mason Public Lecture",
    "url": "https://proceedings.jacow.org/IPAC2015/html/suwsm.htm"
  },
  "papers": [
    {
      "paper_id": "SUWSM1",
      "title": "The Impact of \"Big Science\" on the U.S. Economy",
      "authors": [
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "In the United States",
        "the era of “Big Science” began during World War II with the large-scale mobilization of science to develop the first nuclear weapons. When the war ended",
        "the facilities established to support the Manhattan Project were transferred from military control to a new civilian Atomic Energy Commission",
        "which was charged with managing them as national laboratories. Today",
        "the U.S. Department of Energy (DOE) oversees 17 national laboratories that function as a unique system for the conduct of Big Science",
        "organizing and deploying multidisciplinary teams of researchers who make use of large-scale scientific instruments such as research reactors and accelerators to tackle compelling problems in science",
        "energy",
        "and security. The national laboratories have delivered a host of ideas and discoveries in support of DOE’s missions. The translation of these innovations to practice has had profound economic impacts across a wide range of sectors",
        "from health care to housing to information technology to manufacturing. As the scale of Big Science continues to expand",
        "driven by factors such as growth in international research collaborations and increasingly massive data sets",
        "we can expect additional economic benefits to result from future innovations.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/suwsm1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/suwsm1.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/suwsm1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-SUWSM1",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 20:18:54"
}