{
  "session_info": {
    "id": "WEADE",
    "name": "WEADE - Celebration of Diversity, Equity, and Inclusion in the Accelerator Community",
    "url": "https://proceedings.jacow.org/napac2022/html/weade.htm"
  },
  "papers": [
    {
      "paper_id": "WEADE1",
      "title": "Integrating Diversity and Inclusion in the Workplace: Los Alamos National Laboratory’s Strategies for Expanding Diversity and Fostering Inclusion and Belonging",
      "authors": [
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Diversity fuels an innovative",
        "agile and principled workforce that is essential to solving problems of global importance. Diversity of thought",
        "experience",
        "and perspective leads to better problem solving and promotes creativity. But diversity in the workplace does not organically grow without conscientious attention. Like growing a tree requires water",
        "sun and fresh air",
        "growing a diverse workforce requires awareness",
        "strategy and reflection. Los Alamos National Laboratory’s approach to expanding diversity employs awareness",
        "strategic action-oriented programs",
        "and consistent reflection and rerouting to build a workforce that reflects the nation and world we are tasked to protect. But expanding diversity is meaningless without also fostering inclusion and belonging. Hear about successes and areas for further redirection from Los Alamos’s EEO and Affirmative Action Officer. Hear about the diversity of our Accelerator community and how this sector of our workforce compares to the broader community. And hear how the voices of our workforce are shaping our programs and initiatives to ensure that every unique voice",
        "every idea and opinion",
        "are welcome and respected."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/weade1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/weade1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/weade1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-WEADE1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-11 00:27:20"
}