{
  "session_info": {
    "id": "MOCO",
    "name": "MOCO - Plasma investigations I",
    "url": "https://proceedings.jacow.org/ecris2016/html/moco.htm"
  },
  "papers": [
    {
      "paper_id": "MOCO01",
      "title": "Innovative Schemes of Plasma Heating for Future Multiply-Charged Ions Sources: Modeling and Experimental Investigation",
      "authors": [
        "D. Mascali",
        "C. Altana",
        "G. Castropresenter",
        "L. Celona",
        "S. Gammino",
        "O. Leonardi",
        "M. Mazzaglia",
        "D. Nicolosi",
        "R. Reitano",
        "F.P. Romano",
        "G. Sorbello",
        "G. Torrisi",
        "INFN/LNS",
        "Catania",
        "Italy",
        "M. Mazzaglia",
        "R. Reitano",
        "Universita Degli Studi Di Catania",
        "Catania",
        "Italy",
        "IBAM-CNR",
        "Catania",
        "Italy",
        "University of Catania",
        "Catania",
        "Italy",
        "The application of plasma heating methods alternative to the direct Electron Cyclotron Resonance coupling",
        "such as the Electron Bernstein Waves (EBW) heating",
        "is already a reality in large-size thermonuclear reactors. These plasma waves give the unique opportunity to largely overcome the cutoff density. EBW heating in compact traps such as ECRIS devices is still a challenge",
        "requiring advanced modelling and innovative diagnostics. At Istituto Nazionale di Fisica Nucleare-Laboratori Nazionali del Sud (INFN-LNS)",
        "the off-ECR heating (driven by Bernstein waves) has produced a highly overdense plasma. Interferometric measurements say the electron density has overcome by a factor ten the cutoff density at 3.76 GHz. More advanced schemes of wave launching have been designed and implemented on the new test-bench called Flexible Plasma Trap",
        "operating up to 7 GHz-0.5 T",
        "in ﬂat/simple mirror/beach magnetic conﬁguration. The paper will give an overview about modal-conversion investigation by a theoretical and experimental point of view",
        "including the description of the diagnostics developed to detect plasma emitted radiation in the RF",
        "optical",
        "soft-X and hard-X-ray domains."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moco01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moco01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moco01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOCO01",
      "page_number": "14",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCO02",
      "title": "Broadband Microwave Emission Spectrum Associated With Kinetic Instabilities in ECR Plasmas",
      "authors": [
        "I. Izotov",
        "D. Mansfeld",
        "V. Skalyga",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "I. Izotov",
        "V. Skalyga",
        "UNN",
        "Nizhny Novgorod",
        "Russia",
        "T. Kalvas",
        "H. A. Koivisto",
        "J. Komppula",
        "R.J. Kronholm",
        "J.P. Laulainen",
        "O.A. Tarvainen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "ECRISs are susceptible to kinetic instabilities due to resonance heating mechanism forming an anisotropic electron velocity distribution function. Well-known and frequently observed extracted ion beam current oscillations in case of high heating power and/or low magnetic field gradient are proven to be caused by the instabilities of cyclotron type leading to a notable reduction of highly-charged ion beam intensities. It has been shown recently that heating power level and magnetic field gradient affect the spectrum of microwave emission of plasma related to cyclotron instabilities",
        "being in the frequency range of 8-14 Ghz. More detailed study of microwave emission spectrum of ECR plasma conducted with an improved setup is presented in this work. It was found that frequencies of microwaves emitted by the plasma can be far beyond the primary heating frequency (14 GHz) and up to 25 GHz. Moreover",
        "a threshold transition from periodic pulsed emission to a CW emission has been observed in the experiment for the first time",
        "as was predicted theoretically*. The transition occurs at certain threshold levels of heating microwave power and magnetic field gradient.",
        "*A.G. Shalashov et all",
        "JETP Letters",
        "2006",
        "Vol. 84",
        "No. 6",
        "pp. 314-319 (2006)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moco02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moco02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moco02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOCO02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOCO03",
      "title": "Cavity Tuning Experiments with the JYFL 14 GHz ECRIS",
      "authors": [
        "O.A. Tarvainen",
        "T. Kalvas",
        "H. A. Koivisto",
        "R.J. Kronholm",
        "J.P. Laulainen",
        "J. Orpana",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "I. Izotov",
        "D. Mansfeld",
        "V. Skalyga",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "CERN",
        "Geneva",
        "Switzerland",
        "Experimental results showing the effect of cavity tuning on oxygen beam currents extracted from the AECR-type JYFL 14 GHz ECRIS are reported. The microwave-plasma coupling properties of the ion source were adjusted by inserting a conducting tuner stub through the injection plug",
        "thus changing the dimensions of the plasma chamber and affecting the cavity properties of the system. The beam currents of high charge state ions were observed to vary up to some tens of percent depending on the tuner position and the microwave frequency."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moco03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moco03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moco03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOCO03",
      "page_number": "18",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCO04",
      "title": "Recent Bremsstrahlung Measurements from the Superconducting Electron Cyclotron Resonance Ion Source VENUS",
      "authors": [
        "J.Y. Benitez",
        "C.M. Lyneis",
        "L. Phair",
        "D.S. Todd",
        "D. Xie",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Axial bremsstrahlung from the superconducting Electron Cyclotron Resonance ion source VENUS have been systematically measured as a function of RF heating frequency",
        "and the axial and radial field strengths. The work focuses on bremsstrahlung with energies greater than 10 keV to extract the spectral temperature Ts. The three axial coils and the radial coils in the superconducting VENUS can all be set independently and have a large dynamic range",
        "which makes it possible to decouple Bmin and Bgrad and study their effects on the bremsstrahlung independently. With typical pressure and RF power levels",
        "the measurements show that Ts depends approximately linearly on Bmin and is not correlated with the ∇BECR",
        "the magnetic field mirror ratios or the RF frequency. These results are important for the next generation of ECR ion sources",
        "which are designed to operate at frequencies above 40 GHz and significantly higher magnetic fields where bremsstrahlung is expected to cause a significant cryogenic heat load and increase the radiation shielding requirements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/moco04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/moco04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/moco04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-MOCO04",
      "page_number": "23",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:27:18"
}