{
  "session_info": {
    "id": "WEBLA",
    "name": "WEBLA - Beam Loss Detection",
    "url": "https://proceedings.jacow.org/IBIC2015/html/webla.htm"
  },
  "papers": [
    {
      "paper_id": "WEBLA01",
      "title": "Beam Loss Monitoring for Demanding Environments",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "Beam loss monitoring (BLM) is a key protection system for machines using beams with damage potential and is an essential beam diagnostic tool for any machine. All BLM systems are based on the observation of secondary particle showers originating from escaping beam particles. With ever higher beam energies and intensities",
        "the loss of even a tiny fraction of the beam can lead to damage or",
        "in the case of superconducting machines",
        "quenches. Losses also lead to material ageing and activation and should therefore be well controlled and reduced to a minimum. The ideal BLM system would have full machine coverage and the capability to accurately quantify the number of lost beam particles from the measured secondary shower. Position and time resolution",
        "dynamic range",
        "noise levels and radiation hardness all have to be considered",
        "while at the same time optimising the system for reliability",
        "availability and maintainability. This contribution will focus on design choices for BLM systems operating in demanding environments",
        "with a special emphasis on measuring particle losses in the presence of synchrotron radiation and other background sources."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2015/talks/webla01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2015/papers/webla01.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2015/posters/webla01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2015-WEBLA01",
      "page_number": "567",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBLA02",
      "title": "Development of the Beam Loss Monitor for Beam Halo Measurement in the J-PARC RCS",
      "authors": [
        "M. Yoshimoto",
        "H. Harada",
        "S. Kato",
        "M. Kinsho",
        "K. Okabe",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "In the J-PARC RCS",
        "transverse beam profiles including both the beam core and halo at the extraction beam transport line (3NBT) were measured by using a combination with a wire scanner type beam scraper and beam loss monitors (BLMs). Our final goal of this halo monitor is to measure the intra-bunch beam halo of extracted two bunches from the RCS. Thus the plastic scintillator and photomultiplier (PMT) assemblages were adopted as the BLMs with quick time response. However",
        "we found that the BLMs detected not only the radiation from the wire but also the reflected radiation from other devices and walls. Therefore we tried to develop new-type BLMs",
        "which are scintillation-type BLM with lead glass and Cherenkov-type BLM with quartz or UV acrylic. In this presentation",
        "we will present an overview and experimental results of the new-type BLMs together with an outline of halo monitor system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2015/talks/webla02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2015/papers/webla02.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2015/posters/webla02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2015-WEBLA02",
      "page_number": "575",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBLA03",
      "title": "Position Resolution of Optical Fibre-Based Beam Loss Monitors Using Long Electron Pulses",
      "authors": [
        "E. Nebot Del Busto",
        "S. Döbert",
        "F.S. Domingues Sousa",
        "E. Effinger",
        "W. Farabolini",
        "E.B. Holzer",
        "M. Kastriotou",
        "W. Viganò",
        "CERN",
        "Geneva",
        "Switzerland",
        "ASCo",
        "Clayton",
        "Victoria",
        "Australia",
        "SLSA",
        "Clayton",
        "Australia",
        "M.J. Boland",
        "R.P. Rassool",
        "The University of Melbourne",
        "Melbourne",
        "Victoria",
        "Australia",
        "CEA/DSM/IRFU",
        "France",
        "M. Kastriotou",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "M. Kastriotou",
        "E. Nebot Del Busto",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "Beam loss monitoring systems based on optical fibres (oBLM)",
        "have been under consideration for future colliders for several years. To distinguish losses between consecutive quadrupoles",
        "a position resolution of less than 1 m is required. A resolution of better than 0.5 m has been achieved in machines with single",
        "nanosecond long pulses. For longer beam pulses",
        "such as the ~150 ns CLIC pulse",
        "the longitudinal length of signals in the fibre is close to the duration of the beam pulse itself which makes loss reconstruction very challenging. In this contribution",
        "results from experiments into the position resolution of an oBLM based on long beam pulses are presented. These measurements have been performed at the CLIC Test Facility (CTF3) and the Australian Synchrotron Light Source (ASLS). In CTF3",
        "controlled beam losses were created at different quadrupoles in the 28 m long decelerating Test Beam Line (TBL) LINAC by altering the current supplied or misaligning them. In ASLS the flexibility of the facility allowed the location of beam losses generated by single bunches to be studied as well as losses for longer bunch trains up to 600 ns in duration."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2015/talks/webla03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2015/papers/webla03.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2015/posters/webla03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2015-WEBLA03",
      "page_number": "580",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:55:17"
}