{
  "session_info": {
    "id": "WE3AB",
    "name": "WE3AB - Wednesday After Lunch",
    "url": "https://proceedings.jacow.org/ibic2017/html/we3ab.htm"
  },
  "papers": [
    {
      "paper_id": "WE3AB1",
      "title": "The LHC Beam Gas Vertex Detector - a Non-Invasive Profile Monitor for High Energy Machines",
      "authors": [
        "S. Vlachos",
        "A. Alexopoulos",
        "C. Barschel",
        "E. Bravin",
        "G. Bregliozzi",
        "N. Chritin",
        "B. Dehning",
        "M. Ferro-Luzzi",
        "M. Giovannozzi",
        "R. Jacobsson",
        "L.K. Jensen",
        "R.J. Jones",
        "V. Kain",
        "R. Matev",
        "M.N. Rihl",
        "V. Salustino Guimaraes",
        "R. Veness",
        "B. Würkner",
        "CERN",
        "Geneva",
        "Switzerland",
        "A. Bay",
        "F. Blanc",
        "S. Gianì",
        "O. Girard",
        "G.J. Haefeli",
        "P. Hopchev",
        "A. Kuonen",
        "T. Nakada",
        "O. Schneider",
        "M. Tobin",
        "Q.D. Veyrat",
        "Z. Xu",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "R. Greim",
        "W. Karpinski",
        "S. Schael",
        "A. Schultz von Dratzig",
        "G. Schwering",
        "M. Wlochal",
        "RWTH",
        "Aachen",
        "Germany",
        "The Beam Gas Vertex (BGV) monitor is being developed as part of the High Luminosity LHC project with the aim of providing measurements with less than 5% error on the beam size with an integration time of 5 minutes. It will be the only instrument capable of non-invasive beam size measurement throughout the LHC acceleration cycle with high intensity physics beams. A prototype BGV monitor has been installed in the LHC since 2016. Particles emerging from beam-gas interactions are recorded by 2 planes of scintillating fibre detectors. Based on vertex reconstruction of the detected tracks",
        "this monitor allows non-invasive measurement of beam profiles with bunch-by-bunch resolution. A dedicated computer farm performs track reconstruction and event analysis on-line so that real-time beam profile measurements can be provided. Data taken in 2016 and 2017 will be presented that demonstrate the power of the method."
      ],
      "institutions": [],
      "abstract": "Slides WE3AB1 [2.276 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2017/talks/we3ab1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2017/papers/we3ab1.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2017/posters/we3ab1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2017-WE3AB1",
      "page_number": "323",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WE3AB2",
      "title": "Simulation and Progress in Ionization Profile Monitors for High Intensty Proton Beam",
      "authors": [
        "K. Satou",
        "T.M. Mitsuhashi",
        "KEK",
        "Tokai",
        "Ibaraki",
        "Japan",
        "Nondestructive beam profile monitoring is strongly requested for the proton machines",
        "especially for the measurement of the high intensity high brightness beams. Ionization profile monitor is traditionally used for measurement of beam profile in the proton machines and proposed to measure the high intensity high brightness beams. The important issues are no uniformities of extraction field",
        "velocity distribution of e- from ionization process",
        "the strong beam field and detection system",
        "etc. In this talk",
        "we will review recent developments on these issues from theoretical and experimental approach.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R.M. Thurman-Keup",
        "M.L. Alvarez",
        "J. Fitzgerald",
        "C.E. Lundberg",
        "P.S. Prieto",
        "J.R. Zagel",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA"
      ],
      "institutions": [],
      "abstract": "Slides WE3AB2 [3.546 MB] reference for this paper using Commissioning and First Results of the Electron Beam Profiler in the Main Injector at Fermilab The planned neutrino program at Fermilab requires large proton beam intensities in excess of 2 MW. Measuring the transverse profiles of these high intensity beams is challenging and often depends on non-invasive techniques. One such technique involves measuring the deflection of a probe beam of electrons with a trajectory perpendicular to the proton beam. A device such as this is already in use at the Spallation Neutron Source at ORNL and a similar device has been installed in the Main Injector at Fermilab. Commissioning of the device is in progress with the goal of having it operational by the end of the year. The status of the commissioning and initial results will be presented. Slides WE3AB3 [2.077 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2017/talks/we3ab2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2017/papers/we3ab2.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2017/posters/we3ab2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2017-WE3AB2",
      "page_number": "330",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WE3AB3",
      "title": "Commissioning and First Results of the Electron Beam Profiler in the Main Injector at Fermilab",
      "authors": [
        "R.M. Thurman-Keup",
        "M.L. Alvarez",
        "J. Fitzgerald",
        "C.E. Lundberg",
        "P.S. Prieto",
        "J.R. Zagel",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA"
      ],
      "institutions": [],
      "abstract": "The planned neutrino program at Fermilab requires large proton beam intensities in excess of 2 MW. Measuring the transverse profiles of these high intensity beams is challenging and often depends on non-invasive techniques. One such technique involves measuring the deflection of a probe beam of electrons with a trajectory perpendicular to the proton beam. A device such as this is already in use at the Spallation Neutron Source at ORNL and a similar device has been installed in the Main Injector at Fermilab. Commissioning of the device is in progress with the goal of having it operational by the end of the year. The status of the commissioning and initial results will be presented. Slides WE3AB3 [2.077 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2017/talks/we3ab3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2017/papers/we3ab3.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2017/posters/we3ab3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2017-WE3AB3",
      "page_number": "330",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:49:37"
}