{
  "session_info": {
    "id": "MOXA",
    "name": "MOXA - Facilities I",
    "url": "https://proceedings.jacow.org/srf2017/html/moxa.htm"
  },
  "papers": [
    {
      "paper_id": "MOXA01",
      "title": "Successful Beam Commissioning of Chinese ADS Injector-II",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Since 2011",
        "the key technologies for superconducting proton linac were developed in CAS for Accelerator Driven System. The sc linac of 10 MeV base on spoke resonators (Spoke)",
        "named injector I",
        "was built in IHEP. The other one base on half-wave resonators (HWR)",
        "named injector II",
        "was built in IMP. Both injectors were commissioned successfully with more than 1 mA CW beam. The front-end demo linac for ADS is based on injector II with succeeding by one taper-type HWR cryomodule and one Spoke cryomodule. It can accelerate 10 mA beam to energy of 25 MeV. The last two cryomodules of the demo linac started tunnel installation since January and cooling down in May. The first beam was on May 27th",
        "and 12 mA (@ 26 MeV) pulse beam and 170 us (@ 25 MeV) CW beam were demonstrated on July 6th. The background of the project will be introduced. The lessons and experiences of CW SRF and mA beam commissioning on injector II and the 25 MeV demo linac will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/moxa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/moxa01.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/moxa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-MOXA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOXA02",
      "title": "The Commissioning of the European XFEL Linac and its Performance",
      "authors": [
        "D. Reschke",
        "W. Decking",
        "N. Walker",
        "H. Weise",
        "DESY",
        "Hamburg",
        "Germany",
        "The main linac of the superconducting accelerator of the European XFEL presently consists of 96 accelerator modules",
        "each housing eight 1.3 GHz TESLA-type cavi-ties",
        "with an average design gradient of 23.6 MV/m. The performance of each individual module has been tested after module assembly in the Accelerator Module Test Facility (AMTF) at DESY. The 2-year period of module installation to the accelerator tunnel was finished in August 2016. In order to recheck and re-establish the performance of the input power couplers",
        "warm processing of nearly all installed modules was performed before the first cool-down during Dec 2016 / Jan 2017. Four consecutive modules are connected to one 10 MW klystron and form a so-called RF station",
        "which is powered and controlled individually during operation. By June 2017 23 of 25 RF stations have been commissioned for beam acceleration including frequency tuning",
        "various calibrations and LLRF adjustments. A preliminary beam energy of 14 GeV was achieved",
        "which is sufficient for first lasing experiments. No significant performance degradation has been observed so far. The commissioning experience and the available RF performance data will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/moxa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/moxa02.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/moxa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-MOXA02",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOXA03",
      "title": "The 30MeV Stage of the ARIEL e-linac",
      "authors": [
        "R.E. Laxdal",
        "Z.T. Ang",
        "T. Au",
        "K. Fong",
        "O.K. Kester",
        "S.R. Koscielniak",
        "A.N. Koveshnikov",
        "M.P. Laverty",
        "Y. Ma",
        "D.W. Storey",
        "E. Thoeng",
        "Z.Y. Yao",
        "Q. Zheng",
        "V. Zvyagintsev",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "A MW class cw superconducting electron linac (e-Linac) is being installed at TRIUMF as a driver for radioactive beam production as part of the ARIEL project. The e-linac final configuration is planned to consist of five 1.3GHz nine-cell cavities housed in three cryomodules with one single cavity injector cryomodule (EINJ) and two double cavity accelerating cryomodules (EACA",
        "EACB) to accelerate in continuous-wave (cw) up to 10mA of electrons to 50MeV. The e-Linac is being installed in stages. A demonstrator phase (2014) consisting of a 300kV electron gun",
        "EINJ",
        "and a partially outfitted EACA with just one accelerating cavity was installed for initial technical and beam tests to 22.9MeV. A Stage 2 upgrade now installed has a completed EACA to reach an operational goal of 3mA of electrons to 30MeV for first science from the ARIEL ISOL targets. A single 290kW klystron is used to feed the two EACA cavities in vector-sum closed-loop control. The paper is focused on the SRF challenges: systems design",
        "cavity and cryomodule performance",
        "rf ancillaries preparation and performance",
        "LLRF and RF system performance and final beam test results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/moxa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/moxa03.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/moxa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-MOXA03",
      "page_number": "6",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOXA04",
      "title": "Superconducting Accelerator for ERL Based FEL EUV Light Source at KEK",
      "authors": [
        "H. Sakai",
        "E. Kako",
        "T. Konomi",
        "T. Kubo",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "Toshiba",
        "Yokohama",
        "Japan",
        "QST",
        "Tokai",
        "Japan",
        "An energy recovery linac (ERL)-based free electron laser (FEL) is a possible candidate of a tens of kW EUV source and open the era for next generation EUV-lithography. We have designed the 10 mA class ERL-based EUV-FEL source to generate more than 10 kW power. One of the key technologies is CW superconducting cavities to realize the energy recovery of high beam current of more than 10 mA by suppressing HOMs and high gradient acceleration of higher than 12 MV/m. This CW superconducting cavity had been developed through the construction of the Compact ERL facility in KEK and it successfully achieved the energy recovery of 1 mA CW beam until now. In this talk",
        "first we express our design strategies of SRF cavities of the main linac of ERL-EUV light sources not only to suppress the HOMs but also to overcome the field emission problem by modifying the main linac cavity of Compact ERL more sophisticatedly. Next we show the recent development works for ERL-EUV superconducting cavity about HOM damper",
        "cryomodule",
        "and its clean string-assembly work by using horizontal test stand."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/moxa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/moxa04.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/moxa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-MOXA04",
      "page_number": "13",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOXA05",
      "title": "The LCLS-II SRF Linac",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The LCLS-II project",
        "a 4 GeV electron accelerator used to produce both hard and soft x-rays",
        "is driven by a c.w. electron accelerator operating at 1.3 GHz. The project requires the fabrication",
        "assembly and testing of 35 ' 1.3 GHz cryomodules and 2 ' 3.9 GHz cryomodules in order to generate the 4 GeV electron beam. The 280 TESLA style cavities used in the 1.3 GHz cryomodules have been modified for c.w. operation and are also utilizing nitrogen doping in order to achieve average Q0 of > 2.7·1010 at 16 MV/m. The status of the cavity and cryomodule testing will be reported on in this talk along with the challenges of achieving and maintaining the high Q0 in the cryomodule."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/moxa05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/moxa05.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/moxa05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-MOXA05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOXA06",
      "title": "SRF Systems for the Jefferson Lab Electron Ion Collider (JLEIC)",
      "authors": [
        "R.A. Rimmer",
        "W.A. Clemens",
        "F. Fors",
        "J. Guo",
        "F.E. Hannon",
        "J. Henry",
        "F. Marhauser",
        "L. Turlington",
        "H. Wang",
        "S. Wang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "We report on the development of new CW SRF systems for the colliding rings of a proposed electron-ion collider (EIC) at Jlab. Jefferson Lab is developing new strongly HOM-damped SRF cavities for the ion collider ring and a high-energy electron cooler at 952.6 MHz. The baseline design JLEIC will re-use the PEP-II 476 MHz cavities for the electron ring with a possible future upgrade to 952.6 MHz SRF cavities at a later date. We discuss the design optimization of the new high current cavities and compare options for the strong HOM damping required. A concept for a modular cryostat to house these various cavities will be shown",
        "and an overview of the challenging high-level parameters will be presented. These designs and concepts may be useful in other high current storage rings and ERL's."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/moxa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/moxa06.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/moxa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-MOXA06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOXA07",
      "title": "Development of the C-ADS SRF Accelerator at IHEP",
      "authors": [
        "F. Yan",
        "L. Bian",
        "J.S. Cao",
        "Y. Chen",
        "Y.L. Chi",
        "J.P. Dai",
        "L. Dong",
        "L.L. Dong",
        "Y.Y. Du",
        "H.F.S. Feisi",
        "Y. Gao",
        "R. Ge",
        "H. Geng",
        "D.Z. Guo",
        "D.Y. He",
        "J. He",
        "T.M. Huang",
        "X. Jing",
        "B. Li",
        "H. Li",
        "L. Li",
        "S.P. Li",
        "H.Y. Lin",
        "F. Liu",
        "R.L. Liu",
        "F. Long",
        "Y.H. Lu",
        "H.Z. Ma",
        "Q. Ma",
        "X. Ma",
        "C. Meng",
        "Z.H. Mi",
        "H.F. Ouyang",
        "W.M. Pan",
        "S. Pei",
        "Q.L. Peng",
        "X.H. Peng",
        "P. Sha",
        "H. Shi",
        "P. Su",
        "Y.F. Sui",
        "L.R. Sun",
        "X.T. Sun",
        "G.W. Wang",
        "J.L. Wang",
        "S.C. Wang",
        "G. Wu",
        "O. Xiao",
        "X.C. Yang",
        "Q. Ye",
        "R. Ye",
        "L. Yu",
        "X.Y. Zhang",
        "X.Y. Zhao",
        "Y.L. Zhao",
        "Y. Zhao",
        "Z.H. ZhenHua",
        "N. Zhou",
        "Z.S. Zhou",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Institute of High Energy Physics (IHEP)",
        "People's Republic of China",
        "The 10 MeV accelerator-driven subcritical system (ADS) Injector I test stand at Institute of High Energy Physics (IHEP) is a testing facility dedicated to demonstrate one of the two injector design schemes [Injector Scheme-I",
        "which works at 325 MHz]",
        "for the ADS project in China. The ion source was installed since April of 2014",
        "periods of commissioning are regularly scheduled between installation phases of the rest of the injector. Early this year",
        "continuous wave (CW) proton beam has been successfully obtained with energy of 10MeV and average beam current around 2 mA",
        "the single spoke cavities with smallest developed beta (βg=0.12) were applied and successfully commissioned. Single spoke cavities with higher beta (βg=0.21) were also adopted for the last cryomodule of 25MeV proton linac",
        "and 170uA CW proton beam were shooting through recently. This contribution reports the details of the development of the C-ADS SRF accelerator at IHEP and the challenges of the CW machine commissioning"
      ],
      "institutions": [
        "Funding: CAS Strategic Priority Research Program-Future Advanced Nuclear Fission Energy (Accelerator-Driven Sub-critical System) and National Natural Science Foundation of China, under contract NO. 11405190"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2017/talks/moxa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2017/papers/moxa07.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2017/posters/moxa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2017-MOXA07",
      "page_number": "19",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 7,
  "scrape_time": "2025-10-11 03:32:18"
}