{
  "session_info": {
    "id": "MOOC",
    "name": "MOOC - Commissioning and beam charge monitors",
    "url": "https://proceedings.jacow.org/ibic2018/html/mooc.htm"
  },
  "papers": [
    {
      "paper_id": "MOOC01",
      "title": "Commissioning Results from FRIB",
      "authors": [
        "FRIB",
        "East Lansing",
        "USA",
        "The FRIB Front End and the first three 0.041 cryomodules were successfully commissioned with Argon and Krypton beams. All required beam parameters at the end of the 0.041 cryomodules were reliably demonstrated and exceeded. Installed and commissioned accelerator systems demonstrated stable operation. In this talk",
        "I’ll describe the status of FRIB commissioning and present commissioning results for the FRIB Front End and 0.041 cryomodules."
      ],
      "institutions": [
        "Funding: Work supported by U.S. Department of Energy, Cooperative Agreement DE-SC0000661, and National Science Foundation, Cooperative Agreement PHY-1102511, State of Michigan and Michigan State University."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mooc01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mooc01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mooc01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOOC01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOOC02",
      "title": "The Beam Diagnostics in the CSNS Commissioning",
      "authors": [
        "T.G. Xu",
        "W.L. Huang",
        "M. Meng",
        "X.J. Nie",
        "J.M. Tian",
        "L. Zeng",
        "D.H. Zhu",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "W.L. Huang",
        "P. Li",
        "X.J. Nie",
        "J.L. Sun",
        "A.X. Wang",
        "T. Yang",
        "IHEP CSNS",
        "Guangdong Province",
        "People’s Republic of China",
        "DNSC",
        "Dongguan",
        "People’s Republic of China",
        "In June",
        "2017",
        "the whole accelerator components were finished the installation work in the tunnel. Followed the installation",
        "several different machine mode commissioning were carried out. The beam diagnostics were tested and used. The beam diagnostics performance and lessons were introduced in the paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mooc02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mooc02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mooc02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOOC02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOOC03",
      "title": "The Removal of Interference Noise of ICT using the PCA Method",
      "authors": [
        "J. Chen",
        "Y.B. Leng",
        "L.Y. Yu",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "The measurement of beam charge is a fundamental re-quirement to all particle accelerators facility. Shanghai soft X-ray free-electron laser (SXFEL) started construc-tion in 2015 and is now in the commission phase. Al-though integrated current transformer (ICT) were installed in the entire FEL for the measurement of the absolute beam charge",
        "the accurate measurement becomes difficult in the injector and the main accelerator section due to the noise interference from external factors such as klystron modulator. The evaluation of the source of noise signals and the procession of noise reduction using the principal component analysis (PCA) are proposed in this paper. Experiment results show that PCA method can effectively remove the interference of lower frequency noise from the klystron modulator and it can also improve the resolution of the ICT system. Detailed experiment results and data analysis will be mentioned as well."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mooc03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mooc03.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mooc03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOOC03",
      "page_number": "22",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOC04",
      "title": "Bunch Charge Monitor for the ALS Upgrade",
      "authors": [
        "S. De Santis",
        "D. Lipresenter",
        "W.E. Norum",
        "G.J. Portmann",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The ALS upgrade project (ALS-U) consists in the replacement of the existing ALS storage ring with a new storage and accumulator rings. Due to the reduced lifetime of the ultra-low emittance beam circulating in the new storage ring",
        "trains of 25/26 bunches have to be swapped between storage and accumulator every 30-60 seconds. The depleted train swapped out to the accumulator is topped back to its nominal charge from the injector and swapped back into the storage ring at the next injection cycle. Monitoring the bunch charge and parasitic bunches is necessary to minimize stored current variations in the storage ring and beam losses during the injection/extraction process. We present a bunch charge monitor based on a broadband analog-to-digital converter that allows to sample the signal obtained from a beam pickup at a frequency resulting in a scan of the entire ring with a ~60 ps resolution every 60 microseconds. Hundreds of scans are accumulated to obtain the necessary charge resolution. The beam pickup has been designed to be insensitive to the beam transverse position and its response to a bunch passage decays so rapidly that the readout is not affected by adjacent bunches."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/mooc04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/mooc04.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/mooc04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-MOOC04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:46:05"
}