{
  "session_info": {
    "id": "THM2",
    "name": "THM2 - New Projects",
    "url": "https://proceedings.jacow.org/cool2017/html/thm2.htm"
  },
  "papers": [
    {
      "paper_id": "THM21",
      "title": "NICA Project: Three Stages and Three Coolers",
      "authors": [
        "I.N. Meshkov",
        "G.V. Trubnikov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The Nuclotron-based Ion Collider fAcility (NICA) project is under development at JINR. The first and general goal of the project is experimental study of both hot and dense baryonic matter to search for so-called Mixed Phase formation in collisions of heavy relativistic ions. The second goal is spin physics (in collisions of polarized protons and deuterons). The project NICA is developed in three stages. 1st stage",
        "\"The Baryonic Matter at Nuclotron\"",
        "is a fixed target experiment with ions accelerated in the linac and two SC synchrotrons - the Booster and the Nuclotron up to kinetic energy of 4.5 GeV/u (the Centre mass system energy ECMS up to 3.45 GeV/u). The Booster has an electron cooler of the electron energy up to 50 keV. The 2nd stage extends the ECMS from 4 to 11 GeV/u in colliding beams' mode. The Collider will be equipped with both stochastic cooling system and double electron one of electron energy of 0.5 - 2.5 MeV",
        "which are being designed and manufactured at the Budker INP. Stage III - Polarized Beams Mode of The Collider is at the level of the conceptual design. We emphasize on beam dynamics in the NICA machines and a necessity of the cooling methods application."
      ],
      "institutions": [],
      "abstract": "Slides THM21 [8.370 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/cool2017/talks/thm21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2017/papers/thm21.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2017/posters/thm21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2017-THM21",
      "page_number": "84",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THM22",
      "title": "Status of the FAIR Project",
      "authors": [
        "GSI",
        "Darmstadt",
        "Germany",
        "The FAIR international particle accelerator is set to be one of the largest research facilities in the world. Based in the German city of Darmstadt (in the state of Hesse)",
        "the complex will cover an area of 20 hectares and require 600",
        "000 cubic metres of concrete as well as 65",
        "000 tons of steel. Construction teams will be building a tunnel to house the heart of the complex",
        "a ring accelerator with a circumference of 1.1 kilometres. The 24 buildings and tunnel sections provide 62",
        "000 square metres of usable space and sufficient room for a total of 3.5 kilometres of beam control tubes as well as huge detectors and a complex technical infrastructure. The construction project is split into several modules. The first module concentrates on constructing the large accelerator ring (SIS 100) along with two smaller accelerator and storage rings",
        "as well as a linear accelerator for protons (p-Linac). Another large accelerator ring",
        "SIS 300",
        "will be installed in the tunnel at a later stage. Space has also been allocated on the site for three further experimental and storage rings",
        "also to be installed at a later date.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "Slides THM22 [3.874 MB] reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/cool2017/talks/thm22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2017/papers/thm22.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2017/posters/thm22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2017-THM22",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 17:19:57"
}