{
  "session_info": {
    "id": "TUZZO",
    "name": "TUZZO - Tuesday Oral After Third Break",
    "url": "https://proceedings.jacow.org/ecris2020/html/tuzzo.htm"
  },
  "papers": [
    {
      "paper_id": "TUZZO01",
      "title": "Characterization of 2.45 GHz ECR Ion Source Bench for Accelerator-Based 14-MeV Neutron Generator",
      "authors": [
        "S.J. Vala",
        "M. Abhangi",
        "M. Bandyopadhyay",
        "R. Kumar",
        "R. Kumar",
        "Institute for Plasma Research",
        "Bhat",
        "Gandhinagar",
        "India",
        "The 2.45 GHz Electron Cyclotron Resonance Ion Source (ECRIS) has been indigenously developed. This development of ECRIS aims to provide high brightness",
        "stable",
        "and reliable D+ ion beam of 20 mA beam current in a continuous (CW) mode operation for an accelerator-based D-T neutron generator. The ECR ion source setup consists of a microwave system",
        "a magnet system",
        "a double wall water-cooled plasma chamber",
        "a high voltage platform",
        "a three-electrode ion extraction system",
        "and a vacuum system. The ECR ion source test setup is installed",
        "and the deuterium plasma is generated. A three-electrode extraction system is designed and fabricated for the ion beam extraction. A ~10 mA deuterium ion beam is extracted from the ECR ion source. The paper covers the detailed experimental setup of ion beam characterization and diagnostics used for measurement of beam profile",
        "beam current",
        "and beam emittance measurements. It also covers the latest results of beam emittance measurements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuzzo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuzzo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuzzo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUZZO01",
      "page_number": "95",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZZO02",
      "title": "Electron Cyclotron Resonance Ion Source Related Research and Development Work at the Department of Physics, University of Jyväskylä (JYFL)",
      "authors": [
        "H.A. Koivisto",
        "B.S. Bhaskar",
        "A. Ikonen",
        "T. Kalvas",
        "S.T. Kosonen",
        "R.J. Kronholm",
        "M.S.P. Marttinenpresenter",
        "O.P.I. Timonen",
        "V. Toivanen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "J. Angot",
        "B.S. Bhaskar",
        "T. Thuillier",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "I. Izotov",
        "V. Skalyga",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "GANIL",
        "Caen",
        "France",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Recent research work of the JYFL ion source team covers multi-diagnostic studies of plasma instabilities",
        "high-resolution plasma optical emission spectroscopy",
        "ion current transient measurements to define the total life-time of a particle in the highly charged plasma. The JYFL team also elaborates the magnetic and technical design of the unconventional ion source named CUBE. The R&D work includes",
        "in addition",
        "the commissioning and operation of the high-performance 18 GHz ECRIS",
        "HIISI. The instability measurements have revealed new information about the parameters affecting the onset of the plasma instabilities and shown that different instability modes exist. The ion-beam transient studies have given information about the cumulative life-time of highly-charged ions convergent with the ion temperatures deduced from the Doppler broadening of emission lines. The CUBE prototype has a minimum-B quadrupole magnetic field topology",
        "similar to ARC-ECRIS",
        "and its all-permanent magnet structure has been optimized for 10 GHz frequency. The CUBE design will be presented along with its commissioning status. The status and operational experience with HIISI will be reported as well."
      ],
      "institutions": [
        "Funding: The work has received funding from the Academy of Finland under the Academy of Finland Project funding (No. 315855) and from University Grenoble Alps under EMERGENCE-project."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuzzo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuzzo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuzzo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUZZO02",
      "page_number": "98",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZZO03",
      "title": "Study on the Correlation between Energy Distribution of Electrons Lost from the Confinement and Plasma Bremsstrahlung on a min-B ECR Plasmas",
      "authors": [
        "B.S. Bhaskar",
        "T. Thuillier",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "B.S. Bhaskar",
        "T. Kalvas",
        "H.A. Koivisto",
        "R.J. Kronholm",
        "M.S.P. Marttinen",
        "O.A. Tarvainen",
        "V. Toivanen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "I. Izotov",
        "V. Skalyga",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The study of plasma bremsstrahlung has been used as a diagnostic tool for understanding the behavior of confined plasma in Electron Cyclotron Resonance Ion Sources (ECRIS). In order to understand the relation connecting the confined plasma and the electrons escaping the confinement",
        "a series of measurements have been made to measure the bremsstrahlung produced in the axial and radial direction along with the Lost Electron Energy Distribution (LEED) axially on JYFL 14 GHz ECR. We present here the effect of various source parameters on the axial and radial bremsstrahlung along with the LEED on a min-B confined ECR plasma. The measured LEED has been found to show a correlation with bremsstrahlung measurement and also have observed as a potential diagnostic method for instability. The explanation for observed LEED and bremsstrahlung trends is provided."
      ],
      "institutions": [
        "Funding: The work has received funding from the Academy of Finland under the Academy of Finland Project funding (No. 315855) and from University Grenoble Alps under EMERGENCE-project."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuzzo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuzzo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuzzo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUZZO03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUZZO04",
      "title": "Status of the 60 GHz ECR Ion Source Research",
      "authors": [
        "T. André",
        "J. Angot",
        "M.A. Baylac",
        "P. Sole",
        "T. Thuillier",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "GHMFL",
        "Grenoble",
        "France",
        "I. Izotov",
        "V. Skalyga",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "SEISM is a compact ECR ion source operating at 60 GHz developed up to 2014. The prototype uses a magnetic cusp to confine the plasma. This simple magnetic geometry was chosen to allow the use of polyhelix coils (developed at the LNCMI",
        "Grenoble) to generate a strong magnetic confinement featuring a closed ECR surface at 2.1 T. The plasma is sustained by a 300 kW microwave pulse of 1 ms duration and with a 2 Hz repetition rate. Previous experiments at LNCMI have successfully demonstrated the establishment of the nominal magnetic field and the extraction of ion beams with a current density up to ~ 1A/cm2. The presence of \"afterglow\" peaks was also observed",
        "proving the existence of ion confinement in a cusp ECR ion source. The last run was prematurely stopped but the project restarted in 2018 and new experiments are planned in 2021. A new transport beam line has been designed to improve ion beam transport towards the beam detectors. Short- and long-term research plans are presented",
        "including numerical simulations of the beam transport line and future upgrades of the ion source with the main goal to transform the high current density measured into a real high intensity ion beam."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuzzo04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuzzo04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuzzo04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUZZO04",
      "page_number": "102",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZZO05",
      "title": "Multi-Species Child-Langmuir Law with Application to ECR Ion Sources",
      "authors": [
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "We generalize the classical single-species Child-Langmuir Law to analyze multi-species beams from ECR ion sources. The formulation assumes the relative weight of each species in the extracted beam is known. We apply the results to charge state distribution data from Artemis- and Venus-type sources at the NSCL and LBNL respectively. The total measured beam current is close to the maximum current predicted by the multi-species Child Langmuir law in each case",
        "which indicates that beam extraction occurs close to space-charge-limited flow conditions. Prospects for application of the results and further studies on the topic are outlined."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuzzo05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuzzo05.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuzzo05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUZZO05",
      "page_number": "106",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZZO06",
      "title": "Beams with Three-Fold Rotational Symmetry: A Theoretical Study",
      "authors": [
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Beams from ECR ion sources have 3-fold transverse rotational symmetry induced by the ECR sextupole. The symmetry imposes equality constraints among transverse beam moments",
        "which can be derived using a theoretical framework we developed. Since the constraints are solely a consequence of the rotational symmetry of external fields",
        "they hold for a multi-species beam with arbitrary composition and space charge intensity. These constraints provide a new tool to analyze phase space properties of ECR beams and their impact on low-energy transport. We prove that",
        "regardless of their triangulated spatial density profile",
        "beams with 3-fold rotational symmetry have the same RMS emittance and Twiss parameters along any transverse direction. These counter-intuitive results are applied to the FRIB Front End to show how symmetry arguments challenge long-standing assumptions and bring clarity to the beam dynamics."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2020/talks/tuzzo06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2020/papers/tuzzo06.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2020/posters/tuzzo06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2020-TUZZO06",
      "page_number": "110",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-10 17:26:38"
}