{
  "session_info": {
    "id": "WECYB",
    "name": "WECYB - Beam Position Monitor Electronics",
    "url": "https://proceedings.jacow.org/IBIC2014/html/wecyb.htm"
  },
  "papers": [
    {
      "paper_id": "WECYB1",
      "title": "Development of a Modified Six-Port Discriminator for Precise Beam Position Measurements",
      "authors": [
        "A. Penirschke",
        "A. Angelovski",
        "M. Hansli",
        "R. Jakoby",
        "T. Mahn",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "* A. Penirschke et al.",
        "Proceedings of"
      ],
      "institutions": [],
      "abstract": "For the European XFEL, new energy beam position monitors based on planar transmission lines were designed for energy measurements in the dispersive section of bunch compressor chicanes. The EBPM consists of transversely mounted stripline pickups in a rectangular beam pipe section and a signal detection scheme which measures the phases of the pulses at the ends of the pickup*. It allows simultaneous measurements of the beam energy and arrival-time. This paper presents the development of a RF readout electronic based on a modified six-port discriminator as a low-cost alternative to the readout electronics based on the MTCA.4 platform for the EBPM. Based on the six-port, the beam position can be determined by means of the phase difference between the received signals from both ends of the transmission line pickup. The six-port discriminator is a linear passive component, first developed in the 70s for accurate measurements of complex reflection coefficients in microwave network analysis**. It typically consists of two hybrid couplers and two power dividers or one Wilkinson power divider and three -3dB hybrid couplers. For the measurement of the difference of two signals excited from a single source one of the hybrid coupler can be omitted. The advantage of the six port is the fact that accurate phase measurements can be performed at microwave and millimeter wave frequencies only by amplitude measurements. This paper shows the principle of operation, developed prototype, and first test results",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/wecyb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/wecyb1.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/wecyb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-WECYB1",
      "page_number": "495",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECYB2",
      "title": "NSLS-II RF Beam Position Monitor Comissioning Update",
      "authors": [
        "J. Mead",
        "A. Caracappa",
        "W.X. Cheng",
        "C. Danneil",
        "J.H. De Long",
        "A.J. Della Penna",
        "K. Ha",
        "B.N. Kosciuk",
        "M.A. Maggipinto",
        "D. Padrazo",
        "B. Podobedov",
        "O. Singh",
        "Y. Tian",
        "K. Vetter",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The National Synchrotron Light Source II (NSLS-II) is a third generation light source currently in the commissioning stage at Brookhaven National Laboratory. The project includes a highly optimized",
        "ultra-low emittance",
        "3GeV electron storage ring",
        "linac pre-injector and full energy booster synchrotron. Successful commissioning of the booster began in November 2012",
        "followed by the ongoing commissioning of the NSLS-II 3GeV electron storage ring which began in March 2014. With those particles first injected",
        "came a value realization of the in-house developed RF Beam Position Monitor (RF BPM). This in-house design knowledge proved to be extremely valuable to match BPM configurations and requirements quickly when needed with various injected beam conditions. The RF BPM system was envisioned and undertaken to meet or exceed the demanding applications of a third generation light source. This internal R&D project has since matured to become a fully realized diagnostic system with over 250 modules currently operational. Initial BPM performance and applications will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/wecyb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/wecyb2.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/wecyb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-WECYB2",
      "page_number": "500",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECYB3",
      "title": "Status of the Sirius RF BPM Electronics",
      "authors": [
        "S.R. Marques",
        "R.A. Baron",
        "G.B.M. Bruno",
        "F.H. Cardoso",
        "L.A. Martins",
        "J.L.B. Neto",
        "L.M. Russo",
        "D.O. Tavares",
        "LNLS",
        "Campinas",
        "Brazil",
        "A modular and open-source RF BPM electronics based on the PICMG(R) MicroTCA.4 and ANSI/VITA 57.1 FMC standards has been developed to be used at Sirius",
        "a 3 GeV low emittance synchrotron light source under construction in Brazil. This paper reports on the latest development advances focusing on bench tests of the second version of the RF front-end and evaluation of the electronics with beam at"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/wecyb3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/wecyb3.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/wecyb3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-WECYB3",
      "page_number": "505",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:57:17"
}