{
  "session_info": {
    "id": "TUZZPLS",
    "name": "TUZZPLS - Contributed Orals: Beam Dynamics and EM Fields",
    "url": "https://proceedings.jacow.org/ipac2019/html/tuzzpls.htm"
  },
  "papers": [
    {
      "paper_id": "TUZZPLS1",
      "title": "Control of the Micro-Bunching Instability in Storage Rings, Using Control of Chaos Strategy  (Theory and Experiment)",
      "authors": [
        "C. Evain",
        "S. Bielawski",
        "E. Rousselpresenter",
        "C. Szwaj",
        "PhLAM/CERLA",
        "Villeneuve d’Ascq",
        "France",
        "J.B. Brubach",
        "N. Hubert",
        "M. Labat",
        "F. Ribeiro",
        "P. Roy",
        "M.-A. Tordeux",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "PhLAM/CERCLA",
        "Villeneuve d’Ascq Cedex",
        "France",
        "We present a new method",
        "inspired by chaos control theory",
        "to master the micro-bunching instability in storage rings *. This instability appears when the bunch current exceeds a threshold value",
        "and is characterized by spontaneous (and usually irregular) apparition of micro-structures in the bunch. We show that a regular state (with regular apparition of micro-structures) can pre-exist in the system",
        "but with unstable properties; and we demonstrate the possibility of stabilizing this state thanks to a low power feedback loop. As a consequence of this method",
        "a modification of less than 0.3% in the system parameters permits to decrease by more than 40 dB the THz fluctuations at the synchrotron SOLEIL (while keeping the coherent emission).",
        "* Coherent Terahertz synchrotron radiation mastered by controlling the irregular dynamics of relativistic electron bunches",
        "C. Evain",
        "et. al.",
        "arXiv:1810.11805 (2018)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/tuzzpls1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/tuzzpls1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/tuzzpls1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-TUZZPLS1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUZZPLS2",
      "title": "Beam Dynamics, Injection and Impedance Studies for the Proposed Single Pulsed Nonlinear Injection Kicker at the Australian Synchrotron",
      "authors": [
        "R. Auchettl",
        "R.T. Dowd",
        "Y.E. Tan",
        "AS - ANSTO",
        "Clayton",
        "Australia",
        "The Australian Synchrotron are currently investigating the use of a single pulsed nonlinear injection kicker (NLK) to free floor space within the ring for future beamline development. The NLK has a zero and flat magnetic field at the stored beam to leave the stored beam undisturbed but has a maximum field off-axis where the injected beam is located. After the kick",
        "the injected beam is stored. While NLKs have been prototyped at many facilities around the world",
        "injection efficiency and heat loading have been the main impediment to deployment of the NLK. The wakefields that pass through the ceramic chamber aperture can cause severe heat loading and impedance. Despite achieving impressive injection efficiencies",
        "a previous prototype at BESSY II * showed that strong interactions of the stored beam resulted in high heat load causing the thin 5µm Titanium coated ceramic chamber to reach temperatures > 500 °C and fail. To avoid beam induced heat loads",
        "this paper presents studies of the wake impedance and thermal behaviour for our proposed NLK design. Injection simulations and future considerations for installation and operation at the Australian Synchrotron will be discussed.",
        "* T. Atkinson et al.",
        "\"Development of a non-linear kicker system to facilitate a new injection scheme for the Bessy II storage ring\"",
        "in Proc. IPAC’11",
        "2011"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/tuzzpls2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/tuzzpls2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/tuzzpls2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-TUZZPLS2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUZZPLS3",
      "title": "New Method of Calculation of the Wake due to Radiation and Space Charge Forces  in Relativistic Beams",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Radiation reaction force in a relativistic beam",
        "also known as a CSR wakefield",
        "is often computed using a 1D model of a line charge beam. While this model can serve as a useful tool for a quick calculation",
        "in some cases",
        "it may not be sufficiently accurate. In particular",
        "this model misses the so-called compression effects associated with the change of the electromagnetic energy when the beam is compressed longitudinally or transversely. The existing 3D simulation codes that take this effect into account are often slow and are not easy to use. In this work",
        "we propose a new approach to the calculations of radiation and space charge longitudinal forces based on the use of the integrals for the retarded potentials. Our main result expresses the rate of change of particles energy through 2D (in a 2D model) or 3D integrals for a given orbit of the beam. It generalizes the 1D model and includes the transient effects of at the entrance and the exit from the magnet. For a given beam line with known magnetic lattice",
        "and a known distribution function of the beam",
        "the calculation reduces to taking 2D or 3D integrals along the orbit."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/tuzzpls3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/tuzzpls3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/tuzzpls3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-TUZZPLS3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:08:34"
}