{
  "session_info": {
    "id": "MOPTEV",
    "name": "MOPTEV - Monday Poster SRF Technologies",
    "url": "https://proceedings.jacow.org/srf2021/html/moptev.htm"
  },
  "papers": [
    {
      "paper_id": "MOPTEV002",
      "title": "Extended Range SRF Cavity Tuner for LCLS II HE Project",
      "authors": [
        "Y.M. Pischalnikov",
        "T.T. Arkan",
        "C.J. Grimm",
        "B.D. Hartsell",
        "J.A. Kaluzny",
        "T.N. Khabiboulline",
        "Y.M. Orlov",
        "J.C. Yun",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The off-frequency detune method is being considered to be applied in the LCLS-II-HE superconducting linac to produce multi-energy electron beams for supporting multiple undulator lines simultaneously. To deliver off-frequency operation (OFO) requirements for SRF cavity tuner must be changed. Tuner design modifications and results of the testing eight cavity/tuner system",
        "deployed in verification cryomodule (vCM)",
        "will be presented."
      ],
      "institutions": [],
      "abstract": "C. Contreras-Martinez",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/moptev002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/moptev002.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/moptev002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPTEV002",
      "page_number": "203",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPTEV005",
      "title": "Commissioning of RF Power Coupler for BISOL R&D Research",
      "authors": [
        "F. Zhu",
        "S.W. Quan",
        "Z.Q. Yao",
        "PKU",
        "Beijing",
        "People’s Republic of China",
        "RF power coupler is a key component of superconducting accelerating system. BISOL (Beijing isotope separation on line type rare ion beam facility) has two superconducting linear accelerators. Half wave resonators (HWRs) are adopted for the high intensity deuteron accelerator",
        "and quarter wave resonators (QWRs) are used to accelerate heavy ions for the post acclerator. For the pre-research of BISOL",
        "we designed a 162.5 MHz RF power coupler which can transmit CW 20 kW power for HWR cavities. It can also transmit 1-5 kW 81.25 MHz power for QWR cavity horizontal test study. A prototype of the coupler has been fabricated and proceeded the high power conditioning."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/moptev005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/moptev005.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/moptev005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPTEV005",
      "page_number": "208",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPTEV006",
      "title": "Synchrotron XPS Study of Niobium Treated with Nitrogen Infusion",
      "authors": [
        "A.L. Prudnikava",
        "J. Knobloch",
        "O. Kugeler",
        "Y. Tamashevich",
        "HZB",
        "Berlin",
        "Germany",
        "V. Aristov",
        "O. Molodtsova",
        "DESY",
        "Hamburg",
        "Germany",
        "LIDYL",
        "Gif sur Yvette",
        "France",
        "FUB",
        "Berlin",
        "Germany",
        "Technische Universität Dresden",
        "Dresden",
        "Germany",
        "Processing of niobium cavities with the so-called ni-trogen infusion treatment demonstrates the improve-ment of efficiency and no degradation of maximal accelerating gradients. However",
        "the chemical compo-sition of the niobium surface and especially the role of nitrogen gas in this treatment has been the topic of many debates. While our study of the infused niobium using synchrotron X-ray Photoelectron Spectroscopy (XPS) showed modification of the surface sub-oxides surprisingly there was no evidence of nitrogen con-centration build up during the 120°C baking step",
        "irre-spectively of N2 supply. Noteworthy",
        "that the niobium contamination with carbon and nitrogen took place during a prolonged high-temperature anneal even in a high vacuum condition (10-8-10-9 mbar). Evidently",
        "the amount of such contamination appears to play a key role in the final cavity performance"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/moptev006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/moptev006.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/moptev006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPTEV006",
      "page_number": "211",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPTEV007",
      "title": "RF Conditioning of 120 kW CW 1.3 GHz High Power Couplers for the bERLinPro Energy Recovery Linac",
      "authors": [
        "A. Neumann",
        "W. Anders",
        "A. Frahm",
        "F. Göbel",
        "A. Heugel",
        "S. Klauke",
        "J. Knobloch",
        "M. Schuster",
        "Y. Tamashevich",
        "HZB",
        "Berlin",
        "Germany",
        "This year",
        "the commissioning of the 50 MeV",
        "100 mA bERLinPro Energy Recovery Linac test facility [1] will resume. For the Booster cryo-module of the injector line",
        "operated with three modified 1.3 GHz Cornell style 2-cell SRF cavities",
        "a new type of power coupler was developed",
        "based on KEK’s C-ERL injector coupler. Modifications were made for a stronger coupling and lower emittance diluting coupler tip variant",
        "a so-called \"Golf Tee\" shape and the cooling concept was redesigned based on KEK’s first experiences. For the final stage",
        "the injector needs to deliver a low emittance beam of 100 mA average beam current at 6.5 MeV. That results in a traveling and continuous wave forward power requirement of up to 120 kW each of the twin setup feeding one Booster cavity. In this contribution we will give a short overview of the RF design and its impact on the beam’s emittance",
        "give an overview of the conditioning teststand and the results achieved with the first pairs of couplers."
      ],
      "institutions": [],
      "abstract": "[1] M. Abo-Bakr et al., in Proc. 9th Int. Particle Accelerator Conf. (IPAC’18), Vancouver, BC, Canada, Apr. 4,, pp. 4127-4130, doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/moptev007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/moptev007.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/moptev007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPTEV007",
      "page_number": "216",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPTEV009",
      "title": "A Method for In-Situ Q₀ Measurements of High-Quality SRF Resonators",
      "authors": [
        "S.V. Kuzikov",
        "P.V. Avrakhov",
        "C.-J. Jing",
        "R.A. Kostin",
        "Y. Zhao",
        "Euclid TechLabs",
        "Solon",
        "Ohio",
        "USA",
        "C.-J. Jing",
        "C.-J. Jing",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "C.-J. Jing",
        "R.A. Kostin",
        "Euclid Beamlabs",
        "Bolingbrook",
        "USA",
        "R.A. Kostin",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "T. Powers",
        "R.A. Rimmer",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Accelerator projects such as LCLS-II naturally require low-loss superconducting (SRF) cavities. Due to strong demand for improving intrinsic quality factor (Q0)",
        "importance of accurate cavity characterization increases. We propose a method to measure Q0 in situ for an SRF resonator installed in its cryogenic module and connected with a RF feed source via a fixed RF coupler. The method exploits measurements of a response for an SRF resonator fed by an amplitude-modulated signal. Such a signal can be synthesized as a beat-wave composed of two frequencies that are close to the resonant frequency. Analyzing the envelope of the reflected signal",
        "one can find the difference in reflection for the chosen frequencies and use them to compute the intrinsic Q. We also develop the methodology to carry out measurements of Q0 at the nominal cavity operating voltage. We verified our method in experiments with a room temperature copper resonator and with two SRF resonators including Fermilab’s 650 MHz cavity and JLab’s 1500 MHz cavity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/moptev009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/moptev009.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/moptev009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPTEV009",
      "page_number": "221",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPTEV010",
      "title": "RF System Experience for FRIB Half Wave Resonators",
      "authors": [
        "S. Zhao",
        "W. Chang",
        "E. Daykin",
        "E. Gutierrez",
        "S.H. Kim",
        "S.R. Kunjir",
        "T.L. Larter",
        "D.G. Morris",
        "J.T. Popielarski",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The installation and commissioning of the FRIB superconducting linac adopts a phased strategy. In SRF’19 we reported the progress on the commissioning of the linear segment 1 (LS1) which contains mainly the quarter wave resonators (QWRs). In this paper",
        "we will report the recent progress on the commissioning of the remainder of the linac",
        "including linear segment 2 (LS2)",
        "folding segment 2 (FS2) and linear segment 3 (LS3)",
        "focusing on the RF system experience for the half wave resonators (HWRs). Compared to the QWRs",
        "the HWRs have a different type of tuner",
        "run at higher power levels and have additional components (for example",
        "high voltage bias tee for multipacting suppression and spark detector). Topics such as nonlinear tuner control for the pneumatic tuners; auto turn on/off implementation; and early issues and failures will be discussed in more detail."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/moptev010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/moptev010.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/moptev010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPTEV010",
      "page_number": "226",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPTEV012",
      "title": "Extra-Cold EP Process at Fermilab",
      "authors": [
        "F. Furuta",
        "D.J. Bice",
        "M. Martinello",
        "T.J. Ring",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "FNAL has established a cold Electro-Polishing (EP) method which maintains the outer surface temperature of cavity cell around 12~15°C during EP process. Cold EP has been applied on the various SRF cavities and contributed to achieve high RF performances with them. To investigate more feasibility and capability of EP at lower temperature",
        "the FNAL EP temperature control tool was recently improved. Extra-cold EP process below 0°C at cavity cell region was successfully performed on 1.3 GHz 1-cell cavity. A compatible RF performance with cold EP method was also demonstrated during the cavity vertical testing. The details of extra-cold EP process and the cavity test results will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/moptev012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/moptev012.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/moptev012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPTEV012",
      "page_number": "230",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPTEV013",
      "title": "The VSR Demo Module Design – A Spaceframe-Based Module for Cavities with Warm Waveguide HOM Absorbers",
      "authors": [
        "F. Glöckner",
        "D. Böhlick",
        "M. Bürger",
        "V. Dürr",
        "A. Frahm",
        "J. Knobloch",
        "F. Pflocksch",
        "A. Veléz",
        "D. Wolk",
        "N. Wunderer",
        "HZB",
        "Berlin",
        "Germany",
        "The VSR (Variable pulse length Storage Ring) demo module is a prototype for the superconducting upgrade of HZB’s Bessy II. The module houses two 1.5 GHz superconducting cavities operated at 1.8 K in continuous wave (CW) mode. Each cavity has five water cooled Waveguide HOM Absorbers with high thermal load (450 W)",
        "which requires them to be water cooled. This setup introduces several design challenges",
        "concerning space restriction",
        "the interconnection of warm and cold parts and the alignment. In order to provide support and steady alignment an innovative space frame was designed. The transition from cold to warm over the partially superconducting waveguides made a more complex design for shielding and cooling system necessary. With the design close to completion",
        "we are now entering the purchase phase."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/moptev013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/moptev013.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/moptev013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPTEV013",
      "page_number": "233",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPTEV014",
      "title": "New Improved Horizontal Electropolishing System for SRF Cavities",
      "authors": [
        "C.E. Reece",
        "S. Castagnola",
        "P. Denny",
        "A.L.A. Mitchell",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The best performance of niobium SRF accelerating cavities is obtained with surfaces smoothed with electropolishing chemical finishing. Jefferson Lab has recently specified",
        "procured",
        "installed",
        "and commissioned a new versatile production electropolishing (EP) tool. Experience with EP research and operations at JLab as well as vendor interactions and experience guided development of the system specification. Detailed design and fabrication was awarded by contract to Semiconductor Process Equipment Corporation (SPEC). The delivered system was integrated into the JLab chemroom infrastructure and commissioned in 2020. The new EP tool provides much improved heat exchange from the circulating H2SO4/HF electrolyte and also the cavity via variable temperature external cooling water flow",
        "resulting in quite uniform cavity wall temperature control and thus improved removal uniformity. With the JLab infrastructure",
        "stabilized process temperature as low as 5 C is available. We describe the system and illustrate operational modes in this contribution."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/moptev014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/moptev014.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/moptev014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPTEV014",
      "page_number": "237",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPTEV015",
      "title": "Spoke Tuner for the Minerva Project",
      "authors": [
        "N. Gandolfo",
        "S. Blivet",
        "P. Duchesne",
        "D. Le Dréan",
        "Université Paris-Saclay",
        "CNRS/IN2P3",
        "IJCLab",
        "Orsay",
        "France",
        "In the framework of the MINERVA construction (MYRRHA Isotopes productioN coupling the linEar acceleRator to the Versatile proton target fAcility)",
        "a fully equipped prototype cryomodule is being developed. In order to control the resonance frequency of the cavities during operation",
        "a deformation tuner has been studied. The kinematic model is based on a double lever system coupled with a screw nut linear actuator. The motion is generated by a stepper motor and two piezoelectric actuators working at low temperatures within the thermal insulation vacuum of the cryomodule. Key parameter of this work is the high tuning speed which is required to fulfill the fault tolerance strategy. This paper reports the design study and first tests of the built tuners at room temperature and in vertical cryostat configuration."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/moptev015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/moptev015.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/moptev015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPTEV015",
      "page_number": "241",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPTEV017",
      "title": "Development and Operation of PIP-II Injector Test, SSR1 Cryomodule, 325 MHz Amplifiers",
      "authors": [
        "J. Steimel",
        "V.M. Grzelak",
        "D.W. Peterson",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "V.R. Bala",
        "S.K. Bharade",
        "G. Joshi",
        "R. Keshwani",
        "J.K. Mishra",
        "M.M. Pande",
        "S. Shrotriya",
        "H. Shukla",
        "S. Singh",
        "C.I. Sujo",
        "BARC",
        "Mumbai",
        "India",
        "D. Balakrishna",
        "N. Chikte",
        "S. Dubey",
        "C. G",
        "V. Gollapalli",
        "J. K Chandra",
        "V. Kumar",
        "M. M",
        "A. Maheshwari",
        "S.N. Nagaratnam",
        "G. Poornima",
        "T.V.S. Thalluri",
        "ECIL",
        "Hyderabad",
        "India",
        "The PIP-II Injector Test (PIP2IT) has successfully accelerated ionized hydrogen up to 17MeV through a superconducting",
        "single spoke resonator (SSR1) cryomodule at Fermi National Accelerator Laboratory (FNAL). Each of the SSR1 cavities is tuned to 325MHz and requires up to 6 kW of RF power to accelerate 2mA of ionized hydrogen at the design gradients. RF power amplifiers",
        "specialized for SRF cavity beam operations",
        "were designed by Bhabha Atomic Research Center (BARC) and constructed in a collaboration between the BARC in Mumbai",
        "India and the Electronics Corporation of India Limited (ECIL) in Hyderabad",
        "India. The RF amplifiers meet the specifications and requirements mutually approved between BARC and FNAL. They operate at 325 MHz with a linear power output of 7 kW in both CW and pulse mode. The amplifiers are compatible with the FNAL accelerator personnel safety system and the cavity protection interlocks. Access to controls and internal diagnostic instrumentation are compatible with EPICS control standards. This paper gives details about RF power amplifier development within the Department of Atomic Energy (DAE)",
        "India and the operational details with PIP2IT at FNAL."
      ],
      "institutions": [
        "Funding: 1Fermilab, U.S.Department of Energy 2 Bhabha Atomic Research Centre, Department of Atomic Energy, Government of India 3 Electronic Corporation of India, Department of Atomic Energy, Government of India"
      ],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/moptev017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/moptev017.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/moptev017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-MOPTEV017",
      "page_number": "245",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 11,
  "scrape_time": "2025-10-11 03:01:22"
}