{
  "session_info": {
    "id": "WEIO",
    "name": "WEIO - Wednesday Keynote and Invited oral",
    "url": "https://proceedings.jacow.org/medsi2020/html/weio.htm"
  },
  "papers": [
    {
      "paper_id": "WEIO01",
      "title": "The Extremely Brilliant Source (EBS) Project",
      "authors": [
        "ESRF",
        "Grenoble",
        "France",
        "The EBS project required the shutdown and dismantling of the existing storage ring",
        "and the design",
        "construction",
        "and installation of a new synchrotron source in a limited period with minimal disruption to the ongoing user program. From 2015 to 2018",
        "in addition to keeping the existing accelerator operational more than 1",
        "000 magnets",
        "900 m of vacuum chambers",
        "and several thousand other components were designed",
        "procured",
        "and pre-assembled. On December 10",
        "2018",
        "ESRF stopped the beam of the original accelerator for just 17 months to dismantle the existing accelerator",
        "install and commission the new one",
        "before the start of beamlines program at the end of August 2020. The EBS produced its first stored beam as scheduled",
        "thanks to ESRF staff and international teams who have worked tirelessly to make this possible. One of the major challenges of this upgrade program was to replace these 32 cells",
        "within the existing infrastructure",
        "by new ones whose magnet density made engineering much more complicated. The new ring comprises over 10 000 components",
        "each precision-aligned to within 50 microns over the storage ring length. The timing of different activities and the coordination of teams during all phases was another challenge",
        "but the expertise",
        "team spirit",
        "commitment and responsiveness of teams and management to deal with unforeseen situations or technical problems greatly contributed to the success of the project. After such a project",
        "several lessons are to be learned",
        "first it is necessary to capitalize on all the positive aspects",
        "then technical issues needs to be analyzed",
        "in order to keep the knowledge and expertise. This presentation will cover the different phases of the project by highlighting the difficulties encountered and the lessons to be learned."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/weio01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/weio01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/weio01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEIO01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEIO02",
      "title": "LCLS Chemrix in-Vacuum Liquid Sample Delivery System",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "In the past decade",
        "LCLS has been using in-vacuum liquid jet to deliver nanocrystals",
        "microcrystals or other samples to the experimental station. Recently",
        "LCLS has developed a new type of liquid jet",
        "known as \"sheet\"-jet",
        "with tunable thickness from little over than 1µm to 20nm. This new type jet greatly reduces the x-ray absorbed by the liquid solutions",
        "especially for soft x-ray and tender x-ray applications. In the first part of presentation",
        "the author will describe the optimization processes of such jets using computational fluid dynamics (CFD) tool. The second part will describe the development of the liquid jet sample delivery system for chemRIXS in LCLS. The chemRIXS endstation has been designed in a way it can take both solid and liquid samples. Because solid sample experiments require a UHV environment",
        "to be able to deliver the liquid sample jets to the same vacuum chamber",
        "a special loadlock chamber and sample transport system have been developed to isolate the liquid system from the main vacuum chamber. When solid sample system is extracted",
        "a fully automated system can then drive the liquid jet to the sample/beam interaction point. A recirculation catcher will collect the liquid waste",
        "so the chamber can remain at high vacuum."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/weio02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/weio02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/weio02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEIO02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 23:27:23"
}