{
  "session_info": {
    "id": "WEPLE",
    "name": "WEPLE - Wednesday Poster Session-Lake Erie",
    "url": "https://proceedings.jacow.org/napac2019/html/weple.htm"
  },
  "papers": [
    {
      "paper_id": "WEPLE02",
      "title": "Integrated Accelerator Simulation with Electromagnetics and Beam Physics Codes",
      "authors": [
        "L. Ge",
        "Z. Lipresenter",
        "C.-K. Ng",
        "L. Xiao",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "D.A. Bizzozero",
        "J. Qiang",
        "J.-L. Vay",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "This paper presents an integrated simulation capability for accelerators including electromagnetic field and beam dynamics effects. The integrated codes include the parallel finite-element code suite ACE3P for electromagnetic field calculation of beamline components",
        "the parallel particle-in-cell (PIC) code IMPACT for beamline particle tracking with space-charge effects",
        "and the parallel self-consistent PIC code Warp for beam and plasma simulations. The common data format OpenPMD has been adopted for efficient field and particle I/O data transfer between codes. One application is to employ ACE3P and IMPACT for studying beam qualities in accelerator beamlines. Another is to combine ACE3P and Warp for investigating plasma processing for operational performance of RF cavities. A module for mapping the CAD geometry used in ACE3P to Warp Cartesian grid representation has been developed. Furthermore",
        "a workflow has been implemented that enables the execution of integrated simulation on HPC systems. Examples for simulation of the LCLS-II injector using ACE3P-IMPACT and plasma ignition in SRF cavities using ACE3P-Warp will be presented."
      ],
      "institutions": [
        "Funding: Work supported by US Department of Energy under contracts AC02-76SF00515, DE-AC02-05CH11231 and DE-AC52-07NA27344. Used resources of the National Energy Research Scientific Computing Center."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weple02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weple02.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weple02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEPLE02",
      "page_number": "885",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPLE04",
      "title": "Recent Developments and Applications of Parallel Multi-Physics Accelerator Modeling Suite ACE3P",
      "authors": [
        "Z. Li",
        "L. Ge",
        "C.-K. Ng",
        "L. Xiao",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "SLAC’s ACE3P code suite is developed to harness the power of massively parallel computers to tackle large complex problems with increased memory and solve them at greater speed. ACE3P parallel multi-physics codes are based on higher-order finite elements for superior geometry fidelity and better solution accuracy. ACE3P consists of an integrated set of electromagnetic",
        "thermal and mechanical solvers for accelerator modeling and virtual prototyping. The use of ACE3P has contributed to the design and optimization of existing and future accelerator projects around the world. Multi-physics analysis on high performance computing (HPC) platform enables thermal-mechanical simulations of largescale systems such as the LCLS-II cryomodule. Recently",
        "new capabilities have been added to ACE3P including a nonlinear eigenvalue solver for calculating mode damping",
        "a moving window for pulse propagation in the time domain to reduce computational cost",
        "thin layer coating representation using a surface impedance model",
        "and improved boundary conditions using perfectly matched layers (PML) to terminate wave propagation. These new developments are presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weple04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weple04.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weple04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEPLE04",
      "page_number": "888",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPLE05",
      "title": "Tracking With Space Harmonics in ELEGANT Code",
      "authors": [
        "Y.P. Sun",
        "C. Yao",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "The elegant code has the capability of simulating particle motion in accelerating or deflecting RF cavities",
        "with a simplified (or ideal) model of the electromagnetic fields. To improve the accuracy of RF cavity simulations",
        "the ability to track with space harmonics has been added to the elegant code. The sum of all the space harmonics will mimic the real electromagnetic fields in the RF cavity. These space harmonics will be derived from electromagnetic fields simulation of the RF cavity. This method should be general",
        "which can be applied to any RF cavity structure",
        "including accelerating and deflecting cavities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weple05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weple05.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weple05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEPLE05",
      "page_number": "892",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPLE06",
      "title": "Linear and Second Order Map Tracking with Artificial Neural Network",
      "authors": [
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "In particle accelerators",
        "the tracking simulation is usually performed with symplectic integration",
        "or linear/nonlinear transfer maps. In this paper",
        "it is shown that the linear/nonlinear transfer maps may be represented by an artificial neural network. To solve this multivariate regression problem",
        "both random datasets and structured datasets are explored to train the neural networks. The achieved accuracy will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weple06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weple06.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weple06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEPLE06",
      "page_number": "895",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPLE07",
      "title": "Transfer Matrix Classification with Artificial Neural Network",
      "authors": [
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Standard neural network algorithms are developed for classification and regression applications. In this paper",
        "the details of the neural network algorithms are presented",
        "together with several applications. Artificial neural network is trained to classify multi-class transfer matrix of different types of particle accelerator components. It is shown that with a fully-connected feedforward neural network",
        "it is possible to get high accuracy of 99% on training data",
        "validation data and test data."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weple07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weple07.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weple07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEPLE07",
      "page_number": "898",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPLE08",
      "title": "Parallel Tracking-Based Modeling of Gas Scattering and Loss Distributions in Electron Storage Rings",
      "authors": [
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Estimation of gas scattering lifetimes in storage rings is typically done using a simple approach that can readily be performed by hand. A more sophisticated approach uses linear mapping of the angular dynamic acceptance around the ring and allows including variation of gas pressure and composition*. However",
        "neither approach is appropriate for highly nonlinear lattices",
        "in which the angular acceptance does not map according to the linear optics. Further",
        "these approaches provide no detailed information about the location of losses. To address these limitations",
        "a tracking-based approach was implemented in the program Pelegant**. We describe the implementation and performance of this method",
        "as well as several applications to the Advanced Photon Source Upgrade.",
        "* M. Borland",
        "J. Carter",
        "H. Cease",
        "and B. Stillwell",
        "Proc. IPAC 2015",
        "546. ** Y. Wang and M. Borland",
        "AIP Conf. Proc. 877",
        "241 (2006)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weple08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weple08.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weple08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEPLE08",
      "page_number": "901",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPLE09",
      "title": "Mitigation of Nonlinear Phase Space in a Space-Charge-Limited Injector Diode",
      "authors": [
        "W.D. Stem",
        "Y.-J. Chen",
        "J. Ellsworth",
        "LLNL",
        "Livermore",
        "USA",
        "The performance of an accelerator is limited by the quality of the beam produced at the injector. For a Pierce-type diode structure",
        "the cathode-shroud interface and the anode pipe entrance are sources for undesired",
        "irreversible phase space nonlinearities that lead to emittance growth. In this contribution",
        "we present ways to mitigate these nonlinearities by adjusting the cathode-shroud interface to meet the beam edge boundary conditions and by adjusting the solenoidal focusing magnet in the diode region such that the nonlinear focusing magnetic fringe fields compensate the nonlinear defocusing electrical fields of the anode pipe entrance."
      ],
      "institutions": [
        "Funding: This work was performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weple09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weple09.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weple09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEPLE09",
      "page_number": "905",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPLE10",
      "title": "Simulating Space Charge Dominated Beam Dynamics Using FMM",
      "authors": [
        "S.A. Schmid",
        "H. De Gersem",
        "E. Gjonaj",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "DESY",
        "Hamburg",
        "Germany",
        "In this contribution",
        "we simulate the beam generation in the high brilliance photoinjector of the European XFEL developed at DESY-PITZ. The investigation addresses the influence of space charge on the emittance of bunches with up to 1.0 nC bunch charge. For the simulations",
        "we implemented a mesh-less fast multipole method (FMM) in the 3D tracking code REPTIL. We present numerical convergence and performance studies as well as a validation with commonly used simulation tools ASTRA and"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/weple10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/weple10.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/weple10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-WEPLE10",
      "page_number": "909",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 8,
  "scrape_time": "2025-10-11 01:02:01"
}