{
  "session_info": {
    "id": "MOZE",
    "name": "MOZE - Advanced Acceleration",
    "url": "https://proceedings.jacow.org/napac2022/html/moze.htm"
  },
  "papers": [
    {
      "paper_id": "MOZE1",
      "title": "Demonstration of High-Gradient in a Cryo-Cooled X-Band Structure",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "We present an experimental demonstration of the high-gradient operation of an X-band",
        "11.424 GHz",
        "20-cells linear accelerator (linac) operating at a liquid nitrogen temperature of 77 K. The tested linac was previously processed and tested at room temperature. Low-temperature operation increases the yield strength of the accelerator material and reduces surface resistance",
        "hence a great reduction in cyclic fatigue could be achieved resulting in a large reduction in breakdown rates compared to room- temperature operation. Furthermore",
        "temperature reduction increases the intrinsic quality factor of the accelerating cavities",
        "and consequently",
        "the shunt impedance leading to increased RF-to-beam efficiency and beam loading capabilities. We verified the enhanced accelerating parameters of the tested accelerator at cryogenic temperature using different measurements including electron beam acceleration up to a gradient of 150 MV/m",
        "corresponding to a peak surface electric field of 375 MV/m. We also measured the breakdown rates in the tested structure showing a reduction of 2 orders of magnitude compared to their values at room temperature for the same accelerating gradient."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/moze1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/moze1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/moze1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOZE1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOZE2",
      "title": "Results of Awake Run 1 and Plans for Run 2 Towards HEP Applications",
      "authors": [
        "CERN",
        "Meyrin",
        "Switzerland"
      ],
      "institutions": [
        "The high accelerating gradient that plasma wakefield can produce make it a an interesting technology for next generation of particle accelerators. The AWAKE experi-ment at CERN demonstrated during Run1 that thanks to the process of self-modulation an high energy (400 GeV) long (10 cm) proton bunch drive intense wakefield in plasma. Externally injected electrons were successfully accelerated to 2 GeV in a 10m plasma. The main aims of the AWAKE Run 2 phase are to demonstrate that a con-trolled self-modulation process can lead to stable acceler-ating gradient up to 1 GV/m preserving the emittance of injected electron bunches and to be scalable to plasma sources of 100s of meters and beyond for high energy. The AWAKE scheme aim to provide electron beams for particle physics experiments by the end of the Run2 phase. This contribution reports the main achievement of Run1 and summarises the programme of AWAKE Run 2 including possible applications of the AWAKE scheme to novel particle physics experiments."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/moze2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/moze2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/moze2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOZE2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOZE3",
      "title": "Emittance Measurements and Simulations from an X-Band Short-Pulse Ultra-High Gradient Photoinjector",
      "authors": [
        "G. Chen",
        "D.S. Doran",
        "C.-J. Jing",
        "S.Y. Kim",
        "W. Liu",
        "W. Liu",
        "P. Piot",
        "J.G. Power",
        "C. Whiteford",
        "E.E. Wisniewski",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "C.-J. Jing",
        "E.W. Knight",
        "S.V. Kuzikov",
        "Euclid TechLabs",
        "Solon",
        "Ohio",
        "USA",
        "Euclid Beamlabs",
        "Bolingbrook",
        "USA",
        "X. Lu",
        "P. Piot",
        "W.H. Tan",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "A program is under way at the Argonne Wakefield Accelerator facility",
        "in collaboration with the Euclid Techlabs and Northern Illinois University (NIU)",
        "to develop a GeV/m scale photocathode gun",
        "with the ultimate goal of demonstrating a high-brightness photoinjector beamline. The novel X-band photoemission gun (Xgun) is powered by high-power",
        "short RF pulses",
        "9-ns (FWHM)",
        "which",
        "in turn",
        "are generated by the AWA drive beam. In a previous proof-of-principle experiment",
        "an unprecedented 400~MV/m gradient on the photocathode surface* was demonstrated. In the current version of the experiment",
        "we added a linac to the beamline to increase the total energy and gain experience tuning the beamline. In this paper",
        "we report on the very first result of emittance measurement as well as several other beam parameters. This preliminary investigation has identified several factors to be improved on in order to achieve one of the ultimate goals; low emittance.",
        "* W. H. Tan et al.",
        "\"Demonstration of sub-GV/m Accelerating Field in a Photoemission Electron Gun Powered by Nanosecond X-Band Radiofrequency Pulses\"",
        "2022. arXiv:2203.11598v1"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/moze3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/moze3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/moze3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOZE3",
      "page_number": "45",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOZE4",
      "title": "Ceramic Enhanced Accelerator Structure Low Power Test and Designs of High Power and Beam Tests",
      "authors": [
        "H. Xu",
        "M.R. Bradley",
        "L.D. Duffy",
        "M.A. Holloway",
        "J. Upadhyay",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "A ceramic enhanced accelerator structure (CEAS) uses a concentric ceramic ring placed inside a metallic pillbox cavity to significantly increase the shunt impedance of the cavity. Single cell standing wave CEAS cavities are designed",
        "built",
        "and tested at low power at 5.1 GHz. The results indicate 40% increase in shunt impedance compared to that of a purely metallic pillbox cavity. A beam test setup has been designed to use a single cell CEAS cavity to modulate a 30-keV direct-current (DC) electron beam at an accelerating gradient of 1 to 2 MV/m to verify the beam acceleration capability of the CEAS concept and to study the potential charging effect on the ceramic component during the operation. Another single cell standing wave CEAS cavity has been designed for high power test at 5.7 GHz for the high accelerating gradient capability."
      ],
      "institutions": [
        "Funding: Research was supported by the Laboratory Directed Research and Development program of Los Alamos National Laboratory, under project number 20210083ER."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/moze4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/moze4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/moze4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOZE4",
      "page_number": "49",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOZE5",
      "title": "Simulation and Experimental Results of Dielectric Disk Accelerating Structures",
      "authors": [
        "S. Weatherly",
        "E.E. Wisniewski",
        "Illinois Institute of Technology",
        "Chicago",
        "Illinois",
        "USA",
        "D.S. Doran",
        "C.-J. Jing",
        "J.F. Power",
        "E.E. Wisniewski",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "B.T. Freemire",
        "C.-J. Jing",
        "Euclid Beamlabs",
        "Bolingbrook",
        "USA"
      ],
      "institutions": [
        "A method of decreasing the required footprint of linear accelerators and improving their energy efficiency is to employ Dielectric Disk Accelerators (DDAs) with short RF pulses ( ∼  9 ns). A DDA is an accelerating structure that utilizes dielectric disks to improve the shunt impedance. Two DDA structures have been designed and tested at the Argonne Wakefield Accelerator. A single cell clamped DDA structure recently achieved an accelerating gradient of 1{02} MV/m. A multi-cell clamped DDA structure has been designed and is being fabricated. Simulation results for this new structure show a 1{08} MV/m accelerating gradient with 400 MW of input power with a high shunt impedance and group velocity. The engineering design has been improved from the single cell structure to ensure consistent clamping over the entire structure."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/moze5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/moze5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/moze5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOZE5",
      "page_number": "52",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOZE6",
      "title": "Fulfilling the Mission of Brookhaven ATF as a DOE Flagship User Facility in Accelerator Stewardship",
      "authors": [
        "I. Pogorelsky",
        "M. Babzien",
        "M.G. Fedurin",
        "R. Kupfer",
        "M.A. Palmerpresenter",
        "M.N. Polyanskiy",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "Stony Brook University",
        "Stony Brook",
        "USA",
        "Over last three decades",
        "BNL Accelerator Test Facility (ATF) pioneered the concept of a proposal-based user facility for lasers and electron beam-driven advanced accelerator research (AAR). This has made ATF an internationally recognized destination for researchers who benefit from access to unique scientific capabilities not otherwise available to individual institutions and businesses. Operating as an Office of Science National User Facility and a flagship DOE facility in Accelerator R&D Stewardship",
        "ATF pursues an ambitious upgrade plan for its lasers and electron beam infrastructure to enable experiments at the forefront of the AAR. In this talk",
        "we will present our path towards attaining a novel multi-terawatt sub-picosecond regime with a long-wave IR 9-um laser. Future enhancements to the electron beam and near-IR laser capabilities will also be presented. The combination of linac- and laser-driven e-beams will empower a unique state-of-the-art science program. This includes integrated multi-beam research in laser wakefield accelerators",
        "such as the two-color ionization injection",
        "with the promise of an all-optical scheme for generating collider-quality electrons beams."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/moze6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/moze6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/moze6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-MOZE6",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:10:35"
}