{
  "session_info": {
    "id": "WEPC",
    "name": "WEPC - Wednesday Poster PM Session C",
    "url": "https://proceedings.jacow.org/medsi2020/html/wepc.htm"
  },
  "papers": [
    {
      "paper_id": "WEPC01",
      "title": "Robotic Sample Changer for Remote and Mail-In In Situ X-ray Scattering Experiments and Adjustable Beam Attenuation System",
      "authors": [
        "B.L. Monk",
        "A.A. Yakovenko",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "The COVID-19 pandemic has resulted in a highly increased need for remote beamline operations. Usually",
        "in situ X-ray scattering experiments require significant onsite user and beamline staff presence",
        "making them difficult and often impractical during limited operations. One of the major problems was the switching of capillary samples for in situ heating/cooling experiments. Therefore",
        "we developed a specialized robotic system for changing samples utilizing easily accessible standardized parts and 3-D printing. The first version of this design is fully operational and has been installed at the 17-BM beamline. This system allows for changing between 14 capillary based samples by using three stepper motor based translational stages and pneumatic gripper. The destination can be intercrossed with hot or cold air blower stream",
        "allowing users to remotely collect X-ray powder diffraction data from multiple samples at various temperatures. Currently",
        "we are working on the development of a second robotic system",
        "which will fit entirely onto one breadboard. This will allow us to move the system from one beamline to another if needed. The second piece of instrumentation we have developed is a remotely operated beam attenuation system with adjustable attenuation level. The system uses electric solenoids that push tantalum foils in and out of the beam. Five solenoids each hold different numbers of foils",
        "and can be controlled independently",
        "allowing for a total of 32 unique attenuation levels. A 6th solenoid holds a beamstop which can be used as a fast shutter. The control and communication is performed by an Arduino Yun microcontroller. All structural parts were 3-D printed",
        "making for a cost-effective alternative to systems currently on the market.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepc01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepc01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepc01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPC01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPC02",
      "title": "A Cryogenic Sample Environment for the TARUMÃ Station at the CARNAÚBA Beamline at Sirius/LNLS",
      "authors": [
        "F.R. Lena",
        "C.S.N.C. Bueno",
        "F.H. Cardoso",
        "J.C. Carvalho",
        "M.M. Donatti",
        "R.R. Geraldes",
        "L.M. Kofukuda",
        "L.S. Perissinotto",
        "E. Piragibe",
        "C. Sato",
        "H.C.N. Tolentino",
        "W.H. Wilendorf",
        "LNLS",
        "Campinas",
        "Brazil",
        "TARUMÃ is the sub-microprobe station of CAR-NAÚBA (Coherent X-Ray Nanoprobe Beamline) at Sirius at the Brazilian Synchrotron Light Laboratory (LNLS). Covering the tender-to-hard energy range from 2.05 to 15 keV with achromatic fixed-shape optics",
        "the fully coherent submicron focused beam can be used for multiple simultaneous advancedμand nanoscale X-ray techniques that include ptychography coherent diffraction imaging (ptycho-CDI)",
        "absorption spectroscopy (XAS)",
        "diffraction (XRD)",
        "fluorescence (XRF) and luminescence (XEOL). Among the broad range of materials of interest",
        "studies of light elements present in soft tissues and other biological systems put TARUMÃ in a unique position in the Life and Environmental Sciences program at LNLS. Yet",
        "to mitigate the detrimental effect of the high photon flux of the focused beam due to radiation damage",
        "cryocooling may be required. Here we present the design and first results of a novel open-atmosphere cryogenic system for online sample conditioning down to 110 K. The high-stiffness and thermally-stable sample holder follows the predictive design approach based on precision engineering principles to preserve the nanometer-level positioning requirements",
        "whereas a commercial nitrogen blower is used with a cold gas flow exhaustion system that has been developed in order to avoid unwanted cooling of surrounding parts and water condensation or icing."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepc02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepc02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepc02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPC02",
      "page_number": "306",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPC03",
      "title": "Electrochemistry and Microfluidic Environments for the TARUMÃ Station at the CARNAÚBA Beamline at Sirius/LNLS",
      "authors": [
        "W.H. Wilendorf",
        "R.R. Geraldes",
        "L.M. Kofukuda",
        "I.T. Neckel",
        "H.C.N. Tolentino",
        "LNLS",
        "Campinas",
        "Brazil",
        "UNICAMP",
        "Campinas",
        "São Paulo",
        "Brazil",
        "CARNAÚBA (Coherent X-Ray Nanoprobe Beamline) is a state-of-the-art multi-technique beamline at the 4th-generation Sirius Light Source at the Brazilian Synchrotron Light Laboratory (LNLS)",
        "with achromatic optics and fully-coherent X-ray beam in the energy range between 2.05 and 15 keV. At the TARUMÃ station",
        "the in-vacuum KB focusing system has been designed with a large working distance of 440 mm",
        "allowing for a broad range of independent sample environments to be developed in open atmosphere to benefit from the spot size between 550 to 120 nm with a flux in the order of 1e11 ph/s/100mA. Hence",
        "together with a number of different detectors that can be simultaneously used",
        "a wide variety of studies of organic and inorganic materials and systems are possible using cutting-edge X-ray-based techniques in theμand nanoscale",
        "including coherent diffractive imaging (CDI)",
        "fluorescence (XRF)",
        "optical luminescence (XEOL)",
        "absorption spectroscopy (XAS)",
        "and diffraction (XRD). Even though samples over the centimeter range can be taken at Tarumã",
        "the small beam and relatively low energies point towards optimized and reduced-size sample holders for in situ experiments. This work describes two related setups that have been developed in-house: a small-volume electrochemical cell with static fluid*; and another multifunctional environment that can be used both as a microfluidic device and as an electrochemistry cell that allows for fluid control over samples deposited on a working electrode. The mechanical design of the devices",
        "as well as the architecture for the fluid and electrical supply systems",
        "according to the precision engineering concepts required for nanopositioning performance",
        "are described in details.",
        "*Vicente",
        "Rafael A.",
        "et al.",
        "\"Bragg Coherent Diffraction Imaging for In Situ Studies in Electrocatalysis",
        "\" ACS nano (2021)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepc03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepc03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepc03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPC03",
      "page_number": "310",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPC04",
      "title": "A Compact X-Ray Emission (mini-XES) Spectrometer at CLS - Design and Fabrication Methods",
      "authors": [
        "T.W. Wysokinski",
        "M. Button",
        "B. Diaz Moreno",
        "A.F.G. Leontowich",
        "CLS",
        "Saskatoon",
        "Saskatchewan",
        "Canada",
        "A compact X-ray emission spectrometer (mini-XES) has been designed and fabricated for use at the Brockhouse undulator beamline*. The mini-XES uses cylindrical von Hamos geometry tuned for Fe K-edge and uses a Pilatus 100 K area detector from Dectris**. It is based on a general design implemented at the APS***. The mini-XES design was developed to be as simple to fabricate and as easy to operate as possible. We tried to minimize the number of components",
        "so there are only two main parts that create a chamber. Those two components are joined and aligned by a NW-80 flange. From the beginning",
        "the design was trying to achieve no tools assembly",
        "alignment",
        "and operation. For lower precision alignment we decided to use the centering ring of the NW-80 flange which",
        "together with two posts integrated with the chamber",
        "provides an adequate method for joining the two parts of the enclosure. We use level vials for horizontal adjustment of the holder for the 10 crystals. For high precision alignment of the holder of the crystal",
        "we used the Thorlab KC1/M kinematic mount",
        "which had the adjustment screws accessible from outside of the chamber. The fabrication was done in-house using uPrint SE Plus 3D Printer****. The first tests of the spectrometer were completed in the Brockhouse wiggler beamline and were successful. Future improvements will aim to reduce the background scatter and better position the detector",
        "to improve the fill. Now that the relatively inexpensive design was tested and tried",
        "there is an option to upgrade it to 3D printed tungsten or steel version that would intrinsically provide the required shielding.",
        "* B. Diaz et al.",
        "Rev. Sci. Instrum 85",
        "085104 (2014)  ** https://www.dectris.com  *** B. A. Mattern et al.",
        "Rev. Sci. Instrum 83",
        "023901 (2012) **** https://support.stratasys.com"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepc04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepc04.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepc04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPC04",
      "page_number": "314",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPC05",
      "title": "An Improved, Compact High Temperature Sample Furnace for X-Ray Powder Diffraction",
      "authors": [
        "BNL",
        "Upton",
        "New York",
        "USA",
        "NYIT",
        "Old Westbury",
        "New York",
        "USA",
        "SBU",
        "Stony Brook",
        "New York",
        "USA",
        "A compact sample furnace was designed and tested at the X-ray Powder Diffraction (XPD) beamline at NSLS-II. This furnace is designed to heat small samples to temperatures of 2000 - 2300°C while allowing the XPD photon beam to pass through with adequate downstream opening in the furnace to collect diffraction data. Since the XPD samples did not reach the desired temperatures initially",
        "engineering studies",
        "tests",
        "and incremental improvements were planned and undertaken to improve performance. The design of the sample furnace will be presented as background",
        "and engineering details will be presented in this paper describing work undertaken to improve the furnace design to allow sample temperatures to reach 2000 - 2300°C or more."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepc05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepc05.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepc05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPC05",
      "page_number": "317",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPC06",
      "title": "Notch Geometry Optimization of APS Upgrade High Heat Load Mirror Systems",
      "authors": [
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Thermal deformation of x-ray optics can have a profound impact on beamline performance. The thermal deformation of these x-ray optics due to heat loads of the x-ray beam has been previously shown to be able to be partially mitigated by adding a groove or notch on the side of the optic and below the optical surface. This notch acts as a thermal break which allows for anti-clastic bending and the notch geometry can be optimized for various heat loads. By optimizing the notch height",
        "depth",
        "and distance from the optical surface the thermal deformation on the optic can be minimized. The High Heat Load Mirror systems of the Advance Photon Source (APS) feature beamlines rely on this notch geometry to be able to take full advantage of the new source of the APS Upgrade.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepc06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepc06.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepc06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPC06",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPC07",
      "title": "Thermal Model Validation for the Cryogenic Mirror Systems for Sirius/LNLS",
      "authors": [
        "L.M. Volpe",
        "J.C. Corsaletti",
        "B.A. Franciscopresenter",
        "R.R. Geraldes",
        "M.S. Silva",
        "LNLS",
        "Campinas",
        "Brazil",
        "One of the challenges of fourth-generation synchrotron light sources as Sirius at the Brazilian Synchrotron Light Laboratory (LNLS) is the high power density that may affect the beamline optical elements by causing figure deformations that deteriorate the quality of the beam. Indeed",
        "surface specifications for height errors of X-ray mirrors are often within a few nanometers. To deal with these thermal management challenges",
        "thermo-mechanical designs based on cryogenic silicon have been developed",
        "taking advantage of its high thermal conductance and low thermal expansion in temperatures of about 125 K. A liquid nitrogen (LN2) cryostat connected to the optics by copper braids has been used to handle moderate power loads",
        "reducing costs when compared to closed-circuit LN2 cryocoolers and mechanically decoupling flow-induced vibrations from the optics. To guarantee the functionality of such systems",
        "lumped mass thermal models were implemented together with auxiliary finite elements analyses. With the first systems in operation",
        "it has been possible to compare and validate the developed models",
        "and to carry out optimizations to improve them for future projects",
        "by adjusting parameters such as emissivity",
        "thermal contact resistance",
        "and copper braid conductance. This work presents the updated models for CARNAÚBA and CATERETÊ beamlines as reference cases."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepc07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepc07.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepc07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPC07",
      "page_number": "320",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPC09",
      "title": "Temperature-Dependent Elastic Constants and Young’s Modulus of Silicon Single Crystal",
      "authors": [
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Silicon crystals have been widely applied for x-ray monochromators. It is an anisotropic material with temperature dependent properties. Values of its thermal properties from cryogenic to high temperature are available in literature for expansion",
        "conductivity",
        "diffusivity",
        "heat capacity",
        "but neither elastic constants nor Young’s modulus. X-ray monochromators may be liquid-nitrogen cooled or water cooled. Finite Element Analysis (FEA) is commonly used to predict thermal performance of monochromators. The elastic constants and Young’s modulus over cryogenic and high temperature are now collected and derived from literature",
        "with the purpose of assisting in providing accurate FEA predictions."
      ],
      "institutions": [
        "Funding: Work supported by the DOE Office of Science by Argonne National Laboratory under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepc09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepc09.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepc09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPC09",
      "page_number": "324",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPC10",
      "title": "Design of Vacuum Chamber With Cryogenic Cooling of Samples for Bragg-Plane Slope Error Measurements",
      "authors": [
        "J.W.J. Anton",
        "P. Pradhan",
        "D. Shu",
        "Yu. Shvyd’ko",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Wavefront preservation is essential for numerous X-ray science applications. Research is currently underway at the Advanced Photon Source to characterize and minimize Bragg-plane slope errors in diamond crystal optics*. Understanding the effect of cooling the optics to cryogenic temperatures on Bragg-plane slope errors is of interest to this research. Through the use of a finite element model a custom",
        "compact vacuum chamber with liquid nitrogen cooling of samples was designed and manufactured. The design process and initial results are discussed in this paper.",
        "*P. Pradhan et al.",
        "J. of Synchrotron Radiation 6",
        "1553 (2020)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepc10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepc10.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepc10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPC10",
      "page_number": "327",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPC12",
      "title": "A New Experimental Station for Liquid Interface X-Ray Scattering At NSLS-II Beamline 12-ID",
      "authors": [
        "D.M. Bacescu",
        "L. Berman",
        "S. Hulbert",
        "B. Ocko",
        "Z. Yin",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "Open Platform and Liquids Scattering (OPLS) is a new experimental station recently built and currently being commissioned at the Soft Matter Interfaces (SMI) beamline 12-ID at NSLS-II. The new instrument expands SMI’s beamline scientific capabilities via the addition of X-ray scattering techniques from liquid surfaces and interfaces. The design of this new instrument",
        "located inside the 12-ID beamline shielding enclosure (hutch B)",
        "is based on a single Ge (111) crystal deflector",
        "which bounces the incident x-ray beam downward towards a liquid sample which must be maintained in a horizontal orientation (gravity-driven consideration). The OPLS instrument has a variable deflector-to-sample distance ranging from 0.6 m to 1.5 m. X-ray detectors are mounted on a 2-theta scattering arm located downstream of the sample location. The 2-theta arm is designed to hold up to three X-ray detectors",
        "with fixed 2-theta angular offsets",
        "each dedicated to a different X-ray technique such as X-ray reflectivity",
        "grazing-incidence X-ray scattering",
        "and small- and wide-angle X-ray scattering. Currently",
        "the OPLS experimental station intercepts the SMI beam that otherwise propagates to the experimental endstation located in hutch C and can be retracted to a ’parking’ position laterally out of this beam to allow installation of a removable beam pipe that is needed to support operations in hutch C. The design of OPLS is flexible enough to quickly adapt to a planned future configuration of the SMI beamline in which a OPLS is illuminated separately from the main SMI branch via a second",
        "canted undulator source and a separate photon delivery system. In this future configuration",
        "both branches will be able to operate independently and simultaneously."
      ],
      "institutions": [
        "Funding: National Synchrotron Light Source II, a U.S. Department of Energy (DOE) Office of Science User Facility operated by Brookhaven National Laboratory, under Contract No. DE-SC0012704."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepc12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepc12.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepc12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPC12",
      "page_number": "330",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPC13",
      "title": "Sample and Detector Positioning Instruments for the Wide Angle XPCS End Station at 8-ID-E, a Feature Beamline for the APS Upgrade",
      "authors": [
        "K.J. Wakefield",
        "S.J. Bean",
        "D. Capatina",
        "E.M. Dufresne",
        "M.V. Fisher",
        "M.J. Highland",
        "S. Narayanan",
        "A. Sandy",
        "R. Ziegler",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "The X-ray Photon Correlation Spectroscopy (XPCS) beamline at the Advanced Photon Source (APS) has been selected as one of the nine feature beamlines being de-signed to take advantage of the increase in coherent flux provided by the APS Upgrade. The 8-ID-E enclosure at the beamline will have a dedicated instrument for per-forming Wide Angle XPCS (WA-XPCS) measurements across a range of length and time scales. The instrument will feature a high-stability 6-circle diffractometer",
        "a moveable Long Distance Detector Positioner (LDDP) for positioning a large pixel array detector",
        "and a removable flight path assembly. For intermediate sample to detector distances of 1.5 to 2 meters",
        "a large pixel array detector will be positioned on the diffractometer detector arm. For longer sample to detector distances up to 4 meters",
        "an horizontal scattering geometry will be utilized based on the LDDP to position a second large pixel array detector. The LDDP will consist of a large granite base on which sits a combination of motorized stages. The base will sit on air casters that allow the LDDP to be coarsely posi-tioned manually within the enclosure. Final positioning of the detector will be achieved with the mounted stages. The spatial relationship between the sample and the free moving LDDP will be monitored using a laser tracking system. A moveable flight path will be supported by the diffractometer arm and a mobile floor support to mini-mize air scattering while using the LDDP. The WA-XPCS instrument has been designed with users and beamline staff in mind and will allow them to efficiently utilize the highly enhanced coherent beam provided by the APS Upgrade."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepc13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepc13.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepc13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPC13",
      "page_number": "333",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPC15",
      "title": "Nylon Mesh Holder for Serial Crystallography Experiments",
      "authors": [
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Over the last two years",
        "we have developed a 3D printed nylon mesh holder for serial synchrotron crystallography (SSX) experiments. We are moving away from the complications in some devices to a cheap",
        "easy",
        "and user-friendly format. The device uses a new",
        "patented*",
        "two-layer (one rigid and one flexible) substrate technique developed at Argonne. The SSX device and method",
        "which incorporates a modular high-performance computing data analysis backend",
        "was used to demonstrate never-before-seen molecular dynamics** and discovered the methylated form of the SARS-CoV-2 Nsp10/16 protein*** complex. Named ALEX (Advanced Lightweight Encapsulation for Crystallography) for short",
        "we are actively using",
        "upgrading",
        "and reaching out to collaborators. We are using ALEX for serial experiments at APS but feel the design might be useful for other applications.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "* Patent #16/903, 601  ** Currently in writing stage *** Accepted for publication reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/wepc15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/wepc15.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/wepc15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-WEPC15",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 12,
  "scrape_time": "2025-10-10 23:29:47"
}