{
  "session_info": {
    "id": "FRCAMH",
    "name": "FRCAMH - Medical and industrial applications",
    "url": "https://proceedings.jacow.org/rupac2018/html/frcamh.htm"
  },
  "papers": [
    {
      "paper_id": "FRCAMH01",
      "title": "The Carbon Ion Beam Extraction Scheme From the U-70 Synchrotron for Radiobiological Researches",
      "authors": [
        "A.V. Maximov",
        "Y.M. Antipov",
        "G.I. Britvich",
        "S.V. Ivanov",
        "V.A. Kalinin",
        "G.V. Khitev",
        "O.P. Lebedev",
        "E.A. Ludmirsky",
        "A.P. Soldatov",
        "IHEP",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The carbon ion beam extraction scheme from the U-70 synchrotron of NRC \"Kurchatov institute\" - IHEP for radiobiological researches is presented. The double-step extraction scheme Piccioni-Wright is used. The beam extraction operates at magnetic field flat bottom of U-70 synchrotron with carbon ion energy 455 MeV/n. A technique to attain transversally uniform dose field and other operational results are also presented.",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/frcamh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/frcamh01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/frcamh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-FRCAMH01",
      "page_number": "139",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCAMH02",
      "title": "Proton Irradiation Facility at INR RAS Linac",
      "authors": [
        "S.A. Gavrilov",
        "S. Bragin",
        "A. Feschenko",
        "V. Gaidash",
        "O.V. Grekhov",
        "Y.Z. Kalinin",
        "Yu.V. Kiselev",
        "RAS/INR",
        "Moscow",
        "Russia",
        "A new proton irradiation facility to study radiation effects in electronics and different materials was constructed at INR RAS linac. The beam intensity range is 107-1012 protons per separate pulses up to 1 uA of average beam current. The energy is adjusted by switching on/off the fields in accelerating cavities and with energy degraders in the range 20-210 MeV. Features of the facility development",
        "in-air operation",
        "diagnostics system",
        "as well as experimental results of beam adjustment and test irradiation are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/frcamh02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/frcamh02.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/frcamh02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-FRCAMH02",
      "page_number": "142",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCAMH03",
      "title": "Radiation Oncology Ophthalmic Center Based on the C-80 Accelerator at the  NRC \"Kurchatov Institute\" - PNPI",
      "authors": [
        "A.N. Chernykh",
        "E.M. Ivanov",
        "PNPI",
        "Gatchina",
        "Leningrad District",
        "Russia",
        "ITEP",
        "Moscow",
        "Russia",
        "MRTI RAS",
        "Moscow",
        "Russia",
        "Radiotherapy along with surgery and chemotherapy is a common method treatment for cancer. In developed countries",
        "radiotherapy is used in 70% of cases of treatment",
        "both individually and together. In recent years",
        "proton radiation therapy intensively implement at clinical practice. It is proved that proton therapy is an extremely effective treatment method in the field of cancer eye in which the five-year survival is up to 98%. However",
        "long-term observations show that the possibility of late radiation reactions that lead to atrophic and degenerative changes and the need to remove the eye. These complications are strongly manifested after irradiation of tumors sprouted more than 10 mm into the eye. The reasons that lead to such unpleasant consequences of exposure may be related to positioning errors. Based on years of experience of radiation oncology ophthalmic patients",
        "beam installation",
        "allowing to increase the pointing accuracy of the proton beam on the irradiated target was design. The proposed innovation is supposed to allow improving the quality of radiation. As result of studies PNPI and ITEP have joined forces to create on the basis of the cyclotron C-80",
        "functioning in the PNPI from 2017",
        "radiation oncology ophthalmic center of proton beam therapy that can provide the need for this type of medical care for the whole North-West region of Russia. The report describes the composition and innovative solutions of the Center's equipment."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/frcamh03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/frcamh03.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/frcamh03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-FRCAMH03",
      "page_number": "145",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-11 02:24:19"
}