{
  "session_info": {
    "id": "WEP2PO",
    "name": "WEP2PO - Poster Session",
    "url": "https://proceedings.jacow.org/hb2018/html/wep2po.htm"
  },
  "papers": [
    {
      "paper_id": "WEP2PO001",
      "title": "Upgraded Transverse Feedback for the CERN PS Booster",
      "authors": [
        "A. Blas",
        "G. Kotzian",
        "CERN",
        "Geneva",
        "Switzerland",
        "A new transverse feedback system is being used for the 4 rings of the CERN Proton Synchrotron Booster (PSB). In addition to transverse instabilities mitigation - within the range of 100 kHz to 100 MHz - the system allows for controlled beam emittance blow-up",
        "machine tune measurement and other optic studies. The system was upgraded in order to multiply by 8 its power (800 W instead of 100 W on each of the 4 kicker electrodes) and in order for its electronic core to employ a digital processing. The transverse feedback adapts automatically to a factor 3 change in the beam revolution period and to any change of the machine tune. It includes an excitation source that combines up to 9 selectable harmonics of the revolution frequency with a selectable amplitude for each. The excitation may be dipolar or quadrupolar. Future possible upgrades will be presented including a setup to tackle half-integer tune values and a digital processing using a fixed clock frequency instead of the revolution frequency clock.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "F.F. Van der Veken",
        "M. Giovannozzi",
        "CERN",
        "Geneva",
        "Switzerland",
        "In recent years",
        "models for the time-evolution of the dynamic aperture have been proposed and applied to the analysis of non-linear betatronic motion in circular accelerators. In this paper",
        "these models are used to derive scaling laws for the luminosity evolution and are applied to the analysis of the data collected during the LHC physics runs. An extended set of fills from the LHC proton physics has been analysed and the results presented and discussed in detail. The long-term goal of these studies is to improve the estimate of the performance reach of the HL-LHC.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "I. Karpov",
        "P. Baudrenghien",
        "CERN",
        "Geneva",
        "Switzerland",
        "In high-current accelerators",
        "interaction of the beam with fundamental impedance of the accelerating cavities can limit machine performance. It can result in a significant variation of bunch-by-bunch parameters (bunch length",
        "synchronous phase",
        "etc.) and lead to longitudinal coupled-bunch instability. In this work",
        "these limitations are analysed together with possible cures for the high-current option (Z machine) of the future circular electron-positron collider (FCC-ee). The time-domain calculations of steady-state beam loading are presented and compared with frequency-domain analysis.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "V. Forte",
        "S.C.P. Albright",
        "W. Bartmann",
        "G.P. Di Giovanni",
        "M.A. Fraser",
        "C. Heßler",
        "A. Huschauer",
        "A. Oeftiger",
        "CERN",
        "Geneva",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "V. Forte",
        "C. Bracco",
        "G.P. Di Giovanni",
        "M.A. Fraser",
        "A.M. Lombardi",
        "B. Mikulec",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the framework of the LHC Injectors Upgrade (LIU) project",
        "the injection process in the CERN Proton Synchrotron Booster (PSB) will be renovated after the connection with the Linac4. A new H− charge exchange injection system using a stripping foil is foreseen to increase the brightness of the stored beams and to provide high flexibility in terms of emittance tailoring at 160 MeV. Realistic multi-particle simulations of the future injection processes for high brightness beams (i.e. for the LHC) and high intensity beams (i.e. for the ISOLDE experiment) are presented in this paper. The simulations are based on the present performance of Linac4 and include scattering induced by the foil",
        "space charge effects and compensation of the lattice perturbation introduced by the bumpers of the injection chicane.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "A. Alekou",
        "H. Bartosikpresenter",
        "R. Calaga",
        "M. Carlà",
        "Y. Papaphilippou",
        "CERN",
        "Geneva",
        "Switzerland",
        "R.B. Appleby",
        "R.B. Appleby",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A local Crab Cavity (CC) scheme will recover the head-on collisions at the IP of the High Luminosity LHC (HL-LHC)",
        "which aims to increase the LHC luminosity by a factor of 3-10. The tight space constraints at the CC location result in axially non-symmetric cavity designs that introduce high order multipole CC components. The impact of these high order components on the long term stability of the beam in the SPS machine",
        "where two prototype crab cavities are presently installed in the CERN SPS to perform tests with beam",
        "is presented. Furthermore",
        "the Dynamic Aperture is studied in the presence of the SPS errors. Future plans are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "F.G. Garcia",
        "S. Chaurize",
        "C.C. Drennan",
        "K. E. Gollwitzer",
        "V.A. Lebedev",
        "W. Pellico",
        "J. Reid",
        "C.-Y. Tan",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Fermilab Proton Source is composed of three machines: an injector line",
        "a normal conducting Linac and a Booster synchrotron. The proton improvement plan was proposed in 2012 to address the necessary accelerator upgrades and hardware modification to allow an increase in proton throughput",
        "while maintaining acceptable activation levels",
        "ensuring viable operation of the proton source to sustain the laboratory HEP program. A summary of work performed and respective results will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.S. Beck",
        "H. Bartosik",
        "M. Carlà",
        "K.S.B. Li",
        "G. Rumolo",
        "M. Schenkpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "In the framework of the LHC Injectors Upgrade (LIU)",
        "beams with about twice the intensity compared to the present values will have to be accelerated by the CERN Super Proton Synchrotron (SPS) and extracted towards the Large Hadron Collider (LHC). Machine studies with intensity higher than the nominal LHC beam have shown that coherent instabilities in both transverse planes may develop at injection energy",
        "potentially becoming a limitation for the future high intensity operation. In particular",
        "a transverse mode coupling instability is encountered in the vertical plane",
        "the threshold of which can be sufficiently increased by changing the machine optics. In addition",
        "a headtail instability of individual bunches is observed in the horizontal plane in multi-bunch operation",
        "which requires stabilization by high chromaticity. The PyHEADTAIL code has been used to check if the present SPS impedance model reproduces the experimental observations. The instability growth rates have been studied for different machine optics configurations and different chromaticity settings. Other stabilizing mechanisms like tune spread from octupoles or the transverse damper have also been investigated.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Jin",
        "Y. Choi",
        "S. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "In the RAON accelerator",
        "beams generated by ion sources like ECR-IS or ISOL are accelerated to an energy of up to 200 MeV/u before reaching the laboratory target",
        "and the beam power reaches up to about 400 kW at that moment. During transportation of such a beam",
        "if beam loss occurs due to a device malfunction or a sudden change in beam condition",
        "the accelerator can be severely damaged. Therefore",
        "we have developed a machine protection system to protect the devices by minimizing the damage and to operate the accelerator in safe. As part of the RAON machine protection system",
        "a FPGA-based fast protection system (FPS) that can protect devices within a few tens of microseconds after detecting the moment of beam loss has been developed since 2016. The development and test of the FPS prototype was successfully completed last year",
        "and we are now preparing for mass production of the FPS. Here we will present the progress of the FPS development and the future plan for the FPS in the RAON accelerator.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Kim",
        "J.W. Choi",
        "Y.W. Jo",
        "H.C. Jung",
        "Y. Jung",
        "J.W. Kim",
        "M.S. Kim",
        "Y. Kim",
        "M. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For China Spallation Neutron Source (CSNS)",
        "the septum magnets are the key part of the injection system and the lambertson magnet is the key part of the extraction system. If the leakage fields of the septum and lambertson magnets are large enough",
        "the circular beam orbit of Rapid Cycling Synchrotron (RCS) would be affected. In this paper",
        "during the beam commissioning",
        "the leakage fields of the septum and lambertson magnets will be studied and their effects on the circular beam orbit will be given and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "S.Y. Xu",
        "S. Fu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Because of the differences of magnetic saturation and eddy current effects between different magnets",
        "magnetic field tracking errors between different magnets is larger than 2.5 % at the Rapid Cycling Synchrotron (RCS) of Chinese Spallation Neutron Source (CSNS)",
        "and the induced tune shift is larger than 0.1. So larger tune shift may lead the beam to pass through the resonance lines. To reduce the magnetic field tracking errors",
        "a method of wave form compensation for magnets of the Rapid Cycling Synchrotron was investigated on the magnets of CSNS/RCS. The wave form compensation was applied to CSNS/RCS commissioning. By performing wave form compensation",
        "the maximum magnetic field tracking error was reduced from 2.5 % to 0.08 %",
        "and the maximum tune shift over the ramping process was reduced from 0.1 to 0.004.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Overview of the CERN PSB-to-PS Transfer Line Optics Matching Studies in View of the LHC Injectors Upgrade Project",
        "At injection into the CERN Proton Synchrotron (PS) a significant horizontal emittance blow-up of the present high brightness beams for the LHC is observed. A partial contribution to this effect is suspected to be an important mismatch between the dispersion function in the transfer line from the PS Booster (PSB) and the ring itself. This mismatch will be unacceptable in view of the beam parameters requested by the LHC Injectors Upgrade (LIU) project with high longitudinal emittance and momentum spread. To deliver the requested beam parameters the PSB-to-PS transfer line will be upgraded and the optics in the line changed to improve the matching from all the four PSB rings. A re-matching campaign from the PSB ring 3 has been carried out to evaluate the impact of the present optics mismatch as a source of emittance growth both in simulations and measurements.",
        "Multi-Particle Simulations of the Future CERN PSB Injection Process with Updated Linac4 Beam Performance",
        "Studies of Transverse Instabilities in the CERN SPS",
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "Poster WEP2PO001 [1.794 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO001 reference for this paper using Scaling Laws for the Time Dependence of Luminosity in Hadron Circular Accelerators based on Simple Models of Dynamic Aperture Evolution Poster WEP2PO002 [5.757 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO002 reference for this paper using Beam Loading and Longitudinal Stability Evaluation for the FCC-ee Rings reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO003 reference for this paper using reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO006 reference for this paper using reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO007 reference for this paper using SPS Long Term Stability Studies in the Presence of Crab Cavities and High Order Multipoles reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO008 reference for this paper using Fermilab - The Proton Improvement Plan (PIP) Poster WEP2PO010 [1.699 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO010 reference for this paper using Poster WEP2PO011 [4.940 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO011 reference for this paper using Progress and Plan of the Fast Protection System in the RAON Accelerator reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO015 reference for this paper using Temperature Measurement of Cryomodules A quarter-wave resonator (QWR) and a half-wave resonator (HWR) cryomodules and the control systems such as programmable logic controller (PLC) are developed. Temperature sensors such as Cernox-1050 are calibrated and applied to the cryomodules. Preparation of vertical test is introduced. QWR and HWR cryomodules are fabricated and tested by using the developed PLC control system. The PLC rack and temperature monitors are shown and the human machine interfaces (HMI) screen is shown when the HWR cryomodules is tested at 2 K. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO016 reference for this paper using Study on the Leakage Fields of the Septum and Lambertson Magnets during the Beam Commissioning Poster WEP2PO017 [0.852 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO017 reference for this paper using Magnetic Field Tracking at CSNS/RCS reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO018 reference for this paper using Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po001.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO001",
      "page_number": "256",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEP2PO002",
      "title": "Scaling Laws for the Time Dependence of Luminosity in Hadron Circular Accelerators based on Simple Models of Dynamic Aperture Evolution",
      "authors": [
        "F.F. Van der Veken",
        "M. Giovannozzi",
        "CERN",
        "Geneva",
        "Switzerland",
        "In recent years",
        "models for the time-evolution of the dynamic aperture have been proposed and applied to the analysis of non-linear betatronic motion in circular accelerators. In this paper",
        "these models are used to derive scaling laws for the luminosity evolution and are applied to the analysis of the data collected during the LHC physics runs. An extended set of fills from the LHC proton physics has been analysed and the results presented and discussed in detail. The long-term goal of these studies is to improve the estimate of the performance reach of the HL-LHC.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "I. Karpov",
        "P. Baudrenghien",
        "CERN",
        "Geneva",
        "Switzerland",
        "In high-current accelerators",
        "interaction of the beam with fundamental impedance of the accelerating cavities can limit machine performance. It can result in a significant variation of bunch-by-bunch parameters (bunch length",
        "synchronous phase",
        "etc.) and lead to longitudinal coupled-bunch instability. In this work",
        "these limitations are analysed together with possible cures for the high-current option (Z machine) of the future circular electron-positron collider (FCC-ee). The time-domain calculations of steady-state beam loading are presented and compared with frequency-domain analysis.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "V. Forte",
        "S.C.P. Albright",
        "W. Bartmann",
        "G.P. Di Giovanni",
        "M.A. Fraser",
        "C. Heßler",
        "A. Huschauer",
        "A. Oeftiger",
        "CERN",
        "Geneva",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "V. Forte",
        "C. Bracco",
        "G.P. Di Giovanni",
        "M.A. Fraser",
        "A.M. Lombardi",
        "B. Mikulec",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the framework of the LHC Injectors Upgrade (LIU) project",
        "the injection process in the CERN Proton Synchrotron Booster (PSB) will be renovated after the connection with the Linac4. A new H− charge exchange injection system using a stripping foil is foreseen to increase the brightness of the stored beams and to provide high flexibility in terms of emittance tailoring at 160 MeV. Realistic multi-particle simulations of the future injection processes for high brightness beams (i.e. for the LHC) and high intensity beams (i.e. for the ISOLDE experiment) are presented in this paper. The simulations are based on the present performance of Linac4 and include scattering induced by the foil",
        "space charge effects and compensation of the lattice perturbation introduced by the bumpers of the injection chicane.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "A. Alekou",
        "H. Bartosikpresenter",
        "R. Calaga",
        "M. Carlà",
        "Y. Papaphilippou",
        "CERN",
        "Geneva",
        "Switzerland",
        "R.B. Appleby",
        "R.B. Appleby",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A local Crab Cavity (CC) scheme will recover the head-on collisions at the IP of the High Luminosity LHC (HL-LHC)",
        "which aims to increase the LHC luminosity by a factor of 3-10. The tight space constraints at the CC location result in axially non-symmetric cavity designs that introduce high order multipole CC components. The impact of these high order components on the long term stability of the beam in the SPS machine",
        "where two prototype crab cavities are presently installed in the CERN SPS to perform tests with beam",
        "is presented. Furthermore",
        "the Dynamic Aperture is studied in the presence of the SPS errors. Future plans are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "F.G. Garcia",
        "S. Chaurize",
        "C.C. Drennan",
        "K. E. Gollwitzer",
        "V.A. Lebedev",
        "W. Pellico",
        "J. Reid",
        "C.-Y. Tan",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Fermilab Proton Source is composed of three machines: an injector line",
        "a normal conducting Linac and a Booster synchrotron. The proton improvement plan was proposed in 2012 to address the necessary accelerator upgrades and hardware modification to allow an increase in proton throughput",
        "while maintaining acceptable activation levels",
        "ensuring viable operation of the proton source to sustain the laboratory HEP program. A summary of work performed and respective results will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.S. Beck",
        "H. Bartosik",
        "M. Carlà",
        "K.S.B. Li",
        "G. Rumolo",
        "M. Schenkpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "In the framework of the LHC Injectors Upgrade (LIU)",
        "beams with about twice the intensity compared to the present values will have to be accelerated by the CERN Super Proton Synchrotron (SPS) and extracted towards the Large Hadron Collider (LHC). Machine studies with intensity higher than the nominal LHC beam have shown that coherent instabilities in both transverse planes may develop at injection energy",
        "potentially becoming a limitation for the future high intensity operation. In particular",
        "a transverse mode coupling instability is encountered in the vertical plane",
        "the threshold of which can be sufficiently increased by changing the machine optics. In addition",
        "a headtail instability of individual bunches is observed in the horizontal plane in multi-bunch operation",
        "which requires stabilization by high chromaticity. The PyHEADTAIL code has been used to check if the present SPS impedance model reproduces the experimental observations. The instability growth rates have been studied for different machine optics configurations and different chromaticity settings. Other stabilizing mechanisms like tune spread from octupoles or the transverse damper have also been investigated.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Jin",
        "Y. Choi",
        "S. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "In the RAON accelerator",
        "beams generated by ion sources like ECR-IS or ISOL are accelerated to an energy of up to 200 MeV/u before reaching the laboratory target",
        "and the beam power reaches up to about 400 kW at that moment. During transportation of such a beam",
        "if beam loss occurs due to a device malfunction or a sudden change in beam condition",
        "the accelerator can be severely damaged. Therefore",
        "we have developed a machine protection system to protect the devices by minimizing the damage and to operate the accelerator in safe. As part of the RAON machine protection system",
        "a FPGA-based fast protection system (FPS) that can protect devices within a few tens of microseconds after detecting the moment of beam loss has been developed since 2016. The development and test of the FPS prototype was successfully completed last year",
        "and we are now preparing for mass production of the FPS. Here we will present the progress of the FPS development and the future plan for the FPS in the RAON accelerator.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Kim",
        "J.W. Choi",
        "Y.W. Jo",
        "H.C. Jung",
        "Y. Jung",
        "J.W. Kim",
        "M.S. Kim",
        "Y. Kim",
        "M. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For China Spallation Neutron Source (CSNS)",
        "the septum magnets are the key part of the injection system and the lambertson magnet is the key part of the extraction system. If the leakage fields of the septum and lambertson magnets are large enough",
        "the circular beam orbit of Rapid Cycling Synchrotron (RCS) would be affected. In this paper",
        "during the beam commissioning",
        "the leakage fields of the septum and lambertson magnets will be studied and their effects on the circular beam orbit will be given and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "S.Y. Xu",
        "S. Fu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Because of the differences of magnetic saturation and eddy current effects between different magnets",
        "magnetic field tracking errors between different magnets is larger than 2.5 % at the Rapid Cycling Synchrotron (RCS) of Chinese Spallation Neutron Source (CSNS)",
        "and the induced tune shift is larger than 0.1. So larger tune shift may lead the beam to pass through the resonance lines. To reduce the magnetic field tracking errors",
        "a method of wave form compensation for magnets of the Rapid Cycling Synchrotron was investigated on the magnets of CSNS/RCS. The wave form compensation was applied to CSNS/RCS commissioning. By performing wave form compensation",
        "the maximum magnetic field tracking error was reduced from 2.5 % to 0.08 %",
        "and the maximum tune shift over the ramping process was reduced from 0.1 to 0.004.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Overview of the CERN PSB-to-PS Transfer Line Optics Matching Studies in View of the LHC Injectors Upgrade Project",
        "At injection into the CERN Proton Synchrotron (PS) a significant horizontal emittance blow-up of the present high brightness beams for the LHC is observed. A partial contribution to this effect is suspected to be an important mismatch between the dispersion function in the transfer line from the PS Booster (PSB) and the ring itself. This mismatch will be unacceptable in view of the beam parameters requested by the LHC Injectors Upgrade (LIU) project with high longitudinal emittance and momentum spread. To deliver the requested beam parameters the PSB-to-PS transfer line will be upgraded and the optics in the line changed to improve the matching from all the four PSB rings. A re-matching campaign from the PSB ring 3 has been carried out to evaluate the impact of the present optics mismatch as a source of emittance growth both in simulations and measurements.",
        "Multi-Particle Simulations of the Future CERN PSB Injection Process with Updated Linac4 Beam Performance",
        "Studies of Transverse Instabilities in the CERN SPS",
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "Poster WEP2PO002 [5.757 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO002 reference for this paper using Beam Loading and Longitudinal Stability Evaluation for the FCC-ee Rings reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO003 reference for this paper using reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO006 reference for this paper using reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO007 reference for this paper using SPS Long Term Stability Studies in the Presence of Crab Cavities and High Order Multipoles reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO008 reference for this paper using Fermilab - The Proton Improvement Plan (PIP) Poster WEP2PO010 [1.699 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO010 reference for this paper using Poster WEP2PO011 [4.940 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO011 reference for this paper using Progress and Plan of the Fast Protection System in the RAON Accelerator reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO015 reference for this paper using Temperature Measurement of Cryomodules A quarter-wave resonator (QWR) and a half-wave resonator (HWR) cryomodules and the control systems such as programmable logic controller (PLC) are developed. Temperature sensors such as Cernox-1050 are calibrated and applied to the cryomodules. Preparation of vertical test is introduced. QWR and HWR cryomodules are fabricated and tested by using the developed PLC control system. The PLC rack and temperature monitors are shown and the human machine interfaces (HMI) screen is shown when the HWR cryomodules is tested at 2 K. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO016 reference for this paper using Study on the Leakage Fields of the Septum and Lambertson Magnets during the Beam Commissioning Poster WEP2PO017 [0.852 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO017 reference for this paper using Magnetic Field Tracking at CSNS/RCS reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO018 reference for this paper using Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po002.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO002",
      "page_number": "260",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEP2PO003",
      "title": "Beam Loading and Longitudinal Stability Evaluation for the FCC-ee Rings",
      "authors": [
        "I. Karpov",
        "P. Baudrenghien",
        "CERN",
        "Geneva",
        "Switzerland",
        "In high-current accelerators",
        "interaction of the beam with fundamental impedance of the accelerating cavities can limit machine performance. It can result in a significant variation of bunch-by-bunch parameters (bunch length",
        "synchronous phase",
        "etc.) and lead to longitudinal coupled-bunch instability. In this work",
        "these limitations are analysed together with possible cures for the high-current option (Z machine) of the future circular electron-positron collider (FCC-ee). The time-domain calculations of steady-state beam loading are presented and compared with frequency-domain analysis.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "V. Forte",
        "S.C.P. Albright",
        "W. Bartmann",
        "G.P. Di Giovanni",
        "M.A. Fraser",
        "C. Heßler",
        "A. Huschauer",
        "A. Oeftiger",
        "CERN",
        "Geneva",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "V. Forte",
        "C. Bracco",
        "G.P. Di Giovanni",
        "M.A. Fraser",
        "A.M. Lombardi",
        "B. Mikulec",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the framework of the LHC Injectors Upgrade (LIU) project",
        "the injection process in the CERN Proton Synchrotron Booster (PSB) will be renovated after the connection with the Linac4. A new H− charge exchange injection system using a stripping foil is foreseen to increase the brightness of the stored beams and to provide high flexibility in terms of emittance tailoring at 160 MeV. Realistic multi-particle simulations of the future injection processes for high brightness beams (i.e. for the LHC) and high intensity beams (i.e. for the ISOLDE experiment) are presented in this paper. The simulations are based on the present performance of Linac4 and include scattering induced by the foil",
        "space charge effects and compensation of the lattice perturbation introduced by the bumpers of the injection chicane.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "A. Alekou",
        "H. Bartosikpresenter",
        "R. Calaga",
        "M. Carlà",
        "Y. Papaphilippou",
        "CERN",
        "Geneva",
        "Switzerland",
        "R.B. Appleby",
        "R.B. Appleby",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A local Crab Cavity (CC) scheme will recover the head-on collisions at the IP of the High Luminosity LHC (HL-LHC)",
        "which aims to increase the LHC luminosity by a factor of 3-10. The tight space constraints at the CC location result in axially non-symmetric cavity designs that introduce high order multipole CC components. The impact of these high order components on the long term stability of the beam in the SPS machine",
        "where two prototype crab cavities are presently installed in the CERN SPS to perform tests with beam",
        "is presented. Furthermore",
        "the Dynamic Aperture is studied in the presence of the SPS errors. Future plans are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "F.G. Garcia",
        "S. Chaurize",
        "C.C. Drennan",
        "K. E. Gollwitzer",
        "V.A. Lebedev",
        "W. Pellico",
        "J. Reid",
        "C.-Y. Tan",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Fermilab Proton Source is composed of three machines: an injector line",
        "a normal conducting Linac and a Booster synchrotron. The proton improvement plan was proposed in 2012 to address the necessary accelerator upgrades and hardware modification to allow an increase in proton throughput",
        "while maintaining acceptable activation levels",
        "ensuring viable operation of the proton source to sustain the laboratory HEP program. A summary of work performed and respective results will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.S. Beck",
        "H. Bartosik",
        "M. Carlà",
        "K.S.B. Li",
        "G. Rumolo",
        "M. Schenkpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "In the framework of the LHC Injectors Upgrade (LIU)",
        "beams with about twice the intensity compared to the present values will have to be accelerated by the CERN Super Proton Synchrotron (SPS) and extracted towards the Large Hadron Collider (LHC). Machine studies with intensity higher than the nominal LHC beam have shown that coherent instabilities in both transverse planes may develop at injection energy",
        "potentially becoming a limitation for the future high intensity operation. In particular",
        "a transverse mode coupling instability is encountered in the vertical plane",
        "the threshold of which can be sufficiently increased by changing the machine optics. In addition",
        "a headtail instability of individual bunches is observed in the horizontal plane in multi-bunch operation",
        "which requires stabilization by high chromaticity. The PyHEADTAIL code has been used to check if the present SPS impedance model reproduces the experimental observations. The instability growth rates have been studied for different machine optics configurations and different chromaticity settings. Other stabilizing mechanisms like tune spread from octupoles or the transverse damper have also been investigated.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Jin",
        "Y. Choi",
        "S. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "In the RAON accelerator",
        "beams generated by ion sources like ECR-IS or ISOL are accelerated to an energy of up to 200 MeV/u before reaching the laboratory target",
        "and the beam power reaches up to about 400 kW at that moment. During transportation of such a beam",
        "if beam loss occurs due to a device malfunction or a sudden change in beam condition",
        "the accelerator can be severely damaged. Therefore",
        "we have developed a machine protection system to protect the devices by minimizing the damage and to operate the accelerator in safe. As part of the RAON machine protection system",
        "a FPGA-based fast protection system (FPS) that can protect devices within a few tens of microseconds after detecting the moment of beam loss has been developed since 2016. The development and test of the FPS prototype was successfully completed last year",
        "and we are now preparing for mass production of the FPS. Here we will present the progress of the FPS development and the future plan for the FPS in the RAON accelerator.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Kim",
        "J.W. Choi",
        "Y.W. Jo",
        "H.C. Jung",
        "Y. Jung",
        "J.W. Kim",
        "M.S. Kim",
        "Y. Kim",
        "M. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For China Spallation Neutron Source (CSNS)",
        "the septum magnets are the key part of the injection system and the lambertson magnet is the key part of the extraction system. If the leakage fields of the septum and lambertson magnets are large enough",
        "the circular beam orbit of Rapid Cycling Synchrotron (RCS) would be affected. In this paper",
        "during the beam commissioning",
        "the leakage fields of the septum and lambertson magnets will be studied and their effects on the circular beam orbit will be given and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "S.Y. Xu",
        "S. Fu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Because of the differences of magnetic saturation and eddy current effects between different magnets",
        "magnetic field tracking errors between different magnets is larger than 2.5 % at the Rapid Cycling Synchrotron (RCS) of Chinese Spallation Neutron Source (CSNS)",
        "and the induced tune shift is larger than 0.1. So larger tune shift may lead the beam to pass through the resonance lines. To reduce the magnetic field tracking errors",
        "a method of wave form compensation for magnets of the Rapid Cycling Synchrotron was investigated on the magnets of CSNS/RCS. The wave form compensation was applied to CSNS/RCS commissioning. By performing wave form compensation",
        "the maximum magnetic field tracking error was reduced from 2.5 % to 0.08 %",
        "and the maximum tune shift over the ramping process was reduced from 0.1 to 0.004.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Overview of the CERN PSB-to-PS Transfer Line Optics Matching Studies in View of the LHC Injectors Upgrade Project",
        "At injection into the CERN Proton Synchrotron (PS) a significant horizontal emittance blow-up of the present high brightness beams for the LHC is observed. A partial contribution to this effect is suspected to be an important mismatch between the dispersion function in the transfer line from the PS Booster (PSB) and the ring itself. This mismatch will be unacceptable in view of the beam parameters requested by the LHC Injectors Upgrade (LIU) project with high longitudinal emittance and momentum spread. To deliver the requested beam parameters the PSB-to-PS transfer line will be upgraded and the optics in the line changed to improve the matching from all the four PSB rings. A re-matching campaign from the PSB ring 3 has been carried out to evaluate the impact of the present optics mismatch as a source of emittance growth both in simulations and measurements.",
        "Multi-Particle Simulations of the Future CERN PSB Injection Process with Updated Linac4 Beam Performance",
        "Studies of Transverse Instabilities in the CERN SPS",
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO003 reference for this paper using reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO006 reference for this paper using reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO007 reference for this paper using SPS Long Term Stability Studies in the Presence of Crab Cavities and High Order Multipoles reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO008 reference for this paper using Fermilab - The Proton Improvement Plan (PIP) Poster WEP2PO010 [1.699 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO010 reference for this paper using Poster WEP2PO011 [4.940 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO011 reference for this paper using Progress and Plan of the Fast Protection System in the RAON Accelerator reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO015 reference for this paper using Temperature Measurement of Cryomodules A quarter-wave resonator (QWR) and a half-wave resonator (HWR) cryomodules and the control systems such as programmable logic controller (PLC) are developed. Temperature sensors such as Cernox-1050 are calibrated and applied to the cryomodules. Preparation of vertical test is introduced. QWR and HWR cryomodules are fabricated and tested by using the developed PLC control system. The PLC rack and temperature monitors are shown and the human machine interfaces (HMI) screen is shown when the HWR cryomodules is tested at 2 K. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO016 reference for this paper using Study on the Leakage Fields of the Septum and Lambertson Magnets during the Beam Commissioning Poster WEP2PO017 [0.852 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO017 reference for this paper using Magnetic Field Tracking at CSNS/RCS reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO018 reference for this paper using Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po003.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO003",
      "page_number": "266",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEP2PO006",
      "title": "Overview of the CERN PSB-to-PS Transfer Line Optics Matching Studies in View of the LHC Injectors Upgrade Project",
      "authors": [
        "V. Forte",
        "S.C.P. Albright",
        "W. Bartmann",
        "G.P. Di Giovanni",
        "M.A. Fraser",
        "C. Heßler",
        "A. Huschauer",
        "A. Oeftiger",
        "CERN",
        "Geneva",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "V. Forte",
        "C. Bracco",
        "G.P. Di Giovanni",
        "M.A. Fraser",
        "A.M. Lombardi",
        "B. Mikulec",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the framework of the LHC Injectors Upgrade (LIU) project",
        "the injection process in the CERN Proton Synchrotron Booster (PSB) will be renovated after the connection with the Linac4. A new H− charge exchange injection system using a stripping foil is foreseen to increase the brightness of the stored beams and to provide high flexibility in terms of emittance tailoring at 160 MeV. Realistic multi-particle simulations of the future injection processes for high brightness beams (i.e. for the LHC) and high intensity beams (i.e. for the ISOLDE experiment) are presented in this paper. The simulations are based on the present performance of Linac4 and include scattering induced by the foil",
        "space charge effects and compensation of the lattice perturbation introduced by the bumpers of the injection chicane.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "A. Alekou",
        "H. Bartosikpresenter",
        "R. Calaga",
        "M. Carlà",
        "Y. Papaphilippou",
        "CERN",
        "Geneva",
        "Switzerland",
        "R.B. Appleby",
        "R.B. Appleby",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A local Crab Cavity (CC) scheme will recover the head-on collisions at the IP of the High Luminosity LHC (HL-LHC)",
        "which aims to increase the LHC luminosity by a factor of 3-10. The tight space constraints at the CC location result in axially non-symmetric cavity designs that introduce high order multipole CC components. The impact of these high order components on the long term stability of the beam in the SPS machine",
        "where two prototype crab cavities are presently installed in the CERN SPS to perform tests with beam",
        "is presented. Furthermore",
        "the Dynamic Aperture is studied in the presence of the SPS errors. Future plans are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "F.G. Garcia",
        "S. Chaurize",
        "C.C. Drennan",
        "K. E. Gollwitzer",
        "V.A. Lebedev",
        "W. Pellico",
        "J. Reid",
        "C.-Y. Tan",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Fermilab Proton Source is composed of three machines: an injector line",
        "a normal conducting Linac and a Booster synchrotron. The proton improvement plan was proposed in 2012 to address the necessary accelerator upgrades and hardware modification to allow an increase in proton throughput",
        "while maintaining acceptable activation levels",
        "ensuring viable operation of the proton source to sustain the laboratory HEP program. A summary of work performed and respective results will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.S. Beck",
        "H. Bartosik",
        "M. Carlà",
        "K.S.B. Li",
        "G. Rumolo",
        "M. Schenkpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "In the framework of the LHC Injectors Upgrade (LIU)",
        "beams with about twice the intensity compared to the present values will have to be accelerated by the CERN Super Proton Synchrotron (SPS) and extracted towards the Large Hadron Collider (LHC). Machine studies with intensity higher than the nominal LHC beam have shown that coherent instabilities in both transverse planes may develop at injection energy",
        "potentially becoming a limitation for the future high intensity operation. In particular",
        "a transverse mode coupling instability is encountered in the vertical plane",
        "the threshold of which can be sufficiently increased by changing the machine optics. In addition",
        "a headtail instability of individual bunches is observed in the horizontal plane in multi-bunch operation",
        "which requires stabilization by high chromaticity. The PyHEADTAIL code has been used to check if the present SPS impedance model reproduces the experimental observations. The instability growth rates have been studied for different machine optics configurations and different chromaticity settings. Other stabilizing mechanisms like tune spread from octupoles or the transverse damper have also been investigated.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Jin",
        "Y. Choi",
        "S. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "In the RAON accelerator",
        "beams generated by ion sources like ECR-IS or ISOL are accelerated to an energy of up to 200 MeV/u before reaching the laboratory target",
        "and the beam power reaches up to about 400 kW at that moment. During transportation of such a beam",
        "if beam loss occurs due to a device malfunction or a sudden change in beam condition",
        "the accelerator can be severely damaged. Therefore",
        "we have developed a machine protection system to protect the devices by minimizing the damage and to operate the accelerator in safe. As part of the RAON machine protection system",
        "a FPGA-based fast protection system (FPS) that can protect devices within a few tens of microseconds after detecting the moment of beam loss has been developed since 2016. The development and test of the FPS prototype was successfully completed last year",
        "and we are now preparing for mass production of the FPS. Here we will present the progress of the FPS development and the future plan for the FPS in the RAON accelerator.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Kim",
        "J.W. Choi",
        "Y.W. Jo",
        "H.C. Jung",
        "Y. Jung",
        "J.W. Kim",
        "M.S. Kim",
        "Y. Kim",
        "M. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For China Spallation Neutron Source (CSNS)",
        "the septum magnets are the key part of the injection system and the lambertson magnet is the key part of the extraction system. If the leakage fields of the septum and lambertson magnets are large enough",
        "the circular beam orbit of Rapid Cycling Synchrotron (RCS) would be affected. In this paper",
        "during the beam commissioning",
        "the leakage fields of the septum and lambertson magnets will be studied and their effects on the circular beam orbit will be given and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "S.Y. Xu",
        "S. Fu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Because of the differences of magnetic saturation and eddy current effects between different magnets",
        "magnetic field tracking errors between different magnets is larger than 2.5 % at the Rapid Cycling Synchrotron (RCS) of Chinese Spallation Neutron Source (CSNS)",
        "and the induced tune shift is larger than 0.1. So larger tune shift may lead the beam to pass through the resonance lines. To reduce the magnetic field tracking errors",
        "a method of wave form compensation for magnets of the Rapid Cycling Synchrotron was investigated on the magnets of CSNS/RCS. The wave form compensation was applied to CSNS/RCS commissioning. By performing wave form compensation",
        "the maximum magnetic field tracking error was reduced from 2.5 % to 0.08 %",
        "and the maximum tune shift over the ramping process was reduced from 0.1 to 0.004.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "At injection into the CERN Proton Synchrotron (PS) a significant horizontal emittance blow-up of the present high brightness beams for the LHC is observed. A partial contribution to this effect is suspected to be an important mismatch between the dispersion function in the transfer line from the PS Booster (PSB) and the ring itself. This mismatch will be unacceptable in view of the beam parameters requested by the LHC Injectors Upgrade (LIU) project with high longitudinal emittance and momentum spread. To deliver the requested beam parameters the PSB-to-PS transfer line will be upgraded and the optics in the line changed to improve the matching from all the four PSB rings. A re-matching campaign from the PSB ring 3 has been carried out to evaluate the impact of the present optics mismatch as a source of emittance growth both in simulations and measurements.",
        "Multi-Particle Simulations of the Future CERN PSB Injection Process with Updated Linac4 Beam Performance",
        "Studies of Transverse Instabilities in the CERN SPS",
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO006 reference for this paper using reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO007 reference for this paper using SPS Long Term Stability Studies in the Presence of Crab Cavities and High Order Multipoles reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO008 reference for this paper using Fermilab - The Proton Improvement Plan (PIP) Poster WEP2PO010 [1.699 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO010 reference for this paper using Poster WEP2PO011 [4.940 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO011 reference for this paper using Progress and Plan of the Fast Protection System in the RAON Accelerator reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO015 reference for this paper using Temperature Measurement of Cryomodules A quarter-wave resonator (QWR) and a half-wave resonator (HWR) cryomodules and the control systems such as programmable logic controller (PLC) are developed. Temperature sensors such as Cernox-1050 are calibrated and applied to the cryomodules. Preparation of vertical test is introduced. QWR and HWR cryomodules are fabricated and tested by using the developed PLC control system. The PLC rack and temperature monitors are shown and the human machine interfaces (HMI) screen is shown when the HWR cryomodules is tested at 2 K. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO016 reference for this paper using Study on the Leakage Fields of the Septum and Lambertson Magnets during the Beam Commissioning Poster WEP2PO017 [0.852 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO017 reference for this paper using Magnetic Field Tracking at CSNS/RCS reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO018 reference for this paper using Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po006.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO006",
      "page_number": "272",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEP2PO007",
      "title": "Multi-Particle Simulations of the Future CERN PSB Injection Process with Updated Linac4 Beam Performance",
      "authors": [
        "V. Forte",
        "C. Bracco",
        "G.P. Di Giovanni",
        "M.A. Fraser",
        "A.M. Lombardi",
        "B. Mikulec",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the framework of the LHC Injectors Upgrade (LIU) project",
        "the injection process in the CERN Proton Synchrotron Booster (PSB) will be renovated after the connection with the Linac4. A new H− charge exchange injection system using a stripping foil is foreseen to increase the brightness of the stored beams and to provide high flexibility in terms of emittance tailoring at 160 MeV. Realistic multi-particle simulations of the future injection processes for high brightness beams (i.e. for the LHC) and high intensity beams (i.e. for the ISOLDE experiment) are presented in this paper. The simulations are based on the present performance of Linac4 and include scattering induced by the foil",
        "space charge effects and compensation of the lattice perturbation introduced by the bumpers of the injection chicane.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "A. Alekou",
        "H. Bartosikpresenter",
        "R. Calaga",
        "M. Carlà",
        "Y. Papaphilippou",
        "CERN",
        "Geneva",
        "Switzerland",
        "R.B. Appleby",
        "R.B. Appleby",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A local Crab Cavity (CC) scheme will recover the head-on collisions at the IP of the High Luminosity LHC (HL-LHC)",
        "which aims to increase the LHC luminosity by a factor of 3-10. The tight space constraints at the CC location result in axially non-symmetric cavity designs that introduce high order multipole CC components. The impact of these high order components on the long term stability of the beam in the SPS machine",
        "where two prototype crab cavities are presently installed in the CERN SPS to perform tests with beam",
        "is presented. Furthermore",
        "the Dynamic Aperture is studied in the presence of the SPS errors. Future plans are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "F.G. Garcia",
        "S. Chaurize",
        "C.C. Drennan",
        "K. E. Gollwitzer",
        "V.A. Lebedev",
        "W. Pellico",
        "J. Reid",
        "C.-Y. Tan",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Fermilab Proton Source is composed of three machines: an injector line",
        "a normal conducting Linac and a Booster synchrotron. The proton improvement plan was proposed in 2012 to address the necessary accelerator upgrades and hardware modification to allow an increase in proton throughput",
        "while maintaining acceptable activation levels",
        "ensuring viable operation of the proton source to sustain the laboratory HEP program. A summary of work performed and respective results will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.S. Beck",
        "H. Bartosik",
        "M. Carlà",
        "K.S.B. Li",
        "G. Rumolo",
        "M. Schenkpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "In the framework of the LHC Injectors Upgrade (LIU)",
        "beams with about twice the intensity compared to the present values will have to be accelerated by the CERN Super Proton Synchrotron (SPS) and extracted towards the Large Hadron Collider (LHC). Machine studies with intensity higher than the nominal LHC beam have shown that coherent instabilities in both transverse planes may develop at injection energy",
        "potentially becoming a limitation for the future high intensity operation. In particular",
        "a transverse mode coupling instability is encountered in the vertical plane",
        "the threshold of which can be sufficiently increased by changing the machine optics. In addition",
        "a headtail instability of individual bunches is observed in the horizontal plane in multi-bunch operation",
        "which requires stabilization by high chromaticity. The PyHEADTAIL code has been used to check if the present SPS impedance model reproduces the experimental observations. The instability growth rates have been studied for different machine optics configurations and different chromaticity settings. Other stabilizing mechanisms like tune spread from octupoles or the transverse damper have also been investigated.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Jin",
        "Y. Choi",
        "S. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "In the RAON accelerator",
        "beams generated by ion sources like ECR-IS or ISOL are accelerated to an energy of up to 200 MeV/u before reaching the laboratory target",
        "and the beam power reaches up to about 400 kW at that moment. During transportation of such a beam",
        "if beam loss occurs due to a device malfunction or a sudden change in beam condition",
        "the accelerator can be severely damaged. Therefore",
        "we have developed a machine protection system to protect the devices by minimizing the damage and to operate the accelerator in safe. As part of the RAON machine protection system",
        "a FPGA-based fast protection system (FPS) that can protect devices within a few tens of microseconds after detecting the moment of beam loss has been developed since 2016. The development and test of the FPS prototype was successfully completed last year",
        "and we are now preparing for mass production of the FPS. Here we will present the progress of the FPS development and the future plan for the FPS in the RAON accelerator.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Kim",
        "J.W. Choi",
        "Y.W. Jo",
        "H.C. Jung",
        "Y. Jung",
        "J.W. Kim",
        "M.S. Kim",
        "Y. Kim",
        "M. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For China Spallation Neutron Source (CSNS)",
        "the septum magnets are the key part of the injection system and the lambertson magnet is the key part of the extraction system. If the leakage fields of the septum and lambertson magnets are large enough",
        "the circular beam orbit of Rapid Cycling Synchrotron (RCS) would be affected. In this paper",
        "during the beam commissioning",
        "the leakage fields of the septum and lambertson magnets will be studied and their effects on the circular beam orbit will be given and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "S.Y. Xu",
        "S. Fu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Because of the differences of magnetic saturation and eddy current effects between different magnets",
        "magnetic field tracking errors between different magnets is larger than 2.5 % at the Rapid Cycling Synchrotron (RCS) of Chinese Spallation Neutron Source (CSNS)",
        "and the induced tune shift is larger than 0.1. So larger tune shift may lead the beam to pass through the resonance lines. To reduce the magnetic field tracking errors",
        "a method of wave form compensation for magnets of the Rapid Cycling Synchrotron was investigated on the magnets of CSNS/RCS. The wave form compensation was applied to CSNS/RCS commissioning. By performing wave form compensation",
        "the maximum magnetic field tracking error was reduced from 2.5 % to 0.08 %",
        "and the maximum tune shift over the ramping process was reduced from 0.1 to 0.004.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Studies of Transverse Instabilities in the CERN SPS",
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO007 reference for this paper using SPS Long Term Stability Studies in the Presence of Crab Cavities and High Order Multipoles reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO008 reference for this paper using Fermilab - The Proton Improvement Plan (PIP) Poster WEP2PO010 [1.699 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO010 reference for this paper using Poster WEP2PO011 [4.940 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO011 reference for this paper using Progress and Plan of the Fast Protection System in the RAON Accelerator reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO015 reference for this paper using Temperature Measurement of Cryomodules A quarter-wave resonator (QWR) and a half-wave resonator (HWR) cryomodules and the control systems such as programmable logic controller (PLC) are developed. Temperature sensors such as Cernox-1050 are calibrated and applied to the cryomodules. Preparation of vertical test is introduced. QWR and HWR cryomodules are fabricated and tested by using the developed PLC control system. The PLC rack and temperature monitors are shown and the human machine interfaces (HMI) screen is shown when the HWR cryomodules is tested at 2 K. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO016 reference for this paper using Study on the Leakage Fields of the Septum and Lambertson Magnets during the Beam Commissioning Poster WEP2PO017 [0.852 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO017 reference for this paper using Magnetic Field Tracking at CSNS/RCS reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO018 reference for this paper using Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po007.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO007",
      "page_number": "278",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEP2PO008",
      "title": "SPS Long Term Stability Studies in the Presence of Crab Cavities and High Order Multipoles",
      "authors": [
        "A. Alekou",
        "H. Bartosikpresenter",
        "R. Calaga",
        "M. Carlà",
        "Y. Papaphilippou",
        "CERN",
        "Geneva",
        "Switzerland",
        "R.B. Appleby",
        "R.B. Appleby",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A local Crab Cavity (CC) scheme will recover the head-on collisions at the IP of the High Luminosity LHC (HL-LHC)",
        "which aims to increase the LHC luminosity by a factor of 3-10. The tight space constraints at the CC location result in axially non-symmetric cavity designs that introduce high order multipole CC components. The impact of these high order components on the long term stability of the beam in the SPS machine",
        "where two prototype crab cavities are presently installed in the CERN SPS to perform tests with beam",
        "is presented. Furthermore",
        "the Dynamic Aperture is studied in the presence of the SPS errors. Future plans are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "F.G. Garcia",
        "S. Chaurize",
        "C.C. Drennan",
        "K. E. Gollwitzer",
        "V.A. Lebedev",
        "W. Pellico",
        "J. Reid",
        "C.-Y. Tan",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Fermilab Proton Source is composed of three machines: an injector line",
        "a normal conducting Linac and a Booster synchrotron. The proton improvement plan was proposed in 2012 to address the necessary accelerator upgrades and hardware modification to allow an increase in proton throughput",
        "while maintaining acceptable activation levels",
        "ensuring viable operation of the proton source to sustain the laboratory HEP program. A summary of work performed and respective results will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.S. Beck",
        "H. Bartosik",
        "M. Carlà",
        "K.S.B. Li",
        "G. Rumolo",
        "M. Schenkpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "In the framework of the LHC Injectors Upgrade (LIU)",
        "beams with about twice the intensity compared to the present values will have to be accelerated by the CERN Super Proton Synchrotron (SPS) and extracted towards the Large Hadron Collider (LHC). Machine studies with intensity higher than the nominal LHC beam have shown that coherent instabilities in both transverse planes may develop at injection energy",
        "potentially becoming a limitation for the future high intensity operation. In particular",
        "a transverse mode coupling instability is encountered in the vertical plane",
        "the threshold of which can be sufficiently increased by changing the machine optics. In addition",
        "a headtail instability of individual bunches is observed in the horizontal plane in multi-bunch operation",
        "which requires stabilization by high chromaticity. The PyHEADTAIL code has been used to check if the present SPS impedance model reproduces the experimental observations. The instability growth rates have been studied for different machine optics configurations and different chromaticity settings. Other stabilizing mechanisms like tune spread from octupoles or the transverse damper have also been investigated.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Jin",
        "Y. Choi",
        "S. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "In the RAON accelerator",
        "beams generated by ion sources like ECR-IS or ISOL are accelerated to an energy of up to 200 MeV/u before reaching the laboratory target",
        "and the beam power reaches up to about 400 kW at that moment. During transportation of such a beam",
        "if beam loss occurs due to a device malfunction or a sudden change in beam condition",
        "the accelerator can be severely damaged. Therefore",
        "we have developed a machine protection system to protect the devices by minimizing the damage and to operate the accelerator in safe. As part of the RAON machine protection system",
        "a FPGA-based fast protection system (FPS) that can protect devices within a few tens of microseconds after detecting the moment of beam loss has been developed since 2016. The development and test of the FPS prototype was successfully completed last year",
        "and we are now preparing for mass production of the FPS. Here we will present the progress of the FPS development and the future plan for the FPS in the RAON accelerator.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Kim",
        "J.W. Choi",
        "Y.W. Jo",
        "H.C. Jung",
        "Y. Jung",
        "J.W. Kim",
        "M.S. Kim",
        "Y. Kim",
        "M. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For China Spallation Neutron Source (CSNS)",
        "the septum magnets are the key part of the injection system and the lambertson magnet is the key part of the extraction system. If the leakage fields of the septum and lambertson magnets are large enough",
        "the circular beam orbit of Rapid Cycling Synchrotron (RCS) would be affected. In this paper",
        "during the beam commissioning",
        "the leakage fields of the septum and lambertson magnets will be studied and their effects on the circular beam orbit will be given and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "S.Y. Xu",
        "S. Fu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Because of the differences of magnetic saturation and eddy current effects between different magnets",
        "magnetic field tracking errors between different magnets is larger than 2.5 % at the Rapid Cycling Synchrotron (RCS) of Chinese Spallation Neutron Source (CSNS)",
        "and the induced tune shift is larger than 0.1. So larger tune shift may lead the beam to pass through the resonance lines. To reduce the magnetic field tracking errors",
        "a method of wave form compensation for magnets of the Rapid Cycling Synchrotron was investigated on the magnets of CSNS/RCS. The wave form compensation was applied to CSNS/RCS commissioning. By performing wave form compensation",
        "the maximum magnetic field tracking error was reduced from 2.5 % to 0.08 %",
        "and the maximum tune shift over the ramping process was reduced from 0.1 to 0.004.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Studies of Transverse Instabilities in the CERN SPS",
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO008 reference for this paper using Fermilab - The Proton Improvement Plan (PIP) Poster WEP2PO010 [1.699 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO010 reference for this paper using Poster WEP2PO011 [4.940 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO011 reference for this paper using Progress and Plan of the Fast Protection System in the RAON Accelerator reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO015 reference for this paper using Temperature Measurement of Cryomodules A quarter-wave resonator (QWR) and a half-wave resonator (HWR) cryomodules and the control systems such as programmable logic controller (PLC) are developed. Temperature sensors such as Cernox-1050 are calibrated and applied to the cryomodules. Preparation of vertical test is introduced. QWR and HWR cryomodules are fabricated and tested by using the developed PLC control system. The PLC rack and temperature monitors are shown and the human machine interfaces (HMI) screen is shown when the HWR cryomodules is tested at 2 K. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO016 reference for this paper using Study on the Leakage Fields of the Septum and Lambertson Magnets during the Beam Commissioning Poster WEP2PO017 [0.852 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO017 reference for this paper using Magnetic Field Tracking at CSNS/RCS reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO018 reference for this paper using Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po008.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO008",
      "page_number": "284",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEP2PO010",
      "title": "Fermilab - The Proton Improvement Plan (PIP)",
      "authors": [
        "F.G. Garcia",
        "S. Chaurize",
        "C.C. Drennan",
        "K. E. Gollwitzer",
        "V.A. Lebedev",
        "W. Pellico",
        "J. Reid",
        "C.-Y. Tan",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The Fermilab Proton Source is composed of three machines: an injector line",
        "a normal conducting Linac and a Booster synchrotron. The proton improvement plan was proposed in 2012 to address the necessary accelerator upgrades and hardware modification to allow an increase in proton throughput",
        "while maintaining acceptable activation levels",
        "ensuring viable operation of the proton source to sustain the laboratory HEP program. A summary of work performed and respective results will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.S. Beck",
        "H. Bartosik",
        "M. Carlà",
        "K.S.B. Li",
        "G. Rumolo",
        "M. Schenkpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "In the framework of the LHC Injectors Upgrade (LIU)",
        "beams with about twice the intensity compared to the present values will have to be accelerated by the CERN Super Proton Synchrotron (SPS) and extracted towards the Large Hadron Collider (LHC). Machine studies with intensity higher than the nominal LHC beam have shown that coherent instabilities in both transverse planes may develop at injection energy",
        "potentially becoming a limitation for the future high intensity operation. In particular",
        "a transverse mode coupling instability is encountered in the vertical plane",
        "the threshold of which can be sufficiently increased by changing the machine optics. In addition",
        "a headtail instability of individual bunches is observed in the horizontal plane in multi-bunch operation",
        "which requires stabilization by high chromaticity. The PyHEADTAIL code has been used to check if the present SPS impedance model reproduces the experimental observations. The instability growth rates have been studied for different machine optics configurations and different chromaticity settings. Other stabilizing mechanisms like tune spread from octupoles or the transverse damper have also been investigated.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Jin",
        "Y. Choi",
        "S. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "In the RAON accelerator",
        "beams generated by ion sources like ECR-IS or ISOL are accelerated to an energy of up to 200 MeV/u before reaching the laboratory target",
        "and the beam power reaches up to about 400 kW at that moment. During transportation of such a beam",
        "if beam loss occurs due to a device malfunction or a sudden change in beam condition",
        "the accelerator can be severely damaged. Therefore",
        "we have developed a machine protection system to protect the devices by minimizing the damage and to operate the accelerator in safe. As part of the RAON machine protection system",
        "a FPGA-based fast protection system (FPS) that can protect devices within a few tens of microseconds after detecting the moment of beam loss has been developed since 2016. The development and test of the FPS prototype was successfully completed last year",
        "and we are now preparing for mass production of the FPS. Here we will present the progress of the FPS development and the future plan for the FPS in the RAON accelerator.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Kim",
        "J.W. Choi",
        "Y.W. Jo",
        "H.C. Jung",
        "Y. Jung",
        "J.W. Kim",
        "M.S. Kim",
        "Y. Kim",
        "M. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For China Spallation Neutron Source (CSNS)",
        "the septum magnets are the key part of the injection system and the lambertson magnet is the key part of the extraction system. If the leakage fields of the septum and lambertson magnets are large enough",
        "the circular beam orbit of Rapid Cycling Synchrotron (RCS) would be affected. In this paper",
        "during the beam commissioning",
        "the leakage fields of the septum and lambertson magnets will be studied and their effects on the circular beam orbit will be given and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "S.Y. Xu",
        "S. Fu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Because of the differences of magnetic saturation and eddy current effects between different magnets",
        "magnetic field tracking errors between different magnets is larger than 2.5 % at the Rapid Cycling Synchrotron (RCS) of Chinese Spallation Neutron Source (CSNS)",
        "and the induced tune shift is larger than 0.1. So larger tune shift may lead the beam to pass through the resonance lines. To reduce the magnetic field tracking errors",
        "a method of wave form compensation for magnets of the Rapid Cycling Synchrotron was investigated on the magnets of CSNS/RCS. The wave form compensation was applied to CSNS/RCS commissioning. By performing wave form compensation",
        "the maximum magnetic field tracking error was reduced from 2.5 % to 0.08 %",
        "and the maximum tune shift over the ramping process was reduced from 0.1 to 0.004.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Studies of Transverse Instabilities in the CERN SPS",
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "Poster WEP2PO010 [1.699 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO010 reference for this paper using Poster WEP2PO011 [4.940 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO011 reference for this paper using Progress and Plan of the Fast Protection System in the RAON Accelerator reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO015 reference for this paper using Temperature Measurement of Cryomodules A quarter-wave resonator (QWR) and a half-wave resonator (HWR) cryomodules and the control systems such as programmable logic controller (PLC) are developed. Temperature sensors such as Cernox-1050 are calibrated and applied to the cryomodules. Preparation of vertical test is introduced. QWR and HWR cryomodules are fabricated and tested by using the developed PLC control system. The PLC rack and temperature monitors are shown and the human machine interfaces (HMI) screen is shown when the HWR cryomodules is tested at 2 K. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO016 reference for this paper using Study on the Leakage Fields of the Septum and Lambertson Magnets during the Beam Commissioning Poster WEP2PO017 [0.852 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO017 reference for this paper using Magnetic Field Tracking at CSNS/RCS reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO018 reference for this paper using Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po010.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO010",
      "page_number": "287",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEP2PO011",
      "title": "Studies of Transverse Instabilities in the CERN SPS",
      "authors": [
        "M.S. Beck",
        "H. Bartosik",
        "M. Carlà",
        "K.S.B. Li",
        "G. Rumolo",
        "M. Schenkpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Rostock University",
        "Faculty of Computer Science and Electrical Engineering",
        "Rostock",
        "Germany",
        "In the framework of the LHC Injectors Upgrade (LIU)",
        "beams with about twice the intensity compared to the present values will have to be accelerated by the CERN Super Proton Synchrotron (SPS) and extracted towards the Large Hadron Collider (LHC). Machine studies with intensity higher than the nominal LHC beam have shown that coherent instabilities in both transverse planes may develop at injection energy",
        "potentially becoming a limitation for the future high intensity operation. In particular",
        "a transverse mode coupling instability is encountered in the vertical plane",
        "the threshold of which can be sufficiently increased by changing the machine optics. In addition",
        "a headtail instability of individual bunches is observed in the horizontal plane in multi-bunch operation",
        "which requires stabilization by high chromaticity. The PyHEADTAIL code has been used to check if the present SPS impedance model reproduces the experimental observations. The instability growth rates have been studied for different machine optics configurations and different chromaticity settings. Other stabilizing mechanisms like tune spread from octupoles or the transverse damper have also been investigated.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Jin",
        "Y. Choi",
        "S. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "In the RAON accelerator",
        "beams generated by ion sources like ECR-IS or ISOL are accelerated to an energy of up to 200 MeV/u before reaching the laboratory target",
        "and the beam power reaches up to about 400 kW at that moment. During transportation of such a beam",
        "if beam loss occurs due to a device malfunction or a sudden change in beam condition",
        "the accelerator can be severely damaged. Therefore",
        "we have developed a machine protection system to protect the devices by minimizing the damage and to operate the accelerator in safe. As part of the RAON machine protection system",
        "a FPGA-based fast protection system (FPS) that can protect devices within a few tens of microseconds after detecting the moment of beam loss has been developed since 2016. The development and test of the FPS prototype was successfully completed last year",
        "and we are now preparing for mass production of the FPS. Here we will present the progress of the FPS development and the future plan for the FPS in the RAON accelerator.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Kim",
        "J.W. Choi",
        "Y.W. Jo",
        "H.C. Jung",
        "Y. Jung",
        "J.W. Kim",
        "M.S. Kim",
        "Y. Kim",
        "M. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For China Spallation Neutron Source (CSNS)",
        "the septum magnets are the key part of the injection system and the lambertson magnet is the key part of the extraction system. If the leakage fields of the septum and lambertson magnets are large enough",
        "the circular beam orbit of Rapid Cycling Synchrotron (RCS) would be affected. In this paper",
        "during the beam commissioning",
        "the leakage fields of the septum and lambertson magnets will be studied and their effects on the circular beam orbit will be given and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "S.Y. Xu",
        "S. Fu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Because of the differences of magnetic saturation and eddy current effects between different magnets",
        "magnetic field tracking errors between different magnets is larger than 2.5 % at the Rapid Cycling Synchrotron (RCS) of Chinese Spallation Neutron Source (CSNS)",
        "and the induced tune shift is larger than 0.1. So larger tune shift may lead the beam to pass through the resonance lines. To reduce the magnetic field tracking errors",
        "a method of wave form compensation for magnets of the Rapid Cycling Synchrotron was investigated on the magnets of CSNS/RCS. The wave form compensation was applied to CSNS/RCS commissioning. By performing wave form compensation",
        "the maximum magnetic field tracking error was reduced from 2.5 % to 0.08 %",
        "and the maximum tune shift over the ramping process was reduced from 0.1 to 0.004.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "Poster WEP2PO011 [4.940 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO011 reference for this paper using Progress and Plan of the Fast Protection System in the RAON Accelerator reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO015 reference for this paper using Temperature Measurement of Cryomodules A quarter-wave resonator (QWR) and a half-wave resonator (HWR) cryomodules and the control systems such as programmable logic controller (PLC) are developed. Temperature sensors such as Cernox-1050 are calibrated and applied to the cryomodules. Preparation of vertical test is introduced. QWR and HWR cryomodules are fabricated and tested by using the developed PLC control system. The PLC rack and temperature monitors are shown and the human machine interfaces (HMI) screen is shown when the HWR cryomodules is tested at 2 K. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO016 reference for this paper using Study on the Leakage Fields of the Septum and Lambertson Magnets during the Beam Commissioning Poster WEP2PO017 [0.852 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO017 reference for this paper using Magnetic Field Tracking at CSNS/RCS reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO018 reference for this paper using Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po011.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO011",
      "page_number": "291",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEP2PO015",
      "title": "Progress and Plan of the Fast Protection System in the RAON Accelerator",
      "authors": [
        "H. Jin",
        "Y. Choi",
        "S. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "In the RAON accelerator",
        "beams generated by ion sources like ECR-IS or ISOL are accelerated to an energy of up to 200 MeV/u before reaching the laboratory target",
        "and the beam power reaches up to about 400 kW at that moment. During transportation of such a beam",
        "if beam loss occurs due to a device malfunction or a sudden change in beam condition",
        "the accelerator can be severely damaged. Therefore",
        "we have developed a machine protection system to protect the devices by minimizing the damage and to operate the accelerator in safe. As part of the RAON machine protection system",
        "a FPGA-based fast protection system (FPS) that can protect devices within a few tens of microseconds after detecting the moment of beam loss has been developed since 2016. The development and test of the FPS prototype was successfully completed last year",
        "and we are now preparing for mass production of the FPS. Here we will present the progress of the FPS development and the future plan for the FPS in the RAON accelerator.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "H. Kim",
        "J.W. Choi",
        "Y.W. Jo",
        "H.C. Jung",
        "Y. Jung",
        "J.W. Kim",
        "M.S. Kim",
        "Y. Kim",
        "M. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For China Spallation Neutron Source (CSNS)",
        "the septum magnets are the key part of the injection system and the lambertson magnet is the key part of the extraction system. If the leakage fields of the septum and lambertson magnets are large enough",
        "the circular beam orbit of Rapid Cycling Synchrotron (RCS) would be affected. In this paper",
        "during the beam commissioning",
        "the leakage fields of the septum and lambertson magnets will be studied and their effects on the circular beam orbit will be given and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "S.Y. Xu",
        "S. Fu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Because of the differences of magnetic saturation and eddy current effects between different magnets",
        "magnetic field tracking errors between different magnets is larger than 2.5 % at the Rapid Cycling Synchrotron (RCS) of Chinese Spallation Neutron Source (CSNS)",
        "and the induced tune shift is larger than 0.1. So larger tune shift may lead the beam to pass through the resonance lines. To reduce the magnetic field tracking errors",
        "a method of wave form compensation for magnets of the Rapid Cycling Synchrotron was investigated on the magnets of CSNS/RCS. The wave form compensation was applied to CSNS/RCS commissioning. By performing wave form compensation",
        "the maximum magnetic field tracking error was reduced from 2.5 % to 0.08 %",
        "and the maximum tune shift over the ramping process was reduced from 0.1 to 0.004.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO015 reference for this paper using Temperature Measurement of Cryomodules A quarter-wave resonator (QWR) and a half-wave resonator (HWR) cryomodules and the control systems such as programmable logic controller (PLC) are developed. Temperature sensors such as Cernox-1050 are calibrated and applied to the cryomodules. Preparation of vertical test is introduced. QWR and HWR cryomodules are fabricated and tested by using the developed PLC control system. The PLC rack and temperature monitors are shown and the human machine interfaces (HMI) screen is shown when the HWR cryomodules is tested at 2 K. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO016 reference for this paper using Study on the Leakage Fields of the Septum and Lambertson Magnets during the Beam Commissioning Poster WEP2PO017 [0.852 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO017 reference for this paper using Magnetic Field Tracking at CSNS/RCS reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO018 reference for this paper using Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po015.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO015",
      "page_number": "296",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEP2PO016",
      "title": "Temperature Measurement of Cryomodules",
      "authors": [
        "H. Kim",
        "J.W. Choi",
        "Y.W. Jo",
        "H.C. Jung",
        "Y. Jung",
        "J.W. Kim",
        "M.S. Kim",
        "Y. Kim",
        "M. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For China Spallation Neutron Source (CSNS)",
        "the septum magnets are the key part of the injection system and the lambertson magnet is the key part of the extraction system. If the leakage fields of the septum and lambertson magnets are large enough",
        "the circular beam orbit of Rapid Cycling Synchrotron (RCS) would be affected. In this paper",
        "during the beam commissioning",
        "the leakage fields of the septum and lambertson magnets will be studied and their effects on the circular beam orbit will be given and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "S.Y. Xu",
        "S. Fu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Because of the differences of magnetic saturation and eddy current effects between different magnets",
        "magnetic field tracking errors between different magnets is larger than 2.5 % at the Rapid Cycling Synchrotron (RCS) of Chinese Spallation Neutron Source (CSNS)",
        "and the induced tune shift is larger than 0.1. So larger tune shift may lead the beam to pass through the resonance lines. To reduce the magnetic field tracking errors",
        "a method of wave form compensation for magnets of the Rapid Cycling Synchrotron was investigated on the magnets of CSNS/RCS. The wave form compensation was applied to CSNS/RCS commissioning. By performing wave form compensation",
        "the maximum magnetic field tracking error was reduced from 2.5 % to 0.08 %",
        "and the maximum tune shift over the ramping process was reduced from 0.1 to 0.004.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "A quarter-wave resonator (QWR) and a half-wave resonator (HWR) cryomodules and the control systems such as programmable logic controller (PLC) are developed. Temperature sensors such as Cernox-1050 are calibrated and applied to the cryomodules. Preparation of vertical test is introduced. QWR and HWR cryomodules are fabricated and tested by using the developed PLC control system. The PLC rack and temperature monitors are shown and the human machine interfaces (HMI) screen is shown when the HWR cryomodules is tested at 2 K. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO016 reference for this paper using Study on the Leakage Fields of the Septum and Lambertson Magnets during the Beam Commissioning Poster WEP2PO017 [0.852 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO017 reference for this paper using Magnetic Field Tracking at CSNS/RCS reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO018 reference for this paper using Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po016.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO016",
      "page_number": "299",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEP2PO017",
      "title": "Study on the Leakage Fields of the Septum and Lambertson Magnets during the Beam Commissioning",
      "authors": [
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "For China Spallation Neutron Source (CSNS)",
        "the septum magnets are the key part of the injection system and the lambertson magnet is the key part of the extraction system. If the leakage fields of the septum and lambertson magnets are large enough",
        "the circular beam orbit of Rapid Cycling Synchrotron (RCS) would be affected. In this paper",
        "during the beam commissioning",
        "the leakage fields of the septum and lambertson magnets will be studied and their effects on the circular beam orbit will be given and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "S.Y. Xu",
        "S. Fu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Because of the differences of magnetic saturation and eddy current effects between different magnets",
        "magnetic field tracking errors between different magnets is larger than 2.5 % at the Rapid Cycling Synchrotron (RCS) of Chinese Spallation Neutron Source (CSNS)",
        "and the induced tune shift is larger than 0.1. So larger tune shift may lead the beam to pass through the resonance lines. To reduce the magnetic field tracking errors",
        "a method of wave form compensation for magnets of the Rapid Cycling Synchrotron was investigated on the magnets of CSNS/RCS. The wave form compensation was applied to CSNS/RCS commissioning. By performing wave form compensation",
        "the maximum magnetic field tracking error was reduced from 2.5 % to 0.08 %",
        "and the maximum tune shift over the ramping process was reduced from 0.1 to 0.004.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "Poster WEP2PO017 [0.852 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO017 reference for this paper using Magnetic Field Tracking at CSNS/RCS reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO018 reference for this paper using Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po017.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO017",
      "page_number": "303",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEP2PO018",
      "title": "Magnetic Field Tracking at CSNS/RCS",
      "authors": [
        "S.Y. Xu",
        "S. Fu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Because of the differences of magnetic saturation and eddy current effects between different magnets",
        "magnetic field tracking errors between different magnets is larger than 2.5 % at the Rapid Cycling Synchrotron (RCS) of Chinese Spallation Neutron Source (CSNS)",
        "and the induced tune shift is larger than 0.1. So larger tune shift may lead the beam to pass through the resonance lines. To reduce the magnetic field tracking errors",
        "a method of wave form compensation for magnets of the Rapid Cycling Synchrotron was investigated on the magnets of CSNS/RCS. The wave form compensation was applied to CSNS/RCS commissioning. By performing wave form compensation",
        "the maximum magnetic field tracking error was reduced from 2.5 % to 0.08 %",
        "and the maximum tune shift over the ramping process was reduced from 0.1 to 0.004.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO018 reference for this paper using Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po018.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO018",
      "page_number": "306",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEP2PO022",
      "title": "Study on the Phase Space Painting Injection during the Beam Commissioning for CSNS",
      "authors": [
        "M.Y. Huang",
        "S. Wang",
        "S.Y. Xupresenter",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "During the beam commissioning of China Spallation Neutron Source (CSNS)",
        "different injection methods were used in different periods. In the early stage",
        "since the precise position of the injection point was unknown and the beam power was relatively small",
        "the fixed point injection was selected. In the later period",
        "in order to increase the beam power and reduce the beam loss",
        "the phase space painting method was used. In this paper",
        "the phase space painting in the horizontal and vertical planes is studied in detail and the beam commissioning results of different painting injection are given and discussed. In addition",
        "the different injection effects of the fixed point injection and painting injection are compared and studied.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "Poster WEP2PO022 [0.708 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO022 reference for this paper using Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po022.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO022",
      "page_number": "309",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEP2PO023",
      "title": "Timing Adjustment of Eight Kickers and a Method to Calibrate the Kicker Current Curves During the Beam Commissioning for CSNS",
      "authors": [
        "M.Y. Huang",
        "D.P. Jin",
        "L. Shen",
        "S. Wang",
        "S.Y. Xupresenter",
        "P. Zhu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The extraction system is a key part of the China Spallation Neutron Source (CSNS) accelerator. It consists of two kinds of magnets: eight kickers and one lambertson. During the beam commissioning",
        "the timing adjustment of eight kickers is a very important problem. In the paper",
        "the methods to adjust the timing of eight kickers will be studied and applied to the beam commissioning. Then",
        "the best method to adjust the timing of eight kickers will be given and used for a long time in the future.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "Poster WEP2PO023 [1.027 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO023 reference for this paper using Resonance Stop-bands Compensation at Booster Ring of HIAF Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po023.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO023",
      "page_number": "312",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEP2PO024",
      "title": "Resonance Stop-bands Compensation at Booster Ring of HIAF",
      "authors": [
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 0.3-1.0·1011 number of 238U35+ ions by painting injection and deliver over such intensity beam in extraction. However",
        "depressed tune spread caused by space charge effect crosses the low-order resonance stop-bands after bunching the storage beam. To keep a low beam loss during crossing",
        "stop-band compensation scheme is proposed covering the whole process of RF capture and early acceleration.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "Poster WEP2PO024 [1.218 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO024 reference for this paper using Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po024.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO024",
      "page_number": "315",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEP2PO027",
      "title": "Simulation of the Axial Injection Beam Line of the Reconstructed U200 Cyclotron of FLNR JINR",
      "authors": [
        "N.Yu. Kazarinov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begin the works under reconstruction of the cyclotron U200. The reconstructed cyclotron is intended for acceleration of heavy ions with mass-to-charge ratio A/Z within interval from 5 to 8 up to the fixed energies 3.5 and 5.3 MeV per unit mass. The intensity of the accelerated ions will be about 3 pmcA for lighter ions (A< 40) and about 0.3 pmcA for heavier ions (A<132). The cyclotron will be used in the microchip testing",
        "production of the track pore membranes and for applied physics. The injection into cyclotron will be realized from the external superconducting ECR ion source. The simulation of the axial injection system of the cyclotron is presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron"
      ],
      "abstract": "Poster WEP2PO027 [0.679 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO027 reference for this paper using Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po027.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO027",
      "page_number": "319",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEP2PO028",
      "title": "Conceptual Design of FLNR JINR Radiation Facility Based on DC130 Cyclotron",
      "authors": [
        "N.Yu. Kazarinov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "V.I. Mironov",
        "S.V. Mitrofanov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Flerov Laboratory of Nuclear Reaction of Joint Institute for Nuclear Research begins the works under the conceptual design of radiation facility based on the DC130 cyclotron. The facility is intended for SEE testing of microchips",
        "for production of track membranes and for solving of applied physics problems. The DC130 cyclotron will accelerate heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The intensity of the accelerated ions will be about 1 pmcA for lighter ions (A<50) and about 0.1 pmcA for heavier ions (A>50). The injection into cyclotron will be realized from the external DECRIS-SC superconducting ECR ion source. The main magnet and acceleration system of DC130 is based on the U200 cyclotron ones that now is under reconstruction. The conceptual design parameters of various systems of the cyclotron and the set of experimental beam lines are presented in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "Poster WEP2PO028 [1.955 MB] reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO028 reference for this paper using A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po028.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO028",
      "page_number": "324",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEP2PO030",
      "title": "A 4D Emittance Measurement Device for the 870 keV HIPA Injection Line",
      "authors": [
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A 4D emittance measurement device has recently been installed in PSI's high intensity proton accelerator (HIPA) after the acceleration tube of the Cockcroft-Walton pre-accelerator. A pinhole collimator is moved 2D transversally and at each collimator position",
        "the resulting beamlet is downstream scanned 2D by vertically moving over it a horizontal linear array of small electrodes. The properties of this setup and the intended use are discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO030 reference for this paper using A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po030.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO030",
      "page_number": "329",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEP2PO032",
      "title": "A Secondary Emission Monitor in the SINQ Beam Line for Improved Target Protection",
      "authors": [
        "R. Dölling",
        "M. Rohrer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS",
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "A 4-strip secondary-emission monitor (SEM) has been installed in the beam line to the SINQ neutron source to detect irregular fractions of the megawatt proton beam which might damage the spallation target. We discuss the estimated performance of the monitor as well as its design and implementation. reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO032 reference for this paper using A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po032.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO032",
      "page_number": "334",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEP2PO033",
      "title": "A Test of Stripper Foil Lifetime in PSI's 72 MeV Proton Beam",
      "authors": [
        "R. Dölling",
        "R. Dressler",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "INFN/LNS",
        "Catania",
        "Italy",
        "A test of the lifetime of an amorphous carbon foil of ~79 ug/cm2 was performed at PSI in the transfer line between Injector 2 and Ring cyclotron during the regularly beam production. The 72 MeV ~1.7 mA proton beam had a central current density of ~2.8 mA/cm2. Two spots on the foil were irradiated alternatively with in total three fractions of 17",
        "52 and 119 mAh. Foil thickness was measured before and after irradiation at several positions via the energy loss of alpha-particles from a 241Am source in the foil. We discuss the observed foil damage as well as the experimental setup",
        "the estimation of the beam parameters and practical boundary conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-HB2018-WEP2PO033 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/hb2018/talks/wep2po033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2018/papers/wep2po033.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2018/posters/wep2po033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2018-WEP2PO033",
      "page_number": "338",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 20,
  "scrape_time": "2025-10-10 17:11:20"
}