{
  "session_info": {
    "id": "WEPA",
    "name": "WEPA - Wednesday Poster A",
    "url": "https://proceedings.jacow.org/ibic2018/html/wepa.htm"
  },
  "papers": [
    {
      "paper_id": "WEPA01",
      "title": "A MicroTCA.4  Timing Receiver for the Sirius Timing System",
      "authors": [
        "J.L. Brito Neto",
        "G.B.M. Bruno",
        "S.R. Marques",
        "L.M. Russo",
        "D.O. Tavarespresenter",
        "LNLS",
        "Campinas",
        "Brazil",
        "The AMC FMC carrier (AFC) is a MicroTCA.4 AMC board which has a very flexible clock circuit that enables any clock source to be connected to any clock input",
        "including telecom clock",
        "FMC clocks",
        "programmable VCXO oscillator and FPGA. This paper presents the use of the AFC board as an event receiver connected to the Sirius timing system to provide low jitter synchronized clocks and triggers for Sirius BPM electronics and other devices."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa01.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA01",
      "page_number": "375",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA02",
      "title": "Recent Progress of Bunch Resolved Beam Diagnostics for BESSY VSR",
      "authors": [
        "J.G. Hwang",
        "T. Atkinson",
        "P. Goslawski",
        "A. Jankowiak",
        "M. Koopmans",
        "T. Mertens",
        "M. Ries",
        "A. Schälicke",
        "G. Schiwietz",
        "HZB",
        "Berlin",
        "Germany",
        "BESSY VSR is an upgrade project of the existing storage ring BESSY II to create long and short photon pulses simultaneously for all beam lines by installing additional superconducting cavities with harmonic frequencies of 1.5 GHz and 1.75 GHz. The storage-ring operation will be influenced by a transient beam-loading effect of all cavities and by the complex filling pattern due to the disparity in the current of long and short bunches. This",
        "in turn",
        "could introduce a variation of beam trajectory",
        "transverse profile",
        "and length for the different bunches. This stimulates the development of bunch-resolved monitors for bunch length",
        "beam size",
        "filling pattern and beam trajectory displacement. In this paper",
        "we show new developments of crucial beam diagnostics including measurements of the bunch-resolved temporal profile with a resolution of less than 1 ps FWHM and bunch-resolved profile with a resolution of less than 10 um rms. The upgrade of the booster beam-diagnostics will be discussed as well."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa02.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA02",
      "page_number": "379",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPA06",
      "title": "Thermal Coefficient of Delay Measurement of the New Phase Stable Optical Fiber",
      "authors": [
        "L. Liu",
        "X. Ma",
        "G. Pei",
        "IHEP",
        "Beijing",
        "People’s Republic of China"
      ],
      "institutions": [],
      "abstract": "The Thermal Coefficient of Delay (TCD) is an essen-tial parameter of optical fiber which determines a fiber’s phase transfer stability due to temperature variation. The TCD of a new phase stable single mode optical fiber (YPSOC) from Yangtze Optical Fibre and Cable Compa-ny (YOFC) is measured. The radio frequency (RF) signal is modulated to optical wave by a laser module which is transmitted through the 400-meter long YPSOC to be measured. The returned optical wave is demodulated to RF signal by the photodetector. A phase detector and a data acquisition module (DAQ) are used to acquire the phase difference between the forward and returned sig-nals. Two temperature-stabilized cabinets are designed to maintain and control the ambient temperature of the measurement system. The TCD of less than 10ps/km/K at room temperature is obtained. YPSOC and the meas-urement platform can be applied on signal transmission or measurement system that need to compensate the temperature drift.",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa06.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA06",
      "page_number": "383",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA07",
      "title": "Beam Phase Measurement System in CSNS Linac",
      "authors": [
        "P. Li",
        "J. Peng",
        "IHEP CSNS",
        "Guangdong Province",
        "People’s Republic of China",
        "F. Li",
        "T.G. Xu",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "DNSC",
        "Dongguan",
        "People’s Republic of China",
        "CETC",
        "Shushan",
        "People’s Republic of China"
      ],
      "institutions": [],
      "abstract": "We developed beam phase measurement system ourselves in CSNS (China Spallation Neutron Source). The resolution of the system is less than 0.1° and the accuracy is less than 1°. It played a key role in CSNS Linac commissioning especially in RFQ and DTL commissioning. Further we measured the beam energy by TOF (Time of Flight) method base on this system. The energy accuracy is less than 0.1 MeV.",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa07.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA07",
      "page_number": "386",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA09",
      "title": "Long Term Beam Phase Monitoring Based on HOM Signals in SC Cavities at FLASH",
      "authors": [
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "DESY",
        "Hamburg",
        "Germany",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The accelerating RF fields in superconducting cavities must be controlled precisely in FEL (Free Electron Laser) facilities to avoid beam energy spread and arrival time jitter. Otherwise the beam quality is degraded. The LLRF (Low Level Radio Frequency) system controls the RF field and provides a highly stable RF reference. A new type of beam phase determination technique based on beam-excited HOMs (Higher Order Modes) in cavities has been implemented. The two special couplers installed at both ends of each cavity",
        "pick up the signals containing both the leakage of the accelerating field and the HOM signals. Therefore the signals can be used to calculate the beam phase directly with respect to the RF phase. We analysed the factors which may affect the result of the beam phase on a long-term based on an experimental platform at FLASH. Some phase drifts between the HOM-BPhM (Beam Phase Monitor) and the LLRF system phase measurement were observed and the reason will be further studied."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa09.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA09",
      "page_number": "388",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA12",
      "title": "Differential Evolution Genetic Algorithm for Beam Bunch Temporal Reconstruction",
      "authors": [
        "D. Wu",
        "T.H. He",
        "C.L. Lao",
        "P. Li",
        "J. Liu",
        "X. Luo",
        "Q. Pan",
        "L.J. Shan",
        "X. Shen",
        "J. Wangpresenter",
        "D.X. Xiao",
        "L.G. Yan",
        "P. Zhang",
        "K. Zhou",
        "CAEP/IAE",
        "Mianyang",
        "Sichuan",
        "People’s Republic of China",
        "CAEP/IFP",
        "Mainyang",
        "Sichuan",
        "People’s Republic of China",
        "Coherent radiation",
        "such as coherent transition radiation",
        "coherent diffraction radiation",
        "coherent synchrotron radiation",
        "etc",
        "can be used to measure the longitudinal distribution of the electron beam bunch of any length",
        "as long as the coherent radiation spectrum can be measured. In many cases",
        "the Kramers-Krönig relationship is used to reconstruct the temporal distribution of the beam from the coherent radiation spectrum. However",
        "the extrapolation of the low frequency will introduce the uncertainty of the reconstruction. In this paper",
        "an algorithm of differential evolution (DE) for temporal reconstruction is discussed. The DE reconstruction works well for the complex and ultrashort distribution. It will be an effectIve tool to accurately measure the femtosecond bunch temporal structure."
      ],
      "institutions": [
        "Funding: Work supported by China National Natural Science Foundation of China with grant (11475159, 11505173, 11505174, 11575264, 11605190 and 11105019)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa12.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA12",
      "page_number": "392",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPA13",
      "title": "Electro-Optic Modulator Based Beam Arrival Time Monitor for SXFEL",
      "authors": [
        "X.Q. Liu",
        "L.F. Hua",
        "L.W. Lai",
        "Y.B. Leng",
        "R.X. Yuan",
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "SSRF",
        "Shanghai",
        "People’s Republic of China",
        "Beam arrival time monitor (BAM) is an important tool to investigate the temporal characteristic of elec-tron bunch in free electron laser (FEL) like Shanghai soft X-ray Free Electron Laser (SXFEL). Since the timing jitter of electron bunch will affect the FEL’s stability and the resolution of time-resolved experi-ment at FELs",
        "it is necessary to precisely measure the electron bunch arrival time so as to reduce the timing jitter of the electron bunch with beam based feedback. The beam arrival time monitor based on electro-optic modulator (EOM) is already planned and will be de-veloped and tested at SXFEL in the next three years. Here the design and preliminary results of the EOM based beam arrival time monitor will be introduced in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa13.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA13",
      "page_number": "396",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPA15",
      "title": "Development of BAM Electronics in PAL-XFEL",
      "authors": [
        "D.C. Shin",
        "J.H. Hong",
        "H.-S. Kang",
        "C. Kim",
        "G. Kim",
        "C.-K. Min",
        "PAL",
        "Pohang",
        "Republic of Korea",
        "We describe an electronics for electron bunch arrival time monitor (BAM) with a less than 10 femtosecond resolution",
        "which was developed in 2017 and is currently in use at PAL-XFEL. When electron bunches go through an S-band monopole cavity",
        "about 1 us long RF signal can be obtained to compare with a low phase noise RF reference. The differential phase jitter corresponds to the arrival time jitter of electron bunches. RF front-end (F/E) which converts the S-band pickup signal to intermediate frequency (IF) signal",
        "is the essential part of a good time resolution. The digitizer and the signal processor of the BAM electronics are installed in an MTCA platform. This paper presents the design scheme",
        "test results of the BAM electronics and future improvement plans."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa15.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA15",
      "page_number": "400",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPA16",
      "title": "Micro-Bunching Instability Monitor for X-ray Free Electron Laser",
      "authors": [
        "C. Kim",
        "H.-S. Kang",
        "G. Kim",
        "I.S. Ko",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "POSTECH",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "A direct method was developed to measure the micro-bunching instability in the X-ray Free Electron Laser (XFEL). The micro-bunching instability comes from the interaction between the electron beam and the coherent synchrotron radiation (CSR)",
        "and the FEL intensity can be affected significantly by the micro-bunching instability. However",
        "no effective method had been introduced to monitor the micro-bunching instability",
        "so that we installed a CCD camera to measure the micro-bunching instability after the bunch compressor. The CCD camera showed the micro-bunching instability successfully",
        "and more interesting features of the micro-bunching instability were revealed from it."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa16.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA16",
      "page_number": "404",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPA17",
      "title": "Development, Fabrication and Laboratory Tests of Bunch Shape Monitors for ESS Linac",
      "authors": [
        "S.A. Gavrilov",
        "D.A. Chermoshentsev",
        "A. Feschenko",
        "RAS/INR",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Two Bunch Shape Monitors have been developed and fabricated in INR RAS for European Spallation Source linac. To fulfil the requirements of a 4 ps phase resolution the symmetric λ-type RF-deflector based on the parallel wire line with capacitive plates has been selected. Additional steering magnet to correct incline of the focused electron beam is also used. Limitations due to space charge of the analysed beam and due to external magnetic fields are discussed. The results of the laboratory tests of the monitors are presented. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa17.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA17",
      "page_number": "407",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPA18",
      "title": "Development of Longitudinal Beam Profile Diagnostics for Beam-beam Effects Study at VEPP-2000",
      "authors": [
        "M.V. Timoshenko",
        "V.M. Borin",
        "O.I. Meshkov",
        "Yu. A. Rogovsky",
        "D.B. Shwartz",
        "Yu.M. Zharinov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "BINP",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The comprehensive development of beam longitudinal profile measurement systems based on stroboscopic optical dissector has started at VEPP-2000 electron-positron collider complex. The dissector was setted and commissioned at booster ring BEP that was deeply upgraded (2013-2015) to achieve top energy of 1 GeV. Bunch lengthening with current was studied at BEP with its new RF-cavity. In addition the method of synchrotron frequency measurement by dissector was applied. After dissector checkouts at BEP the similar studies were carried out with a single beam at VEPP-2000 storage ring in parallel with streak-camera measurements. Good agreement of results was observed. Series of single-turn longitudinal and vertical bunch profiles snapshots was made by streak-camera with respect to delay after counter beam injection. The unexpected longitudinal beam dynamics was observed for intensities above the beam-beam threshold. These studies together with beam-beam coherent oscillations spectra seen by pickups are of a great interest for understanding of flip-flop phenomenon which establish a fundamental luminosity limit at VEPP-2000 operating with round beams.",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa18.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA18",
      "page_number": "410",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPA19",
      "title": "Results from the CERN",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa19.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA19",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPA20",
      "title": "First Results From the Bunch Arrival-Time Monitors at SwissFEL",
      "authors": [
        "V.R. Arsov",
        "P. Chevtsov",
        "S. Hunziker",
        "M.G. Kaiser",
        "D. Llorente Sancho",
        "A. Romann",
        "V. Schlott",
        "M. Stadler",
        "D.M. Treyer",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Dach Consulting GmbH",
        "Brugg",
        "Switzerland",
        "Two Bunch Arrival-Time Monitors (BAM)",
        "based on fiber optical Mach-Zehnder intensity modulators",
        "which encode the arrival-time information in the amplitude of the laser pulses delivered through a highly stable pulsed optical reference distribution system",
        "have been commissioned and are operational at SwissFEL. The first BAM is at the RF-Gun",
        "the second one is downstream the first bunch compressor. Both BAMs operate simultaneously and measure the arrival-time drift and jitter with less than 5 fs resolution. For the first time we have experimentally verified the excellent SwissFEL bunch stability. We have developed concepts and tested hardware",
        "which enhance the commissioning and user operation. In particular we have successfully tested a tool for fast timing overlap between the electron bunch and the reference laser pulse",
        "which allows fast system set-up and characterization. We have verified the capability for 2-bunch and 100 Hz operation. In comparison to the prototype detectors",
        "which were operational at the SwissFEL test injector",
        "we have achieved an improved BAM resolution in the range 10 pC - 200 pC."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ibic2018/talks/wepa20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ibic2018/papers/wepa20.pdf",
      "poster_url": "https://proceedings.jacow.org/ibic2018/posters/wepa20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2018-WEPA20",
      "page_number": "420",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 13,
  "scrape_time": "2025-10-10 17:47:37"
}