{
  "session_info": {
    "id": "MOPBA",
    "name": "MOPBA - Poster Session",
    "url": "https://proceedings.jacow.org/PAC2013/html/mopba.htm"
  },
  "papers": [
    {
      "paper_id": "MOPBA01",
      "title": "Current Induced In Vacuum Chamber During NSLS-II Booster Ramp",
      "authors": [
        "S.M. Gurov",
        "V.A. Kiselev",
        "S.V. Sinyatkin",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "During ramp the rising fields in the booster magnets induce currents in vacuum chamber including currents through ground. These induced currents produce magnetic fields influencing on beam. Calculations and simulations for NSLS-II booster are discussed.",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba01.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA01",
      "page_number": "174",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA03",
      "title": "Self-Consistent Simulations of Passive Landau Cavity Effects",
      "authors": [
        "G. Bassi",
        "A. Blednykh",
        "S. Krinsky",
        "J. Rose",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "We discuss passive Landau cavity effects for arbitrary fill patterns. We present a new algorithm for the self-consistent calculation of the long-range multibunch interaction and discuss its implementation in the parallel OASIS code. As an application",
        "we show numerical simulations for normal conducting Landau cavities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba03.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA03",
      "page_number": "177",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA04",
      "title": "Polarization Profile and Spin Dynamics Simulations in the AGS Using the Zgoubi Code",
      "authors": [
        "Y. Dutheil",
        "L. Ahrens",
        "H. Huang",
        "F. Méot",
        "V. Schoefer",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Polarization transmission during the AGS acceleration cycle is critical for the RHIC polarized proton program",
        "driving strong interest on the exploration of the polarization losses in the AGS. Intrinsic spin resonances are the main source of depolarization in the AGS. This results in the formation of a polarization profile since the strength of such depolarizing resonance depends on the Courant Snyder invariant of each particle. The Zgoubi code and the AGS Zgoubi on-line model now allow to explore the formation of the polarization profile during the acceleration cycle using multi-particle trackings with realistic beam and machine conditions. This paper introduces the specificities of these simulations and compares some of the latest simulated and experimental results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba04.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA04",
      "page_number": "180",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA05",
      "title": "Design of the Injection into the 800 MeV/amu High Power Cyclotron",
      "authors": [
        "M. Haj Tahar",
        "Y. Dutheil",
        "F. Méot",
        "N. Tsoupas",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "INFN/LNS",
        "Catania",
        "Italy",
        "CSFNSM",
        "Catania",
        "Italy",
        "The injection into a separated sector cyclotron (SSC) aimed at the production of a high power 800MeV/amu molecular H2+ beam for ADS-Reactor applications * is being designed. This work includes the definition of the parameters of the injection line",
        "as well as beam dynamics simulations of the line and first accelerated turns using the OPERA magnetic field maps of the cyclotron sector. Both schemes of radial and vertical injection are assessed. Various optics codes are employed for that as MADX",
        "Zgoubi. The paper details and discusses various aspects of that design study and its outcomes.",
        "* A.Calanna et al.",
        "A multi-megawatt ring cyclotron to search for CP violation in the neutrino sector",
        "April 2011",
        "e-Print: arXiv:1104.4985"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba05.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA05",
      "page_number": "183",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA06",
      "title": "Algorithms and Self-consistent Simulations of Beam-induced Plasma in Muon Cooling Devices",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "M. Chung",
        "A.V. Tollestrup",
        "K. Yonehara",
        "Fermilab",
        "Batavia",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "SBU",
        "Stony Brook",
        "USA"
      ],
      "institutions": [],
      "abstract": "Interaction of muon beams with plasma generated in muon cooling absorbers is an important issue affecting the efficiency of muon cooling. We have developed numerical algorithms and parallel software for self-consistent simulation of the plasma production and its interaction with particle beams and external electromagnetic fields. Simulations support the FNAL experimental program on dense hydrogen gas filled RF cavities proposed for muon beam phase space cooling and acceleration. The core code uses the particle-in-cell (PIC) method for the Maxwell equations coupled to the dynamics of particles. Electromagnetic PIC methods are combined with probabilistic treatment of atomic physics processes responsible for the plasma production. The PIC code supports the dynamics of multiple particle species undergoing rapid acceleration / deceleration (variable relativistic factor) and uses accurate charge and current conservation methods and symplectic discretization schemes. It is fully parallel and runs on multicore supercomputers. Benchmarks and simulations of experiments on gas-filled RF cavities will be discussed.",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba06.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA06",
      "page_number": "186",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA09",
      "title": "Multiple Scattering Effects in a Strong Magnetic Field",
      "authors": [
        "Illinois Institute of Technology",
        "Chicago",
        "IL",
        "USA",
        "IIT",
        "Chicago",
        "USA",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "New computational tools are essential for accurate modeling and simulation of the next generation of muon-based accelerator experiments at the energy and intensity frontiers",
        "such as a muon collider",
        "a neutrino factory",
        "stopping muon beams",
        "or in general any application involving muons. There is a long list of crucial and not-yet-considered physics processes specific to muon accelerators that have not yet been implemented in any current simulation code. Implementing these processes will substantially enhance our confidence that the tools used in simulating and assessing the feasibility of a muon collider or a neutrino factory will accurately represent the performance of a real machine. We report here on the progress of developing advanced modeling tools to include such processes into the G4beamline code",
        "one of the de-facto standard codes used for muon-based accelerator simulations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba09.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA09",
      "page_number": "189",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA10",
      "title": "Progress of the Matter-dominated Muon Accelerator Lattice Simulation Tools Development for COSY Infinity",
      "authors": [
        "P. Snopok",
        "J.D. Kunz",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "COSY Infinity is an arbitrary-order beam dynamics simulation and analysis code. It can determine high-order transfer maps of combinations of particle optical elements of arbitrary field configurations. For precision modeling",
        "design",
        "and optimization of next-generation muon beam facilities",
        "its features make it the ideal code. The one component that needs to be included in COSY is the algorithm necessary to follow the distribution of charged particles through matter. Muon beams are tertiary production particles and high-intensity collection necessitates a large initial phase space volume. Therefore",
        "accurate modeling of the dynamics and correction of aberrations is imperative. To study in detail some of the properties of particles passing through material",
        "the transfer map approach alone is not sufficient. The interplay of beam optics and atomic processes must be studied by a hybrid transfer map - Monte-Carlo approach in which transfer map methods are used when there is no material in the accelerator channel",
        "and Monte-Carlo methods when particles pass through material. Progress on the development of the hybrid algorithm is reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba10.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA10",
      "page_number": "192",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA11",
      "title": "Space Charge Simulation in COSY Using Fast Multipole Method",
      "authors": [
        "Illinois Institute of Technology",
        "Chicago",
        "IL",
        "USA",
        "M. Berz",
        "B.T. Loseth",
        "K. Makino",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "A method is presented that allows the computation of space charge effects of arbitrary and large distributions of particles in an efficient and accurate way based on a variant of the Fast Multipole Method (FMM). It relies on an automatic multigrid-based decomposition of charges in near and far regions and the use of high-order differential algebra methods to obtain decompositions of far fields that lead to an error that scales with a high power of the order. Given an ensemble of N particles",
        "the method allows the computation of the self-fields of all particles on each other with a computational expense that scales as O(N). Furthermore",
        "the method allows the computation of all high-order multipoles of the space charge fields that are necessary for the computation of high-order transfer maps and all resulting aberrations. Space charge effects are crucial in modeling the latter stages of the six-dimensional (6D) cooling channel for the Muon Collider. FMM has been implemented in COSY Infinity",
        "and the results of applying it to simulating the 6D cooling channel for the Muon Collider are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba11.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA11",
      "page_number": "195",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA12",
      "title": "Mitigation of Numerical Noise for Space Charge Calculations in Tracking Codes",
      "authors": [
        "L.G. Vorobiev",
        "C.M. Ankenbrandt",
        "T.J. Roberts",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "CERN",
        "Geneva",
        "Switzerland",
        "Modern tracking codes have very high requirements to space charge calculations. They should combine the speed of calculations",
        "to be able to track particles for very many turns (LHC accelerator chain",
        "storage rings",
        "etc)",
        "and a numerical accuracy and a physical symplecticity. Grid solvers and the modified Green's function algorithms were considered",
        "compared",
        "and the upgrades were suggested."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba12.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA12",
      "page_number": "198",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA13",
      "title": "Optimization of the Multipole to Local Translation Operator in the Adaptive Fast Multipole Method",
      "authors": [
        "S. Abeyratne",
        "B. Erdelyi",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "ANL",
        "Argonne",
        "USA",
        "The Fast Multipole Method (FMM) is an accurate and fast way to calculate potentials/fields created by a very large number of particles. The run time of the FMM is significantly less than that of the pairwise calculation if the particle number",
        "N is sufficiently large. Two major parts in the FMM are the upward pass and the downward pass. The upward pass calculates multipole expansions and then performs multipole- to-multipole translations. The downward pass calculates multipole-to- local expansions and local-to local expansions. The multipole-to-local translation in the downward pass is the most time consuming translation in the FMM. In order to make the FMM more efficient",
        "we sought to minimize the time taken by the multipole-to-local translation. The promising and practical strategy to minimize the multipole-to-local translation time is to replace the 3D multipole-to-local translation with a 1D multipole-to-local translation in conjunction with rotations of the coordinate axes. In this paper we show how to perform the 1D multipole-to-local translation and the time comparisons between the two FMM variants."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba13.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA13",
      "page_number": "201",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA14",
      "title": "Numerical Integrator for Coulomb Collisions",
      "authors": [
        "A.A. Al Marzouk",
        "B. Erdelyi",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "The trajectories of protons interacting through Coulomb forces were computed using a numerical integrator based on Picard's iteration method. This is a variable order",
        "adaptive integrator with dense output. We show different cases by varying some parameters such as the impact parameter",
        "the relative velocity of the protons and the order of the differential algebraic (DA) vector. The accuracy of the trajectories was tested by changing the order of the DA vector while fixing the other parameters. The impact parameter between the protons and the velocity of the incident proton has the most impact on the trajectories. The maximum time step is determined by the radius of convergence of the expansions",
        "while a fixed accuracy is attained by varying the order."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba14.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA14",
      "page_number": "204",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA15",
      "title": "Study and Comparison of the Method of Moments and the Single Level Fast Multipole Method for 2D Space Charge Tracking",
      "authors": [
        "A.J. Gee",
        "B. Erdelyi",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "ANL",
        "Argonne",
        "USA",
        "Strong space charge is a significant impediment in charged particle beam physics",
        "particularly at the high intensity frontier. For future applications",
        "where particles must occupy the smallest region possible",
        "quickly and accurately and efficient modeling space charge modeling is essential",
        "for instance",
        "to minimize the space charge contribution to beam dispersion. In this paper",
        "we study and compare the performance for the method of moments (MoM) and the single-level fast multipole method (SLFMM) in 2D. The method of moments has been widely used to solve computational electromagnetic problems but assumes a series-expandable smooth distribution function",
        "limiting its reliability in some cases. The fast multipole method was more recently developed and shows remarkable accuracy with difficult beam distributions. We demonstrate these methods using a simplified version of the University of Maryland electron ring (UMER). We present some multi-particle tracking results obtained using these methods. Future work will study the space charge inclusive transfer maps calculated from these methods."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba15.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA15",
      "page_number": "207",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA16",
      "title": "A Picard Iteration Based Integrator",
      "authors": [
        "H.D. Schaumburg",
        "B. Erdelyi",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "Picard iteration is mainly used as a theoretical tool to establish the existence and uniqueness of a solution to an initial value problem. We have developed a method based on Picard iteration that computes the exact Taylor polynomial of the solution to arbitrary order. The method has been implemented in COSY infinity to numerically solve Coulomb interactions.",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba16.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA16",
      "page_number": "210",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA17",
      "title": "A User Friendly, Modular Simulation Tool for Laser-Electron Beam Interactions",
      "authors": [
        "S. Seung",
        "G. Andonian",
        "M.A. Harrison",
        "S. Wu",
        "RadiaBeam",
        "Santa Monica",
        "USA",
        "CIPS",
        "Boulder",
        "Colorado",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Many advanced accelerator concepts require the co-propagation and interaction of the electron with a laser (e.g.",
        "laser-plasma accelerators",
        "inverse Compton scattering",
        "laser heaters",
        "and electron beam diagnostics with laser light). The strict requirements on beam properties necessitate numerical modeling to fully understand the complexities of the beam dynamics. Laser-specific simulations often require a different set of modeling tools. This has resulted in a hodgepodge approach",
        "where the output of one program must be inputted into another. This paper presents the Radtrack software highlights",
        "which aims to simplify these issues by uniting key software components under an intuitive graphical interface while addressing key problems relevant in the accelerator community."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba17.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA17",
      "page_number": "213",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA18",
      "title": "Multipacting Simulation of Accelerator Cavities using ACE3P",
      "authors": [
        "C.-K. Ng",
        "L. Ge",
        "C. Ko",
        "Z. Li",
        "L. Xiao",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "ACE3P is a 3D parallel finite element code suite for cavity design and optimization including electromagnetic",
        "thermal and mechanical effects. Taking advantages of the power of computing on multi processors",
        "ACE3P's particle tracking module Track3P allows efficient multipacting (MP) simulation by extensive scanning in field gradient and on cavity surface to identify the occurrences of MP activities. The output from Track3P simulation includes the determination of resonant trajectories and their locations",
        "the calculation of electron impact energy on cavity surface",
        "and the evaluation of the electron enhancement counter as a function of field gradient. The sensitivity of MP on secondary emission yield can be readily obtained through postprocessing. Examples of Track3P MP simulation for the Muon cooling cavities and APS SPX cavity will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba18.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA18",
      "page_number": "216",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA19",
      "title": "Inter-bunch Communication through CSR in Whispering Gallery Modes",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "CLS",
        "Saskatoon",
        "Saskatchewan",
        "Canada",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "Theory predicts that coherent synchrotron radiation (CSR) in electron storage rings should appear in whispering gallery modes",
        "which are resonant modes of the vacuum chamber",
        "characterized by their high frequencies and concentration near the outer wall of the chamber. Such modes produce an extended wake field behind a particle bunch",
        "which can influence the CSR from a succeeding bunch in a train. We review experimental evidence for the resonances * and for the inter-bunch communication. We then present a calculation based on Vlasov-Fokker-Planck equations which confirms an effect seen experimentally",
        "namely that increasing the charge in a leading bunch increases the radiation from a following bunch.",
        "* R. Warnock and J. Bergstrom",
        "PAC-2011",
        "paper WEP119."
      ],
      "institutions": [
        "Funding: Support at SLAC by U.S. Dept. of Energy contract DE-AC03-76SF00515, at CLS by NSERC, NRC, Province of Saskatchewan, U. of Saskatchewan"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba19.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA19",
      "page_number": "219",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA20",
      "title": "Revised View of Basic FEL Equations and a Nonlinear Vlasov Description",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The standard one-dimensional FEL equations are revised to incorporate a new approach to the wiggle average",
        "in a context of continuous frequency. It has a firmer mathematical foundation",
        "and leads to an interesting reformulation in the time domain. The equations are interpreted as a nonlinear Vlasov system for a continuous distribution function of ponderomotive angle and energy spread. Numerical solutions are illustrated."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba20.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA20",
      "page_number": "222",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA21",
      "title": "Modeling Localized States and Band Bending Effects on Electron Emission Ion from GaAs",
      "authors": [
        "D.A. Dimitrov",
        "Y. Choi",
        "C. Nieter",
        "Tech-X",
        "Boulder",
        "Colorado",
        "USA",
        "I.V. Bazarov",
        "S.S. Karkare",
        "W.J. Schaff",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "I. Ben-Zvi",
        "T. Rao",
        "J. Smedley",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "High acceptor doping of GaAs and (Cs",
        "O) or (Cs",
        "F) surface coating leads to downward band bending terminating with effective negative electron affinity surface. The periodicity breaking at the surface together with the formed potential leads to one or more localized states in the band bending region together with effective Fermi level pinning. We report results on how to calculate the band bending potential",
        "the Fermi level pinning",
        "and localized states as functions of GaAs p-doping density",
        "surface density of states",
        "and temperature. We also consider how these surface properties affect electron emission."
      ],
      "institutions": [
        "Funding: The authors wish to acknowledge the U.S. Department of Energy (DOE) and the National Science Foundation for funding under grants DOE DE-SC0006246, NSF DMR-0807731, and DOE DE-SC0003965."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba21.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA21",
      "page_number": "225",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPBA24",
      "title": "Integrated Kinetic and Plasma Dielectric Models of Electron Cloud Buildup and TE Wave Transmission",
      "authors": [
        "S.A. Veitzer",
        "P. Stoltz",
        "Tech-X",
        "Boulder",
        "Colorado",
        "USA",
        "Fermilab",
        "Batavia",
        "USA",
        "Buildup of electron plasmas in accelerator cavities poses a serious threat to performance for current and future accelerators. Traveling-wave rf diagnostics are an effective",
        "non-destructive way to measure electron clouds",
        "although determining the true cloud density from spectra is difficult due to the effects of reflections",
        "nonuniform cloud density",
        "and magnetic field effects. We model one beam revolution period of plasma buildup electrostatically",
        "with a kinetic PIC model",
        "using a longer time step; thus determining the cloud density. Then we perform electromagnetic simulations with a finer time resolution",
        "using this density as a plasma dielectric tensor",
        "over many revolution periods in order to simulate rf spectra and sidebands that arise because of the modulation of the plasma. Using a plasma dielectric model increases the numerical stability and speed of the models",
        "allowing for very long time scale simulations needed to reproduce spectra as observed in real experiments. We compare here the differences in computed side band spectra due to different magentic field configurations for Main Injector parameters."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/PAC2013/talks/mopba24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/PAC2013/papers/mopba24.pdf",
      "poster_url": "https://proceedings.jacow.org/PAC2013/posters/mopba24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PAC2013-MOPBA24",
      "page_number": "228",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 19,
  "scrape_time": "2025-10-11 01:32:00"
}