{
  "session_info": {
    "id": "WEOAB1",
    "name": "WEOAB1 - Contributed Oral Presentations (Beam Dynamics and Electromagnetic Fields))",
    "url": "https://proceedings.jacow.org/IPAC2013/html/weoab1.htm"
  },
  "papers": [
    {
      "paper_id": "WEOAB101",
      "title": "Single Particle Tracking for Simultaneous Long and Short Electron Bunches in the BESSY II Storage Ring",
      "authors": [
        "M. Ruprecht",
        "A. Jankowiak",
        "A. Neumann",
        "M. Ries",
        "G. Wüstefeld",
        "HZB",
        "Berlin",
        "Germany",
        "DELTA",
        "Dortmund",
        "Germany",
        "A scheme where 1.5 ps and 15 ps long bunches (rms) can be stored simultaneously in the BESSY II storage ring has recently been proposed (BESSYVSR*). This paper presents simulations of single particle beam dynamics influenced by superconducting cavities used for the strong longitudinal beam focusing. The effect of RF jitter on (very short) bunches is investigated and results are discussed. Furthermore",
        "possible effects on beam dynamics during ramp up and ramp down of the high gradient fields in the cavities are studied. The primary goal is to reveal preliminary design specifications for RF jitter on the basis of single particle dynamics.",
        "* G. Wüstefeld",
        "A. Jankowiak",
        "J. Knobloch",
        "M. Ries",
        "Simultaneous Long and Short Electron Bunches in the BESSY II Storage Ring",
        "Proceedings of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weoab101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weoab101.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weoab101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEOAB101",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAB102",
      "title": "CSR-driven Longitudinal Single Bunch Instability Thresholds",
      "authors": [
        "BESSY GmbH",
        "Berlin",
        "Germany",
        "According to Bane",
        "et al.* threshold currents should follow a quite simple scaling law. More detailed theoretical results for the underlying shielded CSR-interaction have been performed for BESSY-II and the MLS and will be presented in comparison with observations at these storage rings. It is found that there are parameter regions where the instability is weak and thus thresholds depend on damping time and synchrotron tune. Theoretical findings are in surprisingly good agreement with most of the observed instability features.",
        "* K.L. Bane",
        "et al.",
        "Phys. Rev. ST-AB 13",
        "104402 (2010)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weoab102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weoab102.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weoab102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEOAB102",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAB103",
      "title": "Experimental Observations of a Multi-stream Instability in a Long Intense Beam",
      "authors": [
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "We have observed evidence of a multi-stream instability in a long non-relativistic space-charge dominated beam evolving with an initial non-linear distribution and zero external longitudinal containment. This type of instability can be detrimental to intense accelerators that propagate rectangular distributions",
        "such as in a ring with single or multi-bunch injection. The longitudinal forces in these intense bunches causes the beam to expand axially; in the case of the University of Maryland Electron Ring (UMER)",
        "the initial long bunch is injected to fill a fraction of the ring",
        "coasting beyond the point where the head and tail overlap. Adjacent filaments at that point are separated in velocity space by 2cs and approach a separation of cs. The onset of the instability has been observed to depend on the injected beam current",
        "bunch length",
        "and other experimental factors. Comparisons with simple analytical calculations and PIC simulations have shown good agreement in the time to onset."
      ],
      "institutions": [],
      "abstract": "B.L. Beaudoin, S. Bernal, I. Haber, R.A. Kishek, T.W. Koeth",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/weoab103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/weoab103.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/weoab103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-WEOAB103",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 21:25:02"
}