{
  "session_info": {
    "id": "THPOTK",
    "name": "THPOTK - Poster Session - Tomyam Kung",
    "url": "https://proceedings.jacow.org/ipac2022/html/thpotk.htm"
  },
  "papers": [
    {
      "paper_id": "THPOTK001",
      "title": "Variable Permanent Hybrid Magnets for the Bessy III Storage Ring",
      "authors": [
        "J. Völker",
        "V. Dürr",
        "P. Goslawski",
        "A. Jankowiak",
        "M. Titzepresenter",
        "HZB",
        "Berlin",
        "Germany",
        "The Helmholtz Zentrum Berlin (HZB) is working on the conceptual design of a successor source to BESSY II",
        "an new BESSY III facility",
        "designed for a beam energy of 2.5GeV and based on a multi-bend achromat (MBA) lattice for a low emittances of 100pm-rad. Bending and focusing magnets in the MBA cells should consist of permanent magnets (PM)",
        "to allow for a competitive and compact lattice",
        "to increase the magnetic stability and to decrease the electric power consumption of the machine. However",
        "using pure permanent magnet systems would result in a completely fixed lattice. Therefore",
        "we are developing Variable Permanent Hybrid Magnets (VPHM)",
        "combining PM materials like NdFeB with a surrounding soft iron yoke and additional electric coils. This design can achieve the same field strength and field quality as conservative magnets",
        "with only a small fraction of the electric power consumption",
        "and a ca. 10% variability in the field amplitudes. In this paper",
        "design and first optimization results of the magnets will be presented",
        "which are a promising option for the new BESSY III facility",
        "and an estimated reduction in total power consumption for the magnet lattice of up to 80%."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk001.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK002",
      "title": "Magnet Design for the PETRA IV Storage Ring",
      "authors": [
        "R. Bartolini",
        "I.V. Agapov",
        "A. Aloev",
        "H.-J. Eckoldt",
        "D. Einfeld",
        "B. Krause",
        "A. Petrov",
        "M. Thede",
        "M. Tischer",
        "DESY",
        "Hamburg",
        "Germany",
        "ESRF",
        "Grenoble",
        "France",
        "The proposed PETRA IV electron storage ring that will replace DESY’s flagship synchrotron light source PETRA III will feature a horizontal emittance as low as 20 pmrad. It is based on a hybrid six-bend achromat lattice. In addition to the storage ring PETRA IV",
        "the Booster Synchrotron and the corresponding transfer line will be renewed. Overall about 4000 magnets will be manufactured. The lattice design require high-gradient quadrupoles",
        "which are unfeasible with conventional steel",
        "used traditionally for normal-conducting magnets. The required gradient is safely reached with the poles",
        "made of Permendur. The bending magnets for the storage ring will be based on permanent magnets. This contribution presents the electromagnetic design of the magnets for the storage ring and booster synchrotron."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK003",
      "title": "Optimization of Mass Resolution Parameters Combined with Ion Cooler Performance",
      "authors": [
        "M. Cavenago",
        "C. Baltador",
        "L. Bellan",
        "M. Comunian",
        "E. Fagotti",
        "A. Galatà",
        "M. Maggiore",
        "A. Pisent",
        "C.R. Roncolato",
        "M. Rossignoli",
        "A. Ruzzon",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "G. Maero",
        "M. Romé",
        "Universita’ degli Studi di Milano e INFN",
        "Milano",
        "Italy",
        "INFN-Bari",
        "Bari",
        "Italy",
        "High mass resolution spectrometers (HRMS) for separation of exotic ion species in nuclear physics experiment request a low emittance and small energy spread (with D E the peak-to-peak value",
        "and sE the rms value) of the input beam",
        "so that ion cooler devices",
        "as a Radio Frequency Quadrupole Coolers (RFQC)",
        "are typically envisioned. The SPES (Selective Production of Exotic Species) project at LNL requests M/(D M) about 20000",
        "rms normalized emittance in the order of 2 nm",
        "and for 160 keV ions",
        "spread sE about 1 eV. Typical limits of RFQC[*] and HRMS[**] performances are discussed",
        "and relevant formulas are implemented in easy reference tools. The necessary collisional data are reviewed",
        "in particular for Cs+ against He gas",
        "whose pressure ranges from 2 to 9 Pa; status of Milan test bench is briefly updated. Practical consideration on gas pumping",
        "voltage stability and magnet design are also included.",
        "[*] Cavenago et al. Optimization of ion transport in a combined RFQ Cooler …",
        "in ICIS 2021 (in press) [**] M. Comunian et al. p. 3252 in proceedings"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk003.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK004",
      "title": "The Reduction of the Leakage Field of the Injection Septum Magnet in Main Ring of J-PARC",
      "authors": [
        "T. Shibata",
        "K. Ishii",
        "H. Matsumoto",
        "N. Matsumoto",
        "T. Sugimoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "A new injection septum magnet (InjSep) was installed in MR in 2016 for one of the upgrading of beam power of MR. We have measured the leakage field before installation",
        "and it was found from the measurement results that the leakage field at the beam upstream region of the circulating duct was enough smaller than previous InjSep",
        "however we tried to reduce the leakage field further by installation a new magnetic shield. First magnetic shield was produced in 2017",
        "and we installed it in the InjSep. The leakage field was reduced",
        "however the magnetic field of a quadrupole magnet at beam upstream of the InjSep was also reduced slightly. The decrease of the magnetic field of the one of main magnet was not permitted from the requirement of beam optics. In consequently",
        "the first version was failed. The second one was produced in 2018",
        "and we measured the leakage field was measured in Jan. 2019. The leakage field was reduced",
        "while no reduction of the quadrupole magnet. We decided to use the second version for beam operation. The new additional shield was started to use in Nov. 2019."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk004.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK005",
      "title": "The New High Field Septum Magnet for Upgrading of Fast Extraction in Main Ring of J-PARC",
      "authors": [
        "T. Shibata",
        "K. Ishii",
        "S. Iwata",
        "H. Matsumoto",
        "N. Matsumoto",
        "T. Sugimoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "HUST",
        "Wuhan",
        "People’s Republic of China",
        "Upgrading the beam-power of the J-PARC Main Ring to 750 kW is underway by reducing the cycle from 2.48 s to 1.3 s. Required upgrade of the four High Field (HF) Septa will be completed in 2022. The operation test of a new HF SM31 was conducted in 2020. First was 1 Hz operation test. The power supply had no problem in the operation",
        "and the joule heating at the magnet coil was lower than limit. We found a good linearity between the current and the gap field which has no saturation. The field integral in the magnet gap was measured to calculate the appropriate current for beam operation",
        "and we found it was 3",
        "400 A. We compared the gap field of the neutrino side with that of the beam abort side. The magnitude of gap field had no significant discrepancy larger than its measurement accuracy. The end-fringe field was measured and the we found large leakage field still existed around the end-fringes. We are producing an additional magnetic shield which will be mounted in the circulating beam duct",
        "and it will finished in Feb. 2022. In next March we will install the inner shield and measured the leakage field. After that we will install the new SM31 in MR."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk005.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK007",
      "title": "Magnet Systems for Korea 4GSR Light Source",
      "authors": [
        "D.E. Kim",
        "T. Ha",
        "G. Hahn",
        "Y.G. Jung",
        "H.-G. Lee",
        "J. Lee",
        "S. Shin",
        "H.S. Suh",
        "PAL",
        "Pohang",
        "Republic of Korea",
        "A 4th generation storage ring based light source is being developed in Korea since 2021. It features < 100 pm rad emittance",
        "about 800 m circumference",
        "4 GeV e-beam energy",
        "full energy booster injection",
        "and more than 40 beamlines which includes more than 24 insertion device (ID) beamlines. This machine requires about ~1000 magnets including dipole",
        "longitudinal gradient dipole",
        "transverse gradient dipole",
        "sextupoles",
        "and correctors. The apertures are small and the lattice space requirements are very tight. In this report",
        "a preliminary design of the each magnet is presented with detailed plan for the future."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk007.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK009",
      "title": "Design of a Permanent Magnet Based Dipole Quadrupole Magnet",
      "authors": [
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "M. Kokole",
        "T. Milharčič",
        "KYMA",
        "Trieste",
        "Italy",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Permanent magnet technology can facilitate the design of accelerator magnets with much lower power consumption than traditional resistive electromagnets. By reducing the power requirements of magnets",
        "more sustainable accelerators can be designed and built. At STFC",
        "as part of the I.FAST collaboration",
        "we are working to develop sustainable technologies for future accelerators. As part of this work",
        "we have designed a permanent magnet based dipole-quadrupole magnet with parameters suited to meet the requirements of the proposed Diamond-II upgrade. We present here the magnetic design of the dipole-quadrupole magnet. The design",
        "based on a single sided dipole-quadrupole",
        "uses permanent magnets to generate the field in the magnet bore. The design includes the shaping of the pole tips to reduce multipole errors as well as methods of providing thermal stabilisation using thermal shunts and field tuning using resistive coils. The mechanical design of the magnet is being undertaken by colleagues at Kyma and a prototype of the magnet will soon be built and tested."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk009.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK010",
      "title": "Development of a Short Period Superconducting Helical Undulator",
      "authors": [
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "J. Boehm",
        "L. Cooper",
        "B. Green",
        "T. Hayler",
        "P. Jeffery",
        "C.P. Macwaters",
        "B.J.S. Matthews",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "B.J.A. Shepherd",
        "N. Thompson",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Superconducting technology provides the possibility to develop short period",
        "small bore undulators that can generate much larger magnetic fields than alternative technologies. This may allow an XFEL with optimised superconducting undulators to cover a broader range of wavelengths than traditional undulators. At STFC",
        "we have undertaken work to design and build a prototype superconducting helical undulator module with parameters suitable for use on a future XFEL facility. This work includes the design of an undulator with 13 mm period and 5 mm magnetic gap",
        "as well as the supporting cryogenic and vacuum systems required for operation. We present here the updated design of the superconducting helical undulator that represents the results of prototyping work. Improved methods for manufacturing the undulator former and winding the superconducting wire have been developed. The measured mechanical tolerances and the impact on the field quality will be presented. The fields produced by prototype undulators will soon be measured using a Hall probe system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK011",
      "title": "Permanent Magnets for the CEBAF 24GeV Upgrade",
      "authors": [
        "BNL",
        "Upton",
        "New York",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "An upgrade of the CEBAF facility to double its present energy of 12GeV has been proposed. To provide double the number of linac passes using the existing five stacked arc beamlines",
        "some beamlines are replaced by fixed-field accelerator (FFA) arcs",
        "allowing multiple energies to pass through the same magnets. A solution is presented in which two of the existing electromagnetic beamlines are replaced with permanent magnet non-scaling FFA arcs",
        "as demonstrated at CBETA. The two-stage design reduces peak magnetic field and synchrotron radiation loss compared to using a single stage. FFAs do not pulse their magnets",
        "making permanent magnets a promising and power-efficient technology option. However",
        "the magnetic field requirements are still at the high end of accelerator permanent magnets produced thus far (1.6T peak on beam)",
        "while the magnets must also be combined-function",
        "having a gradient with a dipole offset. Designs using a novel oval aperture and open midplane within an adapted Halbach magnet are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk011.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK013",
      "title": "Cold Test Results of the FAIR Super-FRS First-of-Series Multiplets and Dipole",
      "authors": [
        "A. Chiuchiolo",
        "A. Beaumont",
        "E.J. Cho",
        "F. Greiner",
        "P. Kosek",
        "M. Michels",
        "H. Müller",
        "C. Roux",
        "H. Simon",
        "K. Sugita",
        "V. Velonas",
        "F. Wamers",
        "M. Winkler",
        "Y. Xiang",
        "GSI",
        "Darmstadt",
        "Germany",
        "H. Allain",
        "V. Kleymenov",
        "A. Madur",
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "Within the collaboration between GSI and CERN",
        "a dedicated cryogenic test facility has been built at CERN (Geneva",
        "Switzerland) in order to perform the site acceptance tests of the 56 Superconducting FRagment Separator cryomodules before their installation at the the Facility for Antiproton and Ion Research (Darmstadt",
        "Germany). Two of the three benches of the CERN test facility were successfully commissioned with the powering tests of the first-of-series multiplets and dipole. The long multiplet",
        "with a warm bore radius of 192 mm",
        "is composed of nine magnets of different type (quadrupole",
        "sextupole",
        "steering dipole and octupole) assembled with Nb-Ti racetrack and cosine-theta coils",
        "mounted in a cold iron yoke and in a common cryostat. This work presents the first results of the cold powering tests at 4.5 K during which dedicated measurements have been implemented for the magnetic characterization of the single magnets up to nominal current (300 A for a long quadrupole) and the study of their crosstalk effects. The results of the acceptance tests will be presented together with the challenges and lessons learnt during the facility commissioning."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk013.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK014",
      "title": "keV Electron Source Design for the New 3 GeV Synchrotron Facility in Thailand",
      "authors": [
        "N. Juntong",
        "S. Bootiew",
        "T. Chanwattana",
        "Ch. Dhammatong",
        "S. Jummunt",
        "K. Kittimanapun",
        "W. Phacheerak",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "Synchrotron Light Research Institute (SLRI)",
        "Muang District",
        "Thailand",
        "The Synchrotron Light Research Institute (SLRI) is developing a new synchrotron light source with an electron beam energy of 3 GeV. The DC thermionic electron gun was chosen because it is simple and less cost. The design process is well known. The operation is more stable compared to the RF gun. The cathode Y-646B was considered because it had already been used at the old synchrotron machine and the possibility of sharing the stock outweighs other disadvantages. Moreover",
        "it is used in many synchrotron facilities",
        "so it is easy to find references. The present of the focusing electrode was discussed. The focusing electrode will increase the complexity of the gun",
        "but it is necessary to get a high-quality beam from the gun. The designed electron gun can produce 1.1 A beams current with the normalized emittance of 0.910 Pi·mm·mrad",
        "which satisfied the requirement of the linac injector. The design and study results will be discussed in this report."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk014.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK015",
      "title": "Solid-State Pulsed Power Supply for a 100 keV Electron Source of the New Synchrotron Facility in Thailand",
      "authors": [
        "W. Phacheerak",
        "S. Bootiew",
        "T. Chanwattana",
        "Ch. Dhammatong",
        "N. Juntongpresenter",
        "K. Kittimanapun",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "Synchrotron Light Research Institute (SLRI)",
        "Muang District",
        "Thailand",
        "The new synchrotron light source project in Thailand will utilize a thermionic DC electron gun. The maximum operation of the gun is 100 keV",
        "which requires a pulsed power supply of 100kV. The present synchrotron machine uses a conventional design of the gun power supply. To improve the high voltage pulsed quality",
        "the solid-state design of the gun power supply is utilized. The output pulse width can be adjusted easily and the droop is less compared to the conventional design. The designed output of 100 kV amplitude with 5 µs pulsed width can be achieved with this design. It also produces a less droop of 1.8%. The design process and results will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk015.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK019",
      "title": "Collider NICA Power Supply Magnet  System",
      "authors": [
        "V. Karpinsky",
        "R.M. Ahmadrizyalov",
        "S.A. Arefev",
        "A.V. Butenko",
        "A.V. Karavaev",
        "S.V. Kirov",
        "A.V. Kopchenov",
        "A.A. Kozlykovskaya",
        "T.A. Kulaeva",
        "A.L. Osipenkov",
        "A.V. Sergeev",
        "A.A. Shurygin",
        "E. Syresinpresenter",
        "V.G. Tovstuha",
        "N.V. Travin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "A power supply system for Collider structural magnets is considered",
        "which consists of precision current sources",
        "energy evacuation devices for superconducting elements",
        "additional sources",
        "and control and monitoring equipment. The status of the equipment and the plan of its placement in Collider bld. 17 are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk019.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK020",
      "title": "Recent Experience from the Large-Scale Deployment of Power Converters with Magnet Energy Recovery",
      "authors": [
        "K.D. Papastergiou",
        "G. Le Godec",
        "V. Montabonnet",
        "CERN",
        "Meyrin",
        "Switzerland",
        "A new powering solution was deployed at CERN for transfer lines in the injector complex as part of the LHC injectors upgrade. The new powering uses regenerative power converters to recycle the magnet energy between physics operations. This work gives an overview of the developed technology",
        "the way it is used in the accelerators complex and some results of first period of operation with beam."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk020.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK022",
      "title": "Cryogenic Infrastructure for the Mainz Energy-Recovering Superconducting Accelerator (MESA)",
      "authors": [
        "T. Stengler",
        "K. Aulenbacher",
        "F. Hug",
        "P.S. Plattnerpresenter",
        "D. Simon",
        "KPH",
        "Mainz",
        "Germany",
        "The \"Mainz Energy-Recovering Superconducting Accelerator\" (MESA)",
        "currently under construction at the Institute of Nuclear Physics",
        "Johannes Gutenberg University Mainz",
        "Germany",
        "requires a cryogenic infrastructure for its superconducting components. Prior to the start of the project",
        "a helium liquefier was purchased that is capable of supplying the existing infrastructure of the Institute for Nuclear Physics",
        "as well as the SRF test facility of the Helmholtz Institute. The liquefier has already been purchased in such a way that nitrogen pre-cooling can be integrated and can be upgraded for the operation of MESA. In addition to the superconducting accelerator modules",
        "all components of the P2 experiment",
        "i.e. solenoid",
        "target and polarimeter (hydromoller)",
        "must also be supplied with liquid helium. Therefore",
        "besides the upgrade of the liquefier",
        "it is necessary to extend the system with a dedicated cryogenic supply for the P2 target. This paper presents the current status of the cryogenic supply of the MESA accelerator",
        "the future modifications and additions."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk022.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK023",
      "title": "Ferrite Specification for the Mu2e 300 kHz and 4.4 MHz AC Dipole Magnets",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk023.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK025",
      "title": "Heat Loads Measurement Methods for the ESS Elliptical Cryomodules SAT at Lund Test Stand",
      "authors": [
        "N. Elias",
        "X.T. Su",
        "ESS",
        "Lund",
        "Sweden",
        "W. Gaj",
        "P. Halczynski",
        "M. Sienkiewicz",
        "F.D. Skalka",
        "IFJ-PAN",
        "Kraków",
        "Poland"
      ],
      "institutions": [],
      "abstract": "The Site Acceptance Testing of all ESS elliptical cryomodules is done at Lund Test Stand. The cryogenic heat loads (static and dynamic) are an essential part of the acceptance criteria. We present complementary measurement methods for evaluating the cryogenic heat loads and discuss a qualitative comparison between them. We also present a summary of the results of these methods for one of the cryomodules. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk025.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK026",
      "title": "Development and Test of a Program for Automatic Conditioning of Room Temperature Cavities",
      "authors": [
        "K. Kümpel",
        "M. Märcz",
        "H. Podlech",
        "A. Rüffer",
        "C. Wagner",
        "S.R. Wagner",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "HFHF",
        "Frankfurt am Main",
        "Germany",
        "The conditioning of room temperature cavities is a time-consuming process that can take several weeks and requires the supervision of experienced experimenters. To simplify this process for future cavities",
        "a program is currently being developed at the IAP Frankfurt that will simplify the experimenter’s work and eventually take it over completely. This paper describes the basic setup of the program so far",
        "as well as the tests performed on different cavities so far. In addition",
        "an outlook for the next development steps and their application is given."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk026.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK027",
      "title": "Temperature Dependent Effects on Quality Factor in C-band RF Cavities",
      "authors": [
        "J.R. Parsons",
        "A. Fukasawa",
        "G.E. Lawlerpresenter",
        "N. Majernik",
        "J.B. Rosenzweig",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "Cryogenic operation and associated skin effects are encouraging fields of study for increasing RF gradients of beams within cavities and decreasing the required size for linear accelerators such as free electron lasers. Notably",
        "a cavity’s RF quality factor Q",
        "the ratio of the outgoing RF signal power to the input power",
        "is theoretically multiplied by over 4 when subjected to cryogenic temperatures. Precise measurements of this Q factor require defining a cryostat unit",
        "which consists of a high vacuum chamber",
        "a coldhead",
        "and MLI shielding. We optimized the cryostat by running several cool down tests at high vacuum",
        "incorporating different geometries of MLI shielding to achieve the lowest possible temperatures. We then performed a low power C-band test after installing a cylindrical copper RF cavity to measure the Q factor. Finally",
        "we improved stability and amplification within the chamber by installing edge welded bellows to the coldhead to reduce vibrations. These measurements provide a basis for the development of cryogenic infrastructure to sustain a cryogenic temperature environment for future RF applications."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk027.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK029",
      "title": "Role of Surface Chemistry in Conditioning of Materials in Particle Accelerators",
      "authors": [
        "G. Sattonnay",
        "S. Bilgen",
        "S. Della Negra",
        "D. Longuevergne",
        "B. Mercier",
        "I. Ribaud",
        "Université Paris-Saclay",
        "CNRS/IN2P3",
        "IJCLab",
        "Orsay",
        "France",
        "For the vacuum scientists and the accelerator community",
        "finding solutions to mitigate pressure rises induced by electron",
        "photon and ion desorption and beam instabilities induced by ion and electron clouds is a major issue. Along the time",
        "changes in the surface chemistry of vacuum chambers are observed during beam operations in particle accelerators",
        "leading to modifications of: outgassing rates",
        "stimulated desorption processes and a decrease of secondary emission yields (SEY). To understand the role of the surface chemistry of air exposed materials in the electron conditioning process",
        "typical air exposed materials used in particle accelerators : thin film coatings (NEG and TiN)",
        "copper (and its oxides Cu2O and CuO) and Niobium were conditioned by low energy electron irradiation for a better understanding of Ecloud effect. First",
        "SEY was measured to understand the changes of surface conditioning upon particle irradiation; then",
        "surface chemistry evolution after electron irradiation was investigated by both XPS and TOF-SIMS analyses using the ANDROMEDE facility at IJCLab. Finally",
        "the relationship between the surface chemistry and the conditioning phenomenon will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk029.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK032",
      "title": "A Vacuum System for the Milliampere Booster",
      "authors": [
        "R.G. Heine",
        "C.L. Loreypresenter",
        "KPH",
        "Mainz",
        "Germany",
        "The Milliampere Booster (MAMBO) is the injector linac for the Mainz Energy-recovering Superconducting Accelerator MESA. MESA is a multi-turn energy recovery linac with beam energies in the 100 MeV regime currently designed and built at Institut für Kernphysik (KPH) of Johannes Gutenberg-Universität Mainz. The main accelerator consists of two superconducting Rossendorf type modules",
        "while the injector MAMBO relies on normal conducting technolgy. The MAMBO RF cavities are bi-periodic pi/2 structures that are about 2m long",
        "each. In this paper we present the results of Molflow+ simulations of several setups of the vacuum system for MAMBO that differ in number of pumps",
        "pumping speed and diameter of the pumping ports that are connected to the DN40 beam pipe."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk032.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK034",
      "title": "Vacuum System Performance of the 3 GeV Electron Storage Ring at MAX IV Laboratory",
      "authors": [
        "M.J. Grabski",
        "E. Al-Dmour",
        "S.M. Scolari",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "The 3 GeV electron storage ring at MAX IV laboratory is the first synchrotron light source with compact multi-bend achromat (MBA) magnet lattice to achieve ultra-low emittance. The vacuum system of the accelerator is fully coated with non-evaporable getter (NEG) thin film to ensure low gas density. The storage ring started commissioning in August 2015 and currently delivers photon beams from insertion devices (IDs) to 9 beamlines that are in user operation or commissioning. After over 6 years of operation",
        "the NEG coated vacuum system continues to be reliable",
        "is conditioning well and do not pose any limitation to the accelerator operation. The average dynamic pressure is lower than the design value (below 3·10-10 mbar) and is reducing with the accumulated beam dose. The vacuum beam lifetime is greater than 39 Ah",
        "and the total beam lifetime is above the design value of 5 Ah - thus is not limited by the residual gas density. Several successful interventions to install new vacuum components were performed on few achromats in the storage ring during shutdowns. Some of them were done utilizing purified neon gas to vent the vacuum system",
        "thus avoiding the need of re-activation of the NEG coating and saving intervention time without compromising the storage ring performance."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk034.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK035",
      "title": "Thermo-Mechanical Modeling and Thermal Performance Analysis of Beam Vacuum Line Interconnections and Cold Warm Transitions in HL-LHC Long Straight Section Magnets",
      "authors": [
        "J. Harray",
        "C. Garion",
        "V. Petitpresenter",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The HL-LHC upgrade",
        "aiming at increasing the LHC levelled luminosity by factor of five",
        "relies on new superconducting magnets requiring a new beam vacuum system. Along with the challenges related to magnet design",
        "the beam optic configuration exposes this new equipment to stringent conditions for vacuum and cryogenic performance. Both cold-warm transitions and magnet interconnections appear to be delicate components that are crucial for the thermal heat transfer between diverse subsystems. The proposed study aims at assessing the heat loads to the cryogenic system and the temperature fields in the vacuum system. A nonlinear static thermal analysis is first performed. A thermo-mechanical approach is developed to capture additional thermal resistance arising from contact between components and their behaviour during cool-down. The system is then studied under dynamic operations when beams are circulating and colliding. A thorough analysis of beam-induced heat loads under ultimate conditions highlights the different relevant contributions. Finally",
        "the transient response of the systems is computed to assess thermal time constants."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk035.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK036",
      "title": "Determination of Pumping and Dynamic Vacuum Properties of Conductive Quaternary Alloy of TiZrVAg Non-Evaporable Getter.",
      "authors": [
        "R. Valizadeh",
        "A.N. Hannah",
        "O.B. Malyshev",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Universitat Politécnica de Catalunya",
        "Barcelona",
        "Spain",
        "M. Pont",
        "N.D. Tagdulang",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "Non Evaporable Getter (NEG) coating has been employed extensively in the particle accelerator especially where the vacuum conductance of the vessel is severely restricted and ultra-high vacuum condition is required. NEG coating will significantly reduce the outgassing rate and provides active pumping surface for H2",
        "CO and CO2. In addition",
        "it has been proven that NEG coated surfaces have a very low secondary electron yield",
        "as well as low photon and electron stimulated desorption yields. However",
        "the existing NEG film increases the RF surface resistance of the beam pipe. In order to increase NEG coating conductivity",
        "at ASTeC",
        "in the past several years",
        "the alternative NEG com-position have been studied by adding more conductive element such as Cu",
        "Au",
        "Al and Ag. In this study",
        "we report on the photon stimulated desorption",
        "activation temperature and surface resistance from room temperature to cryogenic temperature for a new NEG quaternary alloy of TiVZrAg as function of the film composition."
      ],
      "institutions": [],
      "abstract": "J.M. O’Callaghan Castella reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk036.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK037",
      "title": "Measurement of the Photon Stimulated Desorption for Various Vacuum Tubes at a Beam Line of TLS",
      "authors": [
        "G.Y. Hsiung",
        "C.M. Cheng",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "For most light sources",
        "the synchrotron radiation (SR) hit on the beam ducts or absorbers results in higher pressure rise and the consequent higher radiation level through the commissioning stage. Various surface treatments",
        "e.g. chemical cleaning",
        "oil-free machining",
        "NEG-coating",
        "etc.",
        "for the beam ducts or absorbers have been developed worldwide for mitigating the yield of Photon Stimulated Desorption (PSD). A beam line",
        "BL19B",
        "of 1.5 GeV Taiwan Light Source (TLS) has been modified to measure the PSD-yield of the vacuum tubes. The white light of BL19B covers the critical length at 2.14 keV is suitable for generating higher yield of the photo-electrons (PEY) and the consequent PSD-yield to be measured can be resolved wide range of 10-2 ~ 10-7 molecules/photon. The PSD-outgas",
        "measured by RGA",
        "contains the typical H2",
        "CO",
        "CO2",
        "hydrocarbons",
        "and Kr from NEG-coating",
        "alcohol from ethanol machined surface",
        "in some cases. The effect of beam-cleaning reflects the PSD-molecules generated from the SR-irradiated surface. The comparison of the PSD for the various vacuum tubes will be described in this paper."
      ],
      "institutions": [],
      "abstract": "R. Valizadehpresenter reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk037.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK038",
      "title": "Electron Stimulated Desorption From Titanium Tube",
      "authors": [
        "O.B. Malyshev",
        "R. Valizadehpresenter",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Titanium is one of material that used for production of accelerator vacuum chamber and components. In this paper we report the results of vacuum properties evaluation measurements of titanium vacuum chamber. The sample was produced from 40-mm inner diameter tube made of titanium and equipped with CF40 flanges at both ends. The electron stimulated desorption (ESD) was measured after 24-h bakeout to 80",
        "150",
        "180 and 250 oC. H2 and CO initial sticking probabilities were measured after bakeout before the ESD measurements. After ESD measurements",
        "the initial H2 and CO sticking probabilities were measured again together with CO sorption capacity. These measurements provide the results for ESD as a function of electron dose baked to different temperatures and demonstrate the efficiency of electron stimulated activation of titanium vacuum chamber."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk038.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK039",
      "title": "The Effect of Activation Duration on the Performance of Non-Evaporable Getter Coatings",
      "authors": [
        "E.A. Marshall",
        "O.B. Malyshev",
        "R. Valizadehpresenter",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Non-evaporable getter (NEG) coatings can be activated at temperatures as low as 140°C. However",
        "better pumping properties are achieved using higher temperatures",
        "between 150-300 °C. This paper investigates whether using an increased activation duration can improve the NEG properties obtained using lower activation temperatures",
        "and so decrease the energy and temperature requirement. This could allow a greater range of materials to be used in particle accelerator systems. Our findings have shown that increasing activation duration from 24 hrs to 1 week at 160 °C produces an improvement in the NEG pumping properties."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk039.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK040",
      "title": "Few-Nanosecond Stripline Kickers for Top-Up Injection into PETRA IV",
      "authors": [
        "G. Loisch",
        "V. Belokurov",
        "F. Obier",
        "DESY",
        "Hamburg",
        "Germany",
        "PETRA IV is the planned ultralow-emittance upgrade of the PETRA III synchrotron light source at DESY",
        "Hamburg. The current baseline injection scheme is an off-axis",
        "top-up injection with few-nanosecond stripline kickers",
        "which would allow for accumulation and least disturbance of experiments during injection. Besides the requirements on kick-strength",
        "field quality",
        "pulse rise-rate",
        "and heat management",
        "two mechanical designs with different apertures are necessary",
        "as the devices will be used for injection and the transverse multi-bunch feedback system. In this contribution we will present the current status of 3D finite element simulations of electromagnetic fields and heating as well as the mechanical design and first pulse electronics tests."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk040.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK041",
      "title": "Development of Programmable Bipolar Multi kHz Kicker Drivers for Long Pulse Superconducting Electron Linacs",
      "authors": [
        "J.L. Teichgräber",
        "W. Decking",
        "J. Kahl",
        "F. Obier",
        "DESY",
        "Hamburg",
        "Germany",
        "Deutsches Elektronen-Synchrotron DESY",
        "Notkestrasse 85",
        "22607 Hamburg",
        "Germany Superconducting cavities allow for long rf-pulses",
        "which enable the acceleration of thousands of electron bunches within one rf-pulse. Due to transient effects",
        "e.g. coupler kicks",
        "eddy currents or wakefields",
        "bunch properties like the beam trajectory can change along the pulse train. To compensate for this",
        "kicker systems based on high-current operational amplifiers have been developed for the free electron lasers European XFEL and FLASH at DESY in Hamburg. Here",
        "we present the layout of the kicker system",
        "the setup of the pulse electronics",
        "and operational results with beam."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk041.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK042",
      "title": "Non-Linear Phenomena Studies in High-Gradient RF Technology for Hadrontherapy at IFIC",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk042.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK043",
      "title": "Mitigation of High Voltage Breakdown of the Beam Screen of a CERN SPS Injection Kicker Magnet",
      "authors": [
        "M.J. Barnes",
        "W. Bartmann",
        "M. Díaz Zumel",
        "L. Ducimetière",
        "L.M.C. Feliciano",
        "T. Kramer",
        "V. Namora",
        "T. Stadlbauer",
        "D. Standen",
        "P. Trubacova",
        "F.M. Velottipresenter",
        "C. Zannini",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The SPS injection kicker magnets (MKP) were developed in the 1970’s",
        "before beam induced power deposition was considered an issue. These magnets are very lossy from a beam impedance perspective: this is expected to be an issue during SPS operation with the higher intensity beams needed for HL-LHC. A design",
        "with serigraphy applied to an alumina carrier",
        "has been developed to significantly reduce the broadband beam coupling impedance and hence mitigate the heating issues. During high voltage pulse testing there were electrical discharges associated with the serigraphy. Detailed mathematical models have been developed to aid in understanding the transiently induced voltages and to reduce the magnitude and duration of electric field. In this paper",
        "we discuss the solutions implemented to mitigate the electrical discharges while maintaining an adequately low beam-coupling impedance. In addition",
        "the results of high voltage tests are reported. The alumina substrate has a high secondary electron yield and thus electron-cloud could be an issue",
        "with SPS beam",
        "if mitigating measures were not taken: this paper also discusses the measures implemented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk043.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK044",
      "title": "Ultra-Fast Generator for Impact Ionization Triggering",
      "authors": [
        "A.A. del Barrio Montañés",
        "Y. Dutheilpresenter",
        "T. Kramer",
        "V. Senaj",
        "CERN",
        "Meyrin",
        "Switzerland",
        "KIT",
        "Karlsruhe",
        "Germany",
        "Impact ionization triggering can be successfully applied to standard thyristors",
        "thus boosting their dI/dt capability by up to 1000x. This groundbreaking triggering requires applying significant overvoltage on the anode-cathode of thyristor with a slew rate > 1kV/ns. Compact pulse generators based on commercial off-the-shelf (COTS) components would allow the spread of this technology into numerous applications",
        "including fast kicker generators for particle accelerators. In our approach",
        "the beginning of the triggering chain is a HV SiC MOS with an ultra-fast super-boosting gate driver. The super boosting of a 1.7kV rated SiC MOS allows to reduce the MOS rise time by a factor of > 25 (datasheet tr = §I{20}{ns} vs. measured tr < 800ps",
        "resulting in an output voltage slew rate > 1kV/ns and an amplitude > 1kV. Additional boosting is obtained by a Marx generator with GaAs diodes",
        "reaching an output voltage slew rate > 11kV/ns. The final stage will be a Marx generator with medium size thyristors triggered in impact ionization mode with sufficient voltage and current rating necessary for the triggering of a big thyristor. This paper presents the impact ionization triggering of a small size thyristor."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk044.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK045",
      "title": "Branch Module for an Inductive Voltage Adder for Driving Kicker Magnets with a Short Circuit Termination",
      "authors": [
        "J. Ruf",
        "M.J. Barnes",
        "Y. Dutheilpresenter",
        "T. Kramer",
        "CERN",
        "Meyrin",
        "Switzerland",
        "KIT",
        "Karlsruhe",
        "Germany",
        "For driving kicker magnets terminated in a short circuit",
        "a branch module for an inductive voltage adder has been designed and assembled. The module has been designed for a maximum charging voltage of 1.2 kV and an output current of 200 A considering the current doubling due to the short circuit termination. It features three consecutive modes of operation: energy injection",
        "freewheeling",
        "and energy extraction. Therefore",
        "the topology of the branch module consists of two independently controlled SiC MOSFET switches and one diode switch. In order not to extend the field rise time of the kicker magnet significantly beyond the magnet fill time",
        "the pulse must have a fast rise time. Hence",
        "the switch for energy injection is driven by a gate boosting driver featuring a half bridge of GaN HEMTs and a driving voltage of 80 V. Measurements of the drain source voltage of this switch showed a fall time of 2.7 ns at a voltage of 600 V resulting in a voltage rise time of 5.4 ns at the output terminated with a resistive load. To meet both the rise time and current requirements",
        "a parallel configuration of four SiC MOSFETs was implemented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk045.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK048",
      "title": "Radiation Load Studies for the FCC-ee Positron Source with a Superconducting Matching Device",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk048.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK049",
      "title": "Irradiation of Low-Z Carbon-Based Materials with 440 GeV/c Proton Beam for High Energy & Intensity Beam Absorbers: The CERN HiRadMat-56-HED Experiment",
      "authors": [
        "P. Andreu Muñoz",
        "M. Calviani",
        "N. Charitonidis",
        "A. Cherif",
        "E.M. Farina",
        "A.M. Krainer",
        "A. Lechner",
        "J. Maestre",
        "F.-X. Nuiry",
        "R. Seidenbinder",
        "C. Torregrosa",
        "CERN",
        "Meyrin",
        "Switzerland",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "The beam stored energy and the peak intensity of CERN Large Hadron Collider (LHC) will grow in the next few years. The former will increase from the 320 MJ values of Run2 (2015-2018) to almost 540 MJ during Run3 (2022 onwards) and 680 MJ during the HL-LHC era putting stringent requirements on beam intercepting devices",
        "such as absorbers and dumps. The HiRadMat-56-HED (High-Energy Dumps) experiment performed in Autumn 2021 executed at CERN HiRadMat facility employed the Super Proton Synchrotron accelerator (SPS) 440 GeV/c proton beam to impact different low-density carbon-based materials targets to assess their performance to these higher energy beam conditions. The study focused on advanced grades of graphitic materials",
        "including isostatic graphite",
        "carbon-fiber reinforced carbon and carbon-SiC materials in addition to flexible expanded graphite. Some of them specifically tailored in collaboration with industry to very specific properties. The objectives of this experiment are: (i) to assess the performance of existing and potentially suitable advanced materials for the currently operating LHC beam dumps and (ii) to study alternative materials for the HL-LHC main dump or for the Future Circular Collider dump systems. The contribution will detail the R&D phase during design",
        "the execution of the experiment",
        "the pre-irradiation tests as well as the first post irradiation examination of the target materials. Lessons learnt and impact on operational devices will also be drawn."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk049.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK050",
      "title": "CFD Studies of the Convective Heat Transfer Coefficients and Pressure Drops in Geometries Applied to Water Cooling Channels of the Crotch Absorbers of ALBA Synchrotron Light Source",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk050.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK051",
      "title": "Corrosion of Copper Components in the Deionized Water Cooling System of ALBA Synchrotron Light Source: Current Research Status and Challenges",
      "authors": [
        "M. Quispe",
        "E. Ayas",
        "J.J. Casas",
        "C. Colldelram",
        "Ll. Fuentes",
        "J. Iglesias",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "La Romanica",
        "Barberà del Vallès",
        "Sabadell",
        "Spain",
        "Currently",
        "the ALBA Synchrotron Light Source is carrying out studies on corrosion in copper components of the deionized water cooling circuit. The preliminary studies",
        "based on Scanning Electron Microscopy (SEM)",
        "Energy Dispersive X-Ray Spectroscopy (EDS)",
        "and X-Ray Diffraction (XRD) have shown the presence of intergranular",
        "pitting",
        "and generalized corrosion in the analyzed copper samples. The purpose of this paper is to present new advances in the field of this research",
        "such as: the study of the influence of low velocity water flow in the cooling circuit on the current high dissolved oxygen content (> 6500 ppb)",
        "the results of corrosion products found in the cooling circuit",
        "the description of the improper operation of the cooling circuit as a closed loop",
        "and FEA studies of copper components in order to redefine the water flow velocity design criteria to values lower than 3 m/s and thus minimize corrosion by erosion. Finally",
        "in order to attenuate the corrosion rate",
        "preventive solutions are presented such as the viability to install an oxygen content degassing plant",
        "new instrumentation for water quality monitorization",
        "and installation of degassing equipment at strategic positions of the cooling circuit."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk051.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK052",
      "title": "Muon Collider Graphite Target Studies and Demonstrator Layout Possibilities at CERN",
      "authors": [
        "F.J. Saura Esteban",
        "M. Calviani",
        "D. Calzolari",
        "R. Franqueira Ximenes",
        "A.M. Krainerpresenter",
        "A. Lechner",
        "R. Losito",
        "D. Schulte",
        "CERN",
        "Meyrin",
        "Switzerland",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Muon colliders offer enormous potential for research of the particle physics frontier. Leptons can be accelerated without suffering large synchrotron radiation losses. The International Muon Collider Collaboration is considering 3 and 10 TeV (CM) machines for a conceptual stage. In the core of the Muon Collider facility lays a MW class production target",
        "which will absorb a high power (1 and 3 MW) proton beam to produce muons via pion decay. The target must withstand high dynamic thermal loads induced by 2 ns pulses at 5-50 Hz. Also",
        "operational reliability must be guaranteed to reduce target exchanges to a minimum. Several technologies for these systems are being studied in different laboratories. We present in this paper the results of a preliminary feasibility study of a graphite-based target",
        "and the different layouts under study for a demonstrator target complex at CERN. Synergies with advanced nuclear systems are being explored for the development of a liquid metal target."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk052.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK053",
      "title": "Foiled Again: Solid-State Sample Delivery for High Repetition Rate XFELs",
      "authors": [
        "N. Majernik",
        "N. Inzunza",
        "P. Manwanipresenter",
        "J.B. Rosenzweig",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "R.B. Agustsson",
        "A. Moro",
        "RadiaBeam",
        "Santa Monica",
        "California",
        "USA",
        "R. Ash",
        "N.B. Welke",
        "UW-Madison/PD",
        "Madison",
        "Wisconsin",
        "USA",
        "U. Bergmann",
        "A. Halavanau",
        "C. Pellegrini",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "XFELs today are capable of delivering high intensity pulse trains of x-rays with up-to MHz to sub-GHz frequency. These x-rays",
        "when focused",
        "can ablate a sample in a single shot",
        "requiring the sample material to be replaced in time for the next shot. For some applications",
        "especially serial crystallography",
        "the sample may be renewed as a dilute solution in a high speed jet. Here",
        "we describe the development and characterization of a system to deliver solid state sample material to an XFEL nanofocus. The first application of this system will be an x-ray laser oscillator operating at the copper Kα line with a ~30 ns cavity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk053.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK054",
      "title": "Proposal of a VHEE Linac for FLASH Radiotherapy",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk054.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK057",
      "title": "ESS RFQ Experimental Modal Analysis",
      "authors": [
        "E. Trachanas",
        "A. Bignami",
        "N. Gazis",
        "B. Jones",
        "ESS",
        "Lund",
        "Sweden",
        "The European Spallation Source-ESS",
        "which is currently under construction and commissioning at Lund",
        "Sweden is a neutron source that consists of a 2 GeV linear accelerator (LINAC) accelerating a proton beam to a solid Tungsten (W) target. The proton beam is produced by the Ion Source (ISRC) and transported through the Low Energy Beam Transport (LEBT) to the Radio Frequency Quadrupole (RFQ) that will then focus",
        "bunch and accelerate it to 3.6 MeV. The RFQ beam commissioning started in October 2021",
        "following the RF conditioning phase in summer 2021. This current work presents an experimental modal analysis performed on RFQ including the comparative analysis with the modal finite element simulation using the ANSYS software suite. Measurements were performed using accelerometer sensors connected to a data acquisition system excited with an impact hammer. Geophones were used in parallel to the modal measurements in order to monitor the seismic background of the accelerator tunnel. Acquired data were post-processed and analysed with dedicated software",
        "juxtaposed with simulated results in order to determine the resonance frequencies",
        "structural deformation patterns (mode shapes) and error margin between experimental and simulated results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk057.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK058",
      "title": "CERN’s East Experimental Area: A New Modern Physics Facility",
      "authors": [
        "S. Evrard",
        "D. Banerjee",
        "J. Bernhard",
        "F. Carvalho",
        "S. Danzecapresenter",
        "M. Lazzaroni",
        "B. Rae",
        "G. Romagnoli",
        "CERN",
        "Meyrin",
        "Switzerland",
        "CERN’s East Area has hosted a variety of fixed-target experiments since the 1950s",
        "using four beamlines from the Proton Synchrotron (PS). Over the past 4 years",
        "the experimental area - CERN’s second largest - has undergone a complete makeover. New instrumentation and beamline configuration have improved the precision of data collection",
        "and new magnets and power convertors have drastically reduced the area’s energy consumption. This article will summarize the major challenges encountered for the design of the renovated beamlines and for the preparation and test of the components. The infrastructure was carefully fitted resulting in a very smooth beam commissioning",
        "the details of which will also be presented along with the restart of physics in the second half of 2021. With the return of the beams in the accelerator complex",
        "the East Area’s experiments have taken physics measurements again and the facility’s central role in the modern physics landscape has been restored."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk058.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK059",
      "title": "Laser System for SuperKEKB RF Gun in Phase III Commissioning",
      "authors": [
        "R. Zhang",
        "M. Yoshida",
        "X. Zhou",
        "KEK",
        "Ibaraki",
        "Japan",
        "H.K. Kumano",
        "N. Toyotomi",
        "Mitsubishi Electric System & Service Co.",
        "Ltd",
        "Tsukuba",
        "Japan",
        "In order to generate high quality electron beam with high charge in Phase III commissioning of SuperKEKB",
        "some improvements have been done in Ytterbium doped fiber and Neodymium doped YAG (Nd:YAG) hybrid laser system. Spatial reshaping part for the 4th harmonic laser beam at 266 nm has been adopted to realize low emittance electron beam. In addition",
        "for achieving continuous and stable laser operation",
        "position feedback system has also been used to improve the pointing stability of laser beam. In 2021 commissioning of SuperKEKB",
        "stable 2 nC electron beam is generated for high energy ring (HER) injection. Meanwhile",
        "we achieved the best emittance results at B-sector of linac injector and BT line for comparable low injection background and higher injection efficiency. With the aim of generating higher charge electron beam with good quality in the following commissioning",
        "a perspective towards the next step update for current laser system is also introduced."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk059.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK061",
      "title": "Machine Learning Approach to Temporal Pulse Shaping for the Photoinjector Laser at CLARA",
      "authors": [
        "A.E. Pollard",
        "D.J. Dunning",
        "W.A. Okell",
        "E.W. Snedden",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The temporal profile of the electron bunch is of critical importance in accelerator areas such as free-electron lasers and novel acceleration. In FELs",
        "it strongly influences factors including efficiency and the profile of the photon pulse generated for user experiments",
        "while in novel acceleration techniques it contributes to enhanced interaction of the witness beam with the driving electric field. Work is in progress at the CLARA facility at Daresbury Laboratory on temporal shaping of the ultraviolet photoinjector laser",
        "using a fused-silica acousto-optic modulator. Generating a user-defined (programmable) time-domain target profile requires finding the corresponding spectral phase configuration of the shaper; this is a non-trivial problem for complex pulse shapes. Physically informed machine learning models have shown great promise in learning complex relationships in physical systems",
        "and so we apply machine learning techniques here to learn the relationships between the spectral phase and the target temporal intensity profiles. Our machine learning model extends the range of available photoinjector laser pulse shapes by allowing users to achieve physically realisable configurations for arbitrary temporal pulse shapes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk061.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK062",
      "title": "Thermal Modeling and Benchmarking of Crystalline Laser Amplifiers",
      "authors": [
        "D.T. Abell",
        "D.L. Bruhwilerpresenter",
        "P. Moeller",
        "R. Nagler",
        "B. Nash",
        "I.V. Pogorelov",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "Q. Chen",
        "C.G.R. Geddes",
        "C. Tóth",
        "J. van Tilborg",
        "LBNL",
        "Berkeley",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk062.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOTK063",
      "title": "Open Source Software to Simulate Ti:Sapphire Amplifiers",
      "authors": [
        "D.L. Bruhwiler",
        "D.T. Abell",
        "B. Nash",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "Q. Chen",
        "C.G.R. Geddes",
        "C. Tóth",
        "J. van Tilborg",
        "LBNL",
        "Berkeley",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpotk063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpotk063.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpotk063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOTK063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 46,
  "scrape_time": "2025-10-10 18:44:26"
}