{
  "session_info": {
    "id": "THOBA",
    "name": "THOBA - Accelerator System and Components",
    "url": "https://proceedings.jacow.org/hiat2018/html/thoba.htm"
  },
  "papers": [
    {
      "paper_id": "THOBA01",
      "title": "Multipole Magnets for the HIAF Fragment Separator Using  the Canted-Cosine-Theta (CCT) Geometry",
      "authors": [
        "W. Wu",
        "Y. Liang",
        "E.M. Mei",
        "D.S. Ni",
        "X.J. Ou",
        "W.J. Yang",
        "S.J. Zheng",
        "L. Zhou",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "The fragment separator of the HIAF (High Intensity Heavy Ion Accelerator Facility) project called HFRS re-quires quadrupoles with high gradients (11.4 T/m) and large bores (gap width of 420 mm). The iron dominated magnets with superconducting coils have been widely used in the similar facilities such as A1900",
        "BigRIPS",
        "Super­FRS and RISP with the advantages of low request for coils installation precision",
        "simple fabrication and low cost",
        "but they have large cold mass and helium contain-ment",
        "which result in long time cooling down and high pressure rise during a quench. In addition",
        "due to iron saturation",
        "it is hard to guarantee on the field quality in the operated field range. A new coil dominated design based on the Canted­Cosine­Theta geometry is presented for HFRS",
        "which is expected to overcome these problems. The design superimposes several layers of oppositely wound helical windings to generate high quality quadru-pole. Sextupole",
        "octupole and steering dipole can also be easily integrated to reduce the length of cryostat. This paper reports the detailed design of HFRS multiplets based on the CCT concept and the construction of a sub-scale prototype."
      ],
      "institutions": [
        "Funding: Work supported by the National Natural Science Foundation of China (Grant No. 11575266)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hiat2018/talks/thoba01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hiat2018/papers/thoba01.pdf",
      "poster_url": "https://proceedings.jacow.org/hiat2018/posters/thoba01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HIAT2018-THOBA01",
      "page_number": "170",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:37:33"
}