{
  "session_info": {
    "id": "WEPHA",
    "name": "WEPHA - Wednesday Posters (Harrison)",
    "url": "https://proceedings.jacow.org/IPAC2015/html/wepha.htm"
  },
  "papers": [
    {
      "paper_id": "WEPHA002",
      "title": "Electromagnetic Characterization of NEG Properties Above 200 GHz for the CLIC Damping Rings",
      "authors": [
        "E. Koukovini-Platia",
        "G. Iadarolapresenter",
        "G. Rumolo",
        "C. Zannini",
        "CERN",
        "Geneva",
        "Switzerland",
        "Non-Evaporable Getter (NEG) will be used in the CLIC electron damping rings (EDR) to suppress fast beam ion instabilities due to its effective pumping ability. The electromagnetic (EM) characterization of the NEG properties up to high frequencies is required for the correct impedance modeling of the DR components. The properties are determined using WR-3.4 and WR-1.5 rectangular waveguides",
        "based on a combination of experimental measurements of the complex transmission coefficient S21 with a Vector Network Analyzer (VNA) and CST 3D EM simulations",
        "for the frequency range of 220-330 GHz and 500-750 GHz. The results obtained using NEG-coated Aluminum (Al) waveguides are presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha002.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA003",
      "title": "Measurement of NEG Coating Performance Variation in the LHC after the First Long Shutdown",
      "authors": [
        "V. Bencini",
        "V. Baglin",
        "G. Bregliozzi",
        "P. Chiggiato",
        "R. Kersevanpresenter",
        "C. Yin Vallgren",
        "CERN",
        "Geneva",
        "Switzerland",
        "During the Long Shutdown 1 (LS1) of the Large Hadron Collider",
        "90% of the Non-Evaporable Getter (NEG) coated beam pipes in the Long Straight Sections (LSS) were vented to undertake the planned upgrade and consolidation programmes. After each intervention",
        "an additional bake-out and NEG activation were performed to reach the vacuum requirements. An analysis of the coating performance variation after the additional activation cycle has been carried out by using ultimate pressure and pressure build-up measurements. In addition",
        "laboratory measurements have been carried out to mimic the LHC coated beam pipe behaviour. The experimental data have been compared with calculation obtained by Molflow+."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha003.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA004",
      "title": "Present Quality Assurance for the LHC Beam Vacuum System and its Future Improvement",
      "authors": [
        "J. Sestak",
        "V. Baglin",
        "G. Bregliozzi",
        "P. Chiggiato",
        "CERN",
        "Geneva",
        "Switzerland",
        "During the Long Shutdown 1 (LS1)",
        "the LHC beam vacuum system was upgraded to minimize dynamic vacuum effects like stimulated desorption and beam-induced electron multipacting. A quality assurance plan was mandatory due to the demanding vacuum performance and the limited access to the equipment during the following operation period. Laboratory assessment tests and underground interventions were performed following well-defined and approved procedures. All vacuum related activities were documented and written reports stored in dedicated databases. Quality controls were performed to find mechanical",
        "cabling and equipment functionality non-conformities. Possible issues were identified",
        "classified and tracked in a non-conformity database for future corrective actions. This contribution give an overview of the quality assurance policy followed during the LS1 and the non-conformities reported after quality control. Possible future improvements are also discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha004.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA005",
      "title": "Characterization of the RF Fingers Contact Force for the LHC Warm Vacuum Bellow Modules",
      "authors": [
        "C. Blanch Gutiérrez",
        "V. Baglin",
        "G. Bregliozzi",
        "P. Chiggiato",
        "R. Kersevanpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Along the 27 Km of LHC beam pipe",
        "various types of vacuum bellow modules are needed to compensate the mechanical misalignments of the vacuum chambers during installation and to absorb their thermal expansion during the bake-out. In order to reduce the beam impedance during operation with beams these modules are equipped with RF bridges to carry the image current. They are usually made out of a copper tube insert at one side and Cu-Be RF fingers at the other end of the module. A spring is used to keep the contact between the RF fingers and the tube insert. The geometry and the choice of this spring become critical to ensure a good electrical contact. In this paper",
        "a description of the test bench used to measure the contact force together with the procedure applied and the measurements performed are given. A summary of the maximum radial and axial offsets between the RF fingers and the insert tube while keeping a good electrical contact is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha005.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA006",
      "title": "Recommissioning of the COLDEX Experiment at CERN",
      "authors": [
        "R. Salemme",
        "V. Baglin",
        "F. Bellorini",
        "G. Bregliozzi",
        "K. Brodzinski",
        "P. Chiggiato",
        "P. Costa Pinto",
        "P. Gomes",
        "A. Gutierrez",
        "V. Inglese",
        "B. Jenninger",
        "R. Kersevanpresenter",
        "E. Michel",
        "M. Pezzetti",
        "B. Rio",
        "A. Sapountzis",
        "CERN",
        "Geneva",
        "Switzerland",
        "COLDEX (Cold bore Experiment)",
        "installed in the Super Proton Synchrotron (SPS) at CERN",
        "is a test vacuum sector used in 2001-2004 to validate the Large Hadron Collider (LHC) cryogenic vacuum system with LHC type proton beams. Its cryostat houses a 2.2 m long copper perforated beam screen surrounded by a stainless steel cold bore",
        "both individually temperature controlled down to 5 and 3 K",
        "respectively. In the framework of the development for the High Luminosity upgrade of the LHC (HL-LHC)",
        "COLDEX has been re-commissioned in 2014. The objective of this re-commissioning is the validation of the performance of amorphous carbon coatings at cryogenic temperature with LHC type beams. The existing COLDEX beam screen has been dismounted and carbon coated",
        "while a complete overhaul of the vacuum",
        "cryogenic and control systems has been carried out. This contribution describes the phases of re-commissioning and reviews the current experimental set-up. An overview of the possible measurements with COLDEX",
        "in view of its HL-LHC experimental program",
        "is also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha006.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA007",
      "title": "Amorphous Carbon Coatings at Cryogenic Temperatures with LHC Type Beams: First Results with the COLDEX Experiment",
      "authors": [
        "R. Salemme",
        "V. Baglin",
        "G. Bregliozzi",
        "P. Chiggiato",
        "R. Kersevanpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Extrapolations of electron cloud data from the Large Hadron Collider (LHC) Run 1 to the High Luminosity upgrade (HL-LHC) beam parameters predict an intolerable increase of heat load on the beam screens of the inner triplets. Amorphous carbon (a-C) coating of the beam screen surface is proposed to reduce electron cloud production",
        "thereby minimising its dissipated power. To validate this solution",
        "the COLDEX experiment has been re-commissioned. Such equipment mimics the performance of the LHC cold bore and beam screen cryogenic vacuum system in presence of LHC beams in the Super Proton Synchrotron (SPS). The main objective of the study is the performance evaluation of a-C coatings while operating the beam screen in the 10 to 60 K temperature range and cold bore below 3 K. This paper reviews the status of COLDEX and the results obtained during its first experimental runs."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha007.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA009",
      "title": "Propagation of Radioactive Contaminants Along the Isolde Beamline",
      "authors": [
        "R. Kersevan",
        "M. Ady",
        "A. Dorsival",
        "A. Gottberg",
        "M. Maietta",
        "G. Vandoni",
        "CERN",
        "Geneva",
        "Switzerland",
        "The vacuum system of RIB facilities is entirely hermetical",
        "with storage of effluents and controlled release to atmosphere after a decay time. In Isolde",
        "distributed primary pumping is sectorized in three parts",
        "but all effluents are conveyed together in a unique tank. Thus",
        "highly contaminated gas from the target and front end may be mixed with less contaminated gas from the beam transfer lines. This study aims at analysing and quantifying the distribution and propagation of neutral rare gas radioactive isotopes along the Isolde beam-line by numerical simulation (steady-state and time resolved Test-Particle Monte-Carlo",
        "Molflow+) and experimental means. The time-resolved Monte-Carlo integrates decay time for the propagating species. To measure the distribution of contaminants",
        "sampling filters are installed at the exhaust of the vacuum turbo-molecular pumps. Comparison between simulation and experiment shows excellent agreement",
        "confirming the pertinence of the Monte-Carlo tool to radioactive species propagation. The filtering effect of magnetic sectors",
        "the RFQ Cooler",
        "and Buncher on the propagating neutral isotopes are quantified."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha009.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA010",
      "title": "The Vacuum System of the Extra-Low Energy Antiproton Decelerator ELENA at CERN",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "The Extra-Low ENergy Antiproton decelerator (ELENA) project is under way since 2011. In the past 3 years",
        "it has considerably evolved into a detailed design for the ring and the transfer lines. It is a small machine",
        "~30 m in circumference",
        "with a rather tight specification for the average pressure seen by the anti-proton beams injected by the anti-proton decelerator (AD). The average pressure in ELENA must be limited to 4x10-12 mbar (H2-equivalent) in order to limit the charge-exchange losses during the rather long deceleration process (several tens of seconds)",
        "during which the energy of the beam is reduced and the electron-cooler is used twice in order to decrease the transverse emittance of the anti-proton beam. This paper will discuss the design of the chambers of the injection line",
        "extraction line and the ring. It will also mention the actual status of the vacuum system for the transfer lines to the experiments",
        "LNE",
        "which are under finalisation. The results of detailed 3D simulations made with the test-particle montecarlo code Molflow+ will be discussed",
        "alongside with the choice for the pumping system",
        "mainly distributed NEG-coatings and integrated NEG/ion-pumps."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha010.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA011",
      "title": "Photodesorption and Electron Yield Measurements of Thin Film Coatings for Future Accelerators",
      "authors": [
        "R. Kersevan",
        "M. Ady",
        "P. Chiggiato",
        "CERN",
        "Geneva",
        "Switzerland",
        "T. Honda",
        "Y. Tanimoto",
        "KEK",
        "Tsukuba",
        "Japan",
        "The performance of future accelerators could be limited by electron cloud phenomena and high photodesorption yields. For such a reason",
        "the study of secondary electron and photodesorption yields of vacuum materials is essential. The eradication or mitigation of both secondary electron and molecule desorption could strongly reduce the beam scrubbing time and increase the availability of nominal beams for experiments. Surface modifications with the desired characteristics can be achieved by thin-film coatings",
        "in particular made of amorphous carbon and non-evaporable getters (NEG). In the framework of a new collaboration",
        "several vacuum chambers have been produced",
        "and different coatings on each of them have been applied. The samples were then irradiated at KEK’s Photon Factory with SR light of 4 keV critical energy during several days",
        "allowing the measurement of the photodesorption yield as a function of the photon dose. This paper presents the experiment and briefly summarizes the preliminary photodesorption and photoelectron yield data of different coatings. The results can be used for future machine design with similar conditions",
        "such as the FCC-hh."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha011.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA012",
      "title": "Synchrotron Radiation Distribution and Related Outgassing and Pressure Profiles for the HL-LHC Final Focus Magnets",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "The HL-LHC final focus area",
        "from D2 to the interaction point",
        "has been modelled based on the latest vacuum chamber geometry and orbits. The synchrotron radiation (SR) fans are computed using the Monte Carlo code SYNRAD+",
        "in the dipole approximation regime. The angular and energy dependence of the reflectivity of the copper surfaces is considered",
        "as well as the surface roughness. Once the SR distributions are computed",
        "they are converted into outstanding profiles by using data available in literature. The test-particle Monte Carlo code Molflow+ is then used and the related pressure profiles and gas density distribution are computed. This allows an optimization of the pattern of the perforations on the tungsten-shielded beam screen proposed for this area. It is shown that the resultant gas density is below the limit dictated by the ATLAS and CMS detectors."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha012.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA013",
      "title": "The Assembly Experience of the First Cryo-module for HIE-ISOLDE at CERN",
      "authors": [
        "Y. Leclercq",
        "G. Barlow",
        "J.A. Bousquet",
        "A. Chrul",
        "P. Demarest",
        "J-B. Deschamps",
        "J.A. Ferreira Somoza",
        "J. Gayde",
        "M. Gourragne",
        "A. Harrison",
        "G. Kautzmann",
        "D. Mergelkuhl",
        "V. Parma",
        "M. Struik",
        "M. Therasse",
        "L.R. Williams",
        "CERN",
        "Geneva",
        "Switzerland",
        "Intitek",
        "Lyon",
        "France",
        "The HIE ISOLDE project aims at increasing the energy of the radioactive ion beams of the existing REX ISOLDE facility from the present 3 MeV/u up to 10 MeV/u for A/q to 4.5. The upgrade includes the installation of a superconducting linac in successive phases",
        "for a final layout containing two low-β and four high-β cryo-modules. The first phase involves the installation of two high-B cryo-modules",
        "each housing five high- β superconducting cavities and one superconducting solenoid",
        "aligned within tight tolerances. After having designed and procured the cryo-module components",
        "the first units is now being assembled at CERN",
        "in a dedicated facility including class100 (ISO5) clean rooms equipped with specific tooling. The assembly is foreseen to be ultimate and the cryo-module cold tested by May 2015. In this paper",
        "after a brief description of the main design features of the cryo-module",
        "we present the assembly of the first unit",
        "including the methodology",
        "special tools",
        "assembly procedures and quality assurance aspects. We report on the experience from this first assembly",
        "including tests results",
        "and present prospects for the next-coming cryo-module assemblies."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA015",
      "title": "Beam Tests Using a Wide Band RF System Prototype in the CERN PS Booster",
      "authors": [
        "M.M. Paoluzzi",
        "M.E. Angoletta",
        "A. Findlay",
        "M. Haase",
        "M. Jaussi",
        "A.J. Jones",
        "J.C. Molendijk",
        "J. Sanchez-Quesada",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the framework of the LHC Injectors Upgrade project (LIU) and in view of a complete replacement of the existing CERN PS Booster (PSB) RF systems",
        "a small scale",
        "wide band prototype cavity was installed in 2012 in the machine. Following the encouraging tests done using this limited set up",
        "an almost full scale",
        "RF system prototype has been built and installed in the PSB during the Long Shutdown 1 (LS1). This modular",
        "Finemet® loaded system covers the band 0.5 / 4 MHz corresponding to the h=1 and h=2 frequency ranges. It uses solid-state power stages and includes fast RF feedback for beam loading compensation. New dedicated digital low level electronics have been implemented for all loops required for beam acceleration and interfaces with the general PSB control system. It allows using the new equipment at the fundamental and/or second harmonic of the beam revolution frequency as well as operating it in parallel with the existing RF systems. This paper describes the low level and power sections of the project and reports about the achieved results and experience built up so far."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha015.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA016",
      "title": "Experimental Setups to Determine the Damage Limit of Superconducting Magnets for Instantaneous Beam Losses",
      "authors": [
        "V. Raginel",
        "B. Auchmann",
        "R. Schmidt",
        "D. Schoerling",
        "A.P. Verweij",
        "D. Wollmann",
        "CERN",
        "Geneva",
        "Switzerland",
        "The damage mechanism of superconducting magnets due to the direct impact of high intensity particle beams is not well understood. Obvious candidates for upper bounds on the damage limit are overheating of insulation",
        "and melting of the conductor. Lower bounds are obtained by the limits of elasticity in the conductor",
        "taking into account dynamic effects (elastic stress waves). The plastic regime in between these two bounds will lead to differential thermal stress between the superconductor and stabilizer",
        "which may lead to a permanent degradation of the magnet. An improved understanding of these mechanisms is required especially in view of the planned increase in brightness of the beams injected into the LHC and of the future High Luminosity-LHC [2] and Future Circular Collider (FCC). In this paper the plans for room temperature damage tests on critical parts of superconducting magnets and the strategy to test their damage levels at 4.3 K in the HiRadMat facility at CERN",
        "using a 440 GeV proton beam generated by the Super Proton Synchrotron (SPS)",
        "is presented. Moreover the status of numerical simulations using FLUKA and multi-physics FEM code (ANSYS) to assess the different effect and the irradiation of the proposed experimental setup in preparation of the test is shown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha016.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA017",
      "title": "Qualification of the Bypass Continuity of the Main Dipole Magnet Circuits of the LHC",
      "authors": [
        "S. Rowan",
        "B. Auchmann",
        "K. Brodzinski",
        "Z. Charifoulline",
        "B.I. Panev",
        "F. Rodriguez-Mateos",
        "I. Romera",
        "R. Schmidt",
        "A.P. Siemko",
        "J. Steckert",
        "H. Thiesen",
        "A.P. Verweij",
        "G.P. Willering",
        "CERN",
        "Geneva",
        "Switzerland",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The copper-stabilizer continuity measurement (CSCM) was devised in order to attain complete electrical qualification of all busbar joints",
        "lyres",
        "and the magnet bypass connections in the 13~kA circuits of the LHC. A CSCM is carried out at 20 K",
        "i.e.",
        "just above the critical temperature",
        "with resistive magnets. The circuit is then subject to an incremental series of controlled powering cycles",
        "ultimately mimicking the decay from nominal current in the event of a magnet quench. A type test to prove the validity of such a procedure was carried out with success in April 2013",
        "leading to the scheduling of a CSCM on all main dipole circuits up to and including 11.1 kA",
        "i.e.",
        "the current equivalent of 6.5 TeV operation. This paper details the procedure",
        "with respect to the type test",
        "as well as the results and analyses of the LHC-wide qualification campaign."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha017.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA019",
      "title": "Development and Production of Non-evaporable Getter Coatings for MAX IV",
      "authors": [
        "P. Costa Pinto",
        "B. Bártová",
        "B. Holliger",
        "S. Marques Dos Santos",
        "V. Nistor",
        "A. Sapountzis",
        "M. Taborellipresenter",
        "I. Wevers",
        "CERN",
        "Geneva",
        "Switzerland",
        "J. Ahlbäck",
        "E. Al-Dmour",
        "M.J. Grabski",
        "C. Pasquino",
        "MAX-lab",
        "Lund",
        "Sweden",
        "MAX IV is presently under construction at Lund",
        "Sweden",
        "and the first beam for the production of synchrotron radiation is expected to circulate in 2016. The whole set of 3-GeV ring beam pipes is coated with Ti-Zr-V Non Evaporable Getter (NEG) thin film in order to fulfil the average pressure requirement of 1x10-9 mbar",
        "despite the compact magnet layout and the large aspect ratio of the vacuum chambers. In this work",
        "we present the optimisations of the coating process performed at CERN to coat different geometries and mechanical assembling used for the MAX IV vacuum chambers; the morphology of the thin films is analysed by Scanning Electron Microscopy; the composition and thickness is measured by Energy Dispersive X-ray analysis; the activation of the NEG thin film is monitored by X-ray Photoemission Spectroscopy; the vacuum performance of the coated beam pipes is evaluated by the measurement of hydrogen sticking coefficient. The results of the coating production characterisation for the 84 units coated at CERN are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha019.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA020",
      "title": "Titanium Coating of Ceramics for Accelerator Applications",
      "authors": [
        "W. Vollenberg",
        "P. Costa Pinto",
        "B. Holliger",
        "A. Sapountzis",
        "M. Taborellipresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "Titanium thin films can be deposited on ceramics",
        "in particular alumina",
        "without adherence problems. Even after air exposure their secondary electron yield is low compared to alumina and can be further reduced by conditioning or beam scrubbing. In addition",
        "depending on the film thickness",
        "titanium provides different surface resistances that fulfil requirements of ceramics in particle accelerators. Titanium thin films (MOhm square range) are used to suppress electron multipacting and evacuate charges from ceramic surfaces. Thicker films (5-25 Ω square range) are applied to lower the surface resistance so that the beam impedance is reduced. In this contribution",
        "we present the results of a development aimed at coating 2-meter long alumina vacuum chambers with a uniform surface resistivity by a dedicated DC magnetron sputtering configuration."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha020.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA021",
      "title": "Status of HIE-ISOLDE SC Linac Upgrade",
      "authors": [
        "A. Sublet",
        "L. Alberty",
        "K. Artoos",
        "S. Calatroni",
        "O. Capatina",
        "M.A. Fraser",
        "N.M. Jecklin",
        "Y. Kadi",
        "P. Maesen",
        "G.J. Rosaz",
        "K.M. Schirm",
        "M. Taborellipresenter",
        "M. Therasse",
        "W. Venturini Delsolaro",
        "P. Zhang",
        "CERN",
        "Geneva",
        "Switzerland",
        "The HIE-ISOLDE upgrade project at CERN aims at increasing the energy of radioactive beams from 3MeV/u up to 10 MeV/u with mass-to-charge ratio in the range 2.5-4.5. The objective is obtained by replacing part of the existing normal conducting linac with superconducting Nb/Cu cavities. The new accelerator requires the production of 32 superconducting cavities in three phases: 10 high-beta cavities for phase 1 (2016)",
        "10 high-beta cavities for phase 2 (2017) and possibly 12 low-beta cavities for phase 3 (2020). Half of the phase 1 production is completed with 5 quarter-wave superconducting cavities ready to be installed in the first cryomodule. The status of the cavity production and the RF performance are presented. The optimal linac working configuration to minimize cryogenic load and maximize accelerating gradient is discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha021.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA022",
      "title": "Characterization of Nb Coating in HIE-ISOLDE QWR Superconducting Accelerating Cavities by means of SEM-FIB and TEM",
      "authors": [
        "B. Bártová",
        "S. Calatroni",
        "A. Sublet",
        "M. Taborellipresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "A.B. Aebersold",
        "D.T.L. Alexander",
        "M. Cantoni",
        "EPFL",
        "Lausanne",
        "Switzerland",
        "The Quarter Wave Resonators (QWR) high-β cavities (0.3m diameter and 0.9m height) are made from OFE 3D-forged copper and are coated by DC-bias diode sputtering with a thin superconducting layer of niobium. The Nb film thickness",
        "morphology",
        "purity and quality are critical parameters for RF performances of the cavity. They have been investigated in a detailed material study. The coating structure at different positions along a test cavity was observed by cross-section imaging using SEM-FIB instrument. The samples from the top of the cavity showed presence of unexpected porosities",
        "whose volume was investigated using FIB tomography. TEM lamella was prepared for two samples (top part and inner conductor of the cavity) to study in detail the grain orientation in the coating",
        "its chemical composition and structure. The 14-layer structure in thick coating was indeed evidenced by the TEM analysis. Chemical mapping revealed the presence of a few nm in size copper precipitates close to the Nb/Cu interface and a passivating oxide layer of 10 nm thickness on top of the coating and around porosities. However no impurities or interface layer along the coating profile were present."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha022.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA023",
      "title": "Ferrite-tuner Development for 80 MHz Single-Cell RF-Cavity Using Orthogonally Biased Garnets",
      "authors": [
        "C. Vollinger",
        "F. Caspers",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the frame of the LHC Injector Upgrade program involving the existing 80 MHz cavities in the CERN PS accelerator",
        "an orthogonally biased ferrite tuner is foreseen to complement the current motor-driven piston tuner. This ferrite tuner shall provide the possibility of a fast frequency shift of about 200 kHz on the fundamental mode",
        "to allow a fast switching between proton and ion frequencies. In order to avoid water cooling and related issues",
        "the challenge was to bring magnetic losses in the tuner to a minimum such that a forced air cooling scheme will be sufficient. The tuner was first designed with simulation tools",
        "a prototype was built and low-power RF testing was performed on the tuner-cavity combination to evaluate tuning range",
        "bandwidth",
        "and stability. These tests were carried out on a single-cell copper RF cavity mock-up with a resonance frequency of 88 MHz",
        "where the ferrite tuner is connected via a tuning loop and the perpendicular magnetic bias for ferrite tuner is provided by a DC bias supply. Simulations and test data will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA024",
      "title": "Preliminary Design of a Perpendicular Biased Ferrite Loaded Accelerating Cavity",
      "authors": [
        "J. Eberhardt",
        "F. Caspers",
        "C. Vollingerpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "A ferrite loaded accelerating cavity with a frequency sweep of 18 to 40 MHz is studied for a possible upgrade of the CERN accelerator complex. The resonance frequency of a ferrite loaded cavity shifts by applying an external magnetic bias field to the ferrite material by means of changing the relative permeability. We present the electromagnetic design of such a cavity with a special emphasis on the modeling of the nonlinear",
        "anisotropic and dispersive characteristics of the ferrite’s relative permeability above magnetic saturation. For experimental crosscheck",
        "a ferrite loaded resonant test setup was built which provides results for the material performance in a magnetic bias field. A comparison of numerical simulations and experimental measurements is shown and calculations are benchmarked by measurement data. Based on this study a preliminary design of a ferrite loaded accelerating cavity is described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha024.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA025",
      "title": "Design of a Variable X-band RF Power Splitter",
      "authors": [
        "H. Zha",
        "A. Grudiev",
        "D. Gudkov",
        "I. Syratchev",
        "CERN",
        "Geneva",
        "Switzerland",
        "The design of a two output ports",
        "high power X-Band RF splitter with arbitrary split ratio is presented. This ratio is adjusted by mechanical changing the position a special RF short circuit piston. The piston is mounted on a step-motor providing the precise movement. Special measures were taken in the design to decrease the maximum electrical field on the cooper surface",
        "as well as to maximise the bandwidth of the device. This splitter will be tested in the high power X-band test stand at CERN."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha025.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA027",
      "title": "Solid State Amplifier Development for the Swiss Light Source",
      "authors": [
        "M.A. Gaspar",
        "T. Garvey",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The Paul Scherrer Institut currently operates a klystron amplifier on the booster ring of the Swiss Light Source (SLS). In order to have an optional RF source for the booster cavity",
        "we have been developing a compact 500MHz – 65kW solid state RF amplifier. An important goal in this development is the optimization of efficiency at any given operating point. In order to achieve this",
        "each RF module has been equipped with its own DC power supply (PS Controller)",
        "providing sufficient intelligence to adjust the drain and bias voltages in a fully independent and automatic way. With this technique it is possible to maximize the overall efficiency at any given RF output power. Considerable effort has been made in order to obtain extensive measurements from each individual module with the aim of investigating the behavior of such a large number of combined arrays. We will discuss the amplifier design and present the results of measurements."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha027.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA028",
      "title": "Power Saving Status at NSSRC",
      "authors": [
        "J.-C. Chang",
        "W.S. Chanpresenter",
        "Y.C. Chang",
        "Y.F. Chiu",
        "Y.-C. Chung",
        "C.W. Hsu",
        "K.C. Kuo",
        "Y.-C. Lin",
        "C.Y. Liu",
        "Z.-D. Tsai",
        "T.-S. Ueng",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Synchrotron Radiation Research Center (NSRRC)",
        "Taiwan has completed the construction of the civil and utility system engineering of the Taiwan Photon Source (TPS) in 2014. The machine is in commission currently. The power consumption is much higher than ever. Currently",
        "the contract power capacities of the Taiwan Light Source (TLS) and the TPS with the Taiwan Power Company (TPC) are 5.5 MW and 7.5 MW",
        "respectively. The ultimate power consumption of the TPS is estimated about 12.5 MW. To cope with increasing power requirement in the near future",
        "we have been conducting several power saving schemes",
        "which include adjustment of supply air temperature according to the atmosphere enthalpy",
        "replacement of old air conditioning unit (AHU)",
        "power consumption control by the operation of chillers",
        "power factor improvement",
        "and reduction of power consumption during long shutdown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha028.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA029",
      "title": "Operation of Both utility Systems of TPS and TLS at NSRRC",
      "authors": [
        "J.-C. Chang",
        "W.S. Chanpresenter",
        "Y.C. Chang",
        "C.S. Chen",
        "Y.F. Chiu",
        "Y.-C. Chung",
        "K.C. Kuo",
        "Y.-C. Lin",
        "C.Y. Liu",
        "Y.-H. Liu",
        "Z.-D. Tsai",
        "T.-S. Ueng",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The construction of the utility system for the 3.0 GeV Taiwan Photon Source (TPS) was started in the end of 2009. The utility building for the TPS ring had been completed in the end of 2014. The final test and improvement had been completed in the end of 2014. The TPS is in commission and TLS is still in operation. Within limited manpower and budget",
        "it is challenge to operate both utility systems stable and reliable. We provide good quality of electrical power",
        "cooling water and precision air temperature. Power saving is also an important issue. The utility system presented in this paper includes the electrical power",
        "cooling water",
        "air conditioning",
        "compressed air",
        "and fire control systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha029.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA030",
      "title": "EMI Measurement for TPS Booster Kicker and Septum Systems",
      "authors": [
        "Y.-H. Liu",
        "W.S. Chanpresenter",
        "C.S. Chen",
        "J.-R. Chen",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The purpose of this paper is to estimate the conducted and radiated Electromagnetic Interference (EMI) for subsystems in the TPS booster ring. A LISN (Line Impedance Stabilizing Network) system with a wide frequency range was conducted to measure the EMI spectrum of pulsed magnet system. The radiated EMI was tested by magnetic field probe",
        "which the measurement frequency range is 100 kHz ~ 3 GHz. A stray current was tested by wide frequency current transformer in order to measure the conducted current for kicker and septum systems. According to the experiment results",
        "the stray current could flow through the other subsystems or booster chamber",
        "and it might be affected the stability of booster operation. Therefore reducing and eliminating the interference of EM waves will be a very important issue. The EMI prevention scheme will be continued."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha030.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA032",
      "title": "Study on the LN2 Consumption of the Beamline Ln2 Transfer System for TPS Project*",
      "authors": [
        "H.C. Li",
        "W.S. Chanpresenter",
        "S.-H. Chang",
        "W.-S. Chiou",
        "F. Z. Hsiao",
        "W.R. Liao",
        "T.F. Lin",
        "H.H. Tsai",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "One system to transfer liquid nitrogen (LN2) will be installed at TPS in 2015 for beamline. This system includes two transfer lines (length 600 m)",
        "eight keep-full devices and 26 branch lines with 26 control valves for 24 straight sections of beam lines. The required consumption of LN2 for each beam line is 30 L/h. An archive system was developed to monitor and to calculate the consumption of LN2 for each beam line. This consumption was calculated based on the pressure difference and the flow coefficient (Kv) of the control valve. This paper presents the configuration of the LN2 supply system at NSRRC and a test bench of the calculation of LN2 consumption. A simple test result is presented and discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha032.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA033",
      "title": "Electrical Power SCADA System of Taiwan Photon Source",
      "authors": [
        "T.-S. Ueng",
        "W.S. Chanpresenter",
        "J.-C. Chang",
        "Y.F. Chiu",
        "K.C. Kuo",
        "Y.-C. Lin",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The architecture of power SCADA system of TPS and its monitored real time data are described in this report. The on-line monitored and measured items include voltage/current",
        "real power/reactive power",
        "power factor",
        "harmonic distortion",
        "etc. These data are presented in trend charts. The electric energy",
        "the power quality and the harmonic distortion obtained with the SCADA system are used to study the status of the power system",
        "and also provide information for the future improvement."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha033.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA034",
      "title": "Commissioning of the De-ionized Water System for Taiwan Photon Source",
      "authors": [
        "W.S. Chan",
        "J.-C. Chang",
        "Y.C. Chang",
        "C.S. Chen",
        "Y.-C. Chung",
        "C.W. Hsu",
        "C.Y. Liu",
        "Z.-D. Tsai",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The de-ionized water (DIW) system plays a critical role in removing waste heat from an accelerator machine. Through years of design and constructs",
        "the DIW system for Taiwan Photon Source (TPS) was complete at the end of 2013",
        "but it is important to confirm that the quantity and quality of DIW comply with the requirements of the accelerator machine. Testing",
        "adjustment and balancing methods have been applied to verify that the DIW system for TPS can provide flow rates greater than 1659",
        "380",
        "1284 and 1238 GPM in the individual Cu",
        "Al",
        "RF and booster subsystems. The proposed system can supply DIW of quality such that the resistivity is greater than 10 MΩ-cm at 25±0.1 oC; the concentration of dissolved oxygen (DO) is less than 10 ppb."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha034.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA035",
      "title": "Development of an IGBT Pulser for TPS LTB Kicker",
      "authors": [
        "C.L. Chen",
        "H.-P. Chang",
        "Y.-S. Chengpresenter",
        "C.-S. Fann",
        "K.T. Hsu",
        "S.Y. Hsu",
        "K.-K. Lin",
        "K.L. Tsai",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The TPS LTB injection kicker was first commissioned using PFN pulser equipped with thyratron switch. Although its bench-testing results fulfilled the specifications but the performance was degraded due to unavoidable integration difficulty. After evaluating a couple of improvement options in hand",
        "a pulser using IGBT switch was chosen for off-the-bench beneficial purpose. The upgraded pulser satisfies the overall specifications with comfortable margins. Some major performance parameters such as flattop and tail ringing are emphasized concerning their influence on beam injection. This report describes the field-testing result of this IGBT pulser."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha035.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA037",
      "title": "DESIGN STORAGE RING AND BOOSTER RING POWER SUPPLY CABLING IN TAIWAN PHOTON SOURCE",
      "authors": [
        "Y.S. Wong",
        "Y.-C. Chien",
        "C.Y. Liupresenter",
        "K.-B. Liu",
        "B.S. Wang",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "For this paper is studies the storage ring and booster ring power supply cabling design",
        "Papers can be divided into cabling design",
        "control and instrument area construction (CIA)",
        "and testing; design including estimated cable length and arrangement",
        "the CIA construction part site of the cable erection and overcome barriers of space; detection section is high resistance meter and insulation testing. Circumference of booster ring is 496.8 meter and storage ring is 518.4 meter",
        "TPS (Taiwan Photon Source) beam current is 500mA at 3GeV. Booster Ring dipole into BD and BH series 54 magnets",
        "cable size is 250 mm2 and total length of 5000m. Booster Ring and storage ring quadrupole 150 magnets and cable size 250 mm2",
        "total length of 17000m. Storing Ring dipole 48 magnets cable size 325 mm2",
        "total length of 6000m. On the positive and negative voltage cables will produce magnetic interference effects generated through cabling overlapped technology eliminates magnetic interference. Finally",
        "using a high-impedance machine to detect cabling insulation effect. TPS power supply to the energy transfer is to ensure safe and correct magnet."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha037.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA038",
      "title": "Upgrading the Performance of the Power Supply for the TPS Booster Dipole Magnets",
      "authors": [
        "C.Y. Liu",
        "Y.-C. Chien",
        "K.-B. Liu",
        "B.S. Wang",
        "Y.S. Wong",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The performance of the power supply for the dipole magnet is important for the TPS booster ring. The output current of the power supply follows the beam current from 150 MeV ramping to 3 GeV. The frequency of the power supply is 3 Hz. The power supply must thus push enormous energy into the dipole magnets at +1000 V and +1000 A",
        "and can handle this job. Because the TPS booster dipole supply is bipolar and the voltage is large",
        "the lodged capacitors have large effects that produce common-mode high-frequency current noise",
        "which drives the power supply beyond specification. The TPS booster ring hence fails to meet the dc and ramping specification. We designed a common-mode filter to solve the high-frequency current noise by absorbing the current noise from the path of the lodged capacitors to the ground pad. The TPS booster dipole supply thus works within the specification when the power supply is in the dc or ramping mode. The beam current from the 150- MeV dc mode for the injection mode can ramp the beam current to 3 GeV. This paper reports the excellent results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha038.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA039",
      "title": "Inrush Current Suppression Scheme of Hot Swap Power Modules",
      "authors": [
        "Y.T. Li",
        "C.Y. Liupresenter",
        "K.-B. Liu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The corrected magnet power supplies apply modular designed for Taiwan Photon Source synchrotron project (TPS). If the module is damaged in the chassis",
        "it must to be replaced without interrupting the power. However",
        "the modular is a shared DC bus. If there is no good design and planning",
        "it will cause the protection circuit into action. In this article the theoretical derivation and implementation are used to prove the feasibility and necessity of the soft-start circuit. In the actual signal measurements it could be clearly seen the inrush currents is refrained and improved. Finally",
        "the soft-start circuit is implemented applications in correction magnet power supply modular of Taiwan Photon Source synchrotron project (TPS)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha039.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA040",
      "title": "Status of AC Power Supplies for TPS Booster Ring",
      "authors": [
        "Y.-C. Chien",
        "P.C. Chiu",
        "K.T. Hsu",
        "C.Y. Liupresenter",
        "K.-B. Liu",
        "B.S. Wang",
        "Y.S. Wong",
        "C.Y. Wu",
        "NSRRC",
        "Hsinchu",
        "Taiwan"
      ],
      "institutions": [],
      "abstract": "TPS is a third generation 3 GeV synchrotron light source under commission in Taiwan. The TPS Booster ring is concentric ring design sharing the same tunnel with storage ring. The booster ring power supplies are responsible of accelerating the 150 MeV Linac output energy to 3 GeV before the beam is preserved in the storage ring. The booster ring power supplies are required to operate at 3Hz sinusoidal waveform with 1000 A peak current for the dipole magnet. All power supplies' specifications and output performance are demonstrated here in this paper. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha040.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA041",
      "title": "ALGORITHM AND CIRCUIT TO IMPROVE ZERO-CROSSING STABILITY OF BIPOLAR TPS TRIM COIL POWER SUPPLY",
      "authors": [
        "B.S. Wang",
        "Y.-C. Chien",
        "P.C. Chiu",
        "K.T. Hsu",
        "C.Y. Liupresenter",
        "K.-B. Liu",
        "Y.S. Wong",
        "C.Y. Wu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "In TPS (Taiwan Photon Source) project",
        "58 home-built small form factor bipolar power supplies are used to fine-tune the trim coil of booster ring bending dipole magnets. With the preliminary analog PI control loop design version",
        "current output will tend to behave with poor linearity around zero current. By employing DSP chip",
        "a full digital PI control loop design together with optimal MOSFT switching algorithm and 13bits PWM output capability is capable of improving the output current performance around zero current. Before the final realization",
        "MATLAB SIMULINK is utilized to find out the optimal MOSFT switching algorithm",
        "and then physical circuit is implemented and tested. The result and design will be demonstrated in this paper to show significant improvement around zero current."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha041.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA042",
      "title": "Commissioning of the TPS Cooling System: Testing, Adjusting, Balancing and Numerical Simulation",
      "authors": [
        "Z.-D. Tsai",
        "W.S. Chanpresenter",
        "Y.C. Chang",
        "C.S. Chen",
        "Y.-C. Chung",
        "C.W. Hsu",
        "C.Y. Liu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The civil construction and utility systems of the 3-GeV Taiwan Photon Source (TPS) at NSRRC are ready for machine commissioning in 2014. To achieve a highly precise control of temperature",
        "the thermal load must be carefully controlled and balanced. On analysis of the characteristics between the water pipes and the balance valves",
        "a specified control philosophy can effectively adjust the pressure load on the branch pipes to balance the water flow. With regard to the air flow",
        "we use a damper",
        "baffle plant or variable air-volume (VAV) box to balance the air flow of each diffuser. Here we discuss the mechanism through a numerical simulation of the hydrodynamics and verify the practical influences of the testing",
        "adjusting and balancing (TAB) for de-ionized water and the heating",
        "ventilation and air-conditioning (HVAC) system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha042.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA044",
      "title": "Alignment Design and Status of Taiwan Photon Source",
      "authors": [
        "W.Y. Lai",
        "M.L. Chen",
        "P.S.D. Chuang",
        "H.C. Ho",
        "K.H. Hsu",
        "D.-G. Huang",
        "C.K. Kuan",
        "C.J. Lin",
        "S.Y. Perng",
        "T.C. Tsengpresenter",
        "H.S. Wang",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "After the construction of Taiwan Photon Source (TPS) was finished",
        "the variation of the survey fiducials was stable. However",
        "the following precise alignment work is concerned by the change of temperature critically. In this paper",
        "the whole process of alignment work in the TPS storage ring with the relation of survey network and thermal issues of the environment will be described. We analysed these survey data so that the correction of survey network could be estimated by the change of temperature",
        "thus all the elements for example",
        "booster",
        "pedestals",
        "and girders could be positioned within the shortest time."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha044.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA045",
      "title": "Design and Construction of the RF Electronic System at Taiwan Photon Source",
      "authors": [
        "F.-T. Chung",
        "L.-H. Chang",
        "M.H. Chang",
        "L.J. Chen",
        "PY. Chen",
        "M.-C. Lin",
        "Z.K. Liu",
        "C.H. Lo",
        "C.L. Tsai",
        "M.H. Tsai",
        "Ch. Wang",
        "M.-S. Yeh",
        "T.-C. Yu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The RF electronic system at NSRRC was made fully in house by the RF group from design through construction to completion. The first RF electronic system includes an analogue LLRF system",
        "a step motor",
        "and an ARC module of a Petra cavity. It was successfully integrated with a 100-kW RF transmitter",
        "high-power RF transfer system",
        "and a cooling system and applied to the booster of TPS. Two duplicated RF electronic system were then applied to the storage ring but integrated with the 300-KW transmitters. With these RF systems",
        "the TPS storage ring achieved beam current 100 mA on 2015 March 26."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA046",
      "title": "Outgassing Analysis During Transport for 14m Long Arc-Cell Vacuum Chambers of the Taiwan Photon Source",
      "authors": [
        "L.H. Wu",
        "C.K. Chan",
        "C.H. Chang",
        "C.-C. Chang",
        "S.W. Chang",
        "Y.P. Chang",
        "B.Y. Chen",
        "J.-R. Chen",
        "Z.W. Chen",
        "C.M. Cheng",
        "G.-Y. Hsiung",
        "S-N. Hsu",
        "H.P. Hsueh",
        "C.S. Huang",
        "Y.T. Huang",
        "T.Y. Lee",
        "I.C. Yangpresenter",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "National Tsing Hua University",
        "Hsinchu",
        "Taiwan",
        "An outgassing analysis during transportation for the large",
        "14-m-long",
        "ultra-high-vacuum aluminum arc-cell chambers of the Taiwan Photon Source (TPS) was performed using residual gas analysis (RGA). Each cell was baked to 150 °C in the laboratory to achieve ultra-high vacuum. Under pumping by primarily ion pumps (IP) and non-evaporable getter (NEG) pumps",
        "the cells obtained pressures of 6.4×10-9 Pa on average",
        "and the main residual gas was H2. Here",
        "vacuum pressure measurements and residual gas analyses were performed in situ while a cell chamber was being transported. It was found that the vibration of the arc-cell vacuum chamber caused the pressure to rise abruptly; in this case",
        "the main outgassing gas was CH4. Once the arc cell had been fully installed",
        "the vacuum pressure gradually decreased to the original vacuum pressure because of the pumping effect of the ion gauges."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA048",
      "title": "Behavior of Vacuum Pressure in TPS Vacuum System",
      "authors": [
        "I.C. Yang",
        "C.K. Chan",
        "C.-C. Chang",
        "B.Y. Chen",
        "J.-R. Chen",
        "C.M. Cheng",
        "J. -Y. Chuang",
        "G.-Y. Hsiung",
        "C.K. Kuan",
        "C.C. Liang",
        "I.C. Sheng",
        "L.H. Wu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Taiwan Photon source (TPS) is in its first stage commissioning in 2014-2015. The vacuum systems of TPS were installed for commissioning since August 2014. After four months performance testing and subsystem integration",
        "the commissioning of booster ring began on 12 December and then the first 3 GeV beam was stored on 31 December. 100mA beam current",
        "35Ah accumulated beam dose was archived in March 2015 before machine shut down. The average pressure in storage ring is 2.8×10-8 Pa before commissioning",
        "rising to 1.33×10-7 Pa with 100mA beam current. In 35Ah accumulated beam dose",
        "the target of beam cleaning effect has reached to 8.92×10-10 Pa/mA. The vacuum performance",
        "experience and events during commissioning will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha048.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA049",
      "title": "Demagnetize Booster Chamber in TPS",
      "authors": [
        "I.C. Sheng",
        "C.-T. Chen",
        "C.K. Kuan",
        "I.C. Yangpresenter",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Taiwan Photon Source (TPS) project starts its booster commissioning starts from August 2014. Few issues have been discovered and fixed. Since the booster aperture is relatively small and number of magnets is barely sufficient. Therefore extreme precise control of booster chamber alignment and the corresponding chamber permeability is as well important. In this paper",
        "we present how the booster chamber is uninstalled",
        "demagnetized and reinstalled within three weeks. This procedure is proven to result in the lowest booster chamber permeability in the world and a good high vacuum booster ring is built in 3 weeks."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha049.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA051",
      "title": "Development of a Hybrid Power Supply and RF Transmission Line for SANAEM RFQ Accelerator",
      "authors": [
        "Bogazici University",
        "Bebek / Istanbul",
        "Turkey",
        "EPROM Electronic Project & Microwave Ind. and Trade Ltd. Co.",
        "Ankara",
        "Turkey",
        "SNRTC",
        "Ankara",
        "Turkey",
        "Ankara University",
        "Faculty of Sciences",
        "Ankara",
        "Turkey",
        "UCI",
        "Irvine",
        "California",
        "USA",
        "SANAEM Project Prometheus (SPP) has been building a proton beamline at MeV range. Its proton source",
        "two solenoids",
        "and a low energy diagnostic box have been already manufactured and installed. These are going to be followed by a 4-vane RFQ to be powered by two stage PSU. The first stage is a custom-built solid state amplifier providing 6 kW at 352.2 MHz operating frequency. The second stage",
        "employing TH 595 tetrodes from Thales",
        "will amplify this input to 160 kW in a short pulsed mode. The power transfer to the RFQ will be achieved by the means of a number of WR2300 full and half height waveguides",
        "3 1/8\" rigid coaxial cables",
        "joined by appropriate adapters and converters and by a custom design circulator. This paper summarizes the experience acquired during the design and the production of these components."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha051.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA052",
      "title": "Test Cavity and Cryostat for SRF Thin Film Evaluation",
      "authors": [
        "O.B. Malyshev",
        "P. Goudketpresenter",
        "L. Gurran",
        "D.O. Malyshev",
        "S.M. Pattalwar",
        "R. Valizadeh",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "G. Burt",
        "L. Gurran",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "P. Goudketpresenter",
        "O.B. Malyshev",
        "S.M. Pattalwar",
        "R. Valizadeh",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "T.J. Jones",
        "E.S. Jordan",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "In developing superconducting coatings for SRF cavities",
        "the coated samples are tested using various techniques such as resistance measurements",
        "AC and DC magnetometry which provide information about the superconducting properties of the films such as RRR",
        "Hc1",
        "Hc2 and vortex dynamics. However",
        "these results do not allow the prediction of the superconducting properties at RF frequencies. A dedicated RF cavity was designed to evaluate surface resistive losses on a flat sample. The cavity contains two parts: a half-elliptical cell made of bulk Nb and a flat Nb disc. The two parts can be thermally and electrically isolated via a vacuum gap",
        "whereas the electromagnetic fields are constrained through the use of RF chokes. Both parts are conduction cooled hence the system is cryogen free. The flat disk can be replaced with a sample",
        "such as a Cu disc coated with Nb film. The RF test provide the cavity Q-factor and thermometrical measurements of the losses on the sample. The design advantages are that the sample disc can be easily installed and replaced; installing a new sample requires no brazing/welding/vacuum or RF seal",
        "so the sample preparation is simple and inexpensive."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha052.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA053",
      "title": "Surface Resistance RF Measurements of Materials Used for Accelerator Vacuum Chambers",
      "authors": [
        "P. Goudket",
        "L. Gurran",
        "O.B. Malyshev",
        "M.D. Roper",
        "R. Valizadeh",
        "S. Wilde",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "G. Burt",
        "L. Gurran",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "P. Goudket",
        "O.B. Malyshev",
        "R. Valizadeh",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Loughborough University",
        "Loughborough",
        "Leicestershire",
        "United Kingdom",
        "The RF surface resistance of accelerator vacuum chamber walls can have a significant impact on the beam quality. There is a need to know how the use of a new material",
        "surface coating or surface treatment can affect the RF surface resistance. ASTeC and Lancaster University have designed and built two test cavities where one face can be replaced with a sample in the form of a flat plate. The measurements are performed with a network analyser at the resonant frequency of approximately 7.8 GHz."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha053.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA054",
      "title": "Commissioning of the Transverse Deflecting Cavity on VELA at Daresbury Laboratory",
      "authors": [
        "A.E. Wheelhouse",
        "R.K. Buckley",
        "S.R. Buckley",
        "L.S. Cowie",
        "P. Goudketpresenter",
        "L. Ma",
        "J.W. McKenzie",
        "A.J. Moss",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "G. Burt",
        "M. Jenkins",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom"
      ],
      "institutions": [
        "A 9-cell S-band transverse deflecting copper cavity (TDC) has been designed and built to provide a 5 MV transverse kick in order to perform longitudinal profile measurements of the electron bunch on the Versatile Electron Linear Accelerator (VELA) at Daresbury Laboratory. The cavity has been manufactured by industry and has been field flatness tuned using a beadpull system. The cavity has then been installed on to the VELA facility and commissioned for operation with the electron beam. This paper discusses the tuning and the RF conditioning of the cavity."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha054.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA057",
      "title": "High Gradient Testing of an X-band Crab Cavity at XBox2",
      "authors": [
        "B.J. Woolley",
        "P.K. Ambattu",
        "R. Apsimonpresenter",
        "G. Burt",
        "A.C. Dexter",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "A. Grudiev",
        "I. Syratchev",
        "R. Wegner",
        "B.J. Woolley",
        "W. Wuensch",
        "CERN",
        "Geneva",
        "Switzerland",
        "CERN’s Compact linear collider (CLIC) will require crab cavities to align the bunches to provide effective head-on collisions. An X-band quasi-TM11 deflecting cavity has been designed and manufactured for testing at CERN’s Xbox-2 high power standalone test stand. The cavity is currently under test and has reached an input power level in excess of 40MW",
        "with a measured breakdown rate of better than 10-5 breakdowns per pulse. This paper also describes surface field quantities which are important in assessing the expected BDR when designing high gradient structures."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha057.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA058",
      "title": "Superconducting Coatings Synthesized by CVD/PECVD for SRF Cavities",
      "authors": [
        "P. Pizzol",
        "P. Chalker",
        "T. Heil",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "A.N. Hannah",
        "O.B. Malyshev",
        "S.M. Pattalwar",
        "R. Valizadeh",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Bulk niobium cavities are widely employed in particle accelerators to create high accelerating gradient despite their high material and operation cost. In order to reduce this cost",
        "thin layer of niobium are deposited on a copper cavity",
        "which has lower material cost with higher availability and more importantly higher thermal conductivity. The coating of superconducting cavities currently is synthesized by physical vapour deposition (PVD) method which suffers from lack of conformity. By using chemical vapour deposition (CVD) and plasma enhanced chemical vapour deposition (PECVD) it is possible to deposit thin Nb layers uniformly with density very close to bulk material. This project explores the use of PECVD / CVD techniques to deposit metallic niobium on copper using NbCl5 as precursor and hydrogen as a coreagent. The samples obtained were then characterized via SEM",
        "TEM",
        "SAD",
        "XRD",
        "XPS",
        "and EDX as well as assessing their superconductivity characteristics (RRR and Tc) All the samples deposited are superconductive and polycrystalline; the sample obtained with CVD measured RRR=31 and Tc=7.9 K",
        "while the sample obtained with PECVD exhibited RRR=9 and Tc= 9.4 K. In both cases the films grew in a (100) preferred orientation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha058.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA059",
      "title": "Physical Vapour Deposition of Thin Films for Use in Superconducting RF Cavities",
      "authors": [
        "S. Wilde",
        "B. Chesca",
        "Loughborough University",
        "Loughborough",
        "Leicestershire",
        "United Kingdom",
        "A.N. Hannah",
        "D.O. Malyshev",
        "O.B. Malyshev",
        "S.M. Pattalwar",
        "R. Valizadeh",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The production of superconducting coatings for radio frequency cavities is a rapidly developing field that should ultimately lead to acceleration gradients greater than those obtained by bulk Nb RF cavities. Optimizing superconducting properties of Nb thin-films is therefore essential. Nb films were deposited by magnetron sputtering in pulsed DC mode onto Si (100) and MgO (100) substrates and also by high impulse magnetron sputtering (HiPIMS) onto Si (100)",
        "MgO (100) and polycrystalline Cu. The films were characterised using scanning electron microscopy",
        "x-ray diffraction and DC SQUID magnetometry."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha059.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPHA060",
      "title": "MW Power Upgrade Studies of the ISIS TS1 Target",
      "authors": [
        "C. Bungau",
        "A. Bungau",
        "R. Cywinski",
        "T.R. Edgecock",
        "University of Huddersfield",
        "Huddersfield",
        "United Kingdom",
        "C.N. Booth",
        "L. Zangpresenter",
        "Sheffield University",
        "Sheffield",
        "United Kingdom",
        "The increasing demand for neutron production at the ISIS neutron spallation source has motivated a study of an upgrade of the production target TS1. This study focuses on a 5 MW power upgrade and complete redesign of the ISIS TS1 spallation target",
        "reflector and neutron moderators. The optimisation of the target-moderator arrangement was done in order to obtain the maximum neutron output per unit input power. In addition",
        "at each step of this optimisation study",
        "the heat load and thermal stresses were calculated to ensure the target can sustain the increase in the beam power."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepha060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepha060.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepha060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPHA060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 48,
  "scrape_time": "2025-10-10 20:31:38"
}