{
  "session_info": {
    "id": "WEXXPLS",
    "name": "WEXXPLS - Contributed Orals: Accelerator Technology",
    "url": "https://proceedings.jacow.org/ipac2019/html/wexxpls.htm"
  },
  "papers": [
    {
      "paper_id": "WEXXPLS1",
      "title": "Magnetron R&D for High Efficiency CW RF Sources of Particle Accelerators",
      "authors": [
        "H. Wang",
        "R.M. Nelson",
        "R.A. Rimmer",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "B.R.L. Coriton",
        "C.P. Moeller",
        "GA",
        "San Diego",
        "California",
        "USA",
        "A. Dudas",
        "M.L. Neubauer",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "The scheme of using a high efficiency magnetron to drive a superconducting or normal conducting radio frequency accelerator cavity needs not only injection phase locking but also amplitude modulation to compensate for the cavity’s microphonics",
        "frequency change",
        "variations of cavity voltage and beam current. To be able to do a fast and efficient modulation and to compensate the frequency pushing effect due to the anode current change",
        "the magnetron’s magnetic field has to be trimmed by an external coil*. To facilitate this",
        "a low eddy current magnetron body has been designed and built**. This paper will present the experimental results of such modulation on a conventional 2.45 GHz magnetron at the R&D test stand. In addition",
        "the progresses on the injection lock test to a new 1497 MHz",
        "13kW magnetron prototype aimed for the CEBAF klystron replacement with newly built low level RF (LLRF) controller for the amplitude modulation will be reported. Based on these R&D results",
        "a 915MHz",
        "2×75kW CW industrial heating type magnetron system is being developed to be used for the high efficiency (>80%) RF source to the electron accelerator for industrial applications.",
        "* H. Wang",
        "et al"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/wexxpls1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/wexxpls1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/wexxpls1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-WEXXPLS1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXXPLS2",
      "title": "Accelerator Vacuum Windows: A Review of Past Research and a Strategy for the Development of a New Design for Improved Safety and Longevity for Particle Accelerators",
      "authors": [
        "C.R. Ader",
        "M.L. Alvarez",
        "J.S. Batko",
        "R. Campos",
        "M.W. McGee",
        "A.C. Watts",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Vacuum window research continues at Fermilab and this paper will examine cost effective",
        "consistent designs which can have a significant impact on accelerator laboratories in terms of safety and cost. Issues such as the design",
        "materials",
        "analysis",
        "testing and fabrication are addressed",
        "including beam scattering and materials cost-benefit analysis and examining potential material substitutes for beryllium. A previous research paper has examined current fabrication and design techniques and also failure modes at Fermi",
        "and this paper focuses on emerging and novel technologies for vacuum window fabrication. Many different paths have been taken by High Energy Physics (HEP) Laboratories throughout the world with varying success. The history of vacuum window development is extensive and not well defined",
        "and a matrix of the research already completed on materials and joint design for vacuum windows will be shown. This report finally includes a treatise for vacuum window technology and a view towards emerging designs and materials and discusses future advances of research such as fabrication techniques including additive manufacturing and ultrasonic welding. Further exploration into these would prove beneficial to developing vacuum windows that are safer and stronger while being more transparent to the beam."
      ],
      "institutions": [
        "Funding: Fermi National Accelerator Laboratory"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/wexxpls2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/wexxpls2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/wexxpls2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-WEXXPLS2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEXXPLS3",
      "title": "Is it Possible to Use Additive Manufacturing for Accelerator UHV Beam Pipes?",
      "authors": [
        "G. Sattonnay",
        "M. Alves",
        "S. Bilgen",
        "B.J. Bonnis",
        "A. Gonnin",
        "D. Grasset",
        "S. Jenzer",
        "F. Letellier-Cohen",
        "B. Mercier",
        "E. Mistretta",
        "LAL",
        "Orsay",
        "France",
        "ICMMO",
        "Orsay",
        "France",
        "Recently",
        "additive manufacturing (AM) has revolutionized mechanical engineering by allowing the quick production of mechanical components with complex shapes. AM by selective laser melting (SLM) is an advanced manufacturing process which uses lasers to melt metal powders one layer at a time to produce final 3D components. This technology could be also used to make Ultra High Vacuum components. Therefore",
        "we investigated in this work the reproducibility of AM 316L stainless steel properties for different specimen supplied by several manufacturers with the same SLM process. Clearly",
        "the microstructure and therefore the mechanical properties of the investigated AM samples are different as a function of manufacturers: indeed",
        "they are largely influenced by processing parameters",
        "which produces heterogeneous and anisotropic microstructures that differ from traditional wrought counterparts. Samples were also submitted to bake cycles at high temperature",
        "in order to check the structural stability of material properties after heat treatments. The outgassing rates and the secondary emission yield of vacuum components constructed from AM 316L were also measured. Finally",
        "the possibility to use AM for accelerator beam pipes will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/wexxpls3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/wexxpls3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/wexxpls3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-WEXXPLS3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:12:18"
}