{
  "conference_info": {
    "name": "2018",
    "code": "pcapac2018",
    "url": "https://proceedings.jacow.org/pcapac2018/",
    "status": "pending"
  },
  "sessions": [
    {
      "session_info": {
        "id": "WEKT",
        "name": "WEKT - Keynote Talk 1",
        "url": "https://proceedings.jacow.org/pcapac2018/html/wekt.htm"
      },
      "papers": [
        {
          "paper_id": "WEKT1",
          "title": "Abstraction or Instantiation: On Building the Internet for Smarter Places",
          "authors": [
            "Skywatch",
            "Taipei",
            "Taiwan",
            "Inventec",
            "Taipei",
            "Taiwan",
            "There are two ends of the spectrum when it comes to Internet-of-Things. On the one end",
            "the focus is on lower level communication technology",
            "platforms",
            "and standards that aim to enable machine-to-machine communications. On the other end",
            "people have been searching for the killer devices that would transform our lives. Clearly",
            "one is the \"Internet\" perspective",
            "while the other is the \"Things\" perspective. In this talk",
            "instead of taking the words \"Internet of Things\" literally",
            "we focus on the combined effects of devices on environments. Specifically",
            "we discuss the conversations between devices",
            "and how these interactions can open new frontiers of digitized spaces in the era of machine learning."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wekt1_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wekt1.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wekt1_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEKT1",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 1,
      "scrape_time": "2025-10-11 02:01:37"
    },
    {
      "session_info": {
        "id": "WEPI",
        "name": "WEPI - Poster in Pills 1",
        "url": "https://proceedings.jacow.org/pcapac2018/html/wepi.htm"
      },
      "papers": [
        {
          "paper_id": "WEPI1",
          "title": "EtherCAT Driver and Tools for EPICS and Linux at PSI",
          "authors": [
            "PSI",
            "Villigen PSI",
            "Switzerland",
            "EtherCAT bus and interface are widely used for external module and device control in accelerator environments at PSI",
            "ranging from modulator and undulator communication and control",
            "over motion control",
            "basic I/O control",
            "all the way to Machine Protection System for the new SwissFEL accelerator. A combined EPICS/Linux driver package has been developed at PSI",
            "to allow for simple and mostly automatic setup of various EtherCAT configurations. The driver is capable of automatic scan of the existing devices and modules",
            "followed by self-configuration and finally autonomous operation of the EtherCAT bus real-time loop. Additionally",
            "the driver package supports the user PLC to manipulate EtherCAT data in real time",
            "implements fast real-time (single cycle) slave-to-slave communication (skipping EPICS layer or PLC completely)",
            "features guaranteed one-shot trigger signals otherwise not supported by EPICS and much more. All the standard EtherCAT functions are supported",
            "including the complete reprogramming of slave configurations and configuration generation for programmable slaves",
            "such as EL6692 and EL6695 network bridges.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP01 paper received ※ 08 October 2018       paper accepted ※ 16 October 2018        issue date ※ 21 January 2019 reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi1_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi1.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi1_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI1",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "WEPI2",
          "title": "BLISS - Experiments Control for ESRF Beamline",
          "authors": [
            "V. Michel",
            "A. Beteva",
            "T.M. Coutinho",
            "M.C. Dominguez",
            "M. Guijarro",
            "C. Guilloud",
            "A. Homs",
            "J.M. Meyer",
            "E. Papillon",
            "M. Perez",
            "S. Petitdemange",
            "ESRF",
            "Grenoble",
            "France",
            "BLISS is the new ESRF control system for running experiments",
            "with full deployment aimed for the end of the EBS upgrade program in 2020. BLISS provides a global approach to run synchrotron experiments",
            "thanks to hardware integration",
            "Python sequences and an advanced scanning engine. As a Python package",
            "BLISS can be easily embedded into any Python application and data management features enable online data analysis. In addition",
            "BLISS ships with tools to enhance scientists user experience and can easily be integrated into TANGO based environments",
            "with generic TANGO servers on top of BLISS controllers. BLISS configuration facility can be used as an alternative TANGO database. Delineating all aspects of the BLISS project from beamline device configuration up to the integrated user interface",
            "this poster will present the technical choices that drove BLISS design and will describe the BLISS software architecture and technology stack in depth."
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi2_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi2.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi2_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI2",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "WEPI3",
          "title": "A General Solution for Complex Vacuum System Controls",
          "authors": [
            "G. Bischof",
            "A. M. Barbour",
            "B. A. Sobhani",
            "A. Walter",
            "BNL",
            "Upton",
            "Long Island",
            "New York",
            "USA",
            "At the National Synchrotron Light Source II (NSLS-II) there are many different ultra-high vacuum system configurations on the unique beamline end-stations. The proposed controls solution attempts to capture the requirements of all of these configurations with a single standard logic and graphical user interface. Additional design considerations include: resource management for multiple users",
            "providing a high level of abstraction to simplify operation for users",
            "providing a high level of flexibility to do non-standard operations",
            "minimizing shock from pressure differentials when opening valves",
            "supporting a variety of pumps",
            "and maximizing pump lifetime. At NSLS-II it was determined that all vacuum configurations can be captured by the composition of three standard objects: a \"rough vacuum group\"",
            "and \"high vacuum group\"",
            "and a \"smart vacuum manifold\" which implements a blocking queue. These objects can be flexibly linked together to meet the needs of the beamline experiments. This solution is platform independent",
            "but implemented and tested here using Pfeiffer vacuum pumps",
            "Allen Bradley PLC",
            "EPICS",
            "and Control System Studio (CSS).",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP03 paper received ※ 10 October 2018       paper accepted ※ 16 October 2018        issue date ※ 21 January 2019 reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi3_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi3.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi3_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI3",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "WEPI4",
          "title": "Developing and Validating OPC-UA Based Industrial Controls for Power Supplies at CERN",
          "authors": [
            "M. Ludwig",
            "J.A.R. Arroyo Garcia",
            "M. Bengulescu",
            "B. Farnham",
            "P.G.J. Gonzalez Jimenez",
            "F. Varela",
            "CERN",
            "Meyrin",
            "Switzerland",
            "The industrial control systems of CERN’s experiments are undergoing major renovation since 2017 and well into CERN’s second Long Shutdown (LS2) until the end of 2019. Each detector power-supply control system runs several hundred software instances consisting of many different components in parallel on a large scale",
            "broadly distinguishable as servers and clients. Our accumulated experience during LHC runs proves that some complex control issues are impossible to detect using stand-alone components on a small scale only. Furthermore",
            "new components must be developed well before the electron-ics becomes available",
            "without impact on operations. Moreover",
            "during LS2",
            "the improved and now widely established Open Protocol Communication Unified Ar-chitecture (OPC-UA) replaces OPC-DA as middleware protocol. For these reasons",
            "we developed a simulation environment to emulate the real",
            "and valuable",
            "CAEN power-supply electronics underneath the OPC-UA serv-ers. This distributed simulation is configurable to mimic and exceed the nominal conditions during production and provides a repeatable setup for validation. This paper discusses the functionality and use of this simulation service.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP04 paper received ※ 05 October 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi4_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi4.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi4_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI4",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "WEPI5",
          "title": "Wireless Internet of Thing Application in the TLS",
          "authors": [
            "C.H. Kuo",
            "K.H. Hu",
            "C.-J. Wang",
            "NSRRC",
            "Hsinchu",
            "Taiwan",
            "The internet of thing is applied in the accelerator more frequently than before. There are many advantages in data acquisition and control oriented applications",
            "for example",
            "easy to distribute remotely and less cables needed",
            "low noise generated",
            "many commercial interfaces for choosing. The stable wireless communication is also applied in the measurement system. The high reliability and security of wireless communication with server and client structure is introduced. The structure design and implementation of IoT are summarized in this report.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP05 paper received ※ 16 October 2018       paper accepted ※ 30 January 2019        issue date ※ 21 January 2019 reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi5_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi5.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi5_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI5",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "WEPI6",
          "title": "Data Archiving and Visualization of IRFEL",
          "authors": [
            "Y. Song",
            "X. Chen",
            "C. Li",
            "G. Liu",
            "J.G. Wang",
            "K. Xuan",
            "USTC/NSRL",
            "Hefei",
            "Anhui",
            "People’s Republic of China",
            "An Infrared Free Electron Laser Light (IRFEL) is being constructed at National Synchrotron Radiation Laboratory. The EPICS Archiver Appliance provides the functions of historical data acquisition",
            "archiving",
            "migration",
            "retrieval and management in the IRFEL facility. A Single-Page Web Application is developed for the data visualization based on Vue.js framework and Highcharts JavaScirpt library. A unified interface is developed for the visualization to integrate multiple data sources and provide the same retrieval entry of the historical data from EPICS Archiver Appliance",
            "the real-time data from EPICS IOC",
            "the statistical data from database and the alarm information from the Phoebus. This paper will describe the implementation details of data archiving and visualization of IRFEL.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [
            "Funding: Work supported by National Natural Science Foundation of China (No.11375186)"
          ],
          "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP06 paper received ※ 09 October 2018       paper accepted ※ 16 October 2018        issue date ※ 21 January 2019 reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi6_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi6.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi6_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI6",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "WEPI7",
          "title": "Innovative Graphical User Interfaces Development: Give the Power Back to Users",
          "authors": [
            "G. Segura",
            "A. Ledeul",
            "A. Savulescu",
            "B. Styczen",
            "D. Vazquez Rivera",
            "CERN",
            "Meyrin",
            "Switzerland",
            "GUI for supervision",
            "control and data acquisition systems are usually oriented to specialist users. In big organizations like CERN",
            "where different teams play the roles of operators",
            "scientists and instrumentation specialists",
            "providing a unique or static user interface usually results in a situation of dissatisfaction of everyone. On the other hand",
            "providing distinct user interfaces for each type of user increases the development and maintenance effort and makes software evolution heavier. The approach taken for the design and development of GUIs for radiation and environment protection at CERN addressed this issue by integrating user interface changes as an embedded software functionality. Key users were provided with a tool to build",
            "deploy and maintain their own tailor-made user interfaces",
            "in a graphical way and without the necessity of learning any kind of programming or scripting languages. Other benefits observed from this solution include reduction of the resources spent on the support and maintenance and increase of the frequency of GUIs updates",
            "executed without compromising the underlying control system. This paper describe the innovative design that was implemented.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP07 paper received ※ 09 October 2018       paper accepted ※ 17 October 2018        issue date ※ 21 January 2019 reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi7_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi7.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi7_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI7",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "WEPI8",
          "title": "A Universal System Based on WebSocket and JSON for the Employment of LabVIEW External Drivers",
          "authors": [
            "A. Stecchi",
            "C. Bisegni",
            "P. Ciuffetti",
            "A. D’Uffizi",
            "G. Di Pirro",
            "F. Galletti",
            "A. Michelotti",
            "INFN/LNF",
            "Frascati",
            "Italy",
            "One of the heaviest workloads when installing a Control System on a plant is the development of a large number of device drivers. This is even more true in the case of scientific facilities for which you typically deal with many custom devices and legacy code. In these cases",
            "it is useful to consider the Rapid Application Development (RAD) approach that consists in lessen the planning phase and give more emphasis on an adaptive process",
            "so that software prototypes can be successfully used in addition to or in place of design specifications. LabVIEW* is a typical RAD-oriented development tool and is widely used in technical laboratories where many stand-alone programs are developed to manage devices under construction or evaluation. An original system that allows software clients to use external LabVIEW drivers is presented. This system",
            "originally created for the !CHAOS Control System**",
            "is entirely written in LabVIEW and is based on JSON messages -transmitted on a WebSocket communication- driving LabVIEW VIs through dynamic calls. This system is completely decoupled from the client and is therefore suitable for any Control System.",
            "*LabVIEW: http://www.ni.com ** L. Catani et al",
            "Phys. Rev. ST Accel. Beams 15",
            "112804 (2012). Introducing a New Paradigm for Accelerators and Large Experimental Apparatus Control Systems.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP08 paper received ※ 10 October 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi8_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi8.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi8_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI8",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 8,
      "scrape_time": "2025-10-11 02:01:54"
    },
    {
      "session_info": {
        "id": "THKT",
        "name": "THKT - Keynote Talk 2",
        "url": "https://proceedings.jacow.org/pcapac2018/html/thkt.htm"
      },
      "papers": [
        {
          "paper_id": "THKT1",
          "title": "Delivering Machine Learning Engineering in Scientific Research",
          "authors": [
            "LargitData",
            "Taipei",
            "Taiwan",
            "As the use of machine learning to train a predictive model has become more and more popular",
            "knowing how to build a model with a fixed dataset may not be news to most researchers nowadays. With a little programming training",
            "any researcher can now easily create a model with just a few lines of coding with some state of the art programming languages and analysis tool. However",
            "knowing how to build the model is not enough",
            "if you wish your research can reach to a wider audience",
            "it would be important to know the correct approach to deliver the learned model into a production environment. In this keynote speech",
            "I will address how to bring machine learning model into the production environment from the perspective of a data scientist and engineer. I will cover the issues includes data preparation",
            "model versioning",
            "model deployment",
            "continuous integration/delivery",
            "model validation",
            "how to choose evaluation metrics",
            "some challenges when facing big data."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thkt1_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thkt1.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thkt1_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THKT1",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 1,
      "scrape_time": "2025-10-11 02:01:56"
    },
    {
      "session_info": {
        "id": "THCA",
        "name": "THCA - Contributed Oral: Hardware Technologies 1",
        "url": "https://proceedings.jacow.org/pcapac2018/html/thca.htm"
      },
      "papers": [
        {
          "paper_id": "THCA1",
          "title": "Quest for the New Standard PSI IOC Platform",
          "authors": [
            "PSI",
            "Villigen PSI",
            "Switzerland",
            "With its four accelerator facilities the Paul Scherrer Institut (PSI) has already several decades of control system Input Output Computer (IOC) experience. The technology is moving forward fast. The older hardware is becoming obsolete: it is slow",
            "consumes too much power",
            "does not match new computing",
            "networking and bus technologies",
            "and replacements can no longer be purchased as models have been discontinued. All this forces us to opt for a new \"standard\" IOC platform with increasing regularity. What used to be twenty years",
            "became ten",
            "and is now tending towards five years. Here we present past and possible future IOC platforms which we are investigating. Feedback from the conference would be highly appreciated."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thca1_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thca1.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thca1_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCA1",
          "page_number": "119",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THCA2",
          "title": "Development of MicroTCA-based Low-level Radio Frequency Control Systems for cERL and STF",
          "authors": [
            "F. Qiu",
            "T. Matsumoto",
            "S. Michizono",
            "T. Miura",
            "KEK",
            "Ibaraki",
            "Japan",
            "Low-level radio frequency (LLRF) control systems based on µTCA standard have been developed for facilities such as compact energy recovery linac (cERL) and superconducting test facility (STF) at the High Energy Accelerator Research Organization (KEK)",
            "Japan. Three different types of boards were developed according to their different applications. Experimental physics and industrial control system (EPICS) was selected as the data communication system for all of these µTCA boards. The LLRF systems showed good performance during the beam commissioning. This paper presents the current status of the µTCA-based LLRF systems in the cERL and STF."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thca2_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thca2.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thca2_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCA2",
          "page_number": "124",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THCA3",
          "title": "A Feedback/Feedforward System at the TPS and its Component Performance",
          "authors": [
            "C.H. Huang",
            "Y.-S. Cheng",
            "P.C. Chiu",
            "K.T. Hsu",
            "K.H. Hu",
            "C.Y. Wu",
            "NSRRC",
            "Hsinchu",
            "Taiwan",
            "For a low-emittance photon light source like the Taiwan Photon Source (TPS)",
            "beam stability is a very important property for high-quality photon beams. It is",
            "however",
            "hard to completely remove beam disturbing effects. Therefore",
            "a feedback/feedforward system becomes an effective tool to suppress beam motion. In this report",
            "we discuss the performance of such a system implemented at the TPS. The component performance of the feedback system has been tested to understand its bandwidth limitations."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thca3_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thca3.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thca3_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCA3",
          "page_number": "127",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THCA4",
          "title": "Development of a Network-based Timing and Tag Information Distribution System for Synchrotron Radiation Experiments at SPring-8",
          "authors": [
            "JASRI/SPring-8",
            "Hyogo",
            "Japan",
            "Time-resolved measurements in synchrotron radiation experiments require an RF clock of a storage ring accelerator and a fundamental revolution frequency (zero address) signal. For the usage of these signals around the experimental station",
            "long RF cables from the accelerator timing station",
            "divider modules and delay modules must be deployed. These installations need a lot of cost and require a lot of efforts to adjust the timing by experts. To lower these costs and efforts",
            "the revolution frequency",
            "which is ~209 kHz at the SPring-8 storage ring",
            "and tag information distribution system has been studied based on a high precision time synchronization technology over a network. In this study",
            "the White Rabbit* (WR) technology is adopted. The proof of concept system has been built",
            "which consists of a master PC",
            "a slave PC and two WR switches. The master PC detects the zero-address signal and distributes the time stamps with tag information to the slave PC. Then the slave PC generates the ~209 kHz signals synchronized with the target bunch by adding the offset time by software. The measured one-σ jitter of the output signals from the slave PC has been achieved less than 100 ps."
          ],
          "institutions": [],
          "abstract": "* https://www.ohwr.org/projects/white-rabbit",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thca4_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thca4.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thca4_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCA4",
          "page_number": "131",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THCA5",
          "title": "Rethinking PLCs: Industrial Ethernet for Large-Scale Real-Time Distributed Control Applications",
          "authors": [
            "B. Plötzeneder",
            "O. Janda",
            "A. Kru’enko",
            "J. Trdlicka",
            "ELI-BEAMS",
            "Prague",
            "Czech Republic",
            "Institute of Physics of the ASCR",
            "Prague",
            "Czech Republic",
            "Many research facilities rely on PLCs to automate large slow systems like vacuum or HVAC",
            "where price",
            "availability and reliability matter. The dominant architecture consists of local units of controllers/ modules (programmed in IEC61131-3 languages)",
            "which operate mostly autonomously from a SCADA layer. While some vendors provide low-level stacks to encourage growth of their ecosystems",
            "PLC programming remains largely within a closed",
            "proprietary world. In this paper",
            "we introduce a different way of thinking about PLC hardware. Working with the open stacks intended for the design of new EtherCAT (Beckhoff) / Powerlink (B&R) modules",
            "we built an abstract C+± API to control the existing ones. These industrial ethernet busses can be propagated using standard network hardware",
            "so any RT-Linux system can now control any PLC module from anywhere in our facility using high-level languages (C++",
            "LabVIEW). This way",
            "PLC modules are seamlessly integrated into our distributed TANGO-based control system. PC-PLC interfaces are no longer needed; or in the case of traditionally implemented subsystems (machine safety)",
            "trivial."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thca5_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thca5.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thca5_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCA5",
          "page_number": "136",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 5,
      "scrape_time": "2025-10-11 02:02:04"
    },
    {
      "session_info": {
        "id": "THCB",
        "name": "THCB - Contributed Oral: GUI Technologies",
        "url": "https://proceedings.jacow.org/pcapac2018/html/thcb.htm"
      },
      "papers": [
        {
          "paper_id": "THCB1",
          "title": "ACOP. NET : Not Just Another GUI Builder",
          "authors": [
            "J. Szczesny",
            "P. Duval",
            "M. Lomperski",
            "H. Wu",
            "DESY",
            "Hamburg",
            "Germany",
            "Cosylab",
            "Ljubljana",
            "Slovenia",
            "KEK",
            "Ibaraki",
            "Japan",
            "ACOP (Advanced Component Oriented Programming) tools have been useful in control system GUI application development for some time",
            "originally as an ActiveX component offering a transport layer and a multi-faceted chart * and then later as a suite of components in the Java world **. We now present a set of ACOP components for development in .NET. And where the emphasis in the past has been primarily on rapid application development of rich clients",
            "this new palette of components is designed both for fully featured rich-client development in any of the .NET supported languages (C#",
            "C++",
            "VB",
            "F#) as well as for fully configurable clients (with design-time browsing)",
            "where no programming on the part of the developer is necessary",
            "and of course for any combination between these extremes. This is an important point",
            "which will become clear when we contrast application development with ACOP. NET with other control system GUI builders such as Control System Studio and jddd. Although Visual Studio is the GUI builder of choice",
            "we will present other available options",
            "for example on Linux. Examples using transport plugs for TINE and STARS will be given.",
            "* I. Deloose",
            "et al.",
            "\"The Use of ACOP Tools in Writing Control System Software\"",
            "ICALEPCS 1997.  ** J.Bobnar",
            "et al.",
            "\"The ACOP Family of Beans: A Framework Independent Approach\"",
            "ICALEPCS 2007."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb1_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb1.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb1_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB1",
          "page_number": "139",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THCB2",
          "title": "Development of ACOP .NET STARS Transport Layer",
          "authors": [
            "T. Kosuge",
            "H. Ishii",
            "Y. Nagatani",
            "H. Nitani",
            "KEK",
            "Ibaraki",
            "Japan",
            "P. Duval",
            "J. Szczesny",
            "DESY",
            "Hamburg",
            "Germany",
            "STARS is an extremely simple and very flexible control software for small scale control systems with TCP/IP sockets",
            "which is used as the beamline control system and so on at the KEK Photon Factory (KEK-PF). STARS works on various operating system and the STARS client developer can choose his or her favorite programing language. Choosing .NET is very common to develop GUI applications of beamline control at the KEK-PF. ACOP (Advanced Component Oriented Programming) is very useful for GUI development",
            "which is developed by DESY and a .NET version of ACOP was recently developed. ACOP has a transport layer and communicate with various system through this layer. Now",
            "we have started development of STARS transport layer of ACOP .NET and succeeded in adding very primitive functionality. The development of ACOP .NET STARS transport layer is still ongoing."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb2_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb2.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb2_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB2",
          "page_number": "144",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THCB3",
          "title": "Improving Web2cHMI Gesture Recognition Using Machine Learning",
          "authors": [
            "DESY",
            "Hamburg",
            "Germany",
            "Web2cHMI is multi-modal human-machine interface which seamlessly incorporates actions based on various interface modalities in a single API",
            "including finger",
            "hand and head gestures as well as spoken commands. The set of native gestures provided by off-the-shelf 2D- or 3D-interface devices such as the Myo gesture control armband can be enriched or extended by additional custom gestures. This paper discusses a particular method and its implementation in recognizing different finger",
            "hand and head movements using supervised machine learning algorithms including a non-linear regression for feature extraction of the movement and a k-nearest neighbor method for movement classification using memorized training data. The method is capable of distinguishing between fast and slow",
            "short and long",
            "up and down",
            "or right and left linear as well as clockwise and counterclockwise circular movements",
            "which can then be associated with specific user interactions."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb3_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb3.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb3_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB3",
          "page_number": "148",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THCB4",
          "title": "Leveraging Internet of Things Developments for Rapid Prototyping of Synoptic Displays",
          "authors": [
            "L.T. Stant",
            "T.M. Cobb",
            "DLS",
            "Oxfordshire",
            "United Kingdom",
            "Recently the technology industry has been laying foundations for the eponymous Internet of Things (IoT): efficient publish-subscribe protocols; process control schemas for household items; and improved low-power radio communications. Accelerator controls and IoT have several aspects in common - small payloads",
            "low latency",
            "dashboard/synoptic data presentation format are some examples. The IoT now provides several open-source projects which can provide a partial implementation of one or more accelerator controls software features. Because development is typically a lower priority for accelerator controls groups",
            "there is a valid case to try and utilise the free efforts of others for the benefit of accelerator controls. In this paper",
            "the authors present examples of the use of IoT frameworks for synoptic display/GUI development. The work in this paper enables other developers to access this resource and experiment with their own systems."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb4_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb4.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb4_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB4",
          "page_number": "151",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "THCB5",
          "title": "Intelligent Controls and Modeling for Particle Accelerators and Other Research and Industrial Infrastructures",
          "authors": [
            "S. Biedron",
            "S.V. Milton",
            "Element Aero",
            "Chicago",
            "USA",
            "CSU",
            "Fort Collins",
            "Colorado",
            "USA"
          ],
          "institutions": [],
          "abstract": "We give some perspective on the present state of intelligent control for particle accelerators. This is based on our experience over the past 14 years in developing artificial-intelligence-based tools specifically to address modeling and control challenges found in particle accelerator systems. [1] E. Meier et al., NIM A: 632. 1 (2011): 1-6; [2] S. G. Biedron et al., \"Advanced Controls for RF and Directed Energy Systems,\" 18th Annual Directed Energy Symposium, 2016. [3] A. L. Edelen et al., IEEE Trans. on Nuclear Science 63(2), 878-897., [4] A. Edelen et al., in Proc. IPAC’18, Vancouver, Canada, 2018. doi:10.18429/JACoW-",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb5_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb5.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb5_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB5",
          "page_number": "156",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 5,
      "scrape_time": "2025-10-11 02:02:28"
    },
    {
      "session_info": {
        "id": "THPI",
        "name": "THPI - Poster in Pills 2",
        "url": "https://proceedings.jacow.org/pcapac2018/html/thpi.htm"
      },
      "papers": [
        {
          "paper_id": "THPI1",
          "title": "Upgrading the Synchronisation and Trigger Systems on the Vulcan High-Power Nd:glass Laser",
          "authors": [
            "D.A. Pepler",
            "I. O. Musgrave",
            "P.B.M. Oliveira",
            "STFC/RAL",
            "Chilton",
            "Didcot",
            "Oxon",
            "United Kingdom",
            "The Vulcan Neodymium-Glass High-Power Laser Facility at the Central Laser Facility in the UK has been operational for over 40 years providing a world-leading and high-profile service to International researchers in the field of Plasma Physics. Over that time the Facility has had many modifications and enhancements to the buildings",
            "the laser hardware and to the computerised control",
            "synchronisation and timing systems. As the laser systems have developed and the user experiments have continued to become much more complex and demanding",
            "many new operational conditions have been required. The use of four independent laser oscillators with different properties - including temporal",
            "spectral and operating frequencies - have meant that the optical and electrical multiplexing and the timing and synchronisation systems have all had to be adapted and extended to cope with these additional needs. However",
            "these changes have resulted in the build-up of the overall system jitter to ± 250 ps between long (ns) and short (ps) optical pulses and this is a limiting factor for time-critical experiments. This paper will present some of the key changes and improvements that have recently been made.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-THP12 paper received ※ 27 September 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi1_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi1.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi1_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI1",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "THPI2",
          "title": "Current Status of the RAON Machine Protection System Development",
          "authors": [
            "H. Jin",
            "Y. Choi",
            "S. Lee",
            "IBS",
            "Daejeon",
            "Republic of Korea",
            "For the RAON accelerator that transport beams with high energy and power",
            "a machine protection system (MPS) that protects each device from sudden beam loss is necessary. For this reason",
            "we have been preparing for the development of the MPS with the start of the RAON accelerator construction. For effective MPS operation and stable accelerator operation",
            "we divided the MPS into four subsystems: fast protection system",
            "slow interlock system",
            "run permit system",
            "and post-mortem system. Among them",
            "the FPGA-based fast protection system and the PLC-based slow interlock system have been tested by prototypes and are currently working on the mass production. The run permit system and the post-mortem system are also undergoing basic design and software development. In this paper",
            "we will describe the progress of the MPS development through detailed hardware and software development in the RAON accelerator and explain the future plans.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-THP02 paper received ※ 04 October 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi2_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi2.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi2_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI2",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "THPI3",
          "title": "Marvin Update ’ the Robotic Sample Mounting System at the Embl-Hamburg",
          "authors": [
            "U. Ristau",
            "M. Bueno",
            "S. Fiedler",
            "T. Gehrmann",
            "D. Jahn",
            "V. Palnati",
            "EMBL",
            "Hamburg",
            "Germany"
          ],
          "institutions": [
            "In this article we give an overview about the controls of the robotic sample mounting system Marvin in user operation at the DESY Petra III synchrotron Beamlines of the EMBL. Two protein crystallography Beamlines each equipped with the in house build robotic sample mounting system are in user operation. The controls of the sample mounting system ‘Marvin’ and especially new developments to decrease down times as well as system recovery routines will be described in detail."
          ],
          "abstract": "use link to access more material from this paper's primary paper code",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi3_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi3.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi3_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI3",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "THPI4",
          "title": "Real-time and Detailed Provision of J-PARC Accelerator Operation Information from the Accelerator Control LAN to the Office LAN",
          "authors": [
            "J-PARC",
            "KEK & JAEA",
            "Ibaraki-ken",
            "Japan",
            "J-PARC Main Ring (MR) is a high-intensity proton synchrotron whose control system is developed based on EPICS.　It started its beam operation in 2008",
            "and since 2009 has been delivering beam to the T2K neutrino experiment and hadron experiments.　Over the past decade",
            "MR have become more sophisticated and more stable driving is required.　Along with this",
            "demands arose from users and experts of equipment such that acquiring detailed and real-time information on the apparatus from the office LAN.　On the other hand",
            "the accelerator control system is quarantined from the office LAN with firewall for security reasons.　Therefore",
            "despite being intentional or not",
            "manipulating any equipment in the accelerator control LAN shall be prohibited from the office LAN.　This article describes construction and prospects of such an one-way gateway system such that information is relayed via EPICS from accelerator control LAN to the office LAN while minimizing influence in the opposite direction.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-THP04 paper received ※ 14 October 2018       paper accepted ※ 25 April 2019        issue date ※ 21 January 2019 reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi4_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi4.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi4_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI4",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "THPI5",
          "title": "Development and Current Status of KURAMA-II",
          "authors": [
            "Kyoto University",
            "Research Reactor Institute",
            "Osaka",
            "Japan",
            "KURAMA-II",
            "a successor of a carborne gamma-ray survey system named KURAMA (Kyoto University RAdiation MApping system)",
            "has been developed and applied to various activities related to the nuclear accident at TEPCO Fukushima Daiichi Nuclear Power Plant in 2011. KURMA-II has established its position as an effective method for the radiation monitoring method in environment on a long-term basis. The development of KURAMA-II is still on the way to extend its application areas such as the trial to port the system to a single-board computer or the development of cloud services of data management for the users who don’t have capabilities to manage the data processing system. In this paper",
            "the current status of KURAMA-II on its developments and applications along with some results from its applications are introduced."
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi5_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi5.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi5_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI5",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "THPI6",
          "title": "Reliability Improvement for the Insertion Device Control in the TPS",
          "authors": [
            "C.Y. Wu",
            "J. Chen",
            "Y.-S. Cheng",
            "K.T. Hsu",
            "K.H. Hu",
            "C.Y. Liao",
            "NSRRC",
            "Hsinchu",
            "Taiwan",
            "Insertion devices (ID) are essential components in third-generation synchrotron light sources",
            "which can produce highly-brilliant",
            "collimated and quasi-monochromatic radiation over a broad energy range for experiments. Reliable operation of the insertion devices is important to users of beamlines. The most unpredictable fault is due to a soft error in optical absolute encoders due to radiation. There are several solutions to avoid such faults",
            "e.g. by increasing the distance of the encoder from the beam",
            "by a lead shield cover and finally by adopting an auxiliary position sensing devices to help recovery from a fault. Efforts to improve operational reliability of the TPS ID controls will be discussed.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-THP06 paper received ※ 10 October 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi6_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi6.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi6_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI6",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "THPI7",
          "title": "Long-term Stability Observed by Electron BPM and Photon BPM for Taiwan Photon Source",
          "authors": [
            "P.C. Chiu",
            "K.T. Hsu",
            "K.H. Hu",
            "C.H. Huang",
            "NSRRC",
            "Hsinchu",
            "Taiwan",
            "TPS is 3-GeV synchrotron light source which have opened for public users since September 2016 and now offers 400 mA top-up mode operation. The requirements of the long term orbit stability and orbit reproducibility after beam trip have been gradually more and more stringent and become a challenge from users’ request. Furthermore",
            "the thermal effect would be expected to be worsen after 500 mA top-up operation which should deteriorate the orbit drift. The report investigates the long-term orbit stability observed from eBPM and XBPM and also evaluates the possibility of the local XBPM feedback.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-THP07 paper received ※ 09 October 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi7_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi7.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi7_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI7",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "THPI8",
          "title": "Design and Implementation of Stepper Motor Control of the LINAC High Power RF System Based on FPGA",
          "authors": [
            "R. Rujanakraikarn",
            "Ch. Dhammatong",
            "W. Phacheerak",
            "SLRI",
            "Nakhon Ratchasima",
            "Thailand",
            "In this paper",
            "the new motion control system that governs the position of high power attenuators and phase shifters in the linac’s RF system at SLRI is described. The drive system",
            "which was originally driven by a set of AC reversible motors",
            "is replaced by a new set of stepper motors. The hardware selection and installation is presented in detail. The digital control circuits are designed in VHDL and implemented on a commercial Field Programmable Gate Array (FPGA) board. The main software part",
            "implemented in MicroBlaze Microcontroller System (MCS)",
            "is coded in C to control the position of stepper motors relative to the DC voltage reference points of the hardware system. A LabVIEW GUI is designed to interface with the control system to provide reference points and display position values via RS-232 and PLC interfaces. This stepper motor control system can be used to effectively implement the phase and amplitude control system of the linac’s RF signals in the future."
          ],
          "institutions": [],
          "abstract": "use link to access more material from this paper's primary paper code",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi8_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi8.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi8_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI8",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 8,
      "scrape_time": "2025-10-11 02:02:43"
    },
    {
      "session_info": {
        "id": "FRKT",
        "name": "FRKT - Keynote Talk 3",
        "url": "https://proceedings.jacow.org/pcapac2018/html/frkt.htm"
      },
      "papers": [
        {
          "paper_id": "FRKT1",
          "title": "Bootstrapping AI Adoption for Smart Manufacturing",
          "authors": [
            "Inventec",
            "Taipei",
            "Taiwan",
            "Skywatch",
            "Taipei",
            "Taiwan",
            "When it comes to applying AI to smart manufacturing",
            "the first problems that come to mind are usually the automatic inspection of products. The reality is we often need to carefully re-define the problems to yield a satisfactory solution and return on investment. In this talk",
            "we share our experiences working with first-tier electronics manufacturing facilities to apply machine learning techniques to their product design process and production pipeline. We will also talk in more detail about several applications in the domains of circuit defect and product appearance inspections",
            "quality control",
            "and the associated edge AI algorithms and machinery we have created to solve these problems."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frkt1_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frkt1.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frkt1_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRKT1",
          "page_number": "",
          "presentation_available": true,
          "paper_available": false,
          "poster_available": false
        }
      ],
      "paper_count": 1,
      "scrape_time": "2025-10-11 02:02:45"
    },
    {
      "session_info": {
        "id": "FRCA",
        "name": "FRCA - Contributed Oral: Data Acquisitions 1",
        "url": "https://proceedings.jacow.org/pcapac2018/html/frca.htm"
      },
      "papers": [
        {
          "paper_id": "FRCA1",
          "title": "New Collaborative Approach to Scientific Data Management with NOVA",
          "authors": [
            "W. Mexner",
            "E. Bründermann",
            "M. Caselle",
            "S. Funkner",
            "A. Kopmann",
            "G. Niehues",
            "N. Tan Jerome",
            "M. Vogelgesang",
            "KIT",
            "Eggenstein-Leopoldshafen",
            "Germany",
            "Accelerator physics studies at the storage ring KARA at KIT produce terabytes of diagnostics data per day",
            "which is recorded once and then reused on a long-term basis to answer different research questions at KIT. Finally",
            "raw data and intermediate analysis results should be published along with scientific results. Thus storing from the very beginning the data of all analysis steps and its metadata in a central portal would be very beneficial. Similar requirements exist for synchrotron X-rayμtomography at the KIT imaging cluster and there is an interest to share the large data analysis effort. By using a new collaborative approach",
            "the NOVA project aims to create tools",
            "to enable an efficient use of valuable beam time. Forμtomography beamlines the project will build up a comprehensive database of various demonstrator organisms up for the morphological analysis of animals. The NOVA portal is integrated in the local data handling procedures and the datasets automatically appear in the NOVA portal as they are recorded. For both applications",
            "accelerator diagnostics and X-ray tomography",
            "the NOVA portal will offer new collaborative tools to enable synergetic data analysis."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frca1_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frca1.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frca1_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCA1",
          "page_number": "224",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "FRCA2",
          "title": "Development of a Task-Oriented Chatbot Application for Monitoring Taiwan Photon Source Front-End System",
          "authors": [
            "Y.Z. Lin",
            "C.-C. Chang",
            "Y.T. Cheng",
            "J.-Y. Chuang",
            "H.P. Hsueh",
            "C.H. Huang",
            "I.C. Sheng",
            "Y.C. Yang",
            "NSRRC",
            "Hsinchu",
            "Taiwan",
            "In this study",
            "we propose a task-oriented chatbot application as an interactive user interface for monitoring Taiwan Photon Source front-end system. This application can get specific information faster and improve the efficiency of the maintenance engineer’s definition of fault information when a fault occurs. The chatbot uses LINE’s Message API to provide services",
            "and obtains information and status of the front-end system over EPICS protocol",
            "responding to users’ needs",
            "like a virtual assistant. At present",
            "the application can obtain the front-end system information already in operation of Taiwan Photon Source",
            "including x-ray beam position monitor",
            "safety interlock system",
            "front-end valve status",
            "vacuum status…etc. However",
            "in addition to the passive provision of information",
            "this program has a fault warning function",
            "and will actively transmit fault information to relevant personnel when a problem occurs in the safety interlock system."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frca2_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frca2.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frca2_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCA2",
          "page_number": "228",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 2,
      "scrape_time": "2025-10-11 02:02:51"
    },
    {
      "session_info": {
        "id": "FRCB",
        "name": "FRCB - Contributed Oral: Data Acquisitions 2 and Hardware Technologies 2",
        "url": "https://proceedings.jacow.org/pcapac2018/html/frcb.htm"
      },
      "papers": [
        {
          "paper_id": "FRCB1",
          "title": "Ultra Fast Data Acquisition in ELI Beamlines",
          "authors": [
            "Institute of Physics of the ASCR",
            "Prague",
            "Czech Republic",
            "V. Gaman",
            "O. Janda",
            "P. Pivonka",
            "B. Plötzeneder",
            "J. Sys",
            "J. Trdlicka",
            "ELI-BEAMS",
            "Prague",
            "Czech Republic",
            "The ELI Beamlines facility is a Petawatt laser facility in the final construction and commissioning phase in Czech Republic. In fully operation phase",
            "four lasers will be used to control beamlines in six experimental halls. In this paper we describe Ultra fast and distributed data acquisition system as was defined in ELI Beamlines. The data acquisition system is divided into two levels: central and local level. The central level data acquisition system defines a special Tier 0 RAM buffer. This buffer is based on special multi node data acquisition server which shares memory of all its nodes into one continuous space over low latency network technologies (Mellanox Infinband/Intel OmniPath). The main role of the Tier 0 buffer is to acquire first bunch and provide load balancing of incoming data. These data comes from many sources distributed along the experimental technologies. The local data acquisition system is then responsible for connection of local detectors to central data acquisition server through ROCE interface. The connection is done directly when supported or indirectly using local data acquisition computers (for PCIe etc.)."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcb1_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcb1.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcb1_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCB1",
          "page_number": "230",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "FRCB2",
          "title": "Design and Construction of the Data Warehouse Based on Hadoop Ecosystem at HLS-II",
          "authors": [
            "Y. Song",
            "X. Chen",
            "C. Li",
            "G. Liu",
            "J.G. Wang",
            "K. Xuan",
            "USTC/NSRL",
            "Hefei",
            "Anhui",
            "People’s Republic of China",
            "A data warehouse based on Hadoop ecosystem is designed and constructed for Hefei Light Source II (HLS-II). The ETL program based on Spark migrates data to HDFS from RDB Channel Archiver and the EPICS Archiver Appliance continuously and store them in Parquet format. The distributed data analysis engine based on Impala greatly improves the performance of data retrieval and reduces the response time of queries. In this paper",
            "we will describe our efforts and experience to use various open sources software and tools to effectively manage the big data. We will also report the plans on this data warehouse in the future."
          ],
          "institutions": [
            "Funding: Work supported by National Natural Science Foundation of China (No.11375186)"
          ],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcb2_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcb2.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcb2_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCB2",
          "page_number": "233",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "FRCB3",
          "title": "Novel Concept of Off-detector Electronics Based on Machine Learning for High Energy Physics",
          "authors": [
            "W. Wang",
            "B.M. Balzer",
            "M. Brunet",
            "M. Caselle",
            "L. Rota",
            "M. Weber",
            "KIT",
            "Karlsruhe",
            "Germany",
            "Due to increase of complexity of HEP detectors operating in rush radiation environment",
            "detector calibration operations becomes a challenge. Moreover",
            "growing volumes of available data",
            "traditional calibration approach risk being weak. Therefore",
            "new methods that can automatically analyses large complex data and deliver quick accurate results",
            "without human intervention",
            "are necessary in modern detectors. Embedded machine learning algorithms on FPGAs enables new methods for performing high-granularity Data Quality Monitoring (DQM) and real-time detector calibration",
            "ensuring optimal data quality for further offline analysis. Combining FPGA with multiprocessor system-on-chip (MPSoC) opens \"new ideas\" in integration of DQM and slow-control for off-detector electronics. In this context",
            "a novel readout electronics based on ZYNQ Ultrascale+ MPSoC has been designed. To handle the huge data volume",
            "the ZYNQ board is equipped with FireFly optical data links. In this contribution",
            "a novel high-granularity Data Quality Monitoring (DQM) architecture with real-time detector calibration based on embedded machine learning is presented.",
            "※ BibTeX",
            "※ LaTeX",
            "※ Text/Word",
            "※ RIS"
          ],
          "institutions": [],
          "abstract": "reference for this paper using",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcb3_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcb3.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcb3_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCB3",
          "page_number": "",
          "presentation_available": false,
          "paper_available": false,
          "poster_available": false
        },
        {
          "paper_id": "FRCB4",
          "title": "The Application for Fault Diagnosis and Prediction of Power Supply Control Device on BEPCII",
          "authors": [
            "J. Liu",
            "D. Wang",
            "J.C. Wang",
            "X.L. Wang",
            "IHEP",
            "Beijing",
            "People’s Republic of China",
            "With the widely adoption of complex electronic devices and microcircuits in accelerator system",
            "the probability of system failure and functional failure will be enlarged. For example",
            "the fault of the magnet power supply front-end electronics devices may cause accelerator energy instability and even lead to beam loss. Therefore",
            "it is very necessary to diagnose and locate the device fault accurately and rapidly",
            "that will induce the high cost of the accelerator operation. Faults diagnosis and prediction can not only improve the safety and reliability of the equipment",
            "but also effectively reduce the equipment’s cycle costing. We applied the FMECA and testability modeling method for the PSI device",
            "which using in BEPCII power supply control system",
            "and evaluated the remaining life of the PSI under certain temperature and humidity condition based on the reliability model and accelerated life test."
          ],
          "institutions": [],
          "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcb4_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcb4.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcb4_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCB4",
          "page_number": "236",
          "presentation_available": false,
          "paper_available": true,
          "poster_available": false
        }
      ],
      "paper_count": 4,
      "scrape_time": "2025-10-11 02:03:10"
    },
    {
      "session_info": {
        "id": "FRCC",
        "name": "FRCC - Contributed Oral: Hardware Technologies 3",
        "url": "https://proceedings.jacow.org/pcapac2018/html/frcc.htm"
      },
      "papers": [
        {
          "paper_id": "FRCC1",
          "title": "FPGA-based Image Processing System for Electron Beam Welding Facility",
          "authors": [
            "M. M. Sizov",
            "K.A. Blokhina",
            "A.M. Medvedev",
            "A.A. Starostenko",
            "BINP SB RAS",
            "Novosibirsk",
            "Russia",
            "NSU",
            "Novosibirsk",
            "Russia"
          ],
          "institutions": [],
          "abstract": "In this paper image processing system for secondary emission of electrons in electron beam welding facility is described. System runs on Intel Field Programmable Gate Array (FPGA) for digital processing. Time-sensitive algorithms are designed in VHDL and dataflow DSL Caph. Seam finder algorithm and data filters are written in Caph. The system is designed to filter high-frequency noise and estimate seam location for its automatic correction within 2 us. General algorithms for hardware control and data visualization are described with the interface to the FPGA-based part.",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcc1_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcc1.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcc1_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCC1",
          "page_number": "239",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "FRCC2",
          "title": "Continuous Beam Scanning Intensity Control of a Medical Proton Accelerator Using a Simulink Generated FPGA Gain Scheduled Controller",
          "authors": [
            "P. Fernandez Carmona",
            "C. Bula",
            "M. Eichin",
            "G. Klimpki",
            "D. Meer",
            "V. Minnig",
            "S. Psoroulas",
            "D.C. Weber",
            "PSI",
            "Villigen PSI",
            "Switzerland",
            "At the Centre for Proton Therapy at the Paul Scherrer Institut we treat cancer patients using a fixed beam line and two gantries. The latter use a step-and-shoot technique to deliver dose covering the treatment volume with a grid of weighted proton bunches. Dose delivery for tumours moving under respiration (e.g. lung) is however challenging and not routinely performed because of the interplay between target and beam motions. At the Gantry 2 unit",
            "we are implementing a novel continuous beam modulation concept called line scanning",
            "aiming at realizing a faster dose delivery to allow for effective organ motion mitigation techniques such as rescanning and gating. The current should stabilise within 100 us",
            "which is tough due to the non-linearity of the system and latency of the monitors. In this work we implemented a gain scheduled controller and a predictor by modelling the accelerator in Simulink and developing a controller using the frequency domain robust method. We used Mathwork’s HDL Coder functionality to generate VHDL code that was implemented in an FPGA in the gantry control system. Latency",
            "overshoot and dosimetric performance improved considerably compared to a classic PID."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcc2_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcc2.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcc2_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCC2",
          "page_number": "242",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "FRCC3",
          "title": "CERN Supervision, Control and Data Acquisition System for Radiation and Environmental Protection",
          "authors": [
            "A. Ledeul",
            "A. Savulescu",
            "G. Segurapresenter",
            "B. Styczen",
            "D. Vazquez Rivera",
            "CERN",
            "Meyrin",
            "Switzerland",
            "The CERN Health",
            "Safety and Environment Unit is mandated to provide a Radiation and Environment Supervision",
            "Control and Data Acquisition system for all CERN accelerators",
            "experiments as well as the environment. The operation and maintenance of the previous CERN radiation and environment supervisory systems showed some limitations in terms of flexibility and scalability. In order to face the increasing demand for radiation protection and continuously assess both conventional and radiological impacts on the environment",
            "CERN developed and deployed a new supervisory system",
            "called REMUS - Radiation and Environment Monitoring Unified Supervision. REMUS design and development focused on these desired features. REMUS interfaces with 75 device types",
            "providing about 3",
            "000 measurement channels (approximately 600",
            "000 tags) at the time of writing. This paper describes the architecture of the system",
            "as well as the innovative design that was adopted in order to face the challenges of heterogeneous equipment interfacing",
            "diversity of end users and continuous operation."
          ],
          "institutions": [],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcc3_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcc3.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcc3_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCC3",
          "page_number": "248",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": false
        },
        {
          "paper_id": "FRCC4",
          "title": "Maintenance and Optimization of Insertion Devices at NSLS-II Using Motion Controls",
          "authors": [
            "C.A. Guerrero",
            "J. Escallier",
            "R.I. Farnsworth",
            "D.A. Hidas",
            "Y. Tian",
            "BNL",
            "Upton",
            "Long Island",
            "New York",
            "USA",
            "The purpose of this project is to demonstrate the performance improvements on insertion devices by upgrading the motion control software. The insertion devices installed inside the NSLS-II storage ring are currently operating at micron precision with slow speeds",
            "which can limit the scope of preferences for user experimentation. We can manipulate the devices with adaptive tuning algorithms to compensate for varying electromagnetic forces throughout motion scans. By correcting positional feedback with encoder compensation and redefining motion programs",
            "we can safely increase the speed to run the same motion trajectories in less time."
          ],
          "institutions": [
            "Funding: This project is funded by Brookhaven Science Associates. BSA is a partnership between Battelle and The Research Foundation for the State University of New York on behalf of Stony Brook University."
          ],
          "abstract": "",
          "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcc4_talk.pdf",
          "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcc4.pdf",
          "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcc4_poster.pdf",
          "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCC4",
          "page_number": "253",
          "presentation_available": true,
          "paper_available": true,
          "poster_available": true
        }
      ],
      "paper_count": 4,
      "scrape_time": "2025-10-11 02:03:23"
    }
  ],
  "all_papers": [
    {
      "paper_id": "WEKT1",
      "title": "Abstraction or Instantiation: On Building the Internet for Smarter Places",
      "authors": [
        "Skywatch",
        "Taipei",
        "Taiwan",
        "Inventec",
        "Taipei",
        "Taiwan",
        "There are two ends of the spectrum when it comes to Internet-of-Things. On the one end",
        "the focus is on lower level communication technology",
        "platforms",
        "and standards that aim to enable machine-to-machine communications. On the other end",
        "people have been searching for the killer devices that would transform our lives. Clearly",
        "one is the \"Internet\" perspective",
        "while the other is the \"Things\" perspective. In this talk",
        "instead of taking the words \"Internet of Things\" literally",
        "we focus on the combined effects of devices on environments. Specifically",
        "we discuss the conversations between devices",
        "and how these interactions can open new frontiers of digitized spaces in the era of machine learning."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wekt1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wekt1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wekt1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEKT1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI1",
      "title": "EtherCAT Driver and Tools for EPICS and Linux at PSI",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "EtherCAT bus and interface are widely used for external module and device control in accelerator environments at PSI",
        "ranging from modulator and undulator communication and control",
        "over motion control",
        "basic I/O control",
        "all the way to Machine Protection System for the new SwissFEL accelerator. A combined EPICS/Linux driver package has been developed at PSI",
        "to allow for simple and mostly automatic setup of various EtherCAT configurations. The driver is capable of automatic scan of the existing devices and modules",
        "followed by self-configuration and finally autonomous operation of the EtherCAT bus real-time loop. Additionally",
        "the driver package supports the user PLC to manipulate EtherCAT data in real time",
        "implements fast real-time (single cycle) slave-to-slave communication (skipping EPICS layer or PLC completely)",
        "features guaranteed one-shot trigger signals otherwise not supported by EPICS and much more. All the standard EtherCAT functions are supported",
        "including the complete reprogramming of slave configurations and configuration generation for programmable slaves",
        "such as EL6692 and EL6695 network bridges.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP01 paper received ※ 08 October 2018       paper accepted ※ 16 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI1",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI2",
      "title": "BLISS - Experiments Control for ESRF Beamline",
      "authors": [
        "V. Michel",
        "A. Beteva",
        "T.M. Coutinho",
        "M.C. Dominguez",
        "M. Guijarro",
        "C. Guilloud",
        "A. Homs",
        "J.M. Meyer",
        "E. Papillon",
        "M. Perez",
        "S. Petitdemange",
        "ESRF",
        "Grenoble",
        "France",
        "BLISS is the new ESRF control system for running experiments",
        "with full deployment aimed for the end of the EBS upgrade program in 2020. BLISS provides a global approach to run synchrotron experiments",
        "thanks to hardware integration",
        "Python sequences and an advanced scanning engine. As a Python package",
        "BLISS can be easily embedded into any Python application and data management features enable online data analysis. In addition",
        "BLISS ships with tools to enhance scientists user experience and can easily be integrated into TANGO based environments",
        "with generic TANGO servers on top of BLISS controllers. BLISS configuration facility can be used as an alternative TANGO database. Delineating all aspects of the BLISS project from beamline device configuration up to the integrated user interface",
        "this poster will present the technical choices that drove BLISS design and will describe the BLISS software architecture and technology stack in depth."
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi2.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI2",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI3",
      "title": "A General Solution for Complex Vacuum System Controls",
      "authors": [
        "G. Bischof",
        "A. M. Barbour",
        "B. A. Sobhani",
        "A. Walter",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "At the National Synchrotron Light Source II (NSLS-II) there are many different ultra-high vacuum system configurations on the unique beamline end-stations. The proposed controls solution attempts to capture the requirements of all of these configurations with a single standard logic and graphical user interface. Additional design considerations include: resource management for multiple users",
        "providing a high level of abstraction to simplify operation for users",
        "providing a high level of flexibility to do non-standard operations",
        "minimizing shock from pressure differentials when opening valves",
        "supporting a variety of pumps",
        "and maximizing pump lifetime. At NSLS-II it was determined that all vacuum configurations can be captured by the composition of three standard objects: a \"rough vacuum group\"",
        "and \"high vacuum group\"",
        "and a \"smart vacuum manifold\" which implements a blocking queue. These objects can be flexibly linked together to meet the needs of the beamline experiments. This solution is platform independent",
        "but implemented and tested here using Pfeiffer vacuum pumps",
        "Allen Bradley PLC",
        "EPICS",
        "and Control System Studio (CSS).",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP03 paper received ※ 10 October 2018       paper accepted ※ 16 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi3.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI3",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI4",
      "title": "Developing and Validating OPC-UA Based Industrial Controls for Power Supplies at CERN",
      "authors": [
        "M. Ludwig",
        "J.A.R. Arroyo Garcia",
        "M. Bengulescu",
        "B. Farnham",
        "P.G.J. Gonzalez Jimenez",
        "F. Varela",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The industrial control systems of CERN’s experiments are undergoing major renovation since 2017 and well into CERN’s second Long Shutdown (LS2) until the end of 2019. Each detector power-supply control system runs several hundred software instances consisting of many different components in parallel on a large scale",
        "broadly distinguishable as servers and clients. Our accumulated experience during LHC runs proves that some complex control issues are impossible to detect using stand-alone components on a small scale only. Furthermore",
        "new components must be developed well before the electron-ics becomes available",
        "without impact on operations. Moreover",
        "during LS2",
        "the improved and now widely established Open Protocol Communication Unified Ar-chitecture (OPC-UA) replaces OPC-DA as middleware protocol. For these reasons",
        "we developed a simulation environment to emulate the real",
        "and valuable",
        "CAEN power-supply electronics underneath the OPC-UA serv-ers. This distributed simulation is configurable to mimic and exceed the nominal conditions during production and provides a repeatable setup for validation. This paper discusses the functionality and use of this simulation service.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP04 paper received ※ 05 October 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi4.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI4",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI5",
      "title": "Wireless Internet of Thing Application in the TLS",
      "authors": [
        "C.H. Kuo",
        "K.H. Hu",
        "C.-J. Wang",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The internet of thing is applied in the accelerator more frequently than before. There are many advantages in data acquisition and control oriented applications",
        "for example",
        "easy to distribute remotely and less cables needed",
        "low noise generated",
        "many commercial interfaces for choosing. The stable wireless communication is also applied in the measurement system. The high reliability and security of wireless communication with server and client structure is introduced. The structure design and implementation of IoT are summarized in this report.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP05 paper received ※ 16 October 2018       paper accepted ※ 30 January 2019        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi5.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI5",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI6",
      "title": "Data Archiving and Visualization of IRFEL",
      "authors": [
        "Y. Song",
        "X. Chen",
        "C. Li",
        "G. Liu",
        "J.G. Wang",
        "K. Xuan",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "An Infrared Free Electron Laser Light (IRFEL) is being constructed at National Synchrotron Radiation Laboratory. The EPICS Archiver Appliance provides the functions of historical data acquisition",
        "archiving",
        "migration",
        "retrieval and management in the IRFEL facility. A Single-Page Web Application is developed for the data visualization based on Vue.js framework and Highcharts JavaScirpt library. A unified interface is developed for the visualization to integrate multiple data sources and provide the same retrieval entry of the historical data from EPICS Archiver Appliance",
        "the real-time data from EPICS IOC",
        "the statistical data from database and the alarm information from the Phoebus. This paper will describe the implementation details of data archiving and visualization of IRFEL.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Funding: Work supported by National Natural Science Foundation of China (No.11375186)"
      ],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP06 paper received ※ 09 October 2018       paper accepted ※ 16 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi6.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI6",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI7",
      "title": "Innovative Graphical User Interfaces Development: Give the Power Back to Users",
      "authors": [
        "G. Segura",
        "A. Ledeul",
        "A. Savulescu",
        "B. Styczen",
        "D. Vazquez Rivera",
        "CERN",
        "Meyrin",
        "Switzerland",
        "GUI for supervision",
        "control and data acquisition systems are usually oriented to specialist users. In big organizations like CERN",
        "where different teams play the roles of operators",
        "scientists and instrumentation specialists",
        "providing a unique or static user interface usually results in a situation of dissatisfaction of everyone. On the other hand",
        "providing distinct user interfaces for each type of user increases the development and maintenance effort and makes software evolution heavier. The approach taken for the design and development of GUIs for radiation and environment protection at CERN addressed this issue by integrating user interface changes as an embedded software functionality. Key users were provided with a tool to build",
        "deploy and maintain their own tailor-made user interfaces",
        "in a graphical way and without the necessity of learning any kind of programming or scripting languages. Other benefits observed from this solution include reduction of the resources spent on the support and maintenance and increase of the frequency of GUIs updates",
        "executed without compromising the underlying control system. This paper describe the innovative design that was implemented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP07 paper received ※ 09 October 2018       paper accepted ※ 17 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi7_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi7.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi7_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI7",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPI8",
      "title": "A Universal System Based on WebSocket and JSON for the Employment of LabVIEW External Drivers",
      "authors": [
        "A. Stecchi",
        "C. Bisegni",
        "P. Ciuffetti",
        "A. D’Uffizi",
        "G. Di Pirro",
        "F. Galletti",
        "A. Michelotti",
        "INFN/LNF",
        "Frascati",
        "Italy",
        "One of the heaviest workloads when installing a Control System on a plant is the development of a large number of device drivers. This is even more true in the case of scientific facilities for which you typically deal with many custom devices and legacy code. In these cases",
        "it is useful to consider the Rapid Application Development (RAD) approach that consists in lessen the planning phase and give more emphasis on an adaptive process",
        "so that software prototypes can be successfully used in addition to or in place of design specifications. LabVIEW* is a typical RAD-oriented development tool and is widely used in technical laboratories where many stand-alone programs are developed to manage devices under construction or evaluation. An original system that allows software clients to use external LabVIEW drivers is presented. This system",
        "originally created for the !CHAOS Control System**",
        "is entirely written in LabVIEW and is based on JSON messages -transmitted on a WebSocket communication- driving LabVIEW VIs through dynamic calls. This system is completely decoupled from the client and is therefore suitable for any Control System.",
        "*LabVIEW: http://www.ni.com ** L. Catani et al",
        "Phys. Rev. ST Accel. Beams 15",
        "112804 (2012). Introducing a New Paradigm for Accelerators and Large Experimental Apparatus Control Systems.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-WEP08 paper received ※ 10 October 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/wepi8_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/wepi8.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/wepi8_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-WEPI8",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THKT1",
      "title": "Delivering Machine Learning Engineering in Scientific Research",
      "authors": [
        "LargitData",
        "Taipei",
        "Taiwan",
        "As the use of machine learning to train a predictive model has become more and more popular",
        "knowing how to build a model with a fixed dataset may not be news to most researchers nowadays. With a little programming training",
        "any researcher can now easily create a model with just a few lines of coding with some state of the art programming languages and analysis tool. However",
        "knowing how to build the model is not enough",
        "if you wish your research can reach to a wider audience",
        "it would be important to know the correct approach to deliver the learned model into a production environment. In this keynote speech",
        "I will address how to bring machine learning model into the production environment from the perspective of a data scientist and engineer. I will cover the issues includes data preparation",
        "model versioning",
        "model deployment",
        "continuous integration/delivery",
        "model validation",
        "how to choose evaluation metrics",
        "some challenges when facing big data."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thkt1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thkt1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thkt1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THKT1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THCA1",
      "title": "Quest for the New Standard PSI IOC Platform",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "With its four accelerator facilities the Paul Scherrer Institut (PSI) has already several decades of control system Input Output Computer (IOC) experience. The technology is moving forward fast. The older hardware is becoming obsolete: it is slow",
        "consumes too much power",
        "does not match new computing",
        "networking and bus technologies",
        "and replacements can no longer be purchased as models have been discontinued. All this forces us to opt for a new \"standard\" IOC platform with increasing regularity. What used to be twenty years",
        "became ten",
        "and is now tending towards five years. Here we present past and possible future IOC platforms which we are investigating. Feedback from the conference would be highly appreciated."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thca1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thca1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thca1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCA1",
      "page_number": "119",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCA2",
      "title": "Development of MicroTCA-based Low-level Radio Frequency Control Systems for cERL and STF",
      "authors": [
        "F. Qiu",
        "T. Matsumoto",
        "S. Michizono",
        "T. Miura",
        "KEK",
        "Ibaraki",
        "Japan",
        "Low-level radio frequency (LLRF) control systems based on µTCA standard have been developed for facilities such as compact energy recovery linac (cERL) and superconducting test facility (STF) at the High Energy Accelerator Research Organization (KEK)",
        "Japan. Three different types of boards were developed according to their different applications. Experimental physics and industrial control system (EPICS) was selected as the data communication system for all of these µTCA boards. The LLRF systems showed good performance during the beam commissioning. This paper presents the current status of the µTCA-based LLRF systems in the cERL and STF."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thca2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thca2.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thca2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCA2",
      "page_number": "124",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCA3",
      "title": "A Feedback/Feedforward System at the TPS and its Component Performance",
      "authors": [
        "C.H. Huang",
        "Y.-S. Cheng",
        "P.C. Chiu",
        "K.T. Hsu",
        "K.H. Hu",
        "C.Y. Wu",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "For a low-emittance photon light source like the Taiwan Photon Source (TPS)",
        "beam stability is a very important property for high-quality photon beams. It is",
        "however",
        "hard to completely remove beam disturbing effects. Therefore",
        "a feedback/feedforward system becomes an effective tool to suppress beam motion. In this report",
        "we discuss the performance of such a system implemented at the TPS. The component performance of the feedback system has been tested to understand its bandwidth limitations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thca3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thca3.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thca3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCA3",
      "page_number": "127",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCA4",
      "title": "Development of a Network-based Timing and Tag Information Distribution System for Synchrotron Radiation Experiments at SPring-8",
      "authors": [
        "JASRI/SPring-8",
        "Hyogo",
        "Japan",
        "Time-resolved measurements in synchrotron radiation experiments require an RF clock of a storage ring accelerator and a fundamental revolution frequency (zero address) signal. For the usage of these signals around the experimental station",
        "long RF cables from the accelerator timing station",
        "divider modules and delay modules must be deployed. These installations need a lot of cost and require a lot of efforts to adjust the timing by experts. To lower these costs and efforts",
        "the revolution frequency",
        "which is ~209 kHz at the SPring-8 storage ring",
        "and tag information distribution system has been studied based on a high precision time synchronization technology over a network. In this study",
        "the White Rabbit* (WR) technology is adopted. The proof of concept system has been built",
        "which consists of a master PC",
        "a slave PC and two WR switches. The master PC detects the zero-address signal and distributes the time stamps with tag information to the slave PC. Then the slave PC generates the ~209 kHz signals synchronized with the target bunch by adding the offset time by software. The measured one-σ jitter of the output signals from the slave PC has been achieved less than 100 ps."
      ],
      "institutions": [],
      "abstract": "* https://www.ohwr.org/projects/white-rabbit",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thca4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thca4.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thca4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCA4",
      "page_number": "131",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCA5",
      "title": "Rethinking PLCs: Industrial Ethernet for Large-Scale Real-Time Distributed Control Applications",
      "authors": [
        "B. Plötzeneder",
        "O. Janda",
        "A. Kru’enko",
        "J. Trdlicka",
        "ELI-BEAMS",
        "Prague",
        "Czech Republic",
        "Institute of Physics of the ASCR",
        "Prague",
        "Czech Republic",
        "Many research facilities rely on PLCs to automate large slow systems like vacuum or HVAC",
        "where price",
        "availability and reliability matter. The dominant architecture consists of local units of controllers/ modules (programmed in IEC61131-3 languages)",
        "which operate mostly autonomously from a SCADA layer. While some vendors provide low-level stacks to encourage growth of their ecosystems",
        "PLC programming remains largely within a closed",
        "proprietary world. In this paper",
        "we introduce a different way of thinking about PLC hardware. Working with the open stacks intended for the design of new EtherCAT (Beckhoff) / Powerlink (B&R) modules",
        "we built an abstract C+± API to control the existing ones. These industrial ethernet busses can be propagated using standard network hardware",
        "so any RT-Linux system can now control any PLC module from anywhere in our facility using high-level languages (C++",
        "LabVIEW). This way",
        "PLC modules are seamlessly integrated into our distributed TANGO-based control system. PC-PLC interfaces are no longer needed; or in the case of traditionally implemented subsystems (machine safety)",
        "trivial."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thca5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thca5.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thca5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCA5",
      "page_number": "136",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCB1",
      "title": "ACOP. NET : Not Just Another GUI Builder",
      "authors": [
        "J. Szczesny",
        "P. Duval",
        "M. Lomperski",
        "H. Wu",
        "DESY",
        "Hamburg",
        "Germany",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "KEK",
        "Ibaraki",
        "Japan",
        "ACOP (Advanced Component Oriented Programming) tools have been useful in control system GUI application development for some time",
        "originally as an ActiveX component offering a transport layer and a multi-faceted chart * and then later as a suite of components in the Java world **. We now present a set of ACOP components for development in .NET. And where the emphasis in the past has been primarily on rapid application development of rich clients",
        "this new palette of components is designed both for fully featured rich-client development in any of the .NET supported languages (C#",
        "C++",
        "VB",
        "F#) as well as for fully configurable clients (with design-time browsing)",
        "where no programming on the part of the developer is necessary",
        "and of course for any combination between these extremes. This is an important point",
        "which will become clear when we contrast application development with ACOP. NET with other control system GUI builders such as Control System Studio and jddd. Although Visual Studio is the GUI builder of choice",
        "we will present other available options",
        "for example on Linux. Examples using transport plugs for TINE and STARS will be given.",
        "* I. Deloose",
        "et al.",
        "\"The Use of ACOP Tools in Writing Control System Software\"",
        "ICALEPCS 1997.  ** J.Bobnar",
        "et al.",
        "\"The ACOP Family of Beans: A Framework Independent Approach\"",
        "ICALEPCS 2007."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB1",
      "page_number": "139",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCB2",
      "title": "Development of ACOP .NET STARS Transport Layer",
      "authors": [
        "T. Kosuge",
        "H. Ishii",
        "Y. Nagatani",
        "H. Nitani",
        "KEK",
        "Ibaraki",
        "Japan",
        "P. Duval",
        "J. Szczesny",
        "DESY",
        "Hamburg",
        "Germany",
        "STARS is an extremely simple and very flexible control software for small scale control systems with TCP/IP sockets",
        "which is used as the beamline control system and so on at the KEK Photon Factory (KEK-PF). STARS works on various operating system and the STARS client developer can choose his or her favorite programing language. Choosing .NET is very common to develop GUI applications of beamline control at the KEK-PF. ACOP (Advanced Component Oriented Programming) is very useful for GUI development",
        "which is developed by DESY and a .NET version of ACOP was recently developed. ACOP has a transport layer and communicate with various system through this layer. Now",
        "we have started development of STARS transport layer of ACOP .NET and succeeded in adding very primitive functionality. The development of ACOP .NET STARS transport layer is still ongoing."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb2.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB2",
      "page_number": "144",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCB3",
      "title": "Improving Web2cHMI Gesture Recognition Using Machine Learning",
      "authors": [
        "DESY",
        "Hamburg",
        "Germany",
        "Web2cHMI is multi-modal human-machine interface which seamlessly incorporates actions based on various interface modalities in a single API",
        "including finger",
        "hand and head gestures as well as spoken commands. The set of native gestures provided by off-the-shelf 2D- or 3D-interface devices such as the Myo gesture control armband can be enriched or extended by additional custom gestures. This paper discusses a particular method and its implementation in recognizing different finger",
        "hand and head movements using supervised machine learning algorithms including a non-linear regression for feature extraction of the movement and a k-nearest neighbor method for movement classification using memorized training data. The method is capable of distinguishing between fast and slow",
        "short and long",
        "up and down",
        "or right and left linear as well as clockwise and counterclockwise circular movements",
        "which can then be associated with specific user interactions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb3.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB3",
      "page_number": "148",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCB4",
      "title": "Leveraging Internet of Things Developments for Rapid Prototyping of Synoptic Displays",
      "authors": [
        "L.T. Stant",
        "T.M. Cobb",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Recently the technology industry has been laying foundations for the eponymous Internet of Things (IoT): efficient publish-subscribe protocols; process control schemas for household items; and improved low-power radio communications. Accelerator controls and IoT have several aspects in common - small payloads",
        "low latency",
        "dashboard/synoptic data presentation format are some examples. The IoT now provides several open-source projects which can provide a partial implementation of one or more accelerator controls software features. Because development is typically a lower priority for accelerator controls groups",
        "there is a valid case to try and utilise the free efforts of others for the benefit of accelerator controls. In this paper",
        "the authors present examples of the use of IoT frameworks for synoptic display/GUI development. The work in this paper enables other developers to access this resource and experiment with their own systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb4.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB4",
      "page_number": "151",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCB5",
      "title": "Intelligent Controls and Modeling for Particle Accelerators and Other Research and Industrial Infrastructures",
      "authors": [
        "S. Biedron",
        "S.V. Milton",
        "Element Aero",
        "Chicago",
        "USA",
        "CSU",
        "Fort Collins",
        "Colorado",
        "USA"
      ],
      "institutions": [],
      "abstract": "We give some perspective on the present state of intelligent control for particle accelerators. This is based on our experience over the past 14 years in developing artificial-intelligence-based tools specifically to address modeling and control challenges found in particle accelerator systems. [1] E. Meier et al., NIM A: 632. 1 (2011): 1-6; [2] S. G. Biedron et al., \"Advanced Controls for RF and Directed Energy Systems,\" 18th Annual Directed Energy Symposium, 2016. [3] A. L. Edelen et al., IEEE Trans. on Nuclear Science 63(2), 878-897., [4] A. Edelen et al., in Proc. IPAC’18, Vancouver, Canada, 2018. doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thcb5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thcb5.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thcb5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THCB5",
      "page_number": "156",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPI1",
      "title": "Upgrading the Synchronisation and Trigger Systems on the Vulcan High-Power Nd:glass Laser",
      "authors": [
        "D.A. Pepler",
        "I. O. Musgrave",
        "P.B.M. Oliveira",
        "STFC/RAL",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The Vulcan Neodymium-Glass High-Power Laser Facility at the Central Laser Facility in the UK has been operational for over 40 years providing a world-leading and high-profile service to International researchers in the field of Plasma Physics. Over that time the Facility has had many modifications and enhancements to the buildings",
        "the laser hardware and to the computerised control",
        "synchronisation and timing systems. As the laser systems have developed and the user experiments have continued to become much more complex and demanding",
        "many new operational conditions have been required. The use of four independent laser oscillators with different properties - including temporal",
        "spectral and operating frequencies - have meant that the optical and electrical multiplexing and the timing and synchronisation systems have all had to be adapted and extended to cope with these additional needs. However",
        "these changes have resulted in the build-up of the overall system jitter to ± 250 ps between long (ns) and short (ps) optical pulses and this is a limiting factor for time-critical experiments. This paper will present some of the key changes and improvements that have recently been made.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-THP12 paper received ※ 27 September 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI1",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPI2",
      "title": "Current Status of the RAON Machine Protection System Development",
      "authors": [
        "H. Jin",
        "Y. Choi",
        "S. Lee",
        "IBS",
        "Daejeon",
        "Republic of Korea",
        "For the RAON accelerator that transport beams with high energy and power",
        "a machine protection system (MPS) that protects each device from sudden beam loss is necessary. For this reason",
        "we have been preparing for the development of the MPS with the start of the RAON accelerator construction. For effective MPS operation and stable accelerator operation",
        "we divided the MPS into four subsystems: fast protection system",
        "slow interlock system",
        "run permit system",
        "and post-mortem system. Among them",
        "the FPGA-based fast protection system and the PLC-based slow interlock system have been tested by prototypes and are currently working on the mass production. The run permit system and the post-mortem system are also undergoing basic design and software development. In this paper",
        "we will describe the progress of the MPS development through detailed hardware and software development in the RAON accelerator and explain the future plans.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-THP02 paper received ※ 04 October 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi2.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI2",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPI3",
      "title": "Marvin Update ’ the Robotic Sample Mounting System at the Embl-Hamburg",
      "authors": [
        "U. Ristau",
        "M. Bueno",
        "S. Fiedler",
        "T. Gehrmann",
        "D. Jahn",
        "V. Palnati",
        "EMBL",
        "Hamburg",
        "Germany"
      ],
      "institutions": [
        "In this article we give an overview about the controls of the robotic sample mounting system Marvin in user operation at the DESY Petra III synchrotron Beamlines of the EMBL. Two protein crystallography Beamlines each equipped with the in house build robotic sample mounting system are in user operation. The controls of the sample mounting system ‘Marvin’ and especially new developments to decrease down times as well as system recovery routines will be described in detail."
      ],
      "abstract": "use link to access more material from this paper's primary paper code",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi3.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI3",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPI4",
      "title": "Real-time and Detailed Provision of J-PARC Accelerator Operation Information from the Accelerator Control LAN to the Office LAN",
      "authors": [
        "J-PARC",
        "KEK & JAEA",
        "Ibaraki-ken",
        "Japan",
        "J-PARC Main Ring (MR) is a high-intensity proton synchrotron whose control system is developed based on EPICS.　It started its beam operation in 2008",
        "and since 2009 has been delivering beam to the T2K neutrino experiment and hadron experiments.　Over the past decade",
        "MR have become more sophisticated and more stable driving is required.　Along with this",
        "demands arose from users and experts of equipment such that acquiring detailed and real-time information on the apparatus from the office LAN.　On the other hand",
        "the accelerator control system is quarantined from the office LAN with firewall for security reasons.　Therefore",
        "despite being intentional or not",
        "manipulating any equipment in the accelerator control LAN shall be prohibited from the office LAN.　This article describes construction and prospects of such an one-way gateway system such that information is relayed via EPICS from accelerator control LAN to the office LAN while minimizing influence in the opposite direction.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-THP04 paper received ※ 14 October 2018       paper accepted ※ 25 April 2019        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi4.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI4",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPI5",
      "title": "Development and Current Status of KURAMA-II",
      "authors": [
        "Kyoto University",
        "Research Reactor Institute",
        "Osaka",
        "Japan",
        "KURAMA-II",
        "a successor of a carborne gamma-ray survey system named KURAMA (Kyoto University RAdiation MApping system)",
        "has been developed and applied to various activities related to the nuclear accident at TEPCO Fukushima Daiichi Nuclear Power Plant in 2011. KURMA-II has established its position as an effective method for the radiation monitoring method in environment on a long-term basis. The development of KURAMA-II is still on the way to extend its application areas such as the trial to port the system to a single-board computer or the development of cloud services of data management for the users who don’t have capabilities to manage the data processing system. In this paper",
        "the current status of KURAMA-II on its developments and applications along with some results from its applications are introduced."
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi5.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI5",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPI6",
      "title": "Reliability Improvement for the Insertion Device Control in the TPS",
      "authors": [
        "C.Y. Wu",
        "J. Chen",
        "Y.-S. Cheng",
        "K.T. Hsu",
        "K.H. Hu",
        "C.Y. Liao",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Insertion devices (ID) are essential components in third-generation synchrotron light sources",
        "which can produce highly-brilliant",
        "collimated and quasi-monochromatic radiation over a broad energy range for experiments. Reliable operation of the insertion devices is important to users of beamlines. The most unpredictable fault is due to a soft error in optical absolute encoders due to radiation. There are several solutions to avoid such faults",
        "e.g. by increasing the distance of the encoder from the beam",
        "by a lead shield cover and finally by adopting an auxiliary position sensing devices to help recovery from a fault. Efforts to improve operational reliability of the TPS ID controls will be discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-THP06 paper received ※ 10 October 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi6.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI6",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPI7",
      "title": "Long-term Stability Observed by Electron BPM and Photon BPM for Taiwan Photon Source",
      "authors": [
        "P.C. Chiu",
        "K.T. Hsu",
        "K.H. Hu",
        "C.H. Huang",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "TPS is 3-GeV synchrotron light source which have opened for public users since September 2016 and now offers 400 mA top-up mode operation. The requirements of the long term orbit stability and orbit reproducibility after beam trip have been gradually more and more stringent and become a challenge from users’ request. Furthermore",
        "the thermal effect would be expected to be worsen after 500 mA top-up operation which should deteriorate the orbit drift. The report investigates the long-term orbit stability observed from eBPM and XBPM and also evaluates the possibility of the local XBPM feedback.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-THP07 paper received ※ 09 October 2018       paper accepted ※ 15 October 2018        issue date ※ 21 January 2019 reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi7_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi7.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi7_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI7",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPI8",
      "title": "Design and Implementation of Stepper Motor Control of the LINAC High Power RF System Based on FPGA",
      "authors": [
        "R. Rujanakraikarn",
        "Ch. Dhammatong",
        "W. Phacheerak",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "In this paper",
        "the new motion control system that governs the position of high power attenuators and phase shifters in the linac’s RF system at SLRI is described. The drive system",
        "which was originally driven by a set of AC reversible motors",
        "is replaced by a new set of stepper motors. The hardware selection and installation is presented in detail. The digital control circuits are designed in VHDL and implemented on a commercial Field Programmable Gate Array (FPGA) board. The main software part",
        "implemented in MicroBlaze Microcontroller System (MCS)",
        "is coded in C to control the position of stepper motors relative to the DC voltage reference points of the hardware system. A LabVIEW GUI is designed to interface with the control system to provide reference points and display position values via RS-232 and PLC interfaces. This stepper motor control system can be used to effectively implement the phase and amplitude control system of the linac’s RF signals in the future."
      ],
      "institutions": [],
      "abstract": "use link to access more material from this paper's primary paper code",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/thpi8_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/thpi8.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/thpi8_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-THPI8",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FRKT1",
      "title": "Bootstrapping AI Adoption for Smart Manufacturing",
      "authors": [
        "Inventec",
        "Taipei",
        "Taiwan",
        "Skywatch",
        "Taipei",
        "Taiwan",
        "When it comes to applying AI to smart manufacturing",
        "the first problems that come to mind are usually the automatic inspection of products. The reality is we often need to carefully re-define the problems to yield a satisfactory solution and return on investment. In this talk",
        "we share our experiences working with first-tier electronics manufacturing facilities to apply machine learning techniques to their product design process and production pipeline. We will also talk in more detail about several applications in the domains of circuit defect and product appearance inspections",
        "quality control",
        "and the associated edge AI algorithms and machinery we have created to solve these problems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frkt1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frkt1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frkt1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRKT1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FRCA1",
      "title": "New Collaborative Approach to Scientific Data Management with NOVA",
      "authors": [
        "W. Mexner",
        "E. Bründermann",
        "M. Caselle",
        "S. Funkner",
        "A. Kopmann",
        "G. Niehues",
        "N. Tan Jerome",
        "M. Vogelgesang",
        "KIT",
        "Eggenstein-Leopoldshafen",
        "Germany",
        "Accelerator physics studies at the storage ring KARA at KIT produce terabytes of diagnostics data per day",
        "which is recorded once and then reused on a long-term basis to answer different research questions at KIT. Finally",
        "raw data and intermediate analysis results should be published along with scientific results. Thus storing from the very beginning the data of all analysis steps and its metadata in a central portal would be very beneficial. Similar requirements exist for synchrotron X-rayμtomography at the KIT imaging cluster and there is an interest to share the large data analysis effort. By using a new collaborative approach",
        "the NOVA project aims to create tools",
        "to enable an efficient use of valuable beam time. Forμtomography beamlines the project will build up a comprehensive database of various demonstrator organisms up for the morphological analysis of animals. The NOVA portal is integrated in the local data handling procedures and the datasets automatically appear in the NOVA portal as they are recorded. For both applications",
        "accelerator diagnostics and X-ray tomography",
        "the NOVA portal will offer new collaborative tools to enable synergetic data analysis."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frca1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frca1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frca1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCA1",
      "page_number": "224",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCA2",
      "title": "Development of a Task-Oriented Chatbot Application for Monitoring Taiwan Photon Source Front-End System",
      "authors": [
        "Y.Z. Lin",
        "C.-C. Chang",
        "Y.T. Cheng",
        "J.-Y. Chuang",
        "H.P. Hsueh",
        "C.H. Huang",
        "I.C. Sheng",
        "Y.C. Yang",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "In this study",
        "we propose a task-oriented chatbot application as an interactive user interface for monitoring Taiwan Photon Source front-end system. This application can get specific information faster and improve the efficiency of the maintenance engineer’s definition of fault information when a fault occurs. The chatbot uses LINE’s Message API to provide services",
        "and obtains information and status of the front-end system over EPICS protocol",
        "responding to users’ needs",
        "like a virtual assistant. At present",
        "the application can obtain the front-end system information already in operation of Taiwan Photon Source",
        "including x-ray beam position monitor",
        "safety interlock system",
        "front-end valve status",
        "vacuum status…etc. However",
        "in addition to the passive provision of information",
        "this program has a fault warning function",
        "and will actively transmit fault information to relevant personnel when a problem occurs in the safety interlock system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frca2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frca2.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frca2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCA2",
      "page_number": "228",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCB1",
      "title": "Ultra Fast Data Acquisition in ELI Beamlines",
      "authors": [
        "Institute of Physics of the ASCR",
        "Prague",
        "Czech Republic",
        "V. Gaman",
        "O. Janda",
        "P. Pivonka",
        "B. Plötzeneder",
        "J. Sys",
        "J. Trdlicka",
        "ELI-BEAMS",
        "Prague",
        "Czech Republic",
        "The ELI Beamlines facility is a Petawatt laser facility in the final construction and commissioning phase in Czech Republic. In fully operation phase",
        "four lasers will be used to control beamlines in six experimental halls. In this paper we describe Ultra fast and distributed data acquisition system as was defined in ELI Beamlines. The data acquisition system is divided into two levels: central and local level. The central level data acquisition system defines a special Tier 0 RAM buffer. This buffer is based on special multi node data acquisition server which shares memory of all its nodes into one continuous space over low latency network technologies (Mellanox Infinband/Intel OmniPath). The main role of the Tier 0 buffer is to acquire first bunch and provide load balancing of incoming data. These data comes from many sources distributed along the experimental technologies. The local data acquisition system is then responsible for connection of local detectors to central data acquisition server through ROCE interface. The connection is done directly when supported or indirectly using local data acquisition computers (for PCIe etc.)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcb1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCB1",
      "page_number": "230",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCB2",
      "title": "Design and Construction of the Data Warehouse Based on Hadoop Ecosystem at HLS-II",
      "authors": [
        "Y. Song",
        "X. Chen",
        "C. Li",
        "G. Liu",
        "J.G. Wang",
        "K. Xuan",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People’s Republic of China",
        "A data warehouse based on Hadoop ecosystem is designed and constructed for Hefei Light Source II (HLS-II). The ETL program based on Spark migrates data to HDFS from RDB Channel Archiver and the EPICS Archiver Appliance continuously and store them in Parquet format. The distributed data analysis engine based on Impala greatly improves the performance of data retrieval and reduces the response time of queries. In this paper",
        "we will describe our efforts and experience to use various open sources software and tools to effectively manage the big data. We will also report the plans on this data warehouse in the future."
      ],
      "institutions": [
        "Funding: Work supported by National Natural Science Foundation of China (No.11375186)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcb2.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCB2",
      "page_number": "233",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCB3",
      "title": "Novel Concept of Off-detector Electronics Based on Machine Learning for High Energy Physics",
      "authors": [
        "W. Wang",
        "B.M. Balzer",
        "M. Brunet",
        "M. Caselle",
        "L. Rota",
        "M. Weber",
        "KIT",
        "Karlsruhe",
        "Germany",
        "Due to increase of complexity of HEP detectors operating in rush radiation environment",
        "detector calibration operations becomes a challenge. Moreover",
        "growing volumes of available data",
        "traditional calibration approach risk being weak. Therefore",
        "new methods that can automatically analyses large complex data and deliver quick accurate results",
        "without human intervention",
        "are necessary in modern detectors. Embedded machine learning algorithms on FPGAs enables new methods for performing high-granularity Data Quality Monitoring (DQM) and real-time detector calibration",
        "ensuring optimal data quality for further offline analysis. Combining FPGA with multiprocessor system-on-chip (MPSoC) opens \"new ideas\" in integration of DQM and slow-control for off-detector electronics. In this context",
        "a novel readout electronics based on ZYNQ Ultrascale+ MPSoC has been designed. To handle the huge data volume",
        "the ZYNQ board is equipped with FireFly optical data links. In this contribution",
        "a novel high-granularity Data Quality Monitoring (DQM) architecture with real-time detector calibration based on embedded machine learning is presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcb3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcb3.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcb3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCB3",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FRCB4",
      "title": "The Application for Fault Diagnosis and Prediction of Power Supply Control Device on BEPCII",
      "authors": [
        "J. Liu",
        "D. Wang",
        "J.C. Wang",
        "X.L. Wang",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "With the widely adoption of complex electronic devices and microcircuits in accelerator system",
        "the probability of system failure and functional failure will be enlarged. For example",
        "the fault of the magnet power supply front-end electronics devices may cause accelerator energy instability and even lead to beam loss. Therefore",
        "it is very necessary to diagnose and locate the device fault accurately and rapidly",
        "that will induce the high cost of the accelerator operation. Faults diagnosis and prediction can not only improve the safety and reliability of the equipment",
        "but also effectively reduce the equipment’s cycle costing. We applied the FMECA and testability modeling method for the PSI device",
        "which using in BEPCII power supply control system",
        "and evaluated the remaining life of the PSI under certain temperature and humidity condition based on the reliability model and accelerated life test."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-PCaPAC2018-",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcb4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcb4.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcb4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCB4",
      "page_number": "236",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCC1",
      "title": "FPGA-based Image Processing System for Electron Beam Welding Facility",
      "authors": [
        "M. M. Sizov",
        "K.A. Blokhina",
        "A.M. Medvedev",
        "A.A. Starostenko",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "NSU",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "In this paper image processing system for secondary emission of electrons in electron beam welding facility is described. System runs on Intel Field Programmable Gate Array (FPGA) for digital processing. Time-sensitive algorithms are designed in VHDL and dataflow DSL Caph. Seam finder algorithm and data filters are written in Caph. The system is designed to filter high-frequency noise and estimate seam location for its automatic correction within 2 us. General algorithms for hardware control and data visualization are described with the interface to the FPGA-based part.",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcc1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcc1.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcc1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCC1",
      "page_number": "239",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCC2",
      "title": "Continuous Beam Scanning Intensity Control of a Medical Proton Accelerator Using a Simulink Generated FPGA Gain Scheduled Controller",
      "authors": [
        "P. Fernandez Carmona",
        "C. Bula",
        "M. Eichin",
        "G. Klimpki",
        "D. Meer",
        "V. Minnig",
        "S. Psoroulas",
        "D.C. Weber",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "At the Centre for Proton Therapy at the Paul Scherrer Institut we treat cancer patients using a fixed beam line and two gantries. The latter use a step-and-shoot technique to deliver dose covering the treatment volume with a grid of weighted proton bunches. Dose delivery for tumours moving under respiration (e.g. lung) is however challenging and not routinely performed because of the interplay between target and beam motions. At the Gantry 2 unit",
        "we are implementing a novel continuous beam modulation concept called line scanning",
        "aiming at realizing a faster dose delivery to allow for effective organ motion mitigation techniques such as rescanning and gating. The current should stabilise within 100 us",
        "which is tough due to the non-linearity of the system and latency of the monitors. In this work we implemented a gain scheduled controller and a predictor by modelling the accelerator in Simulink and developing a controller using the frequency domain robust method. We used Mathwork’s HDL Coder functionality to generate VHDL code that was implemented in an FPGA in the gantry control system. Latency",
        "overshoot and dosimetric performance improved considerably compared to a classic PID."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcc2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcc2.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcc2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCC2",
      "page_number": "242",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCC3",
      "title": "CERN Supervision, Control and Data Acquisition System for Radiation and Environmental Protection",
      "authors": [
        "A. Ledeul",
        "A. Savulescu",
        "G. Segurapresenter",
        "B. Styczen",
        "D. Vazquez Rivera",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The CERN Health",
        "Safety and Environment Unit is mandated to provide a Radiation and Environment Supervision",
        "Control and Data Acquisition system for all CERN accelerators",
        "experiments as well as the environment. The operation and maintenance of the previous CERN radiation and environment supervisory systems showed some limitations in terms of flexibility and scalability. In order to face the increasing demand for radiation protection and continuously assess both conventional and radiological impacts on the environment",
        "CERN developed and deployed a new supervisory system",
        "called REMUS - Radiation and Environment Monitoring Unified Supervision. REMUS design and development focused on these desired features. REMUS interfaces with 75 device types",
        "providing about 3",
        "000 measurement channels (approximately 600",
        "000 tags) at the time of writing. This paper describes the architecture of the system",
        "as well as the innovative design that was adopted in order to face the challenges of heterogeneous equipment interfacing",
        "diversity of end users and continuous operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcc3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcc3.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcc3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCC3",
      "page_number": "248",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRCC4",
      "title": "Maintenance and Optimization of Insertion Devices at NSLS-II Using Motion Controls",
      "authors": [
        "C.A. Guerrero",
        "J. Escallier",
        "R.I. Farnsworth",
        "D.A. Hidas",
        "Y. Tian",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The purpose of this project is to demonstrate the performance improvements on insertion devices by upgrading the motion control software. The insertion devices installed inside the NSLS-II storage ring are currently operating at micron precision with slow speeds",
        "which can limit the scope of preferences for user experimentation. We can manipulate the devices with adaptive tuning algorithms to compensate for varying electromagnetic forces throughout motion scans. By correcting positional feedback with encoder compensation and redefining motion programs",
        "we can safely increase the speed to run the same motion trajectories in less time."
      ],
      "institutions": [
        "Funding: This project is funded by Brookhaven Science Associates. BSA is a partnership between Battelle and The Research Foundation for the State University of New York on behalf of Stony Brook University."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2018/talks/frcc4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2018/papers/frcc4.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2018/posters/frcc4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2018-FRCC4",
      "page_number": "253",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "stats": {
    "total_sessions": 10,
    "total_papers": 39,
    "scrape_time": "2025-10-11 02:03:46"
  }
}