{
  "session_info": {
    "id": "THPOMS",
    "name": "THPOMS - Poster Session - Matsaman",
    "url": "https://proceedings.jacow.org/ipac2022/html/thpoms.htm"
  },
  "papers": [
    {
      "paper_id": "THPOMS001",
      "title": "TURBO: A Novel Beam Delivery System Enabling Rapid Depth Scanning for Charged Particle Therapy",
      "authors": [
        "J.S.L. Yap",
        "S.L. Sheehy",
        "The University of Melbourne",
        "Melbourne",
        "Victoria",
        "Australia",
        "R.B. Appleby",
        "H.X.Q. Norman",
        "A.F. Steinberg",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Charged particle therapy (CPT) is a well-established modality of cancer treatment and is increasing in worldwide presence due to improved accelerator technology and modern techniques. The beam delivery system (BDS) determines the overall timing and beam shaping capabilities",
        "but is restricted by the energy variation speed: energy layer switching time (ELST). Existing treatment beamlines have a ±1% momentum acceptance range",
        "needing time to change the magnetic fields as the beam is delivered in layers at various depths across the tumour volume. Minimising the ELST can enable the delivery of faster",
        "more effective and advanced treatments but requires an improved BDS. A possibility for this could be achieved with a design using Fixed Field Alternating Gradient (FFA) optics",
        "enabling a large energy acceptance to rapidly transport beams of varying energies. A scaled-down",
        "novel system - Technology for Ultra Rapid Beam Operation (TURBO) - is being developed at the University of Melbourne",
        "to explore the potential of rapid depth scanning. Initial simulation studies",
        "beam and field measurements",
        "project plans and clinical considerations are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms001.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS002",
      "title": "Gantry Beamline and Rotator Commissioning at the Medaustron Ion Therapy Center",
      "authors": [
        "M.T.F. Pivi",
        "L. Adler",
        "G. Guidoboni",
        "G. Kowarik",
        "C. Kurfürst",
        "C. Maderböck",
        "D.A. Prokopovich",
        "I. Strašík",
        "EBG MedAustron",
        "Wr. Neustadt",
        "Austria",
        "GKMT Consulting",
        "Consulting and Project Management",
        "Vienna",
        "Austria",
        "STU",
        "Bratislava",
        "Slovak Republic",
        "CNAO Foundation",
        "Pavia",
        "Italy",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The MedAustron Particle Therapy Accelerator located in Austria",
        "delivers proton beams in the energy range 60-250 MeV/n and carbon ions 120-400 MeV/n for medical treatment in two irradiation rooms",
        "clinically used for tumor therapy. Proton beams up to 800 MeV/n are also provided to a room dedicated to scientific research. Over the last two years",
        "in parallel to clinical operations",
        "we have completed the installation and commissioning of the gantry beam line in a dedicated room",
        "ready for the first patient treatment in early 2022. In this manuscript",
        "we provide an overview of the MedAustron gantry beam commissioning including the world-wide first ’rotator’ system",
        "a rotating beamline located upstream of the gantry and used to match the slowly extracted non-symmetric beams into the coordinate system of the gantry. Using the rotator",
        "all beam parameters at the location of the patient become independent of the gantry rotation angle. Furthermore",
        "both the gantry and the high energy transfer line optics had to be redesigned and adapted to the rotator-mode of operation. A review of the beam commissioning including technical solutions",
        "main results and reference measurements is presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS003",
      "title": "Upgrade of a Proton Therapy Eye Treatment Nozzle Using a Cylindrical Beam Stopping Device for Enhanced Dose Rate Performances",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms003.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS004",
      "title": "Achromatic Gantry Design Using Fixed-Field Spiral Combined-Function Magnets",
      "authors": [
        "R. Tesse",
        "E. Gnacadja",
        "C. Hernalsteens",
        "N. Pauly",
        "E. Ramoisiaux",
        "M. Vanweldepresenter",
        "ULB",
        "Bruxelles",
        "Belgium",
        "CERN",
        "Meyrin",
        "Switzerland",
        "Arc-therapy and flash therapy are promising proton therapy treatment modalities as they enable further sparing of the healthy tissues surrounding the tumor site. They impose strong constraints on the beam delivery system and rotating gantry structure",
        "in particular in providing high dose rate and fast energy scanning. Fixed-field achromatic transport lattices potentially satisfy both constraints in allowing instant energy modulation and sufficient transmission efficiency while providing a compact footprint. The presented design study uses fixed-field magnets with spiral edges respecting the FFA scaling law. The cell structure and the layout are studied in simulation and integrated in a compact gantry. Results and further optimizations are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms004.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS005",
      "title": "Lab-Industry Collaboration: Industrialisation of A Novel Non-Interceptive Turn-Key Diagnostic System for Medical Applications",
      "authors": [
        "S. Srinivasan",
        "H. Bayle",
        "E.T. Touzain",
        "BERGOZ Instrumentation",
        "Saint Genis Pouilly",
        "France",
        "D. Bisiach",
        "M. Cargnelutti",
        "K. Roskar",
        "I-Tech",
        "Solkan",
        "Slovenia",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A novel non-interceptive beam current monitor prototype was successfully developed to measure the ultra-low beam currents (0.1-10 nA) with a 1 Hz measurement bandwidth at the Paul Scherrer Institute’s (PSI’s) proton radiation therapy facility",
        "PROSCAN. The monitor resonance frequency is tuned to a harmonic of the beam pulse repetition rate",
        "enabling a larger signal-to-noise ratio compared to those of broadband systems. Since the tuned frequency certainly differs for other facilities",
        "such a system requires customisation. To enhance the application of the monitor to a turn-key system",
        "a fast digitiser solution allowing (1 kHz data rate) streaming of measurements to various Control Systems is of importance as well. In this paper",
        "we report on the industrial challenges associated",
        "such as quality",
        "reliability",
        "repeatability and customisability",
        "online monitoring",
        "turn-key system",
        "etc. in manufacturing a working novel prototype from a research environment. A fruitful collaboration between PSI",
        "Bergoz Instrumentation",
        "and Instrumentation Technologies is foreseen to make it happen",
        "from a first-of-a-kind industrialised product to be tested in the lab",
        "to a product line in a catalogue."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms005.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS006",
      "title": "A Carbon Minibeam Irradiation Facility Concept",
      "authors": [
        "M. Mayerhofer",
        "G. Dollinger",
        "M.A. Sammer",
        "Universität der Bundeswehr Muenchen",
        "Neubiberg",
        "Germany",
        "CERN",
        "Meyrin",
        "Switzerland",
        "In minibeam therapy",
        "the sparing of deep-seated normal tissue is limited by transverse beam spread caused by small-angle scattering. Contrary to proton minibeams",
        "helium or carbon minibeams experience less deflection",
        "which potentially reduces side effects. To verify this potential",
        "an irradiation facility for preclinical and clinical studies is needed. This manuscript presents a concept for a carbon minibeam irradiation facility based on a LINAC design for conventional carbon therapy. A quadrupole triplet focuses the LINAC beam to submillimeter minibeams. A scanning and a dosimetry unit are provided to move the minibeam over the target and monitor the applied dose. The beamline was optimized by TRAVEL simulations. The interaction between beam and these components and the resulting beam parameters at the focal plane is evaluated by TOPAS simulations. A transverse beamwidth of < 100 µm (σ) and a peak-to-valley (energy) dose ratio of > 1000 results for carbon energies of 100 MeV/u and 430 MeV/u (about 3 cm and 30 cm range in water) whereby the average beam current is about 30 nA. Therefore",
        "the presented irradiation facility exceeds the requirements for hadron minibeam therapy."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms006.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS007",
      "title": "Beam Diagnostics for FLASH RT in the Varian ProBeam System",
      "authors": [
        "M. Schedler",
        "S. Busold",
        "VMS-PT",
        "Troisdorf",
        "Germany",
        "Siemens Med",
        "Erlangen",
        "Germany",
        "FLASH RT is a novel ultra-high dose rate radiation therapy technique with the potential of sparing radiation induced damages to healthy tissue while keeping tumor control unchanged. Recent studies indicate that this so-called FLASH effect occurs when applying high doses of several Grays in a fraction of a second only",
        "and thus significantly faster than with conventionally available radiation therapy systems today. Varian’s ProBeam system has been enabled to deliver ultra-high beam currents for FLASH treatments at 250 MeV beam energy. The first clinical trial is currently conducted at Cincinnati Children’s Hospital Medical Center and all involved human patients have been successfully irradiated at FLASH dose rates",
        "operating the system at cw cyclotron beam currents of up to 400 nA. With these modifications",
        "treatment times could be reduced down to less than a second. First automated switching between conventional and FLASH operation modes has been demonstrated in non-clinical environment",
        "including switching of the dose monitor system characteristics and all involved beam diagnostics. Furthermore",
        "for an improved online beam current control system with full control over dose rate in addition to dose Varian has demonstrated first promising results that may improve future applications."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms007.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS008",
      "title": "Physics Design of Electron Flash Radiation Therapy Bemaline at PITZ",
      "authors": [
        "X.-K. Li",
        "Z. Aboulbanine",
        "Z. Amirkhanyan",
        "M. Groß",
        "M. Krasilnikov",
        "A. Lueangaramwong",
        "R. Niemczykpresenter",
        "A. Oppelt",
        "S. Philipp",
        "H.J. Qian",
        "F. Stephan",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "G. Loisch",
        "F. Obier",
        "M. Schmitz",
        "DESY",
        "Hamburg",
        "Germany",
        "The Photo Injector Test facility at DESY in Zeuthen (PITZ) is preparing an R&D platform for electron FLASH radiotherapy",
        "very high energy electron (VHEE) radiotherapy and radiation biology based on its unique beam parameters: ps scale bunches with up to 5 nC bunch charge at MHz bunch repetition rate in bunch trains of up to 1 ms in length repeating at 10 Hz. This platform is called FLASHlab@PITZ. The PITZ beam is routinely accelerated to 22 MeV",
        "with a possible upgrade to 250 MeV for VHEE radiotherapy in the future. The 22 MeV beam will be used for dosimetry experiments and studying biological effects in thin samples in the next years. A new beamline to extract and match the beam to the experimental station is under physics design. The main features include: an achromatic dogleg to extract the beam from the PITZ beamline; a sweeper to scan the beam across the sample within 1 ms for tumor painting studies; and an imaging system to keep the beam size small at the sample after scattering in the exit window while maintaining the scan range of the sweeper. In this paper",
        "the beam dynamics with bunch charges from 10 pC to 5 nC in and the preparation of the new beamline will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms008.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS010",
      "title": "Heating and Beam Impact of High Intensity Exit Windows for FLASHlab@PITZ",
      "authors": [
        "CANDLE SRI",
        "Yerevan",
        "Armenia",
        "Z. Aboulbanine",
        "M. Groß",
        "M. Krasilnikov",
        "T. Kuhl",
        "X.-K. Li",
        "R. Niemczykpresenter",
        "A. Oppelt",
        "S. Philipp",
        "H.J. Qian",
        "F. Stephan",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "DESY",
        "Hamburg",
        "Germany",
        "The high-brightness electron beam at the Photo Injector Test facility at DESY in Zeuthen (PITZ) is being prepared for use in dosimetry experiments and for the study of biological effects in thin samples. This is part of the preparations for FLASHlab@PITZ which is going to be an R&D platform for FLASH and VHEE radiation therapy and radiation biology. These studies require precise information on the electron beam parameters downstream of the exit window",
        "such as the scattering angle and the energy spectrum of the particles as well as the thermal load on the exit window. A Titanium window is compared with a DESY Graphite window design. Heat deposition in the window by a single 22MeV / 1nC electron bunch of various size",
        "its scattering and energy spectrum due to passage through the window are calculated by means of the Monte Carlo program FLUKA. Time resolved temperature profiles",
        "as generated by the passage of 1ms long electron pulse trains with up to 4500 single pulses",
        "each of them between 0.1 and 60ps long",
        "are calculated with a self-written FEM code."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS011",
      "title": "Beam Optics Studies for a Novel Gantry for Hadrontherapy",
      "authors": [
        "E. Felcini",
        "G. Frisella",
        "A. Mereghetti",
        "M.G. Pullia",
        "S. Savazzi",
        "CNAO Foundation",
        "Pavia",
        "Italy",
        "SEEIIST",
        "Geneva",
        "Switzerland",
        "EBG MedAustron",
        "Wr. Neustadt",
        "Austria",
        "The design of smaller and less costly gantries for carbon ion particle therapy represents a major challenge to the diffusion of this treatment. Here we present the work done on the linear beam optics of possible gantry layouts",
        "differing for geometry",
        "momentum acceptance",
        "and magnet technology",
        "which share the use of combined function superconducting magnets with a bending field of 4T. We performed parallel-to-point and point-to-point optics matching at different magnification factors to provide two different beam sizes at the isocenter. Moreover",
        "we considered the orbit distortion generated by magnet errors and we introduced beam position monitors and correctors. The study",
        "together with considerations on the criteria for comparison",
        "is the basis for the design of a novel and compact gantry for hadrontherapy."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms011.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS012",
      "title": "Explorative Studies of an Innovative Superconducting Gantry",
      "authors": [
        "M.G. Pullia",
        "M. Donetti",
        "E. Felcini",
        "G. Frisella",
        "A. Mereghetti",
        "A. Mirandola",
        "A. Pella",
        "S. Savazzi",
        "CNAO Foundation",
        "Pavia",
        "Italy",
        "SEEIIST",
        "Geneva",
        "Switzerland",
        "L. Dassa",
        "M. Karppinen",
        "D. Perini",
        "D. Tommasini",
        "M. Vretenar",
        "CERN",
        "Meyrin",
        "Switzerland",
        "E. De Matteis",
        "L. Rossi",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "C. Kurfürst",
        "M.T.F. Pivipresenter",
        "M. Stock",
        "EBG MedAustron",
        "Wr. Neustadt",
        "Austria",
        "S. Mariotto",
        "M. Prioli",
        "INFN-Milano",
        "Milano",
        "Italy",
        "L. Piacentini",
        "A. Ratkus",
        "T. Torims",
        "J. Vilcans",
        "Riga Technical University",
        "Riga",
        "Latvia",
        "L. Sabbatini",
        "A. Vannozzi",
        "LNF-INFN",
        "Frascati",
        "Italy",
        "Università di Brescia",
        "Brescia",
        "Italy",
        "The Heavy Ion Therapy Research Integration plus (HITRIplus) is a European project that aims to integrate and propel research and technologies related to cancer treatment with heavy ions beams. Among the ambitious goals of the project",
        "a specific work package includes the design of a gantry for carbon ions",
        "based on superconducting magnets. The first milestone to achieve is the choice of the fundamental gantry parameters",
        "namely the beam optics layout",
        "the superconducting magnet technology",
        "and the main user requirements. Starting from a reference 3T design",
        "the collaboration widely explored dozens of possible gantry configurations at 4T",
        "aiming to find the best compromise in terms of footprint",
        "capital cost",
        "and required R&D. We present here a summary of these configurations",
        "underlying the initial correlation between the beam optics",
        "the mechanics",
        "and the main superconducting dipoles design: the bending field (up to 4 T)",
        "combined function features (integrated quadrupole)",
        "magnet aperture (up to 90 mm)",
        "and angular length (30°-45°). The resulting main parameters are then listed",
        "compared",
        "and used to drive the choice of the best gantry layout to be developed in HITRIplus."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms012.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS013",
      "title": "Electron Gun System Design for FLASH Radiotherapy",
      "authors": [
        "H.-S. Lee",
        "J.H. Jang",
        "K.Y. Jang",
        "J.C. Koo",
        "H.S. Shin",
        "D.H. Yu",
        "VITZRONEXTECH",
        "Ansan-si",
        "Gyeonggi-do",
        "Republic of Korea",
        "D.H. An",
        "S.H. Choi",
        "K.U. Kang",
        "G.B. Kim",
        "J.H. Kim",
        "KIRAMS",
        "Seoul",
        "Republic of Korea",
        "PAL",
        "Pohang",
        "Republic of Korea",
        "An electron gun is a device that emits electron beams used in an electron accelerator",
        "an electron beam welder",
        "an x-ray generator",
        "etc. This device can be broadly divided into three components: a cathode",
        "a grid",
        "and an anode. A medical electron gun",
        "which is a sub-system of an electron accelerator for FLASH radiotherapy",
        "requires a high current. The electron gun was designed to obtain a peak current up to 15A using EIMAC Y824 cathode. We would like to introduce the structure of the electron gun and the required power supply system. In this paper",
        "we will describe the optimization process of the electron gun structure design",
        "the Marx-type power supply providing 200 kV pulse voltage",
        "and the grid pulse power supply ranging from 1ns to 1.5 ’s.",
        "Electron gun design",
        "Accelerator",
        "Radiotherapy",
        "High Current"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms013.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS015",
      "title": "New Design of Cyclotron for Proton Therapy",
      "authors": [
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "An innovative approach to a design of cyclotron allows to produce cheaper and more power efficient cyclotrons for medical and industrial application. A design of 230 MeV proton cyclotron for proton therapy",
        "using this approach is presented. The cyclotron is one of the line of cyclotrons from 15 to 230 MeV",
        "that uses same magnet field level and RF frequency and utilises many identical solutions within the lineup to make it cheaper to produce and run."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms015.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS016",
      "title": "A New Design of PET Cyclotron",
      "authors": [
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "An innovative approach to a design of cyclotron allows to produce cheaper and more power efficient cyclotrons for medical and industrial application. 15 MeV cyclotron for PET (and other) isotopes production are widely used and in very high demand. In this paper a design of a very compact and cheap to build and to run cyclotron is presented. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms016.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS017",
      "title": "MSC230 Superconducting Cyclotron for Proton Therapy",
      "authors": [
        "O. Karamyshev",
        "K. Bunyatov",
        "S. Gurskiy",
        "G.G. Hodshibagijan",
        "G.A. Karamysheva",
        "D. Nikiforov",
        "M.S. Novikov",
        "D. Popov",
        "V.M. Romanov",
        "G. Shirkov",
        "S.G. Shirkov",
        "A.A. Sinitsa",
        "G.V. Trubnikov",
        "S. Yakovenko",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "V.A. Gerasimov",
        "I.D. Lyapin",
        "V. Malinin",
        "JINR/DLNP",
        "Dubna",
        "Moscow region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Superconducting cyclotron MSC230 is dedicated for acceleration the proton beam to 230 MeV for medico-biological research. MSC230 is an isochronous four-sector compact cyclotron with a magnetic field in the center of 1.7 T. Acceleration is performed at the fourth harmonic mode of the accelerating radio-frequency (RF) system consisting of four cavities located in the cyclotron valleys. The accelerator will use an internal Penning type source with a hot cathode. Extraction is carried out by an electrostatic deflector located in the gap between sectors and two passive magnetic channels. The current status of the project is discussed. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms017.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS018",
      "title": "Study of Coil Configuration and Local Optics Effects for the GaToroid Ion Gantry Design",
      "authors": [
        "E. Oponowicz",
        "L. Bottura",
        "Y. Dutheilpresenter",
        "A. Gerbershagen",
        "A. Haziot",
        "CERN",
        "Meyrin",
        "Switzerland",
        "GaToroid",
        "a novel configuration for hadron therapy gantry",
        "is based on superconducting coils that gen- erate a toroidal magnetic field to deliver the beam onto the patient. Designing the complex GaToroid coils requires careful consideration of the local beam optical effects. We present a Python-based tool for charged particle transport in complex electromagnetic fields. The code implements fast tracking in arbitrary three-dimensional field maps",
        "and it is not limited to specific or regular reference trajectories",
        "as is generally the case in accelerator physics. The tool was used to characterise the beam behaviour inside the GaToroid system. It automatically determines the reference trajectories in the symmetry plane and analyses three-dimensional beam dynamics around these trajectories. Beam optical parameters in the field region were compared for various magnetic configurations of GaToroid. This paper introduces the new tracker and shows the benchmarking results. Furthermore",
        "first- order beam optics studies for different arrangements demonstrate the main code features and serve for the design optimisation."
      ],
      "institutions": [
        "Funding: Project co-funded by the CERN Budget for Knowledge Transfer to Medical Applications."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms018.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS019",
      "title": "Slow Extraction Modelling for NIMMS Hadron Therapy Synchrotrons",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms019.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS020",
      "title": "Beam Optics Study for a Potential VHEE Beam Delivery System",
      "authors": [
        "C.S. Robertson",
        "P. Burrows",
        "JAI",
        "Oxford",
        "United Kingdom",
        "M. Dosanjhpresenter",
        "A. Gerbershagen",
        "A. Latina",
        "CERN",
        "Meyrin",
        "Switzerland",
        "VHEE (Very High Energy Electron) therapy can be superior to conventional radiotherapy for the treatment of deep seated tumours",
        "whilst not necessarily requiring the space and cost of proton or heavy ion facilities. Developments in high gradient RF technology have allowed electrons to be accelerated to VHEE energies in a compact space",
        "meaning that treatment could be possible with a shorter linac. A crucial component of VHEE treatment is the transfer of the beam from accelerator to patient. This is required to magnify the beam to cover the transverse extent of the tumour",
        "whilst ensuring a uniform beam distribution. Two principle methodologies for the design of a compact transfer line are presented. The first of these is based upon a quadrupole lattice and optical magnification of beam size. A minimisation algorithm is used to enforce certain criteria on the beam distribution at the patient",
        "defining the lattice through an automated routine. Separately",
        "a dual scattering-foil based system is also presented",
        "which uses similar algorithms for the optimisation of the foil geometry in order to achieve the desired beam shape at the patient location."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms020.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS021",
      "title": "A Compact Synchrotron for Advanced Cancer Therapy with Helium and Proton Beams",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms021.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS022",
      "title": "Production of Radioisotopes for Cancer Imaging and Treatment with Compact Linear Accelerators",
      "authors": [
        "M. Vretenar",
        "A. Mamaras",
        "CERN",
        "Meyrin",
        "Switzerland",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "GSI",
        "Darmstadt",
        "Germany",
        "Accelerator-produced radioisotopes are widely used in modern medicine",
        "for imaging",
        "for cancer therapy",
        "and for combinations of therapy and diagnostics. Clinical trials are well advanced for several radioisotope-based treatments that might open the way to a strong request of specific accelerator systems dedicated to radioisotope production. While cyclotrons are the standard tool in this domain",
        "we explore here alternative options using linear accelerators. Compared to cyclotrons",
        "linacs have the advantage of modularity",
        "compactness",
        "and reduced beam loss with lower shielding requirements. Although in general more expensive than cyclotrons",
        "linacs are competitive in cost for production of low-energy proton beams",
        "or of intense beams of heavier particles. After a review of radioisotopes of potential interest",
        "in particular those produced with low-energy protons or helium",
        "this paper presents two linac-based isotope production systems. The first is a compact RFQ-based system for PET isotopes",
        "and the second is an alpha-particle linac for production of alpha-emitters. The accelerator systems are described",
        "together with calculations of production yields for different targets."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms022.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS023",
      "title": "Design of the 590 MeV Proton Beamline for the Proposed TATTOOS Isotope Production Target at PSI",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms023.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS024",
      "title": "A Novel Intensity Compensation Method to Achieve Energy Independent Beam Intensity at the Patient Location for Cyclotron Based Proton Therapy Facilities",
      "authors": [
        "V. Maradia",
        "A.L. Lomax",
        "D. Meer",
        "S. Psoroulas",
        "D.C. Weber",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "ETH",
        "Zurich",
        "Switzerland",
        "In cyclotron-based proton therapy facilities",
        "an energy selection system is typically used to lower beam energy from the fixed value provided by the accelerator (250/230MeV) to the one needed for the treatment (230-70MeV). Such a system has drawback of introducing an energy-dependent beam current at the patient location",
        "resulting in energy-dependent beam intensity ratios of about 103 between high and low energies. This complicates treatment delivery and challenges patient safety systems. As such",
        "we propose the use of a dual-energy degrader method that can reduce beam intensity for high-energy beams. The first degrader is made of high Z material and the second is made of low Z material and are placed next to each other. For high energies (230-180MeV)",
        "we use only first degrader to increase beam emittance after degrader and thus lose intensity in emittance selection collimators. For intermediate energy beams (180-100MeV) we use the combination of both degraders",
        "whereas for low energy beams (100-70MeV)",
        "only the second degrader limits the increase in emittance. With this approach",
        "energy-independent beam intensities can be achieved",
        "whilst localizing beam losses around the degrader."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms024.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS025",
      "title": "A Novel Method of Emittance Matching to Increase Beam Transmission for Cyclotron Based Proton Therapy Facilities: Simulation Study",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms025.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS026",
      "title": "Monte Carlo Simulation of Electron Beam in Phantom Water for Radiotherapy Application",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms026.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS028",
      "title": "Performance Study of the NIMMS Superconducting Compact Synchrotron for Ion Therapy with Strongly Curved Magnets",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms028.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS029",
      "title": "Testing the Properties of Beam-Dose Monitors for VHEE-FLASH Radiation Therapy",
      "authors": [
        "J.J. Bateman",
        "P. Burrows",
        "L.A. Dyks",
        "JAI",
        "Oxford",
        "United Kingdom",
        "R. Corsini",
        "M. Dosanjhpresenter",
        "W. Farabolini",
        "A. Gerbershagen",
        "N. Heracleous",
        "P. Korysko",
        "S. Morales Vigo",
        "V. Rieker",
        "B. Salvachúa",
        "M. Silari",
        "G. Zorloni",
        "CERN",
        "Meyrin",
        "Switzerland",
        "LNF-INFN",
        "Frascati",
        "Italy",
        "Very High Energy Electrons (VHEE) of 50 - 250 MeV are an attractive choice for FLASH radiation therapy (RT). Before VHEE-FLASH RT can be considered for clinical use",
        "a reliable dosimetric and beam monitoring system needs to be developed",
        "able to measure the dose delivered to the patient in real-time and cut off the beam in the event of a machine fault to prevent overdosing the patient. Ionisation chambers are the standard monitors in conventional RT; however",
        "their response saturates at the high dose rates required for FLASH. Therefore",
        "a new dosimetry method is needed that can provide reliable measurements of the delivered dose in these conditions. Experiments using 200 MeV electrons were done at the CLEAR facility at CERN to investigate the properties of detectors such as diamond beam loss detectors",
        "GEM foil detectors",
        "and Timepix3 ASIC chips. From the tests",
        "the GEM foil proved to be the most promising."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms029.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS030",
      "title": "Updates, Status and Experiments of CLEAR, the CERN Linear Electron Accelerator for Research",
      "authors": [
        "Oxford University",
        "Physics Department",
        "Oxford",
        "Oxon",
        "United Kingdom",
        "J.J. Bateman",
        "C.S. Robertson",
        "JAI",
        "Oxford",
        "United Kingdom",
        "R. Corsini",
        "M. Dosanjh",
        "L.A. Dyks",
        "A. Gilardi",
        "V. Rieker",
        "CERN",
        "Meyrin",
        "Switzerland",
        "CEA-DRF-IRFU",
        "France",
        "University of Oslo",
        "Oslo",
        "Norway",
        "The CERN Linear Accelerator for Research (CLEAR) at CERN is a test facility using a 200 MeV electron beam. In 2020 and 2021",
        "a few hardware upgrades were done: comparators for position measurements were added on components",
        "the in-air experimental area was re-arranged in order to provide more space",
        "a robotic system was built to enable remote samples manipulations for irradiation studies",
        "the BPM reading system was optimized and the laser double-bunch system implemented to allow for a doubling of the electron bunch frequency from 1.5 GHz to 3 GHz. In the paper",
        "we describe such improvements",
        "we outline the experimental activities during 2021 and illustrate the diverse program for the next 4 years",
        "including high doses’ irradiation studies for medical applications."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms030.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS031",
      "title": "VHEE High Dose Rate Dosimetry Studies in CLEAR",
      "authors": [
        "V. Rieker",
        "R. Corsini",
        "L.A. Dyks",
        "CERN",
        "Meyrin",
        "Switzerland",
        "JAI",
        "Oxford",
        "United Kingdom",
        "CEA-DRF-IRFU",
        "France",
        "Oxford University",
        "Physics Department",
        "Oxford",
        "Oxon",
        "United Kingdom",
        "The 200 MeV electron beam of the CERN Linear Accelerator for Research (CLEAR) user facility at CERN has been intensively used to study the potential use of Very High Energy Electrons (VHEE) in cancer radiotherapy. In particular",
        "irradiation tests have been performed in the high dose rate regime",
        "which has gained a lot of interest for the so called FLASH biological effect",
        "in which cancer cells are damaged while healthy tissue is largely spared. High dose rate dosimetry",
        "though",
        "poses a number of challenges: to validate standard or new methods of passive dosimetry",
        "like radiochromic films and alanine pellets",
        "and especially to develop new methods for real-time dosimetry since the normally used ionization chambers suffer from non-linear effects at high dose rates. In this paper we describe the results of experimental activities at CLEAR aimed at developing solid",
        "high-dose rate dosimetry standards adapted to VHEE beams."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms031.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS032",
      "title": "Advances in the Optimization of Medical Accelerators",
      "authors": [
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "Between 2016 and 2020",
        "15 Fellows have carried out collaborative research within the 4 Mâ¬ Optimization of Medical Accelerators (OMA) EU-funded innovative train-ing network. Based at universities",
        "research and clinical facilities",
        "as well as industry partners in several European countries",
        "the Fellows have successfully developed a range of beam and patient imaging techniques",
        "improved biological and physical models in Monte Carlo codes",
        "and also helped improve the design of existing and future clinical facilities. This contribution presents three selected OMA research highlights: the use of Medipix3 for dosimetry and real-time beam monitoring",
        "studies into the technical challenges for FLASH proton therapy",
        "recognized by the European Journal of Medical Physics’ 2021 Galileo Gali-lei Award",
        "and research into novel monitors for in-vivo dosimetry that emerged on the back of the OMA network."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms032.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS033",
      "title": "Design and Optimisation of a Stationary Chest Tomosynthesis System with Multiple Flat Panel Field Emitter Arrays: Monte Carlo Simulations and Computer Aided Designs",
      "authors": [
        "T.G. Primidis",
        "C.P. Welschpresenter",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "T.G. Primidis",
        "C.P. Welschpresenter",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "King’s College London",
        "London",
        "United Kingdom",
        "V. Soloviev",
        "S.G. Wells",
        "Adaptix Ltd",
        "Oxford",
        "United Kingdom",
        "Digital tomosynthesis (DT) allows 3D imaging by using a ~30° range of projections instead of a full circle as in computed tomography (CT). Patient doses can be ~10 times lower than CT and similar to 2D radiography but diagnostic ability is significantly better than 2D radiography and can approach that of CT. Moreover",
        "cold-cathode field emission technology allows the integration of 10s of X-ray sources into source arrays that are smaller and lighter than conventional X-ray tubes. The distributed source positions avoid the need for source movements and Adaptix Ltd has demonstrated stationary 3D imaging with this technology in dentistry",
        "orthopaedics",
        "veterinary medicine and non-destructive testing. In this work we present Monte Carlo simulations of an upgrade to the Adaptix technology to specifications suited for chest DT and we show computer aided designs for a system with various populations of these source arrays. We conclude that stationary arrays of cold-cathode X-ray sources could replace movable X-ray tubes for 3D imaging and different arrangements of many such arrays could be used to tailor the X-ray fields to different patient size and diagnostic objective."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms033.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS035",
      "title": "First Production of Astatine-211 at Crocker Nuclear Laboratory at UC Davis",
      "authors": [
        "E. Prebys",
        "D.A. Cebra",
        "R.B. Kibbee",
        "L.M. Korkeila",
        "K.S. Stewart",
        "UCD",
        "Davis",
        "California",
        "USA",
        "UC Davis",
        "Davis",
        "USA",
        "There is a great deal of interest in the medical community in the use of the alpha-emitter At-211 as a therapeutic isotope. Among other things",
        "its 7.2 hour half life is long enough to allow for recovery and labeling",
        "but short enough to avoid long term activity in patients. Unfortunately",
        "the only practical technique for its production is to bombard a Bi-209 target with a ~29 MeV alpha beam",
        "so it is not accessible to commercial isotope production facilities",
        "which all use fixed energy proton beams. The US Department of Energy is therefore supporting the development of a \"University Isotope Network\" (UIN) to satisfy this need. As part of this effort",
        "we have developed an At-211 production facility using the variable-energy",
        "multi-species cyclotron at Crocker Nuclear Lab the University of California",
        "Davis. This effort relies on a beam probe which has been modified to serve as an internal Bi-209 target",
        "to avoid problems with alpha particle extraction efficiency. This poster will data on the first production and recovery of At-211 using this system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms035.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS036",
      "title": "HERACLES: A High Average Current Electron Beamline for Lifetime Testing of Novel Photocathodes",
      "authors": [
        "M.B. Andorf",
        "J. Bae",
        "A.C. Bartnik",
        "I.V. Bazarov",
        "J.M. Maxson",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "We report on the building and commissioning of a high current beamline dedicated to testing novel photocathodes for high current and spin-polarized electron applications. The main features of the beamline are a 200 keV DC electron gun and a beam dump capable of handling 75 kW of beam power. In this report",
        "a Cs3Sb photocathode is used to demonstrate the facilities high current capabilities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms036.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS037",
      "title": "Ripple Pattern Formation on Silicon Carbide Surfaces by Low-Energy Ion-Beam Erosion",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms037.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS038",
      "title": "Spallation Target Optimization for ADS by Monte Carlo Codes",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms038.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS039",
      "title": "Investigation on Intermolecular Interactions in Ionic Liquids Using Accelerator-based THz Transition Radiation",
      "authors": [
        "P. Nanthanasit",
        "S. Rimjaem",
        "Chiang Mai University",
        "Chiang Mai",
        "Thailand",
        "N. Chattrapiban",
        "P. Nimmanpipug",
        "S. Rimjaem",
        "ThEP Center",
        "Commission on Higher Education",
        "Bangkok",
        "Thailand",
        "Suranaree University of Technology",
        "Nakhon Ratchasima",
        "Thailand",
        "Ionic liquids (ILs) are interesting material that can be used in many applications. Spectroscopic measurement using accelerator-based terahertz transition radiation (THz TR) is one of potential techniques to investigate their intermolecular interactions by observing the vibra-tional bands in the terahertz region due to TR’s excep-tional properties: coherent",
        "broadband",
        "and high intensi-ty. This work aims to study intermolecular interactions of ILs using the THz TR produced from an electron beam at the PBP-CMU Electron Linac Laboratory. The THz TR with the frequency range of 0.3-2.5 THz can be produced from electron beam of energy 10-25 MeV. This radiation is produced and transported to the experimental area",
        "where it is used as the coherent and polarization selective light source for the Fourier transform infrared (FTIR) spectrometer. The absorption spectrum in the THz region of the ILs is then measured. In addition",
        "to explain the experimental results deeply",
        "theoretical calculations using the density functional theory are performed. In this contribution",
        "we present the results from experiment and computational calculation that can be used together to describe the intermolecular interactions in ILs."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms039.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS040",
      "title": "Present Status of Linear Accelerator System for Natural Rubber Vulcanization at Chiang Mai University",
      "authors": [
        "C. Thongbai",
        "P. Jaikaew",
        "E. Kongmon",
        "S. Rimjaem",
        "J. Saisut",
        "P. Wongkummoon",
        "Chiang Mai University",
        "Chiang Mai",
        "Thailand",
        "Chiang Mai University",
        "PBP Research Facility",
        "Chiang Mai",
        "Thailand",
        "M.W. Rhodes",
        "S. Rimjaem",
        "J. Saisut",
        "C. Thongbai",
        "ThEP Center",
        "Commission on Higher Education",
        "Bangkok",
        "Thailand",
        "At the Plasma and Beam Physics (PBP) Research Fa-cility",
        "Chiang Mai University (CMU)",
        "an electron beam accelerator system for natural rubber irradiation has been under development and is currently under the commissioning. The research project is carried out with the aim to modify an old medical linac",
        "retired from the clinical operation",
        "for rubber latex vulcanization and materials irradiation using electron beams. The accelerator system consists of a DC-thermionic cathode electron gun",
        "a standing-wave RF linear accelerator",
        "an RF system",
        "a control system",
        "beam diagnostic systems",
        "and an irradia-tion system. The components were completely assembled",
        "and the RF system was tested. The RF processing has been performed and some of the electron beam properties have been measured. This contribution presents some experimental results while developing and testing the various sub-systems of this accelerator. The present status of development and some vulcanization results will also be reported in this contribution."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms040.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS041",
      "title": "Design and Parameterization of Electron Beam Irradiation System for Natural Rubber Vulcanization",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms041.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS042",
      "title": "Development of a Cyclotron Based External Beam Irradiation System for Elemental Analysis",
      "authors": [
        "P. Thongjerm",
        "A. Ngamlamiad",
        "W. Pornroongruengchok",
        "K. Tangpong",
        "S. Wonglee",
        "Thailand Institute of Nuclear Technology",
        "Nakhon Nayok",
        "Thailand",
        "We present the studies carried out at the cyclotron facility at Thailand Institute of Nuclear Technology (TINT",
        "Nakhon Nayok",
        "Thailand). The cyclotron accelerates up to 30 MeV proton with a maximum beam current of 200 µA. Proton beam is transported to three target halls",
        "including the R&D vault. Particularly",
        "the R&D beamline consists of a five-port switching magnet allowing further extension for multidisciplinary research and experiments. The first station of the research vault is dedicated to non-destructive and multi-elemental analysis using proton-induced x-ray (PIXE) and proton-induced gamma (PIGE) techniques. For this purpose",
        "the beam is extracted through an exit foil to the air. The beam size is then shaped by a set of collimators before reaching a sample. However",
        "the range of the protons in air and the attenuation of x-rays may deteriorate. Therefore",
        "the external irradiation system",
        "including exit foil",
        "collimator and detector arrangement",
        "is evaluated in Geant4 to optimise the proton beam quality and improve detection efficiency. A detailed description of the simulation and results are discussed in this work."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms042.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS043",
      "title": "Mu*STAR: Superconducting Accelerator Driven Subcritical Molten Salt Nuclear Power Plants",
      "authors": [
        "R.P. Johnson",
        "R.J. Abrams",
        "M.A. Cummingspresenter",
        "J.D. Lobo",
        "T.J. Roberts",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "The Mu*STAR Nuclear Power Plant (NPP) is a transformational and disruptive concept using advances in superconducting accelerator technology to burn spent nuclear fuel (SNF) to close the fuel cycle and to eliminate need for uranium enrichment. One linac drives multiple Mu*STAR Small Modular Reactors (SMR) using subcritical molten salt fueled reactors with an internal spallation neutron target. Neutrons initiate fission chains that die out in the subcritical core. That means intrinsic immunity to criticality accidents. This new way to make nuclear energy employs continuous online removal of all fission products from molten salt fuel volatiles removed by helium purge gas. This reduces chance of accidental release. Non-volatiles removed by vortex separators",
        "allowing complete burning of SNF."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms043.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS046",
      "title": "Generation of Flat-Laser Compton Scattering Gamma-ray Beam in UVSOR",
      "authors": [
        "H. Ohgaki",
        "K. Ali",
        "T. Kii",
        "H. Zen",
        "Kyoto University",
        "Kyoto",
        "Japan",
        "M. Fujimoto",
        "Y. Taira",
        "UVSOR",
        "Okazaki",
        "Japan",
        "T. Hayakawa",
        "T. Shizuma",
        "QST",
        "Tokai",
        "Japan",
        "Flat energy distribution Laser Compton scattering (F-LCS) gamma-ray beam",
        "which has a flat distribution in the energy spectrum and the spatial distribution with a small beam size",
        "has been developed to study an isotope selective CT Imaging application at the beamline BL1U in UVSOR. We have successfully demonstrated a three-dimensional (3D) isotope-selective CT image by using a conventional LCS gamma-ray beam[1]. However",
        "the conventional LCS beam with a small beam size whose energy spread is narrow can’t excite a few isotopes at the same time. Therefore",
        "we proposed the F-LCS gamma-ray beam by using the Apple-II undulator installed in BL1U in UVSOR to excite a circular motion of the electron beam. An EGS5 simulation shows that a weak magnetic field (K=0.2) can generate an F-LCS beam. The demonstration experiments have been carried out in UVSOR and the spectra of generated LCS beam with different K-values of the undulator were measured. As a result",
        "the measured spectra agreed with the EGS5 simulation. The principle of F-LCS generation and experimental results",
        "including the effect on the stored electron beam",
        "will be presented at the conference.",
        "[1] K. Ali",
        "et. al.",
        "\"Three-dimensional nondestructive isotope-selective tomographic imaging of 208Pb distribution via nuclear resonance fluorescence\". Appl. Sci. 2021",
        "11",
        "3415."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms046.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS047",
      "title": "Design of Radiation Shielding for the PBP-CMU Electron Linac Laboratory",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms047.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS048",
      "title": "Challenge Based Innovation \"Accelerators for the Environment\"",
      "authors": [
        "Université Paris-Saclay",
        "CNRS/IN2P3",
        "IJCLab",
        "Orsay",
        "France",
        "JAI",
        "Oxford",
        "United Kingdom",
        "R. Holland",
        "L. Rinolfi",
        "ESI",
        "Archamps",
        "France",
        "E. Métral",
        "M. Vretenar",
        "CERN",
        "Meyrin",
        "Switzerland",
        "We present an initiative to foster new ideas about the applications of accelerators to the Environment. Called \"Challenge Based Innovation\" this initiative will gather four teams each of six master-level students each coming from different academic backgrounds. As part of the EU-funded I.FAST project (Innovation Fostering in Accelerator Science and Technology)",
        "they will gather during 10 days in Archamps near CERN to receive high level lectures on accelerators and the environment and to brainstorm on possible new applications of accelerators for the environment. At the end of the gathering",
        "they will present their project at CERN to a jury made of experts."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms048.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS049",
      "title": "Energy Comparison of Room Temperature and Superconducting Synchrotrons for Hadron Therapy",
      "authors": [
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "E. Benedetto",
        "M. Karppinen",
        "M.R. Khalvati",
        "M. Vretenar",
        "R. van Weelderen",
        "CERN",
        "Meyrin",
        "Switzerland",
        "M.G. Pullia",
        "G. Venchi",
        "CNAO Foundation",
        "Pavia",
        "Italy",
        "INFN/LASA",
        "Segrate (MI)",
        "Italy",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Universita’ degli Studi di Milano & INFN",
        "Segrate",
        "Italy",
        "La Sapienza University of Rome",
        "Rome",
        "Italy",
        "The yearly energy requirements of normal conducting (NC) and superconducting (SC) magnet options of a new hadron therapy (HT) facility are compared. Special reference is made to the layouts considered for the proposed SEEIIST facility. Benchmarking with the NC CNAO HT centre in Pavia (Italy) was carried out. The energy comparison is centred on the different synchrotron solutions",
        "assuming the same injector and lines in the designs. The beam current is more than a factor 10 higher with respect to present generation facilities. This allows efficient ’multi-energy extraction’ (MEE)",
        "which shortens the therapy treatment and is needed especially in the SC option",
        "because of the slow magnet ramping time. Hence",
        "power values of the facility in the traditional mode were converted into MEE ones",
        "for the sake of a fair stepwise comparison between NC and SC magnets. The use of cryocoolers and a liquefier are also compared",
        "for synchrotron refrigeration. This study shows that a NC facility operated in MEE mode requires the least average energy",
        "followed by the SC synchrotron solution with a liquefier",
        "while the most energy intensive solution is the SC one with cryocoolers."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms049.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS050",
      "title": "Design of Linac Based Neutron Source",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms050.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS051",
      "title": "Study on Construction of an Additional Beamline for a Compact Neutron Source Using a 30 Mev Proton Cyclotron",
      "authors": [
        "Y. Kuriyama",
        "M. Hino",
        "Y. Iwashitapresenter",
        "R.N. Nakamura",
        "H. Tanaka",
        "Kyoto University",
        "Research Reactor Institute",
        "Osaka",
        "Japan",
        "The Institute for Integrated Radiation and Nuclear Science",
        "Kyoto University (KURNS) has been actively using neutrons extracted from the research reactor (KUR) for collaborative research. Since the operation of KUR is scheduled to be terminated in 2026 according to the current reactor operation plan",
        "the development of a general-purpose neutron source using the 30 MeV proton cyclotron (HM-30) installed at KURNS for Boron Neutron Capture Therapy (BNCT) research has been discussed as an alternative neutron source. In this presentation",
        "we report on the conceptual design of an additional beamline for a compact neutron source using this cyclotron."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms051.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS052",
      "title": "Magnetic Field Shield for SC-Cavity with Thin Nb Sheet",
      "authors": [
        "Y. Iwashita",
        "Y. Kuriyama",
        "Kyoto University",
        "Research Reactor Institute",
        "Osaka",
        "Japan",
        "JAEA/J-PARC",
        "Tokai-mura",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "Shielding the superconducting accelerating cavity made of niobium from the weak environmental magnetic field is an important subject. Niobium is a type-II superconductor",
        "which traps the environmental magnetic flux in the material during the superconducting transition",
        "resulting in increase of residual resistance and heating during operation during operation. Shielding from a weak magnetic field is essential for high performance operations. A magnetic shielding method that uses the diamagnetism of superconducting materials instead of magnetic flux absorption by high magnetic permeability materials is discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms052.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS053",
      "title": "Proton Beam Irradiation System for Space Part Test",
      "authors": [
        "H.-J. Kwon",
        "J.J. Dang",
        "W.-H. Jung",
        "H.S. Kim",
        "K.Y. Kim",
        "K.R. Kim",
        "S. Lee",
        "Y.G. Song",
        "S.P. Yun",
        "KOMAC",
        "KAERI",
        "Gyeongju",
        "Republic of Korea",
        "A proton beam irradiation system for space part test has been developed at Korea Multi-purpose Accelerator Complex (KOMAC) based on 100 MeV proton linac. It consists of a thermal vacuum chamber",
        "a beam diagnostic system and a control system in the low flux beam target room. The thermal vacuum chamber accommodates the capacity for proton beam irradiation in addition to temperature control in vacuum condition. The beam diagnostic system is newly installed to measure the lower dose rate than existing one. In this paper",
        "the proton beam irradiation system for space part test including a thermal vacuum chamber",
        "newly installed beam diagnostic system is presented."
      ],
      "institutions": [
        "Funding: This work is supported by the Nuclear Research and Development Program (2021M2D1A1045615) through the National Research Foundation of Korea."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms053.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS054",
      "title": "Beam Lines and Stations for Applied Research Based on Ion Beams Extracted from Nuclotron",
      "authors": [
        "G.A. Filatov",
        "A. Agapov",
        "A.A. Baldin",
        "A.V. Butenko",
        "A.R. Galimov",
        "S.Yu. Kolesnikov",
        "K.N. Shipulin",
        "A. Slivin",
        "E. Syresinpresenter",
        "G.N. Timoshenko",
        "A. Tuzikov",
        "A.S. Vorozhtsov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "S. Antoine",
        "W. Beeckman",
        "X.G. Duveau",
        "J. Guerra-Phillips",
        "P.J. Jehanno",
        "SIGMAPHI S.A.",
        "Vannes",
        "France",
        "D.V. Bobrovskiy",
        "A.I. Chumakov",
        "MEPhI",
        "Moscow",
        "Russia",
        "P.N. Chernykh",
        "S. Osipov",
        "E. Serenkov",
        "Ostec Enterprise Ltd",
        "Moscow",
        "Russia",
        "D.G. Firsov",
        "A.S. Kubankin",
        "Yu.S. Kubankin",
        "LLC \"Vacuum systems and technologies\"",
        "Belgorod",
        "Russia",
        "I.L. Glebov",
        "V.A. Luzanov",
        "GIRO-PROM",
        "Dubna",
        "Moscow Region",
        "Russia",
        "NRC",
        "Moscow",
        "Russia",
        "ITEP",
        "Moscow",
        "Russia",
        "New beamlines and irradiation stations of the Nuclotron-based Ion Collider fAcility (NICA) are currently under construction at JINR. These facilities for applied research will provide testing on capsulated microchips (ion energy range of 150-500 MeV/n) at the Irradiation Setup for Components of Radioelectronic Apparatus (ISCRA) and space radiobiological research (ion energy range 400-1100 MeV/n) at the Setup for Investigation of Medical Biological Objects (SIMBO). In this note",
        "the technical details of SIMBO and ISCRA stations and their beamlines are described and discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms054.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS055",
      "title": "Commissioning of the SOCHI Applied Station Beam and Beam Transfer Line at the NICA Accelerator Complex",
      "authors": [
        "A. Slivin",
        "A. Agapov",
        "A.A. Baldin",
        "A.V. Butenko",
        "D.E. Donets",
        "G.A. Filatov",
        "A.R. Galimov",
        "K.N. Shipulin",
        "E. Syresinpresenter",
        "A. Tuzikov",
        "V.I. Tyulkin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "D.V. Bobrovskiy",
        "A.I. Chumakov",
        "S. Soloviev",
        "MEPhI",
        "Moscow",
        "Russia",
        "I.L. Glebov",
        "V.A. Luzanov",
        "GIRO-PROM",
        "Dubna",
        "Moscow Region",
        "Russia",
        "LPI",
        "Moscow",
        "Russia",
        "BelSU",
        "Belgorod",
        "Russia",
        "T. Kulevoy",
        "Y.E. Titarenko",
        "ITEP",
        "Moscow",
        "Russia",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "The SOCHI (Station of CHip Irradiation) station was constructed at the NICA accelerator complex for single event effect testing of decapsulated microchips with low-energy ion beams (3.2 MeV/n). The peculiarity of microchip radiation tests in SOCHI is connected with the pulse beam operation of the heavy ion linear accelerator (HILAc) and a restriction on the pulse dose on the target. The SOCHI station construction",
        "the equipment and the results of the first beam runs are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms055.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS056",
      "title": "An Overview of the Applications of MIR and THz Spectroscopy in Astrochemistry Studies",
      "authors": [
        "C. Suwannajak",
        "U. Keyen",
        "A. Leckngam",
        "N. Tanakul",
        "NARIT",
        "Chiang Mai",
        "Thailand",
        "W. Jaikla",
        "S. Pakluea",
        "P. Wongkummoon",
        "Chiang Mai University",
        "PBP Research Facility",
        "Chiang Mai",
        "Thailand",
        "Suranaree University of Technology",
        "Nakhon Ratchasima",
        "Thailand",
        "P. Nimmanpipug",
        "S. Rimjaem",
        "ThEP Center",
        "Commission on Higher Education",
        "Bangkok",
        "Thailand",
        "S. Pakluea",
        "S. Rimjaem",
        "P. Wongkummoon",
        "Chiang Mai University",
        "Chiang Mai",
        "Thailand",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "Interstellar complex molecules can be found in molecular clouds which are spread throughout our galaxy. Some of these molecules are thought to be the precursors of bio-molecules. Therefore",
        "understanding the formation processes of those interstellar complex molecules is crucial to understanding the origin of the building blocks of life. There are currently more than a hundred known complex molecules discovered in interstellar clouds. However",
        "the formation processes of those molecules are not yet well understood since they occur in very extreme conditions and very short time scale. Ultrafast spectroscopy can be applied to study those processes that occur in the time scale of femtoseconds or picoseconds. In this work",
        "we present an overview of the applications of MIR and THz pump-probe experiments in astrochemistry studies. An experimental setup to simulate space conditions that mimic the environments where the interstellar complex molecules are formed is currently being developed at the PBP-CMU Electron Linac Laboratory. Then",
        "we present our development plan of the experimental station and its current status."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms056.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS057",
      "title": "Using Co-Moving Collisions in a Gear-Changing System to Measure Fusion Cross-Sections",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "In this work we look at a possible use for a system that collides beams moving in the same direction using a gear-changing synchronization method as a means of measuring low energy phenomena",
        "such as fusion cross sections. Depending on the energies used this process will allow for interactions for any desired charge state of the target nuclei. Earlier concepts for low energy interactions to study focused on beams crossing at an angle to give the low energy interactions",
        "as well as general investigations of comoving collisions. This proposal would use gear-changing",
        "a method involving two different harmonic numbers of bunches in each collider ring",
        "to have the same types of collisions",
        "with a luminosity equal that of a head-on machine. In this work we detail the design considerations for such a machine",
        "leveraging experimental experience with a co-moving",
        "gear-changing system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms057.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPOMS060",
      "title": "Development of Analytical Light Source for Construction of Femtosecond Pulse Radiolysis System Using Er Fiber Laser",
      "authors": [
        "Y. Kaneko",
        "Y. Koshiba",
        "K. Sakaue",
        "M. Sato",
        "M. Washio",
        "Waseda University",
        "Tokyo",
        "Japan",
        "The University of Tokyo",
        "Graduate School of Engineering",
        "Bunkyo",
        "Japan",
        "We are trying to elucidate the initial process of radiation chemical reactions",
        "which is considered to be an unknown area. One of the methods to elucidate this initial process is pulse radiolysis. In pulse radiolysis",
        "a substance is irradiated with ionizing radiation and at the same time irradiated with analytical light",
        "and the absorption spectrum of the light can be traced back in time to the active species. However",
        "the radiation chemical reaction starts in a very short time",
        "and the pulse radiolysis system needs to have the same time resolution. Therefore",
        "the analytical light should be ultra-short pulses. In addition",
        "the absorption wavelength of the substance is not always known. Hence",
        "the wavelength range of the analytical light should be broad. Since the absorption wavelengths of important active species are in the visible light region",
        "it is desirable to cover the visible light region as well. We believe that supercontinuum light generated from the second harmonic of the Er fiber laser is the best analytical light to meet these requirements. In this presentation",
        "we describe the current status of the development of the supercontinuum light generation and future prospects."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thpoms060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thpoms060.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thpoms060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THPOMS060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 52,
  "scrape_time": "2025-10-10 18:45:05"
}