{
  "session_info": {
    "id": "WEOCI",
    "name": "WEOCI - THz and Long Wavelength FELs",
    "url": "https://proceedings.jacow.org/FEL2012/html/weoci.htm"
  },
  "papers": [
    {
      "paper_id": "WEOCI01",
      "title": "The Infrared and THz User Facility FELIX in Nijmegen",
      "authors": [
        "G. Berden",
        "B. Redlich",
        "FOM Rijnhuizen",
        "Nieuwegein",
        "The Netherlands",
        "R.T. Jongma",
        "F.J.P. Wijnen",
        "A.F.G. van der Meer",
        "W.J. van der Zande",
        "Radboud University",
        "Nijmegen",
        "The Netherlands",
        "The infrared and THz user facility FELIX at the Radboud University Nijmegen will comprise two free electron lasers - namely FLARE",
        "the recently commissioned THz laser at Nijmegen",
        "as well as the FELIX and FELICE laser beam lines",
        "currently relocated from the FOM Institute to Nijmegen. The FELIX (Free Electron Lasers for Infrared eXperiments) facility will offer the international user community a unique wavelength range covering the mid- and far-infrared as well as the THz range from 3 to 1500 micron (3300 - 6 cm-1 or 100 THz - 0.2 THz). We will discuss the layout of this new facility including the user laboratories as well as some of the special features offered to the users including: (i) the FLARE high spectral resolution mode",
        "(ii) the FELICE intra-cavity configuration for extreme infrared intensities and (iii) the connection of the facility with the adjacent high magnetic field laboratory (HFML). The timeline for the integration of the facility foresees a start of operation in the summer of 2013 and full operation is expected for the beginning of 2014."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/weoci01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/weoci01.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/weoci01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-WEOCI01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 17:34:51"
}