{
  "session_info": {
    "id": "MOAL",
    "name": "MOAL - Project Status Reports I",
    "url": "https://proceedings.jacow.org/icalepcs2021/html/moal.htm"
  },
  "papers": [
    {
      "paper_id": "MOAL01",
      "title": "Maturity of the MAX IV Laboratory in Operation and Phase II Development",
      "authors": [
        "V. Hardion",
        "P.J. Bell",
        "M. Eguiraun",
        "T. Eriksson",
        "Á. Freitas",
        "J.M. Klingberg",
        "M. Lindberg",
        "Z. Matej",
        "S. Padmanabhan",
        "A. Salnikov",
        "P. Sjöblom",
        "D.P. Spruce",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "MAX~IV Laboratory",
        "the first 4th generation synchrotron located in the south of Sweden",
        "entered operation in 2017 with the first three experimental stations. In the past two years the project organisation has been focused on phase II of the MAX IV Laboratory development",
        "aiming to raise the number of beamlines in operation to 16. The KITS group",
        "responsible for the control and computing systems of the entire laboratory",
        "was a major actor in the realisation of this phase as well as in the continuous up-keep of the user operation. The challenge consisted principally of establishing a clear project management plan for the support groups",
        "including KITS",
        "to handle this high load in an efficient and focused way",
        "meanwhile gaining the experience of operating a 4th generation light source. The momentum gained was impacted by the last extensive shutdown due to the pandemic and shifted toward the remote user experiment",
        "taking advantage of web technologies. This article focuses on how KITS has handled this growing phase in term of technology and organisation",
        "to finally describe the new perspective for the MAX IV Laboratory",
        "which will face a bright future."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/moal01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/moal01.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/moal01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOAL01",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOAL02",
      "title": "Status of the National Ignition Facility (NIF) Integrated Computer Control and Information Systems",
      "authors": [
        "M. Fedorov",
        "A.I. Barnes",
        "L. Beaulac",
        "G.K. Brunton",
        "A.D. Casey",
        "J.R. Castro Morales",
        "J. Dixon",
        "C.M. Estes",
        "M.S. Flegel",
        "V.K. Gopalan",
        "S. Heerey",
        "R. Lacuata",
        "V.J. Miller Kamm",
        "M. Paul",
        "B.M. Van Wonterghem",
        "S. Weaver",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "The National Ignition Facility (NIF) is the world’s most energetic laser system used for Inertial Confinement Fusion (ICF) and High Energy Density Physics (HEDP) experimentation. Each laser shot delivers up to 1.9 MJ of ultraviolet light",
        "driving target temperatures to in excess of 180 million K and pressures 100 billion times atmospheric ’ making possible direct study of conditions mimicking interiors of stars and planets",
        "as well as our primary scientific applications: stockpile stewardship and fusion power. NIF control and diagnostic systems allow physicists to precisely manipulate",
        "measure and image this extremely dense and hot matter. A major focus in the past two years has been adding comprehensive new diagnostic instruments to evaluate increasing energy and power of the laser drive. When COVID-19 struck",
        "the controls team leveraged remote access technology to provide efficient operational support without stress of on-site presence. NIF continued to mitigate inevitable technology obsolescence after 20 years since construction. In this talk",
        "we will discuss successes and challenges",
        "including NIF progress towards ignition",
        "achieving record neutron yields in early 2021."
      ],
      "institutions": [
        "Funding: This work performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/moal02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/moal02.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/moal02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOAL02",
      "page_number": "9",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOAL03",
      "title": "From SKA to SKAO: Early Progress in the SKAO Construction",
      "authors": [
        "J. Santander-Vela",
        "M. Bartolini",
        "M. Miccolis",
        "N.P. Rees",
        "SKAO",
        "Macclesfield",
        "United Kingdom",
        "The Square Kilometre Array telescopes have recently started their construction phase",
        "after years of pre-construction effort. The new SKA Observatory (SKAO) intergovernmental organisation has been created",
        "and the start of construction (T0) has already happened. In this talk",
        "we summarise the construction progress in our facility",
        "and the role that agile software development and open-source collaboration",
        "and in particular the development of our TANGO-based control system",
        "is playing."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/moal03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/moal03.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/moal03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOAL03",
      "page_number": "14",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 18:04:10"
}