{
  "session_info": {
    "id": "THPML",
    "name": "THPML - MC3/6/7 Poster Session",
    "url": "https://proceedings.jacow.org/ipac2018/html/thpml.htm"
  },
  "papers": [
    {
      "paper_id": "THPML002",
      "title": "Emittance Preservation in Plasma-Based Accelerators with Ion Motion",
      "authors": [
        "C. Benedetti",
        "E. Esarey",
        "W. Leemans",
        "T.J. Mehrling",
        "C.B. Schroeder",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "In a plasma-accelerator-based linear collider",
        "the density of matched",
        "low-emittance",
        "high-energy particle bunches required for collider applications can be orders of magnitude above the background ion density",
        "leading to ion motion",
        "perturbation of the focusing fields",
        "and",
        "hence",
        "to beam emittance growth. By analyzing the response of the background ions to an ultrahigh density beam",
        "analytical expressions",
        "valid for non-relativistic ion motion",
        "are obtained for the perturbed focusing wakefield. Initial beam distributions are derived that are equilibrium solutions",
        "which require head-to-tail bunch shaping",
        "enabling emittance preservation with ion motion."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML006",
      "title": "Using Drive Rods in Inductions Cells to Reduce the Beam Break Up Instability",
      "authors": [
        "N. Pogue",
        "T.L. Houck",
        "B.R. Poole",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "The Beam Breakup Instability is a critical effect to reduce in high current induction accelerators. The RF modes generated inside the induction cells can deflect or degrade subsequent beam traversing the cell. Significant effort has been invested in minimizing the effect over several decades. One mechanism that is known to reduce the transverse impedance",
        "the main observable experimentally which directly relates to the BBU amplitude",
        "is to introduce ferrites to absorb the fields. Another",
        "less investigated mechanism",
        "is to disturb the modes symmetry by inserting the drive rods at the proper locations in the cell. This paper will show that the drive rods can dramatically reduce the transverse impedance",
        "and will show that simulations are maturing towards predicting this effect. Lawrence Livermore National Laboratory is operated by Lawrence Livermore National Security",
        "LLC",
        "for the U.S. Department of Energy",
        "National Nuclear Security Administration under Contract DE-AC52-07NA27344."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml006.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML007",
      "title": "An Investigation of Electron Beam Divergence from a Single DFEA Emitter Tip",
      "authors": [
        "H.L. Andrews",
        "B.K. Choi",
        "R.L. Fleming",
        "D. Kim",
        "J.W. Lewellen",
        "K.E. Nichols",
        "D.Y. Shchegolkov",
        "E.I. Simakov",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Diamond Field-Emitter Array (DFEA) cathodes are arrays of micron-scale diamond pyramids with nanometer-scale tips. DFEAs can produce high emission currents with small emittance and energy spread. At LANL",
        "we have an ongoing program to test DFEA cathodes for the purpose of using them to generate high-current",
        "low-emittance electron beams for dielectric laser accelerators. We have recently upgraded our cathode test chamber to use a mesh anode in place of a solid luminescent anode. In addition to allowing for downstream beam transport",
        "this arrangement may eliminate earlier problems with reduced cathode performance due to ion back-bombardment. We are measuring divergence of the electron beam past the mesh in an effort to characterize the inherent beam divergence off the diamond tip and divergence contribution from the mesh. We will compare these observations with theoretical and modeled values."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml007.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML009",
      "title": "Polarized Deuteron Negative Ion Source for Nuclear Physics Applications",
      "authors": [
        "V.G. Dudnikov",
        "M.A. Cummingspresenter",
        "R.P. Johnson",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The proposed U.S. Electron-Ion Collider (EIC) provides a unique tool to explore the next frontier in Quantum Chromodynamics",
        "the dependence of hadron structure on the dynamics of gluons and sea quarks. Polarized beams are essential to these studies; understanding of the hadron structure cannot be achieved without knowledge of the spin. The existing EIC concepts utilize both polarized electrons and polarized protons/light ion species to probe the sea quark and gluon distributions. Polarized deuterons provide an especially unique system for study by essentially providing a combination of quark and nuclear physics. We note that there are currently no operational polarized deuteron beam sources in the United States. This polarized deuteron source can serve as a polarized deuteron injector for a future EIC",
        "with additional applications in polarimetry and polarized gas targets for experiments at CEBAF or RHIC and would be very useful for our future facilities."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml009.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML010",
      "title": "Modeling of Diamond Field Emitter Arrays for Shaped Electron Beam Production",
      "authors": [
        "K.E. Nichols",
        "H.L. Andrews",
        "D.Y. Shchegolkov",
        "E.I. Simakov",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "We present simulations of shaped electron beam production from diamond field emitter array (DFEA) cathodes. DFEAs are arrays of diamond pyramids with bases of the order of 10 microns that produce high current densities. These arrays can be fabricated in arbitrary shapes such as a triangle or a double triangle",
        "so that they produce an inherently shaped beam. These transversely shaped beams can be put through an emittance exchanger to produce a longitudinally shaped electron beam distribution for use with high-transformer ratio wakefield accelerators. Simulations are conducted with MICHELLE. We design cathodes and focusing systems that preserve the beam's shape while transporting it to the emittance exchanger."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML011",
      "title": "Possibilities for Fabricating Polymer Dielectric Laser Accelerator Structures with Additive Manufacturing",
      "authors": [
        "E.I. Simakov",
        "R.D. Gilbertson",
        "M.J. Herman",
        "G. Pilania",
        "D.Y. Shchegolkov",
        "E.M. Walker",
        "E. Weis",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "R.J. England",
        "K.P. Wootton",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "We present results of recent studies of new materials designed for the additive manufacturing of accelerating structures for dielectric laser accelerators (DLAs). Demonstration of a stand-alone practical DLA requires innovation in design and fabrication of efficient laser accelerator structures and couplers. Many complicated three-dimensional structures for laser acceleration (such as a long woodpile structure with couplers) are difficult to manufacture with conventional microfabrication technologies. LANL has a large effort focused on developing new materials and techniques for additive manufacturing. The materials for DLA structures must have high dielectric constant (larger than 4)",
        "low loss in the infrared regime",
        "high laser damage threshold",
        "and be able to withstand the electron beam damage. This presentation will discuss the development of novel infrared dielectric materials that are of interest for laser acceleration and are compatible with additive manufacturing",
        "as well as recent advances in additive manufacturing of dielectric woodpile structures using a Nanoscribe direct laser-writing 3D printer."
      ],
      "institutions": [
        "Funding: Los Alamos National Laboratory LDRD Program"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml011.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML012",
      "title": "Simulations and Measurements of the Wakefield Loading Effect in Argonne Wakefield Accelerator Beamline",
      "authors": [
        "J. Upadhyay",
        "E.I. Simakov",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "M.E. Conde",
        "Q. Gao",
        "N.R. Neveu",
        "J.G. Power",
        "J.H. Shao",
        "E.E. Wisniewski",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "A beam driven acceleration experiment in a photonic band gap (PBG) structure is planned at Argonne wakefied accelerator (AWA) facility at Argonne National Laboratory. We plan to pass a high charge (drive) beam through a travelling wave 11.7 GHz PBG structure and generate a wakefield. This wakefield will be probed by a low charge (witness) beam to demonstrate wakefield acceleration and deceleration. The drive and witness bunches will be accelerated to above 60 MeV in the main accelerator at AWA which has frequency of 1.3 GHz. The charges used in this experiment could be as high as 20 nC. To measure the exclusive effect of PBG the structure on acceleration and deceleration of the witness bunch we have to exclude the effect of beam loading of the main AWA accelerator structure. To understand the wakefield effect in AWA",
        "we conducted an experiment where we passed the high charge (10 nC) beam through the accelerator structure which was followed by a 2 nC witness beam separated by 4 wavelength. The energy of witness beam was measured in the presence and absence of the drive beam. The beam loading was observed and quantified. The results of this work will be presented in the conference."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml012.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML013",
      "title": "Demonstration of the Wakefield Acceleration in an 11.7 GHz Photonic Band Gap Accelerator Structure",
      "authors": [
        "J. Upadhyay",
        "E.I. Simakov",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "M.E. Conde",
        "Q. Gao",
        "N.R. Neveu",
        "J.G. Power",
        "J.H. Shao",
        "E.E. Wisniewski",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "We plan to conduct a beam driven acceleration experiment in a photonic band gap (PBG) accelerator structure operating at 11.7 GHz at Argonne Wakefield Accelerator (AWA) facility. For the experiment",
        "the PBG structure will be excited by a high charge (up to 10 nC) electron bunch",
        "and a second smaller charge witness bunch will be accelerated. Because the PBG structure was fabricated with electroforming",
        "the AWA beamline includes a Be window placed before the PBG structure that protects the cathode from contamination due to possible outgassing from the electroformed copper. The diameter of the Be window is 9 mm and the beam tube diameter of the PBG structure is 6.4 mm. The size of the high charge electron beam on Be window has to be minimized to minimize scattering. The parameters of the beamline had to be adjusted to achieve good propagation of the beam. An OPAL simulation for the AWA beamline was performed for 1",
        "5",
        "and 10 nC beams. The beam size was experimentally measured at different positions in the beamline for different charges to verify simulations. Finally",
        "the high charge electron beam was passed through the PBG structure and acceleration of the witness bunch was measured"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml013.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML014",
      "title": "A Metamaterial Wagon Wheel Structure for Wakefield Acceleration by Reversed Cherenkov Radiation",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml014.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML015",
      "title": "Dielectric Multipactor Discharges at 110 GHz",
      "authors": [
        "MIT",
        "Cambridge",
        "Massachusetts",
        "USA",
        "M.A. Shapiro",
        "R.J. Temkin",
        "MIT/PSFC",
        "Cambridge",
        "Massachusetts",
        "USA",
        "A 1.5 MW",
        "110 GHz gyrotron has been used to experimentally measure the maximum sustainable fields on dielectric materials in vacuum. The purpose of this work is to evaluate the suitability of these materials for future applications in high frequency linear accelerators and high power terahertz components. To our knowledge",
        "these are the first measurements of multipactor phenomena in the millimeter wave or terahertz frequency range. Materials tested include alumina",
        "sapphire",
        "fused quartz",
        "crystal quartz",
        "and high resistivity silicon. Dielectric samples were tested both as windows",
        "with electric fields parallel to the surface",
        "and sub-wavelength dielectric rod waveguides",
        "with electric fields perpendicular to the surface. Surface electric fields in excess of 52 MV/m were achieved in 3 microsecond pulses. Visible light emission",
        "absorbed/scattered microwave power",
        "and emitted electrons were measured to characterize the discharges on the dielectric surfaces. The results of these experiments have been compared to theoretical calculations of multipactor discharges",
        "testing these theories at significantly higher frequencies than has been done before."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml015.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML017",
      "title": "Beam Dynamics Calculation of a New Injection System for LINAC II",
      "authors": [
        "J.X. Zhang",
        "M. Hüning",
        "DESY",
        "Hamburg",
        "Germany",
        "The Linac II at DESY (Deutsches Elektronen Synchrotron) is an electron/positron linear accelerator with a 400 MeV primary electron linac",
        "an 800 MW positron converter",
        "and a 450 MeV secondary electron/positron linac. For reliability two injection systems can be switched",
        "a 150 kV bombarder diode gun dating from 1969 and a 100 kV triode gun commissioned in 2014. The older bombarder gun shall be replaced with a triode gun optimized for injection into the synchrotron radiation facility PETRA III. In this paper",
        "the parameters of the existing injectors and the design considerations for the new injector are presented. The preliminary beam dynamics calculation of the new injection system will be performed; the future plan of the replacement will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml017.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML018",
      "title": "Modeling of Self-Modulated Laser Wakefield Acceleration Driven by Sub-Terawatt Laser Pulses",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml018.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML020",
      "title": "The First Results of Trial Operation and Performance Improve of the 100 MeV/ 100 kW Electron Linear Accelerator of the NSC KIPT SCA Neutron Source",
      "authors": [
        "A.Y. Zelinsky",
        "O.E. Andreev",
        "V.P. Androsov",
        "O. Bezditko",
        "O.V. Bykhun",
        "A.N. Gordienko",
        "V.A. Grevtsev",
        "A. Gvozd",
        "V.E. Ivashchenko",
        "I.I. Karnaukhov",
        "I.M. Karnaukhov",
        "V.P. Lyashchenko",
        "M. Moisieienko",
        "A.V. Reuzayev",
        "D.V. Tarasov",
        "V.I. Trotsenko",
        "NSC/KIPT",
        "Kharkov",
        "Ukraine",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The NSC KIPT SCA Neutron Source uses 100 MeV/ 100 kW electron linear accelerator as a driver for the generation of the initial neutrons. The trial operation of the accelerator was started in 2018. To provide design electron beam parameters is the primary task of the first stage of the trial operation. During the first stage of the accelerator operation the following tasks were under consideration: minimization of the electron beam losses along accelerator",
        "providing of the stable electron beam pulse current",
        "adjustment of the electron beam position along accelerator and providing of the uniform electron beam distribution at the tungsten neutron generating target. The main results of the accelerator operation and methods of performance improve are described in the paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml020.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML021",
      "title": "Individual Acceptance Testing and Comprehensive Testing of NSC KIPT SCA Neutron Source Technological Systems and Equipment",
      "authors": [
        "A.Y. Zelinsky",
        "O.V. Bykhun",
        "I.M. Karnaukhov",
        "A. Mytsykov",
        "I. Ushakov",
        "NSC/KIPT",
        "Kharkov",
        "Ukraine",
        "INL",
        "Idaho Falls",
        "Idaho",
        "USA",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "During 2016-2017 the installation",
        "assembling and commissioning of the NSC KIPT SCA Neutron Source technological systems were completed. The facility was designed and developed by NSC KIPT of Ukraine in collaboration with ANL of USA. The construction of the neutron source facility was started in 2012. The neutrons of the subcritical assembly are generated by 100 MeV/ 100 kW electron beam uniformly distributed at the surface of the tungsten target. It is supposed that the facility will be used to perform basic and applied nuclear research",
        "produce medical isotopes",
        "and train nuclear specialists. The individual acceptance testing and comprehensive testing were conducted for the technological and engineering systems of the neutron source. The tests were performed in compliance with programs and methodologies agreed by the State Nuclear Regulatory Inspectorate of Ukraine. The testing results confirmed compliance of the equipment with technical specifications",
        "standards",
        "regulations and rules on nuclear and radiation safety and preparedness of these systems for trial operation with the KIPT neutron source. The trial operation of the NSC KIPT SCA 'Neutron Source' has been started."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml021.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML022",
      "title": "Application of Surface Plasmon Polaritons on Charged particle Beam Diagnostics",
      "authors": [
        "Z.G. Jiang",
        "D. Gupresenter",
        "Q. Gu",
        "M.H. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "In Recent years",
        "the Cherenkov light radiation transformed from surface plasmon polaritons has been found and proposed for a compact and adjustable light source. As the process is motivated by charged particle beam",
        "the characteristics of the light are not only related with the device but can also reflect certain characteristics of the beam. In this paper",
        "a beam position and energy measurement method has been proposed based on the Cherenkov light radiation transformed from surface plasmon polaritons. Early-stage numerical and analytical investigations are also presented for a planar structure device."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml022.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML024",
      "title": "Monoenergetic Beam Generated by Laser Accelerator at Peking University",
      "authors": [
        "K. Zhu",
        "J.E. Chen",
        "Y.X. Geng",
        "C. Li",
        "D.Y. Li",
        "Q. Liao",
        "C. Lin",
        "H.Y. Lu",
        "W.J. Ma",
        "Y.R. Shou",
        "Wu",
        "M.J. Wu",
        "X.H. Xu",
        "X.Q. Yan",
        "J.Q. Yu",
        "Y.Y. Zhao",
        "J.G. Zhu",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "An ultrahigh-intensity laser incident on a target sets up a very strong electrostatic field exceeding 100 GV/m",
        "it will few orders magnitude shrink down the traditional radio frequency accelerators. Whereas",
        "to build a real accelerator for routine operation",
        "many scientific and technical challenges for laser acceleration need to overcome before they could be applied to these applications. Recently A laser accelerator− Compact Laser Plasma Accelerator (CLAPA) is being built with a beam line to deliver proton beam with the energy of 1~15MeV",
        "energy spread of ¡À1% and 107-8 protons per pulse. The very high current proton beam is accelerated in laser ultrathin-foil interaction and transported by a beam line consisting of the electric quadruple and analyzing magnets. It makes sure the good beam qualities such as energy spread",
        "charge",
        "repeatability and availability of different energy",
        "which means that for the first laser acceleration becomes a real laser accelerator. With the development of high-rep rate PW laser technology",
        "we can now envision a compact beam therapeutic machine of cancer treatment in the near future soon."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml024.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML025",
      "title": "Operation of an RF Modulated Thermionic Electron Source at TRIUMF",
      "authors": [
        "F. Ames",
        "K. Fong",
        "B. Humphries",
        "S.R. Koscielniak",
        "A. Laxdal",
        "Y. Ma",
        "T. Planche",
        "S. Saminathan",
        "E. Thoeng",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "ARIEL (Advanced Rare IsotopE Laboratory) at TRIUMF will use a high-power electron beam to produce radioactive ion beams via photo-fission. The system has been designed to provide up to 10 mA of electrons at 30 MeV. The electron source delivers electron bunches with charge up to 16 pC at a repetition frequency of 650 MHz at 300 keV. The main components of the source are a gridded dispenser cathode (CPI - Y845) in an SF6 filled vessel and an in-air HV power supply. The beam is bunched by applying DC and RF fields to the grid. A macro pulse structure can be applied by additional low frequency modulation of the RF signal. This allows adjusting the average beam current by changing the duty factor of the macro pulsing. Unique features of the gun are its cathode/anode geometry to reduce field emission",
        "and transmission of RF modulation via a dielectric (ceramic) waveguide through the SF6. The source has been installed and fully commissioned to a beam power up to 1 KW and tests with accelerated beams have been performed. Measurements of the beam properties and results from the commissioning and operational experiences of the source will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml025.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML027",
      "title": "Longitudinal and Transverse Wakefields Simulations and Studies in Dielectric-Coated Circular Waveguides",
      "authors": [
        "Rome University La Sapienza",
        "Roma",
        "Italy",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "G. Castorina",
        "D. Francescone",
        "M. Marongiupresenter",
        "M. Migliorati",
        "A. Mostacci",
        "L. Palumbo",
        "Sapienza University of Rome",
        "Rome",
        "Italy",
        "In recent years",
        "there has been a growing interest and rapid experimental progress on the use of e.m. fields produced by electron beams passing through dielectric-lined structures and on the effects they might have on the drive and witness bunches. Short ultra-relativistic electron bunches can excite very intense wakefields",
        "which provide an efficient acceleration through the dielectric wakefield accelerators (DWA) scheme with higher gradient than that in the conventional RF LINAC. These beams can also generate high power narrow band THz coherent Cherenkov radiation. These high gradient fields may create strong instabilities on the beam itself causing issues in plasma acceleration experiments (PWFA)",
        "plasma lensing experiments and in recent beam diagnostic applications. In this work we report the results of the simulations and studies of the wakefields generated by electron beams at different lengths and charges passing on and off axis in dielectric-coated circular waveguides. We also propose a semi-analytical method to calculate these high gradient fields without resorting to time consuming simulations."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml027.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML028",
      "title": "Genetic Algorithms for Machine Optimization in the Fair Control System Environment",
      "authors": [
        "W. Geithner",
        "Z. Andelkovic",
        "S. Appel",
        "O. Geithnerpresenter",
        "F. Herfurth",
        "S. Reimann",
        "G. Vorobjev",
        "GSI",
        "Darmstadt",
        "Germany",
        "emarsys",
        "Vienna",
        "Austria",
        "Due to the massive parallel operation modes at the GSI accelerators",
        "a lot of accelerator setup and re-adjustment have to be made by the operators during a beam time. With the FAIR project the complexity of the accelerator facility increases furthermore and for efficiency reasons it is recommended to establish a high level of automation for future operation. The PEP (parameter evolution project) has been launched at GSI operations group in 2017 to investigate the potential of a settings optimization using evolutionary Algorithms. The working proof of principle has already been tested at the Cryring injector. The latest improvements and the further Development of the Parameter Evolution Project will be shown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml028.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML031",
      "title": "Collective Acceleration of Laser Plasma in Non-stationary and Non-uniform Magnetic Field",
      "authors": [
        "A.A. Isaev",
        "C.I. Kozlovskij",
        "E.D. Vovchenko",
        "MEPhI",
        "Moscow",
        "Russia",
        "This paper presents the new experimental results concerning acceleration of deuterium ions extracted from laser plasma in the rapid-growing nonuniform magnetic field in order to initiate the nuclear reactions D(d",
        "n)3He and Т (d",
        "n)4He. In order to obtain plasma a laser that generates in Q-switched mode the pulses of infrared radiation (λ = 1.06 μm) with the energy W ≤ 0.85 J and duration of ≈10 ns. In the present study",
        "the velocity of a bunch of a laser plasma at a magnetic field induction rate of 3-108 T/s was experimentally measured",
        "and angular distributions of accelerated particle fluxes were measured in the range from 0 to 30 degrees. The maximum and mean ion velocities were determined by the time-of-flight technique. The proposed system allows the generation of neutrons",
        "including possibly thermonuclear ones",
        "on counterflows using two similar magnetic accelerators located coaxially",
        "facing each other. In this case the problem related to degradation of solid neutron-generating targets is resolved. There also occurs a possibility of fast accumulated running time of packed solid targets at using of deuteron-tritium laser targets."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml031.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML032",
      "title": "Using Deep Reinforcement Learning for Designing Sub-Relativistic Electron Linac",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml032.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML033",
      "title": "Towards a Free Electron Laser Using Laser Plasma Acceleration",
      "authors": [
        "A. Loulergue",
        "T. André",
        "I.A. Andriyash",
        "C. Benabderrahmane",
        "P. Berteaud",
        "F. Blache",
        "C. Bourassin-Bouchet",
        "F. Bouvet",
        "F. Briquez",
        "L. Chapuis",
        "M.-E. Couprie",
        "D. Dennetière",
        "Y. Dietrich",
        "J.P. Duval",
        "M. El Ajjouri",
        "T.K. El Ajjouri",
        "A. Ghaith",
        "C. Herbeaux",
        "N. Hubert",
        "M. Khojoyan",
        "C.A. Kitegi",
        "M. Labat",
        "N. Leclercq",
        "A. Lestrade",
        "O. Marcouillé",
        "F. Marteau",
        "P. N'gotta",
        "D. Oumbarek",
        "F. Polack",
        "P. Rommeluère",
        "M. Sebdaoui",
        "K.T. Tavakoli",
        "M. Valléau",
        "J. Vétéran",
        "C. de Oliveira",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "S. Bielawski",
        "C. Evain",
        "E. Roussel",
        "C. Szwaj",
        "PhLAM/CERLA",
        "Villeneuve d'Ascq",
        "France",
        "S. Corde",
        "J. Gautier",
        "J.-P. Goddet",
        "G. Lambert",
        "B. Mahieu",
        "V. Malka",
        "J.P. Rousseau",
        "S. Sebban",
        "K. Ta Phuoc",
        "A. Tafzi",
        "C. Thaury",
        "LOA",
        "Palaiseau",
        "France",
        "DESY",
        "Hamburg",
        "Germany",
        "Weizmann Institute of Science",
        "Physics",
        "Rehovot",
        "Israel",
        "Since the laser invention",
        "the advent of X-ray Free Electron Lasers (FEL) half a century later",
        "opens new areas for matter investigation. In parallel",
        "the spectacular development of laser plasma acceleration (LPA) with several GeV beam acceleration in an extremely short distance appears very promising. As a first step",
        "the qualification of the LPA with a FEL application sets a first challenge. Still",
        "energy spread and beam divergence do not meet the state-of-the-art performance of the conventional accelerators and have to be manipulated to fulfill the FEL requirement. We report here on the undulator spontaneous emission measured after a transport manipulation electron beam line",
        "using variable permanent magnet quadrupoles of variable strength for emittance handing and a demixing chicane equipped with a slit for the energy spread. Strategies of control electron beam position and dispersion have been elaborated. The measured undulator radiation provides an insight on the electron beam properties."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml033.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML034",
      "title": "Baseline Lattice for the Upgrade of SOLEIL",
      "authors": [
        "A. Loulergue",
        "P. Alexandre",
        "P. Brunelle",
        "O. Marcouillé",
        "A. Nadji",
        "L.S. Nadolski",
        "R. Nagaoka",
        "K.T. Tavakoli",
        "M.-A. Tordeux",
        "A. Vivoli",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Previous MBA studies converged to a lattice composed of 7BA-6BA with a natural emittance value of 200- 250 pm.rad range. Due to the difficulties of non-linear optimization in targeting lower emittance values",
        "a decision was made to symmetrize totally the ring with 20 identical cells having long free straight sections longer than 4 m. A 7BA solution elaborated by adopting the sextupole paring scheme with dispersion bumps originally developed at the ESRF-EBS",
        "including reverse-bends",
        "enabling an emittance of 72 pm.rad has been defined as the baseline lattice. The sufficient on-momentum dynamic aperture obtained allows to consider off-axis injection. The linear and nonlinear dynamic properties of the lattice along with the expected performance in terms of brilliance and transverse coherence are presented. In particular",
        "the beta functions tuned down to 1 m in both transverse planes at the center of straight sections allow matching diffraction limited photons up to 3 keV."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml034.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML041",
      "title": "FEBIAD Ion Source Development at TRIUMF-ISAC",
      "authors": [
        "B.E. Schultz",
        "F. Ames",
        "O.K. Kester",
        "P. Kunz",
        "A. Mjøs",
        "J.F. Sandor",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "The ISOL facility TRIUMF-ISAC utilizes a number of different ion sources to produce radioactive ion beams. Most isotopes are ionized using surface or resonant laser ionization",
        "but these techniques are prohibitively inefficient for species with high ionization energies",
        "such as noble gases and molecules. For these cases",
        "the Forced Electron Beam Induced Arc Discharge (FEBIAD) ion source can be used. The FEBIAD uses a hot cathode to produce electrons",
        "which are accelerated through a potential (< 200 V) into the anode volume. Isotopes entering the resulting plasma undergo impact ionization and are extracted. Efforts are under way to better understand the physics and operation of the FEBIAD",
        "using both theory and experiment. Recent measurements and simulations on the ISAC FEBIAD will be reported here."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml041.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML042",
      "title": "Integrating the Lorentz Force Law for Highly-Relativistic Particle-in-Cell Simulations",
      "authors": [
        "A.V. Higuera",
        "J.R. Cary",
        "Tech-X",
        "Boulder",
        "Colorado",
        "USA",
        "CIPS",
        "Boulder",
        "Colorado",
        "USA",
        "Integrating the Relativistic Lorentz Force Law for plasma simulations is an area of current research (*",
        "**",
        "***). In particular",
        "recent research indicates that interaction with highly-relativistic laser fields is particularly problematic for current integration techniques (****). Here is presented a special-purpose integrator yielding improved accuracy for highly-relativistic laser-particle interactions. This integrator has been implemented in the particle-in-cell code VSim",
        "and the authors present an accuracy and performance comparison with several particle push methods."
      ],
      "institutions": [],
      "abstract": "* http://aip.scitation.org/doi/abs/10.1063/1.4979989  ** https://arxiv.org/abs/1702.04486  *** https://arxiv.org/abs/1710.09164 **** http://aip.scitation.org/doi/abs/10.1063/1.4905523 reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml042.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML043",
      "title": "Optimization of Dielectric Laser-Driven Accelerators",
      "authors": [
        "C.P. Welsch",
        "M.G. Ibison",
        "Y. Wei",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "M.G. Ibison",
        "Y. Wei",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "TXUK",
        "Warrington",
        "United Kingdom",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Dielectric laser-driven accelerators (DLAs) utilizing large electric field from commercial laser system to accelerate particles with high gradients in the range of GV/m have the potential to realize a first particle accelerator ‘on a chip'. Dual-grating structures are one of the candidates for DLAs. They can be mass-produced using available nanofabrication techniques due to their simpler structural geometry compared to other types of DLAs. Apart from the results from optimization studies that indicate the best structures",
        "this contribution also introduces two new schemes that can help further improve the accelerating efficiency in dual-grating structures. One is to introduce a Bragg reflector that can boost the accelerating field in the channel",
        "the other applies pulse-front-tilt operation for a laser beam to help extend the interaction length."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml043.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML044",
      "title": "Operation of a Cryogenic Current Comparator with Nanoampere Resolution for Continuous Beam Intensity Measurements in the Antiproton Decelerator at CERN",
      "authors": [
        "M.F. Fernandes",
        "D. Alves",
        "T. Koettig",
        "A. Lees",
        "J. Tan",
        "CERN",
        "Geneva",
        "Switzerland",
        "M.F. Fernandes",
        "C.P. Welschpresenter",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "M. Schwickert",
        "T. Stöhlker",
        "GSI",
        "Darmstadt",
        "Germany",
        "IOQ",
        "Jena",
        "Germany",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Low-intensity charged particle beams are particularly challenging for non-perturbative beam diagnostics due to the small amplitude of induced electromagnetic fields. The Antiproton Decelerator (AD) and Extra Low ENergy Antiproton (ELENA) rings at CERN decelerate beams containing 107 antiprotons. An absolute intensity measurement of the circulating beam is essential to monitor the operational efficiency and to provide important calibration data for the antimatter experiments. This paper reviews the design of an operational Cryogenic Current Comparator (CCC) based on Superconducting QUantum Interference Device (SQUID) for current and intensity monitoring in the AD. Such a system has been operational throughout 2017",
        "relying on a stand-alone cryogenic infrastructure based on a pulse-tube cryocooler. System performance is presented and correlated with different working environments",
        "confirming a resolution in the nanoampere range."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml044.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML047",
      "title": "Design and Measurement of the X-Band Pulse Compressor for TTX",
      "authors": [
        "Y.L. Jiang",
        "H.B. Chen",
        "C. Cheng",
        "W. Gai",
        "J. Shi",
        "P. Wang",
        "Z.H. Wangpresenter",
        "X.W. Wu",
        "H. Zha",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "A radio frequency (RF) pulse compressor had been designed for the X-band (11.424 GHz) high power test stands at the Accelerator Laboratory of Tsinghua University. It is the SLED-I type pulse compressor",
        "which uses a high quality factor corrugated circular cavity to store the RF power. An RF polarizer couples two quadrature modes into the cavity so that the pulse compressor needs only one cavity. The cavity implements HE1-1-14 mode",
        "with the Q0 of 115",
        "000 and the coupling factor (β) of 3.23. The design and the microwave measurement before brazing of this pulse compressor are presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml047.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML051",
      "title": "Electron Acceleration by Plasma Wave in the Presence of a Transversely Propagated Laser with Magnetic Field",
      "authors": [
        "M. Yadav",
        "S. C. Sharma",
        "DELTECH",
        "New Delhi",
        "India",
        "D.N. Gupta",
        "M. Kaurpresenter",
        "University of Delhi",
        "Delhi",
        "India",
        "It has been revealed that a relativistic plasma wave",
        "having an extremely large electric field",
        "may be utilized for the acceleration of plasma particles. The large accelerating field gradient driven by a plasma wave is the basic motivation behind the acceleration mechanism. Such a plasma wave can be excited by a single laser in the form wakefield in laser-plasma interactions. In this paper",
        "we study the enhancement of electron acceleration by plasma wave in presence of a laser* propagated perpendicular to the propagation of the wake wave. Electrons trapped in the plasma wave are effectively accelerated by the additional field of the laser combined with wakefield. The additional resonance provided by the laser field contributes to the large energy gain of electrons during acceleration. The resonant enhancement of electron acceleration has been validated by single particle simulations**. The dependence of energy gain on laser intensity",
        "laser spot size",
        "initial electron energy",
        "and electron trajectories have been investigated.",
        "* G. D. Tsakiris",
        "C. Gahn",
        "and V. K. Tripathi",
        "Phys. Plasmas 7",
        "3017 (2000)  ** Maninder Kaur",
        "and D. N. Gupta",
        "IEEE",
        "45",
        "p 2841 - 2847",
        "(2017)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml051.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML052",
      "title": "Excitation of Plasma Wave by Lasers Beating in a Collisional and Mild-Relativistic Plasma",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml052.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML053",
      "title": "Computational Screening for Low Emittance Photocathodes",
      "authors": [
        "J.T. Paul",
        "R.G. Hennig",
        "University of Florida",
        "Gainesville",
        "Florida",
        "USA",
        "I.V. Bazarov",
        "A. Galdi",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "S.S. Karkare",
        "H.A. Padmore",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The majority of photocathode materials in use in accelerator applications have been discovered empirically through trial and error with little guidance from material science calculations. Alternatively",
        "one can envision a process which is heavily guided by computational search using latest advances in density functional theory (DFT). In this work",
        "the MaterialsProject database is searched for potential single crystal photocathodes that would be suitable for ultralow emittance beam production. The materials in the database are initially screened on the basis of experimental practicality. Following this",
        "the expected emittance is calculated from the DFT computed band structures for the pre-screened materials using the conservation of energy and transverse momentum during photoemission. Based on such computational screening",
        "we provide a list of potential low emittance photocathode materials which can be investigated experimentally as high brightness electron sources."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml053.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML054",
      "title": "Design Studies of an S-Band Multipacting Electron Gun",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml054.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML055",
      "title": "Scaled Studies on Radio Frequency Sources for Megawatt-Class Ionospheric Heaters",
      "authors": [
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "Naval Research Laboratory (NRL)",
        "Washington",
        "USA",
        "S.H. Gold",
        "A. Ting",
        "NRL",
        "Washington",
        "USA",
        "The ionosphere plays a prominent role in the performance of critical civilian and military communication systems. The key instrument in Ionospheric Modification (IM) research is a powerful",
        "ground-based",
        "High Frequency (HF) source of electromagnetic waves known as a heater. With a mobile heater",
        "investigators would be able to conduct IM research at different latitudes without building a costly permanent installation. A new highly efficient Megawatt class of Radio Frequency sources is required to reduce the overall power demands on a fully deployable system. Such a source has been described previously*. Results of a scaled experiment",
        "using the electron beam produced by a gridded gun to drive an external lumped element circuit for high efficiency radio frequency generation is presented. The IOT gun produces an electron beam bunched at the driving frequency that is then collected by an external circuit for impedance matching to the load. Results showed that effects such as the internal resistance of the inductor and deflection of beam electrons by the induced RF voltages on the beam collector are important considerations to be included in the design of a practical device."
      ],
      "institutions": [],
      "abstract": "B.L. Beaudoin, T.M. Antonsen, J.A. Karakkad, A.H. Narayan, G.S. Nusinovich, K.J. Ruisardpresenter * B.L. Beaudoin, G.S. Nusinovich, G. Milikh, A. Ting, S. Gold, J.A. Karakkad, A.H. Narayan, D.B. Matthew, D.K. Papadopoulos, T.M. Antonsen Jr., Journal of Elec. Waves and Appl.,31,17,pp.1786, 2017. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml055.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML058",
      "title": "Recent Results from MICE on Multiple Coulomb Scattering and Energy Loss",
      "authors": [
        "University of Warwick",
        "Coventry",
        "United Kingdom",
        "Multiple Coulomb scattering and energy loss are well known phenomena experienced by charged particles as they traverse a material. However",
        "from recent measurements made by the MuScat collaboration",
        "it is known that the available simulation codes ("
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml058.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML059",
      "title": "Re-Commissioning the Front End Test Stand Negative Hydrogen Ion Source, Beam Transport and Interlocks",
      "authors": [
        "S.R. Lawrie",
        "R.E. Abel",
        "M. Dudman",
        "D.C. Faircloth",
        "A.P. Letchford",
        "J.H. Macgregor",
        "M. Perkins",
        "T. M. Sarmento",
        "R.C. Searle",
        "M. Whitehead",
        "T. Wood",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The front end test stand (FETS) is a demonstrator for a future high intensity",
        "high duty factor negative hydrogen (H') ion injector. With the radio-frequency quadrupole (RFQ) nearing installation",
        "the ion source has been re-commissioned in preparation for long-term operation. The 3 MeV beam exceeds the radio-activation energy of common engineering materials",
        "so radiation shielding has been erected. A new interlocking scheme has been signed-off which integrates the existing ion source high voltage area with the new shielding access points",
        "to ensure that the machine can operate safely during beam production. The existing vacuum arrangement has been extended to in-clude the RFQ and medium energy beam transport (MEBT) line. A new programmable logic controller (PLC) has been built to operate the entire vacuum chain. The ion source high voltage equipment has been upgraded to minimise both spark rate and intensity. A collimating aperture and Faraday cup have been installed after the low energy beam transport (LEBT) section to ensure the beam is well aligned for injection into the RFQ. Re-commissioning the ion source has given a rugged shakedown of all these new systems before beam is required for the RFQ."
      ],
      "institutions": [],
      "abstract": "*scott.lawrie@stfc.ac.uk reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml059.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML060",
      "title": "Virtual VELA-CLARA: The Development of a Virtual Accelerator",
      "authors": [
        "T.J. Price",
        "H.M. Castaneda Cortes",
        "D.J. Dunning",
        "J.K. Jonespresenter",
        "B.D. Muratori",
        "D.J. Scott",
        "B.J.A. Shepherd",
        "P.H. Williams",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "R.F. Clarke",
        "G. Cox",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A Virtual Accelerator (VA) has been developed to mimic the accelerators Versatile Electron Linear Accelerator (VELA) and Compact Linear Accelerator for Research and Applications (CLARA). Its purpose is to test control room applications",
        "run start-to-end simulations with multiple simulation codes",
        "accurately reproduce measured beam properties",
        "conduct 'virtual experiments'and gain insight into ‘hidden beam parameters'. This paper gives an overview into the current progress in constructing this VA",
        "detailing the areas of: developing a 'Virtual EPICS' control system",
        "using multiple simulation codes (both particle tracking and analytic)",
        "the development of a ‘Master Lattice' and the construction of a Python interface in which to run the VA."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml060.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML061",
      "title": "X-Band Low Q Cavity Beam Position Monitor Study",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml061.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML062",
      "title": "A Beam Based Method to Optimize the SBPM System",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml062.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML063",
      "title": "Micro-Bunched Beam Production at FAST for Narrow Band THz Generation Using a Slit-Mask",
      "authors": [
        "Sokendai",
        "Ibaraki",
        "Japan",
        "D.J. Crawford",
        "D.R. Edstrom",
        "J. Ruan",
        "J.K. Santucci",
        "T. Sen",
        "J.C.T. Thangaraj",
        "R.M. Thurman-Keup",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "We discuss simulations and experiments on creating micro-bunch beams for generating narrow band THz radiation at the Fermilab Accelerator Science and Technology (FAST) facility. The low-energy electron beamline at FAST consists of a photoinjector-based RF gun",
        "two L-band superconducting accelerating cavities",
        "a chicane",
        "and a beam dump. The electron bunches are lengthened with cavity phases set off-crest for better longitudinal separation and then micro-bunched with a slit-mask installed in the chicane. We carried out the experiments with 30 MeV electron beams and detected signals of the micro-bunching using a skew quadrupole magnet in the chicane. In this paper",
        "the details of micro-bunch beam production",
        "the detection of micro-bunching and comparison with simulations are described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml063.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML065",
      "title": "Preliminary Results of the Bunch Arrival-Time Monitor at SXFEL",
      "authors": [
        "J.G. Wang",
        "B. Liu",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "Based on an electro-optical intensity modulation detection scheme",
        "a Bunch Arrival-time Monitor (BAM) is under study at Shanghai soft X-ray Free Electron Laser (SXFEL) to meet the high-resolution requirements of the measurement of bunch arrival time. The first BAM is installed and is being tested at the SXFEL upstream of the first short undulator (modulator) near the seed laser injection point. In this paper",
        "we present the basic working principle",
        "the design of the BAM system and report the preliminary test results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml065.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML066",
      "title": "Filling Pattern Measurement System Upgrade in SSRF*",
      "authors": [
        "N. Zhang",
        "F.Z. Chenpresenter",
        "Y.M. Zhou",
        "SSRF",
        "Shanghai",
        "People's Republic of China",
        "Filling pattern affects various operation performance of a synchrotron light source. A new diagnostic beam charge monitor (BCM) with high bandwidth multi-channels digitizer was developed to perform bunch-by-bunch charge measurement and record filling pattern for SSRF storage ring. Signals picked up from button elec-trodes were sampled synchronously with RF frequency",
        "and IQ (In-phase and Quadrature phase) sampling meth-od was employed for noise-filtering and phase independ-ence calibration. Layout and evaluation experiment of the system are presented in this paper."
      ],
      "institutions": [
        "Funding: Work supported by National Natural Science Foundation of China (No.11575282 No.11375255 No.11305253)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml066.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML067",
      "title": "SXFEL Linac BPM System Development and Performance Evaluation",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml067.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML068",
      "title": "Upgrade of Bunch Phase Monitor at SSRF Storage Ring",
      "authors": [
        "Y.M. Zhou",
        "Y.B. Lengpresenter",
        "T. Wu",
        "N. Zhang",
        "SSRF",
        "Shanghai",
        "People's Republic of China",
        "Beam instability is a serious problem for physics in beam diagnosis technology. With regard to the evaluation of longitudinal phase oscillations during the transient injection process",
        "bunch-by-bunch phase measurement is a useful tool for studying the behavior of the refilled bunches. A new upgraded beam phase monitor system with 1.2GHz bandwidth PXI waveform digitizer has been developed at Shanghai synchrotron radiation source (SSRF). Bunch-by-bunch phase information",
        "retrieved from button pickup signals",
        "is calculated by the zero-crossing detection method with the best phase resolution of 0.4ps. The refilled bunches can be separated from the stored ones",
        "and the longitudinal offset of each refilled bunch has been measured. Several groups of experiments have been performed to verify the repeatability of bunch-by-bunch phase measurement",
        "and some results regarding refilled bunches will be discussed in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml068.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML069",
      "title": "The Control System Design of SCLF",
      "authors": [
        "Y.B. Yan",
        "J.G. Ding",
        "G.Y. Jiang",
        "Y.B. Lengpresenter",
        "SSRF",
        "Shanghai",
        "People's Republic of China",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "The high-gain free electron lasers have given scientists hopes for new scientific discoveries in many frontier research areas. The Shanghai Coherent Light Facility (SCLF) was proposed by the central government of China on April 2017",
        "which is a quasi-continuous wave hard X-ray free electron laser facility. The control system is responsible for the facility-wide device control",
        "data acquisition",
        "machine protection",
        "high level database or application",
        "as well as network and computing platform. It will be mainly based on EPICS to reach the balance between the high performance and costs of maintenance. The latest technology will be adopted for the high repetition rate data acquisition and feedback system. The details of the control system design will be reported in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml069.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML069",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML070",
      "title": "Point Spread Function Study of Quasi-Monochromatic X-Ray Pinhole Camera at SSRF",
      "authors": [
        "B. Gao",
        "H.J. Chen",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "J. Chen",
        "Y.B. Lengpresenter",
        "SSRF",
        "Shanghai",
        "People's Republic of China",
        "Since 2009 an X-ray pinhole camera that has been used to present the transverse beam size and emittance on diagnostic beam line of the storage ring at SSRF. The real beam size is a function of the image size of the CCD camera and point spread function (PSF) of the system. The performance of the measurement of the transverse electron beam size is given by the width of the PSF of X-ray pinhole camera. The contributions to the PSF width are the PSF of pinhole itself due to diffraction",
        "and the PSF of the screen and camera. An X-ray monochromatic system has been established to measure the PSF accurately",
        "and decrease the variation in the beam size between the theoretical values and the measured ones at SSRF. In this article",
        "both calculated and measured PSF of quasi-monochromatic X-ray pinhole camera will be presented in detail."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml070.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML070",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML071",
      "title": "Upgrade of Digital BPM Processor at DCLS and SXFEL",
      "authors": [
        "L.W. Lai",
        "F.Z. Chen",
        "Y.B. Lengpresenter",
        "T. Wu",
        "Y.B. Yan",
        "SSRF",
        "Shanghai",
        "People's Republic of China",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "A digital BPM processor has been developed at 2016 in SINAP for DCLS and SXFEL",
        "which are FEL facilities built in China. The stripline BPM and cavity BPM processors share the same hardware platform and firmware",
        "but the processing algorithms implemented in EPICS IOC on the ARM CPU are different. The capability of the ARM limits the processing speed to 10 bunches per second. Now the bunch rate of DCLS and SXFEL are going to increase from 10Hz to 50Hz. To meet the higher processing speed requirements",
        "the processor firmware and software are upgraded in 2017. All BPM signal processing algorithms are implemented in FPGA",
        "and EPICS IOC reads results only. After the upgrade",
        "the processing speed reach 120 bunches per second. And this is also a good preparation for future Shanghai Hard-X ray FEL",
        "which bunch rate is about 1MHz."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml071_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml071.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml071_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML071",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML072",
      "title": "Injection Comparison using Bunch-by-Bunch Beam Size Measurement System at SSRF",
      "authors": [
        "H.J. Chen",
        "J. Chen",
        "B. Gao",
        "Y.B. Lengpresenter",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "Injection transient process happens every 5-10 minutes in storage ring during normal top-up operating mode at SSRF",
        "which is a proper window for machine status and injection performance evaluation. In the recent year",
        "a bunch-by-bunch beam size measurement system has been implemented at SSRF",
        "which has the capability to offer transverse bunch-by-bunch position and size information and is a powerful tool for injection study. In this paper",
        "we summarize three injection study results from July 2017 to April 2018",
        "including betatron oscillation amplitude",
        "spectrum",
        "horizontal tune and damping time comparison. The oscillation amplitude and temporal behavior of recent injection are all better than results before contributed to the injection optimization work during maintenance in 2018 winter. In addition",
        "the principal component analysis method is also applied to further study the injection behavior in turn-by-turn or bunch-by-bunch direction to the refilled bucket."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml072_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml072.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml072_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML072",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML073",
      "title": "Measurement of the RF Reference Phase Stability in the SuperKEKB Injector LINAC",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml073.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML073",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML074",
      "title": "Image Reconstruction Technique Based on Coded Aperture Imaging for SuperKEKB X-ray Beam Size Monitor",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml074.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML074",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML075",
      "title": "MYRRHA Control System Development",
      "authors": [
        "R. Modic",
        "M. Pavleski",
        "T. Zagar",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "J. Belmans",
        "P. Della Faille",
        "D. Vandeplasschepresenter",
        "Studiecentrum voor Kernenergie - Centre d'Étude de l'énergie Nucléaire (SCK•CEN)",
        "Mol",
        "Belgium",
        "MYRRHA ADS (Accelerator Driven System)",
        "the prototype of a nuclear reactor driven by a particle accelerator",
        "is being realized through a staged approach. This paper will explore the Control System (CS) strategy for the current stage of the accelerator R&D",
        "where the goal is injector for the energies up to 5.9 MeV. Accelerator components are being delivered within international semi-industrial partnerships. Currently the RFQ",
        "MYRRHA's first RF structure",
        "is being introduced. It will be followed by the first Medium Energy Beam Transport ("
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml075.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML075",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML076",
      "title": "Design of Control System for Dual-Head Radiation Therapy",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml076.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML076",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML077",
      "title": "Status of the Machine Protection System for ARIEL e-linac",
      "authors": [
        "M. Alcorta",
        "D. Dale",
        "H. Hui",
        "S.R. Koscielniak",
        "K. Langton",
        "K. LeBlanc",
        "M. Rowe",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "The Advanced Rare Isotope & Electron Linac (ARIEL) facility at TRIUMF consists of an electron linear accelerator (e-linac) capable of currents up to 10 mA at an energy of 30 MeV",
        "giving a total available beam power of 300 kW. In addition",
        "the e-linac can be run in pulsed operation down to beam pulses of 5 μs",
        "up to CW. A Machine Protection System (MPS) is required to protect the accelerator from hazardous beam spills and must turn off the electron gun within 10 μs of detection. The MPS consists of two types of beam loss monitors",
        "a front-end beam loss monitor board developed at TRIUMF",
        "and EPICS-based controls to establish operating modes. A trip time of 10 μs has been demonstrated",
        "along with a 106 dynamic range and sensitivity down to 100 pA. This paper is focused on the current status of the beam loss monitor detection system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml077.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML077",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML078",
      "title": "Web-Based Control Room Applications at TRIUMF",
      "authors": [
        "C.B. Barquest",
        "P. M. Jung",
        "S. Kiy",
        "K.E. Lucow",
        "T. Planche",
        "S.D. Rädel",
        "B.E. Schultz",
        "D. Sehayek",
        "O. Shelbaya",
        "D. Tattan",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "M. Corwin",
        "S. Marcano",
        "UW/Physics",
        "Waterloo",
        "Ontario",
        "Canada",
        "Control room applications are programs that interface with control systems and beam physics models. These tools range from real-time diagnostic visualizations to post-processing data analysis. At TRIUMF",
        "the concept of web-based control room applications has been adopted to advance the capabilities of these applications and facilitate operations. This online model takes advantage of server-based continuous integration and a centralized middleware layer. Continuous integration of server-based applications allows for easy deployment and maintenance. A centralized middleware layer allows a single application to work for many different accelerator configurations. Some motivating examples of web-based applications currenly being developed are presented",
        "demonstrating this online approach to be an effective method for deploying applications for use in the control room and beyond."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml078.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML078",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML079",
      "title": "Multipole Tuning Algorithm for the CANREB HRS at TRIUMF",
      "authors": [
        "D. Sehayek",
        "R.A. Baartman",
        "C.B. Barquestpresenter",
        "J.A. Maloney",
        "M. Marchetto",
        "T. Planche",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "The TRIUMF CANadian Rare isotope facility with Electron Beam ion source (CANREB) High Resolution Separator (HRS) has been designed to separate rare isotopes with mass/charge differences of only one part in 20",
        "000 for beams with transverse emittances of 3 μm. To reach this resolution",
        "high-order aberrations must be corrected using a multipole corrector. From experience",
        "tuning such a multipole is very challenging. The unique geometry of our multipole motivated a novel tuning method based on determining the desired pole voltages directly from measured emmitance. This novel tuning algorithm is presented alongside a web application which has been developed in anticipation of the commissioning of the HRS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml079_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml079.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml079_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML079",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML080",
      "title": "Preliminary Results of a New High Brightness H− Ion Source Developed at TRIUMF",
      "authors": [
        "K. Jayamanna",
        "F. Ames",
        "Y. Bylinskiipresenter",
        "J.Y. Cheng",
        "M. Lovera",
        "M. Minato",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "This paper describes the preliminary results of a high brightness ion source developed at TRIUMF",
        "which is capable of producing a negative hydrogen ion beam (H−) of up to 5 mA of direct current. A 1.7 mm.mrad and 5 mm.mrad emittance(rms) is achieved for 500 uA and for 1 mA H-",
        "respectively. Characteristics as well as a brief description regarding extraction issues of the source to date are also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml080.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML080",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML081",
      "title": "Beam-Based Measurements of the ISAC-II Superconducting Heavy Ion Linac",
      "authors": [
        "S. Kiy",
        "R.E. Laxdal",
        "M. Marchetto",
        "S.D. Rädel",
        "O. Shelbaya",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "Preparation for experiments",
        "which typically run for one to two weeks in the ISAC-II facility at TRIUMF",
        "requires some amount of overhead",
        "limiting the efficiency of the facility. Efforts are underway to improve the ISAC-II linac model to reduce this overhead while also improving the quality of the delivered ion beam. This can be accomplished with beam-based measurements and corrections of alignment",
        "cavity gradients",
        "focal strengths",
        "and more. A review of the present state of the linac will be given",
        "including measured mis-alignments and other factors that affect the reproducibility of tunes. The outlook on expected improvements will also be summarized",
        "including progress on the automatic phasing of cavities with a focus on integration to the High Level Application platform being developed at TRIUMF. Lastly",
        "a summary will be given on the expected paradigm shift in the tuning approach taken: moving from re-active tuning by operators or beam delivery experts to pro-active measurements and investigations",
        "version-controlled tunes",
        "and continuous feedback from beam physicists."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml081_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml081.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml081_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML081",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML082",
      "title": "Reflected Power Based Extremum Seeking Control Algorithm to Tune the Resonance Frequency of Room Temperature Cavities",
      "authors": [
        "R. Leewe",
        "K. Fong",
        "Z. Shahriari",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "SFU",
        "Surrey",
        "Canada",
        "A sliding mode extremum seeking algorithm to tune the resonance frequency was implemented in two of TRIUMF's DTL tanks. The tuning algorithm searches for the minimum reflected power point and was developed to eliminate the highly temperature dependent phase measurement",
        "which was previously used to tune the resonance frequency. Short and long term measurement results show that the tuning algorithm compensates for the RF heating effect as well as for diurnal temperature variations. Reflected power measurements of TRIUMF's DTL tank 3 were taken for both cases of operating the phase based tuning system and the reflected power based tuning system",
        "with an outcome of a higher tuning accuracy of the newly developed system. Another advantage is a quick cavity start up time",
        "as the reflected power based system does not rely on a reference set point which has do be adjusted manually. The sliding mode extremum seeking control loop is currently commissioned in further room temperature cavities of the TRIUMF's ISAC I facility."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml082_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml082.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml082_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML082",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML083",
      "title": "Iterative Learning Control to Cancel Beam Loading Effect on Amplitude and Phase of the Accelerating Field",
      "authors": [
        "Z. Shahriari",
        "K. Fong",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "UBC",
        "Vancouver",
        "Canada",
        "Iterative learning control (ILC) is an open loop control strategy that improves the performance of a repetitive system through learning from previous iterations. ILC can be used to compensate for a repetitive disturbance like the beam loading effect in resonators. Assuming that the beam loading disturbance is identical for all iterations",
        "the learning law can be non-causal; it can anticipate the disturbance and preemptively counteract its effect. In this work",
        "we aim to use ILC to cancel beam loading effect on amplitude and phase. Feedback controllers are not fast enough for this purpose. A normal feed forward controller may not be sufficient as well if there is a difference between the feed forward signal and the beam loading current. Therefore",
        "the goal is to use ILC to adaptively cancel the beam loading effect."
      ],
      "institutions": [
        "Funding: This research is supported by TRIUMF through federal funding via a contribution agreement with the National Research Council of Canada."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml083_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml083.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml083_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML083",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML084",
      "title": "Validating the COBEA Algorithm at the DELTA Storage Ring",
      "authors": [
        "B. Riemann",
        "B.D. Isbarn",
        "S. Khan",
        "S. Koetterpresenter",
        "T. Weis",
        "DELTA",
        "Dortmund",
        "Germany",
        "Closed-Orbit Bilinear-Exponential Analysis (COBEA) is an algorithm to decompose monitor-corrector response matrices into (scaled) beta optics values",
        "phase advances",
        "scaled dispersion and betatron tunes. No explicit magnetic lattice model is required for COBEA - only the sequence of monitors and correctors along the beam path (no lengths",
        "no strengths approach). To obtain absolute beta values",
        "the length of one drift space can be provided as optional input. In this work",
        "the application of COBEA to the DELTA storage ring",
        "operated by TU Dortmund University",
        "is discussed",
        "and its results for betatron tunes and scaled dispersion are compared with those of conventional",
        "direct measurement methods. COBEA is also put in a historical perspective to other diagnostic algorithms. Improvements in the Python implementation of COBEA",
        "which is available as free software",
        "are presented. Due to COBEA being relatively modest regarding its requirements on input data respectively hardware",
        "it should be applicable to the majority of existing storage rings."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml084_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml084.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml084_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML084",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML085",
      "title": "Intelligent Controls for the Electron Storage Ring DELTA",
      "authors": [
        "DELTA",
        "Dortmund",
        "Germany",
        "In recent years",
        "artificial intelligence has become one of the buzzwords in the field of controlling",
        "monitoring and optimizing complex machines. Particle accelerators belong to this class of machines in particular. In accelerator controls one has to deal with a variety of time-varying parameters",
        "nonlinear dynamics as well as a lot of small",
        "compounding errors. Therefore",
        "to cope with these tasks and to achieve higher performance",
        "particle accelerators require new advanced strategies in controls and feedback systems. Machine learning through (deep) neural networks",
        "genetic algorithms",
        "swarm intelligence and adaptive controls are some of the proposed approaches. Increased computational capability and the availability of large data sets in combination with better theoretical understanding of new network architectures and training paradigms allow for promising approaches for novel developments. This report aims to discuss the state of the art techniques and presents ideas for possible applications of intelligent controls at the synchrotron radiation source DELTA."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml085_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml085.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml085_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML085",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML087",
      "title": "First ERL Operation of S-DALINAC and Commissioning of a Path Length Adjustment System",
      "authors": [
        "M. Arnold",
        "C. Burandt",
        "R. Grewepresenter",
        "J. Pforr",
        "N. Pietralla",
        "M. Steinhorst",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "C. Eschelbach",
        "M. Lösler",
        "Frankfurt University of Applied Sciences",
        "Frankfurt am Main",
        "Germany",
        "KPH",
        "Mainz",
        "Germany"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml087_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml087.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml087_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML087",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML088",
      "title": "Cavity Impedance Reduction Strategies During Multi Cavity Operation in the SIS100 High Intensity Hadron Synchrotron",
      "authors": [
        "D. Mihailescu Stoica",
        "D. Domont-Yankulova",
        "Technische Universität Darmstadt (TU Darmstadt",
        "RMR)",
        "Darmstadt",
        "Germany",
        "D. Domont-Yankulova",
        "H. Klingbeil",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "H. Klingbeil",
        "D.E.M. Lens",
        "GSI",
        "Darmstadt",
        "Germany",
        "The planned SIS100 heavy ion synchrotron at the GSI Helmholtzzentrum für Schwerionenforschung will possess twenty ferrite accelerating cavities in its final stage of extension. As at injection and at flat top during slow extraction of the planned acceleration cycles the RF voltage will be relatively low",
        "not all cavities will be active in this part of operation. It is important to analyse the impact of the inactive cavities on the overall RF voltage and subsequently their implication on the longitudinal particle dynamics. Classical approaches for reducing the beam impedance consist of active detuning of the cavities to pre-described parking frequencies. The fact that two out of ten buckets have to stay empty in all SIS100 scenarios is of particular interest as additional frequency components appear in the excitatory beam current",
        "which have to be considered when the cavity is detuned. Therefore multi-cavity particle tracking simulations",
        "consisting of twenty cavities and their attached LLRF control systems",
        "are carried out in order to analyse different possibilities to minimize the impact on the beam dynamics and emittance growth."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml088_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml088.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml088_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML088",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML089",
      "title": "Tuning of 3-tap Bandpass Filter During Acceleration for Longitudinal Beam Stabilization at FAIR",
      "authors": [
        "B.R. Reichardt",
        "D. Domont-Yankulova",
        "Technische Universität Darmstadt (TU Darmstadt",
        "RMR)",
        "Darmstadt",
        "Germany",
        "D. Domont-Yankulova",
        "H. Klingbeil",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "H. Klingbeil",
        "D.E.M. Lens",
        "GSI",
        "Darmstadt",
        "Germany",
        "During acceleration in the heavy-ion synchrotrons SIS18/SIS100 at GSI/FAIR longitudinal beam oscillations are expected to occur. To reduce longitudinal emittance blow-up",
        "dedi- cated LLRF beam feedback systems are planned. To date",
        "damping of longitudinal beam oscillations has been demon- strated in SIS18 machine experiments with a 3-tap filter controller (e.g. *)",
        "which is robust in regard to control pa- rameters and also to noise. On acceleration ramps the control parameters have to be adjusted to the varying synchrotron frequency. Previous results from beam experiments at GSI indicate that a proportional tuning rule for one parameter and an inversely proportional tuning rule for a second parameter is feasible",
        "but the obtained damping rate may not be opti- mal for all synchrotron frequencies during the ramp. In this work",
        "macro-particle simulations are performed to evaluate",
        "whether it is sufficient to adjust the control parameters pro- portionally (inversely proportionally) to the change in the linear synchrotron frequency",
        "or if it is necessary to take more pa- rameters",
        "such as bunch-length and synchronous phase",
        "into account to achieve stability and a considerable high damping rate for excited longitudinal dipole beam oscillations. This is done for single- and dual-harmonic acceleration ramps.",
        "* H. Klingbeil et al.",
        "\"A Digital Beam-Phase Control System for Heavy-Ion Synchrotrons\"",
        "in IEEE Transactions on Nuclear Science",
        "vol. 54",
        "no. 6",
        "pp. 2604-2610",
        "Dec. 2007."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml089_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml089.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml089_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML089",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML090",
      "title": "Optical Beam Loss Monitors Based on Fibres for the CLARA Phase 1 Beam-Line",
      "authors": [
        "A.S. Alexandrova",
        "L.J. Devlin",
        "V. Tzoganis",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "A.D. Brynes",
        "F. Jackson",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A.D. Brynes",
        "F. Jackson",
        "V. Tzoganis",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "E. Effinger",
        "E.B. Holzer",
        "CERN",
        "Geneva",
        "Switzerland",
        "Fibre based Optical Beam Loss Monitors (oBLMs) are on-line devices used in-situ to measure losses along a beam-line. The technology is based on the detection of Cherenkov radiation",
        "produced inside quartz fibres placed alongside the beampipe",
        "from the interaction of secondary showers generated from losses hitting the vacuum pipe. This contribution presents ongoing developments of an oBLM system installed along the Compact Linear Accelerator for Research and Applications (CLARA). The oBLM system consists of 4 channels which allows for sub-metre loss resolution with two dimensional coverage along the entirety of the beam line",
        "as opposed to conventional localised BLM systems. The system was first commissioned to measure dark current from the injector. The ability of the system to locate longitudinal positions of known beam loss locations has also been measured and has shown excellent agreement. We present measurements acquired from the detector during regular operation and during dedicated beam tests. We also discuss the incorporation of the monitor into the accelerator diagnostics system and its use in assisting accelerator characterisation and performance."
      ],
      "institutions": [
        "Funding: Work supported by STFC Cockcroft Institute core Grant No. ST/G008248/1"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml090_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml090.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml090_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML090",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML091",
      "title": "Design of a High Gradient 60 GHz Dielectric Accelerating Structure",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml091_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml091.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml091_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML091",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML092",
      "title": "Electromagnetic and Mechanical Design of High Gradient S-Band Accelerator in TTX",
      "authors": [
        "D.Z. Cao",
        "H.B. Chen",
        "Y. C. Du",
        "W. Gai",
        "W.-H. Huang",
        "J. Shi",
        "C.-X. Tang",
        "P. Wang",
        "H. Zha",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "Thomson scattering x-ray source is an essential scien-tific research tool in x-ray imaging technology for vari-ous fields. Upgrading plan of replacing the 3-meter S-band linac with a shorter structure operating at higher gradient in Tsinghua Thomson scattering X-ray source (TTX) is undergoing so far",
        "aiming to enhance the accel-erating gradient from 15 MV/m to 30 MV/m. Detailed parameters of couplers and mechanical design of acceler-ation structure are presented in this work."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml092_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml092.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml092_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML092",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML093",
      "title": "New Fast Kicker Results from the Muon g-2 E-989 Experiment at Fermilab",
      "authors": [
        "The University of Texas at Austin",
        "Austin",
        "Texas",
        "USA",
        "D. Barak",
        "C.C. Jensen",
        "G.E. Krafczyk",
        "R.L. Madrak",
        "H. Nguyen",
        "H. Pfeffer",
        "M. Popovic",
        "J.C. Stapleton",
        "C. Stoughton",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "A.T. Chapelain",
        "A.A. Mikhailichenko",
        "D. L. Rubin",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "CENPA",
        "Seattle",
        "Washington",
        "USA",
        "UMiss",
        "University",
        "Mississippi",
        "USA",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "We describe the installation",
        "commissioning",
        "and characterization of the injection kicker system for the E-989 experiment at Fermilab for a precision measurement of the muon anomalous magnetic moment. Control and monitoring systems have been implemented to acquire and record the waveforms of each kicker pulse",
        "and measurements of various kicker system observables were recorded in the presence of the 1.45 T g-2 storage ring magnetic field. These monitoring systems are necessary to understand the systematic contribution to the measurement of the precession frequency. We examine the dependence of muon capture to kicker field predictions."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml093_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml093.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml093_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML093",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML094",
      "title": "New Methods for Dispersion Measurement and Correction for 12 GeV CEBAF",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "This paper discusses methods for dispersion measurement and correction for the Continuous Electron Beam Accelerator Facility (CEBAF) for the 12GeV era. New methods will be compared with methods used during the 6GeV era. New software tools which implement the new methods will be discussed",
        "along with a method for automating dispersion measurement and correction. New dispersion measurement and correction methods and tools are being implemented to provide more deterministic results and to reduce machine setup time."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml094_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml094.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml094_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML094",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML095",
      "title": "Improvement of Wire-Stretching Technique to the RF Measurements of E-Center and Multipole Field for the Dipole Cavities",
      "authors": [
        "G.-T. Park",
        "J. Guo",
        "H. Wang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "B. P. Xiaopresenter",
        "T. Xin",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "After the first publication* of wire-stretching technique from its principle to measure the electrical center of a deflecting cavity",
        "more refinements of this techniques including the review of its analytical and simulation results",
        "RF circuit improvement to improve the signal to noise ratio and its application to other cavities have been developed. These applications include the electrical center measurements for the LHC RFD and DQW crabbing cavity prototypes",
        "multi-frequency harmonic kicker cavity for JLEIC electron cooler**",
        "TE011 cavity developed for the beam magnetization measurement***",
        "and a separator cavity at BNL****. Further development of measurement calibration",
        "error reduction",
        "alignment of cavity installation to the machine beam line",
        "and multipole field analysis for the beam dynamics will be presented.",
        "*H. Wang",
        "Proceedings of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml095_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml095.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml095_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML095",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML096",
      "title": "A Non-Invasive Magnetic Momentum Monitor Using a TE011 Cavity",
      "authors": [
        "J. Guo",
        "J. Henry",
        "M. Poelker",
        "R.A. Rimmerpresenter",
        "R. Suleiman",
        "H. Wang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The Jefferson Lab Electron-Ion Collider (JLEIC) design relies on cooling of the ion beam with bunched electron beam. The bunched beam cooler complex consists of a high current magnetized electron source",
        "an energy recovery linac",
        "a circulating ring",
        "and a pair of long solenoids where the cooling takes place. A non-invasive real time monitoring system is highly desired to quantify electron beam magnetization. The authors propose to use a passive copper RF cavity in TE011 mode as such a monitor. In this paper",
        "we will show the mechanism and scaling law of this device",
        "as well as the design and testing results of the prototype cavity."
      ],
      "institutions": [
        "Funding: Authored by Jefferson Science Associates, LLC with Laboratory Directed Research and Development funding, under U.S. DOE Contract No. DE-AC05-06OR23177."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml096_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml096.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml096_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML096",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML098",
      "title": "Design of Beam Profile Monitor Used at the Xi'an Proton Application Facility (XiPAF)",
      "authors": [
        "D. Wang",
        "Z.M. Wang",
        "State Key Laboratory of Intense Pulsed Radiation Simulation and Effect",
        "Northwest Institute of Nuclear Technology",
        "Shannxi",
        "People's Republic of China",
        "NINT",
        "Xi'an",
        "People's Republic of China",
        "P.F. Mapresenter",
        "Y.G. Yang",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "Tsinghua University",
        "Beijing",
        "People's Republic of China",
        "A pixel ionization chamber for beam profile monitor (BPrM) is designed and manufactured by a new technology .The detector will be installed on the beam line just upstream of the target device of XiPAF. It has many advantages such as high resolution",
        "high radiation hardness and it can work as a real-time monitor to show the distribution of the delivered relative dose. The physics design and construction of the detector are described in this paper",
        "and its performances are tested offline."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml098_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml098.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml098_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML098",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML099",
      "title": "Phase Extraction and Stabilization for Coherent Pulse Stacking",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml099_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml099.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml099_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML099",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML100",
      "title": "A High Voltage Feedforward Subsystem of Low Level RF System for the High Power RF System",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml100_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml100.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml100_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML100",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML101",
      "title": "A Novel Double Sideband-Based Phase Averaging Line for Phase Reference Distribution System",
      "authors": [
        "Z.Y. Lin",
        "Y.-C. Du",
        "W.-H. Huang",
        "Z. Panpresenter",
        "C.-X. Tang",
        "C.-X. Tang",
        "Y.L. Xu",
        "J. Yang",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Coaxial cable based solution is one of the most important scheme in Phase Reference Distribution System. A novel double sideband-based phase averaging line has been developed in Tsinghua accelerator lab. The sender chassis generates the 2856 MHz signal as the forward signal and receives the 2856 MHz signal and the reflected double sideband signal from the receiver. The forward signal is phase-locked with the reference signal",
        "and the forward signal and the sideband signal are adjusted by the FPGA virtual delay line. The preliminary experiments result shows the phase stability can achieve about 1% by signal distorted by the phase shifter."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml101.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML101",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML102",
      "title": "Field and Cost Optimization of a 5 T/m Normal Conducting Quadrupole for the 10-MeV Beam Line of the eLINAC of the Mexican Particle Accelerator Community",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml102.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML102",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML106",
      "title": "Electron Microscopy Inspired Setup for Single-Shot 4-D Trace Space Reconstruction of Bright Electron Beams",
      "authors": [
        "J. Giner Navarro",
        "D.B. Cesarpresenter",
        "P. Musumeci",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "R.W. Aßmann",
        "B. Marchetti",
        "D. Marx",
        "DESY",
        "Hamburg",
        "Germany",
        "In the development of low charge",
        "single-shot diagnostics for high brightness electron beams",
        "Transmission Electron Microscopy (TEM) grids present certain advantages compared to pepper pot masks due to higher beam transmission. In this paper",
        "we developed a set of criteria to optimize the resolution of a point projection image. However",
        "this configuration of the beam with respect to the grid and detector positions implies the measurement of a strongly correlated phase space which entails a large sensitivity to small measurement errors in retrieving the projected emittance. We discuss the possibility of an alternative scheme by inserting a magnetic focusing system in between the grid and the detector",
        "similar to an electron microscope design",
        "to reconstruct the phase space when the beam is focused on the grid."
      ],
      "institutions": [
        "Funding: This work has been partially supported by the National Science Foundation under Grant No. 1549132 and Department of Energy under award No. DE-SC0009914."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml106_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml106.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml106_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML106",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML107",
      "title": "Steering Optimizations for the University of Maryland Electron Ring",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml107_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml107.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml107_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML107",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML108",
      "title": "Distributed I/O System Based on Ethernet POWERLINK Under the EPICS Architecture",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml108_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml108.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml108_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML108",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML109",
      "title": "Control System Design for Front End Devices of IRFEL",
      "authors": [
        "S. Xu",
        "G. Liu",
        "Y. Song",
        "X.K. Sunpresenter",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "An Infrared Free Electron Laser Light (IRFEL) is being constructed at National Synchrotron Radiation Laboratory. IRFEL consists of e-gun",
        "accelerating tube",
        "microwave",
        "klystron",
        "power supply",
        "vacuum",
        "resonator",
        "undulator",
        "beam diagnosis",
        "cooling water and other devices. The development of the control system for the front end devices of IRFEL is based on EPICS. This paper will introduce the hardware system design",
        "Input Output Controller application",
        "Operation Interface",
        "data archiving and retrieval."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml109_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml109.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml109_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML109",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML110",
      "title": "EPICS Driver for Siemens CP1616 Communication Module",
      "authors": [
        "Z. Huang",
        "G. Liu",
        "Y. Song",
        "X.K. Sunpresenter",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Siemens communication module CP1616 is a high-performance PROFINET controller",
        "which can support both Real-time (RT) and Isochronous Real-Time (IRT) communication. Experimental Physics and Industrial Control System (EPICS) is a wildly used distributed control system in large scientific devices. In order to integrate PROFINET protocol into EPICS environment",
        "we developed this driver based on CP1616 and established the prototype system. This paper will describe the design of EPICS driver for CP1616 and the test result of the prototype system."
      ],
      "institutions": [
        "Funding: Work supported by National Natural Science Foundation of China (11375186)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml110_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml110.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml110_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML110",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML111",
      "title": "Test of the Tune Measurement System Based on BBQ at HLS-II Storage Ring",
      "authors": [
        "L.T. Huang",
        "F.L. Gao",
        "P. Lu",
        "B.G. Sun",
        "H.Q. Wang",
        "J.G. Wang",
        "Q. Wang",
        "F.F. Wu",
        "Y.L. Yangpresenter",
        "T.Y. Zhou",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "The HLS-II storage ring is a crucial part of Hefei Light Source. Tune is one of the most important parameters of the electron storage ring",
        "of which the tune measurement system is an integral component. In this paper",
        "the design of a new tune measurement system based on BBQ (base band tune)",
        "is presented. Some experiments are performed to test this system. The new system is compared with the original system and the TBT (turn-by-turn) method respectively. The obtained results illustrate higher accuracy and higher stability for the new system. A new approach of calculating the betatron oscillation amplitude is proposed",
        "and the betatron oscillation amplitudes in the normal running stage for the HLS-II storage ring are estimated at 95 nm (horizontal) and 60 nm (vertical)."
      ],
      "institutions": [
        "Funding: Supported by the National Science Foundation of China (Grant No. 11705203, 11575181)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml111_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml111.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml111_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML111",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML112",
      "title": "Preliminary Design and Calculation of Button BPM for the HALS Storage Ring",
      "authors": [
        "F.F. Wu",
        "F.L. Gao",
        "L.T. Huang",
        "X.Y. Liu",
        "P. Lu",
        "B.G. Sun",
        "J.H. Wei",
        "Y.L. Yangpresenter",
        "T.Y. Zhou",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Huizhou University",
        "Huizhou",
        "People's Republic of China",
        "Button BPM is being designed for the HALS storage ring",
        "which is a diffraction-limited storage ring (DLSR) located at the NSRL in Hefei city. Since beam size is very small",
        "the required resolution of 50 nm for beam position measurement need to be obtained. The parameters of the HALS Button BPM are initially determined. According to theoretical formulas",
        "electrode induced signal is calculated and the relationship between electrode induced signal and beam current is obtained. Signal to noise ratio(SNR)of the HALS Button BPM is calculated with different beam current when the required resolution is 50 nm. The results show that the SNR is well when beam current is very low. In addition",
        "the effects of BPM RF frequency and button electrode radius on SNR are analyzed."
      ],
      "institutions": [
        "Funding: Supported by the National Science Foundation of China (Grant No.11705203, 11575181，11605202) and the National Key Research and Development Program of China(No. 2016YFA0402000)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml112_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml112.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml112_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML112",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML113",
      "title": "Design and Simulation of the Waveguide Coupler for the Cavity Beam Monitor",
      "authors": [
        "Q. Wang",
        "Q. Luo",
        "B.G. Sun",
        "F.F. Wu",
        "Y.L. Yangpresenter",
        "Z.R. Zhou",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "USTC",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "The waveguide coupling is an important way to extract the signals of the specific eigenmodes required. The design of the waveguide coupler",
        "including the waveguide-to-coaxial adapter behind it for the cavity bunch length monitor is presented. The influence of the dimension parameters is analyzed",
        "which offers the theoretical support for the design and application of cavity bunch length monitor or cavity beam position monitor (CBPM). A series simulation based on CST is performed to verify the feasibility",
        "and the simulation results show good performance."
      ],
      "institutions": [
        "Funding: Supported by The National Key Research and Development Program of China (2016YFA0401900), NSFC (11375178, 11575181) and the Fundamental Research Funds for the Central Universities (WK2310000046)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml113_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml113.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml113_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML113",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML115",
      "title": "Introduction of the Laser Intensity Measurement System for the FELiChEM",
      "authors": [
        "F.L. Gao",
        "L.T. Huang",
        "P. Lu",
        "B.G. Sun",
        "J.G. Wang",
        "F.F. Wu",
        "Y.L. Yangpresenter",
        "T.Y. Zhou",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "The FELiChEM is a new infrared free electron laser (IR-FEL) facility",
        "which is being built in the National Synchrotron Radiation Laboratory (NSRL) in Heifei",
        "China. The facility will provide continuously tunable pulsed laser radiation covering the mid-infrared (MIR) wavelength range from 2.5 to 50μm and the far-infrared (FIR) range from 40 to 200μm. The output macro pulsed laser width is 5-10μs and pulsed laser power is 2-10kW. In order to evaluate pulsed laser saturation time and FEL optical cavity losses",
        "the rise time and fall time of macro pulsed laser need to be measured. Laser intensity measurement system for the FELiChEM is being designed. This system is composed of optical system",
        "pyroelectric detector and electronics. Each module will be described in detail in this paper. The laser intensity measurement system was tested under offline and online conditions. The results showed that pulsed laser of 10μs width can be measured and the design requirement can be met with this system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml115_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml115.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml115_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML115",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML116",
      "title": "AutoTuner: A General Graphical User Interface for Automated Tuning",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "AutoTuner is a general graphical user interface (GUI) that we developed for automated tuning or online optimization. The GUI provides a convenient interface to select tuning knobs",
        "objectives",
        "and optimization algorithms and to change the tuning control parameters. Tuning setup can be created and saved for reuse. The progress of the tuning processing is plotted in real time. The tuning process can be paused",
        "aborted",
        "or resumed. We have tested the program for real-life accelerator tuning problems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml116_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml116.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml116_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML116",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML117",
      "title": "Study of the Impact of Linear Coupling on Off-Axis Injection",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "The next generation of storage ring light sources will likely operate with high linear coupling",
        "which could potentially prevent the use of off-axis injection as large horizontal oscillation of the injected beam is coupled to the vertical plane. We did experiments on the"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml117_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml117.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml117_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML117",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML118",
      "title": "The AWAKE Electron Spectrometer",
      "authors": [
        "F. Keeble",
        "M. Cascella",
        "J. A. Chappell",
        "L.C. Deacon",
        "S. Jolly",
        "M. Wing",
        "UCL",
        "London",
        "United Kingdom",
        "I. Gorgisyan",
        "S. Mazzoni",
        "CERN",
        "Geneva",
        "Switzerland",
        "P.L. Penna",
        "M. Quattri",
        "ESO",
        "Garching bei Muenchen",
        "Germany",
        "The AWAKE experiment at CERN aims to use a proton driven plasma wakefield to accelerate electrons from 10–20 MeV up to GeV energies in a 10 m plasma cell. We present the design of the magnetic spectrometer which will measure the electron energy distribution. Results from the calibration of the spectrometer's scintillator and optical system are presented",
        "along with a study of the backgrounds generated by the 400 GeV SPS proton beam."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml118_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml118.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml118_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML118",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML119",
      "title": "A Time-of-Flight Based Energy Measurement System for the LIGHT Medical Accelerator",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml119_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml119.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml119_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML119",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML120",
      "title": "Development of Coating Technique for Superconducting Multilayered Structure",
      "authors": [
        "R. Ito",
        "T. Nagata",
        "ULVAC",
        "Inc",
        "Chiba",
        "Japan",
        "H. Hayano",
        "T. Kubo",
        "T. Saeki",
        "KEK",
        "Ibaraki",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "Y. Iwashita",
        "R. Katayama",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "Utsunomiya University",
        "Utsunomiya",
        "Japan",
        "In order to increase the maximum acceleration gradient of SRF cavities",
        "S-I-S (superconductor-insulator-superconductor) multilayered structure theory has been proposed. We focused on NbN which has a higher superconducting transition temperature than Nb. Firstly",
        "we researched the optimal deposition condition for N2 gas reactive sputtering of NbN by using in-house inter-back type DC magnetron sputtering equipment. The critical condition for a thin film with strong crystalline orientation of NbN was identified. The superconducting transition temperature of the NbN thin film",
        "which were coated under the best condition",
        "was over 14 K. Secondly",
        "we tried making S-I-S multilayered samples that was composed of NbN/SiO2/Nb substrate. The coating condition for the NbN layer was determined based on the research results in a single layer. The SiO2 layer was deposited with a film thickness of 30 nm that was theoretically expected to be effective as barrier layer. We applied O2 gas reactive AC magnetron sputtering for coating. In this article",
        "the detailed results of the NbN single layer and multilayer film depositions are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml120_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml120.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml120_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML120",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML121",
      "title": "Compensation of Transient Beam Loading in Ramping Synchrotrons Using a Fixed Frequency Processing Clock",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml121_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml121.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml121_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML121",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML122",
      "title": "Beta-SRF - A New Facility to Characterize SRF Materials near Fundamental Limits",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml122_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml122.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml122_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML122",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML123",
      "title": "The ESR Barrier-Bucket LLRF System - Design and First Results",
      "authors": [
        "J. Harzheim",
        "D. Domont-Yankulova",
        "K. Groß",
        "H. Klingbeil",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "M. Frey",
        "H. Klingbeil",
        "D.E.M. Lens",
        "GSI",
        "Darmstadt",
        "Germany",
        "At GSI",
        "Darmstadt",
        "Germany",
        "a Barrier-Bucket (BB) RF System is currently under development for the Experimental Storage Ring (ESR). The system consists of two broadband RF cavities",
        "each driven by a solid state amplifier",
        "with the purpose to produce two voltage pulses per beam revolution. This will enable highly sophisticated longitudinal beam manipulations like longitudinal capture",
        "compression and decompression or stacking of the beam. For the LLRF System",
        "several requirements have to be fulfilled. Besides high standards concerning the pulsed gap signal quality (e.g. ringing <2.5%)",
        "the system has to provide the flexibility for adiabatic voltage ramp-up and adiabatic pulse shifting with high timing accuracy. A connection to the FAIR Central Control System (CCS) is necessary",
        "as amplitude and phase ramp data will be provided by the CCS. In this contribution",
        "the structure of the ESR BB LLRF system is presented together with experimental results from the first version of the system",
        "which will be installed in the ESR in March 2018."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml123_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml123.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml123_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML123",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML124",
      "title": "Design of Beam Position Fast-Correction Magnet Power Supply for HALS",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml124_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml124.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml124_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML124",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML125",
      "title": "Efficiency Analysis of High Average Power Linacs for Environmental and Industrial Applications",
      "authors": [
        "M. Shumail",
        "V.A. Dolgashev",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "We present comprehensive efficiency equations and useful scaling laws to optimally determine design parameters for high efficiency rf linacs. For the first time we have incorporated the parasitic losses due to the higher order cavity modes into the efficiency analysis of the standing wave (SW) and travelling wave (TW) accelerators. We have also derived the efficiency equations for a new kind of attenuation-independent-impedance travelling wave (ATW) accelerators where the shunt impedance can be optimized independent of the group velocity. We have obtained scaling laws which relate the rf to beam efficiency to the linac length",
        "beam aperture radius",
        "phase advance per cell",
        "and the type of accelerating structure: SW versus TW",
        "disk-loaded (DL) versus nose-cone (NC). We give an example of using these scaling laws to determine a feasible set of parameters for a 10 MeV",
        "10 MW linac with 97.2% efficiency."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml125_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml125.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml125_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML125",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML126",
      "title": "Design of High Efficiency High Power CW Linacs for Environmental and Industrial Applications",
      "authors": [
        "M. Shumail",
        "V.A. Dolgashev",
        "C.M. Markusen",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "We have used our accelerator design toolbox equations to design three high efficiency and high power CW accelerators for the environmental and medical applications. These are: 2MeV-1MW",
        "10MeV-10MW",
        "and 10MeV-1MW linacs. These are all 10 m long",
        "1.3 GHz",
        "π-mode standing wave structures with design efficiencies of 96.8",
        "97.4 and 86.5 %",
        "and optimal coupling coefficients of 32.9",
        "43.5",
        "and 7.45",
        "respectively. We present the detailed design parameters of these linacs. The study of single-bunch beam breakup for these linacs and the simulations results from ABCI are also included. The initial cavities are optimized according to the speed of the electron bunch to maximize the shunt impedance. The plots of peak surface fields on these cavities are also presented. We have also included a detailed thermal analysis of these linacs. Finally",
        "we present the results of ASTRA simulations of the three linacs with magnetic focusing. We have also included the complete design of rf-distributed-coupling manifold for the third linac along with the HFSS® simulation results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml126_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml126.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml126_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML126",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML127",
      "title": "Alignment and Installation for the FELiChEM project",
      "authors": [
        "W. Wang",
        "Zhang",
        "H.T. H.T",
        "X.Y. He",
        "D.R. Xu",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "FELiChEM is a new experimental facility under construction at the University of Science and Technology of China. There are more than one hundred important devices to construct it",
        "which core device is two free electron laser oscillators generating middle-infrared and far-infrared laser and covering the spectral range of 25-200μm. The optical cavity is an important component of oscillator which very sensitive to misalignment errors of the mirror",
        "due to its near-concentric and symmetric structure. High precision alignment and installation is necessary to ensure the smooth implementation of the FELiChEM project. Laser tracker and Level are used to install this devices according to the alignment control network. An efficient and high-precision alignment method based on autocollimator and photoelectric auto-collimator is used to align optical cavity of oscillator. This methods is proven to be effective and meet the tolerances by multiple means."
      ],
      "institutions": [
        "Funding: Work supported by National Natural Science Foundation of China (11705199) and China Postdoctoral Science Foundation (2017M622024)"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml127_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml127.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml127_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML127",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML128",
      "title": "Production and Secondary Electron Yield Test of Amorphous Carbon Thin Film",
      "authors": [
        "Y.X. Zhang",
        "X.Q. Ge",
        "S.W. Wangpresenter",
        "Y. Wang",
        "W. Wei",
        "B. Zhang",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Amorphous carbon (a-C) thin film applied to vacuum chambers of high-energy particle accelerators can decrease secondary electron yield（SEY）and suppress electron-cloud effectively. A dc magnetron sputtering apparatus to obtain a-C film has been designed. With the equipment",
        "a-C thin film can be deposited on the inner face of stainless steel pipes ultimately which is uniform and high-quality. Meanwhile",
        "it is found that a-C has a low SEY＜1.2 measured by the secondary electron emission measurement set-up in the National Synchrotron Radiation Laboratory. The result indicates that a-C is an ideal material for modern accelerators."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml128_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml128.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml128_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML128",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML129",
      "title": "Deposition and Characterization of TiZrHfV films by DC Magnetron Sputtering",
      "authors": [
        "X.Q. Ge",
        "T.L. Hepresenter",
        "X.T. Pei",
        "Y.G. Wang",
        "Y. Wang",
        "W. Wei",
        "B. Zhang",
        "Y.X. Zhang",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "The new generation of accelerators places higher demands on the surfaces of vacuum chamber materials. Search for low secondary electron yield (SEY) materials and an effective vacuum chamber surface treatment process",
        "which can effectively reduce the electronic cloud effect",
        "are important early works for the new generation of accelerators. In this work",
        "we revealed the SEY characteristics of Ti-Zr-Hf-V NEG films and Ti-Zr-V NEG films which were deposited on Si (111) substrates using direct current magnetron sputtering method. The surface morphology and surface chemical bonding information were collected by scanning electron microscopy (SEM) and X-ray photoelectron spectroscopy (XPS). With the same parameters",
        "the maximum SEY of Ti-Zr-Hf-V NEG films and Ti-Zr-V NEG films are 1.24 and 1.51",
        "respectively. These results are of great significance for the next-generation particle accelerators."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml129_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml129.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml129_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML129",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML130",
      "title": "Applications of a Distributed Beam Loss Monitor at the Australian Synchrotron",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml130_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml130.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml130_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML130",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML131",
      "title": "A NEW PRODUCTION PROCESS FOR UCx TARGETS FOR RADIOACTIVE ISOTOPE BEAMS AT TRIUMF",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml131_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml131.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml131_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML131",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML132",
      "title": "Cryogenic Performance of an SRF Deflecting Cavity Fabricated Using Alternative Techniques for the ARIEL eLinac",
      "authors": [
        "Victoria University",
        "Victoria",
        "B.C.",
        "Canada",
        "R.E. Laxdal",
        "Z.Y. Yaopresenter",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "A 650 MHz SRF deflecting mode cavity has been built and tested for use as a three-way beam separator in the ARIEL eLinac. The cavity operates in a TE-like mode",
        "and has been optimized for high shunt impedance with minimal longitudinal footprint. The device is the first SRF cavity to be fully fabricated in house at TRIUMF. The requirements of the cavity allowed for the development of low cost manufacturing techniques",
        "including the use of Reactor grade niobium and atmospheric pressure TIG welding. The cavity has been fabricated and tested at 4 K and 2 K",
        "obtaining a 4 K Qo of 4·108 at the operating voltage of 0.3 MV",
        "surpassing the goal voltage and quality factor required for operation. Results of the cryogenic tests of the cavity will be presented here."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml132_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml132.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml132_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML132",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML133",
      "title": "Design and Optimization of the Electron Gun",
      "authors": [
        "K. Huang",
        "T.L. Hepresenter",
        "Z.L. Ren",
        "D.R. Xu",
        "H. Xu",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Department of Information Engineering",
        "Anhui Economic Management Cadres' Institute",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Design of an energy-modified electron gun is of significance to do some research on the properties of Diamond-amplified cathode. Based on the design method of the Pierce electron gun",
        "the optimum parameters of the electron gun have been obtained using the Opera-3D program. And the beam waist's position",
        "the beam current",
        "the beam size and the beam emittance related to the electron bean energy was investigated in this paper."
      ],
      "institutions": [
        "Funding: Work supported by the National Nature Science Foundation of China under Grant Nos.11375176 and 10875118."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml133_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml133.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml133_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML133",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML134",
      "title": "Design of the Magnets of the HALS Project",
      "authors": [
        "Z.L. Ren",
        "C. Chen",
        "T.L. Hepresenter",
        "L. Wang",
        "X.Q. Wang",
        "H. Xu",
        "B. Zhang",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "The Hefei Advanced Light Source (HALS) is a future soft X-ray diffraction-limited storage ring at NSRL",
        "this project aims to improve the brilliance and coherence of the X-ray beams and to decrease the horizontal emittance. The lattice of the HALS ring relies on magnets with demanding specifications",
        "including combined function dipole-quadrupoles (DQs) with high gradients",
        "dipoles with longitudinal gradients (DLs)",
        "high gradient quadrupoles and strong sextupoles. The combined dipole-quadrupole design developed is between the offset quadrupole and septum quadrupole types. The longitudinal-gradient dipoles are permanent magnets. The quadrupoles and sextupoles rely on a more conventional design. All the magnets have been designed using POSSION",
        "Radia",
        "and OPERA-3D."
      ],
      "institutions": [
        "Funding: Work supported by the National Nature Science Foundation of China under Grant Nos.11375176 * hlxu@ustc.edu.cn ** zhbo@ustc.edu.cn"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml134_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml134.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml134_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML134",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML135",
      "title": "Design of the Combined Function Dipole-Quadrupoles (DQS) with High Gradients",
      "authors": [
        "Z.L. Ren",
        "C. Chen",
        "T.L. Hepresenter",
        "L. Wang",
        "X.Q. Wang",
        "H. Xu",
        "B. Zhang",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Combined dipole-quadrupoles (DQs) can be obtained with the design of tapered dipole or offset quadrupole. However",
        "the tapered dipole design can not achieve a high gradient field",
        "as it will lead to poor field quality in the low field area of the magnet bore",
        "and the design of offset quadrupole will increase the magnet size and power consumption. Finally",
        "the dipole-quadrupole design developed is between the offset quadrupole and septum quadrupole types. The dimensions of the poles and the coils of the low field side have been reduced. The 2D pole profile is simulated and optimized by using POSSION and Radia",
        "while the 3D modle using Radia and OPERA-3D. The end shimming and chamfer are modelled to meet the field uniformity requirement."
      ],
      "institutions": [
        "Funding: Work supported by the National Nature Science Foundation of China under Grant Nos.11375176 * hlxu@ustc.edu.cn **zhbo@ustc.edu.cn"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml135_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml135.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml135_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML135",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML136",
      "title": "Study of Secondary Electron Generation and Transport in Diamond",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml136_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml136.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml136_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML136",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML138",
      "title": "Efficiency and Error Analysis of the HALS Injection Scheme",
      "authors": [
        "Z.B. Sun",
        "G. Liu",
        "W. Liu",
        "F.L. Shang",
        "L. Shang",
        "W.B. Song",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Hefei Advanced Light Source (HALS) is a newly designed diffraction-limited storage ring.. The latest version of HALS has a 7BA lattice. One of the most important parts about HALS design is its injection system. Since conventional injection scheme is not suitable for DLSRs",
        "many new injection schemes are proposed",
        "including longitudinal injection scheme. In this paper",
        "we investigate the feasibility of longitudinal injection scheme for HALS. In order to evaluate the injection performance",
        "various errors have been considered. A series of tracking simulations are carried out and injection efficiency is obtained under different error levels."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml138_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml138.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml138_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML138",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THPML140",
      "title": "Radiation Monitoring System of HLSII",
      "authors": [
        "Lin",
        "H.S. Lin",
        "Y.Q. Cai",
        "S.P. Jiang",
        "Z.B. Sunpresenter",
        "Z.R. Zhou",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Monitoring of ionizing radiation of synchrotron radiation facility is very important for the safety of staff and users of the light source. Radiation monitoring system of HLSII has been built and the whole system consists of local radiation monitoring spots and central control system",
        "and a web-based monitoring dynamic release system. The local radiation monitoring spot consists of a high air pressure ionization type gamma detector and a BF3 counting tube neutron detector",
        "and the radiation data are calculated by microcontroller locally and acquired by the data server for further processing. The dynamic release system is integrated with EPICS interface and radiation safety interlock system. Other accelerator systems could obtain radiation data from the server and the interlock system is triggered by the radiation data to shut down the machine in case the radiation exceeds the safety threshold."
      ],
      "institutions": [
        "Funding: Supported by the National Science Foundation of China 11675170 By the Fundamental Research Funds for the Central Universities WK2310000056"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/thpml140_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/thpml140.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/thpml140_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-THPML140",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 107,
  "scrape_time": "2025-10-10 19:40:34"
}