{
  "session_info": {
    "id": "THZD",
    "name": "THZD - Hadron Accelerators",
    "url": "https://proceedings.jacow.org/napac2022/html/thzd.htm"
  },
  "papers": [
    {
      "paper_id": "THZD1",
      "title": "Instant Phase Setting in a Large Superconducting Linac",
      "authors": [
        "A.S. Plastun",
        "P.N. Ostroumov",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "The instant phase setting reduces the time needed to setup 328 radiofrequency cavities of the Facility for Rare Isotope Beams (FRIB) linac from 20 hours to 10 minutes. This technique uses a 1-D computer model of the linac to predict the cavities’ phases. The model has been accurately calibrated using the data of the 360-degree phase scans - a common procedure for phasing of linear accelerators. The model was validated by comparison with a conventional phase scan results. The predictions applied to the linac are then verified by multiple time-of-flight energy measurements and the response of the beam position/phase monitors (BPMs) to an intentional energy and phase mismatch. The presented approach not just reduces the time and the effort required to tune the FRIB accelerator for new experiments every couple of weeks",
        "but it also provides an easy recovery from cavity failures. It is beneficial for user facilities requiring high beam availability",
        "as well as for radioactive ion beam accelerators",
        "where quick time-of-flight energy measurement via the BPMs is not possible due to the low intensities of these beams."
      ],
      "institutions": [
        "Funding: This work is supported by the U.S. Department of Energy Office of Science under Cooperative Agreement No. DE-SC0000661, the State of Michigan, and Michigan State University."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/thzd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/thzd1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/thzd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-THZD1",
      "page_number": "885",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THZD2",
      "title": "Advances in the ATLAS Accelerator",
      "authors": [
        "M.P. Kelly",
        "C. Dickerson",
        "B.M. Guilfoyle",
        "M.R. Hendricks",
        "M. Kedzie",
        "T.B. Petersen",
        "T. Reid",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "The ATLAS Superconducting Linac at Argonne National Laboratory is a leading facility for nuclear reaction and structure studies",
        "providing ion beams over the full mass range to a community of users from the US and abroad. The technology of ATLAS has been continuously upgraded since commissioning in 1978 and has remained at the forefront of superconducting linac development",
        "especially for low-beta Linacs",
        "for more than four decades. We present an overview of the present state ATLAS superconducting technology",
        "the latest approaches for superconducting cavity cryomodules commissioned within the last 10 years and the outlook and potential impact of transformative new technologies to low-beta ion accelerators."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/thzd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/thzd2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/thzd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-THZD2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THZD3",
      "title": "Design of 3-GeV High-Gradient Booster for Upgraded Proton Radiography at LANSCE",
      "authors": [
        "Y.K. Batygin",
        "S.S. Kurennoy",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Increasing the proton beam energy from the present 800 MeV to 3 GeV will improve the resolution of the Proton Radiography Facility at the Los Alamos Neutron Science Center (LANSCE) by a factor of 10. It will bridge the gap between the existing facilities",
        "which covers large length scales for thick objects",
        "and future high-brightness light sources",
        "which can provide the finest resolution. Proton radiography requires a sequence of short beam pulses (~20 x 80 ns) separated by intervals of variable duration",
        "from about 300 ns to 1 to 2 μs. To achieve the required parameters",
        "the high gradient 3-GeV booster is proposed. The booster consists of 1.4 GHz buncher",
        "two accelerators based on 2.8 GHz and 5.6 GHz high-gradient accelerating structures and 1.4 GHz debuncher. Utilization of buncher-accelerator-debuncher scheme allows us to combine high-gradient acceleration with significant reduction of beam momentum spread. Paper discusses details of linac design and expected beam parameters."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/thzd3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/thzd3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/thzd3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-THZD3",
      "page_number": "891",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THZD4",
      "title": "Accelerating Structures for High-Gradient Proton Radiography Booster at LANSCE",
      "authors": [
        "S.S. Kurennoy",
        "Y.K. Batygin",
        "E.R. Olivas",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Increasing energy of proton beam at LANSCE from 800 MeV to 3 GeV improves radiography resolution ~10 times. We proposed accomplishing such an energy boost with a compact cost-effective linac based on normal conducting high-gradient (HG) RF accelerating structures. Such an unusual proton linac is feasible for proton radiography (pRad)",
        "which operates with short RF pulses. For a compact pRad booster at LANSCE",
        "we have developed a multi-stage design: a short L-band section to capture and compress the 800-MeV proton beam followed by the main HG linac based on S- and C-band cavities",
        "and finally",
        "by an L-band de-buncher [1]. Here we present details of development",
        "including EM and thermal-stress analysis",
        "of proton HG structures with distributed RF coupling for the pRad booster. A simple two-cell structure with distributed coupling is being fabricated and will be tested at the LANL C-band RF Test Stand.",
        "[1] S.S. Kurennoy",
        "Y.K. Batygin."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/thzd4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/thzd4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/thzd4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-THZD4",
      "page_number": "894",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THZD5",
      "title": "Modelling H⁻ Injection and Painting in Vertical and Horizontal FFAs Using OPAL",
      "authors": [
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "H− phase space painting using charge-exchange has been used in synchrotrons to inject and accumulate high intensity bunches of protons",
        "but has never been used in Fixed Field Accelerators (FFAs). In H− charge-exchange injection",
        "H− ions pass through a thin foil where the electrons are stripped from the ion leaving a proton. In combination with an appropriate dipole",
        "well-separated H− ion and proton beams converge at the foil in this non-Liouvillean process. This can be combined with painting of the phase space",
        "where the position of the injected beam is manipulated with respect to the circulating protons in order to inject beams having a specific profile in phase-space. In this paper the simulation of such injection is studied",
        "performed using the latest improvements in the OPAL code. Injection into a small test ring that is under development as part of the ISIS upgrade program is considered."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/thzd5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/thzd5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/thzd5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-THZD5",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THZD6",
      "title": "An 8 GeV  Linac as the Booster Replacement in the Fermilab Power Upgrade",
      "authors": [
        "D.V. Neuffer",
        "S.A. Belomestnykh",
        "M. Checchin",
        "D.E. Johnson",
        "S. Posen",
        "E. Pozdeyev",
        "V.S. Pronskikh",
        "A. Saini",
        "N. Solyak",
        "V.P. Yakovlev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Increasing the Main Injector (MI) beam power above ~1.2 MW requires replacement of the 8-GeV Booster by a higher intensity alternative. In the Project X era",
        "rapid-cycling synchrotron (RCS) and linac solutions were considered for this purpose. In this paper",
        "we consider the linac version that produces 8 GeV H− beam for injection into the Recycler Ring (RR) or Main Injector (MI). The linac takes ~1-GeV beam from the PIP-II Linac and accelerates it to ~2 GeV in a 650-MHz SRF linac",
        "followed by a 8-GeV pulsed linac using 1300 MHz cryomodules. The linac components incorporate recent improvements in SRF technology. Research needed to implement the high power SRF Linac is described."
      ],
      "institutions": [
        "Funding: Work supported by the Fermi National Accelerator Laboratory, managed and operated by Fermi Research Alliance, LLC under Contract No. DE-AC02-07CH11359 with the U.S. Department of Energy."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/thzd6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/thzd6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/thzd6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-THZD6",
      "page_number": "897",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:30:07"
}