{
  "session_info": {
    "id": "MOAH",
    "name": "MOAH - Oral Session 1",
    "url": "https://proceedings.jacow.org/sap2017/html/moah.htm"
  },
  "papers": [
    {
      "paper_id": "MOAH2",
      "title": "Generation of Strong Terahertz Radiation in Intense Laser-plasma Interactions",
      "authors": [
        "Institute of Physics",
        "Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "Recently Terahertz radiation from laser-produced plasmas has attracted much interest since plasmas can work at arbitrarily high laser intensity. However",
        "only few experiments with relativistic laser pulses are reported. We have studied strong THz radiation from solid targets driven by relativistic laser pulses. THz radiation with pulse energy of hundreds mJ/sr has been observed. In this talk",
        "we will concentrate on the THz generation due to coherent transition radiation of relativistic laser-driven electron beams when they pass the solid-vacuum boundary. Targets including mass-limited foils and layered metal-plastic targets are used to verify the radiation mechanism and characterize the radiation properties. Observations of THz emissions as a function of target parameters agree well with the formation-zone and diffraction model of transition radiation. Particle-in-cell simulations also well reproduce the observed characteristics of THz emissions. The present THz transition radiation enables not only a potential tabletop brilliant THz source",
        "but also a novel noninvasive diagnostic for fast electron generation and transport in laser-plasma interactions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/moah2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/moah2.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/moah2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-MOAH2",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOAH3",
      "title": "Recent Progress on Laser Plasma Physics and Advanced Accelerator Research at Tsinghua University",
      "authors": [
        "TUB",
        "Beijing",
        "People's Republic of China",
        "The main research theme of L2PA at Tsinghua University",
        "focuses on compact high-quality plasma accelerator and its derivative light sources. A 10-40MeV high-quality electron beam had been obtained by running the laser at 5TW peak power. Under certain conditions very low relative energy spread of <1% and extremely low absolute energy spread of 0.18MeV can be achieved. An ultrafast electron beam has been proposed and successfully used to take a snapshot of wakefield",
        "and the dedicated beam diagnostics for high brightness electron beams has been developed in plasma-based accelerators. The experiments for a plasma dechirper and external injection acceleration have also been demonstrated in a laser-plasma accelerator using a RF photocathode gun-based linac. On theory and simulation part",
        "several ideas on how to obtain high quality electron beams with extremely high brightness through wakefield acceleration will be discussed. A theoretical model on the phase space dynamics of ionization injection scheme has been derived",
        "and phase space matching for staging accelerator components using longitudinally tailored plasma profiles is proposed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/moah3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/moah3.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/moah3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-MOAH3",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 02:54:41"
}