{
  "session_info": {
    "id": "MOOBMH",
    "name": "MOOBMH - M2",
    "url": "https://proceedings.jacow.org/ECRIS2014/html/moobmh.htm"
  },
  "papers": [
    {
      "paper_id": "MOOBMH01",
      "title": "Periodic Beam Burrent Oscillations Driven By Electron Cyclotron Instabilities In ECRIS Plasmas",
      "authors": [
        "O.A. Tarvainen",
        "T. Kalvas",
        "H. A. Koivisto",
        "J.P.O. Komppula",
        "R.J. Kronholm",
        "J.P. Laulainen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "I. Izotov",
        "D. Mansfeld",
        "V. Skalyga",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "CERN",
        "Geneva",
        "Switzerland",
        "Experimental observation of cyclotron instabilities in electron cyclotron resonance ion source plasma operated in cw-mode is reported. The instabilities are associated with strong microwave emission and a burst of energetic electrons escaping the plasma",
        "and explain the periodic oscillations of the extracted beam currents. The instabilities are shown to restrict the parameter space available for the optimization of high charge state ion currents."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/moobmh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/moobmh01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/moobmh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-MOOBMH01",
      "page_number": "5",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOBMH02",
      "title": "Emittance Measurements For RIKEN 28 GHz SC-ECRIS",
      "authors": [
        "Y. Higurashi",
        "T. Nakagawa",
        "J. Ohnishi",
        "K. Ozeki",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "In 2013",
        "the intense beams of highly charged uranium ion (180euA of U35+",
        "230euA of U33+) were extracted from RIKEN SC-ECRIS. Following the success",
        "intense beam of U35+ ions was used for the RIBF experiment for 24 days without break. It is obvious that production of high-quality beam (smaller emittacne and good stability etc) is also important for RIKEN radio isotope beam factory (RIBF) project. For this reason",
        "in 2014",
        "we systematically measured the emittance and beam intensity of the highly charged uranium ions under various conditions (magnetic field configuration",
        "extracted beam intensity",
        "beam stability etc) to search the optimum condition. In these experiments",
        "we observed that the emittnce size is strongly dependent on the magnetic field configuration",
        "especially Bext. In this contribution",
        "we present the effect of the various parameters (magnetic field configuration",
        "extracted beam intensity",
        "beam stability etc) of the SC-ECRIS on the beam intensity and emittance. We also discuss its mechanism in detail."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/moobmh02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/moobmh02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/moobmh02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-MOOBMH02",
      "page_number": "10",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOBMH03",
      "title": "Frequency Tuning Effect On The Bremsstrahlung Spectra, Beam Intensity And Shape In An ECR Ion Source",
      "authors": [
        "G.O. Rodrigues",
        "D. Kanjilal",
        "N. Kumar",
        "K. Mal",
        "Y. Mathur",
        "IUAC",
        "New Delhi",
        "India",
        "VECC",
        "Kolkata",
        "India",
        "The effect of the frequency tuning on bremsstrahlung spectra",
        "beam intensity and shape in the 10 GHz",
        "Nanogan ECR ion source have been investigated. The main aim of this work was to study the effect on a lower frequency type of ECR source where the separation between various modes in the cavity is much larger. The warm and cold components of the electrons were observed to be directly correlated with the beam intensity enhancement in the case of Ar9+ but not so for O5+. However",
        "the warm electron component was much smaller than the cold component. The beam shapes of O5+ measured as a function of frequency showed a strong variation without hollow beam formation. Due to the use of an octupole magnetic structure in the Nanogan ECR source",
        "the quadrupolar structure of the ECR surface is modified with the frequency tuning. In general",
        "we have observed a strong absorption of microwave power at various frequencies whenever the reflection co-efficient showed a minimum value and the effect was seen stronger for the higher charge states. Details of the measurements carried out on the bremsstrahlung spectra",
        "beam intensity and shape are presented together with the results of simulations.",
        "* Effect of frequency tuning on bremsstrahlung spectra",
        "beam intensity",
        "and shape in the 10 GHz NANOGAN electron cyclotron resonance ion source",
        "Rev. Sci.Instrum. 85",
        "02A944 (2014)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/moobmh03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/moobmh03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/moobmh03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-MOOBMH03",
      "page_number": "15",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOBMH04",
      "title": "Emission Spectroscopy Diagnostic of Plasma Inside 2.45 GHz ECR Ion Source at PKU",
      "authors": [
        "Y. Xu",
        "J. Chen",
        "J.E. Chen",
        "Z.Y. Guo",
        "S.X. Peng",
        "H.T. Ren",
        "J.F. Zhang",
        "T. Zhang",
        "J. Zhao",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Graduate University",
        "Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "The 2.45 GHz permanent magnet electron cyclotron resonance ion source (PMECR) at Peking University (PKU) can produce 100 mA H+",
        "40 mA H2+ and 20 mA H3+ under different conditions",
        "but the physics processes and plasma characteristics within the discharge chamber are not very clear until now. Langmuir probe",
        "laser detachment",
        "absorption spectroscopy and optical emission spectroscopy are common approaches for diagnosing the plasma. Among those methods",
        "optical emission spectroscopy is a simple in situ one without disturbing the plasma. To better understand the plasma producing processes",
        "a new ion source with transparent quartz discharge chamber was designed at PKU so that plasma diagnostic can be performed through directly detecting the light generated within ECR zone by fiber optics. Collisional radiative (CR) model is utilized to calculate plasma parameters like electron density ne and electron temperature Te for non-equilibrium plasma in ECR ion source. The spectroscopy diagnosis platform has been constructed",
        "and preliminary results will be presented in this paper."
      ],
      "institutions": [
        "Funding: This work is supported by the National Science Foundation of China (Grant Nos. 11175009 and 91126004)."
      ],
      "abstract": "*Author to whom correspondence should be addressed. Electronic mail:  sxpeng@pku.edu.cn.",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/moobmh04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/moobmh04.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/moobmh04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-MOOBMH04",
      "page_number": "20",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:28:13"
}