{
  "session_info": {
    "id": "MOYLR",
    "name": "MOYLR - Invited Plenary - Session 2",
    "url": "https://proceedings.jacow.org/HB2014/html/moylr.htm"
  },
  "papers": [
    {
      "paper_id": "MOYLR04",
      "title": "Beam Dynamics Issues at the High Luminosity Polarized Collider RHIC",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Beam and spin dynamics issues of the first and only high luminosity polarized proton collider",
        "RHIC",
        "will be discussed. Opportunities to increase the beam polarization at the full energy of 255 GeV and to reach luminosities at the burn-off limit will also be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HB2014/talks/moylr04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HB2014/papers/moylr04.pdf",
      "poster_url": "https://proceedings.jacow.org/HB2014/posters/moylr04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2014-MOYLR04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOYLR05",
      "title": "Beam Physics and Technology Challenge for Multi-MW CW Proton Linac",
      "authors": [
        "H.W. Zhao",
        "Y. He",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "Multi-MW CW proton linac has found significant applications in particle physics research",
        "nuclear physics research and various neutron sources such as ADS. However",
        "currently there has not been any MW-level CW proton linac in routine operation due to beam physics challenge and technology challenge although a lot of R&D activities have being conducted worldwide in the last decades. Taking 15 MW@10 mA ADS proton linac as a design example",
        "this talk will address the key points of the beam physics challenge would be space charge with strong nonlinear repulsive forces",
        "beam halo match and beam instability. Beam dynamics simulation and beam optimization through computer codes with at least 100000 reference particles have become significant to validate the beam dynamics design and keep the uncontrolled beam losses below 1 W/m. We must also take up a lot of technology challenges",
        "such as proton source with minimum numbers of beam trip",
        "CW proton RFQ",
        "high gradient SRF cavity",
        "integrated cryomodule with multi-cavities",
        "non-interceptive diagnostics",
        "beam collimation",
        "beam loss detection and control",
        "beam trip mitigation",
        "machine protection and high power beam tuning."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HB2014/talks/moylr05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HB2014/papers/moylr05.pdf",
      "poster_url": "https://proceedings.jacow.org/HB2014/posters/moylr05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2014-MOYLR05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOYLR06",
      "title": "Beam Dynamics: A Tool for Facility Optimization",
      "authors": [
        "ESS",
        "Lund",
        "Sweden",
        "The ESS top level parameters of 5 MW",
        "3 ms pulse length and 14 Hz repetition rate are given by user requirements. The choice of 2 GeV",
        "62.5 mA and 2.87 ms pulse length were chosen at laboratory level and were largely technology driven e.g. the desire to keep beam current sufficiently low to avoid severe space charge issues resulting in the need of parallel front-ends. After the technology choices had been made",
        "the final set of requirements resulting in the ESS 2013 lattice design were derived in an iterative process with cost and beam dynamics issues being the two main parameters. In large",
        "cost was pushed to a minimum with the calculated emittance growth along the linac being used as a quality indicator. The lattice was chosen following standard beam dynamics rules and optimized considering space charge issues",
        "space charge neutralization phenomena",
        "alignment errors",
        "longitudinal field flatness and time stability and magnetic field quality. I will in this presentation review the ESS facility optimization with some focus on cost and robustness and give an overview of the many beam dynamics issues which were considered in this process."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/HB2014/talks/moylr06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/HB2014/papers/moylr06.pdf",
      "poster_url": "https://proceedings.jacow.org/HB2014/posters/moylr06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2014-MOYLR06",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:13:24"
}