{
  "session_info": {
    "id": "FRXXPLM",
    "name": "FRXXPLM - Contributed Orals: Accelerator Technology",
    "url": "https://proceedings.jacow.org/ipac2019/html/frxxplm.htm"
  },
  "papers": [
    {
      "paper_id": "FRXXPLM1",
      "title": "High Field Superconducting Magnet Program for Accelerators in China",
      "authors": [
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "High field superconducting magnets are crucial for high-energy particle accelerators. IHEP (institute for High Energy Physics",
        "Beijing) is pursuing critical technologies R&D for future circular colliders like the Super Proton Proton Collider (SPPC). SPPC will need thousands of high field (12-20 T) superconducting magnets in around 20 years. A long term R&D roadmap of the advanced high field magnets has been made",
        "aiming to push the technology frontier to the desired level",
        "and a strong domestic collaboration is established",
        "which brings together expertise of Chinese superconductivity community from fields of materials",
        "physics",
        "technology and engineering. The goal is to address prominent scientific and technological issues and challenges for high field applications of advanced superconducting materials. In the past year a model magnet with hybrid coils (NbTi and Nb3Sn ) has been manufactured and tested",
        "reaching a dipole field above 10 T in the two apertures. A full Nb3Sn model has also been fabricated and tested with a coil made of iron based superconductor inserted in the center. An overview of the high field magnet program",
        "R&D status and the future plans will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/frxxplm1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/frxxplm1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/frxxplm1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-FRXXPLM1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRXXPLM2",
      "title": "Magnet Design for Siam Photon Source II",
      "authors": [
        "P. Sunwong",
        "P. Klysubun",
        "T. Phimsen",
        "S. Prawanta",
        "P. Sudmuang",
        "SLRI",
        "Nakhon Ratchasima",
        "Thailand",
        "Siam Photon Source II project has been approved and detailed technical design of the accelerator system is currently in progress. The Double Triple Bend Achromat (DTBA) lattice is implemented in the storage ring design for low emittance and more space for insertion devices. Magnets with moderate to high field requirements have been designed",
        "including combined function magnet with the field gradient of 27.1 T/m",
        "quadrupole magnets with the field gradient up to 60 T/m and multifunction sextupole magnets. This work presents the magnet requirement and specification",
        "design concept",
        "recent simulation results and analysis of the magnetic field quality. A plan for prototype development is also discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/frxxplm2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/frxxplm2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/frxxplm2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-FRXXPLM2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRXXPLM3",
      "title": "Development of a Pulsed Power Supply Utilizing 13 kV Class SiC-MOSFET",
      "authors": [
        "K. Okamura",
        "F. Naito",
        "K. Takayama",
        "KEK",
        "Ibaraki",
        "Japan",
        "K. Fukuda",
        "H. Kitai",
        "K. Sakamoto",
        "AIST",
        "Tsukuba",
        "Ibaraki",
        "Japan",
        "Chiba Institute of Technology",
        "Narashino",
        "Chiba",
        "Japan",
        "Nagaoka University of Technology",
        "Nagaoka",
        "Niigata",
        "Japan",
        "S. Lim",
        "A. Tokuchi",
        "Pulsed Power Japan Laboratory Ltd.",
        "Kusatsu-shi Shiga",
        "Japan",
        "To resolve the drawback of conventional thyratron switches",
        "development of a semiconductor high voltage switch utilizing a 13 kV class SiC-MOSFET developed by Tsukuba Power Electronics Constellations (TPEC) is proceeding. At first",
        "the device evaluation test was carried out with a resistive load circuit. With the conditions of drain voltage of 10 kV and load resistance of 1 kΩ",
        "turn on loss Eon",
        "turn off loss Eoff",
        "rise time Tr and fall time Tf were 1.7 mJ",
        "1.1 mJ",
        "64 ns",
        "and 75 ns",
        "respectively. As to gate charge characteristics",
        "required electric charge to increase gate source voltage from 0 V to 20 V was about 80 nC. Thereafter",
        "the 2s-12p switch array was designed and assembled",
        "where 12 MOSFETs are equally aligned on a circle shaped circuit board and two circuit boards are stacked in series. A 14 kV-490 A-5 us pulse with a rise time of 430 ns in the long pulse mode and a 18 kV-318 A-1 us pulse with a rise time of 289 ns in the short pulse mode were successfully demonstrated. This switch will be installed as a turn-off switch for the injec-tion ES kicker in the KEK-DA."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/frxxplm3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/frxxplm3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/frxxplm3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-FRXXPLM3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:20:12"
}