{
  "session_info": {
    "id": "TUYGBF",
    "name": "TUYGBF - MC8 Orals",
    "url": "https://proceedings.jacow.org/ipac2018/html/tuygbf.htm"
  },
  "papers": [
    {
      "paper_id": "TUYGBF1",
      "title": "Review on Accelerator Based Compact Neutron Sources",
      "authors": [
        "Nagoya University",
        "Nagoya",
        "Japan",
        "High intensity spallation sources are providing opportunities to obtain leading-edge quality data",
        "while new demands of neutron use are emerging not only in the frontier scientific studies but also in practical applications",
        "education of non-specialists",
        "feasibility studies and development of neutron devices. Small- and medium-scale neutron sources have the potential to meet such demands since they offer the on-demand access and long-term occupation of neutron beam. This invited talk presents a review of present activities and facilities",
        "and future prospects of this trend around the world",
        "including the Japan Collaboration on Accelerator-driven Neutron Sources (JCANS)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tuygbf1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tuygbf1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tuygbf1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUYGBF1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUYGBF2",
      "title": "Commercial Applications of High-Yield Accelerator-Based Neutron Generators",
      "authors": [
        "M. Michalak",
        "R.F. Radel",
        "K.M. Rittenhouse",
        "PNL",
        "Madison",
        "Wisconsin",
        "USA",
        "Phoenix",
        "LLC. has developed an accelerator-based high-yield neutron generator. This system utilizes a microwave ion source (MWS)",
        "300 kV DC accelerator",
        "magnetic solenoid focus element",
        "differential pumping system",
        "and gaseous deuterium target to achieve neutron yields of 3x1011 n/s. Lower-yield variations of the device have been built using a solid titanium target",
        "and design for a DT version of the gas target system is underway that will increase neutron yield to 5x1013 n/s. Phoenix has delivered a number of systems to government and commercial customers and has identified a number of longer-term commercial applications for this high-yield neutron generator. These include medical isotope production",
        "neutron radiography",
        "radiation effects testing",
        "active interrogation for explosives and SNM detection",
        "and Cf-252 replacement. Most applications require the development of specialized moderator assemblies and fixtures to meet customer requirements. This presentation will discuss the base neutron generator technology and custom variations and will address a number of the commercial applications in which Phoenix neutron generators have been utilized.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tuygbf2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tuygbf2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tuygbf2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUYGBF2",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUYGBF3",
      "title": "An EBIS-Based Low-Energy Accelerator for Fine-Focussed Ion Beams",
      "authors": [
        "M. Schmidt",
        "P. Laux",
        "G.H. Zschornack",
        "DREEBIT",
        "Großröhrsdorf",
        "Germany",
        "Technologies based on focused ion beams have become indispensable for research institutions as well as commercial laboratories and high-tech production facilities (micro- and nanotechnology",
        "semiconductor technology). We report on a compact setup combining an Electron Beam Ion Source (EBIS)",
        "a Wien filter for ion species separation",
        "and a fine focusing ion acceleration column capable of producing ion beams with beam diameters in the micrometer range at ion beam energies up to the MeV range. Almost all elements of the periodic system can be injected into the EBIS to produce a broad spectrum of ion charge states with only one ion source. The beam energy of a selected ion species can easily be varied by changing the electric potential of the EBIS drift tube in which the ions are generated",
        "resulting in different implantation depths in various solids. We present studies on beam diameter and emittance",
        "available charge states",
        "and SEM imaging as application."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tuygbf3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tuygbf3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tuygbf3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUYGBF3",
      "page_number": "647",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUYGBF4",
      "title": "Design and Simulation Tools for the High-Intensity Industrial Rhodotron Electron Accelerator",
      "authors": [
        "W.J.G.M. Kleeven",
        "M. Abs",
        "J. Brison",
        "E. Forton",
        "J. M. Hubert",
        "J. Walle",
        "IBA",
        "Louvain-la-Neuve",
        "Belgium",
        "The Rhodotron is a compact industrial CW recirculating electron accelerator producing intense beams with energies in the range from about 1 to 10 MeV. RF-frequencies are in the range of 100 to 400 MHz. Average beam powers can range from 10 kW to almost 1 MW",
        "depending of the specific type of Rhodotron. Main industrial applications are polymer cross-linking",
        "sterilization",
        "food treatment and container security scanning. Recently",
        "RF pulsing was developed to reduce the average wall power dissipation",
        "thus reducing drastically the energy consumption. Pulsing also permits smaller cavities and higher energies up to 40 MeV",
        "opening the way to applications such as mobile irradiators",
        "or isotopes production by photonuclear reactions",
        "thus offering a compact and high beam duty alternative to linacs. This paper concentrates on some crucial design tools and methods for transverse and longitudinal optics studies",
        "particle tracking with space charge",
        "beam formation studies in the electron gun and dipole magnet design."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/tuygbf4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/tuygbf4.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/tuygbf4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-TUYGBF4",
      "page_number": "651",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 19:24:40"
}