{
  "session_info": {
    "id": "WEYGBE",
    "name": "WEYGBE - MC5 Orals",
    "url": "https://proceedings.jacow.org/ipac2018/html/weygbe.htm"
  },
  "papers": [
    {
      "paper_id": "WEYGBE1",
      "title": "Suppressing CSR Microbunching in Recirculation Arcs",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "We provide sufficient conditions for suppression of CSR-induced microbunching instability along transport or recirculation arcs. The example lattices include low-energy (∼100 MeV) and high-energy (∼1 GeV) recirculation arcs",
        "and medium-energy compressor arcs. Our studies show that lattices satisfying the proposed conditions indeed have microbunching gain suppressed. Beam current dependencies of maximal CSR microbunching gains are also demonstrated",
        "which should help outline a beam line design for different scales of nominal currents. We expect this analysis can improve future lattice design."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/weygbe1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/weygbe1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/weygbe1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEYGBE1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYGBE2",
      "title": "Applications of Caustic Methods to Longitudinal Phase Space Manipulation",
      "authors": [
        "The University of Melbourne",
        "Melbourne",
        "Victoria",
        "Australia",
        "CERN",
        "Geneva",
        "Switzerland",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Longitudinal phase space management is a key feature of recirculating machines. Careful consideration of the longitudinal matching is required not only in order to ensure a high peak current",
        "low energy spread bunch is delivered to the FEL but also to support the deceleration and energy recovery of the spent beam. In a similar manner",
        "longitudinal phase space manipulation can be utilised for pulse shaping in bunch compression",
        "to minimise the influence of CSR-induced emittance growth. In this paper",
        "we present a method for longitudinal phase space matching based upon the avoidance of electron trajectory caustics. Through considering the conditions under which caustics will form",
        "we generate exclusion plots identifying the viable parameter space at numerous positions through beam acceleration and energy recovery. The result is a method for selecting the linear momentum compaction and the higher-order momentum compaction to satisfy the non-caustic condition whilst achieving the bunch compression or lengthening as required."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/weygbe2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/weygbe2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/weygbe2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEYGBE2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYGBE3",
      "title": "New Features of Beamstruhlung Important for Crab-Waist e+e− Colliders",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "It is already known that beamstrahlung put a limitation on attainable luminosity of circular high energy e+e− colliders (like FCC-ee and CEPC)",
        "it determines beam lifetimes",
        "increase the energy spread and leads to a beam lengthening. Current projects take these effects into account using well known synchrotron radiation (SR) formulas. In this talk I show that these formulas are not applicable for colliders with crab-waist collisions (all new projects of circular e+e− colliders) because at these colliders the deflection angle during the beam collisions θ< 1/γ. In this case the characteristic maximum frequency is ωm ≈cγ2/σ instead of the SR critical frequency ωc≈cγ3/ρ (where σ is the crossing length)",
        "the ratio ωm/ωc >1 and the spectrum is completely different. As result all effects due to beamstrahlung are stronger than give standard SR formulas. In the talk results of exact numerical calculation of beamstrahlung spectra for parameter region of e+e− circular collides are presented with analysis and conclusion."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/weygbe3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/weygbe3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/weygbe3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEYGBE3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEYGBE4",
      "title": "Low-Impedance Collimators for HL-LHC",
      "authors": [
        "S. A. Antipov",
        "N. Biancaccipresenter",
        "R. Bruce",
        "A. Mereghetti",
        "D. Mirarchi",
        "E. Métral",
        "S. Redaelli",
        "B. Salvant",
        "CERN",
        "Geneva",
        "Switzerland",
        "Université Grenoble Alpes",
        "Grenoble",
        "France"
      ],
      "institutions": [],
      "abstract": "The High-Luminosity upgrade of the Large Hadron Collider (HL-LHC) will double its beam intensity for the needs of High Energy Physics frontier. This increase requires a reduction of the machine's impedance to ensure the coherent stability of the beams until they are put in collision. A major part of the impedance is the resistive wall contribution of the collimators. To reduce this contribution several coating options have been proposed. We have studied numerically the effect of the novel coatings on the beam stability. The results show that a decrease of up to 30% of the machine impedance and a reduction of up to 120 A in the stabilizing octupole current threshold can be achieved by coating the secondary collimators with Molybdenum. Half of that improvement can be obtained by coating the jaws of a subset of four collimators identified as the highest contributors to machine impedance. The installation of this subset of low-impedance collimators is planned for the Long Shutdown 2 in 2019-2020.",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/weygbe4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/weygbe4.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/weygbe4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-WEYGBE4",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 19:28:51"
}