{
  "session_info": {
    "id": "THXCR",
    "name": "THXCR - Facility and Program II",
    "url": "https://proceedings.jacow.org/cool2015/html/thxcr.htm"
  },
  "papers": [
    {
      "paper_id": "THXCR01",
      "title": "The CERN Antimatter Facility",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "After some 30 years of supplying antiprotons for the various physics programmes at CERN",
        "the antimatter facility with its Antiproton Decelerator (AD) is now undergoing a major upgrade program. A report of the operational status of the facility in its current configuration is given. In view of the decades ahead of us",
        "we will also discuss ongoing consolidation activities as well as ongoing and planned upgrades including the design and construction of an additional decelerator ring",
        "ELENA (Extra Low ENergy Antiprotons) with the aim of supplying cooled 100keV antiproton beams to the experimental areas via new low-energy beam lines employing electrostatic deflectors and focussing elements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/thxcr01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/thxcr01.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/thxcr01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-THXCR01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THXCR02",
      "title": "NICA Project, Report on the Present Status and Related Cooling Issues",
      "authors": [
        "G.V. Trubnikov",
        "A.V. Butenko",
        "H.G. Khodzhibagiyan",
        "I.N. Meshkov",
        "A.O. Sidorin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Nuclotron-based Ion Collider fAcility (NICA) is the new experimental heavy-ion complex being constructed at Joint Institute for Nuclear Research",
        "Dubna. Main purpose of the project is to provide experiment on colliding heavy ion beams (Au) for study of manifestation of hot and dense strongly interacting baryonic matter. The construction of the accelerator complex is actively performed: new 3.2 MeV/u heavy-ion linear accelerator (HILac) is now under commissioning",
        "serial production of Booster synchrotron elements is going in schedule. Systems for collider had been prototyped and start of serial production is in 2015. Beam cooling systems are suggested for application at NICA. The Booster equipped with 35 keV electron cooling system. Two beam cooling systems: stochastic and electron",
        "will be used in the collider. Parameters of cooling systems",
        "proposed scenario of collider operation",
        "design intended to achieve required average luminosity of the order of 1027cm-2s-1",
        "start-up version of the complex for 2019 are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/thxcr02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/thxcr02.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/thxcr02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-THXCR02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THXCR03",
      "title": "High Intensity Heavy Ion Accelerator Facility (HIAF) in China",
      "authors": [
        "J.C. Yang",
        "Y. He",
        "X. Ma",
        "L.T. Sun",
        "J.W. Xia",
        "G.Q. Xiao",
        "H.S. Xu",
        "W.-L. Zhan",
        "H.W. Zhao",
        "X.H. Zhou",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "HIAF (High Intensity heavy ion Accelerator Facility) is a proposed new accelerator facility in China. The HIAF facility will be built on the experience and technological developments already achieved at the existing HIRFL facility and also be incorporated new technological concepts. The facility is being designed to provide intense beams of primary and radioactive ions for a wide range of research fields. High energetic highly bunched heavy ion beams are used to interact with dense plasma to probe the physics of nuclear fusion. Radioactive ion beams are used to investigate the structure of exotic nuclei",
        "to learn more about nuclear reactions of astrophysics and to measure the mass of nuclei with high precision. Highly charged ions are used for atomic physics and a series of applied science. The unique features of the first phase of HIAF are high current pulsed beams from the iLinac and high intensity heavy ion beams with ultra-short bunch from the BRing. The cooled rare isotope beams also will be prepared through projectile-fragmentation (PF) method. The baseline design of HIAF will be chosen to optimize science goals",
        "technology development and project cost. The final design of the first phase will maintain a well defined path for future upgrade. A electron accelerator complex will be developed for the electron-ion collision (EIC) in the second phase. The beam dynamics and technical challenges will be presented",
        "as well as the present status of HIAF project."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/thxcr03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/thxcr03.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/thxcr03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-THXCR03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THXCR04",
      "title": "Status and Upgrade of HIRFL Accelerator Complex at IMP",
      "authors": [
        "Y.J. Yuan",
        "X.J. Hu",
        "X.N. Li",
        "X. Ma",
        "L.J. Mao",
        "J.X. Wu",
        "J.W. Xia",
        "J.C. Yang",
        "W.Q. Yang",
        "X.D. Yang",
        "H.W. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "The Heavy Ion Research Facility at Lanzhou (HIRFL) is the only one large scale heavy ion accelerator complex that uses cyclotron(SFC and SSC) as injector",
        "synchrotron(CSRm) for accumulation and post acceleration",
        "storage ring(CSRe) for in ring experiments in China. To reach the increasing requirements from nuclear physics",
        "atomic physics",
        "interdisciplinary science and their applications",
        "many upgrading plans were launched or scheduled. The present status and recent upgrading plans of HIRFL will be introduced in this paper. The operation of the electron coolers and related cooling experimental results are presented. For the upgrading plans",
        "the development of new Linac injector for HIRFL and the new high voltage system of 300keV electron cooler will be discussed in details."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/thxcr04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/thxcr04.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/thxcr04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-THXCR04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:21:13"
}