{
  "session_info": {
    "id": "WEOAB",
    "name": "WEOAB - WG10 - Vacuum: Beam Vacuum Interaction, Vacuum Technology",
    "url": "https://proceedings.jacow.org/eefact2018/html/weoab.htm"
  },
  "papers": [
    {
      "paper_id": "WEOAB01",
      "title": "Commissioning Status of SuperKEKB Vacuum System",
      "authors": [
        "K. Shibata",
        "H. Hisamatsu",
        "T. Ishibashi",
        "K. Kanazawa",
        "M. Shirai",
        "Y. Suetsugu",
        "S. Terui",
        "KEK",
        "Ibaraki",
        "Japan",
        "In the upgrade from the KEKB to the SuperKEKB",
        "approximately 93% and 20% of the beam pipes and vacuum components of the positron ring and the electron ring were replaced with new ones. In the Phase-1 commissioning in 2016",
        "vacuum scrubbing and confirmation of the stabilities of new vacuum components at approximately 1 A were carried out. Though some problems such as pressure bursts accompanying beam losses were revealed",
        "no serious problem was found in the vacuum system. During the subsequent shutdown",
        "the countermeasures against the problems were taken",
        "and new beam pipes and components such as beam collimators were installed. The Phase-2 commissioning",
        "where beam collision tuning was mainly performed",
        "was carried out from March to July 2018. The collimators worked very well to suppress the background noise of the Belle-II detector",
        "though some of them were damaged by the beam. The frequency of the pressure burst drastically decreased though the typical beam currents were lower than those of the Phase-1. The vacuum system of the SuperKEKB has been working generally well so far. The total beam doses of the SuperKEKB exceeded 1000 Ah",
        "and the pressures decreased as expected."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-ee",
      "presentation_url": "https://proceedings.jacow.org/eefact2018/talks/weoab01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2018/papers/weoab01.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2018/posters/weoab01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2018-WEOAB01",
      "page_number": "226",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOAB04",
      "title": "Single Bunch Instabilities and NEG Coating for FCC-ee",
      "authors": [
        "Sapienza University of Rome",
        "Rome",
        "Italy",
        "P. Costa Pinto",
        "G. Rumolo",
        "A. Sapountzis",
        "T.F. Sinkovits",
        "M. Taborelli",
        "CERN",
        "Geneva",
        "Switzerland",
        "INFN-Roma1",
        "Rome",
        "Italy",
        "INFN/LNF",
        "Frascati",
        "Italy",
        "The high luminosity electron-positron collider FCC-ee is part of the Future Circular Collider (FCC) study at CERN and it has been designed to cover the beam energy range from 45.6 GeV to 182.5 GeV to study the properties of the Higgs boson and other particles. Electron cloud build up simulations on the Z resonance revealed the necessity of minimising the Secondary Electron Yield (SEY) of the pipe walls by applying a Ti-Zr-V Non-Evaporable Getter (NEG) coating in the entire ring. Beam dynamics simulations at 45.6 GeV pointed out that minimising the thickness of this layer is mandatory to reduce the resistive wall (RW) impedance",
        "thus increasing the single bunch instability thresholds and ensuring beam stability during operation. However",
        "reducing the coating thickness can affect the performance of the material and therefore the SEY. For this reason",
        "an extensive measurement campaign was performed at CERN to characterise NEG thin films with thicknesses below 250 nm in terms of activation performance and SEY measurements. This paper also presents the FCC-ee longitudinal impedance model which includes all the current machine components."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-ee",
      "presentation_url": "https://proceedings.jacow.org/eefact2018/talks/weoab04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2018/papers/weoab04.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2018/posters/weoab04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2018-WEOAB04",
      "page_number": "234",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 08:36:42"
}