{
  "session_info": {
    "id": "TUIDLH1",
    "name": "TUIDLH1 - WG1 ERL Injectors (Gun/Cathode/Laser)",
    "url": "https://proceedings.jacow.org/ERL2015/html/tuidlh1.htm"
  },
  "papers": [
    {
      "paper_id": "TUIDLH1036",
      "title": "Commissioning Program for the 704 MHz SRF Gun at BNL",
      "authors": [
        "W. Xu",
        "S.A. Belomestnykh",
        "I. Ben-Zvi",
        "D. Kayran",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A 704 MHz superconducting RF photoemission electron gun for the R&D ERL project is under commissioning at BNL. It successfully generated the first photoemission beam in November 2014. The BNL SRF gun cavity operates well in CW mode up to 2 MV. However",
        "its performance with inserted cathode stalk suffered due to multipacting in the quarter-wavelength choke-joint. A new multipacting-free cathode stalk was designed and tested. The test results proved that it is a truly “multipacting-free” stalk. With the new cathode",
        "the gun is able to operate in CW mode. The total conditioning time of the new cathode stalk is very short. This paper describes configuration of the SRF gun test and the sub-systems. RF and thermal design of new cathode stalk and its conditioning results are presented. Finally",
        "we report the latest results of the SRF gun commissioning",
        "including the cavity performance",
        "cathode QE measurements",
        "beam current/energy measurements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ERL2015/talks/tuidlh1036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ERL2015/papers/tuidlh1036.pdf",
      "poster_url": "https://proceedings.jacow.org/ERL2015/posters/tuidlh1036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2015-TUIDLH1036",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUIDLH1037",
      "title": "Commissioning and First RF Results of the 2nd 3.5 Cell SRF Gun for ELBE",
      "authors": [
        "A. Arnold",
        "M. Freitag",
        "P. Murcek",
        "J. Teichert",
        "H. Vennekate",
        "R. Xiang",
        "HZDR",
        "Dresden",
        "Germany",
        "G. Ciovati",
        "P. Kneisel",
        "L. Turlington",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "As in 2007 the first 3.5 cell superconducting radio frequency (SRF) gun was taken into operation at Helmholtz-Zentrum Dresden-Rossendorf",
        "it turned out that the specified performance to realize an electron energy of 9.4 MeV has not been achieved. Instead",
        "the resonator of the gun was limited by field emission to about one third of this value and the measured beam parameters remained significantly below its expectations. However",
        "to demonstrate the full potential of this electron source for the ELBE linear accelerator",
        "a second and slightly modified SRF gun was developed and built in collaboration with Thomas Jefferson National Accelerator Facility. We will report on commissioning and first RF results of this new SRF gun. This includes in particular the characterization of the most important RF properties as well as their comparison with previous vertical test results. Additionally",
        "investigations are presented that try to explain a particle contamination that happened recently during the first cathode transfer."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ERL2015/talks/tuidlh1037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ERL2015/papers/tuidlh1037.pdf",
      "poster_url": "https://proceedings.jacow.org/ERL2015/posters/tuidlh1037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2015-TUIDLH1037",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUIDLH1038",
      "title": "First Beam Characterization of SRF Gun II with a Copper Photocathode",
      "authors": [
        "J. Teichert",
        "A. Arnold",
        "P.N. Lu",
        "P. Michel",
        "P. Murcek",
        "H. Vennekate",
        "R. Xiang",
        "HZDR",
        "Dresden",
        "Germany",
        "An improved SRF gun has been installed and commissioned at HZDR since 2014. This new gun replaces the first SRF gun at the superconducting linear accelerator ELBE which had been in operation since 2007. The new SRF gun II has an improved 3.5-cell niobium cavity and a superconducting solenoid inside the gun cryostat. The gun has been tested first with a Cu photocathode. Using the standard high repetition rate laser system",
        "this allows low bunch charge beams of a few pC only. The beam parameters for these low charges have been measured",
        "and the first beam has been guided into the ELBE accelerator. Since 2015 the photocathode transfer system is installed for future use of Cs2Te photocathodes with high quantum efficiency photocathodes."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ERL2015/talks/tuidlh1038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ERL2015/papers/tuidlh1038.pdf",
      "poster_url": "https://proceedings.jacow.org/ERL2015/posters/tuidlh1038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ERL2015-TUIDLH1038",
      "page_number": "42",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:06:49"
}