{
  "session_info": {
    "id": "WEBA",
    "name": "WEBA - Core Technology Updates",
    "url": "https://proceedings.jacow.org/medsi2016/html/weba.htm"
  },
  "papers": [
    {
      "paper_id": "WEBA01",
      "title": "Nostradamus and the Synchrotron Engineer: Key Aspects of Predicting Accelerator Structural Response",
      "authors": [
        "C.A. Preissner",
        "H. Cease",
        "J.T. Collins",
        "Z. Liu",
        "J. Nudell",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "MBA designs are placing stringent mechanical tolerances on the magnet support systems. At the APS-U the mag-net-to-magnet vibration tolerances are about 10 nm *. Timelines",
        "installation requirements",
        "and budgets constrain the resources available for prototyping and physical testing. Reliance on FEA to predict dynamic response is para-mount in insuring the tolerances are met. However",
        "obtaining accurate results from a magnet support structure FEA is not as simple as analysing the CAD model of the structure. The 16th century author Nostradamus published a collection of prophecies that since his time",
        "have been held up as predictions of various world events. While it is attractive to think his collection of short poems can be used to foretell the future",
        "in reality it is only the vagueness and absence of any dates that make them easy to apply in a posthoc basis. Arguably",
        "a similar statement can be made about the use of FEA in predicting accelerator support response. In this presentation the important contributors to FEA dynamic modelling will be discussed along with techniques that can be used to generate necessary data for models that can accurately predict response.",
        "* APS-Upgrade",
        "Functional Requirements Document",
        "Advanced Photon Source",
        "Argonne",
        "IL",
        "USA",
        "APSU 1695659",
        "May 2016."
      ],
      "institutions": [
        "Funding: Argonne is managed by UChicago Argonne, LLC, for the U.S. Department of Energy under contract DE-AC02-06CH11357."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/weba01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/weba01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/weba01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-WEBA01",
      "page_number": "272",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBA02",
      "title": "Minimization of Mechanical Constraint Effects of Eutectic GaIn as Thermal Interface",
      "authors": [
        "L. Zhang",
        "D. Cocco",
        "J.H. James",
        "N.M. Kelez",
        "D.S. Morton",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Eutectic Gallium-Indium (eGaIn: 75% Gallium + 25 Indium) is widely used as the thermal interface in water-cooled X-ray optics. The thermal contact resistance of the eGaIn can be smaller than 0.1 mm2. K/W. The LCLS-II KB mirrors will be water cooled",
        "and mostly dynamically bendable. The requirement on the bending accuracy can be expressed as residual slope error after the subtraction of the ideal ellipsoidal shape. This residual slope error should be smaller than 0.1rad",
        "which is at least 4 orders of magnitude smaller than the mirror bent slope. Therefore",
        "the mechanical constraint force from the eGaIn interface should be at least 4",
        "and mostly 5 orders of magnitude smaller than the bending forces with the bending arm length comparable to the mirror length. But what is the mechanical constraint force of the eGaIn interface? What are the mechanical properties of the eGaIn in terms of Youngs or shear modulus. How should this eGaIn interface optimized",
        "for instance the thickness of this interface? In this paper",
        "we will present experimental studies conducted at SLAC to answer these questions",
        "and propose a solution to minimize the constraint forces of the eGaIn."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/weba02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/weba02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/weba02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-WEBA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEBA03",
      "title": "Recent Progress on the Design of High-Heat-Load Components",
      "authors": [
        "S.K. Sharma",
        "C. Amundsen",
        "F.A. DePaola",
        "F.C. Lincoln",
        "J.L. Tuozzolo",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "A new design was recently proposed for the high power masks and slits of the front-ends at the 2014 MEDSI Conference. The main features of the new design are integrated knife edges in high conductivity copper alloys",
        "interception of the photon beam only on horizontal surfaces",
        "replacing Glidcop® with readily available CuCrZr",
        "and thermal optimization with internal fins. Numerous components based on this design have been built for NSLS-II front-ends and some of the design features have been incorporated into other high-heat-load components such as beamline masks and crotch absorbers. In this paper we describe recent progress at NSLS-II in further advancing this design approach by FE analysis",
        "fabrication and testing."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/weba03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/weba03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/weba03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-WEBA03",
      "page_number": "277",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEBA04",
      "title": "A Discussion on Utilization of Heat Pipes and Vapour Chamber Technology as a Primary Device for Heat Extraction from Photon Absorber Surfaces",
      "authors": [
        "K.J. Suthar",
        "P.K. Den Hartog",
        "A.M. Lurie",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The basic problem for photon absorbers in a particle accelerator is to remove a large quantity of heat from a small space. Heat pipes and vapor chambers excel at precisely this so it is natural to consider them for the application. However",
        "even though this technology has been proven to be an excellent thermal management solution for cooling everything from laptops to satellite shields in space",
        "they have yet to be adopted for use in particle accelerators. The use of heat pipes and vapor chambers are thermal transport devices which work on the principle of capillary-force-driven two-phase flow. These devices are highly customizable and offer very high effective thermal conductivities (5",
        "000-200",
        "000 W/m/K) depending on many factors including size",
        "shape",
        "and orientation. This paper discusses feasibility of the use of heat pipes and vapor chambers as the primary heat transport devices in particle accelerator photon absorbers. We discuss their limitations and advantages via careful consideration of analysis and simulation results assuming properties described in the literature and manufacturer specifications."
      ],
      "institutions": [
        "Funding: This research used resources of the APS, a U.S. Department of Energy Office of Science User Facility operated by Argonne National Laboratory under Contract No. DE-AC02-06CH11357."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/weba04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/weba04.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/weba04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-WEBA04",
      "page_number": "280",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-11 00:01:03"
}