{
  "session_info": {
    "id": "MOCL",
    "name": "MOCL - Collider Specific Instrumentation",
    "url": "https://proceedings.jacow.org/IBIC2013/html/mocl.htm"
  },
  "papers": [
    {
      "paper_id": "MOCL1",
      "title": "Beam Instrumentation at the Accelerator Test Facility 2",
      "authors": [
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "The Accelerator Test Facility 2 (ATF2) is a scaled demonstrator system for final focus beam lines of linear high energy colliders. Four OTR (Optical Transition Radiation) monitors have been installed at the ATF2. Major characteristics is the fast measurement of projected (2D) and intrinsic (4D) emittances and the coupling corrections with skew quadrupole magnets at the upstream. The high resolution cavity beam position monitor (BPM) system is a part of the ATF2 diagnostics. Two types of cavity BPMs are used",
        "C-band operating at 6.426 GHz",
        "and S-band at 2.888 GHz with an increased beam aperture. The resolution of the C-band system with attenuators was determined to be approximately 250 nm and 1 μm for the S-band system. Without attenuation the best recorded C-band cavity resolution was 27 nm. A laser-wire transverse electron beam size measurement system has been constructed and operated at the ATF2 beam line at KEK. A special set of electron beam optics was developed to generate an approximately 1μm vertical focus at the laser-wire location. Systematic measurements of a micron beam size have been successfully executed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/mocl1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/mocl1.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/mocl1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-MOCL1",
      "page_number": "26",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCL2",
      "title": "Design of a Novel Cherenkov Detector System for Machine Induced Background Monitoring in the CMS Cavern",
      "authors": [
        "S. Orfanelli",
        "A.E. Dabrowski",
        "M. Giunta",
        "CERN",
        "Geneva",
        "Switzerland",
        "M.J. Ambrose",
        "A. Finkel",
        "R. Rusack",
        "University of Minnesota",
        "Minneapolis",
        "Minnesota",
        "USA",
        "PU",
        "Princeton",
        "New Jersey",
        "USA",
        "A novel detector system has been designed for an efficient online measurement of the machine induced background in the CMS experimental cavern. The suppression of the CMS cavern background originating from pp collision products and the 25 ns bunch spacing have set the requirements for the detector design. Each detector unit will be a radiation hard",
        "cylindrical Cherenkov radiator optically coupled to an ultra-fast UV-sensitive photomultiplier tube",
        "providing a prompt",
        "directionally sensitive measurement. Simulation and test beam measurements have shown the achievability of the goals that have driven the baseline design. The system will consist of 20 azimuthally distributed detectors per end",
        "installed at a radius of r ~ 180 cm and a distance 20.6 m away from the CMS interaction region. The detector units will enable a measurement of the transverse distribution of the bunch-by-bunch machine induced background flux. This will provide important feedback from the CMS on the beam conditions during the LHC machine setup and comparisons to expectations based on FLUKA simulations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/mocl2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/mocl2.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/mocl2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-MOCL2",
      "page_number": "33",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOCL3",
      "title": "Emittance and Momentum Diagnostics for Beams with Large Momentum Spread",
      "authors": [
        "M. Olvegård",
        "V.G. Ziemann",
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "In the drive beam complex of CLIC",
        "but also in plasma wakefield accelerators",
        "the momentum spread can be on the order of tens of percent while conventional diagnostic methods often assume a very small momentum spread. This leads to systematic misinterpretations of the measurements. Spectrometry and emittance measurements based on quadrupole scan rely on measuring the beam size",
        "which depends on the beam envelope. This",
        "in turn",
        "depends on the momentum distribution. We have studied the systematic errors that arise and developed novel algorithms to correctly analyze these measurements for arbitrary momentum distributions. As an application we consider the CLIC drive beam decelerator",
        "where extraction of up to 90% of the kinetic energy leads to a very large momentum spread. We study a measurement of the time-resolved momentum distribution",
        "based on sweeping the beam in a circular pattern and recording the beam size on a screen using optical transition radiation. We present the algorithm to extract the time-resolved momentum distribution",
        "together with simulation results to prove its applicability."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/mocl3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/mocl3.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/mocl3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-MOCL3",
      "page_number": "37",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:58:17"
}