{
  "session_info": {
    "id": "MOPM1HA",
    "name": "MOPM1HA - Operational & Future Facilities I",
    "url": "https://proceedings.jacow.org/COOL2013/html/mopm1ha.htm"
  },
  "papers": [
    {
      "paper_id": "MOPM1HA01",
      "title": "Status of the FAIR Project",
      "authors": [
        "GSI",
        "Darmstadt",
        "Germany"
      ],
      "institutions": [],
      "abstract": "The scope of the FAIR project has passed through various modifications. The first stage of the the FAIR project, the Modularized Start Version (MSV), was defined based on the available funding by the international partners. Although some of the accelerator systems are not included in the MSV, all major experiment collaborations will be provided with new or improved beam properties compared to the beam conditions presently offered at GSI. Beam cooling will mainly be employed in the preparation of secondary beams of rare isotopes and antiprotons. Besides stochastic cooling of secondary beams in the new Collector Ring (CR), cooling will also be applied in the new High Energy Storage Ring (HESR) and in the former CRYRING, which is presently prepared for installation behind the existing ESR. The HESR, which was originally designed for operation with cooled antiprotons, is presently redesigned to allow experiments with stable ions and rare isotope beams. The project CRYRING@ESR aims at the deceleration of highly charged ions and rare isotopes injected from the ESR at a typical energy of 4 MeV/u. In the first stage it will be used as a test facility for accelerator developments for FAIR.",
      "presentation_url": "https://proceedings.jacow.org/COOL2013/talks/mopm1ha01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/COOL2013/papers/mopm1ha01.pdf",
      "poster_url": "https://proceedings.jacow.org/COOL2013/posters/mopm1ha01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2013-MOPM1HA01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPM1HA02",
      "title": "The High Luminosity Polarized Electron-Ion Collider Project at JLab*",
      "authors": [
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "A polarized electron-ion ring-ring collider (EIC) based on use of the 12 GeV CEBAF is envisioned at Jefferson Lab as an energy frontier of the nuclear science program. Over the last decade",
        "a conceptual design of EIC@JLab has been developed; a comprehensive report summarizing the baseline and accelerator R&D progress has been released recently. The luminosity concept is based essentially on use of an ERL+circulator ring based electron cooling to access low emittance very short ion bunches at a high repetition rate. This report is briefly lighting up the recent progress of the low (LEIC) and medium (MEIC) ion energy staged EIC design studies in the following areas: development of the interaction regions (IR) and detectors design; studies of detector background; optimization of chromatic compensation and dynamic aperture in the collider rings; optimization of the polarization design in the figure-8 booster and collider rings; collider ring and ion large booster optics design optimization; study of dynamics of electron beam in the cooler ring and ERL."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/COOL2013/talks/mopm1ha02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/COOL2013/papers/mopm1ha02.pdf",
      "poster_url": "https://proceedings.jacow.org/COOL2013/posters/mopm1ha02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2013-MOPM1HA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 17:21:44"
}