{
  "session_info": {
    "id": "MOPD",
    "name": "MOPD - Monday posters in ballroom",
    "url": "https://proceedings.jacow.org/IBIC2014/html/mopd.htm"
  },
  "papers": [
    {
      "paper_id": "MOPD01",
      "title": "RHIC p-Carbon Polarimeter Target Lifetime Issue",
      "authors": [
        "H. Huang",
        "E.C. Aschenauer",
        "G. Atoian",
        "A. Bazilevsky",
        "O. Eyser",
        "A. Fernando",
        "D.M. Gassner",
        "D. Kalinkin",
        "J. Kewisch",
        "G.J. Mahler",
        "Y. Makdisi",
        "S. Nemesure",
        "A. Poblaguev",
        "W.B. Schmidke",
        "D. Steski",
        "T. Tsang",
        "K. Yip",
        "A. Zelenski",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "I.G. Alekseev",
        "D. Svirida",
        "ITEP",
        "Moscow",
        "Russia",
        "RHIC polarized proton operation requires fast and reliable proton polarimeter for polarization monitoring during stores. Polarimeters based on p-Carbon elastic scattering in the Coulomb Nuclear Interference(CNI) region has been used. Two polarimeters are installed in each of the two collider rings and they are capable to provide important polarization profile information. The polarimeter also provides valuable information for polarization loss on the energy ramp. As the intensity increases over years",
        "the carbon target lifetime is getting shorter and target replacement during operation is necessary. Simulations and experiment tests have been done to address the target lifetime issue. This paper summarizes the recent operation and the target test results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd01.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD01",
      "page_number": "124",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPD02",
      "title": "The Electron Backscattering Detector (eBSD), a New Tool for the Precise Mutual Alignment of the Electron and Ion Beams in Electron Lenses",
      "authors": [
        "P. Thieberger",
        "Z. Altinbas",
        "C. Carlson",
        "C. Chasman",
        "M.R. Costanzo",
        "C. Degen",
        "K.A. Drees",
        "W. Fischer",
        "D.M. Gassner",
        "X. Gu",
        "K. Hamdi",
        "J. Hock",
        "Y. Luo",
        "A. Marusic",
        "T.A. Miller",
        "M.G. Minty",
        "C. Montag",
        "A.I. Pikin",
        "S.M. White",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The Relativistic Heavy Ion Collider (RHIC) electron lenses",
        "being commissioned to attain higher polarized proton-proton luminosities by partially compensating the beam-beam effect",
        "require good alignment of the electron and proton beams. These beams propagating in opposite directions in a 5T solenoid have a typical rms width of 300 microns and need to overlap each other over an interaction length of about 2 m with deviations of less than ~50 microns. A new beam diagnostic tool to achieve and maintain this alignment is based on detecting electrons that are backscattered in close encounters with protons. Maximizing the intensity of these electrons ensures optimum beam overlap. The successful commissioning of these devices using 100 GeV/amu gold beams is described. Future developments are discussed that will further improve the sensitivity to small angular deviations.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd02.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD02",
      "page_number": "129",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPD03",
      "title": "Performance and Upgrade of the Fast Beam Condition Monitor at CMS",
      "authors": [
        "M. Hempel",
        "H.M. Henschel",
        "O. Karacheban",
        "W. Lange",
        "J.L. Leonard",
        "M. Penno",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "NC PHEP BSU",
        "Minsk",
        "Belarus",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "P.R. Burtowy",
        "A.E. Dabrowski",
        "R. Loos",
        "V. Ryjov",
        "A.A. Zagozdzinska",
        "CERN",
        "Geneva",
        "Switzerland",
        "BTU",
        "Cottbus",
        "Germany",
        "W. Lohmann",
        "R. Walsh",
        "DESY",
        "Hamburg",
        "Germany",
        "NU",
        "Evanston",
        "Illinois",
        "USA",
        "AGH",
        "Cracow",
        "Poland",
        "Uni HH",
        "Hamburg",
        "Germany",
        "PU",
        "Princeton",
        "New Jersey",
        "USA",
        "The Fast Beam Condition Monitor BCM1F is a diamond based particle detector inside CMS. It is based on 8 single crystal CVD diamond sensors on both ends of the interaction point and is used for beam background and luminosity measurements. The system has been operated up to an integrated luminosity of 30fb-1",
        "corresponding to a particle fluence of 8.78·1013 cm-2 (24GeV proton equivalent). To maintain the performance at a bunch spacing of 25ns and at the enhanced luminosity after the LHC Long Shutdown LS1",
        "an upgrade of BCM1F is necessary. The upgraded system features 24 single crystal diamond sensors with a two pad metallization",
        "a very fast front-end ASIC built with 130nm CMOS technology and new back-end electronics. A prototype of the upgraded BCM1F components were studied in the 5GeV electron beam at DESY. Measurements were done on the signal shape as function of time",
        "the collection efficiency as a function of voltage and position of the impact point on the sensor surface. The preliminary results of this testbeam will be presented. In addition",
        "the status of the new upgraded BCM1F will be given.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd03.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD03",
      "page_number": "134",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPD04",
      "title": "Synchronisation of the LHC Betatron Coupling and Phase Advance Measurement System",
      "authors": [
        "J. Olexa",
        "M. Gasior",
        "CERN",
        "Geneva",
        "Switzerland",
        "The new LHC Diode ORbit and OScillation (DOROS) system will provide beam position readings with sub-micrometre resolution and at the same time will be able to perform measurements of local betatron coupling and beam phase advance with micrometre beam excitation. The oscillation sub-system employs gain-controlled RF amplifiers",
        "shared with the orbit system",
        "and followed by dedicated diode detectors to demodulate the beam oscillation signals into the kHz frequency range",
        "subsequently digitized by multi-channel 24-bit ADCs. The digital signals are processed in each front-end with an FPGA and the results of reduced throughput are sent using an Ethernet protocol to a common concentrator",
        "together with the orbit data. The phase advance calculation between multiple Beam Position Monitors (BPMs) requires that all DOROS front-ends have a common phase reference. This paper presents methods used to generate such a reference and to maintain a stable synchronous sampling on all system front-ends. The performance of the DOROS prototype synchronisation is presented based upon laboratory measurements.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd04.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD04",
      "page_number": "139",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPD05",
      "title": "Dual Transverse and Longitudinal Streak Camera Imaging at ELSA",
      "authors": [
        "M.T. Switka",
        "F. Frommberger",
        "P. Hänisch",
        "W. Hillert",
        "M. Schedler",
        "ELSA",
        "Bonn",
        "Germany",
        "The electron pulse stretcher ring ELSA located at Bonn University provides 0.5 – 3.5 GeV polarized and non-polarized electron beams for external experimental stations. A streak camera system has been installed to capture time resolved images of beam dynamics ranging from nanoseconds to several milliseconds. Particular attention was drawn to the capability of simultaneous imaging of both transverse beam dimensions",
        "hence providing information of all spatial dimensions in one synchroscan or slow sweep measurement. Incoherent and coherent beam instabilities",
        "especially at high stored beam currents",
        "are subject of analysis due to the planned intensity upgrade towards 200 mA for standard operation. The current resolution performance of the imaging system and machine relevant measurements are presented."
      ],
      "institutions": [
        "Funding: Funded by the German Research Foundation (DFG) within Colaborative Research Center (SFB/TRR) 16"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd05.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD05",
      "page_number": "144",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPD06",
      "title": "Electron Beam Diagnostics for Short Pulse FEL Schemes at CLARA",
      "authors": [
        "S. Spampinati",
        "D. Newton",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "CLARA (Compact Linear Accelerator for Research and Applications) [1] is a proposed 250 MeV",
        "100-400 nm FEL test facility at Daresbury Laboratory. The purpose of CLARA is to test and validate new FEL schemes in areas such as ultra-short pulse generation",
        "temporal coherence and pulse-tailoring. Some of the schemes that can be tested at CLARA depend on a manipulation of the electron beam properties with characteristic scales shorter than the electron beam and require a 30 - 50 μm modulation of the beam energy acquired via the interaction with an infrared laser beam in a short undulator. In this article we describe the electron beam diagnostics required to carry on these experiments.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd06.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD06",
      "page_number": "147",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPD07",
      "title": "New MTCA.4-based Hardware Developments for the Control of the Optical Synchronization Systems at DESY",
      "authors": [
        "M. Felber",
        "M.K. Czwalinna",
        "H.T. Duhme",
        "M. Fenner",
        "C. Gerth",
        "M. Heuer",
        "T. Lamb",
        "U. Mavrič",
        "J.M. Mueller",
        "P. Peier",
        "H. Schlarb",
        "S. Schulz",
        "B. Steffen",
        "C. Sydlo",
        "M. Titberidze",
        "T. Walter",
        "R. Wedel",
        "F. Zummack",
        "DESY",
        "Hamburg",
        "Germany",
        "Warsaw University of Technology",
        "Institute of Electronic Systems",
        "Warsaw",
        "Poland",
        "T. Kozak",
        "P. Prędki",
        "K.P. Przygoda",
        "TUL-DMCS",
        "Łódź",
        "Poland",
        "NCBJ",
        "Świerk/Otwock",
        "Poland",
        "The optical synchronization group at DESY is operating and continuously enhancing their laser-based synchronization systems for various facilities which need femtosecond-stable timing. These include the free-electron lasers FLASH and the upcoming European XFEL as well as the electron diffraction machine REGAE and the plasma acceleration test facilities. One of the major upgrades under development is the migration of the entire electronic control hardware to the new MTCA.4 platform which was introduced as the new standard for accelerator control in many facilities worldwide. In this paper we present the applied modules and the topology of the new systems. Main advantages are a compact design with higher performance",
        "redundancy",
        "and remote management.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd07.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD07",
      "page_number": "152",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPD08",
      "title": "A Double-Prism Spectrometer for the Longitudinal Diagnosis of Femtosecond Electron Bunches with Mid-Infrared Transition Radiation",
      "authors": [
        "S. Wunderlich",
        "E. Hass",
        "B. Schmidt",
        "M. Yan",
        "DESY",
        "Hamburg",
        "Germany",
        "Electron bunch lengths in the sub-10 fs regime and charges of a few tens of picocoulombs are parameters required for free-electron lasers [*] and are also a consequence from the intrinsic process in laser-driven plasma wake field acceleration [**]. Since the coherent spectrum of transition radiation of these bunches carries the information on the longitudinal bunch profile in the form factor",
        "the spectroscopy of transition radiation is an attractive method to determine the electron bunch length. A double-prism spectrometer has been developed and demonstrated for the single-stage measurement of mid-infrared transition radiation between 2 μm and 18 μm. The spectrometer facilitates single-shot spectral measurements with high signal-to-noise ratio utilising a line array of mercury cadmium telluride detectors. In this contribution",
        "we present the spectrometer and measurements of electron bunches of the Free-Electron Laser in Hamburg (FLASH) at DESY. The results are compared to established bunch length monitors which are a multi-stage grating spectrometer for transition radiation and a transverse deflecting structure accessing the longitudinal phase space of the electron bunches directly.",
        "*J. Rönsch-Schulenburg et al.",
        "Proceedings of FEL 2014",
        "TUB04 (2014)",
        "to be published **O. Lundh et al.",
        "Nature Physics 7",
        "219–222 (2011)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd08.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD08",
      "page_number": "157",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPD09",
      "title": "Longitudinal Phase Space Tomography Using a Booster Cavity at the Photo Injector Test Facility at DESY, Zeuthen Site (PITZ)",
      "authors": [
        "D. Malyutin",
        "M. Groß",
        "I.I. Isaev",
        "M. Khojoyan",
        "G. Kourkafas",
        "M. Krasilnikov",
        "B. Marchetti",
        "F. Stephan",
        "G. Vashchenko",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "One of the ways to measure the longitudinal phase space of the electron bunch in a linear accelerator is a tomographic technique based on measurements of the bunch momentum spectra while varying the bunch energy chirp. The energy chirp at PITZ can be controlled by varying the RF phase of the CDS booster – the accelerating structure installed downstream the electron source (RF gun). The resulting momentum distribution can be measured with a dipole spectrometer downstream. As a result",
        "the longitudinal phase space at the entrance of the CDS booster can be reconstructed. In this paper the tomographic technique for longitudinal phase space measurements is described. Results of measurements at PITZ are presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd09.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD09",
      "page_number": "161",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPD10",
      "title": "New Results Of FERMI FEL1 EOS Diagnostics With Full Optical Synchronization",
      "authors": [
        "M. Veronese",
        "E. Allaria",
        "P. Cinquegrana",
        "E. Ferrari",
        "F. Rossi",
        "P. Sigalotti",
        "C. Spezzani",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "Università degli Studi di Trieste",
        "Trieste",
        "Italy",
        "The Electro Optical Sampling diagnostics (EOS) of the FERMI FEL has been recently upgraded with a full optical synchronization of its dedicated femtosecond fiber laser to the ultra-stable optical pulsed timing system of FERMI. For this purpose a dual synchronization electronics has been developed and installed. It exploits a mixed error signal derived from both optical to electrical conversion and from a second harmonic generation based optical phase detection. For this second part a new optical setup including a cross correlator has been installed. The operation of the EOS has greatly benefited from the upgrade. The arrival time measurements have been compared with the ones from the bunch arrival monitor diagnostics (BAM) showing very good agreement. This new setup has also allowed to improve the bunch profile measurement. Some examples of measurement with ZnTe and GaP are presented. Finally",
        "usability and operator friendliness of the new setup are also discussed.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd10.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD10",
      "page_number": "165",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPD11",
      "title": "Near-Saturation Single-Photon Avalanche Diode Afterpulse and Sensitivity Correction Scheme for the LHC Longitudinal Density Monitor",
      "authors": [
        "M. Palm",
        "E. Bravin",
        "S. Mazzoni",
        "CERN",
        "Geneva",
        "Switzerland",
        "Single-Photon Avalanche Diodes (SPADs) monitor the longitudinal density of the LHC beams by measuring the temporal distribution of synchrotron radiation. The relative population of nominally empty RF-buckets (satellites or ghosts) with respect to filled bunches is a key figure for the luminosity calibration of the LHC experiments. Since afterpulsing from a main bunch avalanche can be as high as",
        "or higher than",
        "the signal from satellites or ghosts",
        "an accurate correction algorithm is needed. Furthermore",
        "to reduce the integration time",
        "the amount of light sent to the SPAD is enough so that pile-up effects and afterpulsing cannot be neglected. The SPAD sensitivity has also been found to vary at the end of the active quenching phase. We present a method to characterize and correct for SPAD deadtime",
        "afterpulsing and sensitivity variation near saturation",
        "together with laboratory benchmarking."
      ],
      "institutions": [
        "Funding: CERN"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd11.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD11",
      "page_number": "169",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPD12",
      "title": "Novel Femtosecond Level Synchronization of Titanium Sapphire Laser and Relativistic Electron Beams",
      "authors": [
        "M. Titberidze",
        "F.J. Grüner",
        "A.R. Maier",
        "Uni HH",
        "Hamburg",
        "Germany",
        "M. Felber",
        "K. Flöttmann",
        "T. Lamb",
        "H. Schlarb",
        "C. Sydlo",
        "DESY",
        "Hamburg",
        "Germany",
        "F.J. Grüner",
        "A.R. Maier",
        "B. Zeitler",
        "CFEL",
        "Hamburg",
        "Germany",
        "Warsaw University of Technology",
        "Institute of Electronic Systems",
        "Warsaw",
        "Poland",
        "Laser driven plasma accelerators are offering high gradient (~ 10-100GV/m)",
        "high quality (low emittance",
        "short bunch length) electron beams which can be suitable for future compact",
        "bright and tunable light sources. In the framework of the Laboratory for Laser- and beam-driven plasma Acceleration (LAOLA) collaboration at Deutsches Elektronen-Synchrotron (DESY) the external injection experiment for injecting electron bunches from a conventional RF accelerator into the linear plasma wave is in progress. External injection experiments at REGAE (Relativistic Electron gun for Atomic Exploration) require sub-10 fs precision synchronization of laser and electron beams in order to perform a beam scan into the plasma wave by varying the delay between electron beam and laser pulses. In this paper we present a novel optical to microwave synchronization scheme",
        "based on a balanced single output integrated Mach-Zehnder Modulator (MZM). The scheme offers a highly sensitive phase detector between a pulsed 800 nm Ti:Sa laser and a 3GHz microwave reference source. It is virtually independent of input laser power fluctuation and it offers femtosecond long-term precision. Together with the principal of operation of this setup",
        "we will present promising preliminary experimental results of the detector stability.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd12.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD12",
      "page_number": "174",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPD15",
      "title": "CW Beam Stability Analysis in Time and Frequency Domain",
      "authors": [
        "M. Kuntzsch",
        "M. Gensch",
        "B.W. Green",
        "S. Kovalev",
        "U. Lehnert",
        "P. Michel",
        "R. Schurig",
        "J. Teichert",
        "HZDR",
        "Dresden",
        "Germany",
        "The superconducting quasi CW Linac ELBE has been characterized in terms of energy and timing stability. The measurement results presented show a combination of a laser-based bunch arrival-time measurements (BAM)",
        "a fast beam position monitor (BPM) readout with single bunch resolution and a compression monitor (BCM) based on a fast pyro-electric detector. By changing the bunch compression factor a separation and identification of jitter sources has been achieved. The quasi CW mode of operation enables frequency domain data analysis with high dynamic range",
        "which gives a better understanding of the main sources of jitter. Experimental results for both injectors (thermionic DC",
        "superconducting RF) are presented.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd15.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD15",
      "page_number": "179",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPD17",
      "title": "Single-Shot Electro-Optical Diagnostics at the ANKA Storage Ring",
      "authors": [
        "N. Hiller",
        "A. Borysenko",
        "E. Hertle",
        "V. Judin",
        "B. Kehrer",
        "A.-S. Müller",
        "M.J. Nasse",
        "M. Schuh",
        "P. Schönfeldt",
        "N.J. Smale",
        "J.L. Steinmann",
        "KIT",
        "Karlsruhe",
        "Germany",
        "P. Peier",
        "B. Steffen",
        "DESY",
        "Hamburg",
        "Germany",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "ANKA is the first storage ring in the world with a near-field single-shot electro-optical (EO) bunch profile monitor. The method of electro-optical spectral decoding (EOSD) uses the Pockels effect to modulate the longitudinal electron bunch profile onto a long",
        "chirped laser pulse passing through an EO crystal. The laser pulse is then analyzed with a single-shot spectrometer and from the spectral modulation",
        "the temporal distribution can be extracted. The setup is tuned to a sub-ps resolution (granularity) and can measure down to bunch lengths of 1.5 ps RMS for bunch charges as low as 30 pC. With this setup it is possible to study longitudinal beam dynamics (e. g. microbunching) occurring during ANKA's low-alpha-operation",
        "an operation mode with longitudinally compressed bunches to generate coherent synchrotron radiation in the THz range. In addition to measuring the longitudinal bunch profile",
        "long-ranging wake-fields trailing the electron bunch can also be studied",
        "hinting bunch-bunch interactions.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd17.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD17",
      "page_number": "182",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPD18",
      "title": "ALS Timing System Upgrade",
      "authors": [
        "J.M. Weber",
        "C.A. Lionberger",
        "W.E. Norum",
        "G.J. Portmann",
        "C. Serrano",
        "E.C. Williams",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The Advanced Light Source (ALS) is in the process of upgrading its timing system as a part of the ALS Instrumentation and Controls Upgrade project. The timing system built upon construction of the machine at the beginning of the 1990s is still in operation today",
        "and a replacement of the machine timing system is under way based on a commercially available solution",
        "benefiting from 20 years of improvements in the fields of digital electronics and optical communications. An overview of the new timing system architecture based on a Micro-Research Finland (MRF) solution is given here."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd18.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD18",
      "page_number": "187",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPD19",
      "title": "Bunch Arrival Time Monitor for PAL-XFEL",
      "authors": [
        "J.H. Hong",
        "J.H. Han",
        "H.-S. Kang",
        "C. Kim",
        "H. Yang",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "The X-ray Free Electron Laser project in Pohang Accelerator Laboratory (PAL-XFEL) requires high stability of bunch arrival time",
        "and measurement resolution better than a few femtoseconds. The pickups of the electron Bunch Arrival time Monitor (BAM) for PAL-XFEL have been developed and simulated. The BAM pickups are based on an S-band monopole cavity with two coupling loops. The prototype BAM has been fabricated and installed downstream of the accelerating column at the Injector Test Facility (ITF) for PAL-XFEL. In this paper we will present the recent measurement results on the beam test of the BAM as well as a proposed strategy for developing the BAM for PAL-XFEL.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd19.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD19",
      "page_number": "191",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPD21",
      "title": "Bunch Pattern Measurement via Single Photon Counting at",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd21.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD21",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPD23",
      "title": "Development Status of SINAP Timing System",
      "authors": [
        "M. Liu",
        "K.C. Chu",
        "C.X. Yin",
        "L.Y. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "After successful implementation of SINAP timing solution at Pohang Light Source in 2011",
        "we started to upgrade SINAP timing system to version 2. The hardware of SINAP v2 timing system is based on Virtex-6 FPGA chip",
        "and bidirectional event frame transfer is realized in a 2.5Gbps fiber-optic network. In event frame",
        "data transfer functionality substitutes for distributed bus. The structure of timing system is also modified",
        "where a new versatile EVO could be configured as EVG",
        "FANOUT or EVR with optical outputs. Besides standard VME modules",
        "we designed PLC-EVR as well",
        "which is compatible with Yokogawa F3RP61 series. Based on brand new hardware architecture",
        "the jitter performance of SINAP v2 timing system is improved remarkably."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd23.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD23",
      "page_number": "199",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPD24",
      "title": "Diagnostics of and with Laser-Induced Energy Modulation at the DELTA Storage Ring",
      "authors": [
        "S. Khan",
        "S. Hilbrich",
        "H. Huck",
        "M. Huck",
        "M. Höner",
        "C. Mai",
        "A. Meyer auf der Heide",
        "R. Molo",
        "H. Rast",
        "P. Ungelenk",
        "DELTA",
        "Dortmund",
        "Germany"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd24.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD24",
      "page_number": "202",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPD25",
      "title": "Time Domain Pickup Signal characterization for Low Charge Arrival-Time Measurements at FLASH",
      "authors": [
        "A. Angelovski",
        "R. Jakoby",
        "A. Penirschke",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "M.K. Czwalinna",
        "H. Schlarb",
        "C. Sydlo",
        "DESY",
        "Hamburg",
        "Germany",
        "TEMF",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "For the low charge operation mode at the European XFEL",
        "high bandwidth cone-shaped pickups were developed as a part of the Bunch Arrival-time Monitors (BAMs). The simulation showed that the signal parameters of interest",
        "the signal slope and bandwidth are improved by more than a factor of six compared to the state of the art pickups. The pickups are installed at FLASH for verification. In this paper",
        "time-domain measurements of the cone-shaped pickups at FLASH are presented. The pickup signal is recorded with a high bandwidth sampling oscilloscope. Two channel measurements are conducted with a single and a combined pickup signal in order to analyze the orbit and charge dependence of the pickup signal parameters. The measured time domain pickup signal wave form is compared to the CST PARTICLE STUDIO simulation.",
        "※ LaTeX",
        "※ Text",
        "※ IS/RefMan"
      ],
      "institutions": [],
      "abstract": "reference for this paper to",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd25.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD25",
      "page_number": "209",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPD26",
      "title": "A Bunch Extension Monitor for the Spiral2 LINAC",
      "authors": [
        "J.L. Vignet",
        "R.V. Revenko",
        "GANIL",
        "Caen",
        "France"
      ],
      "institutions": [],
      "abstract": "Measurements of the longitudinal shape of bunched beam particles are crucial for optimization and control of LINAC beam parameters and maximization of its integrated luminosity. The non-interceptive bunch extension monitor for the LINAC at the",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/mopd26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/mopd26.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/mopd26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-MOPD26",
      "page_number": "212",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 21,
  "scrape_time": "2025-10-10 17:56:19"
}