{
  "session_info": {
    "id": "THOA",
    "name": "THOA - FEL Technology -2-",
    "url": "https://proceedings.jacow.org/FEL2012/html/thoa.htm"
  },
  "papers": [
    {
      "paper_id": "THOA02",
      "title": "Photon Beam Transport Systems at FERMI@Elettra: Microfocusing FEL Beam with a K-B Active Optics System",
      "authors": [
        "L. Raimondi",
        "A. Abrami",
        "F. Capotondi",
        "M. De Marco",
        "C. Fava",
        "S. Gerusina",
        "R. Gobessi",
        "M. Kiskinova",
        "N. Mahne",
        "E. Mazzucco",
        "F. Parmigiani",
        "E. Pedersoli",
        "L. Rumiz",
        "G. Sostero",
        "C. Svetina",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "IOM-CNR",
        "Trieste",
        "Italy",
        "FERMI@Elettra",
        "the first seeded EUV-SXR FEL facility",
        "located at Sincrotrone Trieste S.C.p.A.",
        "is under advanced commissioning. It will provide ultrashort (10-100 fs) pulses with high peak brightness in the range 100-4 nm. The photon diagnostics section (PADReS) has been installed and commissioned during the last years. Three of the four installed beam lines (EIS-TIMER",
        "EIS-TIMEX",
        "DiProI and LDM) will employ active X-ray optics for focusing and beam-shaping. For DiProI and LDM the beam focusing is accomplished by K-B active X-ray optic mirrors to reach the fundamental diffraction limit. This system allows work with the two different undulator chains FEL1 and FEL2",
        "which have different source locations",
        "and perform an accurate mirror shaping and wave front optimization. In this work we present preliminary results of measurements with the DiProI beamline end-station. A focal spot size <20 μm at 32 nm has been obtained. We also compare these measurements with the predictions computed with a numerical method based on physical optics (Raimondi-Spiga Code [1]) starting from the mirror surface profile characterization. Measurements and simulations are in agreement.",
        "[1] Raimondi L.",
        "Spiga D.",
        "2011",
        "in Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series Vol. 8147 of Society"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/thoa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/thoa02.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/thoa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-THOA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THOA03",
      "title": "Use of Fringe-Resolved Autocorrelation for the diagnosis of the wavelength stability of a FEL",
      "authors": [
        "Y. Qin",
        "T. Kii",
        "T. Nakajima",
        "H. Ohgaki",
        "X. Wang",
        "H. Zen",
        "Kyoto University",
        "Institute for Advanced Energy",
        "Kyoto",
        "Japan",
        "For the spectroscopic applications of a FEL it is very important to monitor its wavelength stability. The most straightforward way is to take a laser spectrum at once with an array-type photodetector. This",
        "however",
        "is not an easy task at the wavelength regions (<190 nm or >1100 nm) where a Si-based array-type photodetector does not work. An alternative method has to be developed. In this paper we propose to use the autocorrelation setup",
        "which is usually used to measure the pulse duration",
        "to monitor the wavelength stability of a FEL. During the numerical simulation to demonstrate the above idea",
        "we have included various kinds of instabilities such as the central wavelength",
        "intensity",
        "and pulse duration as well as the chirps. Our results show that we can estimate the stability of the wavelength from the width of the upper envelope of fringe-resolved autocorrelation (FRAC) signals: Given the same pulse duration the FEL pulse with larger wavelength instability results narrower envelope width of FRAC signals. Based on this fact",
        "the FRAC can be used as a tool to diagnose the wavelength stability in the wavelength region where a direct spectrum measurement is not possible."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/thoa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/thoa03.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/thoa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-THOA03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THOA04",
      "title": "LUNEX 5 FEL Line  Undulators and Magnetic Elements",
      "authors": [
        "C. Benabderrahmane",
        "M.-E. Couprie",
        "C. Evain",
        "M. Labat",
        "A. Loulergue",
        "F. Marteau",
        "M. Valléau",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "J. Chavanne",
        "G. Lebec",
        "ESRF",
        "Grenoble",
        "France",
        "LUNEX 5 (free electron Laser Using a New accelerator for the Exploitation of X-ray radiation of 5th generation) aims at investigation the production of short intense and coherent pulses in the soft X-ray region with innovative schemes (such as echo and seeding with harmonics generated in gas) and compact design. The undulators of the FEL line are designed to provide high field short period devices: modulators are in-vacuum undulators with a period of 30 mm and 0.27 m long radiators are in cryo-ready vacuum undulators with period of 15 mm and 3 m long with a cryogenic option",
        "relying on SOLEIL development experience of NdFeB U20 hybrid in-vacuum undulators and 2 m long PrFeB U18 cryogenic undulator operated at 77 K installed on a long straight section of SOLEIL. In addition",
        "the line comports electromagnetic quadrupoles for the beam focusing; chicane dipoles for the beam compression and an electromagnetic bending magnet for the beam dump. A prototype of cryo-ready radiator is under design. Variable permanent magnet quadrupoles are under study for the transport of the Laser WakeField Accelerator towards the undulators."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/thoa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/thoa04.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/thoa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-THOA04",
      "page_number": "531",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:35:26"
}