{
  "session_info": {
    "id": "MOZB1",
    "name": "MOZB1 - Invited Oral Presentations (Accelerator Technology)",
    "url": "https://proceedings.jacow.org/IPAC2013/html/mozb1.htm"
  },
  "papers": [
    {
      "paper_id": "MOZB101",
      "title": "Progress in High Field Superconducting Magnet Technology for Accelerators",
      "authors": [
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Next-generation high-energy accelerators are presently under study to complement and expand the physics reach of LHC. The magnet system is a major cost driver for hadron colliders at the energy frontier",
        "and critical to the successful operation of muon colliders. Under most scenarios",
        "magnet design as well as vacuum and cryogenic systems are complicated by high radiation loads. Magnet R&D programs are underway worldwide to take advantage of new developments in superconducting materials",
        "achieve higher efficiency and simplify fabrication while preserving accelerator-class field quality. A review of recent progress in magnet technology is presented",
        "with emphasis on the leading design concepts and fabrication techniques applicable to future accelerators."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mozb101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mozb101.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mozb101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOZB101",
      "page_number": "21",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOZB102",
      "title": "Undulator Technologies for Future Free Electron Laser Facilities and Storage Rings",
      "authors": [
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "Insertion devices (undulators and wigglers) are key components for high brightness third generation synchrotron sources and for the amplifying medium of free electron lasers. Different technological developments carried out worldwide lead to improved undulator performance. In particular",
        "the advances concerning the in vacuum permanent magnet systems",
        "in particular for short period ones with the operation at cryogenic temperature with NdFeB or PrFeB magnets or for long period ones where in vacuum wigglers will be described. Secondly",
        "progress in Elliptical Polarised Undulators (EPU) will be discussed",
        "such as the DELTA undulator. Recent progress in superconducting undulators will also be reported. Finally",
        "the effect of the insertion devices on the light source operation is analysed",
        "either with the strategies to compensate unwanted effects or in viewing taking advantage of them as for Robinson or damping wigglers for reducing storage ring horizontal emittance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2013/talks/mozb102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2013/papers/mozb102.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2013/posters/mozb102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2013-MOZB102",
      "page_number": "26",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 21:00:30"
}