{
  "session_info": {
    "id": "TUXO",
    "name": "TUXO - Plasma Physics & Applications",
    "url": "https://proceedings.jacow.org/ECRIS2012/html/tuxo.htm"
  },
  "papers": [
    {
      "paper_id": "TUXO01",
      "title": "Coupling Microwave Power into ECR Ion Source Plasmas at Frequencies above 20 GHz",
      "authors": [
        "C.M. Lyneis",
        "J.Y. Benitez",
        "M.M. Strohmeier",
        "D.S. Todd",
        "LBNL",
        "Berkeley",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "Electron Cyclotron Resonance (ECR) ion sources have been built to operate at frequencies from 5 GHz to 28 GHz and typically use a plasma chamber that serves as a multi-mode cavity. For small sources operating at 6 to 14 GHz cavity mode-like behavior has been reported. In these cavities the vacuum mode density is low enough that it may be that the RF power distribution can be understood in terms of excitation of a few modes. The large superconducting ECR ion sources, such as VENUS, operating at higher frequencies have a much greater mode density and very strong damping from plasma microwave adsorption. In this type of source, how the RF is launched into the plasma chamber will strongly affect the microwave coupling and the chamber walls will be less important. The VENUS source uses round over-moded TE01 mode waveguide to couple to the plasma, while most modern fusion devices use quasi-gaussian HE11 waves for injection into plasmas. In this paper we will describe the potential advantages of applying this technology to superconducting ECR ion sources as well as designs for doing so with VENUS.",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuxo01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuxo01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuxo01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUXO01",
      "page_number": "1",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXO02",
      "title": "An Experimental Study of ECRIS Plasma Stability and Oscillation of Beam Current",
      "authors": [
        "O.A. Tarvainen",
        "T. Kalvas",
        "H. A. Koivisto",
        "J.P.O. Komppula",
        "V. Toivanen",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "C.M. Lyneis",
        "M.M. Strohmeier",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The stability of oxygen ion beams extracted from ECR ion sources has been studied with the superconducting ion source VENUS at LBNL and with the A-ECR type 14 GHz ECRIS at JYFL. Discrete Fourier transform has been used for characterizing beam current oscillations in kHz range exhibited by both ion sources. The effect of source parameters on the frequency and amplitude of the oscillations is discussed. It was found that double frequency heating affects the oscillation frequency",
        "biased disc can be used to mitigate the amplitude of beam current fluctuations",
        "increasing B-minimum results to pronounced instabilities and operating the ion source with significantly higher mirror ratio than suggested by ECRIS scaling laws yields the most stable ion beams. It is argued that the observed beam current fluctuations are correlated with plasma instabilities. A 'roadmap' for identifying the plasma instability mechanisms responsible for beam current fluctuations is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuxo02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuxo02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuxo02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUXO02",
      "page_number": "5",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXO03",
      "title": "Two-frequency Heating Technique for Stable ECR Plasma",
      "authors": [
        "A. Kitagawa",
        "M. Muramatsu",
        "NIRS",
        "Chiba-shi",
        "Japan",
        "S. Biri",
        "R. Rácz",
        "ATOMKI",
        "Debrecen",
        "Hungary",
        "National Institute of Radiological Sciences",
        "Chiba",
        "Japan",
        "Osaka University",
        "Graduate School of Engineering",
        "Osaka",
        "Japan",
        "N. Sasaki",
        "W. Takasugi",
        "AEC",
        "Chiba",
        "Japan",
        "As a method to improve highly charged ion production",
        "a technique to feed multiple microwaves with different frequencies is well-known. However the reason is not made sufficiently clear. Our group studied with two frequencies close together with a power of 600 W over by 18 GHz NIRS-HEC ECR ion source installed in the Heavy Ion Medical Accelerator in Chiba (HIMAC) at the National Institute of Radiological Sciences (NIRS). As a result",
        "it was revealed that the improvement of output beam current depends on the total power. In this case it seems that the two-frequency heating technique carries the advantage that the plasma instability at high microwave power is relieved. The effectiveness of an additional microwave depends on its frequency. It is necessary to optimize an additional frequency precisely; several tens MHz step against 18 GHz. The optimized frequency is directly influenced by the magnetic configuration. The necessary requirements for an additional microwave and the procedure of optimization in order to obtain a large advantage will be discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2012/talks/tuxo03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2012/papers/tuxo03.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2012/posters/tuxo03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2012-TUXO03",
      "page_number": "10",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:28:59"
}