{
  "session_info": {
    "id": "TUWAUD",
    "name": "TUWAUD - Muon Cooling I",
    "url": "https://proceedings.jacow.org/cool2015/html/tuwaud.htm"
  },
  "papers": [
    {
      "paper_id": "TUWAUD01",
      "title": "Status, Recent Results and Prospect of the International Muon Ionization Cooling Experiment (MICE)",
      "authors": [
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "Muon accelerators have been proposed as a means to produce intense",
        "high energy muon beams for particle physics. Designs call for beam cooling to provide suitable beams. Existing cooling schemes cannot operate on time scales that are competitive with the muon lifetime. Ionisation cooling has been proposed as a means to achieve sufficient cooling",
        "but it has never been demonstrated practically. In the Muon Ionisation Cooling Experiment (MICE)",
        "based at the Rutherford Appleton Laboratory",
        "ionisation cooling will be demonstrated. MICE Step IV is currently in progress and will be completed in 2016. Muons are brought onto an absorber",
        "resulting in a reduction of momentum and hence reduction of normalised transverse emittance. The full Demonstration of Ionisation Cooling will take place in 2017. An extra magnet module and RF cavities will be installed",
        "as in a cell of a cooling channel. This will enable demonstration of reduction of emittance and subsequent re-acceleration",
        "both critical components for a realistic ionisation cooling channel."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/tuwaud01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/tuwaud01.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/tuwaud01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-TUWAUD01",
      "page_number": "67",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUWAUD02",
      "title": "Affordable, Scalable, and Convincing 6-d Muon Cooling Demonstrations",
      "authors": [
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "S.A. Bogacz",
        "Y.S. Derbenev",
        "V.S. Morozov",
        "A.V. Sy",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The number of applications that could benefit from effective",
        "affordable muon cooling include stopping muon beams for rare decay searches and spin resonance",
        "intermediate energy beams for neutrino factories and cargo scanning",
        "and muon colliders for HIggs factories and the energy frontier. The simple ionization cooling equation implies that if you have a low-Z energy absorber in a strong magnetic field",
        "sufficient RF to contain the beam and replace the lost energy",
        "and some mechanism for emittance exchange",
        "you can achieve low 6-d emittance down to the limit implied by multiple scattering. The first cooling simulations that were based on a ring were exciting and encouraging. Unfortunately",
        "injection difficulties",
        "beam loading of RF cavities and energy absorbers",
        "and the need to modify cooling parameters as the beam cools have led us away from a ring towards a cooling channel. An effective demonstration experiment must show that the final muon beam parameters to achieve the required luminosity can be achieved at an acceptable cost. We discuss the possibility that a demonstration experiment is a section of a practical",
        "high performance cooling channel.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/tuwaud02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/tuwaud02.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/tuwaud02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-TUWAUD02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUWAUD03",
      "title": "Study of Helical Cooling Channel for Intense Muon Source",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "Linear beam dynamics of muons in a helical cooling channel is non-trivial. Betatron oscillation in the channel is induced by coupling of motions in xyz-planes. As a result",
        "the analytic eigen values are very complicated. The cooling decrements are controlled by tuning coupling strength. The helical dynamic parameters are translated into the conventional accelerator physics term. Non-linear dynamics in the helical channel is studied by using the conventional accelerator technique. The beam-plasma interaction in a high-pressure hydrogen gas-filled RF cavity is a new physics process and important to design the cooling channel. Machine development of helical beam elements is also shown in this presentation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/tuwaud03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/tuwaud03.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/tuwaud03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-TUWAUD03",
      "page_number": "72",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUWAUD04",
      "title": "Progress on Parametric-resonance Ionization Cooling",
      "authors": [
        "V.S. Morozov",
        "Y.S. Derbenev",
        "A.V. Sy",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "GWU",
        "Washington",
        "USA",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "Proposed next-generation muon collider will require major technical advances to achieve the rapid muon beam cooling requirements. Parametric-resonance Ionization Cooling (PIC) is proposed as the final 6D cooling stage of a high-luminosity muon collider. In PIC",
        "a half-integer parametric resonance causes strong focusing of a muon beam at appropriately placed energy absorbers while ionization cooling limits the beam's angular spread. Combining muon ionization cooling with parametric resonant dynamics in this way should then allow much smaller final transverse muon beam sizes than conventional ionization cooling alone. One of the PIC challenges is compensation of beam aberrations over a sufficiently wide parameter range while maintaining the dynamical stability with correlated behavior of the horizontal and vertical betatron motion and dispersion. We explore use of a coupling resonance to reduce the dimensionality of the problem and to shift the dynamics away from non-linear resonances. PIC simulations are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/tuwaud04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/tuwaud04.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/tuwaud04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-TUWAUD04",
      "page_number": "77",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:20:34"
}