{
  "session_info": {
    "id": "WECO",
    "name": "WECO - Beam extraction & optics",
    "url": "https://proceedings.jacow.org/ecris2016/html/weco.htm"
  },
  "papers": [
    {
      "paper_id": "WECO01",
      "title": "Intermediate Commissioning Results of the Required 140 mA/100 keV CW D+ ECR Injector of LIPAc, IFMIF's Prototype",
      "authors": [
        "B. Bolzon",
        "N. Chauvin",
        "R. Gobin",
        "F. Senée",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "P.-Y. Beauvais",
        "H. Dzitko",
        "F4E",
        "Germany",
        "L. Bellan",
        "M. Comunian",
        "E. Fagotti",
        "A. Pisent",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "Univ. degli Studi di Padova",
        "Padova",
        "Italy",
        "P. Cara",
        "R. Heidinger",
        "Fusion for Energy",
        "Garching",
        "Germany",
        "CEA/DSM/IRFU",
        "France",
        "R. Ichimiya",
        "A. Ihara",
        "A. Kasugai",
        "T. Kitano",
        "M. Komata",
        "K. Kondo",
        "K. Sakamoto",
        "T. Shinya",
        "M. Sugimoto",
        "QST",
        "Aomori",
        "Japan",
        "J. Knaster",
        "A. Marqueta",
        "K. Nishiyama",
        "Y. Okumura",
        "G. Pruneri",
        "F. Scantamburlo",
        "IFMIF/EVEDA",
        "Rokkasho",
        "Japan"
      ],
      "institutions": [
        "The LIPAc accelerator aims to operate in Rokkasho Fusion Institute a 125 mA/CW deuteron beam at 9 MeV to validate the concept of IFMIF's accelerators that will operate in CW 125 mA at 40 MeV. The 2.45 GHz ECR injector developed by CEA-Saclay is designed to deliver 140 mA/100 keV CW D+ beam with 99% D+ fraction ratio. Its LEBT relies on a dual solenoid focusing system to transport and match the beam into the RFQ. The normalized RMS emittance at the RFQ injection cone is required to be within 0.25π mm·mrad to allow 96% transmission through the 9.81 m long RFQ. An equal perveance H+ beam of half current and half energy as nominal with D+ is used to avoid activation during commissioning. The injector commissioning at Rokkasho is divided into three phases to characterize the emittance between the two solenoids of the LEBT (A1) and just downstream the RFQ injection cone (A2) and the extraction system of the source (A3). Phase A1 has been achieved and phase A2 continues in 2016 in order to reach the required beam parameters and to match the beam into the RFQ. This paper reports the commissioning results of phase A1 and the intermediate ones of phase A2 for H+ and D+ beams."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weco01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weco01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weco01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WECO01",
      "page_number": "67",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECO02",
      "title": "Development of a Compact High Intensity Ion Source for Light Ions   at CEA-Saclay",
      "authors": [
        "O. Delferrière",
        "Y. Gauthier",
        "R. Gobin",
        "O. Tuske",
        "CEA/IRFU",
        "Gif-sur-Yvette",
        "France",
        "CEA/DRF/IRFU",
        "Gif-sur-Yvette",
        "France",
        "During the past 5 years",
        "a R&D program has been launched to improve the beam quality of ECR 2.45 GHz high intensity light ion sources for high power accelerators. The main goal was to minimize the divergence and emittance growth of intense beams due to the space charge as early as possible on the low energy transfer line for a better injection in the second stage of acceleration (RFQ). This has been achieved by reducing the length of the extraction system",
        "to be able to put the first solenoid as close as possible to the extraction aperture. This was performed with the ALISES concept (Advanced Light Ion Source Extraction System). Encouraging results have been obtained in 2012 but with limitations due to Penning discharges in the accelerating column. Taking advantages of ALISES geometry",
        "intensive studies and simulations have been undertaken to eliminate the discharge phenomena. An Innovative and compact source geometry has been found and the source has been fabricated. This new prototype and its performances will be described",
        "as well as magnetic field configuration studies and its influence on the extracted beam."
      ],
      "institutions": [],
      "abstract": "This source developed at Saclay is under patent number FR 15 56871 and this patent is pending",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weco02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weco02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weco02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WECO02",
      "page_number": "73",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECO03",
      "title": "Transverse Coupling of Ion Beams From an RCR Ion Source",
      "authors": [
        "Y. Yang",
        "Y. Liu",
        "L.T. Sun",
        "Y.J. Yuan",
        "H.W. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "ECR ion source beam quality will deteriorate under the influence of beam transverse coupling and high-order magnetic field aberration. Ion beams from an ECR ion source will experience a descending axial magnetic field at the extraction region",
        "leading to a strong transverse coupling to the extracted beam",
        "with projection emittance growth both in horizontal and vertical and two eigen emittances separation. On the other hand",
        "sextupole field in the ECR and the sextupole component in the analyzing dipole can also degrade the beam quality by resulting in beam distortion. Proper adjusting of the extraction field strength of the ion source and the pre-focusing solenoid field can help to weaken the correlation in the inter-plane phase spaces and reduce the projection emittances. Another approach to improve the beam quality is to compensate for the high-order magnetic fields. This paper presents the property of beam coupling in the transverse phase space by analytical theory and simulations. Some experimental results are also presented and discussed. In addition",
        "a high-order compensation scheme is displayed",
        "whose feasibility has been verified by preliminary tests with SECRAL at IMP."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weco03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weco03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weco03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WECO03",
      "page_number": "76",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECO04",
      "title": "Progress of an Intense Ion Source and Low Energy Beam Transport System for  Jinping Underground Nuclear Astrophysics Experiments",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Jinping Underground Laboratory for Nuclear Astrophysics (JUNA) will take the advantage of the ultra low background and high current accelerator facility to study directly a number of important reactions at stellar energies",
        "such as 25Mg(p",
        "γ)26Al",
        "19F(p",
        "α)16O",
        "13C(α",
        "n)16O",
        "and 12C(α",
        "γ)16O reactions. As a key component of high current accelerator facility",
        "the performance of ion source has a very important effect on the beam quality. In order to produce the requested 10 emA H+",
        "10 emA He+ and 2.5 emA He2+ at the exit of low energy beam transport (LEBT) line",
        "an intense 2.45GHz ECR ion source operated at the maximum energy of 50keV/q will be developed for JUNA project. The ion beam extracted by a 3-electrode extraction system passes through a low energy beam transport system",
        "which is composed of identical solenoids and dipole magnet",
        "into the entrance of acceleration tube (AT). In this paper",
        "the main technique risks",
        "physics design of the ion source and LEBT will be discussed. The progress of the ion source and LEBT",
        "such as mechanical design",
        "magnetic elements",
        "beam diagnostic units of LEBT and development of ion source will be introduced.",
        "1. Q. Wu. Z.M. Zhang",
        "L.T. Sun et al. Rev. Sci. Instrum. 85.02A703. (2014)  2. ZHANG Meng",
        "PENG Shi-Xiang; SONG Zhi-Zhong etal. Chinese physics C",
        "2008 Vol. 32 (S1): 220-222"
      ],
      "institutions": [
        "Funding: This work is supported by the equipment research and development project of Chinese Academy of Sciences and National Natural Science Foundation of China under grant NO.11221064."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weco04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weco04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weco04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WECO04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:27:47"
}