{
  "session_info": {
    "id": "MOPV",
    "name": "MOPV - Posters",
    "url": "https://proceedings.jacow.org/icalepcs2021/html/mopv.htm"
  },
  "papers": [
    {
      "paper_id": "MOPV001",
      "title": "Status of the SARAF-Phase2 Control System",
      "authors": [
        "F. Gougnaud",
        "P. Bargueden",
        "G. Desmarchelier",
        "A. Gaget",
        "P. Guiho",
        "A. Lotode",
        "Y. Mariette",
        "V. Nadot",
        "N. Solenne",
        "CEA-DRF-IRFU",
        "France",
        "D. Darde",
        "G. Ferrand",
        "F. Gohier",
        "T.J. Joannem",
        "G. Monnereau",
        "V. Silva",
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "H. Isakov",
        "A. Perry",
        "E. Reinfeld",
        "I. Shmuely",
        "Y. Solomon",
        "N. Tamim",
        "Soreq NRC",
        "Yavne",
        "Israel",
        "CEA LIST",
        "Palaiseau",
        "France",
        "SNRC and CEA collaborate to the upgrade of the SARAF accelerator to 5 mA CW 40 Mev deuteron and proton beams and also closely to the control system. CEA is in charge of the Control System (including cabinets) design and implementation for the Injector (upgrade)",
        "MEBT and Super Conducting Linac made up of 4 cryomodules hosting HWR cavities and solenoid packages. This paper gives a detailed presentation of the control system architecture from hardware and EPICS software points of view. The hardware standardization relies on MTCA.4 that is used for LLRF",
        "BPM",
        "BLM and FC controls and on Siemens PLC 1500 series for vacuum",
        "cryogenics and interlock. CEA IRFU EPICS Environment (IEE) platform is used for the whole accelerator. IEE is based on virtual machines and our MTCA.4 solutions and enables us to have homogenous EPICS modules. It also provides a development and production workflow. SNRC has integrated IEE into a new IT network based on advanced technology. The commissioning is planned to start late summer 2021."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv001.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV001",
      "page_number": "93",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV002",
      "title": "CENBG Control System and Specific Instrumentation Developments for",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv002.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV003",
      "title": "Laser Megajoule Facility Operating Software Overview",
      "authors": [
        "J-P. Airiau",
        "V. Denis",
        "H. Durandeau",
        "P. Fourtillan",
        "N. Loustalet",
        "P. Torrent",
        "CEA",
        "LE BARP cedex",
        "France",
        "The Laser MegaJoule (LMJ)",
        "the French 176-beam laser facility",
        "is located at the CEA CESTA Laboratory near Bordeaux (France). It is designed to deliver about 1.4 MJ of energy on targets",
        "for high energy density physics experiments",
        "including fusion experiments. The first bundle of 8-beams was commissioned in October 2014. By the end of 2021",
        "ten bundles of 8-beams are expected to be fully operational. Operating software tools are used to automate",
        "secure and optimize the operations on the LMJ facility. They contribute to the smooth running of the experiment process (from the setup to the results). They are integrated in the maintenance process (from the supply chain to the asset management). They are linked together in order to exchange data and they interact with the control command system. This talk gives an overview of the existing operating software and the lessons learned. It finally explains the incoming works to automate the lifecycle management of elements included in the final optic assembly (replacement",
        "repair",
        "etc.)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv003.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV003",
      "page_number": "104",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV005",
      "title": "Towards a New Control System for PETRA IV",
      "authors": [
        "R. Bacher",
        "T. Delfs",
        "D. Mathes",
        "T. Tempel",
        "T. Wilksen",
        "DESY",
        "Hamburg",
        "Germany",
        "At DESY",
        "an upgrade of the PETRA III synchrotron light source towards a fourth-generation",
        "low emittance machine PETRA IV is currently being actively pursued. The basic concept of the control system of PETRAIV is to exploit synergies between all accelerator facilities operated by DESY. The key figures of PETRAIV’s new accelerator control system include the DOOCS control system framework",
        "high-end MTCA.4 technology compliant hardware interfaces for triggered",
        "high-performance applications and hardware interfaces for conventional slow-control applications compliant with industrial process control standards such as OPC UA",
        "and enhanced data acquisition and data storage capabilities. In addition",
        "the suitability of standards for graphical user interfaces based on novel Web application technologies will be investigated. Finally",
        "there is a general focus on improving quality management and quality assurance measures",
        "including proper configuration management",
        "requirements management",
        "bug tracking",
        "software development",
        "and software lifetime management. The paper will report on the current state of development."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv005.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV005",
      "page_number": "108",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV006",
      "title": "The New Small Wheel Low Voltage Power Supply DCS for the ATLAS Experiment",
      "authors": [
        "NTUA",
        "Athens",
        "Greece",
        "The present ATLAS Small Wheel detector will be replaced with the New Small Wheel(NSW) which is expected to be installed in the ATLAS underground cavern by the end of the LS2. Due to its complexity and long-term operation",
        "NSW requires the development of a sophisticated Detector Control System. The use of such a system is necessary to allow the detector to function consistently as a seamless interface to all sub-detectors and the technical infrastructure of the experiment. The central system handles the transition between the possible operating states while ensuring monitoring and archiving of the system’s parameters. The part that will be described is the modular system of Low Voltage. The new LV Intermediate Control Station will be used to power all the boards of the NSW and through them providing readout and trigger data while functioning safely. Among its core features are remote control",
        "split of radiation sensitive parts from parts that can be housed in a hostile area and compatibility with operation under radiation and magnetic field as in the ATLAS cavern."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv006.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV006",
      "page_number": "111",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV007",
      "title": "Progress of The HIAF Control System",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "High Intensity Heavy-ion Accelerator Facility (HIAF) is one of the 16 projects of the 12th Five-Year Plan (2012-2030). It is a next-generation heavy ion scientific research device with international leading level and wide range of subject uses. The task of the control system is to complete the task of overall control",
        "including the overall structure of the control system",
        "the standard of the control system interface",
        "the time system",
        "the database system",
        "the network system. At present",
        "the overall task and subsystem control scheme design and verification have been basically completed. The standard of unified control system software interface under EPICS frame is established and the middle-layer software development platform based on Python+C+C++ is developed",
        "which facilitates the development of hardware layer and application layer personnel. Hardware selection and functional testing have also been completed. By the end of this year",
        "we will have completed the time system prototype",
        "next year began to purchase hardware equipment",
        "2022-2024 on-site equipment installation and commissioning.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv007.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPV008",
      "title": "Development of Computer Centralized Control System for Large- Scale Equipment",
      "authors": [
        "Ms. Yao",
        "Z. Ni",
        "X. Zhou",
        "CAEP",
        "Sichuan",
        "People’s Republic of China",
        "The Computer centralized control system is the command center of SG-III large-scale equipment. It controls and integrates the major systems of the equipment",
        "forms a centralized and complete operation control and management platform",
        "completes the control",
        "monitoring",
        "experimental analysis and other functions of the equipment",
        "and analyzes the operation and maintenance status of the equipment data. The Computer centralized control system is mainly composed of computer centralized control platform",
        "control software",
        "synchronization system and each specific function control subsystems. This paper analyzes the design of computer centralized control platform. Prepare to discuss the control structure",
        "hardware/software hierarchy",
        "controlling business processes",
        "integration process",
        "and software design",
        "data management",
        "etc.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv008.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPV009",
      "title": "The HV DCS System for the New Small Wheel Upgrade of the ATLAS Experiment",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "The ATLAS muon spectrometer will exceed its design capabilities in the high background radiation as expected during the upcoming runs and at HL-LHC. In order to cope with the foreseen limitations",
        "it was decided to replace the SW with a New SW (NSW) system",
        "by combining two prototype detectors",
        "the sTGC & and resistive Micromegas. Both technologies are ’aligned’ to the ATLAS general baselines for the NSW upgrade project",
        "maintaining in such way the excellent performance of the muon system beyond Run-3. Complementary to the R&D of these detectors",
        "an intuitive control system was of vital importance. The Micromegas DCS (MMG HV) and the sTGC DCS (STG HV) for the NSW have been developed",
        "following closely the existing look",
        "feel and command architecture of the other Muon sub-systems. The principal task of the DCS is to enable the coherent and safe operation of the detector by continuously monitoring its operational parameters and its overall state. Both technologies will be installed in ATLAS and will be readout and monitored through the common infrastructure. Aim of this work is the description of the development and implementation of a DCS for the HV system of both technologies."
      ],
      "institutions": [],
      "abstract": "This paper has been submitted on behalf of the ATLAS Muon Collaboration",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv009.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV009",
      "page_number": "115",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV010",
      "title": "Working under Pandemic Conditions: Contact Tracing Meets Technology",
      "authors": [
        "E. Blanco Viñuela",
        "B. Copy",
        "S. Danzeca",
        "Ch. Delamare",
        "R. Losito",
        "A. Masi",
        "E. Matli",
        "T. Previero",
        "R. Sierra",
        "CERN",
        "Geneva",
        "Switzerland",
        "Covid-19 has dramatically transformed our working practices with a big change to a teleworking model for many people. There are however many essential activities requiring personnel on site. In order to minimise the risks for its personnel CERN decided to take every measure possible",
        "including internal contact tracing by the CERN medical service. This initially involved manual procedures which relied on people’s ability to remember past encounters. To improve this situation and minimise the number of employees who would need to be quarantined",
        "CERN approved the design of a specific device: the Proximeter. The project goal was to design a wearable device",
        "built in a partnership* with industry fulfilling the contact tracing needs of the medical service. The proximeter records other devices in close proximity and reports the encounters to a cloud-based system. The service came into operation early 2021 and 8000 devices were distributed to personnel working on the CERN site. This publication reports on the service offered",
        "emphasising on the overall workflow of the project under exceptional conditions and the implications data privacy imposed on the design of the software application."
      ],
      "institutions": [],
      "abstract": "* Terabee. https://www.terabee.com",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv010.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV010",
      "page_number": "121",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV011",
      "title": "The Inclusion of White Rabbit into the Global Industry Standard IEEE 1588",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "White Rabbit (WR) is the first CERN-born technology that has been incorporated into a global industry standard governed by the Institute of Electrical and Electronics Engineers (IEEE)",
        "the IEEE 1588 Precision Time Protocol (PTP). This showcase of technology transfer has been beneficial to both the standard and to WR technology. For the standard",
        "it has allowed the PTP synchronisation performance to be increased by several orders of magnitude",
        "opening new markets and opportunities for PTP implementers. While for WR technology",
        "the review during its standardisation and its adoption by industry makes it future-proof and drives down prices of the WR hardware that is widely used in scientific installations. This article provides an insight into the 7-year-long WR standardisation process",
        "describing its motivation",
        "benefits",
        "costs and the final result. After a short introduction to WR",
        "it describes the process of reviewing",
        "generalising and translating it into an IEEE standard. Finally",
        "it retrospectively evaluates this process in terms of efforts and benefits to conclude that basing new technologies on standards and extending them bears short-term costs that bring long-term benefits."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv011.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV011",
      "page_number": "126",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV012",
      "title": "The ESRF-EBS Simulator: A Commissioning Booster",
      "authors": [
        "S.M. Liuzzo",
        "L.R. Carver",
        "J.M. Chaize",
        "L. Farvacque",
        "A. Götz",
        "D. Lacoste",
        "N. Leclercq",
        "F. Poncet",
        "E.T. Taurel",
        "S.M. White",
        "ESRF",
        "Grenoble",
        "France",
        "The ESRF-Extremely Brilliant Source (ESRF-EBS)* is the first-of-a-kind fourth-generation high-energy synchrotron. After only a 20-month shutdown",
        "scientific users were back to carry out experiments with the new source. The EBS Simulator (EBSS) played a major role in the success of the commissioning of the new storage ring. Acting as a development",
        "sandbox and training platform",
        "the machine simulator allowed control room applications and tools to be up and ready from day one. The EBSS can also be seen as the initial block of a storage ring digital twin. The present article provides an overview of the current status of the EBS Simulator and presents the current roadmap foreseen for its future.",
        "* J.C.Biasci et al.",
        "\"A Low-Emittance Lattice for the ESRF.’ Synchrotron Radiation News 27.6 (2014)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv012.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV012",
      "page_number": "132",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV013",
      "title": "A Dynamic Beam Scheduling System for the FAIR Accelerator Facility",
      "authors": [
        "S. Krepp",
        "J. Fitzek",
        "H.C. Hüther",
        "R. Mueller",
        "A. Schaller",
        "A. Walter",
        "GSI",
        "Darmstadt",
        "Germany",
        "The new Accelerator Control System for GSI/FAIR is now being used productively for the GSI accelerator facility. As the central component for online beam orchestration",
        "the Beam Scheduling System (BSS) is situated between the FAIR Settings Management System and the FAIR timing system. Besides device settings",
        "the Settings Management System provides timing schedules for beam production. The primary purpose of the BSS is to define which of the beam schedules are executed by the timing system",
        "how often and in which order. To provide runtime decisions in pre-planned execution options (e.g. skipping of a particular beam)",
        "it processes external signals like user input",
        "experiment requests or beam prohibits provided by the interlock system. More recently",
        "advanced features have been added that allow for dynamic execution control required by storage ring mode features such as breakpoints",
        "repetitions",
        "skipping and manipulations. This contribution gives an overview of the Beam Scheduling System including its interfaces."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv013.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV013",
      "page_number": "138",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV014",
      "title": "Upgrade of the NewSUBARU Control System",
      "authors": [
        "N. Hosoda",
        "Y. Hamada",
        "M. Ishii",
        "A. Kiyomichi",
        "K. Okada",
        "T. Sugimoto",
        "JASRI",
        "Hyogo",
        "Japan",
        "RIKEN/SPring-8",
        "Hyogo",
        "Japan",
        "NewSUBARU has constructed a new dedicated injector in order to separate the operation from SPring-8 and to operate independently. In designing this injector",
        "we tried to share the same components as those of the Tohoku Synchrotron Radiation Facility",
        "which will be completed in 2023",
        "in order to make effective use of human resources. The control system of the injector and the existing storage ring must be constructed as unified system",
        "so the file server",
        "DB server",
        "backbone network",
        "etc. were redesigned using the control system used in SPring-8/SACLA as a control framework. MTCA.4 was used to control the injector",
        "and EtherCAT was used to communicate with the PLC. For the control of the storage ring",
        "the existing equipment configuration was retained and the control framework was migrated. In this paper",
        "we report the details of the NewSUBARU control system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv014.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV014",
      "page_number": "143",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV015",
      "title": "Control System of the SRILAC Project at RIBF",
      "authors": [
        "A. Uchiyama",
        "M. Fujimaki",
        "N. Fukunishi",
        "Y. Higurashi",
        "E. Ikezawa",
        "H. Imao",
        "O. Kamigaito",
        "M. Kidera",
        "M. Komiyama",
        "K. Kumagai",
        "T. Nagatomo",
        "T. Nakagawa",
        "T. Nishi",
        "J. Ohnishi",
        "K. Ozeki",
        "N. Sakamoto",
        "K. Suda",
        "T. Watanabe",
        "Y. Watanabe",
        "K. Yamada",
        "RIKEN Nishina Center",
        "Wako",
        "Japan",
        "National Instruments Japan Corporation",
        "MInato-ku",
        "Tokyo",
        "Japan",
        "K. Kaneko",
        "R. Koyama",
        "T.O. Ohki",
        "K. Oyamada",
        "M. Tamura",
        "H. Yamauchi",
        "Y.A. Yusa",
        "SHI Accelerator Service Ltd.",
        "Tokyo",
        "Japan",
        "At RIKEN Nishina Center",
        "the SRILAC project has been launched for the search experiments of super-heavy-elements with atomic numbers of 119 and higher. The main points of the SRILAC project are as follows. Superconducting RIKEN Linear Accelerator (SRILAC) was newly installed at downstream of existing accelerator (RIKEN Linear Accelerator: RILAC) to enhance beam energy. Additionally",
        "a new RIKEN 28-GHz superconducting electron cyclotron resonance ion source has been implemented at the frontend of SRILAC to increase beam intensity. With that",
        "the SRILAC control system requires corrections and upgrades to the shortcomings of previous RILAC control system",
        "for example control methods for electromagnet power supplies",
        "an machine protection system and an archive system. Moreover",
        "there was also a issue to be solved for methods of integration with small LabVIEW-based systems. To operate efficiently in the SRILAC project",
        "a distributed control system utilizing EPICS should be adopted as in RIBF",
        "a higher-level application protocol needs to be integrated to EPICS Channel Access protocol. In this conference",
        "we report the system implementation",
        "developed tool in detail about SRILAC project."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv015.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV015",
      "page_number": "147",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPV016",
      "title": "Design and Implement of Web Based SCADA System for HUST Field-Reversed Configuration Device",
      "authors": [
        "F.Y. Wu",
        "Y.X. Jiang",
        "W.S. Wang",
        "X.H. Xie",
        "HUST",
        "Wuhan",
        "People’s Republic of China",
        "S. Li",
        "B. Rao",
        "Y. Yang",
        "M. Zhang",
        "P.L. Zhang",
        "W. Zheng",
        "Huazhong University of Science and Technology",
        "State Key Laboratory of Advanced Electromagnetic Engineering and Technology",
        "Hubei",
        "People’s Republic of China",
        "As a large complex fusion research device for stud-ying field reversed configuration (FRC) plasma",
        "HUST FRC(HFRC) is composed of many subsystems. In order to coordinate all systems and ensure the correct",
        "orderly and stable operation of the whole experimental device",
        "it is very important to have a unified and powerful control system. HFRC SCADA(Supervisory Control And Data Ac-quisition) system has selected the in-house developed CFET’Control system Framework for Experimental Devices Toolkit’as the control framework",
        "with ad-vantages of strong abstraction",
        "simplified framework",
        "transparent protocol and flexible extension due to Web technology."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv016.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV016",
      "page_number": "153",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV017",
      "title": "CERN SCADA Systems 2020 Large Upgrade Campaign Retrospective",
      "authors": [
        "L.G. Goralczyk",
        "A.F. Kostopoulos",
        "B. Schofield",
        "J-C. Tournier",
        "CERN",
        "Geneva",
        "Switzerland",
        "In this paper we report the experience from a large-scale upgrade campaign of SCADA control systems performed during the second LHC Long Shutdown at CERN. Such periodical upgrades are dictated by the ever evolving SCADA WinCC OA system and the CERN frameworks evolution used in those control systems. These upgrades concern: accelerator control systems",
        "e.g. quench protection system",
        "powering interlocks",
        "magnet alignment; control systems devoted to accelerator facilities such as cryogenics",
        "vacuum",
        "gas… and other global technical infrastructure systems as well as the CERN electrical distribution system. Since there are more than 200 SCADA projects covering the CERN accelerator complex and technical infrastructure",
        "any disruption requires careful coordination",
        "planning and execution with process owners. Having gained experience from previous campaigns and reaching a new level of automation we were able to make visible improvements by shortening the required time and reducing the personnel required. Activities",
        "lessons learned and further improvements are presented as well as a comprehensive statistical insight of the whole campaign."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv017.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV017",
      "page_number": "156",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV018",
      "title": "Linac-200 Gun Control System: Status and Plans",
      "authors": [
        "M.A. Nozdrin",
        "V.V. Kobets",
        "V.F. Minashkin",
        "A. Trifonov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Due to the development of the global Tango-based control system for Linac-200 accelerator",
        "the new electron gun control system software was developed. Major gun electronics modification is foreseen. Current gun control system status and modification plans are reported."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv018.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV018",
      "page_number": "161",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV019",
      "title": "PVEcho: Design of a Vista/EPICS Bridge for the ISIS Control System Transition",
      "authors": [
        "K.R.L. Baker",
        "I.D. Finch",
        "G.D. Howells",
        "M. Romanovschi",
        "A.A. Saoulis",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The migration of the ISIS Controls System from Vsystem to EPICS presents a significant challenge and risk to the day-to-day operations of the accelerator. An evaluation of potential options has indicated that the most effective migration method to mitigate against this risk is to make use of a ‘hybrid’ system running Vsystem and EPICS simultaneously. This allows for a phased porting of controls hardware from the existing software to EPICS. This work will outline the prototype Vsystem/EPICS bridge that will facilitate this hybrid operation",
        "referred to as pvecho. The bridge has been developed in Python",
        "utilising existing communication from Vsystem to an MQTT broker developed as part of a previous project. Docker containers have been used for its development to create an isolated test environment to allow the software to communicate with other services currently used at ISIS."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv019.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV019",
      "page_number": "164",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV020",
      "title": "Digitisation of the Analogue Waveform System at ISIS",
      "authors": [
        "W.A. Frank",
        "B.R. Aljamal",
        "R.A. Washington",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The Analogue Waveform System (AWS) at the ISIS Neutron and Muon Source is a distributed system that allows operators to select and monitor analogue waveforms from equipment throughout the facility on oscilloscopes in the Main Control Room (MCR). These signals originate from key accelerator systems in the linear accelerator and synchrotron such as the ion source",
        "magnets",
        "beam diagnostics",
        "and radio frequency (RF) systems. Historical data for ISIS is available on the control system for many relevant channels. However",
        "at present",
        "to avoid disrupting the oscilloscope displays in the MCR",
        "only an hourly image capture of the AWS waveforms is stored. This is largely inadequate for potential data-intensive applications such as anomaly detection",
        "predictive maintenance",
        "post-mortem analysis",
        "or (semi-)automated machine setup",
        "optimization",
        "and control. To address this",
        "a new digital data acquisition (DAQ) system is under development based on the principle of large channel count",
        "simultaneous DAQ. This paper details the proposed architecture of the system and the results of initial prototyping",
        "testing",
        "and commissioning."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv020.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV020",
      "page_number": "169",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPV021",
      "title": "Upgrading the National Ignition Facility’s (NIF) Integrated Computer Control System to Support Optical Thompson Scattering (OTS) Diagnostic",
      "authors": [
        "A.I. Barnes",
        "A.A.S. Awwal",
        "L. Beaulac",
        "B. Blackwell",
        "G.K. Brunton",
        "K. Burns",
        "J.R. Castro Morales",
        "M. Fedorov",
        "R. Lacuata",
        "R.R. Leach",
        "D.G. Mathisen",
        "V.J. Miller Kamm",
        "S. Muralidhar",
        "V. Pacheu",
        "Y. Pan",
        "S. Patankar",
        "B.P. Patel",
        "M. Paul",
        "R. Rozenshteyn",
        "R.J. Sanchez",
        "S. Sauter",
        "M. Taranowski",
        "D. Tucker",
        "K.C. Wilhelmsen",
        "B.A. Wilson",
        "H. Zhang",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "With the ability to deliver 2.1 MJ of 500 TW ultraviolet laser light to a target",
        "the National Ignition Facility (NIF) is the world’s most energetic laser. This combination of energy and power allows the study of materials under conditions similar to the center of the sun. On fusion ignition experiments",
        "plasma generated in the interior of the target shell can detrimentally impact the implosion symmetry and the resulting energy output. We are in the final stages of commissioning a significant new diagnostic system that will allow us to better understand the plasma conditions and improve our symmetry control techniques. This Optical Thompson Scattering (OTS) system consists of two major components: a probe laser beamline capable of delivering a world first 1 J of energy at 211 nm",
        "and a diagnostic that both reflects the probe laser into the target and collects the scattered photons. Between these two components",
        "the control system enhancements required integration of over 450 components into the existing automation suite. This talk will provide an overview of the system upgrade approach and the tools used to efficiently manage and test changes to both our data and software."
      ],
      "institutions": [
        "Funding: This work was performed under the auspices of the U.S. Department of Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv021.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV021",
      "page_number": "173",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPV022",
      "title": "Upgrade of Hardware Controls for the STAR Experiment at RHIC",
      "authors": [
        "Creighton University",
        "Omaha",
        "NE",
        "USA",
        "The STAR experiment has been delivering significant physics results for more than 20 years. Stable operation of the experiment was achieved by using a robust controls system based on the Experimental Physics and Industrial Control System (EPICS). Now an object-oriented approach with Python libraries",
        "adapted for EPICS software",
        "is going to replace the procedural-based EPICS C libraries previously used at STAR. Advantages of the new approach include stability of operation",
        "code reduction and straightforward project documentation. This poster will introduce the STAR experiment",
        "give an overview of the EPICS architecture",
        "and present the use of Python for controls software. Specific examples",
        "as well as upgrades of user interfaces",
        "will be shown.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv022.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPV024",
      "title": "vscode-epics, a VSCode Module to Enlighten Your EPICS Code",
      "authors": [
        "V. Nadot",
        "A. Gaget",
        "F. Gohier",
        "F. Gougnaud",
        "P. Lotrus",
        "S. Tzvetkov",
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "vscode-epics is a Visual Studio Code module developed by CEA Irfu that aims to enlight your EPICS code. This module makes developer life easier",
        "improves code quality and helps standardizing EPICS code. It provides syntax highlighting",
        "snippets and header template for EPICS file and provides snippets for WeTest*. This VSCode module is based on Visual Studio Code language Extension and it uses basic JSON files that make feature addition easy. The number of downloads increases version after version and the different feedback motivates us to strongly maintain it for the EPICS community. Since 2019",
        "some laboratories of the EPICS community have participated in the improvement of the module and it seems to have a nice future (linter",
        "snippet improvements",
        "specific language support",
        "etc.). The module is available on Visual Studio Code marketplace** and on EPICS extension GitHub***. CEA Irfu is open to bug notifications",
        "enhancement suggestions and merge requests to continuously improve vscode-epics."
      ],
      "institutions": [],
      "abstract": "* https://github.com/epics-extensions/WeTest  ** https://marketplace.visualstudio.com/items?itemName=nsd.vscode-epics *** https://github.com/epics-extensions/vscode-epics",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv024.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV024",
      "page_number": "179",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV025",
      "title": "TangoGraphQL: A GraphQL Binding for Tango Control System Web-Based Applications",
      "authors": [
        "ESRF",
        "Grenoble",
        "France",
        "Web-based applications have seen a huge increase in popularity in recent years",
        "replacing standalone applications. GraphQL provides a complete and understandable description of the data exchange between client browsers and back-end servers. GraphQL is a powerful query language allowing API to evolve easily and to query only what is needed. GraphQL also offers a WebSocket based protocol which perfectly fit to the Tango event system. Lots of popular tools around GraphQL offer very convenient way to browse and query data. TangoGraphQL is a pure C++ http(s) server which exports a GraphQL binding for the Tango C++ API. TangoGraphQL also exports a GraphiQL web application which allows to have a nice interactive description of the API and to test queries. TangoGraphQL* has been designed with the aim to maximize performances of JSON data serialization",
        "a binary transfer mode is also foreseen."
      ],
      "institutions": [],
      "abstract": "https://gitlab.com/tango-controls/TangoGraphQL",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv025.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV025",
      "page_number": "181",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV026",
      "title": "Integrating OPC UA Devices in EPICS",
      "authors": [
        "ITER Organization",
        "St. Paul lez Durance",
        "France",
        "R.A. Elliot",
        "K. Vestin",
        "ESS",
        "Lund",
        "Sweden",
        "BESSY GmbH",
        "Berlin",
        "Germany",
        "HZB",
        "Berlin",
        "Germany",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "OPC Unified Architecture (OPC UA) is an open platform independent communication architecture for industrial automation developed by the OPC Foundation. Its key characteristics include a rich service-oriented architecture",
        "enhanced security functionality and an integral information model",
        "allowing to map complex data into an OPC UA namespace. With its increasing popularity in the industrial world",
        "OPC UA is an excellent strategic choice for integrating a wealth of different COTS devices and controllers into an existing control system infrastructure. The security functions extend its application to larger networks and across firewalls",
        "while the support of user-defined data structures and fully symbolic addressing ensure flexibility",
        "separation of concerns and robustness in the user interfaces. In an international collaboration",
        "a generic OPC UA support for the EPICS control system toolkit has been developed. It is used in operation at several facilities",
        "integrating a variety of commercial controllers and systems. We describe design and implementation approach",
        "discuss use cases and software quality aspects",
        "report performance and present a roadmap of the next development steps."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv026.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV026",
      "page_number": "184",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV027",
      "title": "The Evolution of the DOOCS C++ Code Base",
      "authors": [
        "L. Fröhlich",
        "A. Aghababyan",
        "S. Grunewald",
        "O. Hensler",
        "U. Jastrow",
        "R. Kammering",
        "H. Keller",
        "V. Kocharyan",
        "M. Mommertz",
        "F. Peters",
        "A. Petrosyan",
        "G. Petrosyan",
        "L.P. Petrosyan",
        "V. Petrosyan",
        "K. Rehlich",
        "V. Rybnikov",
        "G. Schlesselmann",
        "J. Wilgen",
        "T. Wilksen",
        "DESY",
        "Hamburg",
        "Germany"
      ],
      "institutions": [
        "This contribution traces the development of DESY’s control system DOOCS from its origins in 1992 to its current state as the backbone of the European XFEL and FLASH accelerators and of the future Petra IV light source. Some details of the continual modernization and refactoring efforts on the 1.5 million line C++ codebase are highlighted."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv027.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV027",
      "page_number": "188",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV030",
      "title": "Application of EPICS Software in Linear Accelerator",
      "authors": [
        "Y.H. Guo",
        "H.T. Liu",
        "B.J. Wang",
        "R. Wang",
        "N. Xie",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "The institute of modern physics (IMP) has two sets of linear accelerator facilities",
        "they are CAFe (China ADS front-end demo linac) and LEAF (Low Energy Accelerator Facility). The Main equipment of LEAF facility consists of ion source",
        "LEBT (Low Energy Beam Transport)",
        "RFQ (Radio Frequency Quadrupole) and some experiment terminals. Compare with LEAF",
        "CAFe equipment has more and adds MEBT (Middle Energy Beam Transport) and four sets of superconducting cavity strings at the back end of RFQ. In the process of commissioning and running linac equipment",
        "The EPICS Archiver application and Alarm system are used. According to the refined control requirements of the facility sites",
        "we have completed the software upgrade and deployment of the archiver and alarm systems. The upgraded software systems have made the operation of linac machines more effective in term of monitoring",
        "fault-diagnostic and system recovery",
        "and becomes more user-friendly as well."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv030.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV030",
      "page_number": "193",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV031",
      "title": "The Deployment Technology of EPICS Application Software Based on Docker",
      "authors": [
        "R. Wang",
        "Y.H. Guo",
        "B.J. Wang",
        "N. Xie",
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "StreamDevice",
        "as a general-purpose string interface device’s Epics driver",
        "has been widely used in the control of devices with network and serial ports in CAFe equipment. For example",
        "the remote control of magnet power supply",
        "vacuum gauges",
        "and various vacuum valves or pumps",
        "as well as the information reading and control of Gauss meter equipment used in magnetic field measurement. In the process of on-site software development",
        "we found that various errors are caused during the deployment of StreamDevice about the dependence on software environment and library functions",
        "which because of different operating system environments and EPICS tool software versions. This makes StreamDevice deployment very time-consuming and labor-intensive. To ensure that StreamDevice works in a unified environment and can be deployed and migrated efficiently",
        "the Docker container technology is used to encapsulate its software and its application environment. Images will be uploaded to an Aliyun private library to facilitate software developers to download and use."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv031.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV031",
      "page_number": "197",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV032",
      "title": "Design of a Component-Oriented Distributed Data Integration Model",
      "authors": [
        "Z. Ni",
        "L. Li",
        "J. Liu",
        "J. Luopresenter",
        "X. Zhou",
        "CAEP",
        "Sichuan",
        "People’s Republic of China",
        "The control system of large scientific facilities is composed of several heterogeneous control systems. As time goes by",
        "the facilities need to be continuously upgraded and the control system also needs to be upgraded. This is a challenge for the integration of complex and large-scale heterogeneous systems. This article describes the design of a data integration model based on component technology",
        "software middleware(The Apache Thrift*) and real-time database. The realization of this model shields the relevant details of the software middleware",
        "encapsulates the remote data acquisition as a local function operation",
        "realizes the combination of data and complex calculations through scripts",
        "and can be assembled into new components.",
        "*The Apache Thrift software framework",
        "for scalable cross-language services development",
        "combines a software stack with a code generation engine to build services that work efficiently."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv032.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV032",
      "page_number": "202",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV033",
      "title": "Web Client for Panic Alarms Management System",
      "authors": [
        "M. Nabywaniec",
        "M. Gandor",
        "P.P. Goryl",
        "Ł. Żytniak",
        "S2Innovation",
        "Kraków",
        "Poland",
        "Alarms are one of the most important aspects of control systems. Each control system can face unexpected issues",
        "which demand fast and precise resolution. As the control system starts to grow",
        "it requires the involvement of more engineers to access the alarm’s list and focus on the most important ones. Our objective was to allow users to access the alarms fast",
        "remotely and without special software. According to current trends in the IT community",
        "creating a web application turned out to be a perfect solution. Our application is the extension and web equivalent to the current Panic GUI application. It allows constant remote access using just a web browser which is currently present on every machine including mobile phones and tablets. The access to the different functionalities can be restricted to the users provided just with appropriate roles. Alarms can be easily added and managed from the web browser as well as adding new data sources is possible. From each data source",
        "an attribute can be extracted",
        "and multiple attributes can be combined into composer being the base for further analysis or alarms creation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv033.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV033",
      "page_number": "206",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV034",
      "title": "Migration of Tango Controls Source Code Repositories",
      "authors": [
        "M. Liszcz",
        "M. Celary",
        "P.P. Goryl",
        "K. Kedron",
        "S2Innovation",
        "Kraków",
        "Poland",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "MAX IV Laboratory",
        "Lund University",
        "Lund",
        "Sweden",
        "R. Bourtembourg",
        "A. Götz",
        "ESRF",
        "Grenoble",
        "France",
        "byte physics e.K.",
        "Berlin",
        "Germany",
        "SARAO",
        "Cape Town",
        "South Africa",
        "A. López Sánchez",
        "C. Pascual-Izarra",
        "S. Rubio-Manrique",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "At the turn of 2020/2021",
        "the Tango community faced the challenge of a massive migration of all Tango software repositories from GitHub to GitLab. The motivation has been a change in the pricing model of the Travis CI provider and the shutdown of the JFrog Bintray service used for artifact hosting. GitLab has been chosen as a FOSS-friendly platform for storing both the code and build artifacts and for providing CI/CD services. The migration process faced several challenges",
        "both technical",
        "like redesign and rewrite of CI pipelines",
        "and non-technical",
        "like coordination of actions impacting multiple interdependent repositories. This paper explains the strategies adopted for migration",
        "the outcomes",
        "and the impact on the Tango Controls collaboration."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv034.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV034",
      "page_number": "209",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV035",
      "title": "Development of Alarm and Monitoring System Using Smartphone",
      "authors": [
        "PAL",
        "Pohang",
        "Republic of Korea",
        "In order to find out the problem of the device remotely",
        "we aimed to develop a new alarm system. The main functions of the alarm system are real-time monitoring of EPICS PV data",
        "data storage",
        "and data storage when an alarm occurs. In addition",
        "an alarm is transmitted in real time through an app on the smartphone to communicate the situation to machine engineers of PLS-II. This system uses InfluxDB to store data. In addition",
        "a new program written in Java language was developed so that data acquisition",
        "analysis",
        "and beam dump conditions can be known. furthermore Vue.js is used to develop together with node.js and web-based android and iOS-based smart phone applications",
        "and user interface is serviced. Eventually",
        "using this system",
        "we were able to check the cause analysis and data in real time when an alarm occurs. In this paper",
        "we introduce the design of an alarm system and the transmission of alarms to an application."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv035.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV035",
      "page_number": "214",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV036",
      "title": "Porting Control System Software From Python 2 to 3 - Challenges and Lessons",
      "authors": [
        "A.F. Joubert",
        "M.T. Ockards",
        "S. Wai",
        "SARAO",
        "Cape Town",
        "South Africa",
        "Obsolescence is one of the challenges facing all long-term projects. It not only affects hardware platforms",
        "but also software. Python 2.x reached official End Of Life status on 1 January 2020. In this paper we review our efforts to port to the replacement",
        "Python 3.x. While the two versions are very similar",
        "there are important differences which can lead to incompatibility or changes in behaviour. We discuss our motivation and strategy for porting our code base of approximately 200 k source lines of code over 20 Python packages. This includes aspects such as internal and external dependencies",
        "legacy and proprietary software that cannot be easily ported",
        "testing and verification",
        "and why we selected a phased approach rather than \"big bang\". We also report on the challenges and lessons learnt - notably why good test coverage is so important for software maintenance. Our application is the 64-antenna MeerKAT radio telescope in South Africa - a precursor to the Square Kilometre Array"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv036.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV036",
      "page_number": "217",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV037",
      "title": "ALBA Controls System Software Stack Upgrade",
      "authors": [
        "G. Cuní",
        "F. Becheri",
        "S. Blanch-Torné",
        "C. Falcon-Torres",
        "C. Pascual-Izarra",
        "Z. Reszela",
        "S. Rubio-Manrique",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "ALBA",
        "a 3rd Generation Synchroton Light Source located near Barcelona in Spain",
        "is in operation since 2012. During the last 10 years",
        "the updates of ALBA’s Control System were severely limited in order to prevent disruptions of production equipment",
        "at the cost of having to deal with hardware and software obsolescence",
        "elevating the effort of maintenance and enhancements. The construction of the second phase new beamlines accelerated the renewal of the software stack. In order to limit the number of supported platforms we also gradually upgraded the already operational subsystems. We are in the process of switching to the Debian OS",
        "upgrading to the Tango 9 Control System framework including the Tango Archiving System to HDB++",
        "migrating our code to Python 3",
        "and migrating our GUIs to PyQt5 and PyQtGraph",
        "etc. In order to ensure the project quality and to facilitate future upgrades",
        "we try to automate testing",
        "packaging",
        "and configuration management with CI/CD pipelines using",
        "among others",
        "the following tools: pytest",
        "Docker",
        "GitLab-CI and Salt. In this paper",
        "we present our strategy in this project",
        "the current status of different upgrades and we share the lessons learnt."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv037.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV037",
      "page_number": "222",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV038",
      "title": "The EPIC(S) Battle Between Individualism and Collectivism",
      "authors": [
        "ESS",
        "Lund",
        "Sweden",
        "ESS uses a customized version of the EPICS build system in order to manage a small number of consistent EPICS environments for all of the integrators on site. In order to maintain this",
        "we use in particular Gitlab CI/CD to build",
        "test",
        "and deploy our EPICS modules. We will present our work on how we maintain control over our EPICS environment while still allowing integrators the easy ability to build and test their control software."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv038.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "MOPV039",
      "title": "UCAP: A Framework for Accelerator Controls Data Processing @ CERN",
      "authors": [
        "L. Cseppentő",
        "M. Büttner",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Unified Controls Acquisition and Processing (UCAP) framework provides a means to facilitate and streamline data processing in the CERN Accelerator Control System. UCAP’s generic structure is capable of tackling classic \"Acquisition - Transformation - Publishing/Presentation\" use cases",
        "ranging from simple aggregations to complex machine reports and pre-processing of software interlock conditions. In addition to enabling end-users to develop data transformations in Java or Python and maximising integration with other controls sub-systems",
        "UCAP puts an emphasis on offering self-service capabilities for deployment",
        "operation and monitoring. This ensures that accelerator operators and equipment experts can focus on developing domain-specific transformation algorithms",
        "without having to pay attention to typical IT tasks",
        "such as process management and system monitoring. UCAP is already used by Linac4",
        "PSB and SPS operations and will be used by most CERN accelerators",
        "including LHC by the end of 2021. This contribution presents the UCAP framework and gives an insight into how we have productively combined modern agile development with conservative technical choices."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv039.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV039",
      "page_number": "230",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV040",
      "title": "Introducing Python as a Supported Language for Accelerator Controls at CERN",
      "authors": [
        "P.J. Elson",
        "C. Baldi",
        "I. Sinkarenko",
        "CERN",
        "Geneva",
        "Switzerland",
        "In 2019",
        "Python was adopted as an officially supported language for interacting with CERN’s accelerator controls. In practice",
        "this change of status was as much pragmatic as it was progressive - Python has been available as part of the underlying operating system for over a decade and unofficial Python interfaces to controls have existed since at least 2015. So one might ask: what really changed when Python’s adoption became official? This paper will discuss what it takes to officially support Python in a controls environment and will focus on the cultural and technological shifts involved in running Python operationally. It will highlight some of the infrastructure that has been put in place at CERN to facilitate a stable and user-friendly Python platform",
        "as well as some of the key decisions that have led to Python thriving in CERN’s accelerator controls domain. Given its general nature",
        "it is hoped that the approach presented in this paper can serve as a reference for other scientific organisations from a broad range of fields who are considering the adoption of Python in an operational context."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv040.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV040",
      "page_number": "236",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV041",
      "title": "Modernisation of the Toolchain and Continuous Integration of Front-End Computer Software at CERN",
      "authors": [
        "P. Mantion",
        "S. Deghaye",
        "L. Fiszer",
        "F. Irannejad",
        "J. Lauener",
        "M. Voelkle",
        "CERN",
        "Geneva",
        "Switzerland",
        "Building C++ software for low-level computers requires carefully tested frameworks and libraries. The major difficulties in building C++ software are to ensure that the artifacts are compatible with the target system’s (OS",
        "Application Binary Interface)",
        "and to ensure that transitive dependent libraries are compatible when linked together. Thus developers/maintainers must be provided with efficient tooling for friction-less workflows: standardisation of the project description and build",
        "automatic CI",
        "flexible development environment. The open-source community with services like Github and Gitlab have set high expectations with regards to developer user experience. This paper describes how we leveraged Conan and CMake to standardise the build of C++ projects",
        "avoid the \"dependency hell\" and provide an easy way to distribute C++ packages. A CI system orchestrated by Jenkins and based on automatic job definition and in-source",
        "versioned",
        "configuration has been implemented. The developer experience is further enhanced by wrapping the common flows (compile",
        "test",
        "release) into a command line tool",
        "which also helps transitioning from the legacy build system (legacy makefiles",
        "SVN)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv041.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV041",
      "page_number": "242",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV042",
      "title": "PLCverif: Status of a Formal Verification Tool for Programmable Logic Controller",
      "authors": [
        "J-C. Tournier",
        "B. Fernández Adiego",
        "I.D. Lopez-Miguel",
        "CERN",
        "Geneva",
        "Switzerland",
        "Programmable Logic Controllers (PLC) are widely used for industrial automation including safety systems at CERN. The incorrect behaviour of the PLC control system logic can cause significant financial losses by damage of property or the environment or even injuries in some cases",
        "therefore ensuring their correct behaviour is essential. While testing has been for many years the traditional way of validating the PLC control system logic",
        "CERN developed a model checking platform to go one step further and formally verify PLC logic. This platform",
        "called PLCverif",
        "first released internally for CERN usage in 2019",
        "is now available to anyone since September 2020 via an open source licence. In this paper",
        "we will first give an overview of the PLCverif platform capabilities before focusing on the improvements done since 2019 such as the larger support coverage of the Siemens PLC programming languages",
        "the better support of the C Bounded Model Checker backend (CBMC) and the process of releasing PLCverif as an open-source software."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv042.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV042",
      "page_number": "248",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPV043",
      "title": "CERN Controls Configuration Service - Event-Based Processing of Controls Changes",
      "authors": [
        "B. Urbaniec",
        "L. Burdzanowski",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Controls Configuration Service (CCS) is a core component of the data-driven Control System at CERN. Built around a central database",
        "the CCS provides a range of client APIs and graphical user interfaces (GUI) to enable efficient and user-friendly configuration of Controls. As the entry point for all the modifications to Controls system configurations",
        "the CCS provides the means to ensure global data coherency and propagation of changes across the distributed Controls sub-systems and services. With the aim of achieving global data coherency in the most efficient manner",
        "the need for an advanced data integrator emerged. The Controls Configuration Data Lifecycle manager (CCDL) is the core integration bridge between the distributed Controls sub-systems. It aims to ensure consistent",
        "reliable",
        "and efficient exchange of information and triggering of workflow actions based on events representing Controls configuration changes. The CCDL implements and incorporates cutting-edge technologies used successfully in the IT industry. This paper describes the CCDL architecture",
        "design and technology choices made",
        "as well as the tangible benefits that have been realised since its introduction."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv043.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV043",
      "page_number": "253",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV044",
      "title": "Lessons Learned Moving from Pharlap to Linux RT",
      "authors": [
        "C. Charrondière",
        "O.Ø. Andreassen",
        "D. Sierra-Maíllo Martínez",
        "J. Tagg",
        "T. Zilliox",
        "CERN",
        "Meyrin",
        "Switzerland",
        "The start of the Advanced Proton Driven Plasma Wakefield Acceleration Experiment (AWAKE) facility at CERN in 2016 came with the need for a continuous image acquisition system. The international scientific collaboration responsible for this project requested low and high resolution acquisition at a capture rate of 10Hz and 1 Hz respectively. To match these requirements",
        "GigE digital cameras were connected to a PXI system running PharLap",
        "a real-time operating system",
        "using dual port 1GB/s network cards. With new requirements for a faster acquisition with higher resolution",
        "it was decided to add 10GB/s network cards and a Network Attached Storage (NAS) directly connected to the PXI system to avoid saturating the network. There was also a request to acquire high-resolution images on several cameras during a limited duration",
        "typically 30 seconds",
        "in a burst acquisition mode. To comply with these new requirements PharLap had to be abandoned and replaced with Linux RT. This paper describes the limitation of the PharLap system and the lessons learned during the transition to Linux RT. We will show the improvement of CPU stability and data throughput reached."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv044.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV044",
      "page_number": "257",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV045",
      "title": "Data-Centric Web Infrastructure for CERN Radiation and Environmental Protection Monitoring",
      "authors": [
        "A. Ledeul",
        "C.C. Chiriac",
        "G. Segura",
        "J. Sznajd",
        "G. de la Cruz",
        "CERN",
        "Meyrin",
        "Switzerland",
        "Supervision",
        "Control and Data Acquisition (SCADA) systems generate large amounts of data over time. Analyzing collected data is essential to discover useful information",
        "prevent failures",
        "and generate reports. Facilitating access to data is of utmost importance to exploit the information generated by SCADA systems. CERN’s occupational Health & Safety and Environmental protection (HSE) Unit operates a web infrastructure allowing users of the Radiation and Environment Monitoring Unified Supervision (REMUS) to visualize and extract near-real-time and historical data from desktop and mobile devices. This application",
        "REMUS Web",
        "collects and combines data from multiple sources and presents it to the users in a format suitable for analysis. The web application and the SCADA system can operate independently thanks to a data-centric",
        "loosely coupled architecture. They are connected through common data sources such as the open-source streaming platform Apache Kafka and Oracle Rdb. This paper describes the benefits of providing a feature-rich web application as a complement to control systems. Moreover",
        "it details the underlying architecture of the solution and its capabilities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv045.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV045",
      "page_number": "261",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV046",
      "title": "Tango Controls Device Attribute extension in Python3",
      "authors": [
        "T. Snijder",
        "T. Juerges",
        "J.J.D. Mol",
        "ASTRON",
        "Dwingeloo",
        "The Netherlands",
        "The Tango Controls Device Attributes represent a container for read-only or read-write data types. However the Attribute read/write functions need to be individually implemented for accessing structured data in hardware devices. This exposes a pattern of replicated code in the read and write functions. Maintaining this code becomes time consuming to maintain when a Device exposes tens or more Attributes. The solution we propose is to extend Tango Control Attributes. For that we combine a hardware access class (accessor) that reads and writes the structured data in hardware together with a small addition to the original Attribute declaration. The extended Attribute constructor provides information that describes how the accessor can locate a value in the hardware. This information is then used to provide the extended Attribute with a parameterised read or write function. The benefits of our solution are that various methods of hardware access can be efficiently and easily implemented and that new extended Attributes can be added with a single line of code. We have successfully used the extended Attributes with OPC-UA",
        "SNMP",
        "and INI-files in ASTRON’s"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv046.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOPV047",
      "title": "Upgrading Oracle APEX Applications at the National Ignition Facility",
      "authors": [
        "A. Bhasker",
        "R.D. Clark",
        "R.N. Fallejo",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "As with all experimental physics facilities",
        "NIF has software applications that must persist on a multi-decade timescale. They must be kept up to date for viability",
        "sustainability and security. We present the steps and challenges involved in a major application upgrade project from Oracle APEX v5 to Oracle APEX v19.2. This upgrade involved jumping over 2 major versions and a total of 5 releases of Oracle APEX. Some applications that depended on now legacy Oracle APEX constructs required redesigning",
        "while others that broke due to custom JavaScript needed to be updated for compatibility. This upgrade project",
        "undertaken by the NIF Shot Data Systems team at LLNL",
        "involved reverse-engineering functional requirements for applications that were then redesigned using the latest APEX out-of-the-box functionality",
        "as well as identifying changes made in the new Oracle APEX built-in ’plumbing’ to update custom-built features for compatibility with the new Oracle APEX version. As NIF enters into its second decade of operations",
        "this upgrade allows these aging applications to function in a more sustainable way",
        "while enhancing user experience with a modernized GUI for Oracle APEX web-pages."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv047.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV047",
      "page_number": "267",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV048",
      "title": "Fast Multipole Method (FMM)-Based Particle Accelerator Simulations in the Context of Tune Depression Studies",
      "authors": [
        "M.H. Langston",
        "R. Lethin",
        "P.D. Letourneau",
        "J. Wei",
        "Reservoir Labs",
        "New York",
        "USA",
        "As part of the MACH-B (Multipole Accelerator Codes for Hadron Beams) project",
        "we have developed a Fast Multipole Method (FMM**)-based tool for higher fidelity modeling of particle accelerators for high-energy physics within Fermilab’s Synergia* simulation package. We present results from our implementations with a focus on studying the difference between tune depression estimates obtained using PIC codes for computing the particle interactions and those obtained using FMM-based algorithms integrated within Synergia. In simulating the self-interactions and macroparticle actions necessary for accurate simulations",
        "we present a newly-developed kernel inside of a kernel-independent FMM in which near-field kernels are modified to incorporate smoothing while still maintaining consistency at the boundary of the far-field regime. Each simulation relies on Synergia with one major difference: the way in which particles interactions were computed. Specifically",
        "following our integration of the FMM into Synergia",
        "changes between PIC-based computations and FMM-based computations are made by changing only the method for near-field (and self) particle interactions."
      ],
      "institutions": [],
      "abstract": "* J. Amundson et al. \"Synergia: An accelerator modeling tool with 3-D space charge\". J.C.P. 211.1 (2006) 229-248. ** L. Greengard. \"Fast algorithms for classical physics\". Science (Aug 1994) 909-914. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv048.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV048",
      "page_number": "271",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPV049",
      "title": "Standardizing a Python Development Environment for Large Controls Systems",
      "authors": [
        "S.L. Clark",
        "P.S. Dyer",
        "S. Nemesure",
        "BNL",
        "Upton",
        "New York",
        "USA",
        "Python provides broad design freedom to programmers and a low barrier of entry for new software developers. These aspects have proven that unless standardized",
        "a Python codebase will tend to diverge from a common style and architecture",
        "becoming unmaintainable across the scope of a large controls system. Mitigating these effects requires a set of tools",
        "standards",
        "and procedures developed to assert boundaries on certain aspects of Python development – namely project organization",
        "version management",
        "and deployment procedures. Common tools like Git",
        "GitLab",
        "and virtual environments form a basis for development",
        "with in-house utilities presenting their capabilities in a clear",
        "developer-focused way. This paper describes the necessary constraints needed for development and deployment of large-scale Python applications",
        "the function of the tools which comprise the development environment",
        "and how these tools are leveraged to create simple and effective procedures to guide development."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv049.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV049",
      "page_number": "277",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPV050",
      "title": "DevOps and CI/CD for WinCC Open Architecture Applications and Frameworks",
      "authors": [
        "CERN",
        "Meyrin",
        "Switzerland",
        "ANSL",
        "Yerevan",
        "Armenia",
        "This paper presents the Continuous Integration and Continuous Deployment (CI/CD) tool chain for WinCC Open Architecture applications and frameworks developed at CERN",
        "enabling a DevOps oriented approach of working. By identifying common patterns and time consuming procedures",
        "and by agreeing on standard repository structures",
        "naming conventions and tooling",
        "we have gained a turnkey solution which automates the compilation of binaries and generation of documentation",
        "thus guaranteeing they are up to date and match the source code in the repository. The pipelines generate deployment-ready software releases",
        "which pass through both static code analysis and unit tests before automatically being deployed to short and long-term repositories. The tool chain leverages industry standard technologies",
        "such as GitLab",
        "Docker and Nexus. The technologies chosen for the tool chain are well understood and have a long",
        "solid track record",
        "reducing the effort in maintenance and potential long term risk. The setup has reduced the expert time needed for testing and releases",
        "while generally improving the release quality."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icalepcs2021/talks/mopv050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icalepcs2021/papers/mopv050.pdf",
      "poster_url": "https://proceedings.jacow.org/icalepcs2021/posters/mopv050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICALEPCS2021-MOPV050",
      "page_number": "281",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 46,
  "scrape_time": "2025-10-10 18:04:58"
}