{
  "session_info": {
    "id": "TUOC",
    "name": "TUOC - Oscillator FELs and Storage Ring FELs",
    "url": "https://proceedings.jacow.org/FEL2012/html/tuoc.htm"
  },
  "papers": [
    {
      "paper_id": "TUOC02",
      "title": "Start to End Simulations of Optics-free X-ray FEL Oscillator",
      "authors": [
        "V. Litvinenko",
        "Y. Hao",
        "Y.C. Jing",
        "D. Kayran",
        "D. Trbojevic",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "There is obvious need for an optics-free X-ray FEL oscillator. While self-seeded SASE FELs demonstrated the capability of providing very high gain and short pulses of radiation",
        "the spectra of SASE FELs is still rather wide and can be significantly improved in an FEL-oscillators. Idea of optics-free X-ray FEL oscillator using is know for a decade [1]. In this talk",
        "we present start-to-end simulation of this scheme including both incoherent and coherent SR effects. We discussed the projected performance of this scheme and its potentials limitations.",
        "[1] Optics-Free FEL oscillators",
        "V.N.Litvinenko",
        "ICFA Advanced Accelerator and Beam Dynamics Workshop Chia Laguna",
        "Sardinia",
        "July 1-6",
        "2002"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tuoc02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tuoc02.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tuoc02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUOC02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUOC03",
      "title": "Use of the Projected Torus Knot Lattice for a Compact Storage Ring FEL",
      "authors": [
        "S. Sasaki",
        "A. Miyamoto",
        "HSRC",
        "Higashi-Hiroshima",
        "Japan",
        "We proposed a new scheme of lattice design for a compact storage ring in which a design orbit of electron beam closes after completing multiple turns.* This new lattice can be made by placing necessary accelerator components at certain positions on a projected torus knot in the horizontal orbit plane. In a storage ring having this type of lattice",
        "the beam trajectory crosses in bending magnets",
        "i.e. each bending magnet accepts two beam orbits. For example",
        "in the ring having the (11",
        "3) torus knot lattice with 11 bending magnets",
        "a bunch goes through bending magnets 22-times to complete its 3-turn closed orbit. Since the maximum output laser power is proportional to the synchrotron radiation loss in the complete turn round a closed orbit starting from the optical resonator section",
        "** the maximum laser power from the projected torus knot storage ring FEL can be doubled for 2-turn lattice and tripled for 3-turn lattice compared with that from a conventional storage ring FEL. The new lattice scheme may contribute to more stable operation of a compact storage ring FEL. Some realistic parameters and achievable performance for UV-FEL are discussed in the presentation.",
        "*S. Sasaki and A. Miyamoto",
        "Proceedings of IPAC'11",
        "San Sebastian",
        "September 2011"
      ],
      "institutions": [
        "Funding: This work is partially supported by the KEK-Universities Collaborative Support Program for Accelerator Science."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tuoc03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tuoc03.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tuoc03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUOC03",
      "page_number": "221",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUOC04",
      "title": "Compact ERL FELs as High Rep Rate, High Intensity Driver Sources for High-Field Applications",
      "authors": [
        "University of Hawaii at Manoa",
        "Honolulu",
        "USA",
        "100-200 MeV range ERL-FELs generating few cycle short",
        "high intensity mid-IR pulses with tens of MHz repetition rates might become attractive tools in various strong field applications such as the recently considered up-frequency conversion processes in the x-ray region [1]. The presented coupled FEL oscillator employs a shorter undulator in the amplifier section than the one used in its master oscillator. The scheme achieves an exceptionally high overall extraction efficiency to tap on the high power deposited in the electron beam [1]. We elaborate on modified versions of this scheme and direct the attention towards a (seemingly far-fetched) major High-Field application*",
        "the laser driven plasma-based electron accelerator and its parameter scalings[2].",
        "[1]M. Tecimer",
        "PRST-AB 15",
        "020703 (2012).  [2]C.B. Schroeder et al.",
        "PRST-AB 13",
        "101301 (2010).  *M. Tecimer",
        "HZB-BESSY",
        "Nov 2010."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tuoc04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tuoc04.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tuoc04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUOC04",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUOC05",
      "title": "A New Approach to Improving the Efficiency of FEL Oscillator Simulations",
      "authors": [
        "M.D. Shinn",
        "S.V. Benson",
        "A.M. Watson",
        "JLAB",
        "Newport News",
        "Virginia",
        "USA",
        "H.P. Freund",
        "D.C. Nguyen",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "Mesa+",
        "Enschede",
        "The Netherlands",
        "During the last year we have been benchmarking FEL oscillator simulation codes against the measured performance of the three Jefferson Lab oscillator FELs. While one might think that a full 4D simulation is de facto the best predictor of performance",
        "the simulations are computationally intensive",
        "even when analytical approximations to the electron bunch longitudinal distribution are used. In this presentation we compare the predictions of the 4D FEL interaction codes Genesis and Medusa",
        "in combination with the optical code OPC",
        "with those using a combination of the 2D & 3D versions of these codes",
        "which can be run quickly on a single CPU core desktop computer."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/tuoc05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/tuoc05.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/tuoc05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-TUOC05",
      "page_number": "225",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-10 17:34:10"
}