{
  "session_info": {
    "id": "TUXPLS",
    "name": "TUXPLS - Invited Orals: Novel Particle Sources and Acceleration Techniques",
    "url": "https://proceedings.jacow.org/ipac2019/html/tuxpls.htm"
  },
  "papers": [
    {
      "paper_id": "TUXPLS1",
      "title": "MeV Ultrafast Electron Diffraction and Microscopy for the Scientific Frontier",
      "authors": [
        "Shanghai Jiao Tong University",
        "Shanghai",
        "People’s Republic of China",
        "Historically particle accelerators are instrumental for high energy physics (accelerator based colliders) and photon science (accelerator based synchrotron source and FELs). Now there is growing interest in applying accelerator technology to solve the grand challenges in probing matter at ultrafast temporal and ultrasmall spatial scales. In this talk I will discuss how one can use MeV electrons produced in accelerators to study ultrafast dynamics at atomic scale through ultrafast electron diffraction and microscopy techniques. This is made possible with the recent progress both in ultrafast lasers and in the generation and control of high-brightness electron beams used in modern accelerators. I will focus on advanced techniques such as THz streaking and THz compression that may push the resolution to the attosecond regime. Complementary to x-ray FELs",
        "such facility is expected to enable access to new sciences by giving researchers unparalleled power and precision in examining the fundamental nature of matter. A comparison of performance reach to other methods is included."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/tuxpls1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/tuxpls1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/tuxpls1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-TUXPLS1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 19:08:07"
}