{
  "session_info": {
    "id": "FROFDV",
    "name": "FROFDV - Friday Oral Fundamental Development and Research",
    "url": "https://proceedings.jacow.org/srf2021/html/frofdv.htm"
  },
  "papers": [
    {
      "paper_id": "FROFDV01",
      "title": "Systematic Investigation of Mid-T Furnace Baking for High-Q Performance",
      "authors": [
        "H. Ito",
        "A. Araki",
        "K. Umemori",
        "KEK",
        "Ibaraki",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "We report on an investigation of the effect of a new baking process called \"furnace baking\" on the quality factor. Furnace baking is performed as the final step of the cavity surface treatment; the cavities are heated in a vacuum furnace in a temperature range of 200-800C for 3 h",
        "followed by high-pressure rinsing and radio-frequency measurement. We find the anti-Q-slope for cavities furnace-baked at a temperature range of 250 to 400C and a reduction in the residual resistance for all cavities. In particular",
        "an extremely high Q value of 5·1010 at 16 MV/m and 2.0 K is obtained for cavities furnace-baked at 300C."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/frofdv01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/frofdv01.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/frofdv01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-FROFDV01",
      "page_number": "881",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FROFDV02",
      "title": "A Novel Approach to Producing High Gradient and Q₀ Cavities in Non-Ideal Furnaces",
      "authors": [
        "A.D. Palczewski",
        "P. Dhakal",
        "C.E. Reece",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Since the discovery of nitrogen doping in 2014",
        "infusion in 2017",
        "\"mid-T bakes in 2018; the reproducibility in both Q0 and gradient has been proven to be highly variable between facilities and even within the same furnace within a facility*. Multiple studies have pointed to possible contamination from pumps",
        "non-Molybdenum frame outgassing within a hot zone",
        "gas purity issues",
        "and cross-contamination between furnace runs. The traditional approach to mitigating these effects is using niobium furnace caps",
        "high-temperature furnace burnout runs",
        "and expensive pump replacements. We will show multiple examples of a novel approach to increasing Q0 and Q0+Eacc",
        "using a simple treatment after a furnace treatment or doping + light EP. We will also outline the possible workflows using this new technique in production.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "*Pashupati Dhakal, https://doi.org/10.1016/j.physo.2020.100034, and enclosed citations. reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/frofdv02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/frofdv02.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/frofdv02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-FROFDV02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FROFDV03",
      "title": "Investigating the Anomalous Frequency Variations Near Tc of Nb SRF Cavities",
      "authors": [
        "D. Bafia",
        "M. Checchin",
        "A. Grassellino",
        "A.S. Romanenko",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "We report recent studies on the anomalous frequency variations of 1.3 GHz Nb SRF cavities near the transition temperature Tc and use them to investigate the underlying physics of state-of-the-art surface treatments. One such feature",
        "a dip in frequency",
        "correlates directly with the quality factor at 16 MV/m and the anti-Q slope that arise in cavities with dilute concentrations of N interstitial in the RF layer achieved via N-doping and mid temperature baking. For N interstitial",
        "we find that the dip magnitude and Tc follow exponential relationships with the electronic mean free path. We present the first observation of the frequency dip near Tc in a cavity baked at 200 C in-situ for 11 hours",
        "which is concurrent with the anti-Q slope",
        "and may be driven by oxygen diffused from the native oxide",
        "thus suggesting the possibility of ‘‘O-doping.’’ We also investigate the conductivities of two cavities that display different resonant frequency behaviors near Tc and suggest that the anti-Q slope and frequency dip phenomena may occur in the presence of interstitial N or possibly O that inhibit the formation of proximity coupled Nb nano-hydrides."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/frofdv03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/frofdv03.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/frofdv03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-FROFDV03",
      "page_number": "885",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FROFDV04",
      "title": "MeV Electron Irradiation on Nb Samples and 1.3GHz SRF Cavity",
      "authors": [
        "T. Spina",
        "A. Grassellino",
        "A.S. Romanenko",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "To enhance bulk Nb RF cavity performances at high accelerating field it is important to prevent precipitates formation. Doping and heat treatments can mitigate such effect and the most accredited theory is based on the presence of proximity-coupled niobium hydrides [*]. Irradiation can induce vacancy-2H complexes [**] and in this study",
        "the effects of 9MeV electrons on Nb samples and cavity up to fluences of 1.8x1021e/m2 are investigated. The size and density changes of micro-hydrides before and after irradiation was measured by cryo-laser confocal microscopy and a new analytic technique based on computer vision has been used. A strong reduction in hydrides size was found after irradiation and the hydrides formation temperature was shifted to lower values suggesting a reduction in both the activation energy barrier and the critical radius. We conclude that electron irradiation can indeed prevent the formation of large hydrides in H-loaded Nb bulk sample. 1.3GHz Nb cavity has also been submitted to electron irradiation treatment in stationary mode and Q vs E curves and T-map measurements before and after irradiations recorded the changes induced by radiation on cavity performance.",
        "[*] A. Romanenko et al.",
        "Supercond. Sci. Technol. 26 (2013) 035003 [**]J. CíÅ¾ek et al. PHYSICAL REVIEW B 79 (2009) 054108",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/frofdv04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/frofdv04.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/frofdv04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-FROFDV04",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FROFDV05",
      "title": "Efforts Towards First Applications of Nb₃Sn SRF Cavities",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Research efforts on Nb3Sn SRF cavities have led to substantial advancements over the last decade",
        "including a severalfold increase in maximum gradient with high Q0 at 4 K and scaling up to large structures typically used in applications. In this talk",
        "we overview recent performance advancements achieved in Nb3Sn research and development efforts and describe some first forays into applications for Nb3Sn SRF cavities."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/frofdv05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/frofdv05.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/frofdv05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-FROFDV05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FROFDV06",
      "title": "Synthesis of Nb and Alternative Superconducting Film to Nb for SRF Cavity as Single Layer",
      "authors": [
        "R. Valizadeh",
        "P. Goudket",
        "A.N. Hannah",
        "O.B. Malyshev",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "CEA-DRF-IRFU",
        "France",
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "E. Chyhyrynets",
        "C. Pira",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "P. Goudket",
        "O.B. Malyshev",
        "D.J. Seal",
        "B.S. Sian",
        "D.A. Turner",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "O. Kugeler",
        "D.B. Tikhonov",
        "HZB",
        "Berlin",
        "Germany",
        "S.B. Leith",
        "A.Ö. Sezgin",
        "M. Vogel",
        "University Siegen",
        "Siegen",
        "Germany",
        "A. Medvids",
        "P. Onufrijevs",
        "Riga Technical University",
        "Riga",
        "Latvia",
        "D.J. Seal",
        "B.S. Sian",
        "D.A. Turner",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "A. Sublet",
        "G. Vandoni",
        "L. Vega Cid",
        "W. Venturini Delsolaro",
        "P. Vidal García",
        "CERN",
        "Meyrin",
        "Switzerland",
        "\"Bulk niobium (Nb) has been the material of choice for superconducting RF (SRF) cavities but for further improvement in cavity RF performance",
        "one may have to turn to films of Nb and to other superconducting materials deposited on copper as thermal and mechanical support. Other materials known as A15",
        "such as Nb3Sn or V3Si and B1 such as NbTiN and NbN are much easier to synthesise in thin films rather than being made as bulk cavity. The potential benefits of using materials other than Nb would be a higher Tc",
        "a potentially higher critical held Hc",
        "leading to potentially significant cryogenics cost reduction if the cavity operation temperature is 4.2 K or higher. We report on optimising deposition parameters and effect of substrate treatment prior to deposition for successful synthesising of Nb and the alternative superconducting thin film with high superconducting properties (Tc and Hsh) on flat substrates and QPR samples in single layer. The DC and RF SC properties have been tested using PPMS and QPR measurements. This work is part of the H2020 ARIES collaboration. We further report on preparation of RF cavities employing these alternative material for future cavity production.\""
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ doi:10.18429/JACoW-SRF2021-",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/frofdv06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/frofdv06.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/frofdv06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-FROFDV06",
      "page_number": "893",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FROFDV07",
      "title": "Material Engineering of ALD- Deposited Multilayer to Improve the Superconducting Performances of RF Cavities Under Intense RF Fields",
      "authors": [
        "CEA",
        "DES-ISAS-DM2S",
        "Université Paris-Saclay",
        "Gif-sur-Yvette",
        "France",
        "C.Z. Antoine",
        "B. Delatte",
        "CEA-IRFU",
        "Gif-sur-Yvette",
        "France",
        "S. Bira",
        "D. Longuevergne",
        "Université Paris-Saclay",
        "CNRS/IN2P3",
        "IJCLab",
        "Orsay",
        "France",
        "ICMMO",
        "Orsay",
        "France",
        "CEA/DRF/IRAMIS/SIS2M",
        "Gif sur Yvette",
        "France",
        "CEA-DRF-IRFU",
        "France",
        "Ecole Polytechnique",
        "Palaiseau",
        "France",
        "We are exploring an original approach to improve the performance of bulk Niobium RF cavities through surface engineering with ALD superconducting multilayer capable of screening efficiently the magnetic fields and therefore inhibiting vortices penetration in Niobium cavities. As a first step for the multilayer",
        "we aim at replacing the deleterious niobium native oxide by a clean interface between an insulator synthesized by ALD (Al2O3",
        "Y2O3 and MgO) and the Niobium metal. To that end I will present the results obtained on both flat niobium samples and 1.3 GHz elliptical cavities. Our study shows that ALD deposited films are a good diffusion barrier",
        "resist to thermal treatments and reduce significantly the presence of the niobium native oxide on the surface. Low SEY material such as TiN was also deposited on top of the insulator film to reduce multipacting phenomena. RF test on ALD coated cavities shows already a slight improvement of the superconducting performances. In parallel we started synthesizing superconducting NbTiN alloys by ALD. I will present preliminary results on the superconducting properties of NbTiN films grown on AlN by ALD with various compositions on Nbiobium.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/srf2021/talks/frofdv07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/srf2021/papers/frofdv07.pdf",
      "poster_url": "https://proceedings.jacow.org/srf2021/posters/frofdv07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SRF2021-FROFDV07",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 7,
  "scrape_time": "2025-10-11 03:11:03"
}