{
  "session_info": {
    "id": "TUPM1HA",
    "name": "TUPM1HA - Stochastic Cooling II & Future Facilities",
    "url": "https://proceedings.jacow.org/COOL2013/html/tupm1ha.htm"
  },
  "papers": [
    {
      "paper_id": "TUPM1HA01",
      "title": "Study for Stochastic Cooling at Nuclotron, JINR",
      "authors": [
        "N. Shurkhno",
        "A.O. Sidorin",
        "G.V. Trubnikov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "GSI",
        "Darmstadt",
        "Germany",
        "FZJ",
        "Jülich",
        "Germany",
        "The experiment on stochastic cooling at Nuclotron",
        "initiated two years ago as a test bench for NICA collider",
        "is progressing well. New scheme of cooling system",
        "which includes ring-slot couplers as pick-up and kicker (designed at FZJ)",
        "optical notch-filter and full remote-controlled automation of measurements and adjustments",
        "was set in operation in autumn 2012. This report presents results of beam cooling modeling",
        "experimental measurements of the optical notch-filter and channel elements performed in 2011-2012",
        "and also first results of the beam cooling achieved at Nuclotron in March 2013."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/COOL2013/talks/tupm1ha01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/COOL2013/papers/tupm1ha01.pdf",
      "poster_url": "https://proceedings.jacow.org/COOL2013/posters/tupm1ha01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2013-TUPM1HA01",
      "page_number": "73",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPM1HA02",
      "title": "Potential of Stochastic Cooling of Heavy Ions in the LHC",
      "authors": [
        "M. Schaumann",
        "J.M. Jowett",
        "CERN",
        "Geneva",
        "Switzerland",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The dynamics of the high intensity lead beams in the LHC are strongly influenced by intra-beam scattering (IBS)",
        "leading to significant emittance growth and particle losses at all energies. Particle losses during collisions are dominated by nuclear electromagnetic processes and the debunching effect arising from the influence of IBS",
        "resulting in a non-exponential intensity decay during the fill and short luminosity lifetimes. In the LHC heavy ion runs 3 experiments will be taking data and the average fill duration will be rather short as a consequence of the high burn off rate. The achievements with stochastic cooling at RHIC suggest that such a system at LHC could substantially reduce the emittance growth and the debunching component during injection and collisions. The luminosity lifetime and fill length could be improved to optimize the use of the limited run time of 4 weeks per year. This paper discusses the first results of a feasibility study to use stochastic cooling on the lead ion beams in the LHC. The present and expected future performance without cooling is presented and compared to preliminary simulations estimating the improvements if stochastic cooling is applied."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/COOL2013/talks/tupm1ha02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/COOL2013/papers/tupm1ha02.pdf",
      "poster_url": "https://proceedings.jacow.org/COOL2013/posters/tupm1ha02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2013-TUPM1HA02",
      "page_number": "76",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPM1HA03",
      "title": "High Intensity Heavy Ion Accelerator Facility (HIAF) in China",
      "authors": [
        "J.C. Yang",
        "J.W. Xia",
        "G.Q. Xiao",
        "IMP",
        "Lanzhou",
        "People's Republic of China",
        "HIAF (High Intensity heavy ion Accelerator Facility)",
        "a new facility planned in China for heavy ion related research",
        "consists of two ion sources",
        "a high intensity Heavy Ion Superconducting Linac (HISCL)",
        "a 45 Tm Accumulation and Booster Ring (ABR-45) and a multifunction storage ring system. The key features of HIAF are unprecedented high pulse beam intensity and versatile operation mode. The HIAF project aims to expand nuclear and related researches into presently unreachable region and give scientists possibility to conduct cutting-edge researches in these fields. The general description of the facility is given in this article with a focus on the accelerator design."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/COOL2013/talks/tupm1ha03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/COOL2013/papers/tupm1ha03.pdf",
      "poster_url": "https://proceedings.jacow.org/COOL2013/posters/tupm1ha03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2013-TUPM1HA03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:21:59"
}