{
  "session_info": {
    "id": "WEPSB",
    "name": "WEPSB - Poster session B",
    "url": "https://proceedings.jacow.org/rupac2014/html/wepsb.htm"
  },
  "papers": [
    {
      "paper_id": "WEPSB01",
      "title": "Modernization the Modulator  of the RF-Generator Ion Linear Accelerator LU-20",
      "authors": [
        "V. Kobets",
        "A. Govorov",
        "V. Monchinsky",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "A.V. Butenko",
        "D.E. Donets",
        "A.O. Sidorin",
        "JINR/VBLHEP",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The report discusses the replacement of the lamp key the modulator semiconductor. A schematic of the modulator and a semiconductor switch scheme protection against voltage surges in the generator lamp. Replacing the lamp key it possible to increase the output power generator.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB01",
      "page_number": "155",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB02",
      "title": "Modernization the Modulators Klystrons Accelerating Stand of the Electron Linear Accelerator LINAC-800",
      "authors": [
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The report discusses the modernization of the modulators klystrons of the first and second accelerating stations of the acceleration stand on the basis of an electron linear accelerator LINAC-800. Results of the analysis of the modulators to determine the conditions of modernization and upgrading. The presented results of work new modulators.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb02.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB02",
      "page_number": "157",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB03",
      "title": "System Power Microwave Impulse Compression Based on Double Forming Line",
      "authors": [
        "G.O. Buyanov",
        "P.G. Alexey",
        "O.A. Andrey",
        "A.P. Klachkov",
        "MEPhI",
        "Moscow",
        "Russia",
        "Keywords: double forming line (DFL)",
        "compressor microwave pulses",
        "microwave plasma discharger",
        "resonator – storage",
        "input power device (an input power)",
        "energy output device. The first part is devoted to the calculation and design compressor using a single-mode waveguides. We investigated the processes of accumulation and energy extraction from the resonator – storage of compressor",
        "the dependence of the efficiency of energy extraction from the compressor on the plasma parameters of the discharge gap: n",
        "q",
        "m",
        "v",
        "r",
        "h - the concentration",
        "charge",
        "mass",
        "the frequency of collisions of free electrons",
        "the radius and height of the cylinder through which flows the discharge. Refinement construction site energy output and its optimization",
        "matching waveguide resonator - drive to the waveguide load in deriving energy from the compressor microwave was produced. The concept of a multi-compressor DFL was proposed and optimization under axial field was make to increase the dielectric strength and reduce the inductance of the discharge gap. In the second part of the paper questions",
        "the design of the compressor DFL on oversized waveguides with working mode H01n was discusses. New constructions of power input devices was propose that allow not only to providing the necessary coupling coefficient with the feed path",
        "but also greatly reduced the excitation of unacceptable modes in the resonator – storage."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb03.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB03",
      "page_number": "159",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB04",
      "title": "Field Optimization Technique of the Multigap H-mode Resonators",
      "authors": [
        "S.E. Toporkov",
        "A.B. Buleiko",
        "M.V. Lalayan",
        "MEPhI",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Optimization of the H-mode resonators requires uniform accelerating field distribution on its axes. To realize this task pylons with the holes on its end walls are used in many cases. During applying this technique in case of cavities with low number of periods it was mentioned that the best value of the field flatness was obtained in case of zero gap between end walls of the resonator and the pylon. It means that each pylon has got the electrical contact with one of the end walls of the resonator. For such cavity geometry magnetic field distribution differs from the classical H – resonator: it transforms in one common magnetic flux like in split-coaxial cavities. The analysis of such structures was performed for two types of H-mode resonators: Cross bar H-mode (CH) resonators with working frequency 324MHz and Interdigital H-mode (IH) resonators with working frequency 162MHz. All types of resonators work on the pi-mode and have 9 accelerating gaps. The main stages of E-field flatness optimization inside CH− and IH− cavities are presented at this paper.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb04.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB04",
      "page_number": "162",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB05",
      "title": "Optimization of Electric Field Distribution Inside Multi-gap CH-Resonator",
      "authors": [
        "MEPhI",
        "Moscow",
        "Russia",
        "This paper presents the results of the electrodynamic modelling of the Crossbar H-mode (CH) resonator. The main goal was to get the uniform accelerating field distribution and to optimize effective shunt impedance. The initial model of the 324 MHz cavity consists of 7 equidistant RF gaps with the period length 46.26 mm. To optimize its electrodynamic characteristics the design contains pylons. Solution of the tuning task consists of several steps. Firstly it was chosen the optimal relation between the holding rod length and the pylon's height. Then the most significant improvement on the E-field distribution was introduced by optimizing the gap between end walls of the resonator and the pylon. The final adjustment of the field distribution and the tuning to the working frequency was performed by means of the holes in the pylon. Correct geometry increases effective shunt impedance from 55 MOhm/m to 80 MOhm/m and improves the field flatness to the 97%. The results of optimization the cavities for different particle velocities with 7",
        "9 and 11 accelerating gaps and different aperture diameter are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb05.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB05",
      "page_number": "164",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB06",
      "title": "The Optimization of the Buncher at 145.2 MHz to Reduce Multipactor Effect",
      "authors": [
        "M. Gusarova",
        "T. Kulevoy",
        "I.I. Petrushina",
        "A.S. Plastun",
        "S.M. Polozov",
        "MEPhI",
        "Moscow",
        "Russia",
        "T. Kulevoy",
        "A.S. Plastun",
        "ITEP",
        "Moscow",
        "Russia",
        "The results of the optimization of the cavity of the single gap buncher at 145.2 MHz to reduce multipacting effect are presented. Resonant voltages",
        "impact energies and corresponding particle trajectories are obtained. The variants of design to reduce multipacting effect are considered."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb06.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB06",
      "page_number": "166",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB07",
      "title": "MultP-M  Code Geometry Import Module Performance Optimization",
      "authors": [
        "M. Gusarova",
        "S. Khudyakov",
        "M.V. Lalayan",
        "MEPhI",
        "Moscow",
        "Russia",
        "The new possibilities of three-dimensional modeling program multipactor MultP-M are presented. On an example",
        "consider an increase in the speed and accuracy of the calculation using a new algorithm for calculating the use of loading geometry format STL."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb07.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB07",
      "page_number": "169",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB08",
      "title": "Multi-beam Generator Cavity for the Proton Linear Accelerator Feeding System on 991 MHz Frequency Geometry Optimization",
      "authors": [
        "E.A. Savin",
        "S.V. Matsievskiy",
        "N.P. Sobenin",
        "MEPhI",
        "Moscow",
        "Russia",
        "Nano",
        "Moscow",
        "Russia",
        "For the proton linear accelerator feeding system 800 kW input power value is required. The system consists from pillbox cavity with six beam tubes connected to the rectangular waveguide as a power output system is designed. In case of using high voltage gun with modulated six-bunch injection",
        "this system allows to transform the energy of electron bunches which flies throw beam tubes to accelerating section feeding power. Different types of the structure geometry were calculated. The whole structure consists both from generator cavity and accelerating structure has been designed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb08.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB08",
      "page_number": "171",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB09",
      "title": "Comparision of Higher Order Modes Damping Techniques for Array of Single Cell Cavities",
      "authors": [
        "Ya.V. Shashkov",
        "N.P. Sobenin",
        "MEPhI",
        "Moscow",
        "Russia",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "The LHC High Luminosity upgrade program considers an option of using additional cavities",
        "operating at multiplies of the main RF system frequency of 400 MHz. Such harmonic cavities should provide a possibility to vary the length of colliding bunches. In order to supply the required harmonic voltage several single cell superconducting cavities are to be used. It is desirable to house more cavities in a single cryostat to reduce the number of transitions between \"warm\" and \"cold\" parts of the cryogenic system. In this paper we study electromagnetic characteristics of a chain of the single cell superconducting cavities coupled by drifts tubes. In order to reduce the influence of Higher order modes (HOM) excited in the structure on the beam stability and to minimize eventual power losses we analyze the HOM parameters and calculate the wake potential decay rates due to application of different HOM damping devices. In particular",
        "the methods of HOM damping with rectangular waveguides connected to the drift tubes",
        "the loads placed in the fluted and ridged drift tubes",
        "as well as combinations of these methods are compared.",
        "Higher order modes",
        "superconductivity",
        "harmonic cavities"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb09.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB09",
      "page_number": "174",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB11",
      "title": "Test Results of 433 MHz Deuteron Linac (RFQ)",
      "authors": [
        "Y.A. Svistunov",
        "S.V. Grigorenko",
        "A.N. Kuzhlev",
        "A.K. Liverovskij",
        "I.I. Mezhov",
        "A.A. Ryaskov",
        "A.P. Strokach",
        "V.F. Tsvetkov",
        "O.L. Veresov",
        "Yu. Zuev",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "The results of bench tests of the high frequency deuteron accelerator (RFQ) with output energy of 1 MeV and operating frequency of 433 MHz are presented. There are briefly discussed RFQ construction and assembling",
        "rf system",
        "issues of tuning and measuring of electrodynamical characteristics of RFQ. Output data obtained under accelerated beam operation with foil monitor and Beryllium target are given."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb11.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB11",
      "page_number": "177",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB12",
      "title": "Cascade Interference Switches for Active Microwave Compressors",
      "authors": [
        "S.A. Gorev",
        "S.N. Artemenko",
        "V.A. Avgustinovich",
        "V.S. Igumnov",
        "V.L. Kaminski",
        "S.A. Novikov",
        "Yu.G. Yushkov",
        "TPU",
        "Tomsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Results of study energy extraction devices for S-band microwave pulse compressors are presented. The devices are manufactured as interference switches produced from the circular single mode waveguide and that are differs only by the cascade of identical H-plane T-junctions connected in series at a side arm of H-tee. The versions cascade switches which are matched and unmatched from the side of auxiliary arm of T-junction are investigated. It is shown the variant of cascade switches with the matched T-junctions allows decrease the switching power level few times comparatively the switching power of usual one. Possibility of increasing operation power and stability of output pulses of microwave pulse compressors with such energy extraction devices are confirmed in experiments. There are presented the results of investigation the cascade including two and three switches connected in series by straight arms. It is shown the switching power level for such type cascade switches can be many less than for usual switch with one T-junction. Results of experimental study cascade switches of such type confirming with the results of the theoretical analyses are presented and peculiarities of cascade switches are mentioned. The assumption about good perspectives for the cascade switches manufactured from oversized rectangular waveguide is formulated. The obtained results concerning of the cascade switch operation have been demonstrated the possibility of increasing switch operation power.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb12.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB12",
      "page_number": "180",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB13",
      "title": "Oversized Interference Switches of Active Microwave Pulse Compressors",
      "authors": [
        "V.S. Igumnov",
        "S.N. Artemenko",
        "V.A. Avgustinovich",
        "S.A. Gorev",
        "V.L. Kaminski",
        "S.A. Novikov",
        "Yu.G. Yushkov",
        "TPU",
        "Tomsk",
        "Russia",
        "Results of simulation and experimental study of two types of the oversized interference switches are presented. The switch of the first type was developed on basis of the simulation of the oversized rectangular waveguide H-tee with the H01 operation mode. Conditions of effective operation of the first type switch as an energy extraction element of active microwave pulse compressors are determined. The output pulse power of 2.8 MW and pulse width of 3.5 ns with the corresponding amplification factor of 17.5 dB for were obtained in the X-band microwave pulse compressor prototype containing the storage cavity made of WR-284 waveguide and the switch made of the waveguide with the cross section area of 58×25 mm2. The results of experimental study of the oversized X-band interference switch of the second type with the synchronous energy extraction through a compact packet of common single mode switches incorporating the five identical waveguide tees are presented as well. Possibility of full synchronization of the switch packet is proved and the conditions of such synchronization are determined. Permissible quantity of the switches in a packet unit is estimated. The output pulse power of 0.8 MW",
        "pulse width of 3.2 ns at the power gain of 12 dB and the pulse power of 2.2 MW",
        "pulse width of 3.5 ns at the power gain of 16.5 dB were obtained when the energy extraction from the five different single mode resonant cavities and an oversized cavity respectively was synchronous."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb13.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB13",
      "page_number": "183",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB14",
      "title": "Analysis of Single Biological Cells",
      "authors": [
        "Belarusian State Agrarian Technical University",
        "Minsk",
        "Belarus",
        "The direct analysis of trace metals in single cells and biological tissues is a challenging task that requires sophisticated analytical developments. The aim of this abstract is to present some recent achievements in the field of chemical element imaging of biological samples using ion beam micro-analysis. In the present work the potential of high-resolution RBS for detection of trace elements in an organic compound was tested. The main advantage of using RBS is that relative and absolute concentrations of present elements can be determined with very high accuracy. This study revealed the accumulation sites of micro- and macronutrients in seeds. Two selected examples of PIXE microanalysis in ecophysiology are presented. Studies of heavy metal distributions in seeds showed different filtration mechanisms of Zn/Pb and Fe/Mn",
        "both enabling plants to cope with metals present in the environment.*",
        "* A. Lagutin. Microscopy with Nanoscale Resolution Studied by High-Resolution RBS and Micro-PIXE. Proceedings of ICACS-26",
        "13-18 July 2014",
        "abstract P73",
        "P.124-125."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb14.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB14",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB15",
      "title": "The Utilization of Standard DC Accelerator ELV for The Tomography",
      "authors": [
        "E.V. Domarov",
        "K.A. Bryazgin",
        "S. Fadeev",
        "D.A. Kogut",
        "N.K. Kuksanov",
        "P.I. Nemytov",
        "R.A. Salimov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "ELV accelerators have been developed at the Institute of Nuclear Physics",
        "Siberian Branch of the Russian Academy of Sciences and occupy a special place in the spectrum of the equipment produced by the Institute. These machines are widely used for radiation modification of polymers and worked well in a variety of processes in many countries of the Eurasian continent. Using serial ELV accelerators for industrial tomography opens up new possibilities for industrial technologies. This increases the requirements on the stability parameters of the injected electron beam. The article formulates the requirements for electron accelerator ELV for tomographic studies",
        "pulsation energy and beam current. Described Schottky effect affects to the shape and size of the ripple current",
        "and the method for increasing the stability of the beam parameters. These machines are unified with conventional accelerators ELV and expand the scope of their utilization."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb15.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB15",
      "page_number": "186",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB16",
      "title": "Studying of the Accompanying Charged Particles in the Tandem Accelerator with Vacuum Insulation",
      "authors": [
        "A.N. Makarov",
        "D.A. Kasatov",
        "I.M. Shchudlo",
        "S.Yu. Taskaev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "On the tandem accelerator with vacuum insulation in a steady long mode it was obtained 1.6 mA current of protons with 2 MeV energy. It was studied the one of the possible reasons of current limitation – the appearance of accompanying charged particles during acceleration of the ion beam. The paper presents and discusses the results of the accompanying beam measurement using a special detector. The detector registered an opposite positive current in the range of 80-170 mkA",
        "which is directly dependent on vacuum conditions in the accelerator. Also it was measured the dependence of the dose rate on the total current in the accelerating gap. These measurements confirmed that injected H− beam ionizes residual and stripping gas mainly in the area before the first electrode and two proposals were made to minimize the accompanying current."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb16.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB16",
      "page_number": "189",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB17",
      "title": "Development of the Injector for Vacuum Insulated Tandem Accelerator",
      "authors": [
        "A.S. Kuznetsov",
        "A.A. Alexander",
        "M.A. Tiunov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "D.A. Kasatov",
        "A.M. Koshkarev",
        "NSU",
        "Novosibirsk",
        "Russia",
        "The Vacuum Insulated Tandem Accelerator is built at the Budker Institute of Nuclear Physics.* The accelerator is designed for development of the concept of accelerator-based boron neutron capture therapy of malignant tumors in the clinic.** In the accelerator the negative hydrogen ions are accelerated by the high voltage electrode potential to the half of required energy",
        "and after conversion of the ions into protons by means of a gas stripping target the protons are accelerated again by the same potential to the full beam energy. A number of innovative ideas posited in the design make it possible to accelerate intense beams in a compact accelerator. Number of investigations revealed weak points of the accelerator injector: unnecessary beam stripping by the residual gas and complexity to improve the vacuum conditions",
        "the influence of the stripping gas to the ion source operation stability. To ensure the beam parameters and reliability of the facility operation required for clinical applications",
        "the new injector is designed based on the ion source with a current up to 15 mA",
        "providing the possibility of preliminary beam acceleration upto 120-200 keV. The paper presents the design of the injector and the results of calculations performed.",
        "*Aleynik V.",
        "Bashkirtsev A.",
        "et al. Applied Radiation and Isotopes 88 (2014) 177-179. **Bayanov B.",
        "Belov V.",
        "et al. Nuclear Instr. and Methods in Physics Research A 413/2-3 (1998) 397-426."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb17.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB17",
      "page_number": "191",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB18",
      "title": "Modification of the Argon Stripping Target of the Tandem Accelerator",
      "authors": [
        "Y.M. Ostreinov",
        "A.N. Makarov",
        "S.Yu. Taskaev",
        "P. Vobly",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The paper presents and discusses the project of modified gas stripping target. The idea of the target modification is the following. Inside the high-voltage electrode just behind inlet aperture it is proposed to apply 1 T transverse magnetic field using a two-pole permanent magnets. Similar magnets at the exit of the stripping target return proton beam back to the axis of accelerator channel. In this geometry not only significant suppression of ion penetration of the stripping gas into the accelerating channel can be achieved",
        "but also a significant improvement of vacuum conditions in the accelerating channel and reduction of the ultraviolet radiation from the plasma in the stripping target. It is enough to shift the stripping target to a distance greater than the aperture (20 mm) in the high-voltage electrode and to implement a differential gas pumping. The paper presents results of trajectory calculation of the injected ion beam in Comsol Multiphysics. The geometry of the magnetic system and the system of differential gas pumping using turbomolecular pump installed inside the high-voltage electrode are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb18.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB18",
      "page_number": "194",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB19",
      "title": "First Results of Experiments with the Extracted Carbon Beam  at the U-70 Accelerator",
      "authors": [
        "V.A. Pikalov",
        "G.I. Britvich",
        "S.A. Gorokhov",
        "N. Ivanova",
        "V.A. Kalinin",
        "A.V. Koshelev",
        "M.Y. Kostin",
        "A. Lukyantsev",
        "S. Makonin",
        "A. Matyushin",
        "A.V. Maximov",
        "V. Milyutkin",
        "A.P. Ostankov",
        "M.K. Polkovnikov",
        "V.S. Seleznev",
        "A.Y. Sotnikov",
        "IHEP",
        "Moscow Region",
        "Russia",
        "E.E. Beketov",
        "S.N. Koryakin",
        "A.A. Lychagin",
        "M.V. Troshina",
        "S.E. Ulyanenko",
        "MRRC",
        "Obninsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The scheme of the C ions beam production with energy 455 MeV/nucleon from the U-70 accelerator was described briefly. The equipment facilities for the radiobiology experiments were shown. Experimental parameters of the carbon beam were described. The first experimental results were shown.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb19.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB19",
      "page_number": "197",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB20",
      "title": "Experimental Study of the Time Dependence of the Activity of Delayed Neutrons in the Fission of 235U by Neutrons from the Reaction 7Li(p, n) on the Electrostatic Accelerator EG-1",
      "authors": [
        "K.V. Mitrofanov",
        "A.S. Egorov",
        "D.E. Gremyachkin",
        "V.F. Mitrofanov",
        "V.M. Piksaikin",
        "B.F. Samylin",
        "IPPE",
        "Obninsk",
        "Russia",
        "In the present work the installation created on the basis of the accelerator EG-1 (IPPE) for the experimental studies of the time dependence of delayed neutron activity from neutron induced fission of 235U is described. Measurements were carried out with neutron beam generated with the help of the 7Li(p",
        "n) reaction. The lower limit of the investigated time range was governed by the proton beam switching system that was 20 ms. It was shown that the temporary characteristics of delayed neutrons from the fission of 235U by epithermal neutrons is consistent with the time dependence which at present is recommended as a standard. In case of the fast neutron induced fission of 235U the measured decay curve of delayed neutrons shows excess of counting rate in the time interval 0.01-0.2 s as compared with the decay curve corresponding to the recommended data."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb20.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB20",
      "page_number": "200",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB21",
      "title": "Registration of Gamma Rays from the Reaction 16O(n, p)16N on the Direct Neutron Beam of Cascade Generator KG-2.5",
      "authors": [
        "K.V. Mitrofanov",
        "A.S. Egorov",
        "V.M. Piksaikin",
        "B.F. Samylin",
        "IPPE",
        "Obninsk",
        "Russia",
        "In the present work the results of analysis of the oxygen content in the water with the help of gamma-rays registration from the reaction 16O(n",
        "p)16N is described. The samples were installed permanently on the direct beam of neutrons generated by the reaction 7Li(d",
        "n) in the cascade generator KG-2.5 (IPPE). A comparison was carried out with experimental data obtained by the activation method in similar experimental conditions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb21.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB21",
      "page_number": "203",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB22",
      "title": "Conditioning and Monitoring of Cleanliness of High Voltage System with Gesous Insulation",
      "authors": [
        "IPPE",
        "Kaluga Region",
        "Russia",
        "Abstract An account is given of new effective technique of conditioning gaseous insulation of an electrostatic accelerator",
        "primary purifying it from free solid microparticles. The procedure of conditioning continuities to obtaining stable breakdown voltage of high voltage accelerator about 7-8 hours (at value of accelerator tank of 9 cubic meter). Three techniques of check of cleanliness of gaseous insulation or carried out early high voltage experiment are proposed. Conditioning effect keeps after tank opening at a repeated input in tank early purified gas."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb22.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB22",
      "page_number": "206",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB23",
      "title": "Set-up for Measurements of Delayed Neutron Characteristics in Interaction of Heavy Nuclei with Relativistic Protons of the Synchrocyclotron PINP Gatchina",
      "authors": [
        "A.S. Egorov",
        "V.F. Mitrofanov",
        "V.M. Piksaikin",
        "B.F. Samylin",
        "IPPE",
        "Obninsk",
        "Russia",
        "In the present paper the method and set-up for measurements of delayed neutron characteristics in interaction of heavy nuclei with relativistic protons are described. On the basis of this method the time dependence of delayed neutron activity has been measured from interaction of 238U sample with 1 GeV pulsed proton beam of the synchrocyclotron of the Petersburg Institute of Nuclear Physics",
        "Gatchina. The measured data was analyzed in frame of 8-group precursor's model with a unified set of half-lives. Obtained results on the fractional yields of delayed neutrons are compared with the appropriate data from the fast neutron induced fission of 238U."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb23.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB23",
      "page_number": "209",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB24",
      "title": "Comparison of Biological Impact of Proton and Ion Beams in Radiation Treatment",
      "authors": [
        "ITEP",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The work contains the comparison of biological doses' distribution calculated for treatment of the same targets by proton and ion beams. Advantages of the ion beam are shown for targets with different sizes and with different depths.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb24.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB24",
      "page_number": "211",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB25",
      "title": "PRIOR Proton Microscope",
      "authors": [
        "D. Varentsov",
        "P.M. Lang",
        "M.E. Rodionova",
        "L. Shestov",
        "K. Weyrich",
        "GSI",
        "Darmstadt",
        "Germany",
        "A.V. Bakhmutova",
        "A.V. Bogdanov",
        "A. Golubev",
        "A.V. Kantsyrev",
        "N.V. Markov",
        "V.A. Panyushkin",
        "A.I. Semennikov",
        "V. Skachkov",
        "ITEP",
        "Moscow",
        "Russia",
        "C.W. Barnes",
        "F.G. Mariam",
        "F.E. Merrill",
        "C. Wilde",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "S.V. Efimov",
        "Y. Krasik",
        "O. Oleg",
        "Technion",
        "Haifa",
        "Israel",
        "MEPhI",
        "Moscow",
        "Russia",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "IPCP",
        "Chernogolovka",
        "Moscow region",
        "Russia",
        "The new proton radiography facility PRIOR* (Proton microscope for FAIR) was developed at SIS-18 accelerator at GSI (Darmstadt",
        "Germany). PRIOR setup is designed for measurement",
        "with high spatial resolution up to 10 mkm",
        "of density distribution of static and dynamic objects by using a proton beam with energy up to 4.5 GeV. The magnetic system of the PRIOR beam-line consists of two sections. The first",
        "matching section",
        "contains electromagnetic-quadruple lenses and provides formation of a proton beam for the objects imaging task (beam size",
        "angular distribution). The second section is a magnification (K ~4) section that consists of four Permanent Magnet Quadruples (PMQ) lenses. Tungsten collimators",
        "installed at central plane of magnification section",
        "provides regulation of contrast of the proton-radiographic images. Investigated object installed between first and second section. The registration system for static experiments consists of CsI scintillator and plastic scintillator (Bicron BC-412) for dynamic one with two types of intensified CCD cameras: PCO DiMAX and PCO DicamPro. In the first experiments with static objects with 3.6 Gev proton",
        "was demonstrated a spatial resolution of 30 mkm. Dynamic commissioning was performed with target based on underwater electrical wires explosion with electrical pulse with current amplitude of ~200 kA and time duration of few microseconds.",
        "* Merrill F.E. et al.",
        "Proton microscopy at FAIR",
        "AIP Conf. Proc. 1195",
        "2009",
        "p.667"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb25.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB25",
      "page_number": "214",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB26",
      "title": "Study of Possibility of Industrial Application of Ion Injector I-3",
      "authors": [
        "ITEP",
        "Moscow",
        "Russia",
        "Ions injector I-3 of the ITEP-TWAC accelerator complex consists of a buncher",
        "two-gap accelerating cavity and a beam transport line. Laser ion source is used to generate ions for the injector. Possibility of application of the injector to dope semiconductor materials with variable energy ions is considered. Results of beam parameters optimization by numerical simulation to produce uniform distribution of particles density and required energy spread on the target are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb26.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB26",
      "page_number": "217",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB27",
      "title": "Design of Multifunctional Facility Based on ECR Ion Source for Material Science",
      "authors": [
        "A.V. Ziiatdinova",
        "T. Kulevoy",
        "MEPhI",
        "Moscow",
        "Russia",
        "S.L. Andrianov",
        "B.B. Chalykh",
        "G. Kropachev",
        "R.P. Kuibeda",
        "T. Kulevoy",
        "A.V. Ziiatdinova",
        "ITEP",
        "Moscow",
        "Russia",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "The traditional experimental method for new materials radiation resistance investigation is a reactor irradiation. However",
        "there are some difficulties during steel exposure in reactor. Simulation method based on ion irradiation allows accelerating the defect generation in the material under investigation. Also a modification of materials by ion beams represents the great practical interest for modern material science. Experiments in both directions are ongoing in ITEP. The paper presents the design of the test-bench based on ECR ion source and electrostatic acceleration which is under development in ITEP. This paper describes the results of beam dynamics simulation in the transport channels of the test-bench. Simulation was carried out in the \"real\" fields Continuous ion beam achievable at the test-bench enables beam fluence on the target up to 1016 particles/m2."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb27.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB27",
      "page_number": "220",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB28",
      "title": "Design Studies of the Superconducting Cyclotrons for Proton Therapy",
      "authors": [
        "G.A. Karamysheva",
        "S.A. Kostromin",
        "N.A. Morozov",
        "E. Samsonov",
        "E. Syresin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "JINR/DLNP",
        "Dubna",
        "Moscow region",
        "Russia",
        "Different projects of the cyclotrons for proton therapy were considered in order to provide Medical Technical Complex at JINR",
        "Dubna by proton beam. Our projects can be used for development of the accelerator for proton therapy for the other medical centers. We propose project of the superconducting cyclotron accelerating protons up to energy 250 MeV and superconducting synchrocyclotron which can be used as the 70 MeV protons source for radiation therapy of the shallow-allocated tumors. Conceptual designs of cyclotrons are considered. Main parameters of the magnetic and accelerating systems are chosen. Main aspects of the beam dynamics are studied by means of simulation of the acceleration in the main region of radii",
        "in the extraction region and simulation of the particles capture into acceleration in the very center of the machine."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb28.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB28",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB29",
      "title": "The Induction Synchrotron with a Constant Magnetic Field",
      "authors": [
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "In this report possibility of cyclic acceleration of the charged particles in constant in time a magnetic field is discussed. The closed orbit of particles is formed by a set of magnetic dipoles. In each section of dipoles the radial dispersion of trajectories of a beam depends on the azimuthal length of a dipole and has the small size (on the order of several centimeters). As the dipole section has radial focusing and vertical defocusing",
        "using quadrupole lenses between dipole sections it is possible to organize alternating-sing focusing on all perimeter of the accelerator. Particles are accelerated by electric field of the induction sections which powering up is made at bunch approach. The inductor of sections are remagnetized in the range of time between a beam bunches. Stability of longitudinal oscillations is defined by a form of a table of accelerating induction pulses. Such accelerator is able to afford to expand the range of parameters of accelerated particles on their charge and atomic weight as doesn't demand compliance of a resonance of HF-system to the frequency of the circular frequency of accelerated particles."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb29.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB29",
      "page_number": "223",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB30",
      "title": "The Compact Induction Accelerator of Electrons for Radiation Technologies",
      "authors": [
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The electron accelerator with energy <10 MEV uses a rectangular pulse of the accelerating induction voltage and a trapezoidal pulse of a leading magnetic field. For preservation of radius of an equilibrium orbit to constants special ratios between amplitude-time characteristics of a magnetic induction and the accelerating voltage of inductors are carried out. The accelerator contains alternating-sign focusing in dipole magnets and rectilinear accelerator parts. Total cross-section of inductors of accelerating section is equal to S=WL/Bc",
        "(W-energy of electrons",
        "L-perimeter of an orbit",
        "B<2Bs",
        "Bs-индукция of saturation of inductors",
        "c - velocity of light)"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb30.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB30",
      "page_number": "226",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB31",
      "title": "Project of Demonstration Center of the Proton Therapy at DLNP JINR",
      "authors": [
        "E. Syresin",
        "G.A. Karamysheva",
        "M.Y. Kazarinov",
        "N.A. Morozov",
        "G.V. Mytzin",
        "N.G. Shakun",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "STU",
        "Bratislava",
        "Slovak Republic",
        "JINR is one of the leading proton therapy research centers of the in Russia. The modern technique of 3D conformal proton radiotherapy was first effectuated in Russia in this center",
        "and now it is effectively used in regular treatment sessions. A special Medico-Technical Complex was created at JINR on the basis of the phasotron used for proton treatment. About 100 patients undergo a course of fractionated treatment here every year. During last 14 years were treated by proton beams about more than 1000 patients . A project of the demonstration center of the proton therapy is discussed on base of a superconducting 250 MeV synchrocyclotron. The superconducting synchrocyclotron is planned to install instead of phasotron in Medical Technical Complex of DLNP. The new transport channel is designed for beam delivery to the JINR medical cabin."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb31.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB31",
      "page_number": "228",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB32",
      "title": "Positron Annihilation Spectroscopy at LEPTA Facility",
      "authors": [
        "P. Horodek",
        "I.N. Meshkov",
        "JINR/DLNP",
        "Dubna",
        "Moscow region",
        "Russia",
        "A.G. Kobets",
        "O. Orlov",
        "A.A. Sidorin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Since 2009 year the LEPTA facility at Joint Institute for Nuclear Research in Dubna is operated with positron beam. Today it is developed into two directions. The first one is getting orthopositronium flux in flight. Slow positrons from 22Na source are accumulated in Surko trap and then are injected into the ring where they should overlap with electrons from the sigle-pass electron beam. In this way the flux of orthopositronium atoms will appear and will be observed in the process of registration of gamma quanta from annihilation process. The second group of works focuses on using the positron injector for Positron Annihilation Spectroscopy (PAS) applications. This method is dedicated to detection of structural defects as vacancies in the solid body lattice. The latest progress of this technique is strictly connected with measurements of PAS characteristics using positron beams. The progress in the LEPTA development",
        "the first results obtained in the PAS",
        "idea and actual state of works concerning the construction of the pulsed positron beam will be presented. The creation of pulsed positron beams is the modern tendency in the PAS domain. It allows to measure the lifetimes of annihilating positron in the depth ca. 1 mkm under the surface. It makes possible the identification of kind of defect."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb32.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB32",
      "page_number": "231",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB33",
      "title": "Development of the Equipment for the Prototype of a Complex of  Radiotherapy at the Nuclotron-M",
      "authors": [
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The report deals with the construction of the carbon beam transport line for biomedical research at the Nuclotron accelerator complex",
        "JINR",
        "Dubna. We have studied the scheme and modes of magneto-optical elements of the channel. Used electronics described. We are discussed the compilation and realization of the plan of treating a tumor located at a depth up to 30 cm. Choice of beam scanning schemes and their optimization are shown."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb33.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB33",
      "page_number": "234",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB34",
      "title": "Characteristics of Control of Collimators IRIS in the Robotic Radiosurgical System CYBERKNIFE",
      "authors": [
        "MEPhI",
        "Moscow",
        "Russia",
        "In work performed the investigation of depending permissible deviation size of the aperture in the case of intersecting beams profiles from the rated size of the aperture collimator IRIS. Determined the dependence permissible deviation collimator aperture size associated with the change of output factors with aperture size",
        "of the rated size of the collimator aperture IRIS. It is found that the needed accuracy of the installation of a given size aperture the collimator for minimum IRIS collimator does not exceed the accuracy of the aperture the installation on the manufacturer's specifications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb34.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB34",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB35",
      "title": "Thermal Simulations of the Biperiodical Accelerating Structure with the Operating Frequency 27 GHz",
      "authors": [
        "Yu.D. Kliuchevskaia",
        "S.M. Polozov",
        "MEPhI",
        "Moscow",
        "Russia",
        "Biperiodical accelerating structure (BAS) represents an accelerating structure based on disk loaded waveguide (DLW) with π/2 operation mode. The 1 cm band structure will have very compact transverse size. Such characteristics give it perspective to use in medical accelerators. The results of beam dynamics simulation and electrodynamics study was discussed early. It will important to study the BAS electrodynamics taking into account thermal processes in structure and to design the cooling system. It is important because of the high pulse RF power (about 1.5 MW) necessary for the beam acceleration. The simulation results which are defined using CST code will presented in report. Calculation and determination of the thermolysis coefficient depending on speed",
        "temperature and the water flow direction will make."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb35.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB35",
      "page_number": "237",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB36",
      "title": "A prototype of a Phased Array for Deep Thermoradiotherapy",
      "authors": [
        "A.M. Fadeev",
        "A.A. Blinnikov",
        "S.M. Ivanov",
        "S.M. Polozov",
        "MEPhI",
        "Moscow",
        "Russia",
        "It is proven that hyperthermia increases radiation and chemotherapy efficiency. In oncology",
        "the generation of a higher temperature at a tumor-involved region of the body is called hyperthermia. The thermoradiotherapy is widely and effective uses. A phased array of eight dipoles for the hyperthermia treatment of deep-seated tumors is proposed earlier. The power and phase coherently delivered to the radiating elements can be varied",
        "so that the electromagnetic field is increased at the tumor location and decreased in the normal tissues. The prototype of the phased array of two dipoles and the RF power scheme are presented and results of experiments are discussed. Measured and simulated temperature distributions along the line connecting two dipoles are discussed in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb36.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB36",
      "page_number": "240",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB37",
      "title": "Interdisciplinary Glossary – Particle Accelerators and Medicine",
      "authors": [
        "V.S. Dyubkov",
        "V.V. Dmitriyeva",
        "V.G. Nikitaev",
        "MEPhI",
        "Moscow",
        "Russia",
        "MEPHI",
        "Moscow",
        "Russia",
        "A general concept of a new interdisciplinary glossary",
        "which includes particle accelerator terminology used in medicine",
        "as well as relevant medical concepts",
        "is presented. Its structure and usage rules are described. An example",
        "illustrating the quickly searching technique of relevant information in this Glossary",
        "is considered. A website address",
        "where one can get an access to the Glossary",
        "is specified. Glossary can be refined and supplemented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb37_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb37.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb37_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB37",
      "page_number": "243",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB38",
      "title": "Multifunctional Extraction Channel Development Heavy Ion RFQ (Radio Frequency Quadrupole)",
      "authors": [
        "E. Khabibullina",
        "T. Kulevoy",
        "MEPhI",
        "Moscow",
        "Russia",
        "B.B. Chalykh",
        "R. Gavrilin",
        "A. Golubev",
        "G. Kropachev",
        "R.P. Kuibeda",
        "T. Kulevoy",
        "S.A. Visotski",
        "ITEP",
        "Moscow",
        "Russia",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "In the ITEP the Heavy Ion RFQ HIP-1 (Heavy Ion Prototype) provides ion beams for two different experimental programs. The first one is successfully ongoing and it is aimed to irradiation resistance investigation of reactor construction materials. Samples of new materials for reactors are irradiated by beams of iron",
        "vanadium ions accelerated by the linac. The structure changes are investigated by both transmission electron microscope and atom-probe tomography. The second one is under development and it is aimed to investigate ion beam interaction with plasma and metal vapor targets. On the basis of beam dynamics simulation the design of new RFQ-output line for both experiments realization was developed. Details of beam dynamics simulation and output line design are presented and discussed in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb38_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb38.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb38_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB38",
      "page_number": "245",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB39",
      "title": "Industrial Prototype of Compact CW Linac",
      "authors": [
        "D.S. Yurov",
        "A.S. Alimov",
        "B.S. Ishkanov",
        "V.P. Sakharov",
        "MSU",
        "Moscow",
        "Russia",
        "N.I. Pakhomov",
        "V.I. Shvedunov",
        "M.V. Lomonosov Moscow State University (MSU)",
        "Skobeltsyn Institute of Nuclear Physics",
        "Moscow",
        "Russia",
        "A compact continuous-wave linear accelerator for industrial applications with an output electron energy of 1 MeV and design average beam current of 25 mA is described. The results of beam dynamics",
        "accelerating structure",
        "and RF system simulation are presented",
        "accelerator construction and first results of its commissioning are described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb39_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb39.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb39_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB39",
      "page_number": "248",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB40",
      "title": "Design of a Linear Accelerator with a Magnetic Mirror on the Beam Energy of 45 MeV",
      "authors": [
        "V.I. Shvedunov",
        "A.N. Ermakov",
        "B.S. Ishkanov",
        "A.N. Kamanin",
        "V.V. Khankin",
        "L.Yu. Ovchinnikova",
        "N.I. Pakhomov",
        "I.Yu. Vladimirov",
        "MSU",
        "Moscow",
        "Russia",
        "A.I. Karev",
        "V.G. Raevsky",
        "LPI",
        "Moscow",
        "Russia",
        "I.V. Shvedunov",
        "N.V. Shvedunov",
        "D.S. Yurov",
        "MSU SINP",
        "Moscow",
        "Russia",
        "The results of calculation and optimization of pulsed linear accelerator with magnetic mirror on the beam energy",
        "adjustable in the range of 20 - 45 MeV",
        "designed for explosives detection and other applications are presented. The accelerator consists of an electron gun with an off-axis placed cathode with a beam hole on axis; of about 1.6 m long section of standing wave bi-periodic accelerating structure",
        "operating at 2856 MHz",
        "which is optimized to achieve the capture coefficient of more than 50% and of the energy spectrum width of about 2%; of a movable dispersion free magnetic mirror made with rare earth permanent magnet material. Accelerator provides acceleration of the beam with a pulse current of 100 mA to an energy of 45 MeV with RF power consumption less than 10 MW."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb40_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb40.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb40_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB40",
      "page_number": "251",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB41",
      "title": "The X-ray System with Sub-system of Shaping of Fun-Shaped Beam and its Application in the Custom Inspection Systems",
      "authors": [
        "Yu.N. Gavrish",
        "A.M. Fialkovskiy",
        "P.O. Klinovskiy",
        "K.V. Kotenko",
        "V.P. Malyshev",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "The analytical survey of X-ray sources based on linear electron accelerators applied in the customs inspection systems (IDK) was carried out on the grounds of requirements to customs inspection systems. The test results of the linear electron accelerator IDK-6/9 MeV which allows to generate the X-ray mode with energies of 6 and 9 MeV are given in this article. The questions of unification of linear electron accelerators for different IDK are also studied. It is proved that the JSC \"D.V. Efremov Scientific Research Institute of Electrophysical Apparatus\" has the necessary scientific and technical potential and is ready to work out and to produce the X-ray sources for Automobile",
        "Sea and Railway Inspection Systems (IDK). In addition to that the JSC \"D.V. Efremov Scientific Research Institute of Electrophysical Apparatus\" is ready to organize the serial production of X-ray sources for inspection systems."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb41_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb41.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb41_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB41",
      "page_number": "254",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB42",
      "title": "Histogram Based Bremsstrahlung Radiation Source Model for the CyberKnife Medical Linear Accelerator",
      "authors": [
        "A.V. Dalechina",
        "A.I. Ksenofontov",
        "NRNU",
        "Moscow",
        "Russia",
        "N.N. Burdenko Neurosurgical Institute",
        "Moscow",
        "Russia",
        "The accuracy of dose calculations is of fundamental importance in treatment planning of radiation therapy. The dose distributions must be calculated and verified by an accurate algorithm. The Monte Carlo simulation (statistical method",
        "based on random sampling) of radiation transport is the only method that makes it possible to perform high-precision dose calculations in the case of a complex geometry. The main bottleneck for the application of this method in practical planning of radiation therapy is the lack of a general virtual source model of the accelerator radiation source. There are several approaches that have been described in the literature*. The goal of this work is to build a source model",
        "based on histogram distributions",
        "to represent the 6 MV photon beams from the Cyberknife stereotactic radiosurgery system** for Monte Carlo treatment planning dose calculations. The transport of particles in treatment head of Cyberknife was simulated. Energy",
        "radial and angular distributions were calculated. Source model was created on the base of the cumulative histograms. This approach provides producing an unlimited number of particles for the next dosimetric planning. Results of source modelling were verified in comparison with full-scale simulation without model. Good agreement was shown with calculations using the source model of the linear accelerator treatment head.",
        "*Chetty I.J. et al. Report of the AAPM Task Group No. 105// Med. Phys. 2007.  **Francescon P.",
        "Cora S.",
        "Cavedon C. Total scatter factors of small beams // Med. Phys. 2008."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb42_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb42.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb42_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB42",
      "page_number": "256",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB43",
      "title": "Magnetic Buncher Accelerator UELV-10-10-T-1 for Studying Fluorescence and Radiation-Physical Researches",
      "authors": [
        "Y.S. Pavlov",
        "V.A. Danilichev",
        "V.V. Dobrohotov",
        "O.N. Nepomnyaschy",
        "V.A. Pavlov",
        "IPCE RAS",
        "Moscow",
        "Russia",
        "Accelerator UELV-10-10-T-1 is equipped with special system of injection and magnetic buncher with the purpose of generation picoseconds the beam duration 50 ps with the current 150 A at energy 10 MeV for studying fluorescence and radiation-physical researches. For maintenance of the magnetic bunching the accelerator works in the mode of the reserved energy when duration of the pulse of injection (2",
        "5 nanoseconds) is much less than time of filling of a wave guide energy (100 nanoseconds). At a pulse microwave of capacity 10 MW the energy which has been saved up in the wave guide",
        "makes about 2 J. It provides an opportunity of a cutting collimator separately chosen bunch after scan of \"package\" by a rotary magnet. After an output from the accelerator the package electrons from 3-5 bunches acts in magnetic buncher consisting of two electromagnets. In buncher the beam is scanning as \"fan\"",
        "and then focused. At a current of the beam 30 A in the pulse duration 2",
        "5 nanoseconds distinction on energy between the adjacent bunches makes of 300 keV",
        "that provides an opportunity of the cutting collimator the separate chosen bunch after space scanning with a rotary magnet. At a magnetic bunching electrons in \"head\" of a bunch have the big energy and are transported on trajectories with the big radius than \"tail\" electrons. Thus \"compression\" of the bunch on time is attain and accordingly the charge of a bunch increases."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb43_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb43.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb43_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB43",
      "page_number": "259",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB44",
      "title": "Neutron Radiation Monitoring of the Therapeutic Proton Beam Transportation",
      "authors": [
        "RAS/INR",
        "Moscow",
        "Russia",
        "A monitoring system online controls a therapeutic proton beam by measuring a secondary neutron radiation from the beam losses. The system consists of neutron detectors in the transport path passage from Linac to the facility of proton therapy and terminal controller connected to the computer. The neutron detectors measure a level of the secondary neutron radiation in real time along of the transport channel",
        "near the formative elements. The system of the neutron detectors registers temporal variations of the beam intensity in local areas transport medical channel. These changes arise are due to changes in operating mode of the channels or instability of the elements forming the beam. The monitoring system allows to determine a intensity and temporal structure of the therapeutic beam and to detect mode and instability of the formative elements."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb44_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb44.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb44_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB44",
      "page_number": "262",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB45",
      "title": "Small-Size High-Performance ARSA Accelerators for On-Line Testing for ECB for Radiation Hardness",
      "authors": [
        "VNIIEF",
        "Sarov",
        "Russia",
        "S.P. Pukhov",
        "A.V. Rodigin",
        "A.L. Yur’yev",
        "RFNC – VNIIEF",
        "Sarov",
        "Russia",
        "A small-size high-performance pulsed accelerator ARSA with the voltage up to 1.3MeV is developed. The accelerator is distinguished for stability of characteristics (spread no more than ±10%)",
        "high dose rate of bremsstrahlung (up to 1.5*1010 R/s in a spot 1 cm in diameter)",
        "potentiality of intense operation (hundreds of shots a day)",
        "electro-magnetic compatibility with radio electronics. There is developed a fiber-optic monitor-dosimeter functionally connected with ARSA control panel ensuring pulse measurement of bremsstrahlung",
        "accumulation of the prescribed dose",
        "reading of data to the computer. To monitor the shape of bremsstrahlung pulses a separate channel is provided."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb45_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb45.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb45_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB45",
      "page_number": "264",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB46",
      "title": "Ion Optical Arrangement And Design Of A Quasi-Monochromatic X-Ray End-Station At Analytical Accelerating Facility Of Nas Of Ukraine",
      "authors": [
        "SSU",
        "Sumy",
        "Ukraine"
      ],
      "institutions": [],
      "abstract": "A quasi-monochromatic X-ray end-station have been developed and constructed on a base of an accelerating facility at NAS of Ukraine for biological objects research (Sumy). Beam focusing on a target was performed by doublets of electrostatic lenses. The system provides an H+ ion beam with energy of 2 MeV from an electrostatic accelerator to a convertor. Here beam current was of some microampere at a 100x100 mkm beam.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb46_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb46.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb46_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB46",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB47",
      "title": "Depth Dose Distribution of the Bremsstrahlung Generated by the Betatron OB-4 in Different Environments",
      "authors": [
        "I. Miloichikova",
        "V. Ruchyeva",
        "E. Shuvalov",
        "S. Stuchebrov",
        "TPU",
        "Tomsk",
        "Russia",
        "Within a research framework of the development of the new methods to reduce radiation doses for the objects under radiographic analysis",
        "it was proposed to use the pulsed irradiation source synchronized with the detecting device. The previous tests showed a significant radiation dose decline to the objects in comparison with conventional techniques. For estimation of the suitability of using the compact betatron OB-4 as a source of bremsstrahlung for visualization purposes it is necessary to investigate the dosymetric parameters of the device. In the paper the dosimetric parameters measurement technique of the bremsstrahlung generated by betatron OB-4 is described. The radiation dose measurement results from the bremsstrahlung generated by betatron are shown. The depth dose distributions of the bremsstrahlung generated by betatron obtained with the help of the solid thermoluminescent detectors DTL-02 and the dosimeter UNIDOS E equipped with a PTW Farmer cylindrical ionization chamber type 30013 in the different environments (in the air",
        "in the water andin the lead) are illustrated."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb47_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb47.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb47_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB47",
      "page_number": "266",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB48",
      "title": "Status of Experiments on Surface Modification of Materials on the Accelerator HIP-1",
      "authors": [
        "S.L. Andrianov",
        "A.A. Aleev",
        "A. A. Andreev",
        "D. Aparin",
        "A.A. Bogachev",
        "B.B. Chalykh",
        "P.A. Fedin",
        "A. Golubev",
        "N.A. Iskandarov",
        "G. Kropachev",
        "R.P. Kuibeda",
        "T. Kulevoy",
        "A.A. Nikitin",
        "N.N. Orlov",
        "S.V. Rogozhkin",
        "A. Sitnikov",
        "ITEP",
        "Moscow",
        "Russia",
        "Ion-implant doping is efficient method of modification for near-surface layers material which used in different technological applications. The most common example of its is increase wear",
        "corrosion",
        "heat resistance of various industrial steels",
        "special alloys implantation for applications in biology and medicine",
        "surface layers of polymers strengthening and changes in the morphology. Works in this direction is executing on TIPR-1 accelerator in ITEP. Bunches of titanium and vanadium which are generated in MEVVA and nitrogen beams are generated in duoplasmatron was mastered acceleration to provide of experimental work. Several series of experiments on the modification of the surface of samples for further study by atomic probe tomography and transmission electron microscopy executed. Nanostructure of the surface layers of oxide dispersion strengthened steels exposed to ion beams showed makeover."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb48_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb48.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb48_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB48",
      "page_number": "269",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPSB49",
      "title": "Method of Measuring Fast Neutron Fluence Using the Planar Silicon Detectors",
      "authors": [
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The technique reported of fast neutron fluence measurements using silicon detectors. One of the main macroscopic effects at radiation damage of silicon detectors by fast neutrons is increase of the reverse current. The increment of the reverse current detector is a linear dependence on fast neutron fluence and is determined by the formula: DI=aIxFxV",
        "where: DI=(I1-I0)",
        "(А) – the measured increment of the reverse dark current after irradiation of the detector normalized to temperature of +20 C",
        "aI=(5±0.5)'10-17",
        "(А/сm) – current constant radiation damage of silicon for neutrons with energy 1 MeV",
        "F",
        "(сm-2) - equivalent fluence of fast neutrons with energy 1 MeV",
        "V=d'S",
        "(сm3) – the volume of the detector at the full depletion voltage. The experimental results of measurements of fast neutron fluence with silicon detectors are obtained on the pulsed fast neutrons reactor (IBR-2",
        "channel #3) and on the experimental facility KVINTA JINR",
        "Dubna."
      ],
      "institutions": [
        "Funding: Joint Institute for Nuclear Research, Dubna"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/wepsb49_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/wepsb49.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/wepsb49_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-WEPSB49",
      "page_number": "272",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 48,
  "scrape_time": "2025-10-11 02:51:56"
}