{
  "session_info": {
    "id": "TUYA",
    "name": "TUYA - Invited Oral Presentation, Circular and Linear Colliders",
    "url": "https://proceedings.jacow.org/IPAC2014/html/tuya.htm"
  },
  "papers": [
    {
      "paper_id": "TUYA01",
      "title": "First Experience with Electron Lenses for Beam-beam Compensation in RHIC",
      "authors": [
        "W. Fischer",
        "Z. Altinbas",
        "D. Bruno",
        "M.R. Costanzo",
        "X. Gu",
        "J. Hock",
        "A.K. Jain",
        "Y. Luo",
        "C. Mi",
        "R.J. Michnoff",
        "T.A. Miller",
        "A.I. Pikin",
        "T. Samms",
        "Y. Tan",
        "R. Than",
        "P. Thieberger",
        "S.M. White",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "The head-on beam-beam interaction is the dominant luminosity limiting effect in polarized proton operation in RHIC. To mitigate this effect two electron lenses were installed in the two RHIC rings. We summarize the hardware and electron beam commissioning results to date",
        "and report on the first experience with the electron-hadron beam interaction. In 2014 RHIC is operating with gold beams only. In this case the luminosity is not limited by head-on beam-beam interactions and compensation is not necessary. The goals of this year’s commissioning efforts are a test of all instrumentation; the demonstration of electron and gold beam overlap; the demonstration of electron beam parameters that are sufficiently stable to have no negative impact on the gold beam lifetime; and the measurement of the tune footprint compression from the beam overlap. With these demonstrations",
        "and a lattice with a phase advance that has a multiple of 180 degrees between the beam-beam interaction and electron lens locations",
        "head-on beam-beam compensation can be commissioned in the following year with proton beams."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2014/talks/tuya01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2014/papers/tuya01.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2014/posters/tuya01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2014-TUYA01",
      "page_number": "913",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 20:40:15"
}