{
  "session_info": {
    "id": "THIXGD",
    "name": "THIXGD - Invited Orals: Hadron Accelerators",
    "url": "https://proceedings.jacow.org/ipac2022/html/thixgd.htm"
  },
  "papers": [
    {
      "paper_id": "THIXGD1",
      "title": "High Intensity Beam Accelerator Facilities HIAF and CIADS: Status and Demonstrations of Key Technologies",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People’s Republic of China",
        "The two high-intensity ion beam accelerator facilities HIAF (High Intensity heavy ion Accelerator Facility) and CIADS (China Initiative Accelerator Driven System) are being built by IMP in China. The talk will review construction status of HIAF and CIADS firstly. The talk will focus on the recent demonstrations of some key technologies related to HIAF and CIADS. The emphasis will be put on 3 technology demonstrations. 1. Development of the world first 45 GHz ECR ion source based on Nb3Sn magnet. 2. Performance demonstrations for a key component assembly of the HIAF synchrotron with a dipole magnet",
        "a 38000 A/s fast ramping high-power (5.1 kA/3.6 kV) power supply",
        "a new type vacuum chamber with 0.3 mm thickness wall and 2 mm ceramic ring. 3. Beam commissioning at CW 10 mA/200 kW and reliability & availability demonstration achieved at CW 120 kW/7.2 mA proton beam for more than 100 hours continuous operation by a superconducting proton linac demo-machine composed of a RFQ and 4 cryomodules containing 23 half wave resonance cavities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/thixgd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/thixgd1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/thixgd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-THIXGD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:42:19"
}