{
  "session_info": {
    "id": "WEYAT01",
    "name": "WEYAT01 - WG4: Beam-beam & Instabilities",
    "url": "https://proceedings.jacow.org/eefact2022/html/weyat01.htm"
  },
  "papers": [
    {
      "paper_id": "WEYAT0101",
      "title": "Collective Effects Studies for CEPC",
      "authors": [
        "N. Wang",
        "C.T. Lin",
        "Y.D. Liu",
        "S.K. Tian",
        "H.S. Xu",
        "Y. Zhang",
        "IHEP",
        "Beijing",
        "People’s Republic of China",
        "The impedance model of the CEPC storage ring is updated according to the development of the vacuum components based on the circular beam pipe. With the impedance model",
        "the single bunch and coupled bunch instabilities for different operation scenarios are investigated. Particularly",
        "the key instability issues driven by the beam coupling impedance in the Z operation mode are discussed. The influence of the longitudinal impedance on the transverse mode coupling instability is analyzed both numerically and analytically. In addition",
        "trapped ions can induce bunch centroid oscillation and emittance growth. The possibility of ion trapping and fast beam ion instability in the CEPC storage ring are also investigated."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/weyat0101_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/weyat0101.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/weyat0101_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-WEYAT0101",
      "page_number": "141",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYAT0102",
      "title": "Mitigation of Electron Cloud Effect in the SuperKEKB Positron Ring",
      "authors": [
        "Y. Suetsugu",
        "H. Fukuma",
        "H. Hisamatsu",
        "H. Ikeda",
        "T. Ishibashi",
        "K. Kanazawa",
        "K. Ohmi",
        "K. Shibata",
        "M. Shirai",
        "S. Terui",
        "M. Tobiyama",
        "KEK",
        "Ibaraki",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "One critical issue for the SuperKEKB is the electron cloud effect (ECE) in the positron ring",
        "and various countermeasures had been prepared before starting the commissioning. The ECE",
        "however",
        "was observed during phase-1 commissioning (2016) caused by the electron cloud in the beam pipes at drift spaces of the ring",
        "which had antechambers and a TiN-film coating. Permanent magnets and solenoids to generate magnetic fields in the beam direction were attached to the beam pipes as additional countermeasures before the next phase-2 commissioning (2018). Consequently",
        "the threshold of the current linear density for exciting the ECE increased by a factor of at least 2. During Phase-3 commissioning (2019)",
        "it was confirmed that the threshold was over 0.53 mA/bunch/RF bucket",
        "and we have observed no clear evidence of ECE in the usual operation up to now. The effectiveness of the ante-chambers and TiN film coating of the real beam pipe was reevaluated. The present ante-chambers were found to be less effective than expected with regard to reducing the number of photoelectrons in the beam channel. Here we will summarize the mitigation techniques used in the SuperKEKB and the results so far."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/weyat0102_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/weyat0102.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/weyat0102_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-WEYAT0102",
      "page_number": "146",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYAT0103",
      "title": "Studies and Possible Mitigation of Electron Cloud Effects in FCC-ee",
      "authors": [
        "IZTECH",
        "Izmir",
        "Turkey",
        "CERN",
        "Meyrin",
        "Switzerland",
        "In this work",
        "we present numerical results for the electron cloud build-up and mitigation studies considering Arc Dipole and Drift sections of the FCC-ee collider. We report the central electron density that could be reached by minimising secondary electron contributions and the photoelectron generation rates in order to achieve e- densities lower than the single-bunch instability threshold",
        "considering the baseline beam parameters. Additionally",
        "simulation results revealing the behavior of electron-cloud formations for various SEY values",
        "photoemission rates",
        "vacuum chamber radii",
        "and bunch spacings are included. In the last section",
        "we discuss initial investigations to clean residual electrons after the beam pass."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/weyat0103_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/weyat0103.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/weyat0103_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-WEYAT0103",
      "page_number": "154",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEYAT0104",
      "title": "Collective Effects Studies in FCC-ee",
      "authors": [
        "CERN",
        "Meyrin",
        "Switzerland",
        "M. Behtouei",
        "B. Spataro",
        "M. Zobov",
        "LNF-INFN",
        "Frascati",
        "Italy",
        "INFN-Roma1",
        "Rome",
        "Italy",
        "The high luminosity foreseen in the future electron-positron circular collider (FCC-ee) necessitates very intense multi-bunch colliding beams with very small transverse beam sizes at the collision points. This requires emittances comparable to those of the modern synchrotron light sources. At the same time",
        "the stored beam currents should be close to the best values achieved in the last generation of particle factories. This combination of opposite factors represents a big challenge in order to preserve a high beam quality avoiding",
        "at the same time",
        "a machine performance degradation. As a consequence",
        "a careful study of the collective effects and some solutions for the mitigation of foreseen instabilities is required. In this contribution we discuss the current status of these studies."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/eefact2022/talks/weyat0104_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/eefact2022/papers/weyat0104.pdf",
      "poster_url": "https://proceedings.jacow.org/eefact2022/posters/weyat0104_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-EEFACT2022-WEYAT0104",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-11 08:35:10"
}