{
  "session_info": {
    "id": "THCA",
    "name": "THCA - Status Report of Control System",
    "url": "https://proceedings.jacow.org/pcapac2012/html/thca.htm"
  },
  "papers": [
    {
      "paper_id": "THCA04",
      "title": "An Update on ConSys Including a New LabVIEW FPGA Based LLRF System",
      "authors": [
        "T. Worm",
        "J.S. Nielsen",
        "ISA",
        "Aarhus",
        "Denmark",
        "ConSys",
        "the Windows based control system for ASTRID and"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/thca04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/thca04.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/thca04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-THCA04",
      "page_number": "97",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCA05",
      "title": "PLC-based Control System for 10 MeV Linear Accelerator at EBC Kharghar, BARC",
      "authors": [
        "A.S. Chachondia",
        "B.B. Biswas",
        "D.P. Chakravarthy",
        "G. Ganesh",
        "L.M. Gantayet",
        "K.C. Mittal",
        "M.K. Mukesh Kumar",
        "M.B. Patil",
        "R.K. Patil",
        "BARC",
        "Mumbai",
        "India",
        "Currently the 10MeV Linac is being used for different research applications and industrial use. The control system in operation was developed using CAMAC based DAS",
        "backed by Hard-wired Interlock System. It is proposed to replace the CAMAC system with a state-of-the-art indigenously developed PLC that is verified to the level of a Class IB computer-based system used in nuclear power plants. A PLC node comprises of two VME bus based CPU boards (PowerPC MPC7447",
        "600MHz) working in redundant mode. The Inputs and Outputs are common to both CPUs. The intelligent I/O boards are hot swappable. The PLC hardware and software has undergone rigorous verification and validation. A user-friendly development environment is provided to the process engineer for building the application using pre-defined function blocks. The LCS developed using PLC is to be used for operating the Linac irradiation facility",
        "remotely as well as locally in a fail-safe mode",
        "with sequential start-up and sequential shut-down. Apart from system status monitoring",
        "data archiving",
        "alarm generation and setpoint adjustments",
        "it shall monitor the important parameters and trip the GM HV",
        "KM HV and EG PS on fault conditions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/thca05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/thca05.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/thca05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-THCA05",
      "page_number": "100",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THCA06",
      "title": "Status of the Ultra Fast Tomography Experiments Control at ANKA",
      "authors": [
        "D. Haas",
        "A. Cecilia",
        "A. Kopmann",
        "W. Mexner",
        "H. Pasic",
        "T. Spangenberg",
        "P. Vagovic",
        "M. Vogelgesang",
        "KIT",
        "Eggenstein-Leopoldshafen",
        "Germany",
        "B.M. Balzer",
        "S. Cilingaryan",
        "Karlsruhe Institute of Technology",
        "Eggenstein-Leopoldshafen",
        "Germany",
        "X-ray imaging permits spatially resolved visualization of the 2D and 3D structure in materials and organisms which is crucial for the understanding of their properties. Additional resolution in the time domain gives insight in the temporal structure evolution and thus access to dynamics of processes allowing to understand functionality of devices and organisms and to optimize technological processes. Such time resolved dynamic analyses ofμsize structures became now possible by the new ultrafast tomography at the TopoTomo beamline of the synchrotron light source ANKA. At TopoTomo the whole experimental workflow has been significant improved in order to decrease the total duration time of a tomography experiment in a range of minutes. To aim the goal of a Tango based control system for ultra fast tomography with a data throughput of several 100 MB/s",
        "detectors and computing infrastructure have been optimized. Multi GPU based computing allows a high speed data processing by using a special reconstruction scheme. Furthermore data management infrastructure will allow a life cycle management of data sets accumulating to several TByte/day."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/thca06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/thca06.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/thca06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-THCA06",
      "page_number": "103",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-11 02:09:14"
}