{
  "session_info": {
    "id": "TUPH",
    "name": "TUPH - Poster Session 2",
    "url": "https://proceedings.jacow.org/sap2017/html/tuph.htm"
  },
  "papers": [
    {
      "paper_id": "TUPH01",
      "title": "Sigma Beam Signals for the Electro-gravitational Induction based on the Beam Instability in Charged Particle Storage Rings",
      "authors": [
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Changes in beam position within charged particle accelerator storage rings have been observed due to changes in gravity caused by the moon and sun. The terrestrial tidal model has been used to explain this type of beam instability. Further analysis reveals that these instabilities arise from changes in the electron beam energy",
        "that may not only come from movements of the accelerator components due to terrestrial tidal forces",
        "and may caused by the unsighted process. We try to induce an electromotive force along the ring",
        "referred to as electro-gravitational induction (EGI). The circular motion of the charged particles causes the accumulation of the EGI in the storage ring",
        "turn by turn. We used existing data from storage ring beam signals to estimate the maximum value of the gravity coefficient of the induced electromotive force."
      ],
      "institutions": [
        "Funding: The project was supported by the National Natural Science Foundation of China under Grant No. 11575215, partly."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SAP2017-",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph01.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH01",
      "page_number": "141",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPH02",
      "title": "The Emittance Measurement of Proton Beam in a Compact Laser Plasma Accelerator",
      "authors": [
        "A.L. Zhang",
        "Q. Liao",
        "C. Lin",
        "Wu",
        "M.J. Wu",
        "X. Xu",
        "X.Q. Yan",
        "J.G. Zhu",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "A Compact Laser Plasma Accelerator (CLAPA) had been built at Institute of Heavy Ion physics of Peking University for application research of laser plasma accelerator. And multi-MeV proton beams produced by irradiating thin plastic foils with ultra-intense lasers has been measured. In order to qualify the proton beam",
        "a pepper-pot emittance method was used to measure the transverse emittance. The pepper-pot was made of molybdenum and the picture was captured by RCF (Radio- Chromic Film). The measurement result shows that the emittance of the proton beam produced by CLAPA is much smaller than 0.1·π·mm·mrad.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph02.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH03",
      "title": "Temporal Diagnostics of the Ultrashort Electron Bunch Generated in Plasma-based Accelerators",
      "authors": [
        "Tsinghua University",
        "Beijing",
        "People's Republic of China",
        "J.F. Hua",
        "W. Lu",
        "C.H. Pai",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "Plasma-based accelerators have the potential to generate few-femtosecond ultrashort electron bunches",
        "which enable the study of ultrafast dynamics and the realization of high peak current beams. The duration of the electron bunch is usually investigated based on coherent transition radiation in a laser wakefield accelerator. In order to diagnostic the longitudinal profile",
        "however",
        "the reconstruction from the spectrum measured from the mid-infrared spectrometer is required for random temporal distribution of ultrashort electron bunch. We discuss the ambiguities in phase retrieval problems and introduce the concept of compressed sensing and a sparsity based weighted greedy sparse retrieval(GESPAR) algorithm for bunch profile reconstruction. The GESPAR algorithm is demonstrated to have the better performance than the traditional phase retrieval algorithms such as Kramer Kronig reconstruction and Gerchberg-Saxton algorithm with truncated noisy spectrum. This new method has been developed to measure the downramp injected electron bunch in our laser wakefield experiment",
        "which is applicable for the temporal characterization of ultrashort electron beam with complex structures.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph03.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH04",
      "title": "Simulations of High Transformer Ratio High Brightness Plasma Wakefield Acceleration for Accelerator Parameters of SXFEL Facility at SINAP",
      "authors": [
        "S. Huang",
        "J.F. Hua",
        "F. Li",
        "W. Lu",
        "C.H. Pai",
        "Y. Wan",
        "Y.P. Wu",
        "S.Y. Zhou",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "W. An",
        "C. Joshi",
        "W.B. Mori",
        "X.L. Xu",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "H.X. Deng",
        "B. Liu",
        "Z. Wang",
        "Z.T. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "High transformer ratio (HTR) Plasma Wakefield Accelerator (PWFA) based on shaped electron bunches is an important topic of plasma wakefield acceleration for future light sources and colliders [1]. To explore the possibility of implementing PWFA at SXFEL",
        "we performed 3D PIC simulations using shaped electron beam parameters obtained by start-to-end beam line simulations [2]. The PIC simulations show that an average transformer ratio around 4 can be maintained for about 10 cm long low density plasma",
        "and the energy gain of the trailing bunch eventually reaches 5.9 GeV. In addition",
        "plasma density downramp injection has also been tested as a possible high brightness injection method for HTR acceleration",
        "and preliminary results will be presented. Simulations and analysis are also performed to check the effects of transverse beam size on HTR high brightness acceleration.",
        "[1] W. Lu",
        "W. An",
        "C. Huang et al.",
        "\"High Transformer ratio PWFA for Applications on XFELs\"",
        "Bulletin of the American Physical Society",
        "2009",
        "54.  [2] Z. Wang",
        "Z. T. Zhao et al.",
        "private communication.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph04.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH04",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH05",
      "title": "Experimental Observation of External Injection Acceleration by a Laser Produced Wake using a RF Photogun Based Linac",
      "authors": [
        "Y.P. Wu",
        "Z. Cheng",
        "Y. C. Du",
        "J.F. Hua",
        "W. Lu",
        "C.H. Pai",
        "J. Zhang",
        "S.Y. Zhou",
        "Z. Zhou",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "External injection of beams into plasma accelerators and acceleration with minimal degradation of their quality provide a promising route to make plasma acceleration a realistic technology for applications. In the past two years",
        "we have carried out a lot of preparatory work for the external injection acceleration experiment in Tsinghua University. An ultrafast TW Ti:sapphire laser system is synchronized with a 45 MeV RF photogun based linac with a sub-200fs (RMS) time jitter between the laser pulse and the electron bunch. Here we present the first-time observation of external injection acceleration by a laser produced linear wake. Stable 32-MeV",
        "1~2-pC electron beams from the linac were compressed by a Chicane",
        "focused to a 200-um radius (RMS) and then injected into the linear wakefield excited by the 10TW",
        "30fs laser. The preliminary experimental results show that up to 20% electrons can be accelerated and the maximum energy gain reaches 0.35 MeV in a 6-mm long plasma by optimizing the plasma density and the laser focal plane position with respect to the plasma",
        "corresponding to an average gradient of about 60 MV/m",
        "which are in reasonable agreement with 3D PIC simulations.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph05.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH05",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH06",
      "title": "Experimental Demonstration of Energy-chirp Reduction by a Plasma Dechirper",
      "authors": [
        "Y.P. Wu",
        "Z. Cheng",
        "Y. C. Du",
        "J.F. Hua",
        "W. Lu",
        "C.H. Pai",
        "J. Zhang",
        "S.Y. Zhou",
        "Z. Zhou",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "The first experimental study is presented using a low density plasma dechirper to reduce a correlated energy chirp from the 41.5-MeV",
        "300-fs (RMS) beam at the linac in Tsinghua University. The plasma dechirper operates through the interaction of the electron bunch with its near linear self-wake to dechirp itself",
        "leading to a reduction in energy spread. The experimental results demonstrate that the projected FWHM energy spread of the beam can be reduced from 1.2% to 0.9% with a 12 mm long plasma dechirper",
        "which are in good agreement with full three-dimensional particle-in-cell (PIC) simulations. Theoretical analyses and simulations indicate that by optimizing the plasma density and length",
        "the plasma dechirper can also be used to completely remove the characteristic energy chirp of the ultra-short high-current bunch generated from plasma based accelerator",
        "such that its energy spread can be reduced from one percent level to 0.1 percent level [1]. Application of such a simple and effective method can significantly improve the beam quality and provide the path to realize the future compact free electron lasers and colliders driven by plasma based accelerators.",
        "[1] Y. P. Wu",
        "X. L. Xu",
        "et al.",
        "\"A plasma dechirper for electron and positron beams in plasma-based accelerators\"",
        "to be submitted to Scientific Reports",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph06.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH06",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH07",
      "title": "Damping of Hosing Instability for Plasma-wakefield Acceleration in Uniform Plasma",
      "authors": [
        "S.Y. Zhou",
        "J.F. Hua",
        "S. Huang",
        "F. Li",
        "W. Lu",
        "C.H. Pai",
        "Y.P. Wu",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "Current models predict the hosing instability to crucially limit the applicability of plasma-wakefield accelerators",
        "especially for long driver cases. However",
        "present analytical model is only suitable when beam size and hosing amplitude is much less than plasma blow-out radius. By developing a physically simple model which incorporates the single particle betatron motion and particle loss due to large betatron amplitude",
        "this work demonstrates that the asymmetric particle loss due to the phase mismatch between beam hose and plasma respondency can damp hosing amplitude in magnitudes with negligible beam loss. We find excellent agreement between our model and 3D particle-in-cell simulations. Besides",
        "for wide driver",
        "we achieve stable propagation when transformer ration is about 5",
        "which is almost impossible based on the previous understanding.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph07.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH07",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH08",
      "title": "A Proposal of using Improved Rhodotron as a High Dose Rate Micro-focused X-ray Source",
      "authors": [
        "X. He",
        "S.Q. Liao",
        "J. Long",
        "J. Shi",
        "W. Wang",
        "L. Yangpresenter",
        "CAEP/IFP",
        "Mainyang",
        "Sichuan",
        "People's Republic of China",
        "High energy X-ray computer tomography has wide application in industry",
        "especially in quality control of complicated high-tech equipment. In many applications",
        "higher spatial resolution is needed to discover smaller defects. Rhodotron have been used to produce high power CW electron beam in hundreds of kilowatts level. In this paper",
        "we propose to use an improved Rhodotron to generate high brightness electron beam with high average power. Beam dynamics study shows that when producing tens of kilowatts electron beam",
        "the normalized RMS emittance can be lower than 10 μm",
        "and the relative RMS energy spread can be lower than 0.2%. The beam can be focused to a spot size of about 100μm",
        "and converted to X-Ray by using a rotating target within several kilowatts beam power. Improved Rhodotron proposed in this paper is a good candidate of X-ray source for high resolution high energy industrial CT systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SAP2017-",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph08.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH08",
      "page_number": "143",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPH09",
      "title": "Spontaneous Radiation of High-order Magnetic Field Undulator",
      "authors": [
        "CAEP/IFP",
        "Mainyang",
        "Sichuan",
        "People's Republic of China",
        "CAEP/IAE",
        "Mianyang",
        "Sichuan",
        "People's Republic of China",
        "Y. Li",
        "J. Pflüger",
        "XFEL. EU",
        "Hamburg",
        "Germany",
        "Based on the purpose of concision",
        "nearly all the undulator radiation formulas have maken an assumption that the guiding magnetic field is a sinusoid wave. The assumption is consistent with the truth if the ratio of undulator gap to period length is large enough. However",
        "high-order magnetic field exists widely in most undulators",
        "especially those with long period length and short gap. This paper will derive the radiation output equations of high-order magnetic field undulator",
        "what's more",
        "the formulas are validated through numerical simulation with code SPECTRA."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SAP2017-",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph09.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH09",
      "page_number": "146",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPH10",
      "title": "Electron Cooling of Bunched Ion Beam in Storage Ring",
      "authors": [
        "L.J. Mao",
        "J. Li",
        "X.M. Ma",
        "M.T. Tang",
        "J.C. Yang",
        "X.D. Yang",
        "H. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "A combination of electron cooling and RF system is an effective method to compress the beam bunch length in storage rings. A simulation code based on multi-particle tracking was developed to calculate the bunched ion beam cooling process",
        "in which the electron cooling",
        "Intra-Beam Scattering (IBS)",
        "ion beam space charge field",
        "transverse and synchrotron motion are considered. Meanwhile",
        "bunched ion beam cooling experiments have been carried out in the main cooling storage ring (CSRm) of the Heavy Ion Research Facility in Lanzhou (HIRFL)",
        "to investigate the minimum bunch length obtained by the cooling method",
        "and study the dependence of the minimum bunch length on beam and machine parameters. It is observed that the IBS effect is dominant for low intensity beams",
        "and the space charge effect is much more important for high intensity beams. The experimental results in CSRm shown a good agreement with the analytical model in the IBS dominated regime. The simulation work offers us comparable results to those from the analytical model both in IBS dominated and space charge dominated regimes."
      ],
      "institutions": [
        "Funding: This work is supported by the National Natural Science Foundation of China (Project No.11575264, No.11375245 and No.11475235) and the Hundred Talents Project of the Chinese Academy of Sciences."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SAP2017-",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph10.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH10",
      "page_number": "150",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPH11",
      "title": "Resonance Stop-bands Compensation for the Booster Ring at HIAF",
      "authors": [
        "J. Li",
        "J.C. Yangpresenter",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "The Booster Ring (BRing) of the new approved High Intensity heavy-ion Accelerator Facility (HIAF) in China is designed to stack 1.0*1011 number of 238U35+ ions at the injection energy of 17MeV/u and deliver over such intensity beam to SRing (Spectrometer Ring) at 800MeV/u. However such intensity beam causes low-order resonances crossing during RF bunching. To keep a low beam loss",
        "resonance stop-band compensation scheme is proposed covering the process from RF capture to the first stage of acceleration below 200MeV/u."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SAP2017-",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph11.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH11",
      "page_number": "153",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPH13",
      "title": "Stochastic Cooling Plan and Experiments for HIAF and CSRe",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "In December 2015 stochastic cooling of heavy ions was successfully applied for the first time at the CSRe storage ring of IMP in Lanzhou",
        "China. During four days of commissioning",
        "three-dimensional cooling could be observed. Both the time-of-flight and the notch filter methods were used for longitudinal cooling. The measured cooling rates are presented. In the end of December 2015",
        "the project HIAF High Intensity heavy ion Accelerator Facility was approved by the Chinese government. The project consists of ion-Linac (iLinac)",
        "a Booster Ring (Bring)",
        "a radioactive beam line of fragmentation type",
        "a spectrometer ring (SRing)",
        "and several experimental terminals at low and high energy ends as well as setups for in-ring experiments. Stochastic cooling will be built at SRing mainly for the experiments with radioactive fragment beams. The primary design and the simulation results will be presented in the conference.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph13.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH13",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH14",
      "title": "Calculation of the Gun and Collector for Electron Cooler of HIAF",
      "authors": [
        "M.T. Tang",
        "J. Li",
        "L.J. Mao",
        "X.D. Yang",
        "H. Zhao",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "The results of the gun and collector simulation for the coolers in BRing and SRing of new project High Intensity Heavy-ion Accelerator Facility HIAF (China) are presented. The electron beam current of the gun is up to 2A and distribution of the electron beam is adjustable. The highest electron beam energy is 50keV for cooler in Bring and 200keV for cooler in Sring. The results of the adiabatic expansion process and acceleration process of the electron beam are also presented. To control the electron beam transverse temperature increase in the end of the accelerate tube the special coil is used. After optimization the beam transverse temperature is lower than 0.1eV."
      ],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph14.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH14",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH15",
      "title": "Investigation of Ion-ion Merging based on a Figure 8 Ring",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Ion-ion merging is approved as an effective approach to verify the vacuum decay phenomenon inferred by quantum electrodynamics. To perform a collision with small CM energy",
        "a new merging scheme is proposed in this poster. The main idea is a coasting beam stored in a figure 8 synchrotron collides with itself at a small angle. The advantage is simplifications of beam injection",
        "cooling system and beam stacking. A luminosity of 7·1023 cm-2s−1 is achieved.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph15.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH15",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH16",
      "title": "The Experimental Setup of Desorption Measurement at CSRm and the Test Result",
      "authors": [
        "W.H. Zheng",
        "M. Li",
        "P. Li",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "The desorption processes caused by beam loss due to charge exchange interactions with residual gas has become an essential intensity limitation for high intensity heavy-ion accelerators. The collimation system made of low out-gassing rate material is designed to control the ion-beam loss induced desorption to enhance the beam intensity worldwide. Therefore the study and dedicated measurements of desorption rate became the key technology of the collimation system design in high intensity heavy-ion accelerators. The ion-beam loss induced desorption processes and their infestation were introduced in this paper firstly. Then the significance on desorption measurement was explained and the experimental setup of desorption measurement at CSRm was focused on. Furthermore",
        "the desorption rate of copper coated with gold bombarded by tin beam was computed. The desorption measurements in subsequent steps at CSRm were given and the acquired data along with theoretical supports to the research on the collimation system in heavy-ion accelerators in future were also illustrated at the end of this paper.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph16.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH16",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH17",
      "title": "CSNS Application Programming Infrastructure and Physics Applications",
      "authors": [
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The China Spallation Neutron Source (CSNS) is using XAL for application program development. XAL",
        "initially developed for SNS",
        "is a collection of tools written in pure Java and provides users with a hierarchal view of the accelerator. CSNS makes a lot of changes based on the old XAL. The fringe field is added to online model for accurate calculation of RCS/CSNS and some new database and applications are developed for beam commissioning. The modified XAL framework and example applications will be discussed in this paper.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph17.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH17",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH18",
      "title": "Internal PIG Source Design for a Superconducting Cyclotron in the HUST Proton Therapy Facility",
      "authors": [
        "Z.Y. Mei",
        "K. Fan",
        "L.X.F. Li",
        "Z.J. Zeng",
        "L.G. Zhang",
        "HUST",
        "Wuhan",
        "People's Republic of China",
        "A 250 MeV isochronous superconducting cyclotron was adopted in the HUST proton therapy facility. For meeting the essential requirement of providing initial proton beam",
        "a cold-cathode PIG internal ion source with constant arc current has been designed carefully. The internal ion source is made up of two halves anode cathode pairs and a slim chimney with diameter of 7 mm for the sake of the very compact structure in the central region. Since the great influence on the initial proton beam quality",
        "the structure of the chimney's slit has been optimized iteratively with the simulation code COMSOL. Besides",
        "to study and optimize the ion source practically",
        "an internal PIG source experimental test bench has been designed meticulously. By changing the main parameters and the relevant structures of the ion source in the test bench",
        "an optimum internal PIG source configuration with high stability proton beam has been obtained experimentally. This paper presents the design of the internal PIG source and the experimental test bench.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph18.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH18",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH19",
      "title": "Simulation of Imaging Ability of 11MeV Energy-loss Proton Radiography",
      "authors": [
        "CAEP/IFP",
        "Mianyang",
        "People's Republic of China",
        "Lens focused proton radiography (PRAD)",
        "is a powerful radiography technique in nondestructive testing (NDT) and hydrotest experiment",
        "and the magnetic imaging lens is the key technique that achieve high spatial resolution. Zumbro imaging lens",
        "as a common magnetic lens technique in PRAD",
        "can mostly eliminate the position blur caused by multiple Coulomb scattering (MCS)",
        "but cannot optimize the chromatic blur caused by energy loss. To eliminate the influence of energy loss",
        "a new type of magnetic lens be proposed",
        "called energy-loss magnetic imaging lens. Energy-loss lens can limit the range of energy of penetrating protons to get contrast at the image plane. In this paper",
        "we will build the numerical model of energy-loss PRAD by using"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph19.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH19",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH20",
      "title": "Design of 11MeV Low-energy Proton Radiography with Energy Collimation",
      "authors": [
        "CAEP/IFP",
        "Mainyang",
        "Sichuan",
        "People's Republic of China",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [
        "Funding: Supported by National Natural Science Foundation of China (Nos. 11405162, and 11475157) and CAEP President Foundation Grants (No. 201402086)"
      ],
      "abstract": "The method of proton radiography (pRad) with energy collimation is introduced. The design of imaging lens with energy Fourier plane (EFP) is dicussed in detail and the design conditions for this particular lens are deduced. The imaging beamline for 11MeV pRad validating experiment is also proposed. reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph20.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH20",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH21",
      "title": "Magnetic Measurement of the Undulator U38 for THz-FEL",
      "authors": [
        "L.G. Yan",
        "D.R. Deng",
        "M. Li",
        "P. Li",
        "J. Wang",
        "X. Yang",
        "H. Zhang",
        "CAEP/IAE",
        "Mianyang",
        "Sichuan",
        "People's Republic of China",
        "The high average power terahertz free electronic laser facility (THz-FEL) has one undulator named U38. As one of the most important components",
        "U38 has a significant effect on entire facility. So",
        "we measure the magnetic field of U38 to confirm its field qualities using magnetic field measurement bench before installation. The measurement gaps include 19 mm",
        "21 mm",
        "24 mm",
        "25.6 mm and 28 mm",
        "and the longitudinal distribution of magnetic field on five lines at transverse positions of -6 mm",
        "-3 mm",
        "0 mm",
        "3 mm and 6 mm are scanned. Electronic trajectory",
        "peak field vs gap curve and peak-to-peak error are calculated based on the longitudinal distribution of magnetic field. We also measure the transverse distribution of magnetic field to test the good field region. In this proceeding",
        "the measurement method is described and the results are presented and discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SAP2017-",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph21.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH21",
      "page_number": "156",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPH22",
      "title": "A Method Implementing Chopper Monitor System in EPICS",
      "authors": [
        "K. Gu",
        "P.P. Wang",
        "W. Wei",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "Chopper is important device in HIRFL and monitoring chopper output and control signal has great significance. In this paper a method implementing chopper monitor system is given. Data acquisition is based on PCI6712 and software is developed in EPICS. System works in trigger mode. The result shows that the monitor system can work in real time and user can Identify problems easily. reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph22.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH22",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH23",
      "title": "Beam Loss Simulation and Gas Desorption Measurement for HIAF",
      "authors": [
        "P. Li",
        "J.J. Chang",
        "M. Li",
        "W.L. Li",
        "X.J. Liu",
        "C.L. Luo",
        "R.S. Mao",
        "J. Meng",
        "W.J. Xie",
        "J.C. Yang",
        "Y.J. Yuan",
        "W.H. Zheng",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Large dynamic vacuum pressure rises of orders of magnitude which caused by the lost heavy ions can seriously limit the ion intensity and beam lifetime of the intermediate charge state heavy ion accelerator. The High Intensity heavy ion Accelerator Facility (HIAF) which will be built by the IMP will accumulate the intermediate charge state ion 238U35+ to intensity 3×1010 ppp to different terminals for nuclear physics",
        "nuclear astrophysics and so on. In order to control the dynamic vacuum effects induced by the lose beams and design the collimation system for the BRing of the HIAF",
        "a newly developed dynamic vacuum simulation program is conducted to optimize the collimation efficiency. Furthermore",
        "two dedicated desorption measurement setups have been established at the terminal of the CSRm and 320 kV HV platform to study the molecular desorption process and do the benchmarking of the simulation code. This presentation will describe the collimation efficiency optimization",
        "measurement results with Sn beam at the CSRm and withthe Xe beam in the HV platform."
      ],
      "institutions": [
        "Funding: National Natural Science Foundation of China (11675235). Youth Innovation Promotion Association of Chinese Academy of Sciences 2016364"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SAP2017-",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph23.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH23",
      "page_number": "159",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPH24",
      "title": "BNCT Neutron Source Design based on Small Cyclotron",
      "authors": [
        "F. Wang",
        "S. An",
        "X.L. Jia",
        "L. Wang",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "The key to BNCT is the production of high flux and good angular distribution of thermal neutrons and super-thermal neutrons. The neutron source produced by small cyclotron in the environment of hospital installation is safe",
        "flexible and operable. Design the flux of different neutron components according to the requirements for treatment. Super-thermal neutron flux is requires 10e+8 n cm-2 s-1. This paper design a set of neutron production and neutron shaping equipment according to the requirement of neutron flux and dose limit. The obtained super-thermal neutron flux is 7.47e+8 n cm-2 mA-1",
        "which achieves the design target.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph24.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH24",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH25",
      "title": "A Beam Energy Spread Monitor using the Rutherford Scattering Technique",
      "authors": [
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "The beam energy and energy distribution are very important parameters in any accelerators. They are used to estimate the machine performance and evaluate the beam quality. Through the measurement of the beam energy and energy spread",
        "the longitudinal emittance can be calculated and the beam lattice can be verified",
        "also the transmission efficiency can be improved and optimization of the machine can be done",
        "the simulation can be verified as well. Therefore",
        "the accurate measurement of beam energy and energy distribution can be used as a guidance for the machine commissioning",
        "operation and optimization",
        "and to verify the simulation. Under the support of this project",
        "a detector",
        "using the Rutherford scattering technique",
        "was developed to measure the energy and energy spread in the range of 1-15 MeV/u. The energy resolution was achieved better than 0.5%. To improve the thermal stability of the detector for very high current beam",
        "the composite material (tantalum and copper) was used for the scattering target",
        "with the additional water-cooling system. As a result",
        "the detector can be used for very weak beams and very high current beams as well.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph25.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH25",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH26",
      "title": "Numerical Assessment of Beam Diagnostic Calorimeter for East Neutral Beam Injector",
      "authors": [
        "Y. Xu",
        "C.D. Hu",
        "L.Z. Liang",
        "Y.H. Xie",
        "Y.L. Xie",
        "Yu",
        "L. Yu",
        "ASIPP",
        "Hefei",
        "People's Republic of China",
        "Neutral beam injection is one of the most effective means of plasma heating and has been also verified to be applicable for current driving. In order to support the physical research of EAST",
        "two neutral beam injectors (NBI",
        "80 keV",
        "4 MW) have been developed and constructed in Institute of Plasma Physics",
        "CAS. In order to evaluate beam intensity distribution and divergence",
        "a moveable sophisticated copper short-pulse beam diagnostic calorimeter is designed and installed on the NBI test stand. In this article",
        "the structure of calorimeter",
        "the operating parameters are introduced. The new diagnostic calorimeter plate bombarded by the beam adopts blocking design and there is no heat transfer between adjacent block. Thermocouples are installed into the block",
        "so the temperature can be measured precisely. Based on the data obtained by thermocouples",
        "the beam pattern can be plotted. In order to ensure the diagnostic calorimeter work safely",
        "the operating parameters are explored using FEM. As the new beam diagnostic calorimeter solve the problem of mutual interference due to the heat transfer of each block",
        "it can give more precise beam property comparing with the present calorimeter."
      ],
      "institutions": [
        "Funding: This work has been supported by The National Natural Science Foundation of China (NNSFC) (Contract No. 11575240) and the Foundation of ASIPP (Contract No. DSJJ-15-GC03)."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SAP2017-",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph26.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH26",
      "page_number": "162",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPH27",
      "title": "Electromagnetic, Thermal, Structural Analysis for the RF-cavity of a Rhodotron Accelerator",
      "authors": [
        "L. Yang",
        "X. He",
        "H. Li",
        "CAEP/IFP",
        "Mianyang",
        "People's Republic of China",
        "A Rhodotron-based electron accelerator served as mi-cro-focused X-ray source at a high repetition rate of 10.75 MHz is proposed at IFP",
        "CAEP. The RF-cavity",
        "running in long pulse/ CW mode",
        "will deliver 9 MeV energy gain to the charged beam at the exit by taking its advantage of multiple accelerations with the same field at a frequency of 107.5MHz. A substantial amount of power loss will be dissipated on the RF surface of the cavity within beam time. Further electromagnetic (EM) optimization was performed on a standard coaxial model with slight modifications aiming to achieve a higher shunt impedance",
        "thus less power loss on surfaces. A proper water cooling design is still required to prevent large scale temperature rise on the cavity wall. The corresponding effects on cavity mechanical stability and resonant frequency shifting are concerned. This paper will present the details in the EM",
        "thermal",
        "structural analysis of the RF-cavity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-SAP2017-",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph27.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH27",
      "page_number": "165",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPH28",
      "title": "Medical Small Cyclotron Maze Design",
      "authors": [
        "L. Wang",
        "X.L. Jia",
        "F. Wang",
        "CIAE",
        "Beijing",
        "People's Republic of China",
        "Abstract: The 14MeV proton cyclotron",
        "which is used to produce radioactive isotopes such as 18FDG",
        "produces a large number of neutrons in the process. Appropriate shielding design is required. The accelerator's power is almost lost on the production target",
        "therefore",
        "special shielding design is required for the neutron source. In the hospital",
        "a maze design is usually used to block the neutron source. The dose distribution of the accelerator is obtained through the Monte Carlo simulation",
        "according to this",
        "a labyrinth wall is designed to meet dose-limiting conditions.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph28.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH28",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH29",
      "title": "On the Possible Application of Plasma Based Wakefield Acceleration for Future Light Sources and Colliders",
      "authors": [
        "TUB",
        "Beijing",
        "People's Republic of China",
        "In the past decade",
        "with the emerging and maturing of plasma based wakefield acceleration technology",
        "what possible roles it may play in the future development of next generation light sources and colliders become an interesting question of relevance. In this talk",
        "the current status of plasma based wakefield acceleration will be reviewed",
        "with a focus on obtaining beams with very high quality. A few scenarios of possible applications on future light sources and colliders will also be discussed in details.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph29.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH29",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPH30",
      "title": "Redundancy Analysis of Solid-state Ampliifers for CiADS Accelerator",
      "authors": [
        "P.H. Gao",
        "W.L. Chen",
        "W.P. Dou",
        "C. Feng",
        "Y. He",
        "H. Jia",
        "Y.Z. Jia",
        "P. Jiang",
        "S.H. Liu",
        "Y.S. Qin",
        "C. Wang",
        "W.S. Wang",
        "Z.J. Wang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China"
      ],
      "institutions": [],
      "abstract": "The solid-state amplifier(SSA) will be applied in China Initial Accelerator Driven System (CiADS) accelarator. 20KW SSA is the basis of RF power systems. With considering power loss redundancy of the main amplifier(MA) is analyzed by builting k/N reliability model for various redundancy. 26/30 redundancy is optimal for 20KW SSA in term of reliability. reference for this paper ※ https://doi.org/10.18429/JACoW-SAP2017-",
      "presentation_url": "https://proceedings.jacow.org/sap2017/talks/tuph30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/sap2017/papers/tuph30.pdf",
      "poster_url": "https://proceedings.jacow.org/sap2017/posters/tuph30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-SAP2017-TUPH30",
      "page_number": "169",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 29,
  "scrape_time": "2025-10-11 02:56:31"
}