{
  "session_info": {
    "id": "MOAC",
    "name": "MOAC - Contributed Orals (MC3)",
    "url": "https://proceedings.jacow.org/IPAC2015/html/moac.htm"
  },
  "papers": [
    {
      "paper_id": "MOAC1",
      "title": "Awake: the Proof-of-principle R&D Experiment at CERN",
      "authors": [
        "MPI",
        "Muenchen",
        "Germany",
        "M. Bernardini",
        "T. Bohl",
        "C. Bracco",
        "A.C. Butterworth",
        "S. Cipiccia",
        "H. Damerau",
        "S. Döbert",
        "V. Fedosseev",
        "E. Feldbaumer",
        "E. Gschwendtner",
        "W. Höfle",
        "A. Pardons",
        "A.V. Petrenko",
        "J.S. Schmidt",
        "M. Turner",
        "H. Vincke",
        "CERN",
        "Geneva",
        "Switzerland",
        "The Advanced Proton Driven Plasma Wakefield Acceleration Experiment (AWAKE) is a proof-of-principle R&D experiment at CERN. It is the world’s first proton driven plasma wakefield acceleration experiment",
        "using a high-energy proton bunch to drive a plasma wakefield for electron beam acceleration. The AWAKE experiment will be installed in the former CNGS facility and uses the 400 GeV proton beam bunches from the SPS",
        "which will be sent to a plasma source. An electron beam will be injected into the plasma cell to probe the accelerating wakefield. Challenging modifications in the area and new installations are required for AWAKE. First proton beam to the experiment is expected late 2016. The accelerating electron physics will start late 2017. This paper gives an overview of the project from a physics and engineering point of view",
        "it describes the main activities",
        "the milestones",
        "the organizational set-up for the project management and coordination."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/moac1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/moac1.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/moac1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOAC1",
      "page_number": "34",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOAC2",
      "title": "Laser-Plasma Acceleration in Hamburg",
      "authors": [
        "CFEL",
        "Hamburg",
        "Germany",
        "Plasma-based accelerators promise ultra-compact sources of highly relativistic electron beams",
        "especially suited for driving novel x-ray light sources. The stability and reproducability of laser-plasma generated beams is",
        "however",
        "still not comparable to conventional machines. Within the LAOLA Collaboration",
        "the University of Hamburg and DESY work closely together to combine university research with the expertise of a large and well-established accelerator facility. We will discuss the experimental programm and plasma-related activities in Hamburg",
        "with a special focus on the recently commissioned 200 TW laser ANGUS. It drives two beamlines",
        "REGAE and LUX",
        "to study external injection of electrons from a conventional gun into a plasma stage",
        "as well as plasma-driven undulator radiation. We present our progress in integrating the laser into the accelerator infrastructure at DESY",
        "progress towards stable laser operation",
        "as well as the commissioning of the LUX and REAGE beamlines. As an outlook",
        "we will discuss the experimental strategies in Hamburg towards a first proof-of-principle FEL experiment using plasma-driven electron beams available today."
      ],
      "institutions": [],
      "abstract": "on behalf of the LAOLA collaboration",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/moac2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/moac2.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/moac2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOAC2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOAC3",
      "title": "Coherent Phase Space Matching for Staging Plasma and Traditional Accelerator Using Longitudinally Tailored Plasma Structure",
      "authors": [
        "TUB",
        "Beijing",
        "People's Republic of China",
        "For the further development of plasma based accelerators",
        "phase space matching between plasma acceleration stages and between plasma stages and traditional accelerator components becomes a very critical issue for high quality high energy acceleration and its applications in light sources and colliders. Without proper matching",
        "catastrophic emittance growth in the presence of definite energy spread may occur when the beam propagating through different stages and components due to the drastic differences of transverse focusing strength. In this paper we propose to use longitudinally tailored plasma structures as phase space matching components to properly guide the beam through stages. Theoretical analysis and full 3-dimensional particle-in-cell simulations are utilized to show clearly how these structures may work in four different scenarios. Very good agreements between theory and simulations are obtained."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/moac3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/moac3.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/moac3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-MOAC3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 20:19:11"
}