{
  "session_info": {
    "id": "TUXD",
    "name": "TUXD - Accelerator Applications",
    "url": "https://proceedings.jacow.org/napac2022/html/tuxd.htm"
  },
  "papers": [
    {
      "paper_id": "TUXD1",
      "title": "Radiation Concerns and Mitigation Schemes for Accelerator Facility Components",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Major accelerator facilities are limited in beam power not by their accelerators but by the beam intercepting device survivability. In some cases",
        "the target must endure high power pulsed beam",
        "leading to high cycle thermal shocks. Most of the time",
        "the increased beam power creates significant challenges such as corrosion and radiation damage that causes harmful effects on the material and degrades their mechanical and thermal properties during irradiation. This can eventually lead to the failure of the material and drastically reduced lifetime of targets and beam intercepting devices. In order to operate reliable beam-intercepting devices in the framework of energy and intensity increase projects of the future",
        "it is essential to develop a strong R&D program and have synergy with various expertise. Based on those strong R&D programs",
        "several ways exist to mitigate radiation damage in material in order to increase lifetime of targets in accelerators. After presenting the high-power target challenges facing next generation accelerators with few examples of international facilities",
        "I will provide few ways to mitigate radiation damages in target material."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuxd1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuxd1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuxd1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUXD1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXD2",
      "title": "An E-Beam Irradiation Beamline at Jefferson Lab for 1,4-Dioxane and Per- and Polyfluoroalkyl Substances Remediation in Wastewater",
      "authors": [
        "X. Li",
        "H. Baumgart",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "G. Ciovati",
        "M.D. McCaughan",
        "M. Poelker",
        "S. Wang",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Phase Space Tech",
        "Bjärred",
        "Sweden",
        "The Upgraded Injector Test Facility (UITF) at Jefferson Lab",
        "providing a beam energy up to 10 MeV",
        "is suitable for wastewater remediation research. To investigate the degradation of 1",
        "4-dioxane and per- and polyfluoroalkyl substances (PFAS)",
        "widespread in wastewater and potential to be regulated in near future [1]",
        "a beamline for electron-beam irradiation has been designed",
        "installed and successfully commissioned at the UITF. A solenoid with a peak axial magnetic field of up to 0.28 T and a raster were used to obtain a Gaussian beam profile with a transverse standard deviation of ~15 mm. It was applied to irradiate 1",
        "4-dioxane sample filled in the target cell that was designed to let the entire sample receive significant irradiation doses. The dose distribution and absorbed dose",
        "few studied in the existing publications",
        "are necessary measures for the degradation mechanism investigation and have been innovatively achieved in this work using simulations",
        "which were calibrated with opti-chromic dosimeter rods directly exposed to the electron beam. This approach provides an important way for investigating the environmental remediation impact of electron-beam irradiation.",
        "[1] U.S. EPA. Announcement of preliminary regulatory determinations for  contaminants on the fourth drinking water contaminant candidate list. Federal register",
        "85(47):14098 - 14142",
        "2020.2."
      ],
      "institutions": [
        "Funding: Jefferson Lab Laboratory Directed Research and Development Program."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuxd2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuxd2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuxd2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUXD2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXD3",
      "title": "Production Pathways for Medically Interesting Isotopes",
      "authors": [
        "University of Puerto Rico",
        "Rio Piedras Campus",
        "San Juan",
        "Puerto Rico",
        "Coe College",
        "Cedar Rapids",
        "Iowa",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "Radioisotopes are commonly used in nuclear medicine for treating cancer and new",
        "more effective treatment options are always desired. As a result",
        "there is a national need for new radioisotopes and ways to produce them. A computer program was created that evaluates the daughters for all known reactions of projectiles (gamma rays",
        "protons or neutrons) with every stable target isotope by comparing the cross-sections for each reaction at a desired energy",
        "and outputs a list of the potential daughter isotopes that are most likely to be generated. The program then evaluates the decay chains of these daughters to provide a list of the possible decay chains that contain the radioisotope of interest. By knowing the daughter production and decay chain for each isotope",
        "it is possible to go from the desired radioisotope to the stable isotope that can be used as a target for its production. This project would facilitate the search for new pathways to creating useful theranostic isotopes."
      ],
      "institutions": [
        "Funding: LR was supported by the U.S. NSF REU at Old Dominion University Grant No. 1950141. AH was supported by the U.S. DOE, Office of Science, Office of Nuclear Physics under Contract No. DE-AC05-06OR23177"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuxd3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuxd3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuxd3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUXD3",
      "page_number": "271",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXD4",
      "title": "Analysis Methods for Electron Radiography  Based on Laser-Plasma Accelerators",
      "authors": [
        "G.M. Bruhaug",
        "G.W. Collins",
        "H.G. Rinderknecht",
        "J.R. Rygg",
        "J.L. Shaw",
        "M.S. Wei",
        "LLE",
        "Rochester",
        "New York",
        "USA",
        "M.S. Freeman",
        "F.E. Merrill",
        "L.P. Neukirch",
        "C. Wilde",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA"
      ],
      "institutions": [
        "Funding: DOE National Nuclear Security Administration under Award Number DE-NA0003856 DOE under Awards DE-SC00215057 University of Rochester New York State Energy Research and Development Authority"
      ],
      "abstract": "Analysis methods are presented for determining the res-olution of both contact and projected electron radiography based on a laser-plasma accelerator. A means to determine the field strength of the electric/magnetic fields generated when a laser is incident on an object of interest is also outlined. Broad radiography results are reported and future plans for the diagnostic technique are outlined.",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuxd4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuxd4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuxd4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUXD4",
      "page_number": "274",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXD5",
      "title": "Development of Achromatic Imaging Capabilities for pRad at LANSCE",
      "authors": [
        "M. Schanz",
        "J.C. Allison",
        "M.S. Freeman",
        "F.G. Mariam",
        "C.L. Morris",
        "L.P. Neukirch",
        "Z. Tang",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "Proton radiography is a powerful diagnostics technique that is capable of resolving ultra-fast processes on the ns scale in dense matter with micrometer spatial resolution. This unique performance is realized by the use of a chromatic imaging system",
        "which consists of four quadrupole lenses [1]. Chromatic imaging systems have a mono-energetic focal length. That means",
        "if a target with areas of different energy losses is to be investigated",
        "it is only possible to focus on one proton energy leaving other areas of interest blurred. A simple method of focusing multiple energies at once and thus increasing the depth-of-field is the use of multiple detector stations along the beam axis. Proton images captured at downstream detector positions can be combined into a single image using a method called ’focus stacking’. A complete cancellation of the position- and energy dependent 2nd order chromatic aberrations that mostly affect the current image quality of pRad [2] is only possible by using an achromatic imaging system. Following the proposals in early design studies at LANSCE [3] a new prototype achromatic system is currently being developed for a 25 MeV S-band electron accelerator.",
        "*LA-UR-22-24725  [1] N. King",
        "et al.",
        "Nucl. Instr. and Meth. in Phys. Res. A",
        "Vol 424",
        "1999  [2] F.E. Merrill",
        "Rev. of Acc. Sci. and Tech. Vol 8",
        "2015 [3] B. Blind",
        "A.J. Jason",
        "Proc. of PAC",
        "2005"
      ],
      "institutions": [
        "Funding: The research presented is supported by the Laboratory Directed Research and Development program of Los Alamos National Laboratory under project number 20220343ER."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuxd5_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuxd5.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuxd5_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUXD5",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXD6",
      "title": "Dual Radiofrequency Cavity Based Monochromatization for High Resolution Electron Energy Loss Spectroscopy",
      "authors": [
        "A.V. Kulkarni",
        "P.E. Denham",
        "A. Kogar",
        "P. Musumeci",
        "UCLA",
        "Los Angeles",
        "USA",
        "Reducing the energy spread of electron beams can enable breakthrough advances in electron energy loss spectroscopic investigations of solid state samples where characteristic excitations typically have energy scales on the order of meV. In conventional electron sources the energy spread is limited by the emission process and typically on the order of a fraction of an eV. State-of-the-art energy resolution can only be achieved after significant losses in the monochromatization process. Here we propose to take advantage of photoemission from ultrashort laser pulses (~40 fs) so that after a longitudinal phase space manipulation that trades pulse duration for energy spread",
        "the energy spread can be reduced by more than one order of magnitude. The scheme uses two RF cavities to accomplish this goal and can be implemented on a relatively short (~ 1m) beamline. Analytical predictions and results of 3D self consistent beam dynamics simulations are presented to support the findings."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuxd6_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuxd6.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuxd6_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUXD6",
      "page_number": "278",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-11 00:13:58"
}