{
  "session_info": {
    "id": "FRIXSP",
    "name": "FRIXSP - Invited Orals: Accelerator Technology",
    "url": "https://proceedings.jacow.org/ipac2022/html/frixsp.htm"
  },
  "papers": [
    {
      "paper_id": "FRIXSP1",
      "title": "Low-Emittance Compact RF Electron Gun with a Gridded Thermionic Cathode",
      "authors": [
        "JASRI/SPring-8",
        "Hyogo-ken",
        "Japan",
        "A new type of rf electron gun has been developed to generate a stable electron beam with a low-emittance of ~1 um.rad",
        "that can be injected into SX-FEL and DLSR",
        "without using a large UV laser system nor an ultra-high voltage pulsers. This electron gun consists of a 50 kV pulsed gun equipped with a commercially available thermionic cathode with grid and a 238-MHz acceleration cavity driven by a 42 kW solid-state amplifier. The system is simple",
        "stable",
        "robust",
        "and of easy-maintenance. To obtain a \"grid-transparent\" condition",
        "the cathode voltage and the control grid voltage are optimized not to distort the electric field near the grid. To avoid the emittance growth due to the space charge effect",
        "the gun and a special magnetic lens are embedded in the 238-MHz cavity at the shortest distance",
        "and the beam energy is immediately accelerated to 500 kV. The first model of this electron gun has been operated as the 1 GeV injector of the NewSUBARU storage ring. The same electron gun will also be used in the injector linac of the 3 GeV light source under construction in Japan. The talk is expected to include the concept",
        "overall design and the achieved performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2022/talks/frixsp1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2022/papers/frixsp1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2022/posters/frixsp1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2022-FRIXSP1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 18:45:13"
}