{
  "session_info": {
    "id": "MOPR",
    "name": "MOPR - Posters Right of Main Hall",
    "url": "https://proceedings.jacow.org/hb2016/html/mopr.htm"
  },
  "papers": [
    {
      "paper_id": "MOPR001",
      "title": "Figure-8 Storage Ring – Investigation of the Scaled Down Injection System",
      "authors": [
        "H. Niebuhr",
        "A. Ates",
        "M. Droba",
        "O. Meusel",
        "D. Noll",
        "U. Ratzinger",
        "J.F. Wagner",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "To store high current ion beams up to 10 A",
        "a superconducting storage ring (F8SR) is planned at Frankfurt university. For the realisation",
        "a scaled down experimental setup with normalconducting magnets is being build. Investigations of beam transport in solenoidal and toroidal guiding fields are in progress. At the moment",
        "a new kind of injection system consisting of a solenoidal injection coil and a special vacuum vessel is under development. It is used to inject a hydrogen beam sideways between two toroidal magnets. In parallel operation",
        "a second hydrogen beam is transported through both magnets to represent the circulating beam. In a second stage",
        "an ExB-Kicker will be used as a septum to combine both beams into one. The current status of the experimental setup will be shown. For the design of the experiments",
        "computer simulations using the 3D simulation code bender were performed. Different input parameters were checked to find the optimal injection and transport channel for the experiment. The results will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr001.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR001",
      "page_number": "41",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR002",
      "title": "Study on the Magnetic Measurement Results of the Injection System for CSNS/RCS",
      "authors": [
        "M.Y. Huang",
        "S. Fu",
        "N. Huang",
        "L. Huo",
        "H.F. Jipresenter",
        "W. Kang",
        "Y.Q. Liu",
        "J. Peng",
        "J. Qiu",
        "L. Shen",
        "S. Wang",
        "X. Wu",
        "S.Y. Xu",
        "J. Zhang",
        "G.Z. Zhou",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "A combination of the H− stripping and phase space painting method is used to accumulate a high intensity beam in the Rapid Cycling Synchrotron (RCS) of the China Spallation Neutron Source (CSNS). The injection system for CSNS/RCS consists of three kinds of magnets: four direct current magnets (BC1-BC4)",
        "eight alternating current magnets (BH1-BH4 and BV1-BV4)",
        "two septum magnets ("
      ],
      "institutions": [
        "Funding: Work supported by National Natural Science Foundation of China (11205185)"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr002.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR002",
      "page_number": "46",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR004",
      "title": "H− Charge Exchange Injection for XiPAF Synchrotron",
      "authors": [
        "H.J. Yao",
        "X. Guan",
        "G.R. Li",
        "X.W. Wang",
        "Q.Z. Xing",
        "S.X. Zheng",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "The physics design of the H− charge exchange injection system for Xi’an Proton Application Facility (XiPAF) synchrotron with the missing dipole lattice is discussed. The injection scheme is composed of one septum magnet",
        "three chicane dipoles",
        "two bump magnets and one carbon stripping foil. A 7 μg/cm2 carbon foil is chosen for 7 MeV H− beam for high stripping efficiency and low coulomb scattering effect. The simulation results of the horizontal and vertical phase space painting finished by two bumper magnets and mismatching respectively are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr004.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR004",
      "page_number": "49",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR005",
      "title": "RF-Knockout Slow Extraction Design for XiPAF Synchrotron",
      "authors": [
        "H.J. Yao",
        "X. Guan",
        "G.R. Li",
        "X.W. Wang",
        "Q. Zhang",
        "S.X. Zheng",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "The physics design of slow extraction for Xi’an Proton Application Facility (XiPAF) synchrotron is discussed. The extraction scheme is composed of two resonant sextupoles",
        "one electrostatic septum (ES) and two septum magnets. The phase space diagram under the Hardt condition at the entrance of ES and the last three turn’s trajectory before extraction are presented. A program is written with C++ to simulate slow extraction process by RF-knockout (RF-KO)",
        "the calculation results of dual frequency modulation (FM) and amplitude modulation (AM) are given",
        "and the standard deviation of the fluctuation parameter R1 can be limited 0.2 with optimum parameters under a sampling frequency of about 10 kHz."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr005.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR005",
      "page_number": "52",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR006",
      "title": "Design of the 230MeV Proton Accelerator for Xi'an Proton Application Facility",
      "authors": [
        "H.J. Yao",
        "H.B. Chen",
        "C. Cheng",
        "C.T. Du",
        "L. Du",
        "T.B. Du",
        "X. Guan",
        "W.-H. Huang",
        "H. Jiang",
        "G.R. Li",
        "C.-X. Tang",
        "R. Tang",
        "D. Wang",
        "W. Wang",
        "X.W. Wang",
        "L. Wu",
        "Q.Z. Xing",
        "Y. Yang",
        "Z. Yang",
        "H.J. Zeng",
        "H.Y. Zhang",
        "Q. Zhang",
        "Q.Z. Zhang",
        "S.X. Zheng",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "NINT",
        "Xi'an",
        "People's Republic of China",
        "W.Q. Guan",
        "Y. He",
        "J. Li",
        "NUCTECH",
        "Beijing",
        "People's Republic of China",
        "Indiana University",
        "Bloomington",
        "Indiana",
        "USA",
        "M.T. Qiu",
        "B.C. Wang",
        "Y.P. Wang",
        "Z.M. Wang",
        "Y.H. Yan",
        "H.Z. Zhang",
        "C. Zhao",
        "State Key Laboratory of Intense Pulsed Radiation Simulation and Effect",
        "Northwest Institute of Nuclear Technology",
        "Shannxi",
        "People's Republic of China",
        "We report a design of the 230 MeV proton accelera-tor",
        "the Xi’an Proton Application Facility (XiPAF)",
        "which will be located in Xi’an city",
        "China. The facility will provide proton beam with the maximum energy of 230 MeV for the research of the single event effect. The facility",
        "composed of a 230 MeV synchrotron",
        "a 7 MeV H− linac injector and two experimental stations",
        "will provide a flux of 105~108 p/cm2/s with the uni-formity of better than 90% on the 10 cm×10 cm sample."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr006.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR006",
      "page_number": "55",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR007",
      "title": "Cold and High Power Test of Large Size Magnetic Alloy Core for XiPAF's Synchrotron",
      "authors": [
        "G.R. Li",
        "X. Guan",
        "W.-H. Huang",
        "X.W. Wang",
        "Z. Yang",
        "H.J. Yaopresenter",
        "H.J. Zeng",
        "S.X. Zheng",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "A compact magnetic alloy (MA) loaded cavity is under development for XiPAF's synchrotron. The cavity contains 6 large size MA cores",
        "each is independently coupled with solid state power amplifier. Two types of MA core are proposed for the project. We have developed a single core model cavity to verify the impedance model and to test the properties of MA cores under high power state. The high power test results are presented and discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr007.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR007",
      "page_number": "59",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR008",
      "title": "Pressure Profiles Calculation for the CSRm and BRing",
      "authors": [
        "P. Li",
        "Z. Chai",
        "Z. Dong",
        "X.C. Kang",
        "M. Li",
        "S. Li",
        "W.L. Li",
        "C.L. Luo",
        "R.S. Mao",
        "J. Meng",
        "J.C. Yang",
        "Y.J. Yuan",
        "W.H. Zheng",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "A new large scale accelerator facility is being designed by Institute of Modern Physics (IMP) Lanzhou",
        "which is named as the High Intensity heavy-ion Accelerator Facility (HIAF). This project consists of ion sources",
        "Linac accelerator",
        "synchrotrons (BRing) and several experimental terminals. During the operation of Bring",
        "the heavy ion beams will be easily lost at the vacuum chamber along the BRing when it is used to accumulate intermediate charge state particles. The vacuum pressure bump due to the ion-induced desorption in turn leads to an increase in beam loss rate. In order to accumulate the beams to higher intensity to fulfill the requirements of physics experiments and for better understanding of the dynamic vacuum pressure caused by the beam loss",
        "a dynamic vacuum pressure simulation program has been developed. Vacuum pressure profiles are calculated and compared with the measured data based on the current synchrotron (CSRm). Then the static vacuum pressure profiles of the BRing and one type of pump which will be used in the BRing are introduced in this paper."
      ],
      "institutions": [
        "Funding: National Natural Science Foundation of China (Project No. 11305227)"
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr008.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR008",
      "page_number": "62",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR009",
      "title": "Transverse Beam Splitting Made Operational: Recent Progress of the Multi-Turn Extraction at the CERN Proton Synchrotron",
      "authors": [
        "A. Huschauer",
        "J.C.C.M. Borburgh",
        "S. Damjanovic",
        "S.S. Gilardoni",
        "M. Giovannozzi",
        "M. Hourican",
        "K. Kahle",
        "G. Le Godec",
        "O. Michels",
        "G. Sterbini",
        "CERN",
        "Geneva",
        "Switzerland",
        "IBA",
        "Louvain-la-Neuve",
        "Belgium",
        "Following a successful commissioning period",
        "the Multi-Turn Extraction (MTE) at the CERN Proton Synchrotron (PS) has been applied for the fixed-target physics programme at the Super Proton Synchrotron (SPS) since September 2015. This exceptional extraction technique was proposed to replace the long-serving Continuous Transfer (CT) extraction",
        "which has the drawback of inducing high activation in the ring. MTE exploits the principles of non-linear beam dynamics to perform loss-free beam splitting in the horizontal phase space. Over multiple turns",
        "the resulting beamlets are then transferred to the downstream accelerator. The operational deployment of MTE was rendered possible by the full understanding and mitigation of different hardware limitations and by redesigning the extraction trajectories and non-linear optics",
        "which was required due to the installation of a dummy septum to reduce the activation of the magnetic extraction septum. The results of the related experimental and simulation studies",
        "a summary of the 2015 performance analysis",
        "as well as more recent performance improvements are presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr009.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR009",
      "page_number": "65",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR010",
      "title": "Machine Element Contribution to the Longitudinal Impedance Model of the CERN SPS",
      "authors": [
        "T. Kaltenbacher",
        "F. Caspers",
        "C. Vollinger",
        "CERN",
        "Geneva",
        "Switzerland",
        "This contribution describes the current longitudinal impedance model of the SPS and studies carried out in order to improve",
        "extend and update it. Specifically",
        "new sources of impedances have been identified",
        "evaluated and included in the model. One finding are low Q and low-frequency (LF; here below 1 GHz) resonances which occur due to enamelled flanges in combination with external cabling e.g. ground loops. These resonances couple to the beam through the gap with enamel coating which creates an open resonator. Since this impedance is important for beam stability in the CERN Proton Synchrotron (PS)",
        "RF by-passes were installed on the enamelled flanges",
        "and their significance for the SPS beam is currently under investigation. Simulations",
        "bench and beam measurements were used to deduce model parameters for beam dynamic simulations."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr010.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR010",
      "page_number": "71",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR011",
      "title": "The SPS 200 MHz TWC Impedance after the LIU Upgrade",
      "authors": [
        "T. Roggen",
        "R. Calaga",
        "F. Caspers",
        "T. Kaltenbacher",
        "C. Vollinger",
        "CERN",
        "Geneva",
        "Switzerland",
        "As a part of the LHC Injectors Upgrade project (LIU) the 200 MHz Travelling Wave Cavities (TWC) of the Super Proton Synchrotron (SPS) will be upgraded. The two existing five-section cavities will be rearranged into four three-section cavities (using two existing spare sections)",
        "thereby increasing the total voltage from 7 MV (IRF = 1.5 A) to 10 MV (IRF = 3.0 A). Projections of the HL-LHC (High Luminosity Large Hadron Collider) era are conceived by the macro-particle simulation code BLonD",
        "that makes use of an impedance model of the SPS",
        "developed from a thorough survey of machine elements. This paper analyses the impedance contribution of the 200 MHz cavities in the two configurations",
        "using electromagnetic simulations. Measurements of the existing cavities in the SPS and a single-section prototype are also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr011.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR011",
      "page_number": "76",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR012",
      "title": "The New HL-LHC Injection and Transport Protection System",
      "authors": [
        "F.M. Velotti",
        "W. Bartmann",
        "C. Bracco",
        "M.A. Fraser",
        "B. Goddard",
        "V. Kain",
        "A. Lechner",
        "M. Meddahi",
        "CERN",
        "Geneva",
        "Switzerland",
        "The High-Luminosity LHC (HL-LHC) upgrade represents a challenge for the full chain of its injectors. The aim is to provide beams with a brightness a factor of two higher than the present maximum achieved. The 450 GeV beams injected into the LHC are directly provided by the Super Proton Synchrotron (SPS) via two transfer lines (TL)",
        "TI2 and TI8. Such transfer lines are both equipped with a passive protection system to protect the LHC aperture against ultra-fast failures of the extraction and transport systems. In the LHC instead",
        "the injection protection system protects the cold apertures against possible failures of the injection kicker",
        "MKI. Due to the increase of the beam brightness",
        "these passive systems need to be upgraded. In this paper",
        "the foreseen and ongoing modifications of the LHC injection protection system and the TL collimators are presented. Simulations of the protection guaranteed by the new systems in case of failures are described",
        "together with benchmark with measurements for the current systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr012.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR012",
      "page_number": "81",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR014",
      "title": "Corrector Magnets for the CBETA and eRHIC Projects and Other Hadron Facilities*",
      "authors": [
        "N. Tsoupas",
        "S.J. Brooks",
        "A.K. Jain",
        "F. Méot",
        "V. Ptitsyn",
        "D. Trbojevic",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "[1] http://arxiv.org/abs/1504.00588  [2] http://arxiv.org/ftp/arxiv/papers/1409/1409.1633.pdf  [3] K. Halbach",
        "NIM 169 (1980) pp. 1-10"
      ],
      "institutions": [],
      "abstract": "The Cbeta project[1] is a prototype electron accelerator for the proposed eRHIC project[2]. The electron accelerator is based on the Energy Recovery Linac (ERL) and the Fixed Field Alternating Gradient (FFAG) principles. The FFAG arcs of the accelerator are comprised of one focusing and one defocusing quadrupoles which are designed as Halbach-type permanent magnet quadrupoles[3]. We propose window frame electro-magnets surrounding the Halbach magnets to be used as normal and skew dipoles correctors and quadrupole correctors. We will present results from OPERA-3D calculations of the effect of these corrector magnets on the magnetic field of the main quadrupole magnets and the results will be compared with experimental measurements. We will also discuss applications of permanent magnets with such correctors for hadron beam facilities. reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr014.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR014",
      "page_number": "87",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR016",
      "title": "Mitigation of Numerical Noise for Beam Loss Simulations",
      "authors": [
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "GSI",
        "Darmstadt",
        "Germany",
        "Numerical noise emerges in self-consistent simulations of charged particles",
        "and its mitigation is investigated since the first numerical studies in plasma physics. In accelerator physics",
        "recent studies find an artificial diffusion of the particle beam due to numerical noise in particle-in-cell tracking",
        "which is of particular importance for high intensity machines with a long storage time",
        "as the SIS100 at FAIR or in context of the LIU upgrade at CERN. In beam loss simulations for these projects artificial effects must be distinguished from physical beam loss. Therefore",
        "it is important to relate artificial diffusion to artificial beam loss",
        "and to choose simulation parameters such that physical beam loss is well resolved. As a practical tool",
        "we therefore suggest a scaling law to find optimal simulation parameters for a given maximum percentage of acceptable artificial beam loss."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr016.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR016",
      "page_number": "90",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR017",
      "title": "Status of the Beam Instrumentation System of CSNS",
      "authors": [
        "J.L. Sun",
        "J. Pengpresenter",
        "R.Y. Qiu",
        "T. Yang",
        "CSNS",
        "Guangdong Province",
        "People's Republic of China",
        "W.L. Huang",
        "F. Li",
        "P. Li",
        "M. Meng",
        "J.M. Tian",
        "T.G. Xu",
        "Zh.H. Xu",
        "L. Zeng",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "The first section DTL commissioning of China Spallation Neutron Source (CSNS) project has been successful finished in January",
        "2016. The H− beam can be accelerated to 21.6 MeV at peak current 18 mA",
        "achieved the design point. Different elements of the beam instrumentation system have been tested during the commissioning",
        "including BPM",
        "CT",
        "FCT",
        "WS",
        "EM",
        "BLM",
        "and corresponding electronics and control systems. High accuracy phase measurement (precision @ ±1°) system has been started into operation. Beam loss monitor (BLM) for low energy",
        "3 MeV to 21.6 MeV",
        "has been tested too",
        "and got very positive results. For the LRBT",
        "RCS and RTBT",
        "different type wire scanner",
        "BPM",
        "WCM",
        "CT were designed. The monitors fit for the high-radiation environments were considered. All the physical design work has been finished",
        "and being manufactured. Lab test will be started in June and the LINAC commissioning (beam energy up to 80 MeV) will be started in August."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr017.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR017",
      "page_number": "95",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR018",
      "title": "XAL Applications Development for CSNS Transport Lines",
      "authors": [
        "Y. Li",
        "Z.P. Li",
        "W.B. Liu",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "CSNS",
        "Guangdong Province",
        "People's Republic of China"
      ],
      "institutions": [],
      "abstract": "XAL is an application programming framework initially developed at the Spallation Neutron Source (SNS). It has been employed as a part of control system via con-nection to EPICS to provide application programs for beam commissioning at the China Spallation Neutron Source (CSNS). Several XAL-based applications have been developed for Beam Transport line at CSNS and successfully applied in the MEBT and DTL-1 beam commissioning. These applications will be discussed in this paper. reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr018.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR018",
      "page_number": "98",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR020",
      "title": "Space Charge Effects of High Intensity Beams at BRing",
      "authors": [
        "J. Li",
        "J.C. Yang",
        "IMP/CAS",
        "Lanzhou",
        "People's Republic of China",
        "Space charge effects perform one of the main intensity limitations for low energy synchrotron. Large tune spread and crossing resonance stop-bands can hardly be avoided for intensive heavy ion beam at high intensity. Several subjects like Betatron and structure resonance",
        "and tune spread are discussed. Simulations are carried out for 238U34+ focusing on emittance and intensity change during RF capture at the injection energy at the booster ring of the High Intensity heavy ion Accelerator Facility (HIAF)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr020.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR020",
      "page_number": "101",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPR021",
      "title": "Overview of the ESSnuSB Accumulator Ring",
      "authors": [
        "M. Olvegård",
        "T.J.C. Ekelöf",
        "Uppsala University",
        "Uppsala",
        "Sweden",
        "E. Benedetto",
        "M. Cieslak-Kowalska",
        "M. Martini",
        "H.O. Schönauer",
        "E.H.M. Wildner",
        "CERN",
        "Geneva",
        "Switzerland",
        "The European Spallation Source (ESS) is a research center based on the world’s most powerful proton driver",
        "2.0 GeV",
        "5 MW on target",
        "currently under construction in Lund. With an increased pulse frequency",
        "the ESS linac could deliver additional beam pulses to a neutrino target",
        "thus giving an excellent opportunity to produce a high-performance ESS neutrino Super-Beam (ESSnuSB). The focusing system surrounding the neutrino target requires short proton pulses. An accumulator ring and acceleration of an H− beam in the linac for charge-exchange injection into the accumulator could provide such short pulses. In this paper we present an overview of the work with optimizing the accumulator design and the challenges of injecting and storing 1.1015 protons per pulse from the linac. In particular",
        "particle tracking simulations with space charge will be described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr021.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR021",
      "page_number": "105",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPR022",
      "title": "Longitudinal Particle Tracking Code for a High Intensity Proton Synchrotron",
      "authors": [
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan"
      ],
      "institutions": [],
      "abstract": "We have been developing a longitudinal particle tracking code to design and investigate the beam behavior of the J-PARC proton synchrotrons. The code calculate the longitudinal particle motion with a wake voltage and a space charge effect. The most different point from the other codes is that a synchronous particle motion is calculated from the bending magnetic field pattern. This means the synchronous particle is independent from an acceleration frequency pattern. This feature is useful to check the adiabaticity of the synchrotron. The code also calculates the longitudinal emittance and the filling factor at an rf bucket under the multi-harmonics. We will describe the feature of the code. reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr022.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR022",
      "page_number": "110",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR023",
      "title": "Interpretation of Wire-Scanner Asymmetric Profiles in a Low-Energy Ring",
      "authors": [
        "M. Cieslak-Kowalska",
        "E. Benedettopresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "In the CERN PS Booster",
        "wire-scanner profile measurements performed at injection energy are affected by a strong asymmetry. The shape was reproduced with the code pyOrbit",
        "assuming that the effect is due to the beam evolution during the scans",
        "under the influence of space-charge forces and Multiple Coulomb Scattering at the wire itself. Reproducing the transverse profiles during beam evolution allows to use them reliably as input for simulation benchmarking."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr023.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR023",
      "page_number": "115",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPR024",
      "title": "General Formula to Deduce the Space Charge Tune Spread From a Quadrupolar Pick-Up Measurement",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "In 1966",
        "W. Hardt derived the oscillation frequencies obtained in the presence of space charge forces and gradients errors for elliptical beams. Since then",
        "a simple formula is usually used to relate the shift of the quadrupolar mode (obtained from the quadrupolar pick-up) and the space charge tune spread",
        "depending only on the ratio between the two transverse equilibrium beam sizes. However",
        "this formula is not always valid",
        "in particular for machines running close to the coupling resonance Qx = Qy with almost round beams. A new general formula is presented",
        "giving the space charge tune spread as a function of i) the measured shift of the quadrupolar mode",
        "ii) the ratio between the two transverse equilibrium beam sizes and iii) the distance between the two transverse tunes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr024.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR024",
      "page_number": "120",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR025",
      "title": "Space Charge Modules for PyHEADTAIL",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "ETH",
        "Zurich",
        "Switzerland",
        "PyHEADTAIL is a 6D tracking tool developed at CERN to simulate collective effects. We present recent developments of the direct space charge suite",
        "which is available for both the CPU and GPU. A new 3D particle-in-cell solver with open boundary conditions has been implemented. For the transverse plane",
        "there is a semi-analytical Bassetti-Erskine model as well as 2D self-consistent particle-in-cell solvers with both open and closed boundary conditions. For the longitudinal plane",
        "PyHEADTAIL offers line density derivative models. Simulations with these models are benchmarked with experiments at the injection plateau of CERN's Super Proton Synchrotron."
      ],
      "institutions": [
        "Funding: CERN, Doctoral Studentship and EPFL, Doctorate"
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr025.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR025",
      "page_number": "124",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR026",
      "title": "Space Charge Mitigation With Longitudinally Hollow Bunches",
      "authors": [
        "A. Oeftiger",
        "S. Hancock",
        "G. Rumolo",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [
        "Funding: CERN, Doctoral Studentship and EPFL, Doctorate",
        "Hollow longitudinal phase space distributions have a flat profile and hence reduce the impact of transverse space charge. Dipolar parametric excitation with the phase loop feedback systems provides such hollow distributions under reproducible conditions. We present a procedure to create hollow bunches during the acceleration ramp of CERN's PS Booster machine with minimal changes to the operational cycle. The improvements during the injection plateau of the downstream Proton Synchrotron are assessed in comparison to standard parabolic bunches."
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr026.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR026",
      "page_number": "130",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR027",
      "title": "Dynamic Beta and Beta-Beating Effects in the Presence of the Beam-Beam Interactions",
      "authors": [
        "T. Pieloni",
        "X. Buffat",
        "L.E. Medina Medrano",
        "C. Tambasco",
        "R. Tomás",
        "CERN",
        "Geneva",
        "Switzerland",
        "J. Barranco",
        "P. Concalves Jorge",
        "C. Tambasco",
        "EPFL",
        "Lausanne",
        "Switzerland"
      ],
      "institutions": [],
      "abstract": "The Large Hadron Collider (LHC) has achieved correction of beta beat down to better than 5%. The beam-beam interactions at the four experiments result as extra quadrupole error in the lattice. This will produce a change of the β* at the experiments and a beating along the arcs which for the High Luminosity LHC (HL-LHC) will be very large. Estimations of these effects will be given with the characterisation of the amplitude dependency. A first attempt to correct his beating is also discussed. reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr027.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR027",
      "page_number": "136",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR028",
      "title": "CERN PS Booster Longitudinal Dynamics Simulations for the Post-LS2 Scenario",
      "authors": [
        "D. Quartullo",
        "S.C.P. Albright",
        "E.N. Shaposhnikova",
        "H. Timko",
        "CERN",
        "Geneva",
        "Switzerland",
        "The CERN PS Booster is the first synchrotron in the LHC proton injection chain",
        "it currently accelerates particles from 50 MeV to 1.4 GeV kinetic energy. Several upgrades foreseen by the LHC Injectors Upgrade Program will allow the beam to be accelerated from 160 MeV to 2 GeV after Long Shutdown 2 in 2021. The present RF systems will be replaced by a new one",
        "based on Finemet technology. These and other improvements will help to increase the LHC luminosity by a factor of ten. In order to study beam stability in the longitudinal plane simulations have been performed with the CERN BLonD code",
        "using an accurate longitudinal impedance model and a reliable estimation of the longitudinal space charge. Particular attention has been dedicated to the three main features that currently let the beam go stably through the ramp: Double RF operation in bunch-lengthening mode to reduce the transverse space charge tune spread",
        "exploitation of feedback loops to damp dipole oscillations",
        "and controlled longitudinal emittance blow-up. RF phase noise injection has been considered to study if it could complement or substitute the currently used method based on sinusoidal phase modulation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr028.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR028",
      "page_number": "140",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR029",
      "title": "On the Impact of Non-Symplecticity of Space Charge Solvers",
      "authors": [
        "CERN",
        "Geneva",
        "Switzerland",
        "To guarantee long-term reliability in the predictions of a numerical integrator",
        "it is a well-known requirement that the underlying map has to be symplectic. It is therefore important to examine in detail the impact on emittance growth and noise generation in case this condition is violated. We present a strategy of how to tackle this question and some results obtained for particular PIC and frozen space charge models."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr029.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR029",
      "page_number": "146",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR030",
      "title": "Simple Models for Beam Loss Near the Half Integer Resonance with Space Charge",
      "authors": [
        "C.M. Warsop",
        "D.J. Adams",
        "B. Jones",
        "B.G. Pine",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "The half integer resonance is often used to define the high intensity limit of medium or low energy hadron rings where transverse space charge is significant. However",
        "the mechanism leading to particle loss as beam approaches this resonance",
        "which thus defines the limit",
        "is not clearly understood. In this paper we explore simple models",
        "based on single particle resonance ideas",
        "to see if they describe useful aspects of motion as observed in simulations and experiments of 2D coasting beams on the ISIS synchrotron. Single particle behaviour is compared to 2D self-consistent models to assess when coherent motion begins to affect the single particle motion",
        "and understand the relevance of coherent and incoherent resonance. Whilst the general problem of 2D resonant loss",
        "with non-stationary distributions and non-linear fields is potentially extremely complicated",
        "here we suggest that for a well-designed machine",
        "where higher order pathological loss effects are avoided",
        "a relatively simple model may give valuable insights into beam behaviour and control."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr030.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR030",
      "page_number": "150",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR031",
      "title": "Development of Physics Models of the ISIS Head-Tail Instability",
      "authors": [
        "R.E. Williamson",
        "B. Jones",
        "C.M. Warsop",
        "STFC/RAL/ISIS",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "ISIS is the pulsed spallation neutron and muon source at the Rutherford Appleton Laboratory in the UK. Operation centres on a rapid cycling proton synchrotron which accelerates 3·1013 protons per pulse (ppp) from 70 MeV to 800 MeV at 50 Hz",
        "delivering a mean beam power of 0.2 MW. As a high intensity",
        "loss-limited machine",
        "research and development at ISIS is focused on understanding loss mechanisms with a view to improving operational performance and guiding possible upgrade routes. The head-tail instability observed on ISIS is of particular interest as it is currently a main limitation on beam intensity. Good models of impedance are essential for understanding instabilities and to this end",
        "recent beam-based measurements of the effective transverse impedance of the ISIS synchrotron are presented. This paper also presents developments of a new",
        "in-house code to simulate the head-tail instability observed and includes benchmarks against theory and comparisons with experimental results."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr031.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR031",
      "page_number": "155",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR033",
      "title": "Beam Acceleration and Transition Crossing in the Fermilab Booster",
      "authors": [
        "V.A. Lebedev",
        "C.M. Bhat",
        "J.-F. Ostiguy",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "To suppress eddy currents",
        "the Fermilab rapid cycling Booster synchrotron has no beam pipe; rather",
        "its combined function dipoles are evacuated",
        "exposing the beam directly to the magnet laminations. This arrangement significantly increases the resistive wall impedance of the dipoles and",
        "in combination with the space charge impedance",
        "substantially complicates longitudinal dynamics at transition. Voltage and accelerating phase profiles in the vicinity of transition are typically empirically optimized to minimize beam loss and emittance growth. In this contribution",
        "we present results of experimental studies of beam acceleration near transition. Using comparisons between observed beam parameters and simulations",
        "we obtain accurate calibrations for the RF program and extract quantitative information about parameters of relevance to the Booster laminated magnets longitudinal impedance model. The results are used to analyze transition crossing in the context of a future 50% increase in beam intensity planned for PIP-II",
        "an upgrade of the Fermilab accelerating complex."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr033.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR033",
      "page_number": "160",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPR034",
      "title": "Suppression of Half-Integer Resonance in Fermilab Booster",
      "authors": [
        "V.A. Lebedev",
        "A. Valishev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The particle losses at injection in the FNAL Booster are one of the major factors limiting the machine performance. The losses are caused by motion non-linearity due to direct space charge and due to non-linearity introduced by large values of chromaticity sextupoles required to suppress transverse instabilities. The report aims to address the former - the suppression of incoherent space charge effects by reducing deviations from the perfect periodicity of linear optics functions. It should be achieved by high accuracy optics measurements with subsequent optics correction and by removing known sources of optics perturbations. The study shows significant impact of optics correction on the half-integer stop band with subsequent reduction of particle loss. We use realistic Booster lattice model to understand the present limitations",
        "and investigate the possible improvements which would allow high intensity operation with PIP-II parameters."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr034.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR034",
      "page_number": "164",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOPR035",
      "title": "Electron Lens for the Fermilab Integrable Optics Test Accelerator",
      "authors": [
        "G. Stancari",
        "A.V. Burov",
        "K. Carlson",
        "D.J. Crawford",
        "V.A. Lebedev",
        "J.R. Leibfritz",
        "M.W. McGee",
        "S. Nagaitsev",
        "L.E. Nobrega",
        "C.S. Park",
        "E. Prebys",
        "A.L. Romanov",
        "J. Ruan",
        "V.D. Shiltsev",
        "Y.-M. Shin",
        "J.C.T. Thangaraj",
        "A. Valishev",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "IAP",
        "Frankfurt am Main",
        "Germany",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "The Integrable Optics Test Accelerator (IOTA) is a research machine currently being designed and built at Fermilab. The research program includes the study of nonlinear integrable lattices",
        "beam dynamics with self fields",
        "and optical stochastic cooling. One section of the ring will contain an electron lens",
        "a low-energy magnetized electron beam overlapping with the circulating beam. The electron lens can work as a nonlinear element",
        "as an electron cooler",
        "or as a space-charge compensator. We describe the physical principles",
        "experiment design",
        "and hardware implementation plans for the IOTA electron lens."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr035.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR035",
      "page_number": "170",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "MOPR036",
      "title": "Spin Tracking of Polarized Protons in the Main Injector at Fermilab",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "C. Aldred",
        "W. Lorenzon",
        "Michigan University",
        "Ann Arbor",
        "Michigan",
        "USA",
        "The Main Injector (MI) at Fermilab currently produces high-intensity beams of protons at energies of 120 GeV for a variety of physics experiments. Acceleration of polarized protons in the MI would provide opportunities for a rich spin physics program at Fermilab. To achieve polarized proton beams in the Fermilab accelerator com-plex",
        "shown in Fig.1.1",
        "detailed spin tracking simulations with realistic parameters based on the existing facility are required. This report presents studies at the MI using a single 4-twist Siberian snake to determine the depolariz-ing spin resonances for the relevant synchrotrons. Results will be presented first for a perfect MI lattice",
        "followed by a lattice that includes the real MI imperfections",
        "such as the measured magnet field errors and quadrupole misa-lignments. The tolerances of each of these factors in maintaining polarization in the Main Injector will be discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-HB2016-",
      "presentation_url": "https://proceedings.jacow.org/hb2016/talks/mopr036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/hb2016/papers/mopr036.pdf",
      "poster_url": "https://proceedings.jacow.org/hb2016/posters/mopr036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-HB2016-MOPR036",
      "page_number": "173",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 31,
  "scrape_time": "2025-10-10 17:12:21"
}