{
  "session_info": {
    "id": "TUAL",
    "name": "TUAL - Time Resolved Diagnostics and Synchronization",
    "url": "https://proceedings.jacow.org/IBIC2013/html/tual.htm"
  },
  "papers": [
    {
      "paper_id": "TUAL1",
      "title": "Longitudinal Phase Space Characterization at FERMI@Elettra",
      "authors": [
        "E. Ferrari",
        "E. Allaria",
        "P. Cinquegrana",
        "M. Ferianis",
        "L. Fröhlich",
        "L. Giannessi",
        "G. Penco",
        "M. Predonzani",
        "F. Rossi",
        "P. Sigalotti",
        "M. Veronese",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "Università degli Studi di Trieste",
        "Trieste",
        "Italy",
        "The seeded FEL FERMI@Elettra has completed the commissioning of FEL1 line",
        "and it is now providing the User Community with a coherent and tunable UV radiation (from 70nm to 20nm) in a number of different configurations",
        "including an original twin-seeded pump-probe scheme. Among the key sub systems for the operation of FERMI@Elettra",
        "there are the femto second optical timing system",
        "some dedicated longitudinal diagnostics",
        "specifically developed for FERMI@Elettra and",
        "of course",
        "state of art laser systems. In this paper",
        "after a short review of the FERMI@Elettra optical timing system and of its routinely achieved performances",
        "we focus on the results obtained from the suite of longitudinal diagnostics (Bunch Arrival Monitor",
        "Electro Optical sampling station and RF deflectors) all operating in single shot and with 10s fs resolution which demonstrate the FERMI@Elettra achieved performances. The results from these longitudinal diagnostics are compared and shot to shot correlated with the results obtained from an independent longitudinal measurement technique",
        "based on a spectrometer measurement of a linearly chirped electron bunch",
        "which further validate the FERMI@Elettra operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tual1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tual1.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tual1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUAL1",
      "page_number": "303",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUAL2",
      "title": "Commissioning the New LCLS X-band Transverse Deflecting Cavity with Femtosecond Resolution",
      "authors": [
        "P. Krejcik",
        "F.-J. Decker",
        "Y. Ding",
        "J.C. Frisch",
        "Z. Huang",
        "J.R. Lewandowski",
        "H. Loos",
        "J.L. Turner",
        "J.W. Wang",
        "M.-H. Wang",
        "J.J. Welch",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "DESY",
        "Hamburg",
        "Germany",
        "The new X-band transverse deflecting cavity began operation in May 2013 and is installed downstream of the LCLS undulator. It is operated at the full 120 Hz beam rate without interfering with the normal FEL operation for the photon users. The deflected beam is observed on the electron beam dump profile monitor",
        "which acts as an energy spectrometer in the vertical plane. We observe",
        "on a pulse by pulse basis",
        "the time resolved energy profile of the spent electron beam from the undulator. The structure is powered from a 50 MW X-band klystron",
        "giving a 48 MV kick to the beam which yields a 1 fs rms time resolution on the screen. We have measured the longitudinal profile of the electron bunches both with the FEL operating and with the lasing suppressed",
        "allowing reconstruction of both the longitudinal profile of the incoming electron beam and the time-resolved profile of the X-ray pulse generated in the FEL. We are immediately able to see whether the bunch is chirped and which parts of the bunch are lasing",
        "giving us new insight into tuning the machine for peak performance. The performance of the system will be presented along with examples of measurements taken during LCLS operation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tual2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tual2.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tual2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUAL2",
      "page_number": "308",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUAL3",
      "title": "Absolute Bunch Length Measurements at Fermi@ELETTRA FEL",
      "authors": [
        "MAX-lab",
        "Lund",
        "Sweden",
        "P. Craievich",
        "G. Penco",
        "M. Veronese",
        "Elettra-Sincrotrone Trieste S.C.p.A.",
        "Basovizza",
        "Italy",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Electron bunch length measurements are of crucial importance for many types of accelerators",
        "including storage rings",
        "energy recovery linacs",
        "free electron lasers. Many devices and instrumentation have been developed to measure and control the electron bunch length. A very powerful class of diagnostic tools is based on the coherent radiation power emitted by the electron bunch",
        "that allows a non-destructive shot by shot measurement",
        "well suitable for bunch length control feedback implementation. However they usually provide measurements of the bunch length relative variation",
        "and external instrumentation like a transverse RF deflecting cavity is usually needed to calibrate them and to obtain absolute bunch length estimations. In this paper we present a novel experimental methodology to self-calibrate a device based on diffraction radiation from a ceramic gap. We indeed demonstrate the possibility to use coherent radiation based diagnostic to provide absolute measurements of the electron bunch length. We present the theoretical basis of the proposed approach and validate it through a detailed campaign of measurements that have been carried on in the FERMI@Elettra FEL linac."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2013/talks/tual3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2013/papers/tual3.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2013/posters/tual3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2013-TUAL3",
      "page_number": "312",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:59:15"
}