{
  "session_info": {
    "id": "TUAC",
    "name": "TUAC - Contributed Orals (MC6)",
    "url": "https://proceedings.jacow.org/IPAC2015/html/tuac.htm"
  },
  "papers": [
    {
      "paper_id": "TUAC1",
      "title": "Beam Instrumentation and Diagnostics for High Luminosity LHC",
      "authors": [
        "O.R. Jones",
        "E. Bravin",
        "B. Dehning",
        "T. Lefèvre",
        "H. Schmickler",
        "CERN",
        "Geneva",
        "Switzerland",
        "The extensive array of beam instrumentation with which the LHC is equipped",
        "has played a major role in its commissioning",
        "rapid intensity ramp-up and safe and reliable operation. High Luminosity LHC (HL-LHC) brings with it a number of new challenges in terms of instrumentation that will be discussed in this contribution. The beam loss system will need significant upgrades in order to be able to cope with the demands of HL-LHC",
        "with cryogenic beam loss monitors under investigation for deployment in the new inner triplet magnets to distinguish between primary beam losses and collision debris. Radiation tolerant integrated circuits are also being developed to allow the front-end electronics to sit much closer to the detector. Upgrades to other existing systems are also envisaged; including the beam position measurement system in the interaction regions and the addition of a halo measurement capability to synchrotron light diagnostics. Additionally",
        "several new diagnostic systems are under investigation",
        "such as very high bandwidth pick-ups and a streak camera installation",
        "both able to perform intra-bunch measurements of transverse position on a turn by turn basis."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tuac1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tuac1.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tuac1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUAC1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUAC2",
      "title": "Wideband Vertical Intra-Bunch Feedback At The SPS - 2015 Results And Path Forward",
      "authors": [
        "C.H. Rivetta",
        "J.E. Dusatko",
        "J.D. Fox",
        "O. Turgutpresenter",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "CERN",
        "Geneva",
        "Switzerland",
        "We present experimental measurements taken from CERN SPS machine development studies with a wideband intra-bunch feedback channel prototype. The demonstration system is a digital processing system with recently installed wideband kicker and amplifier components. This new hardware extends the bandwidth up to 1GHz and allows driving and controlling multiple vertical transverse modes in the bunch. The studies are focused on both driving the bunch with spectrally controlled signals to identify a reduced model of the bunch dynamics and testing model-based feedback controllers to stabilize the bunch dynamics. The measurements are structured to validate reduced MIMO models and macro-particle simulation codes",
        "including the dynamics and limits of the feedback channel. Noise effects and uncertainties in the model are evaluated via SPS measurements to quantify the limits of control techniques applied to stabilize the intrabunch dynamics. The design of controllers for Q26 and Q20 optics are illustrated and future control developments are described."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tuac2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tuac2.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tuac2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUAC2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUAC3",
      "title": "Optimization of Beam Loss Monitor Network for Fault Modes",
      "authors": [
        "Z. Liu",
        "Z.Q. He",
        "S.M. Lidia",
        "D. Liu",
        "Q. Zhao",
        "FRIB",
        "East Lansing",
        "Michigan",
        "USA",
        "Beam Loss Monitoring (BLM) System is an essential part to protect accelerator from machine faults. Compared with the empirical or uniform BLM arrangement in most accelerators",
        "our new optimization approach proposes a “minimum spatial distribution” for BLM network. In this distribution",
        "BLMs shall be placed at a small set of “critical positions” that can detect all failure / FPS trigger-able events of each fault mode. In additional",
        "to implement a more advanced function of fault diagnosis",
        "BLM should also be placed at “discrimination points” for fault-induced loss pattern recognition. With examples of FRIB failure event simulations",
        "the author demonstrates the proof of concept to locate these “critical positions” and “discrimination points” for the minimum spatial distribution of BLMs."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tuac3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tuac3.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tuac3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUAC3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 20:24:17"
}