{
  "session_info": {
    "id": "MOOC",
    "name": "MOOC - FEL Theory",
    "url": "https://proceedings.jacow.org/FEL2012/html/mooc.htm"
  },
  "papers": [
    {
      "paper_id": "MOOC02",
      "title": "Growth Rates and Coherence Properties of FODO-lattice based X-ray Free Electron Lasers",
      "authors": [
        "S. Reiche",
        "E. Prat",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Most hard X-ray Free Electron Lasers are designed with a super-imposed FODO lattice to focus the electron beam for optimum performance of the FEL. Theory predicts an optimum value of the beta-function",
        "where the induced axial velocity spread starts to counteract the increased rho-parameter due to higher electron density. However in a FODO lattice the electron beam envelope varies significantly and disrupts the coupling of the electron beam to the radiation field. This is particularly relevant for hard X-ray FELs",
        "where the radiation mode is smaller than the electron beam size. In this presentation we study the impact of the FODO cell length and the beta-function variation on the FEL gain length and growth of the coherence properties for SASE FELs."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/mooc02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/mooc02.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/mooc02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-MOOC02",
      "page_number": "25",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOC03",
      "title": "On Quantum Effects in Spontaneous Emission by a Relativistic Electron Beam in an Undulator",
      "authors": [
        "G. Geloni",
        "V. Kocharyan",
        "E. Saldin",
        "DESY",
        "Hamburg",
        "Germany",
        "Robb and Bonifacio (2011) claimed that a previously neglected quantum effect results in noticeable changes in the evolution of the energy distribution associated with spontaneous emission in long undulators. They revisited theoretical models used to describe the emission of radiation by relativistic electrons",
        "and claimed that in the asymptotic limit for a large number of undulator periods the evolution of the electron energy distribution occurs as discrete energy groups according to Poisson distribution. These novel results are based on a one-dimensional model of spontaneous emission and assume that electrons are sheets of charge. However",
        "electrons are point-like particles and the bandwidth of the angular-integrated spectrum of undulator radiation is independent of the number of undulator periods. The evolution of the energy distribution studied with a three-dimensional theory is consistent with a continuous diffusive process. We also review how quantum diffusion of electron energy in an undulator with small undulator parameter can be analyzed using the Thomson cross-section expression",
        "unlike the conventional treatment based on the expression for the Lienard-Wiechert fields."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/mooc03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/mooc03.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/mooc03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-MOOC03",
      "page_number": "29",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOC04",
      "title": "Growing Modes of the Free-Electron Laser and Their Bandwidth",
      "authors": [
        "G. Wang",
        "V. Litvinenko",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Tech-X",
        "Boulder",
        "Colorado",
        "USA",
        "Forty years after invention of FELs a number of fundamental questions remain unanswered. For example",
        "it is known that for a beam with a Gaussian energy distribution an infinite number of modes exist. But it is unknown how many of these modes are growing",
        "or what frequency cutoffs might exist for these growing modes? In this talk",
        "for the first time",
        "we present the proof that for typical bell-shape energy distribution in the electron beam there is no more that one growing mode - both without [1] and with space charge effects. We also present an analytical expression",
        "which determines the bandwidth of the free-electron laser. Furthermore",
        "we prove that for an energy distribution with N peaks",
        "there is no more than N FEL growing modes. Finally",
        "present a simple method of determining number of growing modes for the case of beam energy distributions with multiple peaks.",
        "[1] On Free-Electron Laser Growing Modes and their Bandwidths",
        "S. Webb",
        "V.N. Litvinenko",
        "G. Wang",
        "Submitted to PR ST-AB"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/FEL2012/talks/mooc04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/FEL2012/papers/mooc04.pdf",
      "poster_url": "https://proceedings.jacow.org/FEL2012/posters/mooc04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-FEL2012-MOOC04",
      "page_number": "33",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:33:23"
}