{
  "session_info": {
    "id": "TUOBMH",
    "name": "TUOBMH - Tu2",
    "url": "https://proceedings.jacow.org/ECRIS2014/html/tuobmh.htm"
  },
  "papers": [
    {
      "paper_id": "TUOBMH01",
      "title": "The 60 GHz 300 kW Gyrotron System for ECR Ion Source of New Generation",
      "authors": [
        "M.I. Bakulin",
        "Z.Sh. Gasajniev",
        "GYCOM Ltd",
        "Nizhny Novgorod",
        "Russia",
        "A.V. Chirkov",
        "G.G. Denisov",
        "A.G. Eremeev",
        "B.Z. Movshevich",
        "M.Y. Shmelyov",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "LPSC",
        "Grenoble Cedex",
        "France",
        "The 60 GHz Gyrotron system was specifically designed to meet the requirements of the ECR ion source prototype for production of radioactive multicharged ion beams at the Laboratoire de Physique Subatomique et de Cosmologie (LPSC). This system provides microwave power smoothly regulated from 20 kW to 300 kW in pulses from 0.05 to 1 ms with a repetition rate up to 3 Hz. The system includes a gyrotron",
        "liquid-He cryomagnet",
        "microwave quasioptical transmission line",
        "whole set of power supplies",
        "embedded controller",
        "hard-wired interlocks",
        "water-cooling subsystem. Architecture of the gyrotron system",
        "control software",
        "the user interface",
        "the main system parameters",
        "and performance in respect to output power stability will be described in the presentation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/tuobmh01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/tuobmh01.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/tuobmh01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-TUOBMH01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUOBMH02",
      "title": "Millimeter Wave Microwave Sources for Electron Cyclotron Resonance Ion Sources",
      "authors": [
        "G.G. Denisov",
        "Yu.V. Bykov",
        "A.G. Eremeev",
        "I.G. Gachev",
        "M.Yu. Glyavin",
        "V.V. Holoptsev",
        "S.V. Samsonov",
        "E.M. Tai",
        "IAP/RAS",
        "Nizhny Novgorod",
        "Russia",
        "GYCOM Ltd",
        "Nizhny Novgorod",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Two kinds of microwave sources (gyro-type devices) applicable for use in ECR ion sources are described: microwave oscillators and amplifiers. Gyrotron oscillators are capable to provide very high power (up to 1MW in CW regime) at any frequency in the millimeter wavelength range. Gyrotrons sources of moderate power are already used in several ion source setups where requested frequency and power are 24 GHz; 28 GHz and 10-15 kW/CW correspondingly. Usually gyrotron oscillator operates at one definite frequency. For special request a gyrotron can be designed for operation at two (three) frequencies or with some frequency tuning. Some pulse power gyrotrons (e.g.60 GHz/300kW) are also now under study to be applied in ion sources. Gyro-amplifiers have an instant frequency band of an amplified signal. Recent result on this activity at IAP includes realization of a CW Ka-band gyro-TWT. The best performance of this tube was obtained using an electron beam with voltage of (20+20 kV) and current of 1.4 A. In the regime of maximum instantaneous bandwidth it delivers output power within a frequency interval of 2 GHz in Ka-band with a maximum power of 7 kW. One more setup includes a Ka-band pulsed amplifier with a peak power of up to 150 kW and bandwidth of about 10% capable for operation with 10% duty factor. The gyro-TWTs are based on DC oil-cooled solenoids and single-stage depressed collectors.",
      "presentation_url": "https://proceedings.jacow.org/ECRIS2014/talks/tuobmh02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ECRIS2014/papers/tuobmh02.pdf",
      "poster_url": "https://proceedings.jacow.org/ECRIS2014/posters/tuobmh02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2014-TUOBMH02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 17:28:39"
}