{
  "session_info": {
    "id": "THYAUD",
    "name": "THYAUD - Muon Cooling II",
    "url": "https://proceedings.jacow.org/cool2015/html/thyaud.htm"
  },
  "papers": [
    {
      "paper_id": "THYAUD01",
      "title": "muCool: Towards a Much Improved Phase Space Slow Positive Muon Beam",
      "authors": [
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Over the past decades meson production facilities have been providing powerful surface muon beams to experiments with intensities of up to several 108 mu+/s. Due to the production process in dedicated targets and the limited time",
        "the phase space of these beams is generally poor. We are developing a tertiary beamline to decrease the phase space of a mu+ beam by a factor of 1010 with an efficiency of 10&#8722;3 . The idea is to stop the MeV muon beam in helium gas at cryogenic temperatures and compress the muon swarm by means of a gas density gradient and electric and magnetic fields in longitudinal and transversal dimensions. This talk will give an outline of the general principles behind the compression mechanism and give an update on the current experimental status."
      ],
      "institutions": [],
      "abstract": "Talk given on behalf of the muCool collaboration.",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/thyaud01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/thyaud01.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/thyaud01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-THYAUD01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "THYAUD02",
      "title": "Front End and HFOFO Snake for a Muon Facility",
      "authors": [
        "D.V. Neuffer",
        "Y.I. Alexahin",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "A neutrino factory or muon collider requires the capture and cooling of a large number of muons. Scenarios for capture",
        "bunching",
        "phase-energy rotation and initial cooling of muonss produced from a proton source target have been developed for neutrino factory and Muon Collider designs. The baseline scenarios requires a drift section from the target",
        "a bunching section and a phase-energy rotation section leading into the cooling channel. The currently preferred cooling channel design is an 'HFOFO Snake' configuration that cools both μ+ and μ- transversely and longitudinally. The status of the design is presented and variations are discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/thyaud02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/thyaud02.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/thyaud02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-THYAUD02",
      "page_number": "150",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THYAUD03",
      "title": "Rectilinear Channel for Muon Cooling Towards Micron Scale Emittances",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Generation of bright muon sources requires a reduction of the six-dimensional emittance of the captured muon beam by several orders of magnitude. In this study",
        "we present a new cooling scheme that should meet this requirement. First",
        "we present the conceptual design of our proposed scheme wherein we detail its basic features. Then",
        "we present the first end-to-end simulation of 6D cooling for a Muon Collider and show a notable reduction of the 6D emittance by five orders of magnitude. Finally",
        "we examine the influence of space-charge fields on the cooling process and present a space-charge compensation solution by means of increasing the rf gradient. We establish a quantitative relationship between the required compensation gradient and bunch charge."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/cool2015/talks/thyaud03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/cool2015/papers/thyaud03.pdf",
      "poster_url": "https://proceedings.jacow.org/cool2015/posters/thyaud03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-COOL2015-THYAUD03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 17:21:17"
}