{
  "session_info": {
    "id": "SUPAG",
    "name": "SUPAG - Sunday Parallel Grand Ballroom",
    "url": "https://proceedings.jacow.org/icap2018/html/supag.htm"
  },
  "papers": [
    {
      "paper_id": "SUPAG01",
      "title": "Space Charge and Transverse Instabilities at the CERN SPS and LHC",
      "authors": [
        "E. Métral",
        "D. Amorim",
        "G. Arduini",
        "H. Bartosik",
        "E. Benedetto",
        "H. Burkhardt",
        "K.S.B. Li",
        "A. Oeftiger",
        "D. Quatraro",
        "G. Rumolo",
        "B. Salvant",
        "C. Zannini",
        "CERN",
        "Geneva",
        "Switzerland",
        "At the CERN accelerator complex",
        "it seems that only the highest energy machine in the sequence",
        "the LHC",
        "with space charge (SC) parameter close to one",
        "sees the predicted beneficial effect of SC on transverse coherent instabilities. In the other circular machines of the LHC injector chain (PSB",
        "PS and SPS)",
        "where the SC parameter is much bigger than one",
        "SC does not seem to play a major (stabilising) role",
        "and it is maybe the opposite in the SPS. All the measurements and simulations performed so far in both the SPS and LHC will be reviewed and analysed in detail."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/supag01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/supag01.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/supag01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SUPAG01",
      "page_number": "80",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPAG02",
      "title": "Fast Multipole Methods for Multiparticle Simulations",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The fast multipole method (FMM) reduces the computation cost of the pairwise non-oscillating interaction between N particles from O(N2) to O(N). In the FMM",
        "the contribution from a source particle is represented as a multipole expansion",
        "while the contributions from multiple faraway sources can be combined into a local expansion around an objective particle. Without the dependence on a grid covering the whole domain under study",
        "the FMM treats any charge distribution and geometry in a natural way. It avoids artificial smoothing due to the grid size and redundant computation on the free space grids. We will introduce the concept of the FMM using the Coulomb interaction as an example and then explain how the FMM can be extended to arbitrary non-oscillating interactions. Examples and discussions on how the FMM can be used in scientific simulations",
        "especially in accelerator physics will also be provided."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/supag02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/supag02.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/supag02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SUPAG02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "SUPAG03",
      "title": "Challenges in Extracting Pseudo-Multipoles From Magnetic Measurements",
      "authors": [
        "S. Russenschuck",
        "G. Caiafa",
        "L. Fiscarelli",
        "M. Liebsch",
        "C. Petrone",
        "P. Rogacki",
        "CERN",
        "Geneva",
        "Switzerland",
        "Extracting the coefficients of Fourier-Bessel series",
        "known as pseudo-multipoles or generalized gradients",
        "from magnetic measurements of accelerator magnets involves technical and mathematical challenges. First",
        "a novel design of a short",
        "rotating-coil magnetometer is required that does not intercept any axial field component of the magnet. Moreover",
        "displacing short magnetometers",
        "step-by-step along the magnet axis",
        "yields a convolution of the local multipole field errors and the sensitivity (test function) of the induction coil. The deconvolution must then content with the low signal-to-noise ratio of the measurands",
        "which are integrated voltages corresponding to spatial flux distributions. Finally",
        "the compensation schemes",
        "as implemented on long coils used for measuring the integrated field harmonics",
        "cannot be applied to short magnetometers. All this requires careful design of experiment to derive the optimal length of the induction coil",
        "the step size of the scan",
        "and the highest order of pseudo-multipoles in the field reconstruction. This paper presents the theory of the measurement method",
        "the data acquisition and deconvolution",
        "and the design and production of a saddle-shaped",
        "rotating-coil magnetometer."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/supag03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/supag03.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/supag03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SUPAG03",
      "page_number": "87",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPAG04",
      "title": "Lightsource Unified Modeling Environment (LUME), a Start-to-End Simulation Framework for Electrons and Photons",
      "authors": [
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "Since first light at LCLS",
        "there has been continuous invention of new operating modes",
        "introduction of new optical elements",
        "and apid improvement in detectors. While these improvements have led to new experiments with much greater scientific impacts",
        "their transfer to user operations has often taken several experimental runs (many months to years). The integration of these technical advances into scientific programs would be greatly accelerated by a modeling tool that allowed for quantitative assessment of the impact on scientific programs of facility improvements. To this end",
        "SLAC is developing the Lightsource Unified Modeling Environment (LUME) for unified modeling of X-ray free electron laser (XFEL) performance. This modeling tool will be built in several stages with an initial focus on quantitative prediction of critical parameters of the X-ray pulses delivered to experimental stations. This initial development will be followed by incorporation of X-ray-sample interaction and detector performance. This project will take a holistic approach starting with the simulation of the electron beams",
        "to the production of the photon pulses and their transport through the optical components of the beamline",
        "their interaction with the samples and the simulation of the detectors",
        "followed by the analysis of simulated data. LUME will leverage existing",
        "well-established codes [Astra",
        "Bmad",
        "Elegant",
        "Genesis",
        "Impact for electrons",
        "Genesis 1.3 for FEL simulation",
        "and the \"Synchrotron Radiation Workshop\" (SRW) for X-ray optics] that will be driven and configured by a coherent high-level framework. The high-level framework will build on the Simex platform being developed by the European Cluster of Advanced Laser Light Sources (EUCALL). The platform will be built with an open",
        "well-documented architecture so that science groups around the world can contribute specific experimental designs and software modules",
        "advancing both their scientific interests and a broader knowledge of the"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/supag04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/supag04.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/supag04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SUPAG04",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "SUPAG05",
      "title": "Muon Background Studies for Beam Dump Operation of the K12 Beam Line at CERN",
      "authors": [
        "M.S. Rosenthal",
        "D. Banerjee",
        "J. Bernhard",
        "M. Brugger",
        "N. Charitonidis",
        "B. Döbrich",
        "L. Gatignon",
        "A. Gerbershagen",
        "E. Montbarbon",
        "B. Rae",
        "M.W.U. Van Dijk",
        "CERN",
        "Geneva",
        "Switzerland",
        "INFN/LNF",
        "Frascati",
        "Italy",
        "In the scope of the Physics Beyond Colliders study at CERN a future operation of the NA62 experiment in beam dump mode is discussed",
        "enabling the search for dark sector particles",
        "e.g. heavy neutral leptons",
        "dark photons and axions. For this purpose",
        "the 400 GeV/c primary proton beam",
        "extracted from the SPS",
        "will be dumped on a massive dump collimator located in the front end of the K12 beam line. Muons originating from interactions and decays form a potential background for this kind of experiment. To reduce this background",
        "magnetic sweeping within the beam line is employed. In this contribution",
        "the muon production and transport has been investigated with the simulation framework G4beamline. The high computational expense of the muon production has been reduced by implementing sampling methods and parametrizations to estimate the amount of high-energy muons and efficiently study optimizations of the magnetic field configuration. These methods have been benchmarked with measured data",
        "showing a good qualitative agreement. Finally",
        "first studies to reduce the muon background by adapting the magnetic field configuration are presented",
        "promising a potential background reduction by a factor four."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/supag05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/supag05.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/supag05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SUPAG05",
      "page_number": "93",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPAG06",
      "title": "Simulation Challenges  for eRHIC Beam-Beam Study",
      "authors": [
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "FRIB",
        "East Lansing",
        "USA",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "The 2015 Nuclear Science Advisory Committee Long Rang Plan identified the need for an electron-ion collider facility as a gluon microscope with capabilities beyond those of any existing accelerator complex. To reach the required high energy",
        "high luminosity",
        "and high polarization",
        "the eRHIC design based on the existing heady ion and polarized proton collider RHIC adopts a very small beta-function at the interaction point",
        "a high collision repetition rate",
        "and a novel hadron cooling scheme. Collision with a full crossing angle of 22 mrad and crab cavities for both electron and proton rings are required. In this article",
        "we will present the high priority R&D items related to beam-beam interaction for the current eRHIC design",
        "the simulation challenges",
        "and our plans to address them."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/supag06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/supag06.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/supag06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SUPAG06",
      "page_number": "99",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPAG07",
      "title": "SHINE: Shanghai High Rep-rate XFEL and Extreme Light Facility",
      "authors": [
        "SINAP",
        "Shanghai",
        "People’s Republic of China",
        "ShanghaiTech University",
        "Shanghai",
        "People’s Republic of China",
        "SHINE (Shanghai High Rep-rate XFEL and Extreme Light Facility) is a Free Electron Laser facility providing intense x-ray photons at soft and hard X-ray regimes with high repetition rate up to 1 MHz. This new facility is located at Zhangjiang National Comprehensive Science Center",
        "Shanghai",
        "where also hosts other large facilities on photon science including Shanghai Synchrotron Radiation Facility (SSRF) and Soft X-ray Free Electron Laser Facility (SXFEL). With an overall length of about 3.1km the SHINE facility consists a linear accelerator yielding up to 8 GeV electorn beam",
        "3 long FEL undulator lines producing 0.4-25 keV coherent photons and 10 endstations for user experiments. The ground breaking of project took place in April",
        "2018. This talk will present the status of SHINE facility with an emphasis on accelerator machine."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/supag07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/supag07.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/supag07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SUPAG07",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "SUPAG08",
      "title": "Machine Learning for X-Ray Free-Electron Lasers",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "X-ray Free Electron Lasers (XFELs) are among the most complex accelerator projects in the world today. With large parameter spaces",
        "sensitive dependence on beam quality",
        "huge data rates",
        "and challenging machine protection",
        "there are expanding opportunities to apply machine learning (ML) to XFEL operation. In this talk I will summarize some promising ML methods for XFELs",
        "and highlight recent examples of successful applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/supag08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/supag08.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/supag08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SUPAG08",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "SUPAG09",
      "title": "Beam Dynamics Simulations of Medical Cyclotrons and Beam Transfer Lines at IBA",
      "authors": [
        "J. van de Walle",
        "E. Forton",
        "W.J.G.M. Kleeven",
        "J. Mandrillon",
        "V. Nuttens",
        "E. Van Der Kraaij",
        "IBA",
        "Louvain-la-Neuve",
        "Belgium",
        "The company Ion Beam Applications (IBA)",
        "based in Belgium",
        "is specialized in the design and fabrication of cyclotrons for medical applications since more than 30 years. Two main classes of cyclotrons can be distinguished : cyclotrons for radiopharma production (3 MeV up to 70 MeV proton beams) and cyclotrons used in proton therapy (230 MeV proton beam). In this contribution",
        "the developments of computational tools to simulate beam dynamics in the variety of cyclotrons and associated beam lines will be described. The main code for simulating the cyclotron beam dynamics is the ’Advanced Orbit Code’ (AOC) [1]. Examples will be shown of beam dynamics studies in the newly designed Cyclone KIUBE (18 MeV proton cyclotron for PET isotope production)",
        "the Cyclone230 and the superconducting synchro-cyclotron (S2C2)",
        "both 230 MeV proton cyclotrons for proton therapy. Calculated beam emittances",
        "resonance crossings and beam losses will be shown and their impact on the performance of the machine will be highlighted. A strong emphasis will be put on the beam properties from the S2C2 (proton therapy cyclotron)",
        "since unexpected extracted proton beam was discovered and explained by detailed simulations [2] and the beam properties serve as input to subsequent beam line simulation tools. Several tools have been developed to simulate and design transfer lines coupled to the cyclotrons. In radiopharma applications beam losses along the beamline and the beam size on the production target are crucial",
        "since beam intensities are high and radiation damage can be considerable. In proton therapy",
        "beam intensities are very low but the constraints on the beam position",
        "drift (in position",
        "energy and intensity) and size at the patient level are very tight. In both cases a strong predictive power of the calculated beam properties in the transfer lines is needed. The compact proton gantry (CGTR) coupled with the S2C2 in the ProteusONE proton therapy system will be shown in detail. The CGTR is a s",
        "[1] W. Kleeven et al.",
        "IPAC 2016 proceedings"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/supag09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/supag09.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/supag09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SUPAG09",
      "page_number": "104",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPAG10",
      "title": "Design Study of a Fast Kicker Magnet Applied to the Beamline of a Proton Therapy Facility",
      "authors": [
        "Huazhong University of Science and Technology",
        "State Key Laboratory of Advanced Electromagnetic Engineering and Technology",
        "Hubei",
        "People’s Republic of China",
        "X. Liu",
        "B. Qin",
        "HUST",
        "Wuhan",
        "People’s Republic of China",
        "A proton therapy facility based on an isochronous superconducting cyclotron is under development in HUST (Huazhong University of Science and Technol-ogy). A fast kicker magnet will be installed in the up-stream of the degrader to perform the beam switch function by kicking the proton beam to the down-stream beam stop. The rising and falling time of the kicker is about 100us",
        "and the maximum repetition rate is 500Hz. This paper introduces simulation and opti-mization of the eddy current and dynamic magnetic field of the fast kicker",
        "by using FEM code OPERA-3D. For kicker materials",
        "laminated steel and soft ferrite are compared and the MnZn ferrite is chosen. Design-ing considerations includes the eddy current effect",
        "field hysteresis",
        "and mechanical structure of the kicker will also be introduced."
      ],
      "institutions": [
        "Funding: Huazhong University Of Science And Technology"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/supag10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/supag10.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/supag10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SUPAG10",
      "page_number": "110",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "SUPAG11",
      "title": "Seamless Beam and Radiation Transport Simulations of IBA Proteus Systems Using BDSIM",
      "authors": [
        "R. Tesse",
        "A. Dubus",
        "E. Gnacadja",
        "C. Hernalsteens",
        "N. Pauly",
        "ULB - FSA - SMN",
        "Bruxelles",
        "Belgium",
        "S.T. Boogert",
        "L.J. Nevay",
        "W. Shields",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "IBA",
        "Louvain-la-Neuve",
        "Belgium",
        "The precise modeling of proton therapy systems is challenging and requires simulation tools that have capabilities in both beam transport and in the detailed description of particle-matter interactions. Current separate simulations such as those of optical codes or Monte-Carlo transport through discrete elements show their limitations due to the very strict requirements on beam quality at the isocenter. This is particularly relevant with the development of compact systems where the coupling between the components is dominant. For such systems the design of the concrete shielding",
        "which has a large impact on the total cost of the system",
        "is of primary importance. Beam Delivery Simulation (BDSIM) allows the seamless simulation of the transport of particles in a beamline and its surrounding environment. A complete 3D model is built using Geant4",
        "CLHEP and ROOT to provide an extensive insight into beam loss",
        "its interaction and subsequent radiation. This capability is applied to the IBA eye treatment proton therapy machine and to the IBA Proteus One compact system. We discuss the validation of both models against experimental data. In particular",
        "we use it to predict lateral profiles and energy spectra using a detailed geometry of the eye-treatment beam forming nozzle. For the Proteus One system",
        "we present results on the activation of the concrete shielding of the system estimated for a period of 20 years of operation obtained for the first time using end-to-end simulations of the transport of protons in the beamline and their interactions with the environment."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/supag11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/supag11.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/supag11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SUPAG11",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "SUPAG12",
      "title": "Quantum Statistical Properties of Free Electron Laser With a Planar Wiggler and Ion-Channel Guiding",
      "authors": [
        "Farhangian University",
        "Tehran",
        "Iran",
        "An analysis of the free-electron lasers (FELs) with a planar wiggler and in the presence of ion-channel guiding",
        "has been carried out using a Hamiltonian quantum field theory. The quantum Hamiltonian of single a particle has been derived in the Bambini-Renieri (BR) frame [1-5]. The equations are valid in a reference frame",
        "moving with a relativistic velocity with respect to the laboratory frame",
        "chosen in such a way that the carrier frequency of the pulse equals the pseudoradiation (wiggler) field frequency. In this reference frame",
        "the equations assume a simple non-relativistic form. Time-dependent wave function and three constants of motion are obtained. The Wei-Norman [2] Lie algebraic approach has been employed to solve exactly the spherical Raman-Nath equation (SRNE) [3-5]. A quantum approach has been used to get photon gain",
        "photon statistics and squeezing properties of a FEL. The quantum statistical properties have also been studied numerically.",
        "[1]H. Mehdian",
        "M. Alimohamadi",
        "etal",
        "J.Plasma. Phys. 78 (5)",
        "537-544(2012). [2] J. Wei",
        "E. Norman",
        "J. Math. Phys. A 4",
        "575 (1963).[3] M. Alimohamadi",
        "et al",
        "J. Fus. Energy 31 (5)",
        "463-466(2012).",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/icap2018/talks/supag12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/icap2018/papers/supag12.pdf",
      "poster_url": "https://proceedings.jacow.org/icap2018/posters/supag12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ICAP2018-SUPAG12",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 12,
  "scrape_time": "2025-10-10 18:30:43"
}