{
  "session_info": {
    "id": "WEAO",
    "name": "WEAO - Status reports and new development III",
    "url": "https://proceedings.jacow.org/ecris2016/html/weao.htm"
  },
  "papers": [
    {
      "paper_id": "WEAO01",
      "title": "Recent Developments with the GTS-LHC ECR Ion Source at CERN",
      "authors": [
        "V. Toivanen",
        "G. Bellodi",
        "C. Fichera",
        "D. Küchler",
        "A.M. Lombardi",
        "M. Maintrot",
        "A.I. Michet",
        "M. O'Neil",
        "S. Sadovich",
        "F.J.C. Wenander",
        "CERN",
        "Geneva",
        "Switzerland",
        "JYFL",
        "Jyväskylä",
        "Finland",
        "Linac3 is the first link in the chain of accelerators providing highly charged heavy ion beams for the CERN experimental program. The beams",
        "predominantly lead",
        "are produced with the GTS-LHC 14.5 GHz Electron Cyclotron Resonance (ECR) ion source",
        "operated in afterglow mode. In the framework of the LHC Injector Upgrade program (LIU)",
        "several activities have been carried out to improve the GTS-LHC and Linac3 performance",
        "in terms of delivered beam current. The extraction region of the GTS-LHC has been upgraded with redesigned apertures and the addition of an einzel lens",
        "yielding improved Linac3 output. Also",
        "a series of measurements has been performed to study the effects of two-frequency heating on the performance of the GTS-LHC. A Traveling Wave Tube Amplifier (TWTA) with variable frequency and pulse pattern was utilized as a secondary microwave source. The two-frequency effect commonly reported with CW operation of ECR ion sources boosting high charge state ion production was also observed in afterglow mode. Lastly",
        "for studies of metal ion beam production",
        "a dedicated test stand has been assembled to characterize the GTS-LHC resistively heated miniature oven performance."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao01.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO01",
      "page_number": "50",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAO02",
      "title": "Preliminary Design of a Hybrid Ion Source for 7Li+3 Generation",
      "authors": [
        "S.X. Peng",
        "J.E. Chen",
        "Z.Y. Guo",
        "H.T. Ren",
        "J.M. Wen",
        "W.B. Wu",
        "Y. Xu",
        "A.L. Zhang",
        "J.F. Zhang",
        "T. Zhang",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "Graduate University",
        "Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "University of Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "To provide a novel directional fast-neutron via the p(7Li",
        "n) reaction for prompt fission γ -ray (PFG) spectra study",
        "a hybrid 7Li3+ ion source was designed at Peking University(PKU). It is a combination of a 6.5 GHz ECR (electron cyclotron resonance) ion source and a hot surface ionization source. The surface ionization source locates inside the ECR chamber and a 500 V bias voltage is set between the hot surface and the ECR chamber. Lithium vapor from an oven is guided into the surface source through a heating transfer pipe. Li+ ions generated on the hot surface will be extracted from the surface source and striped into Li3+ with the electron impact ionization. To avoid the lithium vapor attaching on the wall of the discharge chamber",
        "the whole plasma chamber will be heated up to 300 °C. A four-electrode extraction system will be used for Li3+ ion beam formation. Details will be presented in the paper.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao02.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO02",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEAO03",
      "title": "Practical Comparison of Two-Frequency Heating Phenomena in Different ECR Ion Sources",
      "authors": [
        "NIRS",
        "Chiba-shi",
        "Japan",
        "S. Biri",
        "R. Rácz",
        "ATOMKI",
        "Debrecen",
        "Hungary",
        "Osaka University",
        "Graduate School of Engineering",
        "Osaka",
        "Japan",
        "National Institute of Radiological Sciences",
        "Chiba",
        "Japan",
        "AEC",
        "Chiba",
        "Japan",
        "In order to improve highly-charged ion production from the 18GHz NIRS-HEC ECRIS",
        "our group has studied the mixture of two microwaves of which the frequencies were close together each. Our conclusion was that when an additional microwave is added to the primary microwave",
        "the plasma stability is improved. The output current of the highly charged ion beam was proportional to the total power of both microwaves. The dependence on the additional frequency showed the fine structure. Since this structure depended on the magnetic field",
        "vacuum pressure",
        "and so on",
        "the precise frequency adjustment for maximum output was required under each condition. Our interest is whether the above-mentioned phenomenon can be demonstrated using a different ion source where the two frequencies are even far from each other. We installed a 17.75-18.25 GHz microwave system in addition to the 14.3 GHz klystron amplifier of the ATOMKI ECRIS. Argon output currents at various values of the microwave power and frequency were studied. The dependence on the total power shows the similar tendency as at NIRS. The dependence on the additional frequency also shows the fine structure. Detailed data will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao03.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO03",
      "page_number": "55",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEAO04",
      "title": "Installation and Commissioning of the 18 GHz High Temperature Superconducting Ecr Ion Source and Low Energy Beam Transport  System on a 200 kV High Voltage Platform",
      "authors": [
        "G.O. Rodrigues",
        "R. Ahuja",
        "P. Barua",
        "D. Kanjilal",
        "A. Kothari",
        "A. Malyadri",
        "A. Mandal",
        "Y.M. Mathur",
        "U.K. Rao",
        "A. Sharma",
        "IUAC",
        "New Delhi",
        "India",
        "The High Current Injector programme at the Inter University Accelerator Centre is presently in various stages of installation and commissioning. The main objective of the high current injector is to provide higher beam intensities (A/q ~ 6) over a wider mass range as compared to the presently operating 15UD",
        "16MV Tandem-LINAC combination. The injector is based on a reasonably high performing ECR ion source called PKDELIS. The 18 GHz high temperature superconducting ECR ion source",
        "PKDELIS and the low energy beam transport system has been recently installed and commissioned on a 200 kV high voltage platform. The details of the installation and commissioning results will be presented.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao04.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO04",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEAO05",
      "title": "SMASHI and MeLA ECR Ion Source at NFRI: One for Highly-Charged Ions and the Other for High Current Metal Ions",
      "authors": [
        "H.J. You",
        "W.I. Choo",
        "S.O. Jang",
        "NFRI",
        "Daejon",
        "Republic of Korea",
        "There are two type of ECR ion sources at NFRI. One is SMASHI(Superconducting Multi-Application Source of Highly-charged Ions)",
        "and the other MeLA(Magnet-embedded Lisitano Antenna) ion source. They are developed for highly-charged ions(HCI) and high current metal ions(HCMI) generation",
        "respectively. Firstly",
        "SMASHI is a 18 GHz superconducting ECR ion source",
        "which will be dedicated for future application of HCIs and matter interaction. SMASHI is featuring a liquid helium-free SC magnet having fast-excitation capability(>0.1 A/s) of coils",
        "two frequency heating(18",
        "18+Δ GHz)",
        "remotely-positional variable gap extraction system",
        "and two diagnostic ports for the extraction region. Secondly",
        "MeLA ion source is a scalable high current(>10 mA) metal ion source. the MeLA*",
        "originally developed for a large-area microwave ECR plasma source for semiconductor processing by our group",
        "is able to generate high density uniform ECR plasma by a waveguide directly-coupled and permanent Magnet-embedded Lisitano Antenna. In this presentation we describe design aspects of the sources in detail",
        "and then their performance results are provided.",
        "*H. J. You",
        "S. O. Jang",
        "Y. H. Jung",
        "and B. J. Lee",
        "\"Microwave Antenna for Generating Plasma\"",
        "U.S. Patent 8 648 534",
        "February",
        "2014."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ecris2016/talks/weao05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ecris2016/papers/weao05.pdf",
      "poster_url": "https://proceedings.jacow.org/ecris2016/posters/weao05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-ECRIS2016-WEAO05",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 5,
  "scrape_time": "2025-10-10 17:27:39"
}