{
  "session_info": {
    "id": "FRIOB",
    "name": "FRIOB - Closing session",
    "url": "https://proceedings.jacow.org/LINAC2014/html/friob.htm"
  },
  "papers": [
    {
      "paper_id": "FRIOB01",
      "title": "Positive Trends in Radiation Risk Assessment and Consequent Opportunities for Linac Applications",
      "authors": [
        "Falcon Analytics",
        "Netanya",
        "Israel",
        "Ionizing radiation",
        "an unavoidable by-product of high-energy LINACs",
        "makes them subject to strict regulation and severe public concerns. During the last two decades the attitude to ionizing radiation hazards has been becoming more balanced",
        "as opposed to the historical \"radiophobia\". The linear no-threshold hypothesis (LNTH)",
        "based on the assumption that every radiation dose increment constitutes increased cancer risk for humans",
        "is more and more debated. In particular",
        "the recent memorandum of the International Commission on Radiological Protection admits that the LNTH predictions at low doses are \"speculative",
        "unproven",
        "undetectable and \"phantom'.\" Moreover",
        "numerous experimental",
        "ecological",
        "and epidemiological studies show that low doses of ionizing radiation may be beneficial to human health. While these advances in scientific understanding have not yet given fruit regarding radiation regulation and policy",
        "we are hopeful these may happen in near to middle term. The presentation reviews the present status of the low-dose radiation-hazard debate. It also outlines anticipated opportunities for LINAC applications",
        "especially in the prospective field of low-dose radiation therapy."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/LINAC2014/talks/friob01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/LINAC2014/papers/friob01.pdf",
      "poster_url": "https://proceedings.jacow.org/LINAC2014/posters/friob01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2014-FRIOB01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRIOB02",
      "title": "Proton and Carbon Linacs for Hadron Therapy",
      "authors": [
        "A. Degiovanni",
        "U. Amaldi",
        "TERA",
        "Novara",
        "Italy",
        "CERN",
        "Geneva",
        "Switzerland",
        "Beams of 200 MeV protons and 400 MeV/u fully stripped carbon ions are used for the treatment of solid tumours seated at a maximum depth of 27 cm. More than 100’000 patients have been treated with proton beams and more than 10’000 with carbon ions. Very low proton currents - of the order of 1 nA - are enough to deliver the typical dose of 2 Gy/l in one minute. In the case of carbon ions the currents are of the order of 0.1-0.2 nA. For this reason 3 GHz linacs are well suited in spite of the small apertures and low duty cycle. The main advantage of linacs",
        "pulsing at 200-400 Hz",
        "is that the output energy can be continuously varied pulse-by-pulse and in 2-3 min a moving tumour target can be covered about 10 times by deposing the dose in many thousands of ‘spots’. High frequency hadron therapy linacs have been studied in the last 20 years and are now being built as hearts of proton therapy centres",
        "while carbon ion linacs are still in the designing stage. At present the main challenges are the reduction of the footprint of compact ‘single-room’ proton machines and the power efficiency of dual proton and carbon ions ‘multi-room’ facilities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/LINAC2014/talks/friob02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/LINAC2014/papers/friob02.pdf",
      "poster_url": "https://proceedings.jacow.org/LINAC2014/posters/friob02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2014-FRIOB02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRIOB03",
      "title": "Prospects for Accelerator-Driven Thorium Systems",
      "authors": [
        "iThEC",
        "Geneva",
        "Switzerland",
        "To meet the tremendous world energy needs",
        "systematic R&D has to be pursued to replace fossil fuels. Nuclear energy",
        "which produces no green house gases and no air pollution",
        "should be a leading candidate. How nuclear energy",
        "based on thorium rather than uranium",
        "could be an acceptable solution is discussed. Thorium can be used both to produce energy or to destroy nuclear waste. The thorium conference",
        "organized by iThEC at CERN in October 2013",
        "has shown that thorium is seriously considered by developing countries as a key element of their energy strategy. However",
        "developed countries do not seem to move in that direction",
        "while global cooperation is highly desirable in this domain. As thorium is not fissile",
        "an elegant option is to use a proton accelerator to drive an “Accelerator Driven System (ADS)”",
        "as suggested by Nobel Prize laureate Carlo Rubbia. Therefore",
        "the accelerator community has an important challenge to meet: provide the required proton beam for ADS."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/LINAC2014/talks/friob03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/LINAC2014/papers/friob03.pdf",
      "poster_url": "https://proceedings.jacow.org/LINAC2014/posters/friob03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-LINAC2014-FRIOB03",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 23:20:40"
}