{
  "session_info": {
    "id": "WEPD",
    "name": "WEPD - Poster Wednesday",
    "url": "https://proceedings.jacow.org/pcapac2012/html/wepd.htm"
  },
  "papers": [
    {
      "paper_id": "WEPD01",
      "title": "Data Logging System Upgrade for Indus Accelerator",
      "authors": [
        "R. Mishra",
        "R.K. Agrawal",
        "P. Fatnani",
        "B.N. Merh",
        "C.P. Navathe",
        "RRCAT",
        "Indore (M.P.)",
        "India",
        "VECC",
        "Kolkata",
        "India",
        "An accelerator has various subsystems like Magnet Power Supply",
        "Beam Diagnostics and Vacuum etc. that are required to work in a stable manner to ensure required machine performance. Logging of system parameters at a faster rate plays a crucial role in analysing and understanding machine behaviour. Logging all the machine parameters consistently at the rate of typically more than 1 Hz has been the aim of a recent data logging system upgrade. Nearly ten thousand parameters are being logged at varying intervals of one second to one minute in Indus accelerator complex. The present logging scheme is augmented to log all these parameters at a rate equal to or more than 1 Hz. The database schema is designed according to data type of the parameter. The data is distributed into historical table and intermediate table comprising of recent data. Machine control applications read the parameter values from the control system and store them into the text-files of finite time duration for each sub-system. The logging application of each subsystem passes these text files to database for bulk insertion. The detail design of database",
        "logging scheme and its architecture is presented in the paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd01.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD01",
      "page_number": "12",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD03",
      "title": "Control System Studio Archiver with PostgreSQL Backend: Optimizing Performance and Reliability for a Production Environment",
      "authors": [
        "M. Konrad",
        "C. Burandt",
        "J. Enders",
        "N. Pietralla",
        "TU Darmstadt",
        "Darmstadt",
        "Germany",
        "Archiving systems based on relational databases (RDB) provide a higher flexibility with regard to data retrieval and analysis than the traditional EPICS Channel Archiver. On the other hand they can suffer from poor performance compared to the Channel Archiver for simple linear data retrieval operations. However",
        "careful tuning of the database management system's configuration can lead to major performance improvements. Special care must be taken to ensure data integrity following power outages or hardware failures. This contribution describes the hardware and software configuration of an archiving system used in the production environment at the S-DALINAC. It covers performance and reliability aspects of the hardware as well as tuning of the Linux operating system and PostgreSQL server optimizations."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd03.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD03",
      "page_number": "15",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD09",
      "title": "Fast Data Acquisition System for Booster Supplies Readback",
      "authors": [
        "K. Saifee",
        "A. Chauhan",
        "P. Fatnani",
        "P. Gothwal",
        "C.P. Navathe",
        "RRCAT",
        "Indore (M.P.)",
        "India",
        "The booster synchrotron at RRCAT is used to inject electron beam in Synchrotron Radiation Sources Indus-1 & Indus-2. The booster gets 20 MeV beam from Microtron",
        "ramps up its energy to 450/550 MeV which is then extracted for injection in Indus-1/Indus-2. The ramping cycle repeats every second. For this",
        "various magnet power supplies are fed with synchronous reference voltage & current waveforms and accordingly they feed the magnets with current waveforms of ~800 msec. A system was required to synchronously capture data of all power supplies to analyze changes on cycle to cycle basis. Global data acquisition system polling data at 1 Hz can't acquire sufficient points to do this. So a VME and PC based system has been developed for parallel and fast capture of data from 13 such power supplies. VME station has a CPU",
        "13 ADC cards and one control card. User can select- permit to capture",
        "start delay",
        "samples and time interval between samples. Advantages are' Isolated",
        "simultaneous capturing on 13-channels",
        "capturing synchronized with an event and selectable capturing-rate and samples. It involved reconfiguring ADC boards",
        "developing RTOS OS-9 Device Driver & programs for CPU Board and GUI for PC using LabVIEW."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd09.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD09",
      "page_number": "18",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPD10",
      "title": "Embedded CAMAC Controller: Hardware/Software Co-optimization for High Throughput",
      "authors": [
        "P.M. Nair",
        "A. Behere",
        "M.P. Diwakar",
        "K. Jha",
        "C.K. Pithawa",
        "P. Sridharan",
        "BARC",
        "Trombay",
        "Mumbai",
        "India",
        "Advances in technology have resulted in availability of low-power",
        "low form-factor embedded PC based modules. The Embedded CAMAC Controller (ECC) is designed with ETX standard Single Board Computer having PC architecture with Ethernet connectivity. The paper highlights the software and hardware design optimizations to meet high throughput requirements of multi-parameter experiments and scan mode accelerator control applications. The QNX based software is designed for high throughput by adopting design strategies like multi-threaded architecture",
        "interrupt-driven data transfer",
        "buffer pool for burst data",
        "zero memory copy",
        "lockless primitives and batched event data transfer to host. The data buffer and all control logic for CAMAC cycle sequencing for LIST mode is implemented entirely in hardware in Field Programmable Gate Array (FPGA). Through this design",
        "sustained throughput of 1.5MBps has been achieved. Also",
        "the host connectivity through Ethernet link enables support for multi-crate configuration",
        "thus providing scalability. The ECC has been installed for accelerator control at FOTIA BARC",
        "Pelletron and LINAC Pelletron TIFR and for multi-parameter experiments at NPD."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd10.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD10",
      "page_number": "20",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPD11",
      "title": "Client Server Architecture Based Embedded Data Acquisition System on PC104",
      "authors": [
        "J.J. Patel",
        "P.K. Chattopadhyay",
        "R. Jha",
        "P. Kumari",
        "R. Rajpal",
        "IPR",
        "Bhat",
        "Gandhinagar",
        "India",
        "The data acquisition system is designed on embedded PC104 platform Single Board Computer (SBC) with running Windows XP Embedded operating system. This is a multi channel system which consists of 12 Bit",
        "10 MSPS Analog to Digital Converters with on board FIFO memory for each channel. The digital control and PC104 bus interface logic are implemented using Very High Speed Hardware Description Language (VHDL) on Complex Programmable Logic Device (CPLD). The system has provision of software",
        "manual as well as isolated remote trigger option. The Client Server based application is developed using National Instrument CVI for remote continuous and single shot data acquisition for basic plasma physics experiments. The software application has features of remote settings of sampling rate",
        "selection of operation mode",
        "data analysis using plot and zoom features. The embedded hardware platform can be configured to be used in different way according to the physics experiment requirement by different top level software architecture. The system is tested for different physics experiments. The detailed hardware and software design",
        "development and testing results will be discussed in the paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd11.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD11",
      "page_number": "23",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD12",
      "title": "A Large Channel Count Multi Client Data Acquisition System for Superconducting Magnet System of SST-1",
      "authors": [
        "K.J. Doshi",
        "J.A. Dhongde",
        "Y.S. Khristi",
        "H.A. Masand",
        "B.A. Parghi",
        "D.A. Patel",
        "S. Pradhan",
        "U.A. Prasad",
        "A.N. Sharma",
        "P.A. Varmora",
        "IPR",
        "Bhat",
        "Gandhinagar",
        "India",
        "The magnet system of the steady-state superconducting tokamak-1 at the Institute for Plasma Research",
        "Gandhinagar",
        "India",
        "consists of sixteen Toroidal field and nine poloidal field Superconducting coils together with a pair of resistive PF coils",
        "an air core ohmic transformer and a pair of vertical field coils. These coils are instrumented with various cryogenic grade sensors and voltage taps to monitor it's operating status and health during different operational scenarios. A VME based data acquisition system with remote system architecture is implemented for data acquisition and control of the complete magnet operation. Client-Server based architecture is implemented with remote hardware configuration and continuous online/ offline monitoring. A JAVA based platform independent client application is developed for data analysis and data plotting. The server has multiple data pipeline architecture to send data to storage database",
        "online plotting application",
        "Numerical display screen",
        "and run time calculation. This paper describes software architecture",
        "design and implementation of the data acquisition system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd12.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD12",
      "page_number": "26",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD13",
      "title": "Serial Multiplexed Based Data Acquisition and Control System",
      "authors": [
        "N.C. Patel",
        "C.K. Chavda",
        "K.G. Patel",
        "IPR",
        "Bhat",
        "Gandhinagar",
        "India",
        "Data acquisition and control system consist of analog to digital converter",
        "digital to analog converter",
        "timer",
        "counter",
        "pulse generation",
        "digital input / output etc depending upon requirement. All the components of the system must communicate with personal computer (PC) for data and control signal transmission using any one of the communication protocol like Serial",
        "Parallel",
        "USB",
        "and GPIB etc. Serial communication is advantageous over other protocol like long distance data transmission",
        "less number of physical connection",
        "ease of implementation etc. The developed serial multiplexed system can control different module like ADC (for a small analog channel density",
        "moderate sampling rate and local on-board memory) module",
        "DAC (for controlling pressure valve",
        "biasing voltage etc) module",
        "DIO ( for system status monitoring and status control) module",
        "Timer card ( for generating delayed pulse for triggering and synchronizing with other system) using single serial port. A LabVIEW based GUI program is developed for the individual communication of each module."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd13.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD13",
      "page_number": "29",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD14",
      "title": "VEPP-2000 Logging System",
      "authors": [
        "A.I. Senchenko",
        "D.E. Berkaev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The electron-positron collider VEPP-2000 has been constructed in the Budker INP at the beginning of 2007 year. The first experiments on high-energy physics has been started at the end of 2009. The collider state is characterized by many parameters which have to be tracked. These parameters called channels could be divided into continuous (like beam current or beam energy) and pulsed. The main difference is that the first one related to the moment of time while the second one to the beam transport event. There are approximately 3000 continuous channels and about 500 pulsed channels at the VEPP-2000 facility. The Logging system consists of server layer and client layer. Server side are a specialized server with an intermediate embedded database aimed at saving data in case of external database fault. Client layer provide data access via API",
        "CLI and WUI. The system has been deployed and is used as primary logging system on"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd14.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD14",
      "page_number": "32",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD16",
      "title": "Development of Data Acquisition Software for VME Based System",
      "authors": [
        "A. Kumar",
        "A. Chatterjee",
        "K. Mahata",
        "K. Ramachandran",
        "BARC",
        "Mumbai",
        "India",
        "A Data Acquisition system for VME has been developed for use in accelerator based experiments. It is in use at BARC-TIFR laboratory. The development was motivated by the growing demand for higher throughput in view of the increasing size of experiments. The VME based data acquisition system provides a powerful alternative to CAMAC standards on account of higher readout speeds (100 ns/word) resulting in reduced dead time. Further",
        "high density VME modules are capable of providing up to 640 channels in a single VME crate with 21 slots. The software system LAMPS[1]",
        "earlier developed for CAMAC based system and used extensively in our laboratory and elsewhere has been modified for the present VME based system. The system makes use of the VME library to implement Chain Block Transfer Readout (CBLT) and gives the option of both Polling and Interrupt mode to acquire data. Practical throughput of ~250 ns/word in zero-suppressed mode have been achieved. The developed software currently supports CAEN[2] V785 ADC",
        "V775 TDC and V862 QDC and V830 Scalar Modules. The design",
        "development and architecture of this DAQ system will be discussed."
      ],
      "institutions": [],
      "abstract": "[1] http://www.tifr.res.in/~pell/lamps.html [2] http://caen.it/",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd16.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD16",
      "page_number": "35",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPD18",
      "title": "Microcontroller Based DAQ System for IR Thermography by Hot and Cold Water Flow",
      "authors": [
        "M.S. Khan",
        "S.M. Belsare",
        "K.D. Galodiya",
        "S.S. Khirwadkar",
        "T.H. Patel",
        "IPR",
        "Bhat",
        "Gandhinagar",
        "India",
        "There are many Non Destructive Technique used in science and industry to evaluate the properties of a material",
        "component or system without causing damage Infrared Thermography is one of them. Different types of IR thermo-graphy are used for different purpose. We are using hot and cold-water flow IR Thermography method to evaluate the Performance of Plasma Facing Components (PFC) for Divertor Mock-up. The Set-up is designed in such a way that hot and Called Water can flow in both direction inside mockup",
        "like left to right and right to Left using electric motor. Eight numbers of Solenoid Valves have been used for selection of Water Flow Direction",
        "thermo-couples for temperature measurement of water",
        "IR camera to take the images and many others devices. Which needs a very good and versatile DAC system. We have developed a DAC system usingμcontroller and LabView for the acquisition of various parameters and controlling & synchronization of other system. Development of DAC is described in this paper"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd18.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD18",
      "page_number": "37",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD19",
      "title": "Smart Structured Measurement Process for Versatile Synchrotron Beamline Data at ANKA",
      "authors": [
        "T. Spangenberg",
        "D. Haas",
        "W. Mexner",
        "KIT",
        "Karlsruhe",
        "Germany"
      ],
      "institutions": [],
      "abstract": "An unstructured measurement process might deliver the needed quantity of primary data for an experiment. But the achievement of the scientific results depends more and more from the offered opportunities of embedding these measurement data into its specific context with a meta data description and a complete life cycle management. Obviously the design of a measurement process influences the potential applicability of an experimental setup for its scientific purpose and of course its options to fulfill a contemporary data management. ANKA's Tango based environment offers in principal varying approaches with different implementation efforts and coverage of scientific or information technology requirements. At ANKA we have set up a smart structured measurement process which stand out due to its seamless integration into the overall data management, the support of recent control concepts for fast data generation as well as its support of well time-tested SPEC based scan systems. The presented measurement process focuses to the minimal implementation for all involved components without a break of well accepted habits.",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd19.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD19",
      "page_number": "40",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD22",
      "title": "Post-Mortem Analysis of BPM-Interlock Triggered Beam Dumps at PETRA-III",
      "authors": [
        "G.K. Sahoo",
        "K. Balewski",
        "A. Kling",
        "DESY",
        "Hamburg",
        "Germany",
        "PETRA-III is a 3rd generation synchrotron light source dedicated to users at 14 beam lines with 30 instruments. This operates with several filling modes such as 60",
        "240 and 320 bunches with 100mA or 40 bunches with 80mA at a positron beam energy of 6 GeV. The horizontal beam emittance is 1nmrad while a coupling of 1% amounts to a vertical emittance of 10pmrad. During a user run unscheduled beam dumps triggered by Machine Protection System may occur. In many cases the reason can be identified but in some it remains undetected. Though the beam is lost some signature is left in the ring buffers of the 226 BPM electronics where last 16384 turns just before the dump are available for post-mortem analysis. Scrutinizing turn by turn orbits and the frequency spectrum measured at a BPM can improve understanding of such a beam loss and may help to increase the efficiency of operation by eliminating the sources. Here we discuss in detail the functionality of a Java GUI used to investigate the reasons for unwanted dumps. In particular",
        "the most effective corrector method is applied to identify correctors that might have perturbed the golden orbit leading to violations of the interlock limits."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd22.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD22",
      "page_number": "43",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPD23",
      "title": "Design & Implementation Of LabVIEWTM Based GUI for Remote Operation and Control of Excimer Laser for Plasma Wakefield Accelerator Experiment",
      "authors": [
        "K.K. Kizhupadath",
        "R.A.V. Kumar",
        "K. Mahavar",
        "IPR",
        "Bhat",
        "Gandhinagar",
        "India",
        "S. Joshi",
        "A. Sharma",
        "Nirma University",
        "Ahmedabad",
        "India",
        "The paper describes the development of GUI based control software for control/operation",
        "maintenance and data logging of a Coherent CompexPro 102 Excimer Laser (ArF",
        "193 nm) using LabVIEWTM instrument control software. Excimer laser will be used to generate the lithium plasma for the Plasma Wake Field Acceleration (PWFA) experiment which is currently being pursued at the Institute for Plasma research",
        "Gandhinagar. The LabViewTM drivers for the system were developed and various control modules for laser control & operation",
        "maintenance (gas refill)",
        "energy calibration as well as logging were developed and integrated into a single screen GUI. Automated calibration of the internal energy meter with an external one has also been implemented. The modules can be used independently or as an integrated system. The laser is interfaced to the control PC through a RS-232-to-USB interface."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd23.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD23",
      "page_number": "46",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD24",
      "title": "STARS on Android",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "STARS (Simple Transmission and Retrieval System) is a message transferring software for small scale control systems with TCP/IP socket",
        "which works on various types of operating systems. STARS is used as beamline control system and it controls optical devices (mirror",
        "monochrometer etc.) of beamline at the Photon Factory. We have succeeded to run STARS GUI Client on Android with STARS Java interface library this time. This success brings capability of handy GUI terminal development with smartphones and tablet devices. The handy GUI terminal helps beamline users when checking movement near optical devices. We will describe detail of \"STARS on Android\"."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd24.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD24",
      "page_number": "51",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD25",
      "title": "Development of EPICS Channel Access Embedded ActiveX Components for GUI Development",
      "authors": [
        "A. Roy",
        "R.B. Bhole",
        "S. Pal",
        "VECC",
        "Kolkata",
        "India",
        "The paper describes the integration of EPICS Channel Access protocol and Microsoft ActiveX technology towards developing a generalize operator interface (OPI) building facility for Windows platform. EPICS is used as the development architecture of the control system in Superconducting Cyclotron (SCC). Considering the operators' familiarity and compatibility with third party software",
        "it was decided to use MS-Windows platform at operator interface level in SCC during commission. Microsoft Visual Basic (VB) is used on trial basis as OPI building platform to incorporate user specific features e.g. file system access for data storage and analysis",
        "user authentication at OPI level etc. A set of EPICS Channel Access embedded ActiveX components is developed to ease the programming complexity and reduce developmental time of the OPI for Windows platform. OPIs",
        "developed using these components and containing hundreds of process parameters",
        "are being used reliably over a considerable period of time."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd25.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD25",
      "page_number": "54",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD26",
      "title": "Development of Fast Controls for Beam Wire Scanner for SuperKEKB",
      "authors": [
        "VECC",
        "Kolkata",
        "India",
        "K. Furukawa",
        "N. Iida",
        "KEK",
        "Ibaraki",
        "Japan",
        "EJIT",
        "Hitachi",
        "Ibaraki",
        "Japan",
        "Recent development towards the data acquisition system of the wire scanner (WS) systems of the SuperKEKB injector linac (LINAC) and beam transport lines (BT's) is described. A VME based system",
        "comprised of charge sensitive ADC (CSADC) board",
        "scaler board",
        "DAC board and Event receiver board",
        "has been installed. The primary aim of the system is to utilise global linac event timing system for synchronized and mode-dependent data acquisition. A set of EPICS device driver has been developed for new hardware e.g. CSADC",
        "scaler and DAC boards. The combination of latest versions of firmware and EPICS device driver forμResearch Finland (MRF) Event receiver board is also evaluated and further incorporated in this system. The application software is developed for simultaneous acquisition of multiple beam mode data during multimode injection of the LINAC. The developed system is tested successfully after integrating with the existing wire scanner driving mechanism. The system enables the beam size measurements at four consecutive locations",
        "that derive Twiss parameters and ensure the reliable beam transport to four downstream storage rings."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd26.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD26",
      "page_number": "57",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD27",
      "title": "Graphical User Interface (GUI) for Testing CAMAC modules",
      "authors": [
        "S. Kulkarni",
        "P. V. Bhagwat",
        "J.A. Gore",
        "A.K. Gupta",
        "S. Kailas",
        "BARC",
        "Mumbai",
        "India",
        "A new program (GUI) for testing CAMAC modules (CAMAC ADC",
        "DAC",
        "Input Gate",
        "Output Register) is developed using Labview and dynamic link libraries (DLLs). On start-up",
        "the program initializes the CAMAC Controller via PCI bus interface",
        "thus enabling communication with CAMAC modules. It can test CAMAC modules through different controls like slider bars",
        "buttons etc. and display status of individual channels with soft panel meters and LEDs. The GUI is extremely useful in troubleshooting hardware problems of CAMAC modules and also in developing new modules."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd27.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD27",
      "page_number": "60",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD28",
      "title": "Re-envisioning the Operator Consoles for Dhruva Control Room",
      "authors": [
        "S. Gaur",
        "M.P. Diwakar",
        "P.M. Nair",
        "C.K. Pithawa",
        "P. Sridharan",
        "BARC",
        "Trombay",
        "Mumbai",
        "India",
        "Bhabha Atomic Research Centre",
        "Mumbai",
        "India",
        "Control Room design is undergoing rapid changes with the progressive adoption of computerization and automation. Advances in man-machine interfaces have further accelerated this trend. This paper presents the design and main features of Operator consoles (OC) using new technologies for Dhruva control room. The OCs have been designed so as not to burden the operator with information overload but to help him quickly assess the situation and timely take appropriate steps. The consoles provide minimalistic yet intuitive interfaces",
        "context sensitive navigation",
        "display of important information and progressive disclosure of situation based information. The use of animations",
        "3D graphics",
        "and real time trends with the benefit of hardware acceleration to provide a resolution-independent rich user experience. The use of XAML",
        "an XML based Mark-up Language for User Interface definition and C# for application logic resulted in complete separation of visual design",
        "content",
        "and logic. This also resulted in a workflow where separate teams could work on the UI and the logic of an application. The introduction of Model View View-Model has led to more testable and maintainable software."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd28.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD28",
      "page_number": "62",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD33",
      "title": "Embedded PC Based Controller for Use in VME Bus Based Data Acquisition System",
      "authors": [
        "G. Verma",
        "B.B. Biswas",
        "S.K. Jain",
        "M. Kalra",
        "D.A. Roy",
        "BARC",
        "Mumbai",
        "India",
        "An embedded PC based Controller module",
        "named System Controller Module (SCM)",
        "has been developed at Reactor Control Division(RCnD)",
        "BARC. This module uses standard PC-104 bus based CPU module integrated with a protocol translator card to provide an interface between the CPU module and VME bus. The signal interface between PC-104 bus of CPU module and translator card is achieved through stackable connectors. SCM can be interfaced with 16-bit slave I/O modules on VME bus for Data Acquisition and Control. This development provides low cost PC based platform for developing I/O intensive embedded system requiring high processing power. SCM module is fully compatible with PC architecture and is available in Double Euro modular form factor. Module has self diagnostics features to test software integrity using onboard watchdog timer. The module provides dual Ethernet link for communication. The SCM has been assembled",
        "integrated and successfully tested along with VME based high speed data acquisition system (Machinery Protection System)",
        "which has been developed in RCnD for condition monitoring of rotating machines. SCM acts as a configuration controller and data manager for this system."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd33.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD33",
      "page_number": "65",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD34",
      "title": "A Low-Cost High-Performance Embedded Platform for Accelerator Controls",
      "authors": [
        "S. Cleva",
        "A.I. Bogani",
        "L. Pivetta",
        "ELETTRA",
        "Basovizza",
        "Italy",
        "Over the last years the mobile and hand-held device market has seen a dramatic performance improvement of the microprocessors employed for these systems. As an interesting side effect",
        "this brings the opportunity of adopting these microprocessors to build small low-cost embedded boards",
        "featuring lots of processing power and input/output capabilities. Moreover",
        "being capable of running a full featured operating system such as GNU/Linux",
        "and even a control system toolkit such as Tango",
        "these boards can also be used in control systems as front-end or embedded computers. In order to evaluate the feasibility of this idea",
        "an activity has started at ELETTRA to select",
        "evaluate and validate a commercial embedded device able to guarantee production grade reliability",
        "competitive costs and an open source platform. The preliminary results of this work are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd34.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD34",
      "page_number": "68",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD38",
      "title": "A wireless control system for the HTS-ECRIS, PKDELIS and low energy beam transport",
      "authors": [
        "R.N. Dutt",
        "D. Kanjilal",
        "P.S. Lakshmy",
        "Y. Mathur",
        "U.K. Rao",
        "G.O. Rodrigues",
        "IUAC",
        "New Delhi",
        "India",
        "A wireless control system based on MODBUS protocol has been developed for operation of the High Temperature Superconducting ECR ion source",
        "PKDELIS [1]",
        "LEBT and associated systems on a 200 kV high voltage platform. The isolation channels for the two high voltage platforms are implemented using ISM band wireless channel. A server for organization wide connectivity over Ethernet for access from the main IUAC control room has been implemented. History features and an intuitive GUI interface is provided. The system has been in regular use and has proven to be rugged and reliable.",
        "[1] D. Kanjilal et al.",
        "Rev. Sci. Instrum. 77",
        "(2006) 03A317  [2] R.N. Dutt et al. Proceedings of Indian Particle Accelerator Conference",
        "INPAC",
        "New Delhi",
        "2011"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd38_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd38.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd38_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD38",
      "page_number": "71",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD39",
      "title": "Development of an Ethernet Enabled Microcontroller Based Module for Superconducting Cyclotron ECR Beamline Control",
      "authors": [
        "M. Chatterjee",
        "D. Koley",
        "P.Y. Nabhiraj",
        "VECC",
        "Kolkata",
        "India",
        "A General purpose Ethernet enabled control and data acquisition module based on PIC microcontroller has been developed. This module supports multiple general purpose analog and digital inputs and outputs for interfacing with various equipments. The remote control",
        "configuration and monitoring of the equipment are achieved through an embedded web server. A strict authentication process is built in the web server to access for control and configuration parameters that ensures the operational safety of the equipment under control. At present",
        "this is being used for remote control of the ECR beam line vacuum systems and monitoring of various parameters like dual vacuum Gauge readings",
        "pumping speed etc. These modules form a distributed control architecture enhancing the reliability of the controlled system",
        "enables fast fault diagnostics and thereby reducing the downtime of the system significantly. In this article",
        "the development of the hardware and software for the Ethernet enabled microcontroller based module is presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd39_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd39.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd39_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD39",
      "page_number": "73",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD43",
      "title": "A New Scheme for Direct Estimation of PID Controller Parameters",
      "authors": [
        "S. Srivastava",
        "V.S. Pandit",
        "VECC",
        "Kolkata",
        "India",
        "This paper presents a novel scheme for the direct estimation of a PID controller parameters(Kp",
        "TI",
        "Td).The proposal discussed here is only applicable to first and second order stable systems. The formulation begins with system parameter identification (Transfer function of the process)",
        "which was calculated by applying weighted-recursive least square method. The pole zero cancellation technique was applied to estimate PID controller parameters ;which in-turn results into the matched coefficients of the system parameters to the Controller parameters. An additional tuning parameters 'α' is proposed in our method",
        "which provides an additional flexibility of tuning the response time of the controller without disturbing the controller parameters. The proposed scheme was bench marked using real time cases of DC Motor speed control and Cruise Control. The effectiveness and robustness of the proposed auto tuning algorithm is verified by the simulation results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd43_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd43.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd43_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD43",
      "page_number": "76",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD44",
      "title": "FPGA Data Block FIFO for the APS ID Measurement System",
      "authors": [
        "J.Z. Xu",
        "R.I. Farnsworth",
        "I. Vasserman",
        "ANL",
        "Argonne",
        "USA"
      ],
      "institutions": [],
      "abstract": "A Hall probe insertion device (ID) measurement system has been developed to characterize the IDs at the Advanced Photon Source (APS). The system uses the latest state-of-the-art field programmable gate array (FPGA) technology to synchronize the position and Hall voltage measurements. Data block first-in-first-out (FIFO) has been implemented to transfer the data from the FPGA to the host computer during measurement. The system is capable of continuous scanning measurements on a full 6 meter bench at 1 ms per data point with the position resolution of 1 micron and Hall voltage precision of 5-1/2 digits.",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd44_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd44.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd44_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD44",
      "page_number": "79",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPD47",
      "title": "Low-cost EPICS Control Using Serial-LAN Module XPort",
      "authors": [
        "KEK",
        "Ibaraki",
        "Japan",
        "J-PARC",
        "KEK & JAEA",
        "Ibaraki-ken",
        "Japan",
        "Kanto Information Service (KIS)",
        "Accelerator Group",
        "Ibaraki",
        "Japan",
        "In J-PARC MR (Main Ring)",
        "we are interested in a commercial product",
        "XPort",
        "a low-cost serial-LAN converter [1]. We have introduced it in two different cases. (1) Two RF-amplifiers with GPIB were introduced. We asked a company to add a XPort for remote control rather than GPIB. Serial messages of GPIB are transported to an EPICS IOC (I/O controller) over our control network. (2) We developed an electric circuit board with manual switches. An on-board FPGA chip has connections both to switches and to XPort pins. Status of switches can be read remotely as UDP messages through XPort. In both cases",
        "messages are converted into EPICS-style records using AsyncDriver of EPICS. Implementation details and operational reports are given."
      ],
      "institutions": [],
      "abstract": "[1] http://www.lantronix.com/device-networking/embedded-device-servers/xport.html",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd47_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd47.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd47_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD47",
      "page_number": "81",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPD48",
      "title": "Facility-Wide Synchronization of Standard FAIR Equipment Controllers",
      "authors": [
        "S. Rauch",
        "R. Bär",
        "D.H. Beck",
        "M. Kreider",
        "W. Panschow",
        "C. Prados",
        "W.W. Terpstra",
        "M. Thieme",
        "M. Zweig",
        "GSI",
        "Darmstadt",
        "Germany",
        "The standard equipment controller for the new FAIR accelerator facility is the Scalable Control Unit (SCU). It synchronizes and controls the actions of up to 12 purpose-built slave cards",
        "connected in a crate. Facility-wide synchronization is a core FAIR requirement and thus precise timing of SCU slave actions is of vital importance. The SCU consists primarily of two components",
        "a daughter board with CPU and a carrier board with FPGA",
        "interconnected by PCI Express. The CPU receives configuration and set values with which it programs the real-time event-condition-action (ECA) unit in the FPGA. The ECA unit receives event messages via the timing network",
        "which also synchronizes clocks using White Rabbit. Matching events trigger actions on the SCU slave cards such as ramping magnets",
        "triggering kickers",
        "etc. Timing requirements differ depending on the action taken. For softer real-time actions",
        "an interrupt can be generated for complex processing on the CPU. Alternatively",
        "the FPGA can directly fire a pulse or bus operation. The delay and jitter achievable in each case differs and this paper examines their timing performance to determine which is appropriate for the required actions."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd48_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd48.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd48_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD48",
      "page_number": "84",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "WEPD52",
      "title": "Diamond Light Source Control Systems Relational RDB",
      "authors": [
        "K. Vijayan",
        "M.T. Heron",
        "S.J. Singleton",
        "Diamond",
        "Oxfordshire",
        "United Kingdom",
        "The functionality of the Diamond Light Source Relational Database (RDB) will be described in this article. An Oracle-based RDB and web-based GUIs allow recording of system configuration information and configuration change management. Information about the hardware components that make up each beam line crate is stored in the RDB; for each item of control equipment",
        "the status",
        "location and name of the person responsible for the item are held. The Diamond Control System is based on EPICS and has of the order of 500",
        "000 process variables (PVs); the RDB maintains a record of the names of these PVs and validates new names against the Diamond Naming Convention",
        "allowing consistency of naming style to be maintained and avoiding name duplication. Machine operational details such as alarm logs are stored in the RDB and viewed using a web browser. All process data recorded by the control software are archived using the EPICS Channel Archiver; the Archiver configuration for each technical area is maintained in the RDB. A further application using the RDB is the electronic logbook (ELOG) which is used to record activities by Diamond Operations and Beamline groups."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/pcapac2012/talks/wepd52_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/pcapac2012/papers/wepd52.pdf",
      "poster_url": "https://proceedings.jacow.org/pcapac2012/posters/wepd52_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-PCAPAC2012-WEPD52",
      "page_number": "87",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    }
  ],
  "paper_count": 27,
  "scrape_time": "2025-10-11 02:08:08"
}