{
  "session_info": {
    "id": "WECZB",
    "name": "WECZB - Charge and Loss Monitors",
    "url": "https://proceedings.jacow.org/IBIC2014/html/weczb.htm"
  },
  "papers": [
    {
      "paper_id": "WECZB1",
      "title": "A SQUID-Based Beam Current Monitor for FAIR/CRYRING",
      "authors": [
        "R. Geithner",
        "T. Stöhlker",
        "IOQ",
        "Jena",
        "Germany",
        "R. Geithner",
        "T. Stöhlker",
        "HIJ",
        "Jena",
        "Germany",
        "F. Kurian",
        "H. Reeg",
        "M. Schwickert",
        "T. Stöhlker",
        "GSI",
        "Darmstadt",
        "Germany",
        "R. Neubert",
        "P. Seidel",
        "FSU Jena",
        "Jena",
        "Germany",
        "A SQUID-based beam current monitor was developed for the upcoming FAIR-Project",
        "providing a non-destructive online monitoring of the beam currents in the nA-range. The Cryogenic Current Comparator (CCC) was optimized for a lowest possible noise-limited current resolution together with a high system bandwidth. This CCC should be installed in the CRYRING facility",
        "working as a test bench for FAIR. In this contribution we present results of the completed CCC for FAIR/CRYRING and also arrangements that have been done for the installation of the CCC at CRYRING",
        "regarding the cryostat design."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/weczb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/weczb1.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/weczb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-WECZB1",
      "page_number": "510",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WECZB3",
      "title": "Measurement of Beam Losses Using Optical Fibers at the Australian Synchrotron",
      "authors": [
        "E. Nebot Del Busto",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "ASCo",
        "Clayton",
        "Victoria",
        "Australia",
        "M.J. Boland",
        "R.P. Rassool",
        "The University of Melbourne",
        "Melbourne",
        "Victoria",
        "Australia",
        "E.B. Holzer",
        "M. Kastriotou",
        "E. Nebot Del Busto",
        "CERN",
        "Geneva",
        "Switzerland",
        "University of Adelaide",
        "Adelaide",
        "Australia",
        "Albert-Ludwig Universität Freiburg",
        "Freiburg",
        "Germany",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The unprecedented requirements that new machines are setting on their diagnostic systems are leading to the development of a new generation of devices with large dynamic range",
        "sensitivity and time resolution. Beam loss detection is particularly challenging due to the large extension of new facilities that need to be covered with localized detectors. Candidates to mitigate this problem consist of systems in which the sensitive part of the radiation detectors can be extended over the long distances of beam lines. In this document",
        "we study the feasibility of a beam loss monitor (BLM) system based on optical fibers as an active detector for an electron storage ring. The Australian Synchrotron (AS) comprises a 216m ring that stores electrons up to 3GeV. The Accelerator has recently claimed the world record lowest transverse emittance (below 1 pm rad). Ultra low transverse sizes and large amounts of synchrotron radiation provide an environment very similar to that expected in the CLIC damping rings. A qualitative benchmark of beam losses under damping ring-like conditions is presented here. A wide range of beam loss rates can be achieved by modifying the bunch charge",
        "horizontal/vertical coupling and dynamic aperture as well as via beam scrapers. The controlled beam losses are observed by means of the Cherenkov light produced in a 365 um core Silica fiber. The output light is coupled to different types of photo sensors namely: Multi Pixel Photon Counters (MPPCs)",
        "standard PhotoMulTiplier (PMT) tubes and Avalanche PhotoDiodes (APD). A detailed comparison of the sensitivities and time resolution obtained with the different read-outs are discussed in this contribution."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IBIC2014/talks/weczb3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IBIC2014/papers/weczb3.pdf",
      "poster_url": "https://proceedings.jacow.org/IBIC2014/posters/weczb3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IBIC2014-WECZB3",
      "page_number": "515",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 17:57:21"
}