{
  "session_info": {
    "id": "THYPLM",
    "name": "THYPLM - Invited Orals: Photon Sources and Electron Accelerators",
    "url": "https://proceedings.jacow.org/ipac2019/html/thyplm.htm"
  },
  "papers": [
    {
      "paper_id": "THYPLM1",
      "title": "Development of the Vertically Polarizing Hard X-Ray Undulator Segments for the Linear Coherent Light Source Upgrade (LCLS-II) Project",
      "authors": [
        "M. Leitner",
        "D. Arbelaez",
        "J.N. Corlett",
        "A.J. DeMello",
        "L. Garcia Fajardo",
        "D. Leitner",
        "S. Marks",
        "K.A. McCombs",
        "T. Miller",
        "D.V. Munson",
        "J. Niu",
        "K.L. Ray",
        "D.A. Sadlier",
        "D. Schlueter",
        "E.J. Wallén",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "H. Bassan",
        "D.E. Bruch",
        "D.S. Martinez-Galarce",
        "H.-D. Nuhn",
        "M. Rowen",
        "Z.R. Wolf",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The Linear Coherent Light Source II (LCLS-II) is a free electron laser facility currently in its final construction stage at Stanford Linear Accelerator Center. The project includes two variable-gap",
        "hybrid-permanent-magnet undulator lines: A soft x-ray undulator line with 21 undulator segments optimized for a photon energy range from 0.2 keV to 1.3 keV and a hard x-ray undulator line with 32 undulator segments designed for a photon energy range from 1.0 keV to 25.0 keV. This paper focuses on the design",
        "development",
        "and performance of the hard x-ray undulator line which utilizes uniquely-developed",
        "vertically-polarizing undulators. To fully compensate the magnetic force throughout the entire gap range these devices incorporate non-linear spring systems which permit the construction of relatively compact undulators. However",
        "significant magnetic field repeatability challenges have been encountered during prototyping of this novel design. The paper describes the innovative design improvements that were implemented which lead to reaching the LCLS-II required performance. These final design solutions can also be advantageous improving the operation of any future undulator design."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/thyplm1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/thyplm1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/thyplm1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-THYPLM1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-10 19:16:39"
}