{
  "session_info": {
    "id": "WEPWA",
    "name": "WEPWA - Wednesday Posters (Washington)",
    "url": "https://proceedings.jacow.org/IPAC2015/html/wepwa.htm"
  },
  "papers": [
    {
      "paper_id": "WEPWA001",
      "title": "Electron Beam Transfer Line for Demonstration of Laser Plasma Based Free Electron Laser Amplification",
      "authors": [
        "A. Loulergue",
        "M.-E. Couprie",
        "M. Khojoyan",
        "M. Labat",
        "W. Wang",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "PhLAM/CERCLA",
        "Villeneuve d'Ascq Cedex",
        "France",
        "One direction towards compact Free Electron Lasers is to replace the conventional linac by a laser plasma driven beam",
        "provided proper electron beam manipulation to handle the value of the energy spread and of the divergence is done. Applying seeding techniques enables also to reduce the required undulator length. The rapidly developing LWFA are already able to generate synchrotron radiation. With an electron divergence of typically 1 mrad and an energy spread of the order of 1 %",
        "an adequate beam manipulation through the transport to the undulator is needed for FEL amplification. A test experiment for the demonstration of FEL amplification with a LWFA is under preparation in the frame of the COXINEL ERC contract. A specific design of electron beam transfer line following different steps with strong focusing variable strength permanent magnet quadrupoles",
        "an energy de-mixing chicane with conventional dipoles and second set of quadrupoles for further dedicated focusing in the undulator has been investigated. Beam transfer simulations and expected FEL power in the XUV will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa001.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA003",
      "title": "Simulations of Electron-Proton Beam Interaction before Plasma in the AWAKE Experiment",
      "authors": [
        "U. Dorda",
        "R.W. Aßmann",
        "J. Grebenyuk",
        "DESY",
        "Hamburg",
        "Germany",
        "C. Bracco",
        "A.V. Petrenko",
        "J.S. Schmidt",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [
        "The on-axis injection of electron bunches in the proton-driven plasma wake at the AWAKE experiment at CERN implies co-propagation of a low-energy electron beam with the long high-energy proton beam in a common beam pipe over several meters upstream of the plasma chamber. The possible effects of the proton-induced wakefields on the electron bunch phase space in the common beam pipe region may have crucial implications for subsequent electron trapping and acceleration in plasma. We present the CST Studio simulations of the tentative common beam pipe setup and the two beam co-propagating in it. Simulated effects of the proton wakefields on electrons are analysed and compared to analytical predictions."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa003.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA005",
      "title": "Simulations Study for Self-Modulation Experiment at PITZ",
      "authors": [
        "G. Pathak",
        "F.J. Grüner",
        "Uni HH",
        "Hamburg",
        "Germany",
        "C. Benedetti",
        "C.B. Schroeder",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "M. Groß",
        "F. Stephan",
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "A. Martinez de la Ossa",
        "T.J. Mehrling",
        "J. Osterhoff",
        "DESY",
        "Hamburg",
        "Germany",
        "Self-modulation (SM) of proton beams in plasma has recently gained interest in context with the ongoing PWFA experiment of the AWAKE collaboration at CERN. Instrumental for that experiment is the SM of a proton beam to generate bunchlets for resonant wave excitation and efficient acceleration. A fundamental understanding of the underlying physics is vital",
        "and hence an independent experiment has been set up at the beamline of the Photo Injector Test Facility at DESY",
        "Zeuthen Site (PITZ)",
        "to study the SM of electron beams in a plasma. This contribution presents simulation results on SM experiments at PITZ using the particle-in-cell code HiPACE. The simulation study is crucial to optimize the beam and plasma parameters for the experiment. Of particular interest is the energy modulation imprinted onto the beam by means of the generated wakefields in the plasma. With the support of simulations the observation of this information in the experiment can be used to deduce key properties of the accelerating electric fields such as their magnitude and their phase velocity",
        "both of significant importance for the design of self-modulated plasma-based acceleration experiments."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa005.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA006",
      "title": "Laser Propagation Effects During Photoionization of Meter Scale Rubidium Vapor Source",
      "authors": [
        "J.T. Moody",
        "F. Batsch",
        "A. Joulaei",
        "P. Muggli",
        "E. Öz",
        "MPI-P",
        "München",
        "Germany",
        "N. Berti",
        "J. Kasparian",
        "University of Geneva",
        "GAP Biophotonics",
        "Carouge",
        "Switzerland",
        "The baseline AWAKE experiment requires a 10 meter long plasma source with a density of 1015 cm􀀀-3 and a density uniformity of 0.2%. To produce this plasma",
        "a temperature stabilized rubidium vapor source is photoionized by a terawatt peak power laser pulse. In this paper we describe the laser pulse evolution within the plasma source including the dispersive",
        "diffractive",
        "and photoionization effects on the laser pulse. These calculations will be experimentally investigated in a meter long heat pipe oven using scaled laser parameters."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa006.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA007",
      "title": "The AWAKE Proton-driven Plasma Wakefield Experiment at CERN",
      "authors": [
        "MPI-P",
        "München",
        "Germany",
        "The AWAKE experiment at CERN * aims at studying plasma wakefield generation and acceleration driven by proton bunches. The first experiments will focus on the self-modulation instability of the long (~12cm",
        "rms) proton bunch in the plasma. This instability is used to transform the incoming bunch into a train of short bunches with a period approximately equal to the plasma wavelength",
        "~1.2mm at a nominal plasma electron density of 7·1014/cc. These experiments are planned for the end of 2016. Later",
        "low energy (~15MeV) electrons will be externally injected to sample the wakefields and be accelerated beyond 1GeV. The main goals of the experiment will be summarized and the progress with the plasma source",
        "beam diagnostics and injection method will be presented.",
        "* AWAKE Collaboration",
        "Plasma Phys. Control. Fusion 56 084013 (2014)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa007.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA008",
      "title": "Measuring the Self-modulation Instability of Electron and Positron Bunches in Plasmas",
      "authors": [
        "P. Muggli",
        "O. Reimann",
        "MPI-P",
        "München",
        "Germany",
        "E. Adli",
        "V.K.B. Olsen",
        "University of Oslo",
        "Oslo",
        "Norway",
        "J. Allen",
        "S.J. Gessner",
        "S.Z. Green",
        "M.J. Hogan",
        "M.D. Litos",
        "B.D. O'Shea",
        "V. Yakimenko",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "IST",
        "Lisboa",
        "Portugal",
        "G. Andonian",
        "C. Joshi",
        "K.A. Marsh",
        "W.B. Mori",
        "N. Vafaei-Najafabadi",
        "O. Williams",
        "UCLA",
        "Los Angeles",
        "California",
        "USA",
        "N.C. Lopes",
        "L.O. Silva",
        "J. Vieira",
        "Instituto Superior Tecnico",
        "Lisbon",
        "Portugal",
        "The self-modulation instability (SMI) * can be used to transform a long",
        "charged particle bunch into a train of periodically spaced shorter bunches. The SMI occurs in a plasma when the plasma wake period is much shorter than the bunch length. The train of short bunches can then resonantly drive wakefields to much larger amplitude that the long bunch can. The SMI will be used in the AWAKE experiment at CERN",
        "where the wakefields will be driven by a high-energy (400GeV) proton bunch. ** However",
        "most of the SMI physics can be tested with the electron and positron bunches available at SLAC-FACET. *** In this case",
        "the bunch is ~10 plasma wavelengths long",
        "but can drive wakefields in the GV/m range. FACET has a meter-long plasma **** and is well equipped in terms of diagnostic for SMI detection: optical transition radiation for transverse bunch profile measurements",
        "coherent transition radiation interferometry for radial modulation period measurements and energy spectrometer for energy loss and gain measurement of the drive bunch particles. The latest experimental results will be presented.",
        "* N. Kumar et al.",
        "PRL 104",
        "255003 (2010)  ** AWAKE Collaboration",
        "PPCF 56 084013 (2014)  *** J. Vieira et al.",
        "PoP 19",
        "063105 (2012)  **** S.Z. Green et al.",
        "PPCF 56",
        "084011 (2014)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa008.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA010",
      "title": "A High Intensity Proton Source for the European Spallation Source Facility",
      "authors": [
        "L. Celona",
        "L. Allegra",
        "L. Andò",
        "A.C. Caruso",
        "G. Castro",
        "F. Chines",
        "G. Gallo",
        "S. Gamminopresenter",
        "A. Longhitano",
        "S. Marletta",
        "D. Mascali",
        "L. Neri",
        "S. Passarello",
        "G. Torrisi",
        "INFN/LNS",
        "Catania",
        "Italy",
        "ALTEK",
        "San Gregorio (CATANIA)",
        "Italy",
        "Universitá Mediterranea di Reggio Calabria",
        "Reggio Calabria",
        "Italy",
        "Along the last twentyfive years",
        "INFN-LNS has gained a relevant role in R&D of plasma-based ion sources. The laboratory is currently involved in the Proton Source and Low Energy Beam Transport (LEBT) line prototype construction for the European Spallation Source. ESS – based on a 2.0 GeV",
        "62.5 mA proton accelerator for neutron production – will be a fundamental instrument for research and application. The proton source is required to produce at least 90 mA beam (as total drain current) at 0.25 π.mm.mrad emittance",
        "2.86 ms pulse duration",
        "14 Hz repetition rate. We will illustrate the advanced design of the machine",
        "including the innovations in plasma heating schemes",
        "the final layout of the LEBT – based on detailed beam transport studies",
        "a new vacuum scheme and the final chopper strategy – and the first steps of the devices installation at the INFN-LNS test-bench site."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa010.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA012",
      "title": "Design of a Microwave Frequency Sweep Interferometer for Plasma Density Measurements in ECR Ion Sources",
      "authors": [
        "G. Torrisi",
        "R. Agnello",
        "G. Castro",
        "L. Celona",
        "V. Finocchiaro",
        "S. Gammino",
        "D. Mascali",
        "L. Neri",
        "S. Passarello",
        "INFN/LNS",
        "Catania",
        "Italy",
        "T. Isernia",
        "G. Torrisi",
        "Universitá Mediterranea di Reggio Calabria",
        "Reggio Calabria",
        "Italy",
        "University of Catania",
        "Catania",
        "Italy",
        "Electron Cyclotron Resonance Ion Sources (ECRIS) are among the candidates to support the growing request of intense beams of multicharged ions. Their further development is related to the availability of new diagnostic tools",
        "nowadays consisting of few types only of devices designed on purpose for such compact machines. Microwave Interferometry is a non-invasive method for plasma diagnostics and represents the best candidate for the whole plasma density measurements. Interferometry in ECR Ion Sources is a challenging task due to their compact size. The typical density range of ECR plasmas (1011-1012 cm-3) causes the probing beam wavelength to be in the order of few centimetres",
        "which is comparable to the chamber radius. The paper describes the design of a new microwave interferometer based on the so-called \"frequency sweep\" method: the density is here derived by the frequency shift of a beating signal obtained during the fast sweep of both probing and reference microwave signals; inner cavity multipaths contributions can thereby be suppressed by cleaning the spurious frequencies from the beating signal spectrum."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa012.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA013",
      "title": "A Transport Beamline Solution for Laser-Driven Proton Beams",
      "authors": [
        "A. Tramontana",
        "G. Candiano",
        "G.A.P. Cirrone",
        "M. Costa",
        "G. Cuttone",
        "G. Gallo",
        "R. Leanza",
        "R. Manna",
        "V. Marchese",
        "G. Milluzzo",
        "G. Petringa",
        "D. Rizzo",
        "F. Romano",
        "S. Salamone",
        "F. Schillaci",
        "V. Scuderi",
        "INFN/LNS",
        "Catania",
        "Italy",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "ELI-BEAMS",
        "Prague",
        "Czech Republic",
        "Laser-target interaction represents a very promising field in several potential applications",
        "from nuclear physics to medicine. On the other hand optically accelerated particle beams are characterized by some extreme features",
        "often not suitable for several applications",
        "as an high peak current",
        "a poor shot-to-shot reproducibility and a wide energy and angular distribution. Therefore many efforts are currently ongoing for the development of specific beam transport devices in order to obtain controlled and reproducible output beams. In this framework",
        "this work want to report about a transport beamline solution dedicated to laser-driven beams and made of two main sections: a quadrupole-focusing device and an energy selector system. A test beam-line consisting of prototypes has been realised at INFN-LNS (National Institute of Physics-South National Laboratories",
        "Ct",
        "I) and partially tested with conventional accelerated proton beams. Moreover",
        "some of these prototypes have been already tested with laser-driven beams.\\ Several simulations have been also performed using the Geant4 Monte Carlo toolkit",
        "in order to best exploit the beamline potentiality. Preliminary simulations of a transported beamline to select 5 MeV and 24 MeV proton beams are here reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA014",
      "title": "Low Temperature Properties of 20 K Cooled Test Cavity for C-band 2.6-cell Photocathode RF Gun",
      "authors": [
        "T. Tanaka",
        "M. Inagaki",
        "K. Nakao",
        "K. Nogami",
        "T. Sakaipresenter",
        "LEBRA",
        "Funabashi",
        "Japan",
        "M.K. Fukuda",
        "T. Takatomi",
        "J. Urakawa",
        "M. Yoshida",
        "KEK",
        "Ibaraki",
        "Japan",
        "TIT",
        "Tokyo",
        "Japan",
        "Nihon University",
        "Tokyo",
        "Japan",
        "A cryogenic C-band 2.6-cell photocathode RF gun",
        "which operates at 20 K",
        "is under development at Nihon University for future possibility of use in a compact linac-driven X-ray source. The cavity material is 6N8 high purity copper",
        "the RRR of which being expected to be higher than 3000. A 2.6-cell pi-mode test cavity was fabricated for investigation of the properties under low temperature of 20 K*. Ultraprecision machining and diffusion bonding of the cavity were carried out in KEK. The operating frequency of the RF gun cavity is 5712 MHz. The machining dimensions of the test cavity were determined by taking into account the contraction of copper from room temperature to 20 K by approximately 0.33 %. The resonant frequency observed at around 21 K was 5711.761 MHz",
        "which is 185 kHz higher than the expected value that was deduced from the resonant frequency obtained at 23.5 degree C in vacuum and the linear expansion coefficient data for OFC copper by NIST**. The unloaded Q-value of 64500 obtained at 21 K is in agreement with the SUPERFISH calculation when the surface resistance of the RRR=3000 copper was specified with taking the anomalous skin effect into account.",
        "* T. Tanaka et al.",
        "Proceedings of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa014.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA015",
      "title": "RF Input Coupler for 20 K Cooled C-band 2.6-cell Photocathode RF Gun",
      "authors": [
        "T. Tanaka",
        "M. Inagaki",
        "K. Nakao",
        "K. Nogami",
        "T. Sakaipresenter",
        "LEBRA",
        "Funabashi",
        "Japan",
        "M.K. Fukuda",
        "T. Takatomi",
        "J. Urakawa",
        "M. Yoshida",
        "KEK",
        "Ibaraki",
        "Japan",
        "TIT",
        "Tokyo",
        "Japan",
        "Nihon University",
        "Tokyo",
        "Japan",
        "For future use in a compact linac-driven X-ray source",
        "a cryo-cooled C-band photocathode RF gun is under development. The RF experiment on the basic 2.6-cell test cavity has shown that the unloaded Q-value of the cavity at 20 K can be explained by the surface resistance based on the anomalous skin effect. Since the cavity was intended for preliminary experiments of the low temperature RF properties*",
        "a new test cavity with an RF input coupler has been designed. The basic structure of the accelerating cells has not been changed from the previous cavity. Avoiding an element with a low cooling efficiency such as the inner electrode in a coaxial coupler",
        "a simpler cylindrical input coupler has been designed. The coupler consists of a cylindrical TM01 mode waveguide and a mode converter from a rectangular TE10 mode",
        "with both elements placed on the accelerating axis. The structure and the dimensions of the coupler have been determined using the 3-D simulation code CST Studio so that the resonant frequency of the whole system and the coupling coefficient of the coupler meet the specifications of the RF gun. The new test cavity will be completed early in 2015 at KEK.",
        "* T. Tanaka et al.",
        "Proceedings of"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa015.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA016",
      "title": "CsKSb Photocathode R&D with High Quantum Efficiency and Long Lifetime",
      "authors": [
        "Y. Seimiya",
        "R. Kaku",
        "M. Kuriki",
        "A. Yokota",
        "HU/AdSM",
        "Higashi-Hiroshima",
        "Japan",
        "UVSOR",
        "Okazaki",
        "Japan",
        "T. Miyajima",
        "M. Yamamoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "Advanced electron linear accelerator such as Energy Recovery Linac and Free Electron Laser needs high brightness electron source. Photocathode is suitable for the high brightness requirement because some of them has low emittance and high quantum efficiency. In the photocathode",
        "CsKSb multi-alkali photocathode has excellent features: high quantum efficiency",
        "long lifetime",
        "and driven by visible light",
        "for example green laser. Therefore",
        "the multi-alkali photocathode is considered to be one of the best candidates for the high brightness electron source of the advanced electron accelerator. We report developments of our evaporation system and results of quantum efficiency and lifetime measurement in Hiroshima University. Multi-alkali surface analyzation has being measured by ultra-violet photoemission spectroscopy to study conditions between the multi-alkali performances and the surface condition in Institute Molecular Science. We also report the status of the progress abort the study."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa016.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA017",
      "title": "An Optimization of ILC Positron Source for Electron-Driven Scheme",
      "authors": [
        "Y. Seimiya",
        "M. Kuriki",
        "M. Urano",
        "HU/AdSM",
        "Higashi-Hiroshima",
        "Japan",
        "Tohoku University",
        "School of Science",
        "Sendai",
        "Japan",
        "T. Okugi",
        "T. Omori",
        "M. Satoh",
        "J. Urakawa",
        "KEK",
        "Ibaraki",
        "Japan",
        "Hiroshima University",
        "Graduate School of Science",
        "Higashi-Hiroshima",
        "Japan",
        "International Linear Collider is a future accelerator to find new physics behind the electroweak symmetry breaking by precise measurements of Higgs sector",
        "Top quark",
        "and so on. ILC has capacities to reveal new phenomena beyond Standard model",
        "such as Supersymmetry particles and dark matters. In current design of positron source",
        "undulator scheme is adapted as a baseline. In the scheme",
        "positrons are generated from gamma rays through pair-creation process in Ti-alloy target. Generations of the gamma rays by the undulator radiation requires more than 130 GeV electrons. Therefore",
        "a system demonstration of the scheme is practically difficult prior to the real construction. Consequently",
        "it is desirable to prepare a technical backup of this undulator scheme. We study an optimization of positron source based on the conventional electron-driven scheme for ILC. In this scheme",
        "positron beam is generated by several GeV electron beam impinging on W-Re target. Although heavy heat load and destruction of the target is a potential problem",
        "it can be relaxed by stretching the effective pulse length to 60 ms instead of 1 ms",
        "by a dedicated electron linac for the positron production. In this report",
        "a start-to-end simulation of the electron-driven ILC positron source is performed. Beam-loading effect caused by multi-bunch acceleration in the standing wave RF cavity is also considered."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa017.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA018",
      "title": "Re-acceleration of Ultra Cold Muon in J-PARC MLF",
      "authors": [
        "M. Yoshida",
        "F. Naito",
        "KEK",
        "Ibaraki",
        "Japan",
        "S. Artikova",
        "Y. Kondo",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "RLNR",
        "Tokyo",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "Gunma University",
        "Heavy-Ion Medical Research Center",
        "Maebashi-Gunma",
        "Japan",
        "The ultra cold muon beam by two-photon laser resonant ionization of muonium atoms is unique way to obtain very low emittance muon beam. Its muon source is a surface muon from the muon target in MLF where one percent proton beam from J-PARC RCS is reacted. In close collaboration with the Muon Science Es- tablishment (MUSE) at Material and Life science experi- mental Facility (MLF) of the Japan Proton Accelerator Re- search Complex (J-PARC)",
        "we are developing the reacceleration system of the ultra cold muon beam. Its optimum accelerating structure is similar to a proton accelerator in low beta part and an electron accelerator in high beta part. Further the muon bunch is only two bunch corresponding to the bunch structure of the J-PARC RCS. Thus we are testing the dielectric transmission line accelerator based on the photoconductive switch as the altenative acceleration method."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa018.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA019",
      "title": "Development of Accelerator-driven Compact Neutron Sources",
      "authors": [
        "K. Hirota",
        "G. Ichikawa",
        "M. Kitaguchi",
        "Y. Kiyanagi",
        "H.M. Shimizu",
        "K. Tsuchida",
        "A. Uritani",
        "K. Watanabe",
        "Nagoya University",
        "Nagoya",
        "Japan",
        "Neutron is a very good probe to investigate the inner structure of materials. The large neutron facilities like J-PARC MLF and SNS were constructed in this decade",
        "and ESS facility are start to construct. These large facilities are very good tools to study in academic field. But the construction cost is increasing and it is hard to construct at many facilities. And also it is hard to get long beam time. One of the solution of these problems are constructing Compact Accelerator-driven Neutron Source (CANS). We will present the current situation of CANS and the status of the facility of Nagoya University."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa019.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA021",
      "title": "A New DC Muon Beam Line at RCNP, Osaka University",
      "authors": [
        "Y. Matsumoto",
        "Y. Kohno",
        "Y. Kuno",
        "Y. Nakazawa",
        "H. Sakamoto",
        "A. Sato",
        "Osaka University",
        "Osaka",
        "Japan",
        "M. Fukuda",
        "K. Hatanaka",
        "Y. Kawashima",
        "S. Morinobu",
        "K. Takahisa",
        "H. Ueda",
        "RCNP",
        "Osaka",
        "Japan",
        "M. Ieiri",
        "M. Minakawa",
        "KEK",
        "Tsukuba",
        "Japan",
        "A new DC muon beam line has been constructed at RCNP",
        "Osaka University. The MuSIC",
        "which has the highest muon production efficiency using superconducting solenoidal magnets",
        "has successfully demonstrated to provide a 2x108 [mu+/sec/micro A]. In 2014",
        "the solenoid solenoidal magnets of the MuSIC were extended by a new beam line with normal conducting magnets. The new beamline consists of beam slits",
        "quadrupole magnets",
        "bending magnets and a spin rotator. This new beamline is designed for muon experiments such as μSR experiments and muonic X-ray measurements. In order to study the performance of the beams provided by the beamline",
        "a beam test will be performed in December 2014. In this paper",
        "I will present about a detail design of MuSIC including the new beamline and result of the beam test."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa021.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA023",
      "title": "Development of Muon LINAC for the Muon g-2/EDM Experiment at J-PARC",
      "authors": [
        "M. Otani",
        "Y. Fukao",
        "T. Mibe",
        "N. Saito",
        "M. Yoshida",
        "KEK",
        "Tsukuba",
        "Japan",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "University of Tokyo",
        "Tokyo",
        "Japan",
        "JAEA",
        "Ibaraki-ken",
        "Japan",
        "The muon anomalous magnetic moment (g-2) and electric dipole moment (EDM) are one of the effective paths to beyond Standard Model of elementary particle physics. The E34 experiment aims to measure g-2 with a precision of 0.1 ppm and search EDM with a sensitivity to 10-21 e*cm with high intensity proton driver at J-PARC and a newly developed novel technique of the ultra-cold muon beam. The ultra-cold muons",
        "which are generated from surface muons by the thermal muonium production and laser ionization",
        "are accelerated to 300 MeV/c by muon linear accelerator. The muon LINAC consists of RFQ and following three types of the RF cavities. The muon acceleration to this energy will be the first case in the world. This poster reports about status of the initial acceleration test with RFQ and the development of the RF cavities",
        "especially for the middle beta section."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA024",
      "title": "Development of a C-band RF Gun with a Coniferous-tree-type Carbon Nanostructure Field Emission Cathode",
      "authors": [
        "Y. Taira",
        "H. Kato",
        "R. Kuroda",
        "H. Toyokawa",
        "AIST",
        "Tsukuba",
        "Ibaraki",
        "Japan",
        "A C-band RF gun for compact radiation sources such as a high energy x-ray and a terahertz radiation is developed at AIST",
        "which is designed to work at the frequency of 5.3 GHz*. A coniferous-tree-type carbon nanostructure (CCNS) is used for a field emission cathode in the C-band RF gun. A graphene sheet composed of carbon has a coniferous form",
        "and the tip has a nanometer-size tubular structure that becomes thicker on the substrate side**. Owing to this configuration",
        "the CCNS has a large field enhancement factor",
        "and is considered to be more stable in high electric fields than Carbon nanotubes. We have fabricated the C-band RF gun of the single cell cavity. Emission current depending on the electric field strength on the CCNS cathode surface was measured. When the electric field strength was 30 MV/m",
        "the total charge per a macro pulse was 30 nC. After applying a stronger electric field",
        "a decline of the field enhancement factor was observed. We will present the experimental result of the field emission measurement of the CCNS and the simulation result of a beam trajectory using a C-band RF gun of a multi cell cavity.",
        "* Y. Taira et al.",
        "Nucl. Instr. and Meth. Phys. Res. B 331 (2014) 27. ** R. Suzuki",
        "Synthesiology 2 (3) (2009) 221."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa024.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA025",
      "title": "RF Acceleration of Ions Produced by Short Pulse Laser",
      "authors": [
        "Y. Fuwa",
        "M. Hashida",
        "Y. Iwashita",
        "S. Sakabe",
        "H. Tongu",
        "Kyoto ICR",
        "Uji",
        "Kyoto",
        "Japan",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Nagoya University",
        "Nagoya",
        "Japan"
      ],
      "institutions": [],
      "abstract": "RF acceleration of ions produced by short pulse laser is investigated. An RF cavity is prepared for the acceleration. Some experimental results will be presented. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa025_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa025.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa025_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA025",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA026",
      "title": "Loading of a Plasma-Wakefield Accelerator Section Driven by a Self-Modulated Proton Bunch",
      "authors": [
        "V.K.B. Olsen",
        "E. Adli",
        "University of Oslo",
        "Oslo",
        "Norway",
        "IST",
        "Lisboa",
        "Portugal",
        "MPI",
        "Muenchen",
        "Germany",
        "Instituto Superior Tecnico",
        "Lisbon",
        "Portugal"
      ],
      "institutions": [],
      "abstract": "We investigate beam loading of a plasma wake driven by a self-modulated proton beam using particle-in-cell simulations for phase III of the AWAKE project. We address the case of injection after the proton beam has already experienced self-modulation in a previous plasma. Optimal parameters for the injected electron bunch in terms of initial beam energy and beam charge density are investigated and evaluated in terms of witness bunch energy and energy spread. An approximate modulated proton beam is emulated in order to reduce computation time in these simulations. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa026_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa026.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa026_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA026",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA027",
      "title": "Gas Flow Influence on Negative Hydrogen Ion Generation within the Microwave-Driven Negative Ion Source",
      "authors": [
        "S.X. Peng",
        "J.E. Chen",
        "Z.Y. Guo",
        "H.T. Ren",
        "Y. Xu",
        "A.L. Zhang",
        "J.F. Zhang",
        "T. Zhang",
        "J. Zhao",
        "PKU",
        "Beijing",
        "People's Republic of China",
        "State Key Laboratory of Nuclear Physics and Technology",
        "Beijing",
        "Haidian District",
        "People's Republic of China",
        "H− ion was generated through two processes within a volume Cs- free source. The density of molecule hydrogen gas will impact the electron temperature within the primary discharge chamber that will influence the population of vibrationally excited H2*. Within the extraction region",
        "the interaction between molecule hydrogen and H− ion will is cause the dissociation of negative ion. To better understand the gas flow influence on H− ion generation within a volume negative ion source",
        "a new Cs-free volume microwave-driven H− source body with two gas inlets was developed at Peking University (PKU). Experiment on gas flow and gas pressure distribution within the plasma chamber was carried out with this source body. In the meantime a two dimensional (2D) model for gas flow was developed. Details will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "[1] S.X. Peng, H.T. Ren, Y. Xu, T. Zhang, etc., CW/Pulsed H− Ion Beam Generation with PKU Cs-free 2.45 GHz Microwave Driven Ion Source. O5-06, NIBS 2014, Accepted for publication in AIP, 2014/11/04. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa027_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa027.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa027_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA027",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA028",
      "title": "Numerical Simulation on Emittance Growth Caused by Roughness of a Metallic Photocathode",
      "authors": [
        "Z. Zhang",
        "C.-X. Tang",
        "TUB",
        "Beijing",
        "People's Republic of China"
      ],
      "institutions": [],
      "abstract": "The roughness of a photocathode could lead to an additional uncorrelated divergence of the emitted electrons and therefore to an increased thermal emittance. The randomness of the real-life photocathode surface makes it unrealistic to perform typical beam dynamics simulation to study the roughness emittance growth. We developed a numerical simulation code based on the point spread function (PSF) and an estimated form of electric field distribution on an arbitrary gently undulating surface to deal with the problem. The simulation result surprisingly shows that the emittance growth factor is much smaller than expected (1.5 ~ 2). reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa028_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa028.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa028_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA028",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA031",
      "title": "A Compact Multiply Charged Ion Source for Hadrontherapy Facility",
      "authors": [
        "L. Celona",
        "L. Andò",
        "G. Castro",
        "F. Chines",
        "G. Ciavola",
        "S. Gammino",
        "O. Leonardi",
        "D. Mascali",
        "L. Neri",
        "D. Nicolosi",
        "F. Noto",
        "F. Romano",
        "G. Torrisi",
        "INFN/LNS",
        "Catania",
        "Italy",
        "CNAO Foundation",
        "Milan",
        "Italy",
        "Universitá Mediterranea di Reggio Calabria",
        "Reggio Calabria",
        "Italy",
        "The ion sources",
        "required by medical applications",
        "must provide intense ion beams",
        "with high reproducibility",
        "stability and brightness. AISHa (Advanced Ion Source for Hadrontherapy) is a compact ECRIS whose hybrid magnetic system consists of a permanent Halbach-type hexapole magnet and a set of independently energized superconducting coils. These will be enclosed in a compact cryostat with two cryocoolers to operate without LHe. The microwave injection system has been designed for maximizing the beam quality through a fine frequency tuning within the 17.3-18.4 GHz band which is possible by using an innovative variable frequency klystron. The introduction of an integrated oven will allow the production of metal ions beams with relatively high intensity. “Accel-decel” extraction system will be used. The LEBT line will consist of a solenoid and a 90° dipole for ions selection. Two diagnostic boxes",
        "made of Faraday cups",
        "beam wires and slits",
        "will allow the investigation of the beam composition and its properties. Moreover",
        "a system of scintillating screens and CCD cameras",
        "placed after the solenoid will allow the investigation of the Frequency Tuning Effect on the source performances."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa031.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA032",
      "title": "CsK2Sb Growth Studies: Towards High Quantum Efficiency and Smooth Surfaces",
      "authors": [
        "S.G. Schubert",
        "M. Gaowei",
        "J. Sinsheimer",
        "J. Smedley",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Z. Ding",
        "E.M. Muller",
        "SBU",
        "Stony Brook",
        "New York",
        "USA",
        "HZB",
        "Berlin",
        "Germany",
        "H.A. Padmore",
        "J.J. Wong",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The properties of CsK2Sb",
        "make this material an ideal candidate as photocathode for electron injector use. Producing photocathodes with quantum efficiencies with 7% and greater at 532 nm poses no challenge",
        "nevertheless the traditional growth mechanisms",
        "which are based on a sequential deposition of Antimony",
        "Potassium and Cesium at a temperature gradient yield a rough surface with a rms roughness in the range of 25 nm. Surface roughness’s in this region impacts the emittance. At an accelerating field of 3 MV/m an rms surface roughness of 25 nm is the dominant effect on emittance and will limit injector performance. Studies are performed to optimize roughness. Various growth procedures are exploited and the surface roughness compared."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa032.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA033",
      "title": "Characterization of Laser-plasma Accelerated Electron Beam for a Compact Storage Ring",
      "authors": [
        "S. H. Park",
        "Y. Cha",
        "Y.U. Jeong",
        "J.S. Jo",
        "H.N. Kim",
        "K.N. Kim",
        "K. Lee",
        "W.J. Ryu",
        "J.S. Shinn",
        "N. Vinokurov",
        "KAERI",
        "Daejon",
        "Republic of Korea",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "A compact radiation source can be utilized by an electron beam from a Laser-plasma acceleration combined with localized shielding in a small laboratory. The stability of synchrotron radiation in wavelength and power depends on the shot-to-shot jitters of the energy and charge of an electron beam",
        "which is strongly influenced by the plasma density of target and the jitters of a laser beam. With the 30 TW fs laser in KAERI",
        "the optimization for generating the electron beam have done using the different shape of gas nozzle. We also present the pointing stability and the energy spread of the laser-accelerated electron beams."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa033.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA034",
      "title": "High-charge-short-bunch Operation Possibility at Argonne Wakefield Accelerator Facility",
      "authors": [
        "G. Ha",
        "M.-H. Cho",
        "W. Namkung",
        "POSTECH",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "W. Gai",
        "G. Ha",
        "K.-J. Kim",
        "J.G. Power",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Originally the drive beam line at Argonne Wakefield Accelerator (AWA) Facility was designed to generate the high charge bunch train. However",
        "we recently installed the double dog-leg type emittance exchange beam line which have two identical dog-leg structures. With this beam line",
        "it is possible to compress the bunch by introducing the chicane or using single dog-leg. Simulation studies have been carried out to confirm the minimum bunch length for each charge and the emittance growth by the coherent synchrotron radiation. We present GPT simulation results to show high-charge-short-bunch operation possibility at AWA facility."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa034.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA035",
      "title": "Initial EEX-based Bunch Shaping Experiment Results at the Argonne Wakefield Accelerator Facility",
      "authors": [
        "G. Ha",
        "M.-H. Cho",
        "W. Namkung",
        "POSTECH",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "M.E. Conde",
        "D.S. Doran",
        "W. Gai",
        "G. Ha",
        "C.-J. Jing",
        "K.-J. Kim",
        "W. Liu",
        "J.G. Power",
        "Y.-E. Sun",
        "C. Whiteford",
        "E.E. Wisniewski",
        "A. Zholents",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "Euclid TechLabs",
        "LLC",
        "Solon",
        "Ohio",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "A program is under development at Argonne National Laboratory to use an emittance exchange (EEX) beamline to perform longitudinal bunch shaping (LBS). The double dog-leg EEX beamline was recently installed at the Argonne Wakefield Accelerator (AWA) and the goals of the proof-of-principle experiment are to demonstrate LBS and characterize its deformations from the ideal shape due to higher-order and collective effects. The LBS beamline at the AWA consists of insert-able transverse masks mounted on an actuator and four quadrupoles (to manipulate the transverse phase space) before the EEX beamline",
        "which consists of two identical dog-legs and a deflecting cavity. The mask and input beam parameters are varied during the experiment to explore the shaping capability and clarify the deformation sources and their mitigation. Progress on the commissioning of the LBS beamline",
        "initial experimental data and benchmarks to GPT simulations will be presented."
      ],
      "institutions": [
        "Funding: This work is partly supported by POSTECH BK21+ and Argonne National Laboratory"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa035.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA037",
      "title": "Beam-Driven Terahertz Source Based on Open Ended Waveguide with a Dielectric Layer: Rigorous Approach",
      "authors": [
        "S.N. Galyamin",
        "A.A. Grigoreva",
        "A.V. Tyukhtin",
        "V.V. Vorobevpresenter",
        "Saint-Petersburg State University",
        "Saint-Petersburg",
        "Russia",
        "Terahertz frequency radiation (0.1-10 THz) is a promising tool for a number of scientific and practical applications. One promising scheme to obtain powerful and efficient THz emission is usage of beam-driven dielectric loaded structures [1]. Recently we have considered the problem where the microbunched ultrarelativistic charge exits the open end of a cylindrical waveguide with a dielectric layer and produces THz waves in a form of Cherenkov radiation [2]. To investigate the applicability of utilized approximations",
        "we analyze here the case of orthogonal end of a waveguide with continuous filling. However",
        "presented rigorous approach can be generalized for waveguide with vacuum channel. We use the combination of Wiener-Hopf technique and tailoring technique. The infinite linear system for magnitudes of reflected waveguide modes is obtained and solved numerically. We present typical field distributions over the aperture and typical radiation patterns in the Fraunhofer zone.",
        "* S. Antipov et al.",
        "Appl. Phys. Lett. 100",
        "132910 (2012). ** S.N. Galyamin et al.",
        "Opt. Express. 22(8)",
        "8902 (2014)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa037.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA038",
      "title": "Mode Transformation in Waveguide with Transversal Boundary  Between Vacuum and Partially Dielectric Area",
      "authors": [
        "A.A. Grigoreva",
        "T.Yu. Alekhina",
        "S.N. Galyamin",
        "A.V. Tyukhtin",
        "Saint-Petersburg State University",
        "Saint-Petersburg",
        "Russia"
      ],
      "institutions": [],
      "abstract": "We consider the mode transformation in a circular waveguide with a transversal boundary between a vacuum part and a part with a cylindrical dielectric layer and a vacuum channel. It is assumed that an incident mode can be both propagating and evanescent. Analysis is carried out with the using the mode decomposition technique. Numerical algorithm for calculating the mode transformation at an arbitrary channel radius is also developed. Typical dependences for the reflection and transmission coefficients on the channel radius are presented and discussed. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa038.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA039",
      "title": "The AWAKE Electron Primary Beam Line",
      "authors": [
        "J.S. Schmidt",
        "J. Bauche",
        "B. Biskup",
        "C. Bracco",
        "E. Bravin",
        "S. Döbert",
        "M.A. Fraser",
        "B. Goddard",
        "E. Gschwendtner",
        "L.K. Jensen",
        "O.R. Jones",
        "S. Mazzoni",
        "M. Meddahi",
        "A.V. Petrenko",
        "F.M. Velottipresenter",
        "A.S. Vorozhtsov",
        "CERN",
        "Geneva",
        "Switzerland",
        "DESY",
        "Hamburg",
        "Germany",
        "L. Merminga",
        "V.A. Verzilov",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "MPI",
        "Muenchen",
        "Germany",
        "The AWAKE project at CERN is planned to study proton driven plasma wakefield acceleration. The proton beam from the SPS will be used in order to drive wakefields in a 10 m long Rb plasma cell. In the first phase of this experiment",
        "scheduled in 2016",
        "the self-modulation of the proton beam in the plasma will be studied in detail",
        "while in the second phase an external electron beam will be injected into the plasma wakefield to probe the acceleration process. The installation of AWAKE in the former CNGS experimental area and the required optics flexibility define the tight boundary conditions to be fulfilled by the electron beam line design. The transport of low energy (10-20 MeV) bunches of 1.25·109 electrons and the synchronous copropagation with much higher intensity proton bunches (3E11) determines several technological and operational challenges for the magnets and the beam diagnostics. The current status of the electron line layout and the associated equipments are presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa039.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA040",
      "title": "Generation and Radiation of PHz Ring-Like Electron-Pulse Train",
      "authors": [
        "F.H. Chao",
        "C.H. Chen",
        "Y.-C. Huang",
        "NTHU",
        "Hsinchu",
        "Taiwan",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "In a superradiant FEL",
        "the constructive interference of the radiation fields from a periodic electron-pulse train rapidly increases the radiation power at the harmonics of the pulse frequency with a narrow spectrum bandwidth. To generate radiation in the X-ray spectrum",
        "the corresponding pulse frequency of the pre-bunched electron beam should be few tens or even few hundreds PHz. The repetition rate of electron pulses generated from an ordinary RF photoinjector is usually at 10-100 Hz. Even though a superconducting RF accelerator could further increase the repetition rate of electron pulses to few MHz",
        "it is far below the pulse frequency required for a superradiant XFEL. In this paper",
        "we study a technique to generate a PHz ring-like electron-pulse train from an RF photoinjector with a spatially modulated driver laser and a structured photocathode. Our simulation in PARMELA confirms the feasibility of generating such a structured electron-pulse train from the photoinjector. We present our study on the beam dynamics of the structured electron-pulse train during acceleration and the radiation behavior of it in the far field in comparison with that of an ordinary electron beam."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa040.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA041",
      "title": "Plans for a Linear Paul Trap at Rutherford Appleton Laboratory",
      "authors": [
        "D.J. Kelliher",
        "S. Machida",
        "D.C. Plostinar",
        "C.R. Prior",
        "S.L. Sheehy",
        "STFC/RAL/ASTeC",
        "Chilton",
        "Didcot",
        "Oxon",
        "United Kingdom",
        "For over a decade",
        "Linear Paul Traps (LPT) have been used in the study of accelerator beam dynamics. LPT studies exploit the similarity of the Hamiltonian with that of a beam in a quadrupole channel while having advantages in the flexibility of parameter choice",
        "compactness and low cost. In collaboration with Hiroshima University",
        "LPT research planned at STFC Rutherford Appleton Laboratory in the UK aims to investigate a range of topics including resonance crossing",
        "halo formation",
        "long-term stability studies and space-charge effects. Initially",
        "a conventional quadrupole-based LPT will be built at RAL and used for a variety of experiments. In parallel",
        "a design for a more advanced LPT that incorporates higher order multipoles will be pursued and later constructed. This multipole trap will allow non-linear lattice elements to be simulated and so broaden considerably the range of experiments that can be conducted. These will include the investigation of resonance crossing in non-linear lattices",
        "a more detailed study of halo formation and the effect of detuning with amplitude. In this paper we report on progress made in the project to date and future plans."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa041.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA043",
      "title": "Progress on the Design of the Racetrack FFAG Decay Ring for nuSTORM",
      "authors": [
        "J.-B. Lagrange",
        "J. Pasternak",
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "R.B. Appleby",
        "J.M. Garland",
        "H.L. Owen",
        "S.C. Tygier",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Kyoto University",
        "Research Reactor Institute",
        "Osaka",
        "Japan",
        "The neutrino beam produced from muons decaying in a storage ring would be an ideal tool for precise neutrino cross section measurements and search for sterile neutrinos due to its precisely known flavour content and spectrum. In the proposed nuSTORM facility pions would be directly injected into a storage ring",
        "where circulating muon beam would be captured. The racetrack FFAG (Fixed Field Alternating Gradient) option for nuSTORM decay ring offers a very good performance due to a large dynamic and momentum acceptance. Machine parameters",
        "linear optics design",
        "beam dynamics and injection system for nuSTORM FFAG ring are discussed in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa043.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA044",
      "title": "The Alignment of the MICE Tracker Detectors",
      "authors": [
        "Imperial College of Science and Technology",
        "Department of Physics",
        "London",
        "United Kingdom",
        "The Muon Ionization Cooling experiment (MICE) has been designed to demonstrate the reduction of the phase-space volume (cooling) occupied by a muon beam using the ionization-cooling technique. This demonstration will be an important step in establishing the feasibility of muon accelerators for particle physics. The emittance of the beam will be measured before and after the cooling cell using a solenoidal spectrometer. Each spectrometer will be instrumented with a high-precision scintillating-fibre tracking detector (Tracker). The Trackers will be immersed in a uniform magnetic field of 4T and will measure the normalised emittance reduction with a precision of 0.1%. A thorough knowledge of the alignment of the Trackers is essential for this accuracy to be achieved. The Trackers are aligned: mechanically inside the spectrometer solenoids",
        "with respect to the MICE experimental hall",
        "to one another",
        "and to the magnetic and beam axes. These methods are described here."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa044.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA045",
      "title": "Development of a Spectrometer for Proton Driven Plasma Wakefield Accelerated Electrons at AWAKE",
      "authors": [
        "L.C. Deacon",
        "S. Jolly",
        "F. Keeble",
        "M. Wing",
        "UCL",
        "London",
        "United Kingdom",
        "Czech Technical University",
        "Prague 6",
        "Czech Republic",
        "B. Biskup",
        "E. Bravin",
        "A.V. Petrenko",
        "CERN",
        "Geneva",
        "Switzerland",
        "DESY",
        "Hamburg",
        "Germany",
        "University of Hamburg",
        "Hamburg",
        "Germany",
        "The AWAKE experiment is to be constructed at the CERN Neutrinos to Gran Sasso facility (CNGS). This will be the first experiment to demonstrate proton-driven plasma wakefield acceleration. The 400 GeV proton beam from the CERN SPS will excite a wakefield in a plasma cell several metres in length. To observe the plasma wakefield",
        "electrons of 10–20 MeV will be injected into the wakefield following the head of the proton beam. Simulations indicate that electrons will be accelerated to GeV energies by the plasma wakefield. The AWAKE spectrometer is intended to measure both the peak energy and energy spread of these accelerated electrons. Improvements to the baseline design are presented",
        "with an alternative dipole magnet and quadrupole focussing",
        "with the resulting energy resolution calculated for various scenarios. The signal to background ratio due to the interaction of the SPS protons with upstream beam line components is calculated",
        "and CCD camera location",
        "shielding and light transport are considered."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA046",
      "title": "Time Domain Simulations of Detuned Accelerating Cavities for Two Beam Applications",
      "authors": [
        "R.M. Jones",
        "L.R. Carver",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "A multi-harmonic accelerating cavity that has its fundamental and harmonic mode frequency detuned away from the bunch repetition frequency could provide the basis for a beam driven wakefield accelerator with high transformer ratios. The excitation of multiple harmonic eigenmodes will allow high gradients to be achieved without encouraging the onset of rf breakdown or pulsed surface heating. This accelerating cavity will be introduced",
        "and time domain simulations verifying the theory will be shown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA047",
      "title": "Emittance Growth in a Plasma Wakefield Accelerator",
      "authors": [
        "Ö. Mete",
        "K. Hanahoe",
        "G.X. Xia",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The interaction of the witness beam with the surrounding plasma particles and wakefields was studied. The implications of the elastic scattering process on beam emittance and",
        "emittance evolution under the focusing and acceleration provided by plasma wakefields were discussed. Simulations results from"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa047.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA048",
      "title": "Design Studies and Commissioning Plans for PARS Experimental Program",
      "authors": [
        "Ö. Mete",
        "K. Hanahoe",
        "J. Wright",
        "G.X. Xia",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "M. Dover",
        "M. Wigram",
        "J. Zhang",
        "University of Manchester",
        "Manchester",
        "United Kingdom",
        "Tech-X",
        "Boulder",
        "Colorado",
        "USA",
        "PARS (Plasma Acceleration Research Station) is an electron beam driven plasma wakefield acceleration test stand proposed for VELA/CLARA facility in Daresbury Laboratory. In order to optimise various operational configurations",
        "2D numerical studies were performed by using VSIM for a range of parameters such as bunch length",
        "radius",
        "plasma density and positioning of the bunches with respect to each other for the two-beam acceleration scheme. In this paper",
        "some of these numerical studies and considered measurement methods are presented."
      ],
      "institutions": [
        "Funding: Science and Technology Facilities Council and Cockcroft Institute Core Grant"
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa048.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA049",
      "title": "Low Energy Beam Tracking Under Scattering for a Cold Electron Source in Manchester",
      "authors": [
        "R.B. Appleby",
        "W. Bertsche",
        "O. Metepresenter",
        "G.X. Xia",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "M.A. Harvey",
        "M. Jones",
        "A.J. Murray",
        "The University of Manchester",
        "The Photon Science Institute",
        "Manchester",
        "United Kingdom",
        "University of Manchester",
        "Manchester",
        "United Kingdom",
        "High quality electron beams",
        "with high spatial and temporal resolution",
        "have an important use in electron diffraction experiments to probe and study the constituents of matter. A cold electron source is being developed based on electron ionisation from an atom cloud trapped by using AC magneto-optical methods in the University of Manchester. The technique will produce bunches of electrons well suited for high precision and single shot electron diffraction. In this paper issues of modelling at low energies for this state of art electron source with very low energy spread are presented",
        "with a focus on newly developed tools to model the scattering in the meshes used to support the extraction electric fields. The dependence on emittance growth on mesh wire thickness is studied."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa049.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA051",
      "title": "Investigations into Dielectric Laser-Driven Accelerators using the CST and VSIM Simulation Codes",
      "authors": [
        "Y. Wei",
        "C.P. Welsch",
        "G.X. Xia",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "K. Hanahoe",
        "K. Hanahoe",
        "Ö. Mete",
        "G.X. Xia",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "Tech-X",
        "Boulder",
        "Colorado",
        "USA",
        "Y. Wei",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "Dielectric laser-driven accelerators (DLAs) based on gratings structures confine the laser-induced accelerating field in a narrow vacuum channel where the electrons travel and are being accelerated. Recent proof-of-principle experiments have successfully demonstrated acceleration of electrons with accelerating gradients of up to 250 MV/m in such novel structures. This contribution presents detailed numerical studies into the acceleration of relativistic and non-relativistic electrons in double gratings silica structures. The optimization of these structures with regards to maximum acceleration efficiency for different spatial harmonics is discussed. Simulations were carried out using the commercial CST and VSIM simulation codes and results from both codes are shown in comparison. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa051.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA052",
      "title": "RF Conditioning of the Photo-Cathode RF Gun at the Advanced Photon Source - NWA RF Measurements",
      "authors": [
        "T.L. Smith",
        "N.P. DiMonte",
        "A. Nassiri",
        "Y.-E. Sun",
        "A. Zholents",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "A new S-band photo-cathode (PC) gun was recently installed and RF conditioned at the Advanced Photon Source (APS) Injector Test-stand (ITS) at Argonne National Lab (ANL). The APS PC gun is a LCLS type gun fabricated at SLAC [1]. The PC gun was delivered to the APS in October 2013 and installed in the APS ITS in December 2013. At ANL",
        "we developed a new method of fast detection and mitigation of the gun’s internal arcs during the RF conditioning process to protect the gun from arc damage and to RF condition more efficiently. Here",
        "we report the results of RF measurements for the PC gun and an Auto-Restart method for high power RF conditioning."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa052.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA053",
      "title": "First Acceleration in a Resonant Optical-Scale Laser-Powered Structure",
      "authors": [
        "Goucher College",
        "Baltimore",
        "Maryland",
        "USA",
        "R.J. England",
        "Z. Wu",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "K.S. Hazra",
        "B. Matthews",
        "J.C. McNeur",
        "E.B. Sozer",
        "G. Travish",
        "UCLA",
        "Los Angeles",
        "USA",
        "E.A. Peralta",
        "K. Soong",
        "Stanford University",
        "Stanford",
        "California",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa053.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA055",
      "title": "Proton Injection into the Fermilab Integrable Optics Test Accelerator (IOTA)",
      "authors": [
        "E. Prebys",
        "S. A. Antipov",
        "H. Piekarz",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "University of Chicago",
        "Chicago",
        "Illinois",
        "USA",
        "The Integrable Optics Test Accelerator (IOTA) is an experimental synchrotron being built at Fermilab to test the concept of non-linear \"integrable optics\". These optics are based on a lattice including non-linear elements that satisfies particular conditions on the Hamiltonian. The resulting particle motion is predicted to be stable but without a unique tune. The system is therefore insensitive to resonant instabilities and can in principle store very intense beams",
        "with space charge tune shifts larger than those which are possible in conventional linear synchrotrons. The ring will initially be tested with pencil electron beams",
        "but this poster describes the ultimate plan to install a 2.5 MeV RFQ to inject protons",
        "which will produce tune shifts on the order of unity. Technical details will be presented",
        "as well as simulations of protons in the ring."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa055.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA056",
      "title": "The Sinuous Target",
      "authors": [
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "We report on the concept for a target material comprised of a multitude of interlaced wires of small dimension. This target material concept is primarily directed at high-power neutrino targets where the thermal shock is large due to small beam sizes and short durations; it also has applications to other high-power targets",
        "particularly where the energy deposition is great or a high surface area is preferred. This approach ameliorates the problem of thermal shock by engineering a material with high strength on the microscale",
        "but a very low modulus of elasticity on the mesoscale. The low modulus of elasticity is achieved by constructing the material of spring-like wire segments much smaller than the beam dimension. The intrinsic bends of the wires will allow them to absorb the strain of thermal shock with minimal stress. Furthermore",
        "the interlaced nature of the wires provides containment of any segment that might become loose. We will discuss the progress on studies of analogue materials and fabrication techniques for sinuous target materials."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa056.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA057",
      "title": "Design Concepts for Muon-Based Accelerators",
      "authors": [
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "Y.I. Alexahin",
        "A.D. Bross",
        "K. E. Gollwitzer",
        "N.V. Mokhov",
        "D.V. Neuffer",
        "M.A. Palmer",
        "K. Yonehara",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "J.S. Berg",
        "H.G. Kirk",
        "R.B. Palmer",
        "D. Stratakis",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illinois",
        "USA",
        "Muon-based accelerators have the potential to enable facilities at both the Intensity and the Energy Frontiers. Muon storage rings can serve as high precision neutrino sources",
        "and a muon collider is an ideal technology for a TeV or multi-TeV collider. Progress in muon accelerator designs has advanced steadily in recent years. In regard to 6D muon cooling",
        "detailed and realistic designs now exist that provide more than 5 order-of-magnitude emittance reduction. Furthermore",
        "detector performance studies indicate that with suitable pixelation and timing resolution",
        "backgrounds in the collider detectors can be significantly reduced thus enabling high quality physics results. Thanks to these and other advances in design & simulation of muon systems",
        "technology development",
        "and systems demonstrations",
        "muon storage-ring-based neutrino sources and a muon collider appear more feasible than ever before. A muon collider is now arguably among the most compelling approaches to a multi-TeV lepton collider. This paper summarizes the current status of design concepts for muon-based accelerators for neutrino factories and a muon collider."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa057.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA059",
      "title": "RF Plasma-Based Ion Source Modeling on Unstructured Meshes",
      "authors": [
        "S.A. Veitzer",
        "K.R.C. Beckwith",
        "M. Kundrapu",
        "Tech-X",
        "Boulder",
        "Colorado",
        "USA",
        "Ion source performance for accelerators and industrial applications can be improved through detailed numerical modeling and simulation. There are a number of technical complexities with developing robust models",
        "including a natural separation of important time scales (rf",
        "electron and ion motion)",
        "inclusion of plasma chemistry",
        "and surface effects such as secondary electron emission and sputtering. Due to these computational requirements",
        "it is typically difficult to simulate ion sources with Particle-In-Cell codes. An alternative is to use fluid-based codes coupled with electromagnetics in order to model ion sources. These types of models can simulate plasma evolution and rf-driven flows while maintaining good performance. We show here recent results on modeling the H− ion source for the Spallation Neutron Source (SNS) at Oak Ridge National Laboratory (ORNL) using the fluid plasma modeling code USim. We present new meshing capabilities for generating and parallelizing unstructured computational meshes that have increased our parallel code performance and enabled us to model inductively coupled plasmas for long periods of operation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa059.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA060",
      "title": "Interaction of a Volumetric Metamaterial Structure with an Electron Beam",
      "authors": [
        "X.Y. Lu",
        "M.A. Shapiro",
        "R.J. Temkin",
        "MIT/PSFC",
        "Cambridge",
        "Massachusetts",
        "USA",
        "A volumetric metallic metamaterial structure with a cubic unit cell is introduced. The unit cells can naturally fill all of space without additional substrates or waveguides. The structure can support a negative longitudinal electric mode that can couple to an electron beam. The dispersion characteristics of the unit cell are modeled by the effective medium theory with spatial dispersion. The theory also predicts the correct resonant frequencies of the emitted radiation excited by an electron beam traversing the structure. In the wakefield simulations",
        "a backward radiation pattern is observed. The proposed metamaterial can be applied to beam diagnostics and wakefield acceleration."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa060.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA061",
      "title": "High-Gradient Testing of Metallic Photonic Band-gap (PBG) and Disc-Loaded Waveguide (DLWG) Structures at 17 GHz",
      "authors": [
        "B.J. Munroe",
        "M.A. Shapiro",
        "R.J. Temkin",
        "J.X. Zhang",
        "MIT/PSFC",
        "Cambridge",
        "Massachusetts",
        "USA",
        "Photonic Band-gap (PBG) structures continue to be a promising area of research for future accelerator structures. Previous experiments at 11 GHz have demonstrated that PBG structures can operate at high gradient and low breakdown probability",
        "provided that pulsed heating is controlled. A metallic single-cell standing-wave PBG structure has been tested at 17 GHz at MIT to investigate how breakdown probability scales with frequency in these structures. A single-cell standing-wave disc-loaded waveguide (DLWG) was also tested at MIT as a reference structure. The PBG structure achieved greater than 90 MV/m gradient at 100 ns pulse length and a breakdown probability of 1.1 *10-1 /pulse/m. The DLWG structure achieved 90 MV/m gradient at 100 ns pulse length and a breakdown probability of 1.2 *10-1 /pulse/m",
        "the same as the PBG structure within experimental error. These tests were conducted at the MIT structure test stand",
        "and represent the first long-pulse breakdown testing of accelerator structures above X-Band."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa061.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA062",
      "title": "Design and High-Power Testing of a Hybrid Photonic Band-Gap (PBG) Accelerator Structure at 17 GHz",
      "authors": [
        "J.X. Zhang",
        "A.M. Cook",
        "B.J. Munroe",
        "M.A. Shapiro",
        "R.J. Temkin",
        "H. Xu",
        "MIT/PSFC",
        "Cambridge",
        "Massachusetts",
        "USA",
        "An overmoded hybrid Photonic Band Gap (HPBG) structure used as an accelerator cavity has been theoretically designed and high power tested at 17.1 GHz. The HPBG structure consists of a triangular lattice of dielectric (sapphire) and metallic (copper) rods. Due to the frequency selectivity",
        "the hybrid PBG cavity can be operated in a TM02 mode. The maximum surface fields are on the triple point of the innermost row of the sapphire rods. The relatively high value of the surface fields resulted in a high breakdown rate (BDR) at a low gradient in the HPBG structure. Breakdown damage on the triple point edge and the metallization of copper onto the sapphire surface have been observed in the post-testing images. An improved HPBG design",
        "that reduces the peak fields",
        "has been developed. It will be built and tested in an effort to improve the HPBG performance."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa062.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA063",
      "title": "Beam-Plasma Effects in Muon Ionization Cooling Lattices",
      "authors": [
        "J.S. Ellison",
        "P. Snopok",
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "New computational tools are essential for accurate modeling and simulation of the next generation of muon based accelerator experiments. One of the crucial physics processes specific to muon accelerators that has not yet been implemented in any current simulation code is beam induced plasma effect in liquid",
        "solid",
        "and gaseous absorbers. We report here on the progress of developing the required simulation tools and applying them to study the properties of plasma and its effects on the beam in muon ionization cooling channels."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa063.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA064",
      "title": "Ionization Cooling Channels in COSY Infinity",
      "authors": [
        "B.T. Loseth",
        "M. Berz",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illinois",
        "USA",
        "Ionization cooling is a method to reduce the emittance of a beam through the use of absorbers",
        "rf cavities",
        "and strong solenoids for focusing",
        "arranged into a condensed lattice. By tuning lattice parameters",
        "it is possible to construct a staged cooling channel in which the beam emittance is always considerably greater than the minimum value. In the late stages of the cooling channel",
        "space charge effects can become a significant obstacle to further emittance reduction once the beam becomes sufficiently condensed. A method has been implemented in COSY Infinity",
        "a beam dynamics simulation and analysis code",
        "which efficiently and accurately calculates the self-fields of all particles on each other based on a variant of the Fast Multipole Method (FMM). In this paper",
        "we present simulations of a muon ionization cooling channel performed in COSY",
        "utilizing the FMM",
        "benchmarked against G4beamline",
        "a standard code for muon beam analysis",
        "in order to investigate the significance of space charge effects."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa064.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA064",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA066",
      "title": "The Advancement of Cooling Absorbers in COSY Infinity",
      "authors": [
        "IIT",
        "Chicago",
        "Illinois",
        "USA",
        "M. Berz",
        "K. Makino",
        "MSU",
        "East Lansing",
        "Michigan",
        "USA",
        "Illinois Institute of Technology",
        "Chicago",
        "Illlinois",
        "USA",
        "COSY Infinity is an arbitrary-order beam dynamics simulation and analysis code. It can determine high-order transfer maps of combinations of particle optical elements of arbitrary field configurations. For precision modeling",
        "design",
        "and optimization of next-generation muon beam facilities",
        "its features make it a very attractive code. New features are being developed for inclusion in COSY to follow the distribution of charged particles through matter. To study in detail some of the properties of muons passing through material",
        "the transfer map approach alone is not sufficient. The interplay of beam optics and atomic processes must be studied by a hybrid transfer map–Monte-Carlo approach in which transfer map methods describe the average behavior of the particles in the accelerator channel including energy loss",
        "and Monte-Carlo methods are used to provide small corrections to the predictions of the transfer map accounting for the stochastic nature of scattering and straggling of particles. The advantage of the new approach is that it is very efficient in that the vast majority of the dynamics is represented by fast application of the high-order transfer map of an entire element and accumulated stochastic effects as well as possible particle decay. The gains in speed are expected to simplify the optimization of muon cooling channels which are usually very computationally demanding due to the need to repeatedly run large numbers of particles through large numbers of configurations. Progress on the development of the required algorithms is reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa066.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA067",
      "title": "Acoustic Breakdown Localization in RF Cavities",
      "authors": [
        "P.G. Lane",
        "P. Snopokpresenter",
        "Y. Torun",
        "Illinois Institute of Technology",
        "Chicago",
        "Illinois",
        "USA",
        "E. Behnke",
        "I.Y. Levine",
        "Indiana University South Bend",
        "South Bend",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "Current designs for muon cooling channels require high-gradient RF cavities to be placed in solenoidal magnetic fields in order to contain muons with large transverse emittances. It has been found that doing so reduces the threshold at which RF cavity breakdown occurs. To aid the effort to study RF cavity breakdown in magnetic fields it would be helpful to have a diagnostic tool which can detect breakdown and localize the source of the breakdown inside the cavity. We report here on acoustic simulations and comparisons with experimental acoustic data of breakdown from several RF cavities. Included in this analysis are our most recent results from attempting to localize breakdown using these data. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa067.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA068",
      "title": "Simulation of Laser Pulse Driven Terahertz Generation in Inhomogeneous Plasmas",
      "authors": [
        "C.M. Miao",
        "T.M. Antonsen",
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "Icarus Research",
        "Inc.",
        "Bethesda",
        "Maryland",
        "USA",
        "Intense",
        "short laser pulses propagating through inhomogeneous plasma can ponderomotively drive THz radiation. Here we consider a transition radiation mechanism (TRM) for THz generation as a laser pulse crosses a plasma boundary. Full format PIC simulations and theoretical analysis are conducted demonstrating that TRM results in low frequency",
        "broad band",
        "coherent THz radiation. The effect of a density ramp is also considered and shown to enhance the radiated energy."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa068.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA070",
      "title": "Considerations for an Efficient Terahertz-driven Electron Gun",
      "authors": [
        "F. Lemery",
        "P. Piot",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "We investigate a dispersion-controlled-acceleration scheme of low-energy electrons to mitigate phase slipping using a tapered dielectric lined waveguide (DLW). Our approach matches the velocity of an electron being accelerated in a slab-symmetric structure in a constant electric field. We also present first experimental results of a THz pulse propagating in a slab-symmetric DLW. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa070.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA070",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA071",
      "title": "A Compact X-Ray Source Based on a Low-Energy Beam-Driven Wakefield Accelerator",
      "authors": [
        "F. Lemery",
        "D. Mihalcea",
        "P. Piot",
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "IAC",
        "Pocatello",
        "Idaho",
        "USA",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Accelerator-based X-ray sources have led to many scientific breakthroughs. Yet",
        "their limited availability in large national laboratory settings due to the required infrastructure is a major limitation to their disseminations to a larger user community. In this contribution we explore the use of a low-energy electron beam produced out of a photoinjector coupled to a dielectric structure to produce a higher energy (~10-20 MeV) beam via a beam-driven acceleration scheme. The accelerated beam can then be used to produce X-ray via inverse Compton scattering. This paper discusses the concept and presents start-to-end simulations of the proposed setup."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa071_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa071.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa071_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA071",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPWA072",
      "title": "Feasibility of Continuously Focused TeV/m Channeling Acceleration with CNT-Channel",
      "authors": [
        "Northern Illinois University",
        "DeKalb",
        "Illinois",
        "USA",
        "A.H. Lumpkin",
        "V.D. Shiltsev",
        "R.M. Thurman-Keup",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/wepwa072_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/wepwa072.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/wepwa072_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-WEPWA072",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 57,
  "scrape_time": "2025-10-10 20:29:25"
}