{
  "session_info": {
    "id": "WEOPMA",
    "name": "WEOPMA - Core Technology Developments",
    "url": "https://proceedings.jacow.org/medsi2018/html/weopma.htm"
  },
  "papers": [
    {
      "paper_id": "WEOPMA02",
      "title": "Non-Contact Luminescence Lifetime Cryothermometry for Application in Vacuum Environment",
      "authors": [
        "V.B. Mykhaylyk",
        "A. Wagner",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Oxford University",
        "Physics Department",
        "Oxford",
        "Oxon",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "Measurement of the temperature of cryogenically cooled samples in a vacuum environment is a challenging task that requires specialist technical solutions. A new technique enabling non-contact monitoring of temperature has been developed for the I23 beamline. The temperature is determined by measuring the luminescence decay constant of a Bi4Ge3O12 scintillation sensor. One of the main advantages of the non-contact thermometry system is elimination of any connections between the sensor and the readout system that makes it fully compatible with the vacuum environment and necessity of swift replacement and manipulation of the samples. The technique was applied to quantify the thermal performance of different sample mounts that has been used for MX experiment at I23 beamline. It has been shown that the magnitude of the temperature rise across the sample mounts varies in wide range from 60 to 110 K while the temperature of goniometer was 40 K. The obtained results not only explain previous empirical finding but also demonstrated how this technique can aid studies of the complex relationships between various parameters influencing the heat conductance and temperature of the samples.",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weopma02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weopma02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weopma02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEOPMA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "WEOPMA03",
      "title": "Application of Additive Manufacturing in the Development of a Sample Holder for a Fixed Target Vector Scanning Diffractometer at SwissFEL",
      "authors": [
        "X. Wang",
        "P. Hirschi",
        "J. Hora",
        "H. Jöhri",
        "B. Pedrini",
        "C. Pradervand",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "Whilst the benefit of additive manufacturing (AM) in rapid prototyping becomes more and more established",
        "the direct application of 3D printed part is still demanding. Exploitation of AM opens the door for complex and optimized parts which are otherwise impossible to fabricate. In the meanwhile",
        "specific knowledge and aspects in analysis and design process are still to be explored. For a fixed target vector scanning diffractometer [1] at SwissFEL we developed",
        "manufactured and tested a 3D-printed sample holder with carbon fiber reinforced plastics material. The diffractometer for serial crystallography is dedicated to collect diffraction patterns at up to 100 Hz on many small crystals (< 5 µm) by scanning the sample support in a continuous",
        "arbitrary motion. The high dynamics arising from curved trajectories in the xy-plane requires a light and stiff sample holder which attaches the sample to the stage. In addition to 3D printed parts",
        "an aluminum counterpart produced by CNC machining has also been tested and carefully evaluated. Our work in the course of development process on topology optimization",
        "design",
        "manufacturing and dynamic verification tests will be presented.",
        "[1] C. Pradervand et al.",
        "SwissMX: Fixed Target vector scanning diffractometer for Serial Crystallography at SwissFEL",
        "SRI 2018"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weopma03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weopma03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weopma03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEOPMA03",
      "page_number": "158",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOPMA04",
      "title": "Mechanical Design of a New Precision Alignment Apparatus for Compact X-ray Compound Refractive Lens Manipulator",
      "authors": [
        "D. Shu",
        "J.W.J. Anton",
        "L. Assoufid",
        "W.C. Grizolli",
        "Z. Islam",
        "S.P. Kearney",
        "P. Kenesei",
        "S.D. Shastri",
        "X. Shi",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "University of Illinois at Chicago",
        "Chicago",
        "USA",
        "A prototype of compact x-ray compound refractive lens (CRL) manipulator system has been developed at the Argonne National Laboratory for dark-field imaging of multi-scale structures. This novel full-field imaging modality uses Bragg peaks to reconstruct 3D distribution of mesoscopic and microscopic structures that govern the behavior of functional materials",
        "in particular",
        "thermodynamic phase transitions in magnetic systems. At the heart of this microscopy technique is a CRL-based x-ray objective lens* with an easily adjustable focal length to isolate any region of interest",
        "typically in the energy range of 5-100 keV or higher",
        "with high precision positional and angular reproducibility. Since the x-ray CRL manipulator system for this technique will be implemented on a high-resolution diffractometer detector arm that rotates during diffraction studies",
        "compactness and system stability",
        "along with the ability to change focal length (zooming)",
        "became key design requirements for this new CRL manipulator system. The mechanical design of the compact x-ray CRL manipulator system",
        "as well as finite element analyses for its precision alignment apparatus are described in this paper."
      ],
      "institutions": [],
      "abstract": "* http://www.rxoptics.de/intro.html",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weopma04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weopma04.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weopma04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEOPMA04",
      "page_number": "168",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOPMA05",
      "title": "Application of Industry Recognised Development Tools and Methodologies, such as Six Sigma to Facilitate the Efficient Delivery of Innovative and Robust Engineering Solutions at Synchrotron Facilities",
      "authors": [
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "Synchrotron facilities play a key part in the delivery of world leading science to facilitate research and development across multiple fields. The enabling technology designed by engineers at these facilities is crucial to their success. The highly academic nature of Synchrotron facilities does not always lead to working in the same way as a commercial engineering company. However",
        "are the engineering requirements at Synchrotrons different to commercial companies? Exploring the parallels between research and commercial companies",
        "can we show that the tools and methodologies employed could benefit engineering development at Synchrotrons? This paper provides a theoretical discussion on the commonality between engineering developments at Synchrotron facilities compared to commercial companies. How methodologies such as Design for Six Sigma and in particular tools such as stakeholder analysis",
        "functional tree analysis",
        "FMEA and DoE could be utilised in the design process at Synchrotrons. It also seeks to demonstrate how implementation could aid the development of innovative",
        "robust and efficient design of engineering solutions to meet the ever-increasing demands of our facilities."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weopma05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weopma05.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weopma05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEOPMA05",
      "page_number": "184",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOPMA06",
      "title": "A Compact and Calibratable von Hamos X-Ray Spectrometer Based on Two Full-Cylinder HAPG Mosaic Crystals for High-Resolution XES",
      "authors": [
        "I. Holfelder",
        "B. Beckhoff",
        "R. Fliegauf",
        "Y. Kayser",
        "M. Müller",
        "M. Wansleben",
        "J. Weser",
        "PTB",
        "Berlin",
        "Germany",
        "[1] H. Legall et al. (2006). Proc. FEL",
        "BESSY"
      ],
      "institutions": [],
      "abstract": "In high-resolution X-ray Emission Spectroscopy (XES) crystal-based Wavelength-Dispersive Spectrometers (WDS) are being applied for characterization of nano- and microscaled materials. Thereby the so called von Hamos geometry provides high detection efficiency due to sagittal focusing using cylindrically bent crystals. To maximize the detection efficiency a full-cylinder optic can be applied. A novel calibratable von Hamos X-ray spectrometer based on up to two full-cylinder optics was developed at the PTB. To realize the full-cylinder geometry Highly Annealed Pyrolytic Graphite (HAPG) [1] was used. Besides its good bending properties this mosaic crystal shows highly integrated reflectivity while offering low mosaicity ensuring high resolving power [2]. The spectrometer enables chemical speciation of elements in an energy range from 2.4 keV up to 18 keV. The design and commissioning of the spectrometer will be presented together with first results using synchrotron radiation as excitation source. The spectrometer combines high efficiency with high spectral resolution (ten times better than in commercial WDS systems) in a compact arrangement also suitable for laboratory arrangements.",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weopma06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weopma06.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weopma06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEOPMA06",
      "page_number": "189",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOPMA07",
      "title": "Development of a New Sub-4k ARPES Endstation at PSI",
      "authors": [
        "D. Trutmann",
        "S. Hasanaj",
        "St. Maag",
        "L. Nue",
        "A. Pfister",
        "P.N. Plumb",
        "A. Schwarb",
        "S. Shi",
        "K.M. Zehnder",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "In spring 2016 a project was started to renew the high-resolution ARPES endstation of the Surface/Interface Spectroscopy (SIS) beamline at PSI. The focus lay on achieving sample temperatures below 4 K while maintaining 6 degrees of freedom. This made it necessary to redesign all thermally active parts",
        "such as the connection to the cryostat",
        "the flexible braid that enables the tilt and azimuthal movement",
        "the sample clamping as well as the thermal isolators that hold the clamping device in place. A newly introduced shield in the main analyser chamber",
        "cooled by separate cryopumps",
        "is used to remove nearly all radiation heat load. A major milestone has recently been taken",
        "by running cryogenic tests on a test stand. The simplified setup reached sample temperatures of 3.35 K. The temperature loss from the cryostat to the sample was as low as 0.6 K. Encouraged by these results",
        "it is believed that the final endstation will be able to reach temperatures even below 3 K. With the new cryo concept",
        "the thermal performance seems to be mainly limited by the radiative heat load emitted by the analyser lens. The new endstation is planned to be in operation by spring 2019."
      ],
      "institutions": [
        "Funding: Swiss National Science Foundation (SNSF) project number 206021164016"
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2018/talks/weopma07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2018/papers/weopma07.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2018/posters/weopma07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2018-WEOPMA07",
      "page_number": "193",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 6,
  "scrape_time": "2025-10-10 23:41:27"
}