{
  "session_info": {
    "id": "MOOB",
    "name": "MOOB - Monday Contributed Oral Session B",
    "url": "https://proceedings.jacow.org/medsi2020/html/moob.htm"
  },
  "papers": [
    {
      "paper_id": "MOOB01",
      "title": "ESRF Double Crystal Monochromator - Design and Working Modes",
      "authors": [
        "R. Baker",
        "R. Barrett",
        "P. Bernard",
        "G. Berruyer",
        "J. Bonnefoy",
        "M. Brendike",
        "L. Ducotté",
        "H. Gonzalez",
        "T. Roth",
        "P. Tardieu",
        "ESRF",
        "Grenoble",
        "France",
        "The ESRF-Double Crystal Monochromator (ESRF-DCM) has been designed and developed in-house to enable several spectroscopy beamlines to exploit the full potential of the ESRF-EBS upgrade",
        "implemented in 2019 - 2020. To reach concomitant beam positioning accuracy and stability",
        "particular attention has been paid to mechanical and thermal stability",
        "which has imposed the implementation of several innovative design concepts. To meet the extremely challenging specifications of the ESRF DCM implies not only high precision mechanical design",
        "but also a mechatronic system enabling the active correction of the parallelism between crystals. Online metrology",
        "associated with a controller capable of real-time signal processing have been implemented. A prototype has been partially validated and production of the first batch (two ESRF DCMs) is in progress. This presentation will give an overview of the DCM design principles and operating modes",
        "then show how the calibration process is performed in situ on the beamline",
        "using x-rays and associated instrumentation",
        "and will explain the working principle of the active correction mode. To conclude",
        "some characterisations of the DCM performances with x-rays will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/moob01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/moob01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/moob01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-MOOB01",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "MOOB02",
      "title": "ALBA BL20 New Monochromator Design",
      "authors": [
        "A. Crisol",
        "F. Bisti",
        "C. Colldelram",
        "M.L. Llonch",
        "B. Molas",
        "R. Monge",
        "J. Nicolás",
        "L. Nikitina",
        "M. Quispe",
        "L. Ribó",
        "M. Tallarida",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "LOREA beamline (BL20) at ALBA Synchrotron is a new soft X-Ray beamline dedicated to investigate electronic structure of solids by means ARPES technique. Optical design has been developed in-house so as most of beamline core opto-mechanics like Monochromator. The design made for LOREA is based on a Hettrick-Underwood grating type that operates without entrance slit. Experience cumulated over years allowed to face the challenge of designing and building UHV Monochromator. The large energy range of LOREA (10-100 eV) requires a device with 3 mirrors and 4 gratings with variable line spacing to reduce aberrations. Monochromator most important part",
        "gratings system",
        "has been carefully designed to be isolated from external disturbances as cooling water",
        "and at the same time having high performances. Deep analytical calculations and FEA simulations have been carried out",
        "as well as testing prototypes. The most innovative part of Monochromator is gratings cooling with no vacuum guards or double piping that are well-known source of troubles. Heat load is removed by copper straps in contact with a temperature controller device connected to fixed water lines. In addition",
        "motion mechanics and services (cabling",
        "cooling) are independent systems. Designs involved give high stability (resonance modes over 60Hz) and angular resolution below 0.1 µrad over 11° range. On mirrors side",
        "it has been used gonio mechanics from MIRAS* plus an eutectic InGa interface between cooling and optics to decouple them. Grating and mirror holders are fully removable from main mechanics to be able to assembled at lab measuring to achieve the best fit. Instrument has been already assembled and motions characterization or stability measurements are giving expected results matching with specifications."
      ],
      "institutions": [],
      "abstract": "* L. Ribó et al., \"MECHANICAL DESIGN OF MIRAS, INFRARED MICROSPECTROSCOPY BEAM LINE AT ALBA SYNCHROTRON\", presented at MEDSI’16, Barcelona, Spain, September 2016, doi:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/moob02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/moob02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/moob02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-MOOB02",
      "page_number": "14",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "MOOB03",
      "title": "Bendable KB Type Focusing Mirrors Designed for TPS IR Beamline",
      "authors": [
        "T.C. Tseng",
        "H.S. Fung",
        "H.C. Ho",
        "K.H. Hsu",
        "C.S. Huang",
        "D.-G. Huang",
        "C.K. Kuan",
        "W.Y. Lai",
        "C.J. Lin",
        "S.Y. Perng",
        "H.S. Wang",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "A new IR beamline has been scheduled at TPS beam-line construction Phase III. The new beamline optical design is following the structure of the existed TLS IR beamline. However",
        "the focusing mirrors has to be re-deign according to different situation. These KB type mirrors (HFM and VFM) are same thickness flat stain-less plates assembled with bending arms and bended with single motor each to fit quintic polynomial surface pro-files for focusing and also modifying arc source effect of bending section. For a same thickness plate in addition with the bending arms effect to form a desired polynomi-al surface profile",
        "it demands specific width distribution. With the drawing method and FEM iteration simulation",
        "the optimized surface polynomial equation and width distribution design of the mirror plates were defined. The detailed design sequences will be described in this paper."
      ],
      "institutions": [],
      "abstract": "Your browser cannot play the video. Consider download from Link Address. Right click on video forPicture-in-Picture modeor Full screen display.At start the sound is muted!",
      "presentation_url": "https://proceedings.jacow.org/medsi2020/talks/moob03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2020/papers/moob03.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2020/posters/moob03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2020-MOOB03",
      "page_number": "17",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 23:23:08"
}