{
  "session_info": {
    "id": "TUZG",
    "name": "TUZG - RadiaSoft Satellite Session",
    "url": "https://proceedings.jacow.org/napac2022/html/tuzg.htm"
  },
  "papers": [
    {
      "paper_id": "TUZG1",
      "title": "Magnets to ML to Light Sources: Designing from the Browser with Sirepo",
      "authors": [
        "J.P. Edelen",
        "B. Nash",
        "RadiaSoft LLC",
        "Boulder",
        "Colorado",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "Join us for an afternoon intensive with the Sirepo CAE & Design platform! Experts will present their work and lead tutorials using Sirepo’s apps and tools for magnet design",
        "ML techniques in control systems",
        "and X-ray beamline modeling. Bring your own laptop and pre-register to use the free gateway at Sirepo.com for practical exercises. Dr. Edelen will provide a tutorial on how to design dipoles and undulators using parameterized magnets. Dr. Roussel will demonstrate combining the classical Preisach model of hysteresis with ML techniques to efficiently create non-parametric",
        "high-fidelity models of arbitrary systems exhibiting hysteresis. Also shown will be how using these joint hysteresis-beam models allows users to overcome optimization performance limitations when hysteresis effects are ignored. Dr. Nash will review the capabilities of Shadow and SRW within Sirepo",
        "discuss additional optics tools in the interface including brightness and linear optics",
        "demonstrate translation between the two codes",
        "and show how to continue your simulation work in a python based Jupyter notebook.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/napac2022/talks/tuzg1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2022/papers/tuzg1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2022/posters/tuzg1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2022-TUZG1",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 1,
  "scrape_time": "2025-10-11 00:16:50"
}