{
  "session_info": {
    "id": "THBA",
    "name": "THBA - End Stations and Sample Environments",
    "url": "https://proceedings.jacow.org/medsi2016/html/thba.htm"
  },
  "papers": [
    {
      "paper_id": "THBA01",
      "title": "An Endstation with Cryogenic Coils Contributing to a 0.5 Tesla Field and 30-400k Sample Thermal Control",
      "authors": [
        "G.A. Scharfstein",
        "D. Arbelaez",
        "J.-Y. Jung",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The Engineering Division of Lawrence Berkeley National Laboratory presents a design for an End Station to enable X-ray Photon Correlation Spectroscopy (XPCS)",
        "which is a method to study temperature-induced fluctuation in hard and soft condensed matter systems. XPCS",
        "when applied to a magnetic system",
        "can yield information about how domains fluctuate as the system goes through a phase transition; these phase transitions can occur at low temperatures (< 100K) and at an applied magnetic field. Therefore",
        "requirements for the End Station include a 0.5 Tesla field at the sample and temperature control of the sample from 30K to 400K."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/thba01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/thba01.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/thba01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-THBA01",
      "page_number": "396",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "THBA02",
      "title": "Enabling Investigations of Fluids and Fluid - Solid - Interfaces With Soft X-Ray Excitation at UHV Conditions",
      "authors": [
        "MPI CEC",
        "Mülheim an der Ruhr",
        "Germany",
        "B. Beckhoff",
        "A. Nutsch",
        "C. Streeck",
        "PTB",
        "Berlin",
        "Germany",
        "P. Dietrich",
        "C. Nietzold",
        "W. Unger",
        "BAM",
        "Berlin",
        "Germany",
        "A. Jonas",
        "B. Kanngießer",
        "W. Malzer",
        "K.W. Witte",
        "Technische Universität Berlin",
        "Berlin",
        "Germany",
        "MBI",
        "Berlin",
        "Germany",
        "Capturing biochemical markers by bio-molecular films is one of the most promising approaches for the development of highly sensitive and highly selective diagnosis. In particular",
        "future innovative tools for in vitro or point of care diagnostics are expected to rely on this principle. Analytical techniques which can provide information on coverage",
        "orientation and chemical state of biochemical films are capable of contributing to a purposeful development of such diagnostics. We present fluid cells",
        "which were designed to facilitate the application of soft X-ray spectrometry for the in situ analysis of bio-molecular films at solid-liquid interfaces. It allows for - the analysis through a silicon nitride window with a thickness of about 150 nm - in situ preparation of successive layers by rinsing the window Currently",
        "after the first successful soft X-ray experiments on liquids and gases",
        "we are improving the versatility of the fluid cells. Spectrometry in transmission and in various emission geometries will be feasible. Also transmission- and emission-measurements in parallel are tested. Further control devices for the experimental conditions will be added."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/medsi2016/talks/thba02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/medsi2016/papers/thba02.pdf",
      "poster_url": "https://proceedings.jacow.org/medsi2016/posters/thba02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-MEDSI2016-THBA02",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-11 00:06:06"
}