{
  "session_info": {
    "id": "TUPJE",
    "name": "TUPJE - Tuesday Posters (Jefferson)",
    "url": "https://proceedings.jacow.org/IPAC2015/html/tupje.htm"
  },
  "papers": [
    {
      "paper_id": "TUPJE001",
      "title": "Design of Wavelength Tunable Coherent X-Ray Source",
      "authors": [
        "Sokendai",
        "Ibaraki",
        "Japan",
        "TOYAMA Co.",
        "Ltd.",
        "Zama-shi",
        "Kanagawa",
        "Japan",
        "K. Hayakawa",
        "Y. Hayakawa",
        "T. Sakai",
        "T. Tanaka",
        "LEBRA",
        "Funabashi",
        "Japan",
        "Nihon University",
        "Advanced Research Institute for the Sciences and Humanities",
        "Funabashi",
        "Japan",
        "M. Satoh",
        "M. Yoshida",
        "KEK",
        "Ibaraki",
        "Japan",
        "KEK",
        "Nihon University and TOYAMA CO.",
        "Ltd. have been developing the compact shieldless coherent X-ray source that can change the X-ray energy (3-25keV). This X-ray is the Parametric X-ray radiation (PXR) generated by relativistic charged particles passed through a single crystal. It has features that are monochromaticity",
        "coherence and diffraction large angle for the incident beam. These indicate to the possibility for the application to the medical treatment and diagnosis. Furthermore",
        "we try to reduce the radiation which is mainly generated when the high energy beam is damped. This system consists of an accelerating",
        "a decelerating structure and four bending magnets (theta: 90 degree). These structures are operated under low temperature to get the high Q-value for long beam pulse. PXR is generated by colliding with a single crystal after electron beam is accelerated up to 75 MeV. The bunch passed through the crystal is transported into a decelerator structure and then is decelerated to 3 MeV there. Q-magnets are arranged that dispersion function is zero except arc sections. We calculated the beam transport",
        "PXR intensity and emittance blow up. We'll report these details."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje001.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE002",
      "title": "Demonstration of High-flux Photon Generation from an ERL-based Laser Compton Photon Source",
      "authors": [
        "R. Nagai",
        "R. Hajimapresenter",
        "M. Mori",
        "T. Shizuma",
        "JAEA",
        "Ibaraki-ken",
        "Japan",
        "T. Akagi",
        "S. Araki",
        "Y. Honda",
        "A. Kosuge",
        "N. Terunuma",
        "J. Urakawa",
        "KEK",
        "Ibaraki",
        "Japan",
        "A high-flux photon source from the laser Compton scattering (LCS) by an electron beam in an energy-recovery linac (ERL) is a key technology for a nondestructive assay system to identify nuclear materials. In order to demonstrate accelerator and laser technologies required for a LCS photon generation",
        "a LCS photon source is under construction at the Compact ERL (cERL). The LCS photon source consists of a mode-locked fiber laser and a laser enhancement cavity. Flux monitors and a data aqcuisition system are also under construction. The commissioning of the LCS photon source will be started in February 2015 and LCS photon generation is scheduled in March 2015. The demonstration result of the LCS photon source will be presented in detail."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje002.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE003",
      "title": "Quasi-Traveling Wave RF Gun and Beam Commissioning for SuperKEKB",
      "authors": [
        "The University of Tokyo",
        "Nuclear Professional School",
        "Ibaraki-ken",
        "Japan",
        "Y. Ogawa",
        "M. Yoshida",
        "X. Zhou",
        "KEK",
        "Ibaraki",
        "Japan",
        "We are developing a new RF gun for SuperKEKB. High charge low emittance electron and positron beams are required for SuperKEKB. We will generate 7.0 GeV electron beam at 5 nC 20 mm-mrad by J-linac. In this linac",
        "a photo cathode S-band RF gun will be used as the electron beam source. For this reason",
        "we are developing an advanced RF gun which has two side coupled standing wave field. We call it quasi-traveling wave side couple RF gun. This gun has a strong focusing field at the cathode and the acceleration field distribution also has a focusing effect. This RF gun has been installed in the KEK J-linac. Beam commissioning with the RF gun is in progress."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje003.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE004",
      "title": "Narrow Band Coherent Edge Radiation at UVSOR-III",
      "authors": [
        "M. Hosaka",
        "O. Oodake",
        "Y. Takashima",
        "N. Yamamoto",
        "Nagoya University",
        "Nagoya",
        "Japan",
        "S. Bielawski",
        "C. Szwaj",
        "PhLAM/CERCLA",
        "Villeneuve d'Ascq Cedex",
        "France",
        "M. Katoh",
        "T. Konomi",
        "J. Yamazaki",
        "UVSOR",
        "Okazaki",
        "Japan",
        "Kyoto University",
        "Kyoto",
        "Japan"
      ],
      "institutions": [],
      "abstract": "Edge radiation can be an interesting new light source because of its property that the radiation is well collimated and is radially polarized. We are developing coherent light sources in the THz region at UVSOR-III storage ring. We have already succeeded in producing a narrow band coherent THz radiation by manipulating the interaction of a relativistic electron bunch with an amplitude modulated laser with. Recently a simplified tentative beamline for detection of the edge radiation is installed at downstream of a short straight section of UVSOR-III. Coherent radiation from electron bunches after the interaction with the amplitude modulated laser is observed. Detailed measurements of polarizations and special distribution of the radiation are underway. The latest status of the study will be reported. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje004.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE005",
      "title": "Development of Pulsed Multipole Magnet for Aichi SR Storage Ring",
      "authors": [
        "K. Ito",
        "M. Hosaka",
        "A. Mano",
        "T. Takano",
        "Y. Takashima",
        "Nagoya University",
        "Nagoya",
        "Japan",
        "K. Hayashi",
        "M. Katoh",
        "UVSOR",
        "Okazaki",
        "Japan",
        "KEK",
        "Ibaraki",
        "Japan",
        "The Aichi synchrotron radiation (Aichi SR) center is an industrial oriented synchrotron light source facility. The electron energy and circumference of the storage ring are 1.2 GeV and 72 m. The natural emittance is 53 nm-rad. Since the pulsed multipole injection scheme provides great advantages for relatively smaller SR rings*",
        "we are developing a pulsed multipole injection system for Aichi SR storage ring. In this system",
        "it is essential to minimize the perturbation to the stored beam. To realize the required performances",
        "we have to minimize the residual field at stored beam position",
        "taken into account the field generated by the copper current lead of the input terminal. In addition",
        "we carried out the analytical calculation to estimate the magnet field due to the current lead and optimized the geometrical structure of them. Construction of the multipole magnet will be completed in March 2015 and the field measurement will be carried out in April. In this presentation",
        "we report the detail of the magnet design and the measurement results of pulsed magnetic field for the manufactured magnet.",
        "* N. Yamamoto",
        "et. al.",
        "NIM A 767",
        "26-33 (2014)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje005.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE006",
      "title": "Recent Developments of UVSOR-III",
      "authors": [
        "M. Katoh",
        "K. Hayashi",
        "J. Yamazaki",
        "UVSOR",
        "Okazaki",
        "Japan",
        "M. Adachi",
        "T. Konomi",
        "N. Yamamoto",
        "KEK",
        "Ibaraki",
        "Japan",
        "M. Hosaka",
        "Y. Takashima",
        "Nagoya University",
        "Nagoya",
        "Japan",
        "A 750 MeV low energy synchrotron light source",
        "UVSOR",
        "has been operational since 1983. About ten years after the first major upgrade in 2003",
        "the second major upgrade was carried out in 2012",
        "in which all the bending magnets were replaced with combined function ones and a new in-vacuum undulator was installed in the last straight section reserved for undulators. After this upgrade",
        "the light source",
        "UVSOR-III",
        "has been operational with small emittance of 17 nm-rad",
        "with six undulators",
        "and fully with the top-up injection at 300mA. Adding to the present status of the accelerator",
        "most recent progresses in the pulsed sextupole magnet for the beam injection and in the coherent light source development station will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje006.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE007",
      "title": "Measurement of Temporal Electric Field of Electron Bunch using Photoconductive Antenna",
      "authors": [
        "K. Kan",
        "M. Gohdo",
        "T. Kondoh",
        "I. Nozawa",
        "A. Ogata",
        "T. Toigawa",
        "J. Yang",
        "Y. Yoshida",
        "ISIR",
        "Osaka",
        "Japan",
        "A temporal electric field profile",
        "which is a radially polarized terahertz (THz) pulse from an electron bunch",
        "was measured by a large-aperture photoconductive antenna (PCA) with micro-structured concentric electrodes* for the detection of THz pulses. Photo-induced charge carriers were generated by irradiation of femtosecond laser pulses on semiconductor plane of the electrodes on the PCA. Time-domain measurement of coherent transition radiation (CTR) was conducted by the measurement of electric-field-induced current output from the PCA with sweeping the timing of the laser irradiation. The measurements on femtosecond electron bunches of 32 MeV and >80 pC will be reported.",
        "* K. Kan et al.",
        "Appl. Phys. Lett. 102",
        "221118 (2013)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje007.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE008",
      "title": "Relocation and Improvement Status of the SCSS Test Accelerator to Provide Dual FEL Drivers at SACLA",
      "authors": [
        "RIKEN SPring-8 Center",
        "Sayo-cho",
        "Sayo-gun",
        "Hyogo",
        "Japan",
        "To increase user experiment chances at SACLA",
        "Equipping a new beamline and an additional linac as a further FEL driver is effective. For this reason",
        "the SCSS test accelerator as the prototype of SACLA is reused and improved",
        "because of terminating its role. SCSS with an electron beam energy of 250 MeV generated an extreme ultraviolet laser with 50-60 nm. We relocated SCSS into the SACLA undulator hall and improved its performance. Three newly designed C-band accelerator-units for the relocated SCSS accelerator with an acceleration gradient of 47 MeV/m at maximum boost an electron beam energy of up to 420 MeV. By FEL simulation",
        "the EUV-FEL with 30-40 nm and 100 uJ are expected in conditions of the electron energy and 2 modified undulators with 5 m long each. As a further capability",
        "the relocated SCSS accelerator has space to add 9 C-band accelerator units and 2 undulators and the units increase a beam energy of up to 1.4 GeV",
        "as which can generate a soft X-ray FEL. The relocation of the accelerator was finished in the summer of 2014 and its RF conditioning was now started. This paper describes the relocation and improvement status of the modified SCSS accelerator."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje008.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE009",
      "title": "Study on Frequency Multiplier of a Pulsed Laser Repetition using an Optical Cavity",
      "authors": [
        "Waseda University",
        "Tokyo",
        "Japan",
        "We have been studying a compact electron accelerator based on an S-band Cs-Te photo-cathode rf gun at Waseda University. The system is using S-band rf of 2856MHz. When a repetition of the electron bunch is integral multiple of rf",
        "it enables a lot of electron bunch acceleration for the rf gun. The repetition of the electron bunch generated by a photo-cathode rf gun depends on the oscillating frequency of the pulsed mode-locked laser. We have been developing a mode-locked Yb-doped fiber laser based on Non-Linear Polarization Rotation (NLPR). However",
        "its repetition is limited by the fiber length to produce NLPR. Therefore",
        "we have started to develop the external optical cavity which is multiplier of a pulsed laser repetition. It would enable the rf gun to generate high-dose electron beam in a very short time. In this conference",
        "we will report design of the external optical cavity to multiply the pulsed laser repetition",
        "the experimental results of the frequency multiplying of a mode-locked Yb-doped fiber laser",
        "and the future prospects.",
        "Work supported by Photon and Quantum Basic Research Coordinated Development Program from the Ministry of Education",
        "Culture",
        "Sports",
        "Science and Technology",
        "Japan."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje009.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE010",
      "title": "Study of Cs-Te Photocathode for RF Electron Gun",
      "authors": [
        "S. Matsuzaki",
        "M. Nishida",
        "K. Sakaue",
        "M. Washio",
        "Waseda University",
        "Tokyo",
        "Japan",
        "Tokyo University of Science",
        "Tokyo",
        "Japan",
        "At Waseda University",
        "we have been studying high quality electron beam with an rf electron gun. In recent accelerator study and application researches",
        "high quality electron beam are strongly required. Photocathode is a key component to generate higher quality electron beam. Cs-Te photocathode shows high quantum efficiency (Q.E.) (~10%) and has long life time (~several months). From 2013",
        "we built a photocathode evaporation chamber and started photocathode study. In this study",
        "our purpose is to clarify their property and to establish an ideal evaporation recipe. We succeeded in producing high quality Cs-Te photocathode",
        "and electron beam generated by our Cs-Te photocathode shows high charge (4.6nC/bunch) and high Q.E. (1.74%) in our rf electron gun. Furthermore",
        "we found a Q.E. recovery after Cs deposition process and it causes higher Q.E. than usual due to",
        "we believe",
        "Cs deposition quantity or Cs deposition speed. Thus we are now surveying the optimum Cs evaporation parameters. In this conference",
        "we will report a detail of our photocathode development system",
        "the latest progress of optimization study of Cs-Te photocathode and future plans."
      ],
      "institutions": [],
      "abstract": "Work supported by Cooperative and Supporting Program for Researches and Educations in Universities and NEDO(New Energy and Industrial Technology Development Organization. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje010.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE011",
      "title": "Laser-Compton Scattering X-ray Source Based on Normal Conducting Linac and Optical Enhancement Cavity",
      "authors": [
        "K. Sakaue",
        "M. Washio",
        "Waseda University",
        "Tokyo",
        "Japan",
        "S. Araki",
        "M.K. Fukuda",
        "Y. Honda",
        "N. Terunuma",
        "J. Urakawa",
        "KEK",
        "Ibaraki",
        "Japan",
        "We have been developing a compact X-ray source via laser-Compton scattering (LCS) at KEK-LUCX (Laser Undulator Compact X-ray source) facility. The LUCX system is based on S-band normal conducting linac with an energy of 30 MeV and optical enhancement cavity for photon target. As a photon target",
        "we invented a burst mode laser pulse storage technique for a normal conducting linac",
        "which enables to store the high power laser pulses at the timing of electron bunchs. The peak storage power exceeds to more than 250 kW with 357 MHz repetition. Electron linac is under operation with multi-bunch mode",
        "1000 bunches/train with 600 pC charge in each bunches. We have succeeded to produce 1000 pulse/train LCS X-ray train. Combining high repetition rate electron linac and burst mode optical enhancement cavity",
        "more than 109 ph./sec/10%b.w. flux would be possible. In this conference",
        "the introduction of our test facility LUCX",
        "recent expermental results",
        "and future prospective including normal conducting LCS X-ray source will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje011.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE012",
      "title": "Preliminary Result of Photon Counting Acquisition Scheme for Laser Pump/X-ray Probe Experiments",
      "authors": [
        "J. He",
        "J.S. Cao",
        "G. Gao",
        "Y.F. Sui",
        "Y. Tao",
        "J.H. Yue",
        "Z. Zhang",
        "Y.F. Zhou",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "R&D project has been initiated for a proposed ultralow emittance (~50pm.rad) synchrotron light source built in Beijing. The R&D includes the development of high repetition rate laser pump/X-ray probe for ultrafast dynamics detection in future source. In a typical laser pump/X-ray probe measurement",
        "the X-ray pulse follows a laser pulse in adjustable delay. We are interested in the difference between laser on and laser off at different delay",
        "which will snapshot dynamic process. To capture this trivial difference",
        "it requires the acquisition system to single out the signal from this special X-ray pulse at adequate S/N ratio. For the R&D of high repetition rate pump-probe",
        "we have set up a prototype counting acquisition system based on NIM modular electronics",
        "which was tested in Beijing Synchrotron Radiation Facility (BSRF). The laser will be synchronized with a camshaft bunch at 124 kHz",
        "a tenth of the revolution frequency. Avalanche Photo Diode (APD) was used to detect the X-ray pulse from this camshaft bunch due to its nanosecond response. Before the laser is delivered",
        "we mimic the 124 kHz laser- on signal. The signals from APD are separated by power dividers into two Constant Fraction Discriminator (CFD) input channels. The signal in laser-on/off channel is gated out at 1.24MHz using the 1.24MHz timing signal divided from 499.8 MHz RF signal",
        "while the mimic laser-on signal gated out at 124 kHz. Multiplied by ten times",
        "the mimic laser-on signal counts should be consistent with the laser-on+off counts",
        "if our counting modular works well. We carried out this test at 1W1B wiggler beam line to measure the Fe fluorescence signal. The performance of our system is demonstrated in the good consistency between mimic laser on and laser on+off signals."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje012_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje012.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje012_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE012",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE013",
      "title": "Lattice Design of Low Beta Function at Interaction Point for TTX-II",
      "authors": [
        "T. Rui",
        "W.-H. Huang",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "TTX-II is a storage ring being designed at Accelerator Laboratory in Tsinghua University as the second phase of Tsinghua Thomson scattering x-ray source (TTX)",
        "to increase the average photon flux generated. To achieve a small beta function at the interaction point",
        "four pairs of quadrupole magnets",
        "whose focusing strengths are optimized",
        "are added to the baseline. The lattice design is presented in this work."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje013_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje013.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje013_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE013",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE014",
      "title": "An X-Band Linac with Tunable Beam Energy",
      "authors": [
        "L. Zhang",
        "H.B. Chen",
        "Y.-C. Du",
        "Q.X. Jin",
        "J. Shi",
        "C.-X. Tang",
        "P. Wang",
        "Z. Zhang",
        "TUB",
        "Beijing",
        "People's Republic of China",
        "The low-energy X-band linac has a wide application in medical imaging. In this paper",
        "an X-band linac is designed to produce beam energy between 0.5MeV and 1.5MeV",
        "and the output beam energy is continuously adjustable within this range. Two sections of linacs are combined and powered by a single microwave source. During the experiment",
        "we can tune the RF phase and amplitude of the second section of the linac",
        "the electron beam can see either acceleration or deceleration",
        "which tunes the output energy. This paper presented the production of the whole linac system",
        "as well as the measurement of the continuously-adjustable beam energy."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje014_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje014.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje014_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE014",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE015",
      "title": "Beta Function Matching and Tune Compensation for HLS-II Insertion Devices",
      "authors": [
        "B. Li",
        "J.Y. Li",
        "W. Xu",
        "K. Xuan",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "In order to increase its brightness and improve the performance",
        "the Hefei Light Source (HLS) was completely renovated from 2010 to the end of 2014. The magnet lattice of the new storage ring consists of four double bend achromatic (DBA) cells. There are eight straight sections which can be used to install up to 6 insertion devices (IDs). Currently",
        "five insertion devices have been installed in the storage ring. It is known that the dynamics of the electron beam motion in the storage ring would be influenced by the insertion device",
        "depending on its physical properties. In order to keep high performance operation of the storage ring and make the insertion device transparent to the rest of the storage ring",
        "a complex compensation scheme is developed to match the beta functions at both ends of a ID and perform transverse tune compensation. This scheme has been integrated into the EPICS based control system of the HLS-II. The result indicates that the scheme is very effective to compensate the impact of the insertion devices."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje015.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE016",
      "title": "COHERENT SYNCHROTRON RADIATION FIELD AND THE ENERGY LOSS IN A WAVY BEAM",
      "authors": [
        "D.R. Xu",
        "H. Xu",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "The synchrotron radiation will be coherent when the wavelength of the radiation can be compared with the bunch length. There are two approaches to produce Coherent Synchrotron Radiation (CSR) on a storage ring. One is to compress the bunch length",
        "the other one is to produce a wavy beam which has high spatial repetition along the longitudinal direction. The latter one can expand the radiation frequency range of a light source. However",
        "CSR can bring nonlinear effect which brings in extra instability. The Lienard-Wiechert potentials in three-dimensional space may have very complicated forms. The most common way to investigate CSR is numerical method. This paper try to use a simple model to obtain energy loss of the electrons in theory."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje016.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE017",
      "title": "The Generation of Highly Intense THz Radiation based on Smith-Purcell Radiation",
      "authors": [
        "Y.F. Xu",
        "Z.G. He",
        "Q.K. Jia",
        "W.W. Li",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "A photocathode RF gun can generate trains of THz subpicosecond electron bunches by illuminating the cathode with trains of laser pulses. Let this electron bunches passes close to the surface of a lamellar grating",
        "THz radiation will be emitted",
        "which is the so-called Smith-Purcell Radiation (SPR). If the lamellar grating has a narrow groove",
        "this radiation will be narrow-band. By choosing suitable parameter",
        "the SPR frequency can be resonant with the electron bunches frequency",
        "and then generate high intense",
        "narrow band THz radiation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje017.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE018",
      "title": "On-axis Injection Scheme for Ultimate Storage Ring with Double RF Systems",
      "authors": [
        "B.C. Jiang",
        "S.Q. Tian",
        "M.Z. Zhang",
        "Q.L. Zhang",
        "Z.T. Zhentang",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "An on-axis injection scheme using double RF systems for an ultimate storage ring which holds very small dynamic aperture is proposed. By altering RF voltages",
        "empty RF buckets can be created which will be used for on-axis injection. After bunches are injected",
        "a reverse voltage altering process is performed and the injected bunches can be longitudinally dumped to the main buckets."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje018.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE019",
      "title": "Operating Cascaded High-gain Harmonic Generation with Double-pulse Electron Beams",
      "authors": [
        "Z. Wang",
        "C. Feng",
        "Q. Gu",
        "Z.T. Zhao",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Cascaded high gain harmonic generation (HGHG) is the primary candidate for the generation of high power",
        "full temporal coherent radiation at the wavelength of nanometer. However",
        "the experimental results at the existing facility show large fluctuation of the output energy pulse at the second stage of cascading. In this paper",
        "we study the scheme of double-pulse electron beams",
        "which is helpful to increase the stability of pulse energy against the timing jitter. The method to generate double-pulse electron beams is shown in the paper and comparison between double-pulse scheme and standard cascaded HGHG is present base on three-dimensional start-to-end simulation to give a straightforward image on the obviously improvement of the FEL stability."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje019.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE021",
      "title": "Interaction Chamber Design for a Sub-MeV Laser-compton Gamma-ray Source",
      "authors": [
        "H.H. Xu",
        "J.H. Chen",
        "G.T. Fan",
        "D. Wang",
        "H.L. Wu",
        "B.J. Xu",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "Previously",
        "fixed angle Laser-Compton Scattering (LCS) experiments have been conducted at the terminal of the 100MeV LINAC of the Shanghai Institute of Applied Physics",
        "using SINAP-I* and SINAP-II** facility. Sub-MeV energy continuously tunable laser-Compton light source device (SINAP-Ⅲ) is an updated facility that will allow the collision angle between the laser and electron beam continuously adjustable from 20 to 160 degrees. This new feature will enable convenient control on the peak energy of the generated X/γ ray",
        "especially when the energy of electrons cannot be momentarily adjusted",
        "e.g. on the storage ring. The well control of the status of LCS is necessary. An interaction chamber containing a rotatable structure that holds a series of plane mirrors and convex lens is presented to achieve it. This work is a summary of its design. The simulation of photon production's variation caused by the system errors is performed using a MC code***. The accuracies of installation and adjustment of mirrors and lens are given according to the simulation results. The sizes of these optical devices are also optimized to make the chamber as compact as possible due to space limitation.",
        "* W. Luo et al.",
        "Rev. of Sci. Instrum",
        "81 (2010) 013304  ** W. Luo et al.",
        "Applied Physics B",
        "101 (2010)761-771  *** W. Luo et al.",
        "NIM A",
        "660 (2011)",
        "p. 108"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje021.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE022",
      "title": "Study on Beam Dynamics of a Knot-APPLE Undulator Proposed for SSRF",
      "authors": [
        "Q.L. Zhang",
        "B.C. Jiang",
        "S.Q. Tian",
        "Z.T. Zhao",
        "Q.G. Zhou",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "A new type of undulator",
        "Knot-APPLE undulator",
        "is proposed for SSRF as a solution to reduce the heat load of on-axis high harmonics without losing its capability of tuning synchrotron polarization. It will be applied for SSRF Photoemission Spectroscopy beamline (PES-beamline) in the near future. Impact of the undulator on the beam dynamics has been studied based on the 3D magnetic field model and kick map analysis. Linear optics can be retained by quadrupole compensation within two adjacent cells. Dynamical aperture (DA) shrinkage has been found in the tracking and optimized with sextupoles. An active correction scheme of current strips is studied to compensate the kick maps",
        "and both the linear and nonlinear effects are suppressed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje022.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE023",
      "title": "Consideration on the Future Major Upgrades of the SSRF Storage Ring",
      "authors": [
        "Z.T. Zhao",
        "B.C. Jiang",
        "Y.B. Leng",
        "S.Q. Tian",
        "L. Yin",
        "M.Z. Zhang",
        "SINAP",
        "Shanghai",
        "People's Republic of China",
        "The SSRF storage ring was in operation from 2008",
        "currently it is operating at the energy of 3.5GeV",
        "the natural emittance of 3.9 nm-rad and the beam current of 240 mA",
        "serving for 13 beamlines with 9 IDs. There will be around 40 operated beamlines around 2020",
        "which need some upgrade of the storage ring existing performance",
        "such as the new lattice with superbends. And looking for the future beyond",
        "the major upgrade towards a diffraction limited storage ring is under consideration. This paper presents the initial investigation and the proposal on the ultimate storage ring upgrade for SSRF."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje023.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE032",
      "title": "Updates of the PAL-XFEL Undulator Program",
      "authors": [
        "D.E. Kim",
        "M.-H. Cho",
        "Y.-G. Jung",
        "H.-S. Kang",
        "I.S. Ko",
        "H.-G. Lee",
        "S.B. Lee",
        "W.W. Lee",
        "B.G. Oh",
        "K.-H. Park",
        "H.S. Suh",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "S. Karabekyan",
        "J. Pflüger",
        "XFEL. EU",
        "Hamburg",
        "Germany",
        "Pohang Accelerator Laboratory (PAL) is developing a 0.1 nm SASE based FEL based on 10 GeV S-band linear accelerator named PAL-XFEL. At the first stage",
        "PAL-XFEL needs two undulator lines for photon source. The hard X-ray undulator line requires 18 units of 5 m long hybrid-type conventional planar undulator and soft X-ray line requires 6 units of 5 m long hybrid type planar undulator with additional few EPUs for final polarization control. PAL is developing undulator magnetic structure based on EU-XFEL concepts. The key parameters are min pole gap of 8.3 mm",
        "with period length 26 mm (HXU)",
        "35 mm (SXU)",
        "and 5.0 m magnetic length. . In this report",
        "the prototyping",
        "and the development of pole tuning procedure",
        "the impact of the background field error",
        "and the effects of the girder bending on the optical phase error will be presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje032.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE033",
      "title": "A Research on the Reverse Tapering Method to Gain High Power Polarized Photon Beam with Fixed Wavelength",
      "authors": [
        "C.H. Shim",
        "I.S. Ko",
        "POSTECH",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "J.H. Han",
        "Y.W. Parc",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "Polarization of soft X-ray photon can be controlled with combination between planar undulators and helical ones. We need to give a reverse tapering to the planar undulators to make microbunching in the electron beam while the linearly polarized radiation power is depressed. In this case",
        "however",
        "resonance wavelengths in each planar undulator are different each other. Therefore",
        "proper initial undulator parameter and tapering strength parameter have to be chosen to obtain high power polarized photon beam with fixed wavelength. In this research",
        "method for deciding suitable reverse tapering is presented using simulation results of PAL-XFEL soft X-ray case with 10 GeV electron beam energy."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje033.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE034",
      "title": "A Preliminary Report from Louisiana State University CAMD Storage Ring Operating with an 11-pole 7.5 T Wiggler",
      "authors": [
        "R.S. Amin",
        "P. Jines",
        "D.J. Launey",
        "K.J. Morris",
        "V.P. Suller",
        "Y. Wang",
        "LSU/CAMD",
        "Baton Rouge",
        "Louisiana",
        "USA",
        "V.K. Lev",
        "N.A. Mezentsev",
        "V.A. Shkaruba",
        "V.M. Syrovatin",
        "O.A. Tarasenko",
        "V.M. Tsukanov",
        "A.A. Volkov",
        "A.V. Zorin",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Louisiana State University installed a 7.5 T superconducting wiggler in May 2013 on the electron storage ring located at the Bennett Johnson",
        "Sr. Center for Advanced Microstructures and Devices (CAMD). The wiggler’s influence on betatron tunes and functions",
        "orbit",
        "lifetime",
        "performance",
        "and other relevant beam parameters are described. We further comment on device operations and modifications to ring operations that were necessary to provide light for both wiggler and dipole stations."
      ],
      "institutions": [
        "Funding: Funded by the National Science Foundation."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje034.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE035",
      "title": "Optimization of Turn-by-Turn Measurements at Soleil and Alba Light Sources",
      "authors": [
        "M. Carlà",
        "G. Benedetti",
        "Z. Martí",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "Turn-by-turn measurements paves the way for fast storage ring diagnostics. On the other hand turn-by-turn technique is by its very nature delicate",
        "requiring an extensive system tuning and understanding. During last year several attempts to recover linear model informations from turn-by-turn measurements has been carried out in cooperation between the synchrotrons of SOLEIL and ALBA. A routine to extract phase advance and betatron amplitude from turn-by-turn measurements in presence of damping has been developed. Moreover a procedure to retrieve quadrupole errors from such observables has been developed tested and verified against the traditional diagnostics tools based on closed orbit measurements. A comparison between the different methods and the performance of the two different experimental setups are reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje035.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE036",
      "title": "A New Bench Concept for Measuring Magnetic Fields of Big Closed Structures",
      "authors": [
        "J. Campmany",
        "F. Becheri",
        "C. Colldelram",
        "J. Marcos",
        "V. Massanapresenter",
        "J. Nicolás",
        "L. Ribó",
        "ALBA-CELLS Synchrotron",
        "Cerdanyola del Vallès",
        "Spain",
        "The measurement of big closed magnetic structures is becoming a challenge of great interest. The main reason is the tendency towards building accelerators with high magnetic fields produced by small gap magnets",
        "as well as the development of cryogenic or superconducting narrow-gap insertion devices. Usual approach",
        "based on side-measurements made with a Hall probe mounted on the tip of a motorized arm based on a long granite bench is no more applicable to such closed structures. So",
        "new concepts and approaches have been developed",
        "mainly based on complex devices that insert a Hall probe inside the magnetic structure maintaining the desired position by close-loop controls. The main problem of these devices is that they are not general-purpose oriented: they need a special vacuum chamber",
        "require a specific geometry of the magnetic structure",
        "or does not provide 3D field-map measurements. We present in this paper a new bench that has been built at ALBA synchrotron that is simple",
        "multi-purpose and can be a general solution for measuring big closed structures."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje036.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE037",
      "title": "Magnetic Measurements of the NSLS-II Insertion Devices",
      "authors": [
        "M. Musardo",
        "D.A. Harder",
        "C.A. Kitegi",
        "T. Tanabe",
        "BNL",
        "Upton",
        "New York",
        "USA"
      ],
      "institutions": [
        "This paper presents the results and the recent progress in the magnetic measurements of the insertion devices (IDs) for the National Synchrotron Light Source-II (NSLS-II) at Brookhaven National Laboratory (BNL). A detailed analysis of the magnetic measurements is carried out for various IDs with particular attention at the influence of the magnetic field errors on the devices spectral performance. Several specific details of the measurements and the recent results from IDs commissioning are presented."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje037.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE038",
      "title": "Impact of Insertion Devices on the MAX IV Storage Rings",
      "authors": [
        "S.C. Leemann",
        "H. Tarawneh",
        "MAX-lab",
        "Lund",
        "Sweden",
        "There will be multiple compensations employed for insertion devices in the MAX IV storage rings. Apart from well-known dipole corrections and previously detailed local and global linear optics matching",
        "certain insertion devices in the MAX IV storage rings will also require nonlinear optics adjustments and/or skew quadrupole corrections. The goal of such corrections is ensuring sufficient dynamic aperture as well as low residual emittance coupling. This paper will present a few studies that rely on tracking through kick maps in order to quantify detrimental effects of insertion devices on dynamic aperture and vertical emittance",
        "develop suitable countermeasures",
        "and finally",
        "verify restored storage ring performance."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje038_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje038.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje038_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE038",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE039",
      "title": "Recent Results on the Performance of Cs3Sb Photocathodes in the PHIN RF-Gun",
      "authors": [
        "C. Heßler",
        "E. Chevallay",
        "S. Döbert",
        "V. Fedosseev",
        "I. Martini",
        "M. Martyanov",
        "CERN",
        "Geneva",
        "Switzerland",
        "For the CLIC drive beam a photoinjector option is under study at CERN as an alternative to the thermionic electron gun in the CLIC baseline design. The CLIC drive beam requires a high bunch charge of 8.4 nC and 0.14 ms long trains with 2 ns bunch spacing",
        "which is challenging for a photoinjector. In particular the required long and high intensity laser pulses cause a degradation of the beam quality during the frequency conversion process",
        "which generates the ultra-violet laser beam needed for standard Cs2Te photocathodes. To overcome this issue Cs3Sb cathodes sensitive to green light have been studied at the high-charge PHIN photoinjector since a few years. In this paper recent measurements of fundamental properties of Cs3Sb photocathodes such as quantum efficiency",
        "cathode lifetime and dark current from summer 2014 will be presented",
        "and compared with previous measurements and with the performance of Cs2Te photocathodes."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje039.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE040",
      "title": "Surface Characterization at CERN of Photocathodes for Photoinjector Applications",
      "authors": [
        "I. Martini",
        "E. Chevallay",
        "V. Fedosseev",
        "C. Heßler",
        "H. Neupert",
        "V. Nistor",
        "M. Taborelli",
        "CERN",
        "Geneva",
        "Switzerland",
        "R&D on photocathodes takes place at CERN within the CLIC (Compact Linear Collider) project. Photocathodes are produced as thin films on Oxygen Free copper substrate using a co-deposition technique",
        "and characterized in a dedicated laboratory with a DC photo-electron gun. A new UHV carrier vessel compatible with CERN’s XPS (X-ray Photoelectron Spectroscopy) analysis equipment has been commissioned and is used to transport photocathodes from the production laboratory to perform a systematic study of different compounds used as photoemissive materials. In this paper photocathodes used in a RF photoinjector will be characterized and the correlation of their surface properties with their performance will be investigated."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje040.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE041",
      "title": "Progress on a Compact Accelerator Design for a Compton Light Source",
      "authors": [
        "K.E. Deitrick",
        "J.R. Delayen",
        "B.R.P. Gamage",
        "G.A. Krafft",
        "T. Satogata",
        "ODU",
        "Norfolk",
        "Virginia",
        "USA",
        "A compact Compton light source using an electron linear accelerator is in design at the Center for Accelerator Science at Old Dominion University and Jefferson Lab. We report on the current design",
        "including beam properties through the entire system based on a full end-to-end simulation",
        "compare current specifications to design goals",
        "and target areas for improvement."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje041_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje041.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje041_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE041",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE042",
      "title": "Transverse Tunes Determination from Mixed BPM Data",
      "authors": [
        "P. Zisopoulos",
        "F. Antonioupresenter",
        "Y. Papaphilippou",
        "CERN",
        "Geneva",
        "Switzerland",
        "E. Hertle",
        "A.-S. Müller",
        "KIT",
        "Eggenstein-Leopoldshafen",
        "Germany",
        "Decoherence due to non-zero chromaticity and/or amplitude dependent tune-shift",
        "but also damping mechanisms can affect the accurate tune determination by leaving a limited number of turns for frequency analysis of the turn by turn (TbT) position data. In order to by-pass these problems",
        "Fourier analysis of mixed TBT data from all BPMs can be employed. The approach is applied in two different accelerators",
        "a hadron collider as the LHC and a synchrotron light source as the ANKA storage ring. The impact in the accuracy of the method of missing BPM data is also discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje042.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE044",
      "title": "Local Orbit Response Matrix Measurement at SLS",
      "authors": [
        "M. Aiba",
        "M. Böge",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "The experimental determination of linear optics is essential to achieve a high performance ring accelerator. One of the methods",
        "linear optics from closed orbits (LOCO)",
        "is widely employed to correct linear optics. Due to the ring nature",
        "a quadrupole error at a location of the ring affects the entire orbit response measurement data. The orbit response",
        "however",
        "can be localised to a certain range of the ring when an orbit feedback (or correction) is applied to the rest of the ring. The quadrupole errors located in the range",
        "where the feedback is acting",
        "then have no impact",
        "and the ring optics can be locally examined. An application of this technique to Swiss light source is discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje044.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE045",
      "title": "Round Beam Operation in Electron Storage Rings and generalisation of Mobius accelerator",
      "authors": [
        "M. Aiba",
        "M.P. Ehrlichman",
        "A. Streun",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "A better performing photon beam can be obtained from light sources when the eletron beam is formed into a \"round beam\" rather than a flat beam. It is realised by equally distributing the natural emittance into the horizontal and vertical planes. There are a few approaches for the emittance distribution",
        "and we explored the so-called Mobius accelerator scheme",
        "where a transverse (horizontal-vertical) emittance exchange results at each turn of beam revolution. The original proposal of Mobius accelerator was based on a set of five succesive skew quadruples",
        "requiring a dedicated long straight section. We generalise the Mobius accelerator section to find more convenient configurations. Applications to a light source storage ring lattice and some tracking results are also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje045.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE046",
      "title": "Investigation of the Injection Scheme for SLS 2.0",
      "authors": [
        "Á. Saá Hernández",
        "M. Aiba",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "SLS2",
        "an upgrade of the Swiss Light Source (SLS)",
        "aiming at a natural horizontal emittance in the range of 100 pm is planned and under study. This will be achieved by replacing the current magnet lattice of the electron storage ring by a new multibend achromat magnet lattice",
        "while reusing the injector chain and most of the existing infrastructures. The new low emittance ring will impose more restrictive constraints on injection due to a smaller machine aperture and a very compact lattice",
        "dominated by non-linearities. We performed a study to find the optimum injection scheme for SLS2 among the conventional and more advanced schemes; namely multipole kicker injection (off-axis and also on-axis matched to the off-momentum closed orbit) and longitudinal injection."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje046_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje046.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje046_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE046",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE047",
      "title": "Design Studies for an Upgrade of the SLS Storage Ring",
      "authors": [
        "A. Streun",
        "M. Aiba",
        "M. Bögepresenter",
        "M.P. Ehrlichman",
        "Á. Saá Hernández",
        "PSI",
        "Villigen PSI",
        "Switzerland",
        "An upgrade of the Swiss Light Source (SLS) would replace the existing storage ring by a low aperture multibend achromat lattice providing an emittance of about 100–200 pm at 2.4 GeV",
        "while maintaining the hall",
        "the beam lines and the injector. Since emittance scales inversely cubically with the number of lattice cells",
        "an SLS upgrade is challenged by the comparatively small ring circumference of only 288 m. A new concept for a compact low emittance lattice is based on longitudinal gradient bending magnets for emittance minimization and on anti-bends (i.e bends of opposite field polarity) to disentangle dispersion and horizontal beta function in order to provide the optimum matching to the longitudinal gradient bends while minimizing the contribution to chromaticity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje047_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje047.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje047_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE047",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE048",
      "title": "Orbit Correction and Stability Studies for Ultra-Low Emittance Storage Rings",
      "authors": [
        "M. Böge",
        "M. Aiba",
        "A. Streun",
        "PSI",
        "Villigen PSI",
        "Switzerland"
      ],
      "institutions": [],
      "abstract": "Ultra-low emittance storage rings exhibit extremely strong focusing and sextupolar chromaticity corrections. The therefore mandatory excellent centering of the closed orbit in the small aperture magnets is a challenging task and necessitates a proper beam diagnostics and correction layout. Correction and stability studies for a possible ultra-low emittance upgrade of the Swiss Light Source are presented. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje048_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje048.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje048_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE048",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE049",
      "title": "TPS Linac Relocation and Beam Test of the LTB Transfer Line",
      "authors": [
        "H.-P. Chang",
        "A.Y. Chen",
        "C.L. Chen",
        "Y.-S. Chengpresenter",
        "C.-S. Fann",
        "K.T. Hsu",
        "S.Y. Hsu",
        "K.-K. Lin",
        "Y.C. Lin",
        "J. Liu",
        "K.L. Tsai",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "The Taiwan Photon Source (TPS) 150 MeV linac has been relocated from its 2011 test site to the TPS linac tunnel in 2014. After functional test of the linac hardware modules",
        "the beam parameters were carefully examined at a 31-degree bend diagnostic beam line LTD (linac to beam dump) and compared with previous results. Then",
        "the 150 MeV electron beam was delivered to the linac to booster transfer line (LTB) for beam commissioning. The beam optics matching at both the LTB entrance (i.e. linac exit) and the LTB exit (i.e. injection point of booster) was performed for injection optimization purpose. The LTB lattice setting was verified in the beam steering through LTD and LTB with the help of diagnostics tools such as beam profile monitors (SM) and beam position monitors (BPM). The overall performance of the linac and LTB will be described in this report."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje049.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE050",
      "title": "Design of a Resonant Transition Radiation Source in the soft X-ray Range",
      "authors": [
        "P. Wang",
        "K.C. Leou",
        "NTHU",
        "Hsinchu",
        "Taiwan",
        "N.Y. Huangpresenter",
        "W.K. Lau",
        "A.P. Lee",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Resonant transition radiation (RTR) can be generated from multi-layer structures when they are driven by relativistic electron beams. In consideration of using the NSRRC 90 MeV photoinjector as driver",
        "we examined the feasibility of generating narrow-band soft x-rays from various multi-layer structures. Based on analytical theory",
        "the expected angular-spectral distribution and photon yield of these radiators are calculated and compared."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje050.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE052",
      "title": "Bunch Compression in the Driver Linac for the Proposed NSRRC VUV FEL",
      "authors": [
        "N.Y. Huang",
        "W.K. Lau",
        "A.P. Lee",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "A. Chao",
        "K. Fang",
        "M.-H. Wang",
        "J. Wu",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "A bunch compressor is designed for the S-band driver linac system of the proposed NSRRC VUV free electron laser (FEL). Instead of using a more conventional rf harmonic linearizer",
        "one main feature of this compressor is to use electron linearization optics to correct the nonlinearity in the energy-time correlation of the electron bunch longitudinal phase space. The strategy of compressor design will be discussed by an analytical calculation and particle tracking simulation. The beam dynamics which include the collective instabilities such as the space charge effects",
        "the wake fields and the coherent synchrotron radiation (CSR) effects are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje052.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE053",
      "title": "Hardware Improvements and Beam Commissioning of the Booster Ring in Taiwan Photon Source",
      "authors": [
        "H.-J. Tsai",
        "C.-T. Chen",
        "J.Y. Chen",
        "M.-S. Chiu",
        "P.C. Chiu",
        "P.J. Choupresenter",
        "K.T. Hsu",
        "K.H. Hu",
        "C.-C. Kuo",
        "Y.-C. Liu",
        "G.-H. Luo",
        "F.H. Tseng",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Taiwan Photon Source (TPS)",
        "a low emittance 3-GeV third-generation synchrotron light source",
        "began its hardware integration testing",
        "safety checkout and beam commissioning on August 12",
        "2014 [1]. The booster ring and the storage ring share the same tunnel in a concentric fashion; the booster ring has circumference 496.8 m",
        "the largest among light source facilities in operation. A combined-function FODO lattice is adopted for the booster ring with natural emittance 10 nm-rad. After hardware improvements were completed",
        "the commissioning of the beam in the booster ring began on December 12 and attained the 3-GeV design energy on December 16."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje053.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE054",
      "title": "Developments in CLARA Accelerator Design and Simulations",
      "authors": [
        "P.H. Williams",
        "D. Angal-Kalinin",
        "A.D. Brynespresenter",
        "F. Jackson",
        "J.K. Jones",
        "J.W. McKenzie",
        "B.L. Militsyn",
        "B.D. Muratori",
        "N. Thompson",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "We present recent developments in the accelerator design of CLARA (Compact Linear Accelerator for Research and Applications)",
        "the proposed UK FEL test facility at Daresbury Laboratory. The layout changes include a dedicated collimator in CLARA front end to provide some control over the dark current",
        "changes to low energy diagnostics section and modifications to FEL modules. The progress in the design simulations mainly focus on injector simulations incorporating wake fields in ASTRA",
        "comparison of using ELEGANT and CSRTRACK for the Variable Bunch Compressor and first considerations of requirement of laser heater for CLARA."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje054_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje054.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje054_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE054",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE055",
      "title": "The Evolution of the Transverse Energy Distribution of Electrons from a GaAs Photocathode as a Function of its Degradation State",
      "authors": [
        "L.B. Jones",
        "B.L. Militsyn",
        "T.C.Q. Noakespresenter",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "H.E. Scheibler",
        "A.S. Terekhov",
        "ISP",
        "Novosibirsk",
        "Russia",
        "The brightness of a photoelectron injector is fundamentally limited by the mean longitudinal and transverse energy distributions of the photoelectrons emitted from its photocathode",
        "and is increased significantly if the mean values of these quantities are reduced. To address this",
        "ASTeC constructed a Transverse Energy Spread Spectrometer (TESS)* – an experimental facility designed to measure these transverse and longitudinal energy distributions which can be used for III-V semiconductor",
        "alkali antimonide/telluride and metal photocathode research. We present measurements showing evolution of the transverse energy distribution of electrons from GaAs photocathodes as a function of their degradation state. Photocathodes were activated to negative electron affinity in our photocathode preparation facility (PPF)** with quantum efficiency around 10.5%. They were then transferred to TESS under XHV conditions",
        "and progressively degraded through controlled exposure to oxygen. Data has been collected under photocathode illumination at 635 nm",
        "and demonstrates a constant relationship between energy distribution and the level of electron affinity.",
        "* Proc. FEL ’13"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje055_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje055.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje055_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE055",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE056",
      "title": "VELA Machine Development and Beam Characterisation",
      "authors": [
        "D.J. Scott",
        "D. Angal-Kalinin",
        "A.D. Brynes",
        "F. Jackson",
        "J.K. Jones",
        "A. Kalinin",
        "S.L. Mathisen",
        "J.W. McKenzie",
        "B.L. Militsyn",
        "B.D. Muratori",
        "T.C.Q. Noakes",
        "L.K. Rudge",
        "E. Sneddon",
        "M. Surman",
        "R. Valizadeh",
        "A.E. Wheelhouse",
        "P.H. Williams",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "S.D. Barrett",
        "C.P. Topping",
        "A. Wolski",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "JAI",
        "Egham",
        "Surrey",
        "United Kingdom",
        "STFC/DL",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "C.P. Topping",
        "A. Wolski",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "Royal Holloway",
        "University of London",
        "Surrey",
        "United Kingdom",
        "Recent developments on the VELA (Versatile Electron Linear Accelerator) RF photo-injector at Daresbury Laboratory are presented. These are three-fold; commissioning/installation",
        "characterising and providing beam to users. Measurements for characterising the dark current (DC)",
        "4-D transverse emittance",
        "lattice functions and photoinjector stability are presented. User beam set ups to provide beam for electron diffraction and Cavity Beam Position Monitor development are summarised."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje056.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE057",
      "title": "Realistic Undulators for Intense Gamma-ray Beams at Future Colliders",
      "authors": [
        "A.O. Alrashdi",
        "I.R. Bailey",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "The baseline designs for the ILC and CLIC require the production of an intense flux of gamma rays in their positron sources. In the case of CLIC the gamma rays are produced by a Compton backscattering source",
        "but in this paper we concentrate on undulator-based sources as proposed for the ILC. We present the development of a simulation to generate a magnetic field map based on a Fourier analysis of any measured field map. We have used a field map measured from the ILC helical undulator prototype to calculate the typical distribution of field errors",
        "and used them in our calculations to produce simulated field maps. We show that a loss of gamma ray intensity of ~ 8% could be expected",
        "compared to the ideal case. This leads to a similar drop in positron production which can be compensated for by increasing the undulator length."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje057.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE058",
      "title": "Preparation of Polycrystalline and Thin Film Metal Photocathodes for Normal Conducting RF Guns",
      "authors": [
        "S. Mistry",
        "M.D. Cropper",
        "Loughborough University",
        "Leicestershre",
        "United Kingdom",
        "A.N. Hannah",
        "K.J. Middleman",
        "B.L. Militsyn",
        "T.C.Q. Noakes",
        "R. Valizadeh",
        "STFC/DL/ASTeC",
        "Daresbury",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "A comparison of quantum efficiency (QE) and work function (wf) measurements of polycrystalline and thin film metal photocathodes for use in NCRF guns",
        "similar to the S-band gun under development for CLARA project at Daresbury",
        "are reported. Cu and Nb thin films were grown onto a Si substrate by magnetron sputtering and subsequently were prepared by annealing and Ar ion sputtering. To determine the surface chemistry",
        "x-ray photoelectron spectroscopy was employed. QE measurements were enabled using a UV laser source giving 266 nm light. Wf measurements were carried out using a kelvin probe and ultraviolet photoelectron spectroscopy. Annealing the Cu thin film to 250°C yielded a QE of 1.2E-4; one order of magnitude higher than the QE for sputter cleaned and post annealed polycrystalline Cu. The optimum QE measurement for Nb thin film was 2.6·10-4",
        "which was found to be comparable to the results obtained for cleaned bulk Nb. Analysis of XPS data of these metals suggest surface composition and surface chemistry are main contributing factors to the QE and WF."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje058.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE059",
      "title": "Modeling of an Electron Injector for the AWAKE Project",
      "authors": [
        "Ö. Mete",
        "G.X. Xia",
        "UMAN",
        "Manchester",
        "United Kingdom",
        "R. Apsimon",
        "G. Burt",
        "Cockcroft Institute",
        "Lancaster University",
        "Lancaster",
        "United Kingdom",
        "CERN",
        "Geneva",
        "Switzerland",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom"
      ],
      "institutions": [
        "Funding: Cockcroft Institute Core Grant"
      ],
      "abstract": "Particle in cell simulations were performed to characterise an electron injector for AWAKE project in order to provide a tuneable electron beam within a range of specifications required by the plasma wakefield experiments. Tolerances and errors were investigated. These results are presented in this paper alongside with the investigation regarding the beam dynamics implications of the 3GHz travelling wave structure developed for the injector. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje059.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE060",
      "title": "Development of Advanced Fourth Generation Light Sources for the Accelerator Science Laboratory",
      "authors": [
        "T. Chanwattana",
        "R. Bartolini",
        "A. Seryi",
        "JAI",
        "Oxford",
        "United Kingdom",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "CERN",
        "Geneva",
        "Switzerland",
        "The John Adams Institute for Accelerator Science (JAI) has proposed the realisation of the Accelerator Science Laboratory (ASL) at the University of Oxford as a facility for the development of advanced compact light sources enabling accelerator science research and applications. The installation of a compact light source in the ASL is planned with two options for the accelerating technologies. Firstly",
        "a conventional RF based accelerator is considered to be a driver for a short pulse THz coherent synchrotron radiation (CSR). The other option focusses on the radiation produced by a Laser Plasma Accelerator (LPA) advanced accelerator technique that will provide the possibility to shorten the length of the beamline. This paper presents results of the studies on beam dynamics for both options of compact light sources in the ASL."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje060.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE061",
      "title": "Injection Studies for the Diamond Storage Ring",
      "authors": [
        "I.P.S. Martin",
        "M. Apolloniopresenter",
        "R. Bartolini",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "JAI",
        "Oxford",
        "United Kingdom",
        "The Diamond storage ring will be upgraded during 2016 by replacing one of the existing double bend achromat (DBA) cells with a double-DBA (DDBA) cell*. It is anticipated that both the on and off momentum dynamic aperture will reduce as a result of this change. In order to prepare for this eventuality",
        "injection into the Diamond storage ring has been recently studied in detail. In particular",
        "the oscillation amplitude",
        "angle and energy of the injected beam have been determined",
        "along with the position of the stored beam with respect to the septum plate. Following these studies",
        "the injected beam energy has been matched to the storage ring",
        "and plans have been put in place to move the injection septum 4 mm closer to the stored beam centre line.",
        "*R.P. Walker et al.",
        "“The Double-Double Bend Achromat (DDBA) Lattice Modification for the Diamond Storage Ring”",
        "Proc. IPAC 2014"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje061_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje061.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje061_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE061",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE062",
      "title": "First Transparent Realignment Tests at the Diamond Storage Ring",
      "authors": [
        "M. Apollonio",
        "R. Bartolini",
        "P. Dudin",
        "M. Hoesch",
        "W.J. Hoffman",
        "E.C. Longhi",
        "A.J. Rose",
        "A. Thomson",
        "DLS",
        "Oxfordshire",
        "United Kingdom",
        "JAI",
        "Oxford",
        "United Kingdom"
      ],
      "institutions": [],
      "abstract": "The Transparent Realignment of the Diamond Storage Ring is a program of work to improve the mechanical alignment of the machine by carefully moving the magnet girders with a virtually zero impact on the associated beamlines. The girders can be moved by means of a 5-axis motion system under remote control via the EPICS toolkit from the Diamond Control Room. Currently three cells (three girders in each) have been equipped with a permanent protection system to prevent excessive deflection across each of the inter-girder vacuum bellows. The protection and motion systems are installed in the associated Control and Instrumentation Area (CIA). Full commissioning of the motion and protection systems have been completed. Results from the alignment test sessions are hereby reported. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje062_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje062.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje062_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE062",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE063",
      "title": "Hybrid Seven-Bend-Achromat Lattice for the Advanced Photon Source Upgrade",
      "authors": [
        "M. Borland",
        "V. Sajaev",
        "Y. Sun",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "A hybrid seven-bend-achromat lattice has been designed for the APS upgrade. We describe the design goals",
        "constraints",
        "and methodology",
        "including the choice of beam energy. Magnet strength and spacing is compatible with engineering designs for the magnets",
        "diagnostics",
        "and vacuum system. Dynamic acceptance and local momentum acceptance were simulated using realistic errors",
        "then used to assess workable injection methods and predict beam lifetime. Predicted brightness is two to three orders of magnitude higher than the existing APS storage ring. Pointers are provided to other papers in this conference that cover subjects in more detail."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje063_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje063.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje063_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE063",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE064",
      "title": "Calibration of Fast Fiber-Optic Beam Loss Monitors for the Advanced Photon Source Storage Ring Superconducting Undulators",
      "authors": [
        "J.C. Dooling",
        "K.C. Harkaypresenter",
        "Y. Ivanyushenkov",
        "V. Sajaev",
        "A. Xiao",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "University of Illinois at Urbana-Champaign",
        "Illinois",
        "USA",
        "We report on the calibration and use of fast fiber-optic (FO) beam loss monitors (BLMs) in the Advanced Photon Source storage ring (SR). A superconducting undulator prototype (SCU0) has been operating in SR Sector 6 since the beginning of CY2013",
        "and another undulator SCU1 (a 1.1-m length undulator that is three times the length of SCU0) is scheduled for installation in Sector 1 in 2015. The SCU0 main coil often quenches during beam dumps. MARS simulations have shown that relatively small beam loss (<1 nC) can lead to temperature excursions sufficient to cause quenching when the SCU0 windings are near critical current. To characterize local beam losses",
        "high-purity fused-silica FO cables were installed in Sector 6 next to the SCU0 cryostat and in Sector 1 where SCU1 will be installed. These BLMs aid in the search for operating modes that protect the SCU structures from beam-loss-induced quenching. In this paper",
        "we describe the BLM calibration process that included deliberate beam dumps at locations of BLMs. We also compare beam dump events where SCU0 did and did not quench."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje064_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje064.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje064_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE064",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE065",
      "title": "Multi-Bunch Stability Analysis of the Advanced Photon Source Upgrade Including the Higher-Harmonic Cavity",
      "authors": [
        "L. Emery",
        "T.G. Berenc",
        "M. Borland",
        "R.R. Lindberg",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "Multi-bunch stability simulations were done for the very-low-emittance hybrid seven-bend-achromat (H7BA) lattice proposed for the Advanced Photon Source (APS) upgrade. The simulations",
        "performed using tracking code elegant",
        "were meant to determine whether the long-term wakefields of the higher-order modes (HOMs) of the main 352-MHz cavities will produce an instability. The multi-particle simulations include the important effects of the Higher-Harmonic Cavity (HHC) and the longitudinal impedance of the new vacuum chamber. These realistic simulations show that the HHC provides additional damping in the form of the Landau damping. Still",
        "the HOMs may likely produce a multi-bunch instability which can be cured with more effective HOM damping or a longitudinal feedback system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje065_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje065.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje065_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE065",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE066",
      "title": "Development of an Abort Kicker at APS to Mitigate Beam Loss-induced Quenches of the Superconducting Undulator",
      "authors": [
        "K.C. Harkay",
        "J.C. Dooling",
        "Y. Ivanyushenkov",
        "R. Laird",
        "F. Lenkszus",
        "C.C. Putnam",
        "V. Sajaev",
        "J. Wang",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "The first superconducting undulator (SCU0) at the Advanced Photon Source (APS) has been delivering 80-100 keV photons for user science since January 2013. SCU0 often quenches during beam dumps triggered by the machine protection system (MPS). SCU0 typically recovers quickly after a quench",
        "but SCU1",
        "a second",
        "longer device to be installed in 2015",
        "may take longer to recover. We tested using injection kickers as an abort system to dump the beam away from SCU0 and the planned location of SCU1. An alternate trigger was tested that fires the kickers with MPS. We demonstrated that controlling the beam dump location with kickers can significantly reduce the beam losses at SCU0",
        "as measured by fiber optic (FO) beam loss monitors (BLMs)",
        "and can also prevent a quench. A dedicated abort kicker system has been developed based on elegant simulations. A spare injection kicker was modified to produce the required waveform. Injection kicker tests",
        "simulations",
        "and the abort kicker design are described. Demonstration of this strategy in APS has implications for the APS Upgrade",
        "where more SCUs are planned."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje066_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje066.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje066_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE066",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE067",
      "title": "Status of the APS Upgrade Project",
      "authors": [
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "A concept for an upgrade to the Advanced Photon Source based on a multi-bend achromat lattice is being developed at Argonne National Laboratory. An MBA upgrade to the APS will reduce the horizontal emittance by a factor of ~50. Coupled with superconducting undulators",
        "the APS-U brightness will be two to three orders of magnitude beyond that which is available today at the APS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje067_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje067.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje067_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE067",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE068",
      "title": "Development and Performance of 1.1-m Long Superconducting Undulator at the Advanced Photon Source",
      "authors": [
        "Y. Ivanyushenkov",
        "C.L. Doose",
        "J.F. Fuerst",
        "E. Gluskin",
        "K.C. Harkay",
        "Q.B. Hasse",
        "M. Kasa",
        "Y. Shiroyanagi",
        "D. Skiadopoulos",
        "E. Trakhtenberg",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "Development of superconducting undulators continues at the Advanced Photon Source (APS). The second superconducting undulator",
        "SCU1",
        "has been built and installed in the storage ring of the APS. This undulator has a 1.1-m long superconducting magnet and utilizes an improved version of the cryostat of the first superconducting undulator",
        "SCU0. The results of the cold test of the SCU1",
        "and its performance in the APS storage ring are presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje068_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje068.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje068_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE068",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE069",
      "title": "Fast Injection System R&D for the APS Upgrade",
      "authors": [
        "F. Lenkszus",
        "J. Carwardine",
        "A.R. Cours",
        "G. Decker",
        "L.H. Morrison",
        "X. Sun",
        "J. Wang",
        "F. Westferro",
        "A. Xiao",
        "C. Yao",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "The MBA upgrade for the APS will operate with bunch swap out and on axis injection. The planned 324 bunch fill pattern places difficult demands on the injection and extraction kickers. The present concept uses dual stripline kickers driven by high Voltage pulsers. Minimizing perturbation on adjacent bunches requires very fast rise and fall times with relatively narrow ~20 nsec",
        "15 kV pulses. To achieve these requirements we have initiated a multifaceted R&D program. The R&D includes the HV pulser",
        "stripline kicker and HV feedthrough. We have purchased a commercial dual channel HV pulser and are evaluating its performance and reliability. In addition",
        "we are investigating the feasibility of using nonlinear ferrite loaded coaxial cables (shockwave transmission line) to sharpen the leading and trailing edges of high voltage pulses. We are also developing a prototype kicker and high voltage feedthrough. The requirements for injection and extraction",
        "progress on prototype development and results of our HV pulser investigations will be reported."
      ],
      "institutions": [
        "Funding: Results in this report are derived from work performed at Argonne National Laboratory. Argonne is operated by UChicago Argonne, LLC, for the U.S. Department of Energy under contract DE-AC02-06CH11357."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje069_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje069.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje069_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE069",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE070",
      "title": "Preliminary Experimental Investigation of Quasi Achromat Scheme at Advanced Photon Source",
      "authors": [
        "Y. Sun",
        "H. Shang",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "Next generation storage rings require weaker dipole magnets and stronger quadrupole focusing to achieve very low emittance. To suppress the geometric and chromatic optics aberrations introduced by the strong sextupoles",
        "achromat and quasi achromat schemes are applied in the lattice design to improve the beam dynamics performance. In this paper",
        "some preliminary experimental investigation of the quasi achromat scheme at the Advanced Photon Source (APS) are presented. Three different operation lattices are compared on their beam dynamics performance. Although none of these operation lattices achieve ideal quasi achromat condition",
        "they have certain relevant features. It is observed that fewer resonances are present in the nominal operation lattice which is most close to quasi achromat required conditions."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje070_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje070.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje070_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE070",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE071",
      "title": "Alternate Lattice Design for Advanced Photon Source Multi-Bend Achromat Upgrade",
      "authors": [
        "Y. Sun",
        "M. Borland",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "A 67-pm hybrid-seven-bend achromat (H7BA) lattice is proposed for a future Advanced Photon Source (APS) multi-bend-achromat (MBA) upgrade. This lattice requires use of a swap-out (on-axis) injection scheme. Alternate lattice design work has also been performed to achieve better beam dynamics performance than the nominal APS MBA lattice",
        "in order to allow beam accumulation. One of such alternate H7BA lattice designs",
        "which still targets a very low emittance of 76 pm",
        "is discussed in this paper. With these lattices",
        "existing APS injector complex can be employed without the requirement of a very high charge operation. Studies show that an emittance below 76 pm can be achieved with the employment of reverse bends in an alternate lattice. We discuss the predicted performance and requirements for these lattices and compare them to the nominal lattice."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje071_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje071.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje071_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE071",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE072",
      "title": "Advanced Photon Source Injection Related Simulation and Measurement",
      "authors": [
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "Injection efficiency is one of the key factors in ensuring successful operation of storage ring light sources. In this paper",
        "injection simulation and measurement studies at the Advanced Photon Source will be presented. The tracking simulations and measurements are compared in terms of the dynamic aperture and injection efficiency. Injection efficiency is also measured on the betatron tunes space and on different stored beam orbits."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje072_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje072.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje072_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE072",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE073",
      "title": "Results of the Magnetic Tuning of 2.8 m Long Vertically Polarizing Undulator with the Dynamic Compensation of Magnetic Forces",
      "authors": [
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "A novel undulator prototype with a horizontal magnetic field and dynamic compensation of magnetic forces has been recently developed at the APS as a part of the LCLS-II R&D program. This undulator should meet stringent requirements for any LCLS-II insertion device. These requirements include limits on the field integrals and phase errors for all operational gaps",
        "and the reproducibility and accuracy of the gap settings. Extensive mechanical testing has resulted in a performance that meets the requirements on the undulator gap setting. The magnetic tuning has been accomplished by applying a set of magnetic shims. As a result",
        "the satisfactory performance of the undulator prototype has been demonstrated.",
        "The submitted manuscript has been created by UChicago Argonne",
        "LLC",
        "Operator of Argonne National Laboratory. Argonne",
        "Contract No. DE-AC02-06CH11357."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje073_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje073.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje073_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE073",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE074",
      "title": "LCLS Injector Laser Modulation to Improve FEL Operation Efficiency and Performance",
      "authors": [
        "S. Li",
        "D.K. Bohler",
        "W.J. Corbett",
        "A.S. Fisher",
        "S. Gilevich",
        "Z. Huang",
        "A. Li",
        "D.F. Ratner",
        "J. Robinson",
        "F. Zhou",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "R.B. Fiorito",
        "E.J. Montgomery",
        "UMD",
        "College Park",
        "Maryland",
        "USA",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "In the Linear Coherent Light Source (LCLS) at SLAC",
        "the injector laser plays an important role as the source of the electron beam for the Free Electron Laser (FEL). The injector laser strikes a copper photocathode which emits photo-electrons due to photo-electric effect. The emittance of the electron beam is highly related to the transverse shape of the injector laser. Currently the LCLS injector laser has hot spots that degrade the FEL performance. The goal of this project is to use adaptive optics to modulate the transverse shape of the injector laser",
        "in order to produce a desired shape of electron beam. With a more controllable electron transverse profile",
        "we can achieve lower emittance for the FEL",
        "improve the FEL performance and operation reliability. We first present various options for adaptive optics and damage test results. Then we will discuss the shaping process with an iterative algorithm to achieve the desired shape",
        "characterized by Zernike polynomial deconstruction."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje074_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje074.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje074_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE074",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE075",
      "title": "Simulation Study of Injection Performance for the Advanced Photon Source Upgrade",
      "authors": [
        "A. Xiao",
        "V. Sajaev",
        "ANL",
        "Argonne",
        "Ilinois",
        "USA",
        "A vertical on-axis injection scheme has been proposed for the hybrid seven-bend-achromat (H7BA) Advanced Photon Source upgrade (APSU) lattice. In order to evaluate the injection performance",
        "various errors",
        "such as injection beam jitter",
        "optical mismatch and errors",
        "and injection element errors have been investigated and their significance has been discovered. Injection efficiency is then simulated under different error levels. Based on these simulation results",
        "specifications and an error-budget for individual systems have been defined."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje075_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje075.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje075_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE075",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE076",
      "title": "Design Study of the Higher Harmonic Cavity for Advanced Photon Source Upgrade",
      "authors": [
        "S.H. Kim",
        "T.G. Berenc",
        "J. Carwardine",
        "G. Decker",
        "M.P. Kelly",
        "P.N. Ostroumov",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "A higher-harmonic cavity is planned for the proposed Advanced Photon Source (APS) multi-bend achromat (MBA) lattice to increase the bunch length",
        "improve the Touschek lifetime and increase the single-bunch current limit. We have investigated a range of options including 3rd",
        "4th",
        "and 5th harmonics of the main radio frequency (RF) system",
        "as well as configurations with and without external RF power couplers. The current baseline is a single 4th harmonic superconducting cavity with adjustable RF couplers and a slow tuner which provide the flexibility to operate over a wide range of beam currents. The cavity is designed to provide 0.84 MV at 1408 MHz for the nominal 6 GeV",
        "200 mA electron beam",
        "and 4.1 MV main RF voltage. In this paper",
        "we discuss the harmonic cavity parameters based on analytical calculations of the equilibrium bunch distribution and make comparisons to other options."
      ],
      "institutions": [
        "Funding: Results in this report are derived from work performed at Argonne National Laboratory. Argonne is operated by UChicago Argonne, LLC, for the U.S. Department of Energy under contract DE-AC02-06CH11357."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje076_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje076.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje076_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE076",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE077",
      "title": "Instability Thresholds for the Advanced Photon Source Multi- Bend Achromat Upgrade",
      "authors": [
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "An important operating mode for the multi-bend achromat (MBA) upgrade at the Advanced Photon Source (APS) calls for 200 mA average current divided evenly over 48 bunches. Ensuring that the desired 4.2 mA single bunch current can be stably stored requires a detailed understanding of the impedance in the MBA ring. We briefly discuss modeling sources of impedance using the electromagnetic codes GdfidL and ECHO",
        "and how we then include both geometric and resistive wall wakefields using the tracking code elegant to predict collective instabilities. We first validate our procedures by comparing APS experimental measurements to tracking predictions using the APS storage ring impedance model. We then discuss the MBA impedance model",
        "for which we find that a chromaticity of 5 units is sufficient to obtain the required 4.2 mA single bunch current. Finally",
        "we mention certain design changes that may reduce the impedance and allow for a reduction in chromaticity."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje077_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje077.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje077_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE077",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE078",
      "title": "Modeling of Impedance Effects for the APS-MBA Upgrade",
      "authors": [
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Understanding the sources of impedance is critical to accelerator design",
        "and only becomes more important as vacuum chambers become smaller and closer to the electron beam. The multibend achromat upgrade at the Advanced Photon Source (APS) requires small",
        "22-mm diameter vacuum chambers and even smaller (6 mm) gaps for the insertion devices",
        "so that both rf heating and wakefield-driven transverse instabilities become important concerns. We discuss modeling the primary sources of geometric impedance using the electromagnetic finite difference codes GdfidL and ECHO",
        "and how these codes are influencing vacuum and accelerator component design."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje078_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje078.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje078_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE078",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE079",
      "title": "High Charge Development of the APS Injector for an MBA Upgrade",
      "authors": [
        "C. Yao",
        "M. Borland",
        "J.R. Calvey",
        "K.C. Harkaypresenter",
        "D. Horan",
        "R.R. Lindberg",
        "N. Sereno",
        "H. Shang",
        "X. Sun",
        "J. Wang",
        "ANL",
        "Argonne",
        "Illinois",
        "USA",
        "The APS MBA (multi-bend achromat) upgrade storage ring will employ a “swap out” injection scheme and requires a single-bunch beam with up to 20 nC from the injector. The APS injector",
        "which consists of a 450-MeV linac",
        "a particle accumulator ring (PAR)",
        "and a 7-GeV synchrotron (Booster)",
        "was originally designed to provide up to 6 nC of beam charge. High charge injector study is part of the APS upgrade R&D that explores the capabilities and limitations of the injector through machine studies and simulations",
        "and identifies necessary upgrades in order to meet the requirements of the MBA upgrade. In the past year we performed PAR and booster high charge studies",
        "implemented new ramp correction of the booster rap supplies",
        "explored non-linear chromatic correction of the booster",
        "etc. This report presents the results and findings."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje079_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje079.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje079_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE079",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE080",
      "title": "First Beam and High-Gradient Cryomodule Commissioning Results of the Advanced Superconducting Test Accelerator at Fermilab",
      "authors": [
        "D.J. Crawford",
        "C.M. Baffes",
        "D.R. Broemmelsiek",
        "K. Carlson",
        "B.E. Chase",
        "E. Cullerton",
        "J.S. Diamond",
        "N. Eddy",
        "D.R. Edstrom",
        "E.R. Harms",
        "A. Hocker",
        "C.D. Joe",
        "A.L. Klebaner",
        "M.J. Kucera",
        "J.R. Leibfritz",
        "A.H. Lumpkin",
        "J.N. Makara",
        "S. Nagaitsev",
        "O.A. Nezhevenko",
        "D.J. Nicklaus",
        "L.E. Nobrega",
        "P. Piot",
        "P.S. Prieto",
        "J. Reid",
        "J. Ruan",
        "J.K. Santucci",
        "W.M. Soyars",
        "G. Stancari",
        "D. Sun",
        "R.M. Thurman-Keup",
        "A. Valishev",
        "A. Warner",
        "S.J. Wesseln",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The advanced superconducting test accelerator at Fermilab has accelerated electrons to 20 MeV and",
        "separately",
        "the International Linear Collider (ILC) style 8-cavity cryomodule has achieved the ILC performance milestone of 31.5 MV/m per cavity. When fully completed",
        "the accelerator will consist of a photoinjector",
        "one ILC-type cryomodule",
        "multiple accelerator R&D beamlines",
        "and a downstream beamline to inject 300 MeV electrons into the Integrable Optics Test Accelerator (IOTA). We report on the results of first beam",
        "the achievement of our cryomodule to ILC gradient specifications",
        "and near-term future plans for the facility."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje080_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje080.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje080_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE080",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE081",
      "title": "Model of Dark Current in SRF Linac",
      "authors": [
        "A.I. Sukhanov",
        "A. Saini",
        "N. Solyak",
        "I.S. Tropin",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "Currently",
        "few linacs based on 9-cell TESLA-type SRF cavities are being designed or bult",
        "including XEFL",
        "LCLS-II and ILC. Dark current electron generated by field emission in SRF cavities can be captured and accelerated in the linac up to hundreds MeV before they removed by focusing magnets. Lost dark current electrons interact with the materials surrounding SRF cavities and magnets",
        "produce electromagnetic showers and contribute to the radiation in the linac tunnel. In this paper we present a model of dark current in a linac based on TESLA cavities. We show preliminary results of the simulation applied to ILC main linac."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje081_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje081.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje081_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE081",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPJE084",
      "title": "Development of Nonlinear Injection Kicker Magnet for ALS Accelerator",
      "authors": [
        "G.C. Pappas",
        "D.J. Baum",
        "J.-Y. Jung",
        "D. Robin",
        "C. Steier",
        "C. Sun",
        "C.A. Swenson",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "The ALS in now engaged in the construction of a new hard x-ray beam line and insertion device for protein crystallography. The scope of work entails the reconfiguration of ALS Sectors 1-3 to make room for the new insertion device. The project will require the melioration of the ALS injection system as well as the development of a longitudinal RF kicker. A key aspect of the injector work is the development and integration of a nonlinear injection kicker (NLK) magnet system to facilitate top off injection without noticeable motion of the beam. The technology will",
        "in principal",
        "ultimately allow the removal of the conventional bump injection magnets presently located in ALS Sector 1. The nonlinear injection concept has been explored at several other light sources *. We examine the beam dynamics and magnet design requirements to adapt this technology to the ALS lattice with its 1.9 GeV beam. The work will review the injection beam matching",
        "tracking simulations",
        "the electromagnetic design and tolerance analysis",
        "power supply design. The paper will also review the project plan for the integration of this technology into the ALS.",
        "* T. Atkinson et al.",
        "\"Development of a Non-Linear Kicker System to Facilitate a New Scheme for the BESSY-II Storage Ring\"",
        "Proc. of IPAC 2011"
      ],
      "institutions": [
        "Funding: This work was supported by Lawrence Berkeley National Laboratory under U.S. Department of Energy Contract No. DE-AC02-05CH11231."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/IPAC2015/talks/tupje084_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/IPAC2015/papers/tupje084.pdf",
      "poster_url": "https://proceedings.jacow.org/IPAC2015/posters/tupje084_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2015-TUPJE084",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 71,
  "scrape_time": "2025-10-10 20:26:05"
}