{
  "session_info": {
    "id": "WEPOR",
    "name": "WEPOR - Poster Session",
    "url": "https://proceedings.jacow.org/ipac2016/html/wepor.htm"
  },
  "papers": [
    {
      "paper_id": "WEPOR001",
      "title": "Beam Studies with a New Longitudinal Feedback System at the ANKA Storage Ring",
      "authors": [
        "E. Blomley",
        "A.-S. Müller",
        "M. Schedler",
        "KIT",
        "Karlsruhe",
        "Germany",
        "With the now fully commissioned longitudinal feedback system at the ANKA Storage Ring - in addition to the already operational transverse feedback system - the stability throughout the injection process was increased considerably. This opened up the possibility to investigate beam dynamics and limitations during injection more systematically. This paper presents the results of these studies",
        "an overview of the limiting parameters and discusses possible approaches to increase the efficiency of the injection."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor001_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor001.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor001_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR001",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR002",
      "title": "Orbit Stabilization for the HLS-II Storage Ring",
      "authors": [
        "W. Xu",
        "J.Y. Li",
        "K. Xuan",
        "H.Y. Zhang",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Hefei Light Source has successfully completed a major upgrade project",
        "which greatly improves the light source performance. As one of the most important criteria",
        "the stability of the beam orbit in the storage ring can greatly influence the overall performance of the light source. In this paper we present our efforts on stabilizing the beam orbit during the commissioning of the HLS-II storage ring. We optimized the performance of the power supplies of the ring corrector magnets. The target beam orbit is obtained by measuring the center of the quadrupole magnets using the beam-based alignment method. We also developed a multi-functional orbit feedback system to keep the beam moving on the golden orbit. With these measures",
        "the beam orbit gets more stable than ten percent of the beam size at the light source points."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor002_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor002.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor002_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR002",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR003",
      "title": "Voltage Control for the 4-Th Harmonic Cavity in Hls Storage Ring",
      "authors": [
        "K. Xuan",
        "C. Li",
        "J.Y. Li",
        "G. Liu",
        "W. Xu",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "In order to increase the beam lifetime",
        "a 4th harmonic RF cavity was installed in the HLS-II storage ring. The electrical fields in the principle cavity and high harmonic cavity stretch the beam in the longitudinal direction",
        "and increase the beam volume in phase space",
        "leading to a longer Touschek lifetime. Stable electrical voltage in the high harmonic cavity is essential for steady beam stretching and better beam lifetime. To get a stable high voltage in the high harmonic cavity",
        "we develop a method to maintain steady resonance condition in the cavity using a PID scheme. This paper presents the details of this method. The feedback result is also reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor003_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor003.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor003_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR003",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR004",
      "title": "Fast Orbit Feedback System at the Pls-Ii Storage Ring",
      "authors": [
        "S.-C. Kim",
        "W.S. Cho",
        "C. Kim",
        "J.M. Kim",
        "K.R. Kim",
        "E.H. Lee",
        "J. Lee",
        "J.W. Lee",
        "T.-Y. Lee",
        "C.D. Park",
        "G.S. Park",
        "S. Shin",
        "J.C. Yoon",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "The transverse position of the electron beam in the Pohang Light Source-II (PLS-II) is stabilized by the global orbit feedback system. Currently",
        "2 Hz slow orbit feedback (SOFB) system is operating",
        "and 1 kHz fast orbit feedback (FOFB) system is installed recently. This FOFB system is consists of 96 electron beam position monitors (BPMs)",
        "48 horizontal fast correctors",
        "48 vertical fast correctors and VME control system. We present the design and implementation of the FOFB system and its test result. Analysis through the simulation is presented and future improvement is discussed"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor004_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor004.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor004_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR004",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR005",
      "title": "Ground Motion Compensation using Feed-forward Control at ATF2",
      "authors": [
        "D.R. Bett",
        "C. Charrondière",
        "M. Pateckipresenter",
        "J. Pfingstner",
        "D. Schulte",
        "R. Tomás",
        "CERN",
        "Geneva",
        "Switzerland",
        "IN2P3-LAPP",
        "Annecy-le-Vieux",
        "France",
        "K. Kubo",
        "S. Kuroda",
        "T. Naito",
        "T. Okugi",
        "T. Tauchi",
        "N. Terunuma",
        "KEK",
        "Ibaraki",
        "Japan",
        "Ground motion compensation using feed-forward control is a novel technique being developed to combat beam imperfections resulting from the vibration-induced misalignment of beamline components. The method is being evaluated experimentally at the KEK Accelerator Test Facility 2 (ATF2). It has already been demonstrated that the beam position correlates with the readings from a set of seismometers located along the beamline. To compensate for this contribution to the beam jitter",
        "the fully operational system will use realtime measurement and processing in order to calculate and apply the feed-forward correction on a useful time scale. The progress towards a working system is presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor005_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor005.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor005_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR005",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR006",
      "title": "Demonstration of CLIC Level Phase Stability using a High Bandwidth, Low Latency Drive Beam Phase Feedforward System at the CLIC Test Facility CTF3",
      "authors": [
        "J. Roberts",
        "P. Burrows",
        "G.B. Christian",
        "C. Perry",
        "JAI",
        "Oxford",
        "United Kingdom",
        "A. Andersson",
        "R. Corsini",
        "P.K. Skowronskipresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "A. Ghigo",
        "F. Marcellini",
        "INFN/LNF",
        "Frascati (Roma)",
        "Italy",
        "The CLIC acceleration scheme",
        "in which the RF power used to accelerate the main high energy beam is extracted from a second high intensity but low energy beam",
        "places strict requirements on the phase stability of the power producing drive beam. To limit luminosity loss caused by energy jitter leading to emittance growth in the final focus to below 1%",
        "0.2 degrees of 12 GHz",
        "or 50 fs",
        "drive beam phase stability is needed. A low-latency phase feedforward correction with bandwidth above 17.5 MHz will be used to reduce the drive beam phase jitter to this level. The proposed scheme corrects the phase using fast electromagnetic kickers to vary the path length in a chicane prior to the drive beam power extraction. A prototype of this system has been installed at the CLIC test facility CTF3 to prove its feasibility. The latest results from the system are presented",
        "demonstrating phase stabilisation in agreement with simulations given the beam conditions and power of the kicker amplifiers. Necessary improvements in the phase monitor performance and optics corrections made to remove the phase-energy dependence via R56 in order to achieve this level of stability are also discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor006_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor006.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor006_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR006",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR007",
      "title": "Recent Improvements in Drive Beam Stability in CTF3",
      "authors": [
        "L. Malina",
        "R. Corsini",
        "D. Gamba",
        "T. Persson",
        "P.K. Skowronskipresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "The proposed Compact Linear Collider (CLIC) uses a high intensity",
        "low energy drive beam producing the RF power to accelerate the low intensity main beam with 100 MeV/m gradient. This scheme puts stringent requirements on drive beam stability in terms of phase",
        "energy and current. Finding and understanding the sources of jitter plays a key role in their mitigation. In this paper",
        "we report on the recent studies in the CLIC Test Facility (CTF3). New jitter and drift sources were identified and adequate beam-based feed-backs were implemented and commissioned. Finally",
        "we present the resulting improvement of drive beam stability."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor007_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor007.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor007_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR007",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR008",
      "title": "Development of a High Resolution Beam Position Monitor for NSRRC VUV/THz FEL",
      "authors": [
        "P.J. Kung",
        "K.C. Leou",
        "NTHU",
        "Hsinchu",
        "Taiwan",
        "W.K. Lau",
        "A.P. Lee",
        "NSRRC",
        "Hsinchu",
        "Taiwan",
        "Beam position monitors (BPM) have been widely used on linear colliders and free electron lasers for beam-based alignment and feedback systems. A laser driven photo-injector system has been constructed in NSRRC. This injector has the capability to deliver short relativistic electron beam at high peak current for novel light source R&D. A 2.4 GHz BPM that can be used for high precision beam position measurement has been designed. The BPM were modified to separate frequency between the horizontal and vertical dipole signals",
        "as well as a reduction of the monopole signal. The design has been simulated by CST. A prototype has been built for verification of theoretical predictions. Microwave bench measurement has been made to compare with the computer simulation results. The progress of our work will be presented in this paper."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor008_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor008.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor008_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR008",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR009",
      "title": "Intra-beam IP Feedback Studies for the 380 GeV CLIC Beam Delivery System",
      "authors": [
        "R.M. Bodenstein",
        "P. Burrows",
        "J. Snuverink",
        "JAI",
        "Oxford",
        "United Kingdom",
        "CERN",
        "Geneva",
        "Switzerland",
        "In its currently-envisaged initial stage",
        "the Compact Linear Collider (CLIC) will collide beams with a 380 GeV center of mass energy. To maintain the luminosity within a few percent of the design value",
        "beam stability at the interaction point (IP) must be controlled at the sub-nanometer level. To help achieve such control",
        "use of an intra-pulse IP feedback system is planned. With CLIC's very short bunch spacing of 0.5 ns",
        "and nominal pulse duration of 176 ns",
        "this feedback system presents a significant technical challenge. Furthermore",
        "as part of a study to optimize the design of the beam delivery system (BDS)",
        "several L* configurations have been studied. In this paper",
        "we will review the IP feedback simulations for the 380 GeV machine for two L* configurations",
        "and compare luminosity recovery performance with that of the original L* configuration in the 3 TeV machine."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor009_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor009.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor009_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR009",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR010",
      "title": "Recent Upgrades to the CERN SPS Wideband Intra-bunch Transverse Feedback Processor",
      "authors": [
        "J.E. Dusatko",
        "J.D. Fox",
        "C.H. Rivetta",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "CERN",
        "Geneva",
        "Switzerland",
        "Stanford University",
        "Stanford",
        "California",
        "USA",
        "In support of the CERN High Luminosity LHC (HL-LHC) upgrade program",
        "a research and development effort has been underway to understand and develop feedback control techniques for mitigating transverse intra-bunch instabilities in the SPS driven by electron cloud and TMCI effects. These effects could be a limiting factor to overall machine performance. A result of this effort has been the development of a very wide band transverse feedback demonstration system. This system has been used for the last several years in machine development studies where we have demonstrated single-bunch stability control of low order intra-bunch modes. In continuation of these efforts",
        "recent upgrades have been performed in all stages of the system",
        "including the feedback processor itself. This paper discusses the upgrades specific to it",
        "including the ability to process multiple proton bunches in the SPS; and also highlights future directions in the development effort."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor010_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor010.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor010_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR010",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR011",
      "title": "Lattice Matching with Elegant at ELSA",
      "authors": [
        "J.-P. Thiry",
        "W. Hillertpresenter",
        "ELSA",
        "Bonn",
        "Germany",
        "The electron stretcher ring ELSA provides a beam of polarized electrons of up to 3.2 GeV energy. To preserve the initial degree of polarization",
        "several depolarizing resonances have to be compensated during the fast energy ramp of 6 GeV/s. Beam depolarization",
        "caused by crossing these resonances is studied using comprehensive numerical calculations. These depend essentially on a precise model of the actual magnetic field distributions",
        "explicitly taking into account misalignments. Hence it is necessary to match the theoretical lattice to the actual accelerator. In a first step the alignment of all magnets has been examined and improved. This was done by using standard survey equipment and precise electronic spirit levels. In a second step the concept of response matrix fitting is used for further",
        "beam based",
        "lattice matching. Particle tracking and optics calculations are carried out using elegant",
        "a fully 6D accelerator toolbox. Lattice matching is done by repeatedly calling elegant and utilizing a modified Levenberg-Marquardt optimizer. In this contribution we will describe our lattice fitting implementation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor011_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor011.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor011_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR011",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR015",
      "title": "Introduction to WPS System Designed to Measure the Change of Location for PAL-XFEL Girder",
      "authors": [
        "H. J. Choi",
        "K.H. Gil",
        "H.-S. Kang",
        "H.-G. Lee",
        "S.B. Lee",
        "K.W. Seo",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "To maintain stable electron beam parameters (Energy 10GeV",
        "Charge 200pC",
        "Bunch Length 60fs",
        "Emittance X/Y 0.481um/0.256um)",
        "PAL-XFEL equipment should keep the alignment of accelerator (±100um) and undulator (±50um) constant. To ensure the precise measurement and alignment of PAL-XFEL",
        "GPS-based surface geodetic network and the installation of a tunnel measurement network inside buildings was prepared and the fiducialization of major equipment was completed. After PAL-XFEL equipment is aligned",
        "if the ground and buildings go through vertical changes during operation",
        "tilt and misalignment of equipments (correct magnet",
        "BPM",
        "accelerator) will cause errors in the electron beam trajectory",
        "which will lead to changes in the beam parameter. Hydrostatic Levelling System (HLS) was installed to measure vertical changes in buildings and the ground (sinking and uplifting) continuously and systematically",
        "and Wire Position System (WPS) installed to measure changes in Girder. This paper introduces the operation principle",
        "design concept",
        "installation status",
        "and operation status of WPS."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor015_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor015.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor015_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR015",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR016",
      "title": "Pre-alignment of Accelerating Structures for Compact Acceleration and High Gradient using In-situ Radiofrequency Methods",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor016_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor016.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor016_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR016",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR017",
      "title": "A Micrometric Positioning Sensor for Laser-Based Alignment",
      "authors": [
        "G. Stern",
        "H. Mainaud Durandpresenter",
        "D. Piedigrossi",
        "M. Sosin",
        "CERN",
        "Geneva",
        "Switzerland",
        "A. Geiger",
        "S. Guillaume",
        "ETH",
        "Zurich",
        "Switzerland",
        "The Compact Linear Collider requires 10 μm accuracy over 200m for the alignment of its components. Since current techniques based on stretched wire or water level are difficult to implement",
        "other options are under study. We propose a laser alignment system using positioning sensors made of camera/shutter assemblies. The goal is to implement such a positioning sensor. The corresponding studies comprise design and calibration as well as investigations of measurement accuracy and precision. On the one hand",
        "we describe mathematically the laser beam propagation",
        "its interaction with the shutter and image processing. On the other hand",
        "we present experiments done with the prototype of a positioning sensor. As a result",
        "we give practical suggestions to build the positioning sensors and we describe a calibration protocol to be applied to all sensors before measuring. In addition",
        "we deliver estimates for measurement accuracy and precision. Our work provides the first steps towards a full alignment system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor017_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor017.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor017_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR017",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR018",
      "title": "Position Monitoring System for HL-LHC Crab Cavities",
      "authors": [
        "M. Sosin",
        "T. Dijoud",
        "H. Mainaud Durandpresenter",
        "CERN",
        "Geneva",
        "Switzerland",
        "ESGT-CNAM",
        "Le Mans",
        "France",
        "The high luminosity upgrade for the LHC at CERN (HL-LHC project) will extend the discovery potential of the LHC by a factor 10. It relies on key innovative technologies like superconducting cavities for beam rotation",
        "named 'crab cavities'. Two crab cavities will be hosted in a superconducting cryostat working at a cold (<3 K). The position of each cavity will be monitored during the cool-down and the operation in order to comply with the tight alignment tolerances: the misalignment of a cavity axis w.r.t. the other will have to be lower than 0.5 mm and each cavity roll w.r.t. the cryostat axis will have to be lower than 1 mrad. Moreover",
        "the monitoring system will have to be radiation hard (up to 10 MGy) and maintenance free. We propose a solution based on the Frequency Scanning Interferometry to provide the position monitoring of the crab cavities. This paper describes the design and study of such a solution",
        "including the engineering approach",
        "the issues encountered and the lessons learnt."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor018_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor018.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor018_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR018",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR019",
      "title": "Development of CVD Diamond Detector for Beam Conditioning Monitor at the SuperKEKB Linac",
      "authors": [
        "S. Kazama",
        "T. Kamitani",
        "KEK",
        "Ibaraki",
        "Japan",
        "P. Bambadepresenter",
        "V. Kubytskyi",
        "LAL",
        "Orsay",
        "France",
        "Positron beams in SuperKEKB will be produced from electromagnetic showers originating from the interaction between primary electron beams and a tungsten target. Since the emittance of primary beams is very small",
        "the target is easy to be destroyed if focused beams are irradiated. In the SuperKEKB LINAC",
        "a plate called spoiler is placed in the upstream of the target to enlarge the beam spot size. If the beam control is in a correct way",
        "radioactive rays will be observed near both the spoiler and the target. However",
        "if the beam control is not successful and primary beams are irradiated directly on the target",
        "significant radiations are observed only near the target. If such a behavior is observed",
        "primary beams must be stopped to protect the target. Since the number of electrons in a bunch is quite large(~10nC)",
        "the radiation dose is expected to be very high. Therefore",
        "the radiation detector is required to have a high radiation-tolerance over a long period of time. Diamond has a high radiation tolerance due to its strong covalent bond",
        "and we are now developing radiation detectors using diamond crystals. In this talk",
        "current status including beam test measurements will be shown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor019_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor019.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor019_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR019",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR020",
      "title": "Beam Loss Estimation by Measurement of Secondarily Produced Photons under High Average-current Operations of Compact ERL in KEK",
      "authors": [
        "H. Matsumura",
        "K. Haga",
        "K. Hozumi",
        "T. Miura",
        "S. Nagaguro",
        "T. Obina",
        "T. Oyama",
        "S. Sakanaka",
        "A. Toyoda",
        "KEK",
        "Ibaraki",
        "Japan",
        "Tokyo Nuclear Service Co. Ltd.",
        "Ibaraki",
        "Japan",
        "To increase the beam current in the Compact Energy Recovery Linac (cERL) at the High Energy Accelerator Research Organization (KEK)",
        "the beam loss must be reduced to less than 0.01% during the transportation of 20 MeV electrons in order to suppress the radiation dose outside the accelerator room. Beam loss locations were successfully identified using the gold activation method",
        "and the beam loss rate was estimated by com-paring the measured dose rate with the simulated dose rate on the roof of the cERL room. Beam operation with beam current of 0.90 mA was achieved with a beam loss rate of less than 0.01%."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor020_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor020.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor020_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR020",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR021",
      "title": "Residual Radiation Monitoring by Beam Loss Monitors at the J-PARC Main Ring",
      "authors": [
        "T. Toyama",
        "K. Satou",
        "J-PARC",
        "KEK & JAEA",
        "Ibaraki-ken",
        "Japan",
        "H. Kuboki",
        "H. Nakamura",
        "B. Yee-Rendón",
        "KEK",
        "Tokai",
        "Ibaraki",
        "Japan",
        "JAEA/J-PARC",
        "Tokai-Mura",
        "Naka-Gun",
        "Ibaraki-Ken",
        "Japan",
        "At J-PARC (the Japan Proton Accelerator Research Complex)",
        "high intensity proton accelerator",
        "controlling and localizing beam losses and residual radiations are key issue",
        "because the residual radiation limits maintenance work in efficiency and working hours",
        "and then limits machine availability. We are accumulating continuous measurement data of residual radiation after beam stop using beam loss monitors in the Main Ring (MR). The wire cylinder gaseous radiation detectors are used in a proportional counting region. The heads are DC-connected and have a gain as large as 30000 with a bias of -2 kV. We switch the DAQ trigger from \"Beam Trigger\" to \"No Beam Trigger\"",
        "change the ADC sampling rate to 16 ms",
        "and raise the gain by changing the bias voltage from -1.6 kV to -2.0 kV with a few exceptions when the accelerator operation ends. The offsets are measured with zero bias voltage. Identification of radionuclides has been performed with time decay analysis",
        "with assistance of energy spectrum measurements with the Gamma Ray Spectrometer",
        "Kromek GR1-Spectro."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor021_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor021.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor021_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR021",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR022",
      "title": "Residual Radiation Measurements at J-PARC MR Using the ASTROCAM 7000HS Newly Developed Radioactive Substance Visualization Camera",
      "authors": [
        "N. Ikeda",
        "T. Sugano",
        "MHI-MS",
        "Kobe",
        "Japan",
        "K. Genba",
        "M. Komeda",
        "Y. Kuroda",
        "D.M. Matsuura",
        "MHI",
        "Komaki-si",
        "Japan",
        "A. Harayama",
        "T. Takahashi",
        "S. Watanabe",
        "ISAS/JAXA",
        "Kanazawa",
        "Japan",
        "H. Nakamura",
        "K. Niki",
        "C. Ohmori",
        "M.J. Shirakata",
        "KEK",
        "Ibaraki",
        "Japan",
        "OIST",
        "Onna-son",
        "Okinawa",
        "Japan",
        "Mitsubishi Heavy Industries",
        "Ltd. (MHI) released the ASTROCAM 7000HS",
        "a radioactive substance visualization camera. The ASTROCAM 7000HS incorporates the technologies for the gamma-ray detector used for the ASTRO-H satellite",
        "which MHI has been developing under entrustment from and together with scientists at the Institute of Space and Astronautical Science (ISAS) at the Japan Aerospace Exploration Agency (JAXA)",
        "and the design was modified for use on land to commercialize the product. MHI and Mitsubishi Heavy Industries Mechatronics Systems",
        "Ltd. (MHI-MS) performed on-site residual radiation measurements at the 50 GeV Main Ring (MR) of the Japan Proton Accelerator Research Complex (J-PARC) under collaboration with the High Energy Accelerator Research Organization (KEK) and the Japan Atomic Energy Agency (JAEA) and succeeded visualization of radiation hot spots of the accelerator components. The outline of the ASTROCAM 7000HS",
        "the measurement principle and the first measurement results at the J-PARC MR are described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor022_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor022.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor022_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR022",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR023",
      "title": "Radiation Shielding Considerations for CEPC-SPPC",
      "authors": [
        "Z.J. Ma",
        "Y.D. Ding",
        "N. Li",
        "Q.B. Wang",
        "M.Y. Yan",
        "Q.J. Zhang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "A planned project CEPC-SPPC is under-researched by IHEP",
        "CAS",
        "China. Due to its big circumference and high energy",
        "the radiation shielding issues should be treated more serious than ever whether for the machine itself or the worker and the public. In this paper",
        "we briefly introduce the configurations and parameters of the machine",
        "the tools and principle used in the radiation shielding design",
        "and discuss the preliminary result for the shielding of main tunnel and the synchrotron radia-tion. Some radiation protection issues are listed to be resolved next. All the aspects presented should be dis-cussed and verified",
        "any other unmentioned radiation protection problems will be excavated in the future."
      ],
      "institutions": [
        "CEPC: Circular Electron-Positron Collider  SPPC: Super Proton-Proton Collider   IHEP: Institute of High Energy Physics  CAS: Chinese Academy of Sciences"
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor023_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor023.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor023_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR023",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR024",
      "title": "HPGe Detector Application on Monitoring Environmental Samples around the Accelerator",
      "authors": [
        "Y.D. Ding",
        "Z.J. Ma",
        "Q.B. Wang",
        "M.Y. Yan",
        "Q.J. Zhang",
        "IHEP",
        "Bejing",
        "People's Republic of China",
        "Massive experimental works are aimed to clarify the structure of detector including CT with X ray machine",
        "determining the thickness of dead layer with collimating radioactive source and ect. Measuring structure and size of the detector by X-ray computed tomography",
        "measur-ing the dead layer thickness of detector's front surface and side surface though collimated point source method",
        "scanning the dead layer distribution of the entire detec-tor. A finite element analysis software name CST is used to simulate electric field distribution of the HPGe detec-tor. Calibrating the efficiency of HPGe detector by means of point source and soil standard matter",
        "A Monte Carlo software called MCNP is used to simulate detector effi-ciency preliminarily according to the structure parame-ters of the factory",
        "optimizing and verifying simulated results on the basis of measured results. At last",
        "the com-parison of the simulated and the experimental data showed very good agreement."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor024_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor024.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor024_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR024",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR029",
      "title": "Concept of a Fire and Gas Safety System for Accelerators",
      "authors": [
        "M. Dole",
        "S. Grau",
        "D. Raffourt",
        "CERN",
        "Geneva",
        "Switzerland"
      ],
      "institutions": [
        "Today CERN's facilities are equipped with automatic smoke and gas detection systems. Upon smoke or gas leak detection, local safety actions are automatically performed and alarms indicating the location and type of danger are transmitted to the CERN Fire Brigade. The firefighters then size their intervention based on the information received. The increasing complexity, size and quantity of CERN installations drives safety systems to evolve in the direction of simplicity. Intuitive interfaces are required to cope with high turnover of firefighters, and the inherent multinational environment. Global overview of alarms and safety actions statuses are needed by firefighters to decide on the best strategy for intervention. In some emergency situations, it might be necessary to manually trigger remote actions. CERN is studying a new concept, inspired by French standards, where the detection and protection layers are separated and act independently, but provide a common interface. This paper presents an application of this concept for the SPS* accelerator. Detection, fire-compartment and evacuation zones are presented, as well as the architecture of the detection and protection layers.",
        "*SPS: Super Proton Synchrotron"
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor029_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor029.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor029_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR029",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR030",
      "title": "Gas Filled RF Resonator Hadron Beam Monitor for Intense Neutrino Beam Experiments",
      "authors": [
        "K. Yonehara",
        "A.V. Tollestrup",
        "R.M. Zwaska",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "R.J. Abrams",
        "R.P. Johnsonpresenter",
        "G.M. Kazakevich",
        "Muons",
        "Inc",
        "Illinois",
        "USA",
        "University of Missouri",
        "Columbia",
        "Columbia",
        "Missouri",
        "USA",
        "IIT",
        "Chicago",
        "Illinois",
        "USA"
      ],
      "institutions": [],
      "abstract": "MW-class beam facilities are being considered all over the world to produce an intense neutrino beam for fundamental particle physics experiments. A radiation-robust beam monitor system is required to diagnose the primary and secondary beam qualities in high-radiation environments. We have proposed a novel gas-filled RF-resonator hadron beam monitor in which charged particles passing through the resonator produce ionized plasma that changes the permittivity of the gas. The sensitivity of the monitor has been evaluated in numerical simulation. A signal manipulation algorithm has been designed. A prototype system will be constructed and tested by using a proton beam at the MuCool Test Area at Fermilab. reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor030_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor030.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor030_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR030",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR031",
      "title": "Field Emission Radiation Characterization of LCLS-II Cavities",
      "authors": [
        "M. Santana-Leitner",
        "C. Adolphsen",
        "L. Ge",
        "Z. Li",
        "T.O. Raubenheimer",
        "M.C. Ross",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "S. Aderhold",
        "A. Grassellino",
        "O.S. Melnychuk",
        "R.V. Pilipenko",
        "D.A. Sergatskov",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "LCLS-II XFEL facility at the SLAC National Accelerator Laboratory will accelerate CW beams of up to 300 uA to 4 GeV using superconducting radio frequency cavities. Before installation",
        "fully assembled cryomodules will be tested at Fermilab and Jefferson Lab. Besides the basic measurements of cavity gradients and cryogenic heat loads",
        "radiation and dark current levels will be recorded. The latter parameters need to be limited to ensure the safety of the machine and the lifetime of radio-sensitive components installed near the cavities. In this paper we describe the simulation studies being done in preparation of tests",
        "where expected radiation measurements in the different detectors are correlated with field emission and with dark currents in Faraday cups at each end of the cryomodule. This work includes simulations using a detailed model of the cryomodules and detectors",
        "where field emission data generated with Track3P is parsed to the FLUKA radiation transport code."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor031_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor031.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor031_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR031",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR032",
      "title": "Power Recycling of Burst-mode Laser Pulses for Laser Particle Interactions",
      "authors": [
        "Y. Liu",
        "A. Rakhman",
        "ORNL",
        "Oak Ridge",
        "Tennessee",
        "USA",
        "UTK",
        "Knoxville",
        "Tennessee",
        "USA",
        "A number of laser-particle interaction experiments such as the laser assisted hydrogen ion beam stripping or X-/γ-ray generations via inverse-Compton scattering involve light sources operating in a burst mode to match the temporal structure of the particle beam. As the small cross-section in the laser-particle interaction process results in negligible laser power loss",
        "it is desirable to make the interaction inside an optical cavity to recycle the laser power. In many cases",
        "conventional cavity locking techniques will not work since the burst normally has very small duty factor and low repetition rate and it is impossible to generate an effective control signal. In this talk",
        "we report on the development of a doubly-resonant optical cavity scheme and its locking technique that enables a simultaneous resonance of two laser beams with different spectra and/or temporal structures. We demonstrate that such a cavity can be used to recycle burst-mode ultra-violet laser pulses with arbitrary burst lengths and repetition rates. System implementation",
        "technical challenges",
        "experimental results and applications will be described.",
        "* V. Danilov et al.",
        "Phys. Rev. ST Accel. Beams 10",
        "053501 (2007).  ** K. Sakaue et al.",
        "Rev. Sci. Instrum. 80",
        "123304 (2009).  *** A. Rakhman",
        "M. Notcutt",
        "and Y. Liu",
        "Opt. Lett. 40",
        "5562 (2015)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor032_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor032.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor032_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR032",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR033",
      "title": "Progress in the Work on the Tuner Control System of the cERL at KEK",
      "authors": [
        "F. Qiu",
        "T. Matsumoto",
        "S. Michizono",
        "T. Miura",
        "KEK",
        "Ibaraki",
        "Japan",
        "Sokendai",
        "Ibaraki",
        "Japan",
        "A compact energy recovery linac (cERL)",
        "which is a test machine for future 3 GeV ERL project",
        "was constructed at KEK. Five superconducting (SC) cavities were installed in the injector and main linac of the cERL. The SC cavities in cERL are prone to detuning by disturbances such as microphonics. Therefore",
        "a piezo-based tuner system was used to compensate for the detuning of the SC cavity in the cERL. We have proposed advanced control methods that aim at improving the performance of the cERL tuner systems. In this paper",
        "we present the progress in our work on the cERL tuner systems. The preliminary results of the beam-commissioning are also presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor033_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor033.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor033_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR033",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR034",
      "title": "Design and Evaluation of a Broad Band microTCA.4 Based Downconverter",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor034_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor034.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor034_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR034",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR035",
      "title": "MicroTCA.4-Based LLRF System for Spoke Cavities of C-ADS Injector I",
      "authors": [
        "X. Ma",
        "N. Ganpresenter",
        "X. Huang",
        "N. Liu",
        "R.L. Liu",
        "G.W. Wang",
        "Q.Y. Wang",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Institute of High Energy Physics (IHEP)",
        "Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "The C-ADS Injector I is being built in IHEP",
        "which includes 14 β=0.12 superconducting single spoke cavities enclosed with two cryomodules under 2 K. The MicroTCA.4-based Low Level RF (LLRF) system provides GDR mode for the operation of the cavities. The LLRF system supports both CW and duty-adjustable pulsed operation modes for the high power source and the cavities. The firmware of the FPGA controller and the EPICS IOC software has been upgraded during the last half year adding feedforward and abnormal detection. The operator interface (OPI) software and automatic operation script are also described. The MicroTCA.4 platform runs well for the beam commissioning of the Injector I. Some gained experiences with stable beam operation are also shown."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor035_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor035.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor035_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR035",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR036",
      "title": "Design and Commissioning of LLRF System for ADS Project in China",
      "authors": [
        "R.L. Liu",
        "Y.L. Chi",
        "N. Ganpresenter",
        "X. Huang",
        "N. Liu",
        "X. Ma",
        "Z.H. Mi",
        "G.W. Wang",
        "Q.Y. Wang",
        "S.Z. Wang",
        "Z.S. Zhou",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Institute of High Energy Physics (IHEP)",
        "Chinese Academy of Sciences",
        "Beijing",
        "People's Republic of China",
        "This article describes a low-level RF control system for the ADS project at IHEP",
        "which includes control units for an RFQ",
        "2 Bunchers and 14 spoke superconducting cavities with the reference line distribution. The paper covers system design consideration and implementation for those units. we will also presented some experience and results for the last one year operation of these LLRF systems."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor036_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor036.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor036_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR036",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR037",
      "title": "Beam Loading Effects in SSRF Storage Ring",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor037_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor037.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor037_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR037",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR039",
      "title": "Development of 200 MHz Digital LLRF System for the 1 MeV/n RFQ at KOMAC",
      "authors": [
        "H.S. Jeong",
        "T.S. Ahn",
        "Y.-S. Cho",
        "H.S. Kim",
        "S.G. Kim",
        "H.-J. Kwon",
        "Korea Atomic Energy Research Institute (KAERI)",
        "Gyeongbuk",
        "Republic of Korea",
        "KAERI",
        "Daejon",
        "Republic of Korea",
        "KOMAC (Korea Multi-purpose Accelerator Complex) has a plan to develop the multipurpose ion irradiation system. This system includes the ion source",
        "LEBT",
        "RFQ and MEBT systems to transport ion particles to the target. In particular",
        "the RFQ (Radio Frequency Quadrupole) system should receive 200 MHz RF within 1% amplitude error stability. To supply stable 200 MHz RF signal to the RFQ cavity",
        "the LLRF (Low-Level Radio Frequency) system should be controlled through a control system which implemented using commercial digital board. This 1 MeV/n RFQ LLRF system has a concept to minimize the number of the analog components for minimizing the control error. For this",
        "the FPGA (Field Programmable Gate Array) in the digital board will control the frequency of the output sinusoidal signal. In addition",
        "this LLRF system applied the direct sampling",
        "Non-IQ sampling",
        "direct RF generation and fast IQ set update rate algorithm. In this presentation",
        "the FPGA control logics of the LLRF digital board will be introduced. Also",
        "the LLRF PI control logic test using 200 MHz dummy cavity will be described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor039_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor039.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor039_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR039",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR040",
      "title": "LLRF Development for PAL-XFEL",
      "authors": [
        "J. Hu",
        "W.H. Hwang",
        "H.-S. Kang",
        "H.-S. Lee",
        "C.-K. Min",
        "G. Mun",
        "PAL",
        "Pohang",
        "Kyungbuk",
        "Republic of Korea",
        "J.H. Chang",
        "J.S. Han",
        "Y.S. Kim",
        "RFPT",
        "Gyeonggi-do",
        "Republic of Korea",
        "O.J. Kim",
        "H.S. Lee",
        "Mobiis Co.",
        "Ltd.",
        "Seoul",
        "Republic of Korea",
        "PAL-XFEL construction is completed. Now",
        "beam commissioning is ongoing after RF conditioning. The LLRF and SSA systems installed and in normal operation are presented. Those structures",
        "features",
        "characteristics",
        "and performances are described."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor040_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor040.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor040_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR040",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR042",
      "title": "LLRF Control of High Loaded-Q Cavities for the LCLS-II",
      "authors": [
        "C. Serrano",
        "L.R. Doolittle",
        "G. Huang",
        "A. Ratti",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "S. Babel",
        "M. Boyes",
        "B. Hong",
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "R. Bachimanchi",
        "C. Hovater",
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "B.E. Chase",
        "E. Cullerton",
        "J. Einstein",
        "Fermilab",
        "Batavia",
        "Illinois",
        "USA",
        "The SLAC National Accelerator Laboratory is planning an upgrade (LCLS-II) to the Linear Coherent Light Source with a 4 GeV CW Superconducting Radio Frequency (SCRF) linac. The nature of the machine places stringent requirements in the Low-Level RF (LLRF) system",
        "expected to control the cavity fields within 0.01 degrees in phase and 0.01% in amplitude",
        "which is equivalent to a longitudinal motion of the cavity structure in the nanometer range. This stability has been achieved in the past but never for hundreds of superconducting cavities in Continuous-Wave (CW) operation. The difficulty resides in providing the ability to reject disturbances from the cryomodule",
        "which is incompletely known as it depends on the cryomodule structure itself (currently under development at JLab and Fermilab) and the harsh accelerator environment. Previous experience in the field and an extrapolation to the cavity design parameters (relatively high QLc≈ 4×107",
        "implying a half-bandwidth of around 16 Hz) suggest the use of strong RF feedback to reject the projected noise disturbances",
        "which in turn demands careful engineering of the entire system."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor042_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor042.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor042_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR042",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR043",
      "title": "End-to-end FEL Beam Stability Simulation Engine",
      "authors": [
        "C. Serrano",
        "L.R. Doolittle",
        "LBNL",
        "Berkeley",
        "California",
        "USA",
        "D.S. Driver",
        "B. Patel",
        "A.F. Queiruga",
        "Z. Zaky",
        "UCB",
        "Berkeley",
        "USA",
        "UPF",
        "Barcelona",
        "Spain",
        "During the design",
        "commissioning and operation of a linac-driven Free Electron Laser (FEL) it is important to have a good understanding of the implications of accelerator design choices on beam figures of merit. This simulation engine combines a full state-space model of the RF system (High-Power Amplifier",
        "RF cavities",
        "LLRF controllers",
        "etc.)",
        "a characterization of beam properties such as energy",
        "bunch length and arrival time as electrons propagate through the Linac and beam-based feedback. The combination of these models with the ability to introduce both correlated and uncorrelated noise sources at any point of the machine",
        "allows for a complete transposition of noise sources to beam performance parameters",
        "including frequency dependence",
        "in order to analyze implications of accelerator design choices in a simulation environment."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor043_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor043.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor043_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR043",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR044",
      "title": "Fpga Implementation of a Control System for the LANSCE Accelerator",
      "authors": [
        "S. Kwon",
        "L.J. Castellano",
        "D.J. Knapp",
        "J.T.M. Lyles",
        "M.S. Prokop",
        "D. Rees",
        "A. Scheinker",
        "P.A. Torrez",
        "LANL",
        "Los Alamos",
        "New Mexico",
        "USA",
        "As part of the modernization of the Los Alamos Neutron Science Center (LANSCE)",
        "a digital low level RF (LLRF) system was designed. The LLRF control system was implemented in a Field Programmable Gate Array (FPGA) using embedded Experimental Physics and Industrial Control System (EPICS) Input Output Controller (IOC) under the Real-Time Executive for Multiprocessor Systems (RTEMS). Proportional-Integral (PI) feedback controller",
        "static beam feedforward controller",
        "and iterative learning controller are implemented on the FPGA. The closed loop system performance was tested with a 10mA peak current proton beam."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor044_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor044.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor044_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR044",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR045",
      "title": "PACMAN - the MedAustron Measurement Data Analysis Framework",
      "authors": [
        "A. Wastl",
        "A. Garonnapresenter",
        "T.K.D. Kulenkampff",
        "S. Nowak",
        "EBG MedAustron",
        "Wr. Neustadt",
        "Austria",
        "During the commissioning of the synchrotron-based MedAustron accelerator facility",
        "the analysis and interpretation of data of various sources was required. A dedicated framework was developed to analyze the raw data provided by the accelerator control system (ACS). A tested and documented software core with a simple and standardized interface allows also non-programming professionals to easily base their applications on this framework which is essential to efficiently make progress in the dynamic environment of commissioning. This document presents the structure of the framework",
        "the interface between the software core and higher level applications and gives an example using all framework levels."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor045_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor045.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor045_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR045",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR049",
      "title": "Jupyterhub at the ESS. An Interactive Python Computing Environment for Scientists and Engineers",
      "authors": [
        "L. Fernández",
        "R. Anderssonpresenter",
        "H. Hagenrud",
        "T. Korhonen",
        "E. Laface",
        "ESS",
        "Lund",
        "Sweden",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "The European Spallation Source will be the world's most powerful neutron source",
        "once its construction is finished. In order to design",
        "build and operate this complex machine many different software components and frameworks will be needed. One of those is Jupyterhub",
        "a scripting environment for data analysis",
        "scientific computing and physics simulations. Jupyterhub is a multiuser version of the IPython notebook (Jupyter) that can be deployed in a centralized server; It provides centralized authentication",
        "centralized deployment",
        "promotes collaboration and provides access to the most advanced libraries for data cleaning and transformation",
        "simulation and statistics. At the Integrated Controls System Division a customized version of Jupyterhub was deployed",
        "providing sandboxed environments to users using Docker containers. Among other characteristics of this installation we can find: clustering",
        "load balancing",
        "A/B testing",
        "Amazon Web Services integration",
        "nbviewer and OpenXAL integration."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor049_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor049.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor049_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR049",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR050",
      "title": "How to Build and Maintain a Development Environment for the Development of Controls Software Applications: An Example of \"Infrastructure as Code\" within the Physics Accelerator Community.",
      "authors": [
        "L. Fernández",
        "R. Anderssonpresenter",
        "H. Hagenrud",
        "T. Korhonen",
        "R. Mudingay",
        "ESS",
        "Lund",
        "Sweden",
        "Cosylab",
        "Ljubljana",
        "Slovenia",
        "The Integrated Control System Division (ICS) at the European Spallation Source (ESS) has the mandate to provide all the needed tools to ESS staff",
        "in-kind contributors and consultants spread all over Europe",
        "in order for them to build software for the commissioning and operation of the ESS. This includes EPICS applications",
        "scripting environments",
        "physics simulators and commissioning tools among others. ICS needs to provide support for new releases of the different software components",
        "guaranteeing that the development environment of all the users can be properly updated. ICS needs to guarantee as well that environments can be reproducible and at the same time give the flexibility to users to own and customize their environments. ICS used a new virtualization technology (Vagrant) and a new configuration management system (Ansible) to provide a cutting edge development environment where all the software infrastructure can be described as code and properly stored in a version control system",
        "tagged",
        "tested",
        "versioned and rollbacked if needed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor050_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor050.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor050_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR050",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR051",
      "title": "Second Generation LHC Analysis Framework: Workload-based and User-oriented Solution",
      "authors": [
        "S. Boychenko",
        "C. Aguilera-Padilla",
        "M.A. Galilée",
        "J.C. Garnier",
        "A.A. Gorzawskipresenter",
        "K.H. Krol",
        "J. Makai",
        "M. Osinski",
        "M.C. Poeschl",
        "T.M. Ribeiro",
        "A. Stanisz",
        "M. Zerlauth",
        "CERN",
        "Geneva",
        "Switzerland",
        "University of Coimbra",
        "Coimbra",
        "Portugal",
        "Consolidation and upgrades of accelerator equipment during the first long LHC shutdown period enabled particle collisions at energy levels almost twice higher compared to the first operational phase. Consequently",
        "the software infrastructure providing vital information for machine operation and its optimisation needs to be updated to keep up with the challenges imposed by the increasing amount of collected data and the complexity of analysis. Current tools",
        "designed more than a decade ago",
        "have proven their reliability by significantly outperforming initially provisioned workloads",
        "but are unable to scale efficiently to satisfy the growing needs of operators and hardware experts. In this paper we present our progress towards the development of a new workload-driven solution for LHC transient data analysis",
        "based on identified user requirements. An initial setup and study of modern data storage and processing engines appropriate for the accelerator data analysis was conducted. First simulations of the proposed novel partitioning and replication approach",
        "targeting a highly efficient service for heterogeneous analysis requests",
        "were designed and performed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor051_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor051.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor051_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR051",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR052",
      "title": "Emittance Measurements in Low Energy Storage Rings",
      "authors": [
        "C.P. Welsch",
        "J.R. Hunt",
        "J. Resta-López",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "J.R. Hunt",
        "J. Resta-López",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "The development of the next generation of ultra-low energy antiproton and ion facilities requires precise information about the beam emittance to guarantee optimum performance. In the Extra-Low ENergy Antiproton storage ring (ELENA) the transverse emittances will be measured by scraping. However",
        "this diagnostic measurements faces several challenges: non-zero dispersion and systematic errors due to diffusion processes",
        "such as intra-beam scattering",
        "and the speed of the scraper with respect to the beam revolution frequency. In addition",
        "the beam distribution will likely be non-Gaussian. Here",
        "we present algorithms to efficiently address the emittance reconstruction in presence of the above effects",
        "and present simulation results for the case of ELENA. We also discuss the feasibility of using alternative non-invasive techniques for profile and emittance measurements."
      ],
      "institutions": [
        "Funding: Work supported by the EU under grant agreement 624854 and the STFC Cockcroft Institute Core Grant No. ST/G008248/1."
      ],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor052_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor052.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor052_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR052",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR053",
      "title": "Software Tools for Emittance Measurement and Matching for 12 GeV CEBAF",
      "authors": [
        "JLab",
        "Newport News",
        "Virginia",
        "USA",
        "This poster discusses model-driven setup of the Continuous Electron Beam Accelerator Facility (CEBAF) for the 12 GeV era",
        "focusing on qsUtility. qsUtility is a set of software tools created to perform emittance measurements",
        "analyze those measurements",
        "and compute optics corrections based upon the measurements. qsUtility was developed as a toolset to facilitate reducing machine configuration time and reproducibility by way of an accurate accelerator model",
        "and to provide Operations staff with tools to measure and correct machine optics with little or no assistance from optics experts."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor053_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor053.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor053_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR053",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR056",
      "title": "Development of a Cw Solid State Amplifier for the Longitudinal Feedback System of Bepcii",
      "authors": [
        "S. An",
        "Z. Bowen",
        "PLAI",
        "Nanjing",
        "People's Republic of China",
        "ADS",
        "Jiangsu Province",
        "People's Republic of China",
        "IHEP",
        "Beijing",
        "People's Republic of China",
        "Chang'an University",
        "Chang'an",
        "People's Republic of China",
        "A Solid State Amplifier (SSA) has been developed for testing beam feedback system of the BEPCII of the Institute of High Energy Physics (IHEP)",
        "CAS. The output power of the SSA is 100 W with a CW frequency range from 1000 MHz to 1250 MHz. After three generations development",
        "the SSA has become a professional power source. The paper has introduced the development of the SSA and the skills used in the SSA."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor056_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor056.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor056_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR056",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR057",
      "title": "A Mass Spectrometer for Measuring a High Current Ion Beam With a Big Range of the Charge-to-Mass Ratio",
      "authors": [
        "Z. Bowen",
        "S. Anpresenter",
        "PLAI",
        "Nanjing",
        "People's Republic of China",
        "Chang'an University",
        "Chang'an",
        "People's Republic of China",
        "In order to analyze a high-current mixed-ion beam's physical properties with a current of 100 mA and a charge-to-mass ratio range from 1:1 to 1:48",
        "a mass spectrometer has been developed to measure the beam's current",
        "profile and ratio of the different ions by Nanjing University and Andesun Technology Inc. The main part of the mass spectrometer is a mass analyzer",
        "which is used to measure the different ion's beam current at the same time. This paper introduces the design of the mass analyzer."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor057_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor057.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor057_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR057",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR058",
      "title": "Preliminary Study for the HLS Variable Pulse Length Storage Ring by Two Harmonic Cavities",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor058_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor058.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor058_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR058",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR059",
      "title": "Calculation for the Radiation Dose in Storage Ring Hall based on Monte Carlo Method",
      "authors": [
        "S. Huang",
        "T.L. He",
        "S.C. Zhang",
        "T. Zhangpresenter",
        "USTC/NSRL",
        "Hefei",
        "Anhui",
        "People's Republic of China",
        "Radiation dose assessment in synchrotron radiation facility is challenging due to the complexity and uncertainties of radiation source terms induced by high energy particle accelerator. Hefei light source (HLS) is the first dedicated synchrotron radiation light source in China. Radiation dose assessment for users at HLS Beam lines is highly concerned. This study presents the method calculating the radiation dose in storage ring hall under normal operation state",
        "the simplified Monte Carlo calculation model was introduced in detail. We obtained the results of radiation dose distribution in HLS storage ring hall with using MCNP",
        "which are in the same order of magnitude with the experimental results. It indicates that the method can be used to calculate the radiation dose level in storage ring hall",
        "and it has certain guiding significance for the radiation protection."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor059_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor059.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor059_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR059",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEPOR060",
      "title": "MTCA.4-based Beam Line Stabilization Application",
      "authors": [
        "TUL-DMCS",
        "Łódź",
        "Poland",
        "C. Gerth",
        "H. Schlarb",
        "B. Steffen",
        "DESY",
        "Hamburg",
        "Germany",
        "We want to summarize the beam line stabilization application with MTCA.4 electronics. Presented solution is based on the compact 2U MTCA.4 crate integrating sensor and actuator cards. The optical beam position sensor is based on quadrupole SI PIN photodiode connected to low cost AMC based FMC carrier equipped with ADC card. The optical beam position correction is done using picomotorized stages equipped with active piezo elements and high voltage RTM piezo driver. The data processing and digital feedback units are implemented using Spartan 6 FPGA. The control algorithm has been optimized for low latency and high precision computations. The control electronics performance has been tested using single beam line test stand consisted of commercial laser diode drivers",
        "supported optics and motorized stages. The first results are demonstrated and future possible applications are briefly discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ DOI:10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2016/talks/wepor060_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2016/papers/wepor060.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2016/posters/wepor060_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2016-WEPOR060",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 46,
  "scrape_time": "2025-10-10 20:13:00"
}