{
  "session_info": {
    "id": "TUXBA",
    "name": "TUXBA - Tuesday Parallel Session 1",
    "url": "https://proceedings.jacow.org/napac2019/html/tuxba.htm"
  },
  "papers": [
    {
      "paper_id": "TUXBA1",
      "title": "Department of Energy Isotope Program Accelerator Production of Isotopes",
      "authors": [
        "DOE/NP",
        "Germantown",
        "USA",
        "The United States Department of Energy’s Isotope Program (DOE IP) produces radioactive and enriched stable isotopes that are in short supply to meet the nation’s needs for research and for commercial and national security applications. DOE has more than twenty-one laboratories",
        "many with nuclear reactors",
        "particle accelerators",
        "and processing facilities useful for the production of isotopes. This talk will focus on the DOE IP’s accelerator production facilities",
        "presenting descriptions of the facilities",
        "the isotopes they produce and their applications. An overview of the science of accelerator production methods will be also be provided. Isotope production is accomplished using proton accelerators at the Brookhaven and Los Alamos National Laboratories",
        "electron accelerators at the Argonne National Laboratory and Thomas Jefferson National Accelerator Facility",
        "and a multi-particle cyclotron at the University of Washington. The Facility for Rare Isotope Beams",
        "under construction at Michigan State University",
        "will harvest large quantities of many rare isotopes to support scientific research and applications."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuxba1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuxba1.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuxba1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUXBA1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXBA2",
      "title": "Novel Medical Linacs for Challenging Environments",
      "authors": [
        "ICEC",
        "Washington",
        "DC",
        "USA",
        "CERN",
        "Meyrin",
        "Switzerland",
        "25 millions cancer cases are predicted in 2035",
        "65-70% will occur in low and middle income countries (LMICs). The current generation of linear accelerators in use in upper-income countries often do not function well in the adverse conditions in LMICs as regular interruptions to energy supply",
        "lack of air temperature control in buildings and weak health systems between others. A new generation of environmental friendly radiotherapy accelerator that consumes little power on standby and has reduction heat production",
        "low instantaneous power demand and local power storage would reduce reliance on the electricity grid and is in development. The talk will describe the effort made in this sense."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuxba2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuxba2.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuxba2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUXBA2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUXBA3",
      "title": "Robust Thermoacoustic Range Verification for Pulsed Ion Beam Therapy",
      "authors": [
        "UWM",
        "Milwaukee",
        "Wisconsin",
        "USA",
        "B.M. Brahim",
        "D. Santiago-Gonzalez",
        "ANL",
        "Lemont",
        "Illinois",
        "USA",
        "Lack of online range verification generally limits application of proton therapy to cancers in the brain",
        "spine",
        "and to pediatric patients. Previously",
        "thermoacoustic range verification (TARV) has been demonstrated in weakly scattering media with known sound speed [1]. At ATLAS",
        "we demonstrated the accuracy and robustness of TARV relative to ultrasound (US) images despite acoustic heterogeneity and sound speed errors representing in vivo conditions [2]. 250 ns pulses deposited 0.26 Gy of 16 MeV protons and 2.3 Gy of 60 MeV helium ions into liquid targets. TA signals were detected by an US array that also generated US images. An air gap phantom displaced the Bragg peak by 6.5 mm and the scanner’s propagation speed setting was altered by ±5%. Weak and strong scatterers were placed between the Bragg peak and US array. Estimated Bragg peak locations were translated 6.5 mm by the air gap phantom and agreed with TRIM simulations to within 0.3 mm",
        "even when TA emissions traveled through a strong acoustic scatterer. Soundspeed errors dilated",
        "and acoustic heterogeneities deformed both US images and TA range estimates",
        "confirming that TARV is accurate relative to US images.",
        "[1] Hickling",
        "et al",
        "Med Phys",
        "45(7)",
        "2018. (review article)  [2] S. Patch",
        "D. Santiago",
        "& B. Mustapha",
        "Med Phys",
        "46(1)",
        "2019."
      ],
      "institutions": [
        "Funding: * Supported by the U.S D.O.E., Office of Nuclear Physics, under Contract No. DE-AC02-06CH11357. Measurements were performed at ANL’s ATLAS facility, which is a DOE Office of Science User Facility."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuxba3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuxba3.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuxba3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUXBA3",
      "page_number": "294",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUXBA4",
      "title": "Rapid Radio-Frequency Beam Energy Modulator for Proton Therapy",
      "authors": [],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/napac2019/talks/tuxba4_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/napac2019/papers/tuxba4.pdf",
      "poster_url": "https://proceedings.jacow.org/napac2019/posters/tuxba4_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-NAPAC2019-TUXBA4",
      "page_number": "298",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 4,
  "scrape_time": "2025-10-11 00:42:43"
}