{
  "session_info": {
    "id": "WEZPLS",
    "name": "WEZPLS - Invited Orals: Novel Particle Sources and Acceleration Techniques",
    "url": "https://proceedings.jacow.org/ipac2019/html/wezpls.htm"
  },
  "papers": [
    {
      "paper_id": "WEZPLS1",
      "title": "Control of Laser Plasma Accelerated Electrons: A Route for Compact Free Electron Lasers",
      "authors": [
        "M.-E. Couprie",
        "T. André",
        "F. Blache",
        "F. Bouvet",
        "F. Briquez",
        "Y. Dietrich",
        "J.P. Duval",
        "M. El Ajjouri",
        "A. Ghaith",
        "C. Herbeaux",
        "N. Hubert",
        "C.A. Kitegi",
        "M. Labat",
        "N. Leclercq",
        "A. Lestrade",
        "A. Loulergue",
        "O. Marcouillé",
        "F. Marteau",
        "D. Oumbarek Espinos",
        "P. Rommeluère",
        "M. Sebdaoui",
        "K.T. Tavakoli",
        "M. Valléau",
        "SOLEIL",
        "Gif-sur-Yvette",
        "France",
        "I.A. Andriyash",
        "S. Corde",
        "J. Gautier",
        "J.-P. Goddet",
        "O.S. Kononenko",
        "G. Lambert",
        "K. Ta Phuoc",
        "A. Tafzi",
        "C. Thaury",
        "LOA",
        "Palaiseau",
        "France",
        "S. Bielawski",
        "C. Evain",
        "E. Roussel",
        "C. Szwaj",
        "PhLAM/CERLA",
        "Villeneuve d’Ascq",
        "France",
        "Weizmann Institute of Science",
        "Physics",
        "Rehovot",
        "Israel",
        "The recent spectacular development of laser plasma ac- celerators that now can deliver GeV electron beams in an extremelyshortdistancemakesthemverypromising. Ap- plications for light sources based on undulator radiation and free electron laser appear as an intermediate step to move from an acceleration concept to an accelerator qual- ification. However",
        "the presently achieved divergence and energy spread require some electron beam manipulations. The COXINEL test line was designed for enabling Free Elec- tron Laser operation with baseline reference parameters. It comprises variable permanent magnet quadrupoles for di- vergence handling",
        "a magnetic chicane for electron energy sorting",
        "a second set of quadrupole for chromatic focusing and an undulator for synchrotron radiation emission and/or free electron laser gain medium. The transport along the line is controlled [1]. The synchrotron radiation emitted by the undulator radiation is studied under different conditions of detection (CCD camera",
        "spectrometer)",
        "electron beam manipulation and undulator parameters. These observations pave the way towards Laser Plasma Acceleration based Free Electron Laser."
      ],
      "institutions": [],
      "abstract": "[1] T. André et al., Control of laser plasma accelerated electrons for light sources, accepted in Nature Comm. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/wezpls1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/wezpls1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/wezpls1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-WEZPLS1",
      "page_number": "",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEZPLS2",
      "title": "High Transformer Ratio Plasma Wakefield Acceleration Driven by Photocathode Laser Shaped Electron Bunches",
      "authors": [
        "DESY Zeuthen",
        "Zeuthen",
        "Germany",
        "Beam driven wakefield acceleration (PWFA) schemes in plasmas are among the most promising candidates for novel",
        "compact accelerators. Several aspects of PWFA are under investigation at the Photoinjector Test facility at DESY in Zeuthen (PITZ). One of the main characteristics of these accelerators is the ratio between field strength usable for acceleration and decelerating field strength in the driver bunch",
        "the so called transformer ratio. To reach high transformer ratios usually shaped bunches",
        "e.g. with ramped current profiles are employed as drivers. The so-called self-modulation instability",
        "which causes transverse modulation of a bunch longer than the plasma wavelength",
        "is proposed as a means of supplying short driver bunches for proton-driven PWFA. This talk will give an overview on experimental results in these two aspects of PWFA at PITZ with a focus on the production of electron bunches enabling high transformer ratio acceleration by shaping the photocathode laser pulses of a photoinjector and the demonstration of high transformer ratio PWFA. Simulations and further developments on the shaping techniques",
        "allowing highly flexible electron bunches for future plasma wakefield accelerators are also presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2019/talks/wezpls2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2019/papers/wezpls2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2019/posters/wezpls2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2019-WEZPLS2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 2,
  "scrape_time": "2025-10-10 19:12:35"
}