{
  "session_info": {
    "id": "TUPSA",
    "name": "TUPSA - Poster session A",
    "url": "https://proceedings.jacow.org/rupac2018/html/tupsa.htm"
  },
  "papers": [
    {
      "paper_id": "TUPSA01",
      "title": "Design of Beam Optics for Electron Positron Collider Super Charm Tau Factory",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The Super Charm Tau Factory is a double ring electron positron collider with beam energy from 1 to 2.5 GeV and luminosity of 1035 cm-2·s−1. The beam optics includes the Crab Waist interaction region within two local chromaticity correction cells",
        "low emittance arcs and special dispersion free sections. Five Siberian snake allows creating the longitudinal polarization of electron beam at the interaction point in while energy range. Four superconducting wigglers inserted in special sections control the beam parameters. The long straight section consists the RF system and the injection cell. The nonlinear dynamics is considered. The design of main magnets is performed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA02",
      "title": "Correction of the Magnetic Field in the NICA Collider",
      "authors": [
        "O.S. Kozlov",
        "S.A. Kostromin",
        "I.N. Meshkov",
        "E. Syresin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "A.V. Butenko",
        "A.O. Sidorin",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "The magnetic field correction systems in the optimized lattice of the NICA collider are considered. The dipole",
        "normal and skew quadrupoles",
        "sextupole and octupole additional windings are placed in the corrector elements to compensate separatly the alignment errors",
        "betatron tune shifts",
        "betatron coupling",
        "chromaticity and non-linear fields. The overall correction effect should provide the required beam and luminosity lifetime of the collider."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa02.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA02",
      "page_number": "149",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA03",
      "title": "Acceleration of Electron Bunches Generated by a Laser Pulse Crossing a Boundary of Inhomogeneous Plasma",
      "authors": [
        "JIHT RAS",
        "Moscow",
        "Russia",
        "The process of the generation and acceleration of an electron bunches by a laser pulse of ultrarelativistic intensity that interacts with underdense plasma target with an upramp density profile followed by a plateau has been studied. Numerical simulation has clearly demonstrated that the generation of electron bunches by a laser pulse is a consequence of 1D wave breaking to occur sharply at the up-ramp-plateau transition. The process of electron self-injection into the accelerating wake wave starts with an electron that initially occurred at a distance from the edge of the plateau equal to the amplitude of its longitudinal oscillations. This electron becomes a leader",
        "that is",
        "the first particle in the head part of the bunch trapped in the wake wave. The major fraction of electrons trapped in the wake wave are electrons that initially occurred in front of the electron leader. The fraction of electrons trapped in the wake",
        "which are initially occurred behind the electron leader",
        "determines by a slope of upramp density profile. The length",
        "mean energy and energy spread of the trapped and accelerated electron bunch are determined by gamma-factor of a laser pulse and the total energy of longitudinal oscillation of plasma electrons",
        "excited by a laser pulse*.",
        "*S.V. Kuznetsov Quantum Electronics",
        "2017",
        "Vol. 47",
        "No. 2",
        "pp. 87-96.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa03.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA04",
      "title": "Positioning of Bunches in a Multibunch Wakefield Acceleration Scheme for Increasing the Beam Flight Range",
      "authors": [
        "LETI",
        "Saint-Petersburg",
        "Russia",
        "To increase the acceleration gradients and the energy transferred to the accelerated bunch in the wakefield accelerating structures",
        "triangular profiling of the charge distribution in the driver bunch is used",
        "as well as various (RBT and FBT) multi-bunch wakefield acceleration schemes. However",
        "along with the coherent summation of the longitudinal fields used to accelerate the witness bunch",
        "parasitic transverse fields are also increasing",
        "which deflect the driver beam from the axis of the waveguide. It is proposed to use the difference in the frequencies of the accelerating and deflecting fields to significantly reduce the influence of the deflecting fields on the dynamics of the bunch by organizing a multi-bunch wake acceleration scheme with a special positioning of the bunches. Numerical simulation of the fields and beam dynamics in the proposed accelerating scheme is carried out.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa04.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA04",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA06",
      "title": "Beam Optics of Operating Modes for Damping Ring of VEPP-5 Injection Complex",
      "authors": [
        "K.V. Astrelina",
        "V.V. Balakin",
        "D.E. Berkaev",
        "F.A. Emanov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Damping storage ring (DR) is the part of VEPP-5 Injection Complex which provides electron and positron beams for BINP collider experiments since 2015. Basic lattice parameters of the ring (optical functions",
        "dispersions",
        "betatron frequencies",
        "etc.) of the operating modes are presented in the article. Actual calculations of the ring aperture limitations and energy acceptance after RF-system reconstruction are given. Some instruments for the beam orbit control and magnet system adjustment were developed and can be applied to improve the productivity of beams generation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa06.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA06",
      "page_number": "152",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA07",
      "title": "Calculation of Injection Efficiency to Damping Ring of VEPP-5 Injection Complex",
      "authors": [
        "K.V. Astrelina",
        "F.A. Emanov",
        "N.S. Kremnev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "VEPP-5 Injection Complex (IC) is electron and positron beam source for VEPP-4 and VEPP-2000 experimental facilities. IC consists of Preinjector - the system of two linear accelerators and conversion target",
        "and Damping Ring where particle beams are collected before extraction to the users. One of the factors that determine the performance of IC is the number of positrons which can be transported from Preinjector to Damping Ring and stored to the stable orbit. Estimations of the maximum efficiency of beam generation include the beam loss calculations in the transport line between linear accelerator and ring and analysis of the injected beam capture in the storage ring. Results of calculations are presented in the report."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa07.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA07",
      "page_number": "155",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA08",
      "title": "Stability of Charged Particle Motion in a Storage Ring With Focusing by a Longitudinal Magnetic Field",
      "authors": [
        "S.A. Melnikov",
        "I.N. Meshkov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "The goal of the presented research is analyse an influence of the solenoidal magnetic field perturbations on the dynamics of charged particles in a storage ring with a longitudinal magnetic field LEPTA. The Low Energy Particle Toroidal Accumulator",
        "constructed in the VP Dzhelepov Laboratory of Nuclear Problems",
        "JINR",
        "is designed for generating a directed orthopositronium flux",
        "which is formed as a result of recombination of positrons circulating in the LEPTA ring with a single-turn electron beam of electron cooling system. To provide a long-term stability of the circulating positron a helix quadrupole magnetic field is formed in one of the straight sections of the ring. The report presents an optical transformation matrix for the LEPTA ring",
        "obtained on the basis of the solution of the motion equation in WKB-approximation. The matrix of the region of the solenoid field pertubations is included in the Full Transformation Matrix (FTM) of the LEPTA ring. The program built in Mathcad for this matrix",
        "made it possible to study the multi-turn stability of the particle motion in the LEPTA ring. The results are presented in the report."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa08.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA08",
      "page_number": "158",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA09",
      "title": "Degenerate Self-Consistent Distributions for Charged Particle Beam in Linear Transverse Field",
      "authors": [
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia",
        "The present report is devoted to covariant description of the microcanonical distributions for a charged particle beam on the base of the covariant approach previously developed in the works of the author*. For microcanonical distribution",
        "particles are distributed on surface of some ellipsoid in the phase space. Here",
        "we consider most general case of arbitrary orientation of the ellipsoid. For description of such distributions",
        "we make use the density of particles on surface of the ellipsoid. Covariant approach give us an opportunity to follow the evolution of these distributions using various systems of coordinates in the phase space. Using such approach",
        "we found new distributions",
        "which can be considered as generalizations of the Kapchinsky-Vladimirsky distribution. The results can be useful in many applied problems",
        "for example",
        "problems of optimization of beam transport channel.",
        "* O.I. Drivotin. Covariant Formulation of the Vlasov Equation. Proc. IPAC'2011; Covariant Description of Phase Space Distributions. Vestnik of St.Petersburg Univ. Ser.10. 2016",
        "iss.3. P.39-52."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa09.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA09",
      "page_number": "161",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA10",
      "title": "Control Theory Model for RFQ Channel Optimization",
      "authors": [
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia",
        "The common approach for RFQ channel design* allows to find geometric parameters of sections of the channel including cell lengths",
        "apertures and coefficients of modulation of electrodes forming the channel. According to that approach",
        "the phase of so called synchronous particle changes slowly. Our previous computations** indicate that quality of beam in this channel can be better",
        "if synchronous phase changes more quickly with some oscillations. To find opportunity for improving the structure",
        "we propose a control theory model for charged particle beam in the RFQ channel. The model includes some particle distribution with density satisfying to the Liouville equation",
        "dynamics equations containing control functions",
        "and a quality functional. The synchronous phase is chosen as one of the control functions. Great attention is paid to choice of the quality functional. A numerical solution of such problem can be achieved by an iterative method based on computation of the functional variations. In real problems",
        "we can parametrize the control functions. Then functional variations can be approximated by derivatives of functional over control functions parameters.",
        "* I.Kapchinsky. Theory of Resonance Linear Accelerators. New York",
        "Harwood Academic Publ.",
        "1985. ** O.I. Drivotin",
        "D.A. Ovsyannikov",
        "Yu.A. Svistunov",
        "M.F. Vorogushin. Proc. EPAC'98."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa10.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA10",
      "page_number": "164",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA11",
      "title": "Development of a Software Complex for Modeling, Analyzing and Optimization the Dynamics of Charged Particle Beams in Synchrotrons and Transport Channels",
      "authors": [
        "D.A. Ovsyannikov",
        "V.V. Altsybeyev",
        "V.A. Kozynchenko",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "The paper considers a new version of the software complex developed for modeling",
        "analyzing and optimization the transverse dynamics of charged particle beams in synchrotrons and transport channels. Considered code provides the calculation of transverse dynamics of the charged particle beam in synchrotrons and transport channels based on the linear model",
        "as well as the calculation of the structural functions of synchrotrons and transport channels",
        "the beam acceptance and emittance",
        "beam dynamics optimization. In the new version of the software complex",
        "the ability to carry out calculations on a remote computing cluster",
        "the web user interface. To store the results of calculating the beam dynamics",
        "a database is used."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa11.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA11",
      "page_number": "167",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA12",
      "title": "Dynamics of the Spherical Cloud of Charged Particles",
      "authors": [
        "Allrussian Electrotechnical Institute",
        "Moskow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "In work the behavior spherically of a symmetric dense cloud of the charged particles which are under the influence of own field is studied. The kinetic description based on \"Meshchersky's integral\" is used. The movements of particles from the center of symmetry and to the center of symmetry of system are studied. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa12.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA12",
      "page_number": "169",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA13",
      "title": "About Focusing by Grids",
      "authors": [
        "Allrussian Electrotechnical Institute",
        "Moskow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The possibility of steady acceleration of particles in the presence in a tube of drift of a foil which plane is parallel to an axis is studied. For calculation of the field the method of conformal transformations is used. Conditions of simultaneous acceleration with stability of the cross and longitudinal movement are found out. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa13.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA13",
      "page_number": "172",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA14",
      "title": "Numerical Computation of Dynamic Aperture for the NICA Booster",
      "authors": [
        "O. Kazinova",
        "A.V. Butenko",
        "A. Tuzikov",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "S.A. Kostromin",
        "V.A. Mikhailov",
        "JINR",
        "Dubna",
        "Russia",
        "Modern accelerators are made with high-field superconducting dipoles",
        "quadrupoles and sextupoles that exhibit unintentional imperfections of the guiding field-shape due to construction tolerances",
        "persistent currents and magnetic saturation. This deviation from linearity has a profound influence on the beam dynamics. In this work the research of nonlinear beam dynamics for the NICA booster was carried out. Sextupole and octupole fields for dipole and quadrupole magnets",
        "according to ongoing magnetic measurements",
        "were taken into account",
        "as well as adjustment errors for magnets. Numerical simulation in MADX program has been used to evaluate the dynamic aperture for the booster. In addition",
        "betatron tune shift with amplitude was calculated. The results showed that dynamic aperture is exceeded its geometrical acceptance at least in three times."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa14.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA14",
      "page_number": "175",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA15",
      "title": "Beam Dynamic Modelling in the Nuclotron While Working in the NICA Complex",
      "authors": [
        "I.L. Avvakumova",
        "A.D. Kovalenko",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Nuclotron (JINR",
        "Dubna)",
        "the superconductive synchrotron",
        "is the core of NICA complex which is under construction now. The aim of the current work was to demonstrate main parameters of beam dynamics in the Nuclotron while functioning as a part of NICA. Thereby",
        "processes of beam circulation in different modes of the Nuclotron work were modelled. The influence of the injection and extraction systems magnets on beam dynamics was demonstrated. Caclulations were carried out via MADX package."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa15.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA15",
      "page_number": "178",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA16",
      "title": "Computer Codes for Calculation of Electromagnetic Radiation Generated in Magnetic Fields",
      "authors": [
        "N.V. Smolyakov",
        "R. G. Chumakov",
        "NRC",
        "Moscow",
        "Russia",
        "Software for simulation of different characteristic of spontaneous electromagnetic radiation",
        "generated by a relativistic electron beam in external magnetic field",
        "is presented. It consists of several different computer codes",
        "which are in consistent with each other. Computer codes calculate spatial and spectral distributions of electromagnetic radiation intensities. Explicit expressions are used for the emitted electric field components",
        "including the so-called velocity term. The codes simulate the electron trajectory in the external magnetic field numerically",
        "by using the experimentally measured values of the field. The real geometry is used for the simulation. For example",
        "the near-field effects are taken into account. The electron beam emittance is simulated by numerical convolution of the Gaussian electron distribution in a beam with the spatial distribution of the electromagnetic radiation",
        "generated by one electron. As an example",
        "the edge radiation",
        "generated at the ends of bending magnets of the Siberia-2 storage ring",
        "is considered. Calculations show that the edge radiation intensity must significantly exceed the intensity of standard synchrotron radiation",
        "formed by the homogeneous field of a bending magnet",
        "in the infrared and ultraviolet spectral regions. This set of computer codes will also find wide application in the new project of the fourth generation of a specialized synchrotron radiation source ISSI-4.",
        "The work was supported by the Ministry of Education and Science of the Russian Federation (agreement no. 14.587.21.0001",
        "unique identifier of scientific research"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa16.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA16",
      "page_number": "181",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA17",
      "title": "Novel Approach to Design of the Compact Proton Synchrotron Magnetic Lattice",
      "authors": [
        "V.A. Vostrikov",
        "S.E. Karnaev",
        "Yu.A. Pupkov",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "A compact proton synchrotron for cancer therapy has been developed. The proposed magnetic lattice includes short dipole magnets with opposite direction of the field. The lattice optical functions are close to the usual for weak-focusing synchrotrons. At the same time",
        "it allows achieve value of momentum compaction factor less than unity",
        "and thereby avoid intensity limitations due to longitudinal instabilities. Multiturn injection and resonance extraction description finalizes the presented design of compact proton synchrotron."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa17.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA17",
      "page_number": "185",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA18",
      "title": "About One Way of the Solution of the Hill Equation",
      "authors": [
        "MEPhI",
        "Moscow",
        "Russia",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "The equation of Hill finds application in the different fields of science and technology, including accelerating technique. The known approaches assume the analysis of stability of the decision after definition of eigenvalues of a matrix of transition from initial values of couple of fundamental decisions to their values through the period of the function defining an oscillation frequency of amplitudes of decisions. Fundamental decisions are defined by the numerical solution of differential equations for amplitude and a phase received immediately from the equation of Hill. The different way of analytical submission of fundamental solutions of the equation of Hill and numerical approach to its decision is given in work. In it matrix approach to a task and the simplified algorithm of its decision corresponding to it is used. The received results are compared to results of the solution of the equation of Hill in the traditional way. On some plane the solution of the equation of Hill will be displayed in the form of closed curves with the repeating sites. At the same time curves will be not periodic if a change of a phase is incommensurable with 2Pi. If the solution of the equation of Hill is not limited, it will be displayed in the form of two spirals. Zero of some integral can judge stability of the decision on equality Thus, the specified technique of the solution of the equation of Hill allows along with finding of couple of fundamental decisions to define their stability. reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa18.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA18",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA19",
      "title": "Realistic 3D Tracking Methods Through Electrostatic Elements for Low Energy Beamlines",
      "authors": [
        "V. Rodin",
        "J.R. Hunt",
        "J. Resta-López",
        "B. Veglia",
        "C.P. Welsch",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "J.R. Hunt",
        "J. Resta-López",
        "B. Veglia",
        "C.P. Welsch",
        "Cockcroft Institute",
        "Warrington",
        "Cheshire",
        "United Kingdom",
        "In 2020 transfer lines will begin transporting extremely low energy (100 keV) antiproton beams from the Extra Low Energy Antiproton (ELENA) ring to the antimatter experiments at CERN. To achieve this",
        "and obtain the greatest efficiency",
        "transfer lines will be based on electrostatic optics. Unfortunately",
        "only a small amount of simulation codes allow realistic and flexible implementation of such elements. In this contribution",
        "methods for accurately creating and tracking through electrostatic optical elements are presented",
        "utilising a combination of finite element methods with both a modified version of G4Beamline and BMAD. A range of approaches to modelling the electrostatic elements were explored",
        "ranging from simple field expressions",
        "to the complex field maps used in the final model. An investigation into the achievable beam quality at one of the experiments is presented. Realistic beam distributions obtained via tracking around ELENA in the presence of collective effects and electron cooling will be propagated along the optimised 3D transfer lines models.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa19.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA19",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA20",
      "title": "Using  Turbo Generators for Powering HV-Solenoids at Relativistic  Electron Coolers",
      "authors": [
        "DELTA",
        "Dortmund",
        "Germany",
        "HIM",
        "Mainz",
        "Germany",
        "M.I. Bryzgunov",
        "V.V. Parkhomchuk",
        "V.B. Reva",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "IKP",
        "Mainz",
        "Germany",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "The Helmholtz Institut Mainz (HIM) performs experiments related to possible improvements of high-energy d.c.-electron coolers. Results and activities concerning the progress of our project to use turbo generators as a means for potential-free power generation in high-energy electron coolers are presented. reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa20.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA20",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA22",
      "title": "Commissioning of Electron Cooling System of NICA Booster",
      "authors": [
        "S.V. Semenov",
        "A.G. Kobets",
        "S.Yu. Kolesnikov",
        "A.S. Sergeev",
        "A.A. Sidorin",
        "A.V. Smirnov",
        "Yu.A. Tumanova",
        "L.V. Zinovyev",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "M.I. Bryzgunov",
        "A.V. Bubley",
        "V.V. Parkhomchuk",
        "V.B. Reva",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "At the NICA project",
        "two electron cooling systems were planned at the booster and collider. The booster cooler will be used for the multiturn injection procedure and for the formation of necessary beam parameters before injection from the booster to Nuclotron. This article presents the status of the commissioning of the electron cooling system at the NICA booster. The electron cooling system was produced in BINP (Novosibirsk) and delivered to JINR (Dubna) last year. This year the commissioning of the cooler was done for parameter of the injection energy of ions 3.2 GeV/u. In the nearest future it will test for the intermediate ion energy 100 GeV/u. And finally",
        "the cooler should operates at both energy during one injection cycle."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa22.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA22",
      "page_number": "188",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA23",
      "title": "Test Bench for the NICA Stochastic Cooling Elements",
      "authors": [
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "V.V. Filimonov",
        "V.O. Khomutova",
        "A.O. Sidorin",
        "JINR",
        "Dubna",
        "Russia",
        "V.O. Khomutova",
        "A.O. Sidorin",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "Stochastic cooling is one of the crucial NICA collider subsystems. Cooling efficiency depends on quality of system elements. A new test bench has been created at JINR for incoming control of pickups",
        "kickers and amplifiers",
        "tuning and adjustment of the notch filter",
        "etc. The description of the test bench is given. Methodic of the measurements that should be done on the test bench are discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa23.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA23",
      "page_number": "191",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA24",
      "title": "Test Bench Measurements for the NICA Stochastic Cooling Pickup and Kicker",
      "authors": [
        "V.O. Khomutova",
        "V.V. Filimonov",
        "A.O. Sidorin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "I.V. Gorelyshev",
        "V.O. Khomutova",
        "A.O. Sidorin",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "A new test bench for measurements of Nuclotron-based Ion Collider fAcility (NICA) stochastic cooling elements has been created at Joint Institute for Nuclear Research (JINR). The following measurements for NICA stochastic cooling pickups/kickers based on Ring-slot coupler structure has been provided: impedance dependence on azimuthal and longitudinal loop positions",
        "electrical center position behavior as a function of frequency and standing wave ratio (SWR) of the kicker. The results of the listed measurements are given."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa24.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA24",
      "page_number": "194",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA25",
      "title": "Construction and RF Test of the Debuncher for NICA Light Ion Beam Line",
      "authors": [
        "D.A. Zavadtsev",
        "D. Churanov",
        "Y.Z. Kalinin",
        "L.V. Kravchuk",
        "V.V. Paramonov",
        "A.A. Zavadtsev",
        "RAS/INR",
        "Moscow",
        "Russia",
        "A.V. Butenko",
        "A.V. Smirnov",
        "E. Syresin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Debuncher is to be installed in the present beam line after the LU-20 linac in the light ion injector of the NICA facili-ty. The purpose of the debuncher is to reduce by a factor of up to ten the ion energy spread in the accelerated beam before injection into the Nuclotron. Relative ion speed is 0.1. Split-ring cavity driven from solid state RF amplifier at 145.25 MHz",
        "should provide effective RF voltage up to 200 kV at 4 kW peak RF power. The RF controller allows adjust effective RF voltage for different ions: 58 kV for Z/A=1",
        "121 kV for Z/A=0.5 and 190 kV for Z/A=0.3. The debuncher cavity is provided with the stepper-motor driven capacitance tuner with 2 MHz tun-ing range."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa25.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA25",
      "page_number": "197",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA26",
      "title": "Electrodynamics of Weakly Coupled RF Cavities",
      "authors": [
        "LPI",
        "Moscow",
        "Russia",
        "The configuration formed by a pair of coupled identical rf cavities may manifest unexpected electromagnetic properties concerning its interaction with external rf sources and charged particle beams. Coupling splits resonance frequency of such a system into two different frequencies corresponding to different modes: 0 and pi. If cavity walls losses take place",
        "that is cavities Q-values are finite for both modes",
        "composite cavity resonance curves may overlap. This means that both cavity modes are excited effectively by external rf generator or by an intensity modulated charged particles beam traversing cavities. Thus",
        "mixed mode excitation takes place",
        "and resonance properties of such mixed mode as well as beam current loading effect differ qualitatively and quantitatively from those for real cavity eigen modes. In this paper",
        "field approach is used to describe two coupled cavities system behavior. The expression for any cavity mode amplitude allows obtaining frequency dependence of cavity mixed mode amplitude for both cavities of the system under consideration. Appropriate formulae are supplemented by plots and vector diagrams."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa26.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA26",
      "page_number": "200",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA27",
      "title": "Injection Region Probing by Beam at VEPP-2000 Storage Ring",
      "authors": [
        "D.B. Shwartz",
        "I. Koop",
        "E. Perevedentsev",
        "Yu. A. Rogovsky",
        "M.V. Timoshenko",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "I. Koop",
        "E. Perevedentsev",
        "Yu. A. Rogovsky",
        "D.B. Shwartz",
        "NSU",
        "Novosibirsk",
        "Russia",
        "VEPP-2000 electron-positron collider for multiple injection and stacking uses traditional scheme with pre-kicker",
        "kicker and pulsed thin septum magnet. It was found earlier that despite the shielding septum stray field disturbs the circulating beam and sweep it's betatron tune long after the magnet pulse. This work presents the beam-based measurements of mechanical aperture at the interaction region and discusses stray field mapping technique."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa27.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA27",
      "page_number": "203",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA29",
      "title": "Emittance Measurement on Krion-6T Ion Source by Pepper-Pot Method",
      "authors": [
        "S.V. Barabin",
        "A.V. Kozlov",
        "T. Kulevoy",
        "D.A. Liakin",
        "A.Y. Lukashin",
        "D.N. Selesnev",
        "ITEP",
        "Moscow",
        "Russia",
        "E.D. Donets",
        "E.E. Donets",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The Krion-6T ion source is an electron string ion source (ESIS) of multicharged ions. It will be used as an ion source for the heavy ion linac at the NICA project",
        "but has been tested on an existing injection facility - Alvarez-type linac LU-20 with new RFQ type fore-injector. The transverse emittance measurements were carried out on the initial part of channel (IPC) of the low energy beam transport (LEBT) channel",
        "between the ion source and RFQ fore-injector by pepper-pot method. Beams of multicharged Argon and Xenon ions are observed. Measurements of the profile and emittance were performed over several energies for each type of ions. The results of the measurement are presented",
        "and some points of emittance calculations are considered."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa29.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA29",
      "page_number": "207",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA30",
      "title": "The Research of Plasma Lens with Discharge Initiation by the Electron Beam",
      "authors": [
        "A.A. Drozdovsky",
        "A.V. Bogdanov",
        "S.A. Drozdovsky",
        "R. Gavrilin",
        "A.V. Kantsyrev",
        "V.A. Panyushkin",
        "I. Roudskoy",
        "S.M. Savin",
        "V.V. Yanenko",
        "ITEP",
        "Moscow",
        "Russia",
        "Keldysh Institute of Applied Mathematics",
        "Moscow",
        "Russia",
        "MEPhI",
        "Moscow",
        "Russia",
        "At the present time",
        "active works are under-way for creating compact laser (electron and proton) accelerators. For them",
        "it is timely to solve problems of transportation and focusing of beams in the plasma lens discharges of the Z-pinch type*. For effective focusing it is necessary to investigate under what conditions of discharge initiation a fairly uniform discharge is formed. In ITEP studies of the dynamics of the plasma in the lens with the initiation of the discharge the electron beam. An experimental setup is used",
        "which includes a source of an electron beam with an energy of 250 KeV at a current of up to 100 A. Main method of observing the dynamics of the plasma discharge is the registration of own plasma radiation in the visible and ultraviolet range. Studies have shown that the process of development of the discharge initiated by the electron beam is significantly different from that in the usual method of z-pinch formation. The plasma distribution in the cross section is quite uniform in a large time interval. This distribution is desirable for the purpose of creating a plasma lens with linear focusing forces.",
        "*J. van Tilborg",
        "E. Esarey",
        "S.S. Bulanov",
        "P.V. Sasorov",
        "W.P. Leemans",
        "et al",
        "Nonuniform discharge currents in active plasma lenses",
        "PHYSICAL REVIEW ACCELERATORS AND BEAMS 20",
        "032803 (2017)"
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa30.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA30",
      "page_number": "211",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA31",
      "title": "Calibration of Measurement of Absolute Dee Voltage for U-400M Isochronous Cyclotron at FLNR JINR",
      "authors": [
        "A. Issatov",
        "R.K. Kabytayeva",
        "JINR/FLNR",
        "Moscow region",
        "Russia",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "S.V. Mitrofanov",
        "Yu.G. Teterev",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Measurement of absolute Dee voltage results of the isochronous cyclotron U-400M at FLNR JINR by the X-ray technique will be presented. Measurements were made at the following frequencies of the resonance system: 12.8",
        "13.317",
        "15.012",
        "15.1 and 17.5 MHz. The modeling of X-ray spectrum was carried out by the software package FLUKA to accurately determine the maximum energy of X-ray spectrum. An influence of the absolute Dee voltage was estimated by the program Center."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa31.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA31",
      "page_number": "214",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPSA32",
      "title": "Pulse Scanning System of the Medical Beam and the System of Recording the Position of the Beam and the Distribution of the Irradiation Dose of the Object",
      "authors": [
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "This work describes the pulse scanning system of the medical beam and the system of recording the position of the beam and the distribution of the irradiation dose of the object. Our report deals with the construction of the carbon beam transport line for biomedical research at the NICA accelerator complex",
        "JINR",
        "Dubna. We are discussed the compilation and realization of the plan of treating a tumor located at a depth up to 30 cm. The hardware realization of the beam scanning is shown. We describe the wire chamber and read out electronics which were developed for on-line monitoring of the \"intensive\" extracted beams of relativistic nuclei. The system has been tested in several acceleration runs with deuteron beams with the intensity up to 1010 1/s and carbon ion beams. The system allows one to make multiple measurements of the two-dimensional beam intensity distribution and beam position during the beam spill."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa32.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA32",
      "page_number": "217",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA33",
      "title": "Radioisotope Centre of Nuclear Medicine",
      "authors": [
        "A.A. Khasin",
        "R.G. Tertychnyy",
        "CDNM Ltd",
        "Protvino",
        "Russia",
        "V.N. Peleshko",
        "A.P. Soldatov",
        "IHEP",
        "Moscow Region",
        "Russia",
        "The Centre for Development of nuclear medicine (CDNM Ltd) in partnership with the Institute of High Energy Physics of the National Research Centre Kurchatov institute (IHEP) is establishing in Protvino a manufacturing facility on the basis of 70 MeV proton cyclotron. The facility will be focused on production of medical isotopes including Sr-82",
        "Ge-68",
        "Cu-67",
        "and others. Sr-82 and Ge-68 isotopes are of the high demand for production of Sr-82/ Rb 82 and Ge-68/Ga-68 radionuclide generators used in PET (Positron Emission Tomography) diagnostics of cardiac and oncological diseases respectively. Cardiac PET is a superior proven technology",
        "which enables physicians to deliver a diagnosis with less artifactual defects and false-positive results. Wider spread of cardiac PET diagnostics is currently restrained by a shortage of Sr-82 isotope being produced by a limited number of manufacturers worldwide. Establishment of a Russian production site will make it possible to introduce very effective Rb-82- based cardiac PET diagnostics into clinical practices in Russia. CDNM's production facility will run a proton cyclotron Cyclone-70 manufactured by IBA (Ion Beam Applications)",
        "Belgium with target devices being developed in partnership with IHEP. CDNM's manufacturing facility will also have a radiochemistry lab for extraction and purification of radionuclide products and quality control laboratory.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa33.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA33",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA34",
      "title": "Numerical Modeling and Development of the Prototype of the Bragg Peak Position Detector Working in Real Time Mode for Hadron Therapy Facilities",
      "authors": [
        "A.A. Pryanichnikov",
        "Belikhin",
        "M.A. Belikhin",
        "A.S. Simakov",
        "PhTC LPI RAS",
        "Protein",
        "Moscow region",
        "Russia",
        "Altukhov",
        "Y.V. Altukhov",
        "E.V. Altukhovapresenter",
        "I.I. Degtyarev",
        "F.N. Novoskoltsev",
        "R.Yu. Sinyukov",
        "IHEP",
        "Moscow Region",
        "Russia",
        "The purpose of this research was precision statistical simulation of multi-particle radiation transport using a realistic 3D model of clinical setup prototype and the systems of slot-hole collimators for on-line monitoring of Bragg-peak position at a proton therapy complex Prometheus to define of an available detecting accuracy and the choice of its optimum parameters. Numerical simulation of the experiments was carried out based on the RTS&T high-precision radiation transport software package using files of evaluated nuclear data from ENDF/B VIII.0 library. Results: To determine the error of the longitudinal Bragg peak monitoring",
        "a series of 24 calculations was performed using different sequences of pseudo-random numbers to construct trajectories of particles in the calculation system. When using 3 slits",
        "the RMS-error in determining the longitudinal coordinate was 1.5 mm. Keywords: radiation transport",
        "Monte Carlo method",
        "radiation therapy",
        "medical accelerators",
        "Bragg peak verification",
        "mathematical modeling",
        "irradiation planning",
        "detection techniques."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa34.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA34",
      "page_number": "220",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": true
    },
    {
      "paper_id": "TUPSA35",
      "title": "Proton Therapy: Ridge Filter Improvements for Sake of the Dose Conformity",
      "authors": [
        "I.A. Yakovlev",
        "S.V. Akulinichev",
        "Y.K. Gavrilov",
        "RAS/INR",
        "Moscow",
        "Russia",
        "One of the dose formation options in proton therapy is the method of passive scattering. This method has some advantages and drawbacks compared to the pencil-beam scanning. One of the disadvantages is the appearance of hot lesions in the proximal region beyond the borders of the target volume. It lowers the dose conformity to the target volume and the treatment quality. One of the possible solutions of this problem is a multi-layer energy filter proposed by Sakae Takeji et al. The idea of this device is to change its geometry depending on the required modulation width of the spread-out Bragg peak. However",
        "in that case regions of overdose appear inside the target due to the lack of the correct beam intensity regulation. We suggest another design of a tool for depth dose formation. The new device is called Composite Ridge Filter. It combines the traditional ridge filter with an additional absorbing material to control the beam intensity and regulate SOPB (Spread-out Bragg peak) modulation width. In our previous study we have calculated the geometry for 95% isodose spherical contour irradiation and it was tested with Monte-Carlo simulation. Now we have improved the technique of geometry findings and prepare the experimental tests with proton beams of INR linac."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa35.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA35",
      "page_number": "222",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA36",
      "title": "The Unwanted Neutrons in Radiation Therapy During the Medical Electron Accelerator Operation",
      "authors": [
        "MSU",
        "Moscow",
        "Russia",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "During radiotherapy using bremsstrahlung gamma quanta with energies greater than 8 MeV, nuclear reactions with neutron emission take place on the brake target and structural materials of a linear accelerator. Because of the high radiobiological danger of neutron radiation, especially fast neutrons, their contribution to the total beam flux substantially increases the dose received by the patient. We conducted studies of the braking gamma quanta and neutrons flows directly at the place of the patient's treatment at a distance of 1 m from the virtual source of gamma quanta with a radiation field size of 20x20 cm2. The use of direct spectrometric methods for measuring the flux of gamma quanta and neutrons in this case is extremely difficult due to the high flux density (according to some estimates ~1012 particles*cm-2*s). Therefore, for solving this problem, we used the photoactivation method. Registration of gamma quanta and neutrons was carried out using (gamma, n) and (n, gamma)-reactions. The natural tantalum 181Ta as one of the most studied nuclei in both photonuclear reactions and in reactions with neutrons in a wide energy range, was used as a detecting target. For the experiment, two Varian Trilogy medical accelerators with different operating life were used: accelerator 1 with long operating life (boundary energy 18 MeV) accelerator 2 with short operating life (boundary energy 20 MeV). reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa36.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA36",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA37",
      "title": "Research of 89Zr Output in Photonuclear Reactions  on Molybdene",
      "authors": [
        "MSU",
        "Moscow",
        "Russia",
        "In recent years",
        "the use of electron accelerators for the production of radiopharmaceuticals has become important and relevant. One of attractive methods for non-invasive tumor detection and treatment planning is the positron emission tomography with radiolabeled monoclonal antibodies. Zr-89 has appropriate decay characteristics for high resolution PET imaging. Usually production of this nuclide is based on (p",
        "n)-reaction on natural yttrium. However",
        "proton accelerators are complex and power-consuming installations. They require a large number of specialists for their maintenance. At the same time",
        "electron accelerators",
        "such as microtrones",
        "are more compact equipment and have undeniable advantages in ease of maintenance and energy costs. Therefore",
        "we are conducting studies of the Zr-89 output in different photonuclear reactions. One of the perspective direction is the use of natural molybdenum as targets for these purposes. When the target is irradiated with high-energy gamma quanta",
        "the short-lived nuclides Mo-89 (T1/2 = 2 min) and Nb-89 (T1/2 = 2 hours) are formed in the reaction (gamma",
        "3n) and (gamma",
        "p2n)",
        "which decay into Zr-89 (T1/2 = 3.3 days). We irradiated the natural molybdenum target on the pulsed microtron with an electron energy 55M eV. The 50 mg target was irradiated during 80 minutes. The average current was 40-45 nA. The spectrometric measurements were carried out using a Canberra semiconductor spectrometer with a detector of high-purity germanium of large volume with an energy resolution 1.8 keV of 1332 keV Co-60 gamma-line. An activity of 240 ± 20 Bq was obtained. The Mo-99 gamma-ray transitions in the (gamma",
        "n)-reaction at Mo-100 were observed in the spectrum. It was found that (gamma",
        "3n)-reaction cross-section amounts to (1",
        "71±0",
        "08)*10-2 of (gamma",
        "n)-reaction cross-section. Obtained data is discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa37_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa37.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa37_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA37",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA38",
      "title": "Neutron Monitors for High Energy Accelerators",
      "authors": [
        "I.L. Azhgirey",
        "I.S. Bayshev",
        "I.A. Kurochkin",
        "V.S. Lukanin",
        "V.A. Pikalovpresenter",
        "O.V. Sumaneev",
        "IHEP",
        "Moscow Region",
        "Russia",
        "Thermal neutron counters inside moderating shells are used widely at high energy accelerators. Response of these detectors to neutrons of different energy depends on material",
        "size and shape of moderator. Radiators and absorbers can also modify this response significantly. The main application of counters in moderators is neutron dosimetry. Some dedicated sets of these detectors Bonner spheres) are even used sometimes to estimate neutron spectra. Monitoring of fast neutrons at modern accelerator and experimental facilities is very important to keep radiation damage of electronic components under control. One more step towards fast neutron measurements with thermal neutron counters in moderators is reported here. A set of neutron transport simulations is done to optimize moderator/radiator/absorber assemblies for higher sensitivity to neutrons with energies above 100 kev along with much lower sensitivity at lower energies. The resulting pair of the main and complementary monitors is designed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa38_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa38.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa38_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA38",
      "page_number": "224",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA39",
      "title": "The Proton Radiography Facility at the U-70 Synchrotron",
      "authors": [
        "A.V. Maximov",
        "Y. Fedotov",
        "N.E. Tyurin",
        "O.V. Zyatkov",
        "IHEP",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The results on operation and development of proton radiography facility (PRGC-100) at the U-70 synchrotron are presented. PRGC-100 is designed to look inside the objects with mass thickness from 10-1 g/cm2 up to 450 g/cm2 and the field-of-view up to 220 mm at proton beam energy 50Ã·70 GeV. The measured spatial resolution is 90 mkm for thin objects and less than 500 mkm for the objects of 350 g/cm2 thickness. The development of the beam extraction systems for PRGC-100 as well as the first results on testing the proton microscope mode is presented. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa39_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa39.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa39_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA39",
      "page_number": "227",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA40",
      "title": "DC130: Next Step of the FLNR Accelerator Complex for Applied Science Activity",
      "authors": [
        "S.V. Mitrofanov",
        "P.Yu. Apel",
        "V. Bashevoy",
        "V. Bekhterev",
        "S.L. Bogomolov",
        "O.N. Borisov",
        "J. Franko",
        "G.G. Gulbekyan",
        "I.A. Ivanenko",
        "I.V. Kalagin",
        "N.Yu. Kazarinov",
        "V. Mironov",
        "V.A. Semin",
        "V.A. Skuratov",
        "A. Tikhomirov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "The main activities of Flerov Laboratory of Nuclear Reactions",
        "following its name - are related to fundamental science",
        "but",
        "in parallel",
        "plenty of efforts are paid for practical applications. Certain amount of beam time every year is spent for applied science experiments on FLNR accelerator complex. For the moment",
        "the main directions are: the production of the heterogeneousμ- and nano-structured materials; testing of electronic components (avionics and space electronics) for radiation hardness; ion-implantation nanotechnology and radiation materials science. Basing on FLNR long term experience in these fields and aiming to improve the instrumentation",
        "the accelerator department start the Design Study for new cyclotron DC130 which will be dedicated machine for applied researches in FLNR. Following the user's requirements DC130 should accelerate the heavy ions with mass-to-charge ratio A/Z of the range from 5 to 8 up to fixed energies 2 and 4.5 MeV per unit mass. The first outlook of DC130 parameters",
        "its features",
        "layout of its casemate and general overview of the new FLNR facility for applied science will be presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa40_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa40.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa40_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA40",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": true
    },
    {
      "paper_id": "TUPSA41",
      "title": "Effect of Tin Ion Implantation on the Properties of Amorphous Ge2Sb2Te5 Thin Films",
      "authors": [
        "A. Sitnikov",
        "P.A. Fedinpresenter",
        "A.V. Kozlov",
        "T. Kulevoy",
        "D.N. Selesnev",
        "ITEP",
        "Moscow",
        "Russia",
        "D.A. Dronova",
        "P. I. Lazarenko",
        "A. Sherchenkov",
        "A.O. Yakubov",
        "National Research University of Electronic Technology",
        "Moscow",
        "Russia",
        "Kurnakov Institute of General and Inorganic Chemistry of the Russian Academy of Sciences",
        "Moscow",
        "Russia",
        "Alloys along the quasi-binary line between Sb2Te3 and GeTe with compositions (GeTe)m(Sb2Te3)n",
        "in particular Ge2Sb2Te5",
        "have been intensely studied and are used in the state-of-the-art PCM devices. However",
        "properties of this thin film materials are not optimal and should be improved. In this work",
        "we investigated the effect of tin ion implantation on the properties of amorphous Ge2Sb2Te5 thin films. The Sn ion implantation was done on Multipurpose Test Bench (MTB)* at NRC \"Kurchatov Institute\"-ITEP. The MTB consists of MEVVA type ion source",
        "electrostatic focusing system",
        "the system of current and beam profile measurements. The charge spectrum of the Sn beam was measured by the time-of-flight method",
        "the beam profile as well as beam current were also measured. The beam's accelerating voltage was calculated by SRIM code in order to implant ions on the required film‘s depth. Tin ions were implanted into GST films at 40 kV accelerating voltage. Effect of Sn ion implantation (1 at. %) on the electrical properties of magnetron GST thin films was investigated.",
        "*S.Barabin",
        "V.Batalin",
        "A.Kozlov",
        "T.Kulevoy",
        "et.al.",
        "Multifunctional Test-Bench for Heavy Ion Sources",
        "Proceedings DIPAC 2003",
        "Mainz",
        "Germany",
        "p.158."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa41_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa41.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa41_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA41",
      "page_number": "230",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA42",
      "title": "The Irradiation Technique at SIRMAT",
      "authors": [
        "S.L. Andrianov",
        "N.A. Iskandarov",
        "A.V. Kozlov",
        "R.P. Kuibeda",
        "T. Kulevoy",
        "A.A. Nikitin",
        "S.V. Rogozhkin",
        "ITEP",
        "Moscow",
        "Russia",
        "In the NRC \"Kurchatov Institute\" - ITEP the experimental research of new promising materials for nuclear technology by using the heavy ion beams is underway at the Stand of Irradiation Reactor MATerials (SIRMAT). The SIRMAT allows irradiation of the investigated samples by metal ion beams with energies up to 100*z keV",
        "where z is the ion charge*. Local analysis of the irradiated samples is carried out by atomic-probe tomography. The work presents the main parameters of the SORMAT installation and the method of irradiation",
        "as well as the results of experimental work for 2017-2018.",
        "* S.L. Andrianov i dr. \"Stend oblucheniya reaktornykh materialov\". Izvestiya Vyschikh Uchebnykh Zavdeniy. T. 59",
        "9/3 p.225",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa42_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa42.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa42_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA42",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA43",
      "title": "Cyclotron Complex for Thailand Institute of Nuclear Technology",
      "authors": [
        "Yu.K. Osina",
        "Z. Andreeva",
        "A.V. Galchuck",
        "Yu.N. Gavrish",
        "S.V. Grigorenko",
        "V.I. Grigoriev",
        "M.L. Klopenkov",
        "R.M. Klopenkov",
        "L.E. Korolev",
        "K.A. Kravchuk",
        "A.N. Kuzhlev",
        "I.I. Mezhov",
        "A.G. Miroshnichenko",
        "V.G. Mudrolyubov",
        "G.V. Muraviov",
        "V.I. Ponomarenko",
        "K.E. Smirnov",
        "S.S. Tsygankov",
        "M.V. Usanova",
        "A.V. Vanin",
        "O.L. Veresov",
        "Yu. Zuev",
        "NIIEFA",
        "St. Petersburg",
        "Russia",
        "In 2020",
        "the CC-30/15 cyclotron complex is planned to be commissioned at the Institute for Nuclear Research of the Kingdom of Thailand. The main task of the project is the development of nuclear medicine in Thailand. The complex is created on the basis of the cyclotron of negative hydrogen and deuterium ions with finite energy in the ranges 15-30 / 9-15 MeV and the current of the extracted beam of 200/50 mkA",
        "respectively. A beam transport system ensures the formation and delivery of beams to five ports. Two of them are target devices designed for large-scale production of radionuclides of zirconium-89",
        "copper-64",
        "thallium-201 and gallium-67. A pneumatic system for the installation",
        "discharge and delivery of targets to radiochemical laboratories is provided. The remaining ports will be used in the program of scientific research in the field of neutron physics and radiation technologies. The main equipment of the complex was developed; production and factory testing should be completed in the third quarter of 2019."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa43_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa43.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa43_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA43",
      "page_number": "233",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA44",
      "title": "Radiation-induced Nanocomposite Polymer Films Fabrication Techniques",
      "authors": [
        "A.A. Revina",
        "S.A. Busev",
        "Y.S. Pavlov",
        "O.V. Souvorova",
        "IPCE RAS",
        "Moscow",
        "Russia",
        "Metal nanoparticles formation under the ionizing radiation can be processed under variety of conditions",
        "which include liquid and solid media",
        "heterogeneous and complexed phases",
        "low and high dose rates. The reverse micelles (RM)",
        "as nano-reactors",
        "were used for metal nanoparticles (NPs) formation*. Optical properties of metallic NPs in RM solution",
        "in transparent polymer films and membranes were registered using UV-VIS spectrophotometry. The purpose of investigation was the determination of the physico-chemical properties of perfluoro-sulphonated membranes (Nafion and MF-4SK) with incorporated metallic NPs (Pd",
        "Pt",
        "Ag",
        "Au). Modification of membranes done by dipping of the samples in NP RM solution was controlled spectrophotometrically at different stages of membranes contact with modifying media. Atomic force microscopy (AFM) established",
        "that the size of NP (Z-size) from the micellar solutions was in the range of 1-10 nm depending on the dose (5-15 kGy) of gamma-irradiation carried out at RKhM gamma-20 setup or EB-irradiation at UELV-10 accelerator. Results of metal NPs incorporation into membranes via dipping in NP RMS were compared with data obtained during research of cellophane films NPs-modification conducted \"in situ\"** - at the same time with the synthesis on the NPs in RM systems under irradiation.",
        "*A. Revina",
        "Patent RF No. 2322327. Bull. No. 11 (2008)  **A. Revina",
        "Patent RF No. 2212268. Bull. No. 26 (2003)",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa44_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa44.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa44_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA44",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA45",
      "title": "Provision of Dose Homogeneity  in Experiments for Developing  Methods of Food Irradiation",
      "authors": [
        "IPCE RAS",
        "Moscow",
        "Russia",
        "RRICT",
        "Vidnoye",
        "Russia",
        "MEPhI",
        "Moscow",
        "Russia",
        "S.N. Puchkov",
        "N.E. Rozanov",
        "MRTI RAS",
        "Moscow",
        "Russia",
        "At present",
        "interest is growing in the use of an electron beam irradiation for preserving food",
        "which is a more efficient technology than gamma irradiation. This technology has long been applied to the disinfection of dry products having a low density. When processing objects having a density comparable to that of water",
        "an inhomogeneous radiation dose profile may arise due to the insufficient penetrating power of the electron beam. This makes difficult to conduct correct studies. In IPCE RAS the research on the irradiation of food products and test tubes with model media on a radiation installation based on the UELV-10-10-C-70 accelerator with electron energy of 6-10 MeV is carried out. The sizes of irradiated objects often do not allow making an unambiguous conclusion about the uniformity of radiation doses in experiments. In order to find the distribution profile of doses in the objects of the study",
        "the irradiation process is modeled using a specially modified computer code \"BEAM SCANNING\". In this program",
        "the object is specified as the combination of primitive forms - a cone",
        "a cylinder",
        "a rectangle and a sphere",
        "which is enough for modeling typical forms of objects",
        "used in experiments. Calculations for cylinders and spheres simulating experimental objects-test tubes with model media and spherical products have been performed. The distributions of radiation doses in this objects are presented",
        "methods for increasing the dose homogeneity in experiments are proposed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa45_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa45.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa45_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA45",
      "page_number": "236",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA46",
      "title": "Effect of Ozone in Experiments on the Development of Food Irradiation Methods",
      "authors": [
        "P.A. Bystrov",
        "Y.S. Pavlov",
        "O.V. Souvorova",
        "IPCE RAS",
        "Moscow",
        "Russia",
        "V.P. Filippovich",
        "N.V. Iluhina",
        "RRICT",
        "Vidnoye",
        "Russia",
        "During sterilization by electron beam ozone is formed in the air",
        "which increases the efficiency of microorganism suppression. When studying the processes of radiation sterilization",
        "it is necessary to estimate the contribution of the chemical factor of ozone formation. The results of experiments on the irradiation of several cultures of microorganisms are presented",
        "which make possible to evaluate the degree of influence of the ozone formation factor in air radiolysis. In experiments",
        "the dependence of the degree of microbial suppression on the method of installing a test tube with a nutrient medium under a beam of an accelerator was investigated. Irradiation was carried out with horizontal and vertical installation of test tubes with cultures. With the horizontal",
        "the size of the area of contact between the medium and the ozonized air inside the tube is higher than in the vertical tube. The effect of irradiation with a horizontal position of the tube is higher than with the vertical arrangement. The irradiation process was monitored by film dosimeters located near and inside the test tubes with a substrate analog. The calculations of the amount of ozone produced in the experiments were performed",
        "and simulation of the irradiation process was carried out using the computer code \"Beam Scanning\". From the results of this study we conclude that ozone formation has a significant effect on the suppression of microorganisms during irradiation."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa46_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa46.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa46_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA46",
      "page_number": "240",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA47",
      "title": "Regularities of Inhibition of Conditionally Pathogenic Microflora Under the Influence of Accelerated Electron Beams",
      "authors": [
        "MEPhI",
        "Moscow",
        "Russia",
        "V.P. Filippovich",
        "A.Yu. Gracheova",
        "N.V. Iluhina",
        "RRICT",
        "Vidnoye",
        "Russia",
        "Burnasyan Federal Medical Biophysical Center",
        "Federal Medical Biological Agency",
        "Moscow",
        "Russia",
        "IPCE RAS",
        "Moscow",
        "Russia",
        "Article is devoted to the study of the irradiation efficiency of model systems containing conditionally pathogenic microorganism by electron beams with energy of 7 and 10 MeV. The research on the effectiveness of inhibition of the initial degree of inoculation of the microorganisms E. coli and Salmonella were carried out. Irradiation doses up to 10 kGy performed at radiation-technological installations the A.N. Frumkin Institute of Physical Chemistry and Electrochemistry RAS and State Research Center Burnasyan Federal Medical Biophysical Center. The results of the effective inhibition of initial contamination degree for the two samples",
        "which model liquid and solid nutrient media",
        "were obtained. It is shown that it is necessary to take into account not only the effectiveness of microorganism inhibition on specific products",
        "but also the installation efficiency for a particular sample."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa47_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa47.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa47_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA47",
      "page_number": "243",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA48",
      "title": "The Study of Electron Beam Irradiation Effect on Multilayer Polymer Materials",
      "authors": [
        "MEPhI",
        "Moscow",
        "Russia",
        "Burnasyan Federal Medical Biophysical Center",
        "Federal Medical Biological Agency",
        "Moscow",
        "Russia",
        "N.R. Kil'deeva",
        "N.A. Sazhnev",
        "Russian State University named after A.N.Kosygin",
        "Tech. Design. Art",
        "Moscow",
        "Russia",
        "MSU",
        "Moscow",
        "Russia",
        "RRICT",
        "Vidnoye",
        "Russia"
      ],
      "institutions": [
        "The work is devoted to the investigation of a multilayer polyamide/polyethylene film material 80 mkm thick after its processing with an electron beam with an energy of 10 MeV and doses of 3 to 18 kGy in the Burnasyan Federal Medical Biophysical Center of the federal medical biological agency. Infrared spectroscopy was used to study the structure of a polymer material before and after irradiation of each layer. Atomic emission microscope was used to study the surface of a film. Evolution of the film surface characteristics can lead to a change in the barrier properties of film material used for packaging in the food industry. Investigation of polymer film treated with fast electrons showed stable results on dispersion at doses up to 18 kGy."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa48_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa48.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa48_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA48",
      "page_number": "246",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA49",
      "title": "Installation for Irradiation of Thin Foils by Halo Proton Beam on IHEP Accelerator",
      "authors": [
        "Ja.N. Rascvetalov",
        "G.I. Krupny",
        "M.A. Maslov",
        "V.N. Peleshko",
        "IHEP",
        "Moscow Region",
        "Russia",
        "The halo of proton beam arises due to proton elastic and coulomb scattering on the internal target. On 70 GeV IHEP accelerator (U-70) halo contains up to several per-cent of proton beam. It was shown by Monte Carlo method that on thin target (0.05-1 g/cm2 foils) each halo proton crosses the foil specimen up to 103 - 105 times before it will be lost during U-70 cycle. The radiation damage level in foil specimens at 1020 crossings was estimated at about 0",
        "17 dpa (displacement per atom). Accumulation of hydrogen and helium atoms during exposure was calculated for iron",
        "nickel and chromium specimens. Some factors limiting the rate of accumulation of radiation damage and ways for its solutions are discussed. Simple installation with various material foils as targets is described together with the first proton expo-sure results of copper and aluminum foils. It is important",
        "that foils irradiation by beam halo may be provided independently out of the main U-70 physical program. As concluded",
        "radiation damage level compared with results got during one year research nuclear reactors can be accumulated during one U-70 run (one month)."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa49_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa49.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa49_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA49",
      "page_number": "249",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA50",
      "title": "Experimental Facility \"Radiobiological Test Setup on Accelerator U-70\"  as Centers for Collective Use (CCU)",
      "authors": [
        "V.A. Pikalov",
        "Y.M. Antipov",
        "IHEP",
        "Moscow Region",
        "Russia",
        "The experimental facility \"Radiobiological test setup on accelerator U-70\" was created on NRC \"Kurchatov Institute\" - IHEP",
        "Protvino to carry out radiobiological and physical experiments on the extracted beam of carbon nuclei with an energy up to 450 MeV / nucleon. This test setup is designed as a center for collective use. Specialists from 5 Russian institutes participate in radiobiological research of the cell structures and laboratory animals",
        "and in experiments on nuclear physics and dosimetry. The study of the biological effectiveness of carbon nuclei for the purposes of hadron therapy",
        "as well as to evaluate the effect of high-energy ion irradiation on human cognitive functions are the main goals of these radiobiological experiments. The experiments performed on the radiobiological test setup at U-70 was briefly reported."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa50_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa50.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa50_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA50",
      "page_number": "253",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA51",
      "title": "New Output Channels for Nuclotron Accelerator",
      "authors": [
        "T. Kulevoy",
        "M.M. Kats",
        "D.A. Liakin",
        "Y.E. Titarenko",
        "ITEP",
        "Moscow",
        "Russia",
        "JSC",
        "Moscow",
        "Russia",
        "D.V. Bobrovskiy",
        "A.I. Chumakov",
        "MEPhI",
        "Moscow",
        "Russia",
        "A.V. Butenko",
        "A. Tuzikov",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "E. Syresin",
        "G.N. Timoshenko",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "In framework of Nuclotron-based Ion Collider fAcility (NICA) two new high energy channels are under development. At first channel is a test facility for investigation of the radiation resistance of the electronic components and equipments under irradiation by the heavy ion beams. In addition to activity at the Dubna Cyclotrons it will cover all requirements of Space industry. The second channel will be a test facility for biological experiments under the ion irradiation. The general layout of beam transport for both channels as well as the test-facilities for them are presented and discussed. reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa51_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa51.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa51_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA51",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA52",
      "title": "New experimental  Channels at Nuclotron",
      "authors": [
        "M.M. Kats",
        "T. Kulevoy",
        "ITEP",
        "Moscow",
        "Russia",
        "In framework of NICA project two new experimental channels are under development. At first channel the radiation resistance of electronics and its' components under heavy ion irradiation will be tested. At second one the biological experiments under ion beam irradiation are planned. The structure of channels includes several dipoles",
        "focusing quadrupoles and active scanning systems. The results of the channel simulation providing lossless transportation for different ions (from C to Au) with energy per nucleon from 0.25 GeV to 0.8 GeV are persented and discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa52_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa52.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa52_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA52",
      "page_number": "256",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA53",
      "title": "Development of Experimental Set-Up for Applied Physics Research at NUCLOTRON Accelerator Facility",
      "authors": [
        "ITEP",
        "Moscow",
        "Russia",
        "The ion-optical scheme and mechanical design of experimental facility for applied physical research with 800 MeV/u heavy-ion beam was developed. The developed ion-optics provide beam transportation from accelerator to the two experimental target-chambers through ion-magnetic 2D scanner system. Ion-optical scheme was developed using Trace-3D code taking into account the sizes of existing experimental area. The mechanical design of elements of the facility was developed in frame of SolidWorks environment. As a result of calculations in CST EM STUDIO code",
        "the design of optical elements - dipoles magnets",
        "quadrupole lenses - was chosen. The calculation of the vacuum system of the facility was performed with MolFlow+ program. The radiation protection of the facility has been numerically simulated in FLUKA code. The type and design of beam diagnostic equipment's and data acquisition system were determined.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa53_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa53.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa53_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA53",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA54",
      "title": "Multichannel Injection Complex for the BELA Project",
      "authors": [
        "A.V. Ziiatdinova",
        "P.A. Fedin",
        "T. Kulevoy",
        "A.A. Nikitin",
        "S.V. Rogozhkin",
        "ITEP",
        "Moscow",
        "Russia",
        "P.A. Fedin",
        "T. Kulevoy",
        "A.V. Ziiatdinova",
        "NRC",
        "Moscow",
        "Russia",
        "MEPhI",
        "Moscow",
        "Russia"
      ],
      "institutions": [
        "BELA (Based on ECR ion source Linear Accelerator) project is under development in NRC \"Kurchatov Institute\" - ITEP. Injection complex of the accelerator based on two ion sources is intended for different tasks and has a multichannel transport system. One of the tasks is double irradiation simulation experiments for reactor materials. Heavy ion beam and light ion beam from different ion sources and with different energy will irradiate a target simultaneously. Beam dynamics simulations were carried out for both iron beam Fe10+ and H1+ and He1+ beams. The paper includes injection complex layout and results of beam dynamic simulation in transport system as well as SIMS simulation of ions interaction with a target material."
      ],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa54_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa54.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa54_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA54",
      "page_number": "259",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA55",
      "title": "ELV Accelerators Are a Tool for Innovation",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "BINP SB RAS produces an industrial electron ELV accelerators for radiation technologies. The main innovative applications are cross-linking of the insulation of wires and cables",
        "production of heat shrinkable tubes and films",
        "production of foamed polyethylene and radiation modification of rubber blanks for tires. The model range of ELV accelerators covers the range of electron energies from 0.5 MeV to 2.5 MeV",
        "beam power up to 100 kW",
        "and beam current to 100 mA. All models have similar concept but differ in overall dimensions",
        "length of ceramic accelerator tube",
        "and the number of high-voltage rectifying sections. This makes it easy to adapt accelerators to the requirements of technology. The system of automated control of accelerators and communication with technological lines is constantly developing. ELV accelerator with an energy of 0.3-0.5 MeV and beam current up to 130 mA was developed and tested. The accelerator is compact in size and installed in local steel shielding. Electron beam is extracted through a two-windows extraction system with one titanium foil 180 mm wide."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa55_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa55.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa55_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA55",
      "page_number": "261",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA56",
      "title": "A Compact High-Voltage Source on the Basis of ELV Accelerator",
      "authors": [
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "Electron accelerators of the ELV type are widely used in industrial and research organizations. The high-voltage rectifier of ELV accelerator is used as a high-voltage source of the tandem accelerator for boron neutron capture therapy (BNCT) at the Institute of Nuclear Physics SB RAS. As a source of high voltage",
        "a more adequate source has been developed for subsequent ELV-based machines. Its parameters are: voltage - 1200 kV",
        "load current - 20 mA",
        "voltage polarity - positive. New specific requirements are put forward for this rectifier; therefore",
        "its design has a number of differences in comparison to the ELV design. In particular",
        "high voltage is transmitted to the accelerator-tandem over a sectioned feeder that lies within the rectifier column of the source. In order to reduce the overall dimensions of the source in its rectifier sections",
        "a rectification circuit with four times voltage magnification is used. The operating frequency of the primary supply voltage is 1400 Hz. At present",
        "the source has been manufactured",
        "undergoes bench tests and is being prepared for use in the BN'T complex."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa56_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa56.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa56_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA56",
      "page_number": "264",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA57",
      "title": "Beam Scanner Development for Applied Physics Research at NUCLOTRON",
      "authors": [
        "V. Skachkov",
        "A. Golubev",
        "A.V. Kantsyrev",
        "V.A. Panyushkin",
        "O. Sergeeva",
        "ITEP",
        "Moscow",
        "Russia",
        "Scanner for applied physics research at NUCLOTRON accelerator is described. It provides homogeneous irradiation of 200×200 mm target by protons and heavy ions with Z/A= 0.3-0.5 for solving of wide range of applied tasks in the materials science and particle effects mechanisms in biological objects research. The scanner has been optimized for the hardest case: Z/A=0.3",
        "energy - 800 MeV/u",
        "emittance - 40 pi*mm*mrad to operate both in single and multi-frame modes of sample irradiations. The most compact magnetic dipoles have been found as optimization result",
        "which permits to arrange it together with other required elements at NUCLOTRON transport channel. Main characteristics of power supply were obtained and discussed.",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa57_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa57.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa57_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA57",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA58",
      "title": "A Method for Measuring the Positron Lifetime in Solid Matter with a Continuous Positron Beam",
      "authors": [
        "A.A. Sidorin",
        "E.V. Ahmanova",
        "A.G. Kobets",
        "V.V. Kobets",
        "I.N. Meshkov",
        "O. Orlov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "NArFU",
        "Arhangelsk",
        "Russia",
        "V.I. Hilinov",
        "P. Horodek",
        "I.N. Meshkov",
        "K. Siemek",
        "JINR/DLNP",
        "Dubna",
        "Moscow region",
        "Russia",
        "P. Horodek",
        "K. Siemek",
        "IFJ-PAN",
        "Kraków",
        "Poland",
        "IERT",
        "Kharkov",
        "Ukraine",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "The report proposes the scheme and design of the setup for formation a continuous monochromatic positron flux with controlled time of arrival at the target",
        "independent of the injection time in a limited time interval. The setup is designed to perform experiments to measure the positron lifetime with the positron annihilation spectroscopy method (Positron Annihilation Lifetime Spectroscopy - PALS). PALS method allows to distinguish defect types in the materials. It is possible to vary the positron energy in the present version of the setup that allows us to analyze the distribution of defects along the depth of the sample. The scheme of periodic RF voltage generation of a given form and measurement of the positron lifetime",
        "is discussed."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa58_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa58.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa58_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA58",
      "page_number": "267",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA59",
      "title": "Setup for Secondary Electron-Electron Emission Coefficient Study",
      "authors": [
        "O. Orlov",
        "A.G. Kobets",
        "I.N. Meshkov",
        "A.A. Sidorin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "JINR/DLNP",
        "Dubna",
        "Moscow region",
        "Russia",
        "IERT",
        "Kharkov",
        "Ukraine",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Setup for measurement of secondary electron yield from metal surfaces and other materials is developed. This work is related to the known problem of electron cloud formation in the synchrotron vacuum chamber during the beam passage. It is planned to measure the dependence of the SEY on the chamber material type and the structure of the surface of the chamber wall. The developed device allows us to register the spectrum of secondary electrons. reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa59_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa59.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa59_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA59",
      "page_number": "270",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA60",
      "title": "Beam Lines for Gas Filled Separator Experiments at DC280 Cyclotron",
      "authors": [
        "N.Yu. Kazarinov",
        "V. Bashevoy",
        "A. Eremin",
        "G.G. Gulbekyan",
        "G.N. Ivanov",
        "I.V. Kalagin",
        "V.I. Kazacha",
        "N.F. Osipov",
        "V. Utenkov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "Lisov",
        "V.I. Lisovpresenter",
        "JINR/FLNR",
        "Moscow region",
        "Russia",
        "The design of two beam lines for ion transportation from cyclotron DC280 to Gas Filled Separators (GSF) is presented. The beam lines include commutating magnet with variable magnetic field induction up to 1.5 T that gives the possibility to bend ion beams in five directions providing ion transportation through beam lines to five experimental setups. The beam focusing in the beam lines is provided by set of quadrupole lenses having the gradients up to 7.7 T/m. The beam lines are intended for the efficient ion transportation of elements from Helium to Uranium with the atomic mass to charge ratio in the range of 4-7.5 at energies from 4 up to 8 MeV/amu. The ion beam power will reach the value about 3 kW. The water cooled current aperture diaphragms will be installed into all beam lines to prevent the tube damage. The beam diagnostics consists of the Faraday caps (FC)",
        "slit collimators",
        "sector aperture diaphragms and ionization beam profile monitors. A new structure of the beam line #3 and calculation results for 48Ca9+ and 48Ca7+ ion beam transportation from the extraction point to the new gas-filled separator GFS2 are listed. In addition",
        "a new structure of the beam line #4 and calculation results for 48Ca8+",
        "50Ti8+",
        "and 54Cr9+ ion beam transportation from the extraction point to the new GFS3 are presented."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa60_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa60.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa60_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA60",
      "page_number": "272",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA61",
      "title": "Development of the Ion Beams HIPR-1 Transport Channel for Ion Energy Losses Measurement in Plasma Target",
      "authors": [
        "E. Khabibullina",
        "P.A. Fedin",
        "R. Gavrilin",
        "A. Golubev",
        "A.V. Kantsyrev",
        "T. Kulevoy",
        "S.A. Visotski",
        "ITEP",
        "Moscow",
        "Russia",
        "P.A. Fedin",
        "T. Kulevoy",
        "NRC",
        "Moscow",
        "Russia",
        "MEPhI",
        "Moscow",
        "Russia",
        "The research of the processes occurring during interaction of heavy ions with plasma is carried out on the Heavy Ion RFQ HIP-1 (heavy Ion Prototype) in the ITEP. The HIPr-1 is a heavy ion RFQ linac which accelerates ion beams generated by either MEVVA ion source or duoplasmatron. It provides accelerated beam of ions from C+ to U4+ with energy of 101keV/n and several mA of current. Gas-discharge plasma target which was produced in ITEP is used for the measurement of ion energy losses in the ionized matter. The diaphragms at the entrance and exit of the plasma target provide the necessary pressure into the transport channel (which is 10-6 mbar)",
        "while the gas pressure in the target equals to several mbar. The design of the beam transport channel for performing experiments to determine the energy losses in plasma was developed based on the beam dynamics simulation. According to the obtained results the first successful tests on the HIPr-1 were held."
      ],
      "institutions": [],
      "abstract": "reference for this paper ※ https://doi.org/10.18429/JACoW-",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa61_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa61.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa61_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA61",
      "page_number": "276",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA62",
      "title": "Method of Positron Annihilation Spectroscopy for Studies of the Dynamics of Defect Development in the Structure of Metals Subjected to Cavitation and Corrosion Destruction",
      "authors": [
        "NAFU",
        "Arkhangelsk",
        "Russia",
        "※ BibTeX",
        "※ LaTeX",
        "※ Text/Word",
        "※ RIS"
      ],
      "institutions": [],
      "abstract": "The results of experimental studies of the dynamics of the development of defects in the structure of metals used in shipbuilding is presented. The method of the studies is the positron annihilation spectroscopy (PAS). Main goal is to study effect of cavitation and corrosion on stainless steel and helical bronze in hydrodynamic media. reference for this paper using",
      "presentation_url": "https://proceedings.jacow.org/rupac2018/talks/tupsa62_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2018/papers/tupsa62.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2018/posters/tupsa62_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2018-TUPSA62",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    }
  ],
  "paper_count": 59,
  "scrape_time": "2025-10-11 02:25:19"
}