{
  "session_info": {
    "id": "TUPSA",
    "name": "TUPSA - Poster session A",
    "url": "https://proceedings.jacow.org/rupac2014/html/tupsa.htm"
  },
  "papers": [
    {
      "paper_id": "TUPSA01",
      "title": "Trapping of Electron Bunches Injected in a Wake Wave",
      "authors": [
        "JIHT RAS",
        "Moscow",
        "Russia",
        "*S.V. Kuznetsov Plasma Physics Reports",
        "2014",
        "Vol. 40",
        "No. 8",
        "pp. 611–622."
      ],
      "institutions": [],
      "abstract": "The process of electron trapping by a wake wave excited by a laser pulse in a plasma channel in the case where the electron bunches are injected into the vicinity of the maximum of the wakefield potential at a velocity lower than the wave phase velocity is investigated analytically and numerically*. The mechanism for the formation of a compact electron bunch in the trapping region when only the electrons of the injected bunch that are trapped in the focusing phase mainly undergo the subsequent acceleration in the wake field is analyzed. The influence of the spatial dimensions of the injected bunch and its energy spread on the length of the trapped electron bunch and the fraction of trapped electrons is studied. Formulas have been derived that allows one to accurately estimate the length of the trapped electron bunch and the number of electrons in it. It is shown that the influence of the transverse dimensions of the injected bunch on the length of the trapped electron bunch in the accelerating stage is as important as the influence of its longitudinal size.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa01_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa01.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa01_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA01",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA02",
      "title": "Superconducting Unclosed Shields in High Energy Physics",
      "authors": [
        "E.A. Kulikov",
        "G.L. Dorofeev",
        "V.M. Drobin",
        "JINR/VBLHEP",
        "Dubna",
        "Moscow region",
        "Russia",
        "H. Malinowski",
        "A.V. Smirnov",
        "JINR",
        "Dubna",
        "Russia",
        "This paper presents the experimental and theoretical results of studying the unclosed shields made from LTS (low temperature superconductor) and HTS (high temperature superconductor) materials to obtain a homogeneous magnetic field in solenoids. There is a comparison of LTS and HTS shields",
        "the construction peculiarities are described. HTS shield was proposed to obtain the required magnetic field homogeneity (about 10-5) in the 6 meters length solenoid of the electron cooling section which will be installed in the heavy ion collider of the NICA project (JINR",
        "Russia)."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa02_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa02.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa02_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA02",
      "page_number": "39",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA03",
      "title": "Some Perspectives and Estimates of the Accelerator Technique Application",
      "authors": [
        "MEPhI",
        "Moscow",
        "Russia",
        "The short analysis of the current situation in accelerating technique development is done. It is shown that the new stage of this development can be connected with drastically increasing of the energy and the current of the accelerated charged particle beams. The scale of this increasing is discussed. The accelerator technique paradigm changing is connected with the refusing from the well-known accelerating methods and the primary using of the combination of the laser",
        "plasma and the solid state body electromagnetic fields to increase the mentioned above accelerator parameters. In this case for example the perspective power programs can receive a new impulse in their development. That is why the creation of new big scales accelerators can be paid off and the new physics investigation horizons are opened also. The ways to try to do so are discussed and some parameters of such charged particle accelerators and the appropriate resulting estimates are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa03_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa03.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa03_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA03",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA04",
      "title": "Operating Frequency and Accelerating Structure Geometry Chose for the Travelling Wave Compact Electron Linear Accelerator",
      "authors": [
        "E.A. Savin",
        "I.D. Sokolov",
        "MEPhI",
        "Moscow",
        "Russia",
        "For the compact electron linear accelerating structure based on the hybrid scheme which consists from SW biperiodic structure buncher and TW DLS with magnetic couple TW accelerating part",
        "the best option for the operating frequency and cells geometry has been chosen. Comparative calculations for the DLS cells with magnetic couple and without it",
        "on the different operating frequencies and with the different couple coefficient were carried out. The best option will be manufactured",
        "measured and used in the accelerator structure."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa04_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa04.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa04_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA04",
      "page_number": "42",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA05",
      "title": "Three Electrode Electron Gun with the Decreased Anode Voltage Geometry Optimization",
      "authors": [
        "E.A. Savin",
        "S.V. Matsievskiy",
        "N.P. Sobenin",
        "MEPhI",
        "Moscow",
        "Russia",
        "Three electrode gun",
        "consisting of spherical cathode",
        "control electrode and anode",
        "has been designed. Anode potential was varying between 30 kV and 50 kV. For the each potential the control electrode potential has been chosen to achieve the smallest beam crossover in the middle of the first accelerator cell. Calculations was based on the model of the already existing gun – electron injector in the linear accelerator. Then all calculations for the different anode voltages has been repeated for the biger cathode",
        "that means – different cathode electrode geometry. The result to use in the further accelerator calculations has been achieved."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa05_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa05.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa05_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA05",
      "page_number": "45",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA06",
      "title": "Beam Dynamics Calculation in the Induction Linear Accelerator",
      "authors": [
        "MEPhI",
        "Moscow",
        "Russia",
        "Nano",
        "Moscow",
        "Russia",
        "The geometry of the induction electron accelerator",
        "which will be used for high current acceleration",
        "has been calculated. For the different currents values the optimum focusing magnetic field and has been obtained. Also a current in the compensative coil near the cathode has been calculated. The cathode electrode geometry was changing to achieve minimum beam oscillations during the acceleration."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa06_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa06.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa06_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA06",
      "page_number": "48",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA07",
      "title": "Transit Code for Beam Dynamic Simulation",
      "authors": [
        "A.S. Plastun",
        "A. Kolomiets",
        "T. Tretyakova",
        "ITEP",
        "Moscow",
        "Russia",
        "Multiparticle computer code TRANSIT for simulation of intense ion beams in linacs and transport systems is presented. The code is based on experience in design of ion linacs in ITEP. TRANSIT summarizes the most actual and modern methods and algorithms for integration of motion equations including space charge forces. It is being used in ITEP for design and simulation of conventional RFQs",
        "spatially periodic RF focusing linacs",
        "beam transport systems",
        "RF deflectors",
        "etc. The paper presents general description of TRANSIT code and some achieved results."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa07_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa07.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa07_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA07",
      "page_number": "51",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA08",
      "title": "Numerical Study of Beam Current Limit in the I-3 Ion Injector",
      "authors": [
        "A.I. Balabin",
        "N.N. Alexeev",
        "V. Andreev",
        "ITEP",
        "Moscow",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The I-3 injector is used now for acceleration of A/Z=2-5 ions with maximal beam current of 5 mA up to energy of 4Z MeV. Possibility of increase for accelerated beam current is studied by beam dynamics simulation in the LEBT line and accelerating structure taking into account the realistic configuration of focusing and accelerating fields. Results of both beam dynamics and electrodynamics computer simulations for the I-3 accelerating structure that is 2.5 MHz two gap resonator are presented.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa08_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa08.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa08_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA08",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA09",
      "title": "Beam Dynamics Calculations in the Multi-Beam Generator Cavity",
      "authors": [
        "E.A. Savin",
        "S.V. Matsievskiy",
        "N.P. Sobenin",
        "MEPhI",
        "Moscow",
        "Russia",
        "Nano",
        "Moscow",
        "Russia",
        "In the previously designed",
        "calculated and tuned structure of the compact generator-cavity the beam dynamics for the different geometry options has been calculated. The influence of injected beam parameters to the output power value has been overviewed. Also the geometry of the beam tubes and couple coefficient between cavity and the output waveguide has been optimized to reach the maximum output power value."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa09_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa09.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa09_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA09",
      "page_number": "54",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA10",
      "title": "Advanced Optimization of an Low-energy Ion Beam Dynamics at Linac Front-end with RF Focusing",
      "authors": [
        "MEPhI",
        "Moscow",
        "Russia",
        "A design and development of a linac front-end",
        "that guaranties the required beam",
        "quality is an issue of the day. A linac with RF focusing by means of the accelerating field spatial harmonics is suggested as an alternative to RFQ system. Simulation results of the low-energy proton beam dynamics at linac",
        "that takes into account main linac parameter optimization",
        "based on advanced dynamical acceptance calculation",
        "are presented and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa10_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa10.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa10_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA10",
      "page_number": "57",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA11",
      "title": "Longitudinal Dynamics of a  Bunch of Charged Particles in a Traveling Wave Field",
      "authors": [
        "V.K. Baev",
        "B.Y. Bogdanovich",
        "A. Nesterovich",
        "MEPhI",
        "Moscow",
        "Russia",
        "The longitudinal dynamics of a bunch of charged particles in a traveling wave field has been studied. A Lagrange function for this motion is constructed and the Lagrange equation describing longitudinal envelopes of the bunch is derived. The obtained equation describes longitudinal envelopes of a bunch of charged particles. It is advantageous to the well-known equations of envelopes",
        "primarily",
        "in being simple. Additional advantages are as follows. First",
        "the solutions of equation determine not only the longitudinal size of a bunch",
        "but also the width of its energy spectrum. Second",
        "the equation has been derived without any restrictions imposed on the bunch length (phase space dimension)",
        "so that the model is nonlinear and",
        "hence",
        "more general. Third",
        "the equation takes into account the acceleration of a bunch. Finally",
        "Lagrange equation takes into account the force of the intrinsic Coulomb field of a bunch in terms of the naturally included ellipsoid model",
        "so that this envelope equation is self-consistent."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa11_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa11.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa11_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA11",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA12",
      "title": "The User Friendly Interface for BEAMDULAC-RFQ Code",
      "authors": [
        "S.M. Polozov",
        "P.O. Larin",
        "MEPhI",
        "Moscow",
        "Russia",
        "The BEAMDULAC* beam dynamics simulation code is under development at MEPhI Department of Electrophysical Facilities since 1999. Such code includes versions for beam dynamics simulation in a number of accelerating structures as RFQ",
        "DTL",
        "APF",
        "transport channels",
        "ets. The motion equation for each particle is solved selfconsistently in the external fields and the inter-particle Coulomb field simultaneously. The BEAMDULAC code utilizes the cloud-in-cell (CIC) method for accurate treatment of the space charge effects. The external field can be represented analytically",
        "as a series or on the grid. The absence of user friendly interface was the main disadvantage of the code. Last year such interface was developed and will present in the report.",
        "* S.M. Polozov. Problems of Atomic Science and Technology. Series: Nuclear Physics Investigations",
        "3 (79)",
        "2012",
        "p. 131-136."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa12_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa12.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa12_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA12",
      "page_number": "60",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA13",
      "title": "The Interactive Computer Environment for Designing and Tuning of Charged Particle Beams Transport Channels",
      "authors": [
        "LPI",
        "Moscow",
        "Russia",
        "G.P. Averyanov",
        "V.A. Budkin",
        "V.V. Dmitriyeva",
        "I.O. Osadchuk",
        "MEPhI",
        "Moscow",
        "Russia",
        "This paper considers the application package that simulates transport channel of relativistic charged particles. The package provides an interactive mode for the user. It is possible to observe the main parameters of the beam crossing the channel on the PC screen such as envelope and cross-section of the beam at different sections of the channel while changing the main control parameters of the real channel. Enabling of procedures of mathematical programming provides express optimization of control parameters of the channel. The designed package is compact",
        "has a modular structure and can be easily adapted to different software platforms. MATLAB integrated environment is used as instrumental environment",
        "which has a freeware version of this system - SCILAB. Package testing was carried out on the electron synchrotron \"Pakhra\" during the recalibration of the channel of the accelerator working in different modes",
        "which are determined by conducted experiments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa13_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa13.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa13_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA13",
      "page_number": "63",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA14",
      "title": "Mathematical Optimization Model of Longitudinal Beam Dynamics in Klystron-Type Buncher",
      "authors": [
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The paper presents recurrent integral-differential beam evolution model. This model is convenient for mathematical description of specific dynamic processes with due account of particle interaction and electric fields excitation by moving beam. On the basis of this model the problem of beam dynamics optimization is formalized as trajectory ensemble control problem. Analytical expression for quality functional gradient is obtained. Theoretical results are applied for solving problem of beam dynamics optimization in klystron-type buncher.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa14_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa14.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa14_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA14",
      "page_number": "66",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA15",
      "title": "Second Order Method for Beam Dynamics Optimization",
      "authors": [
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia",
        "Saint Petersburg State University",
        "Saint Petersburg",
        "Russia",
        "Methods of beam dynamics optimization of the first order are known and used for beam dynamics optimization*. These method are based on numerical calculation of gradient of functional estimating beam quality. In this report",
        "method of optimization is proposed that includes numerical calculation of the second derivations (Hessian) of the quality functional. Proposed method is applied for a beam in RFQ channel. Control problem is formulated. The propblem consists in minimizing of functional depending on the beam density and on control functions. The control functions are the acceleration efficiency",
        "the synchronous phase",
        "and the channel apperture. For numerical solution the control functions are taken in parameterized form. The process of optimization represents a sequence of steps with use of the first and the second derivatives on parameters",
        "during which the value of the functional decreases.",
        "* D.A. Ovsyannikov",
        "O.I. Drivotin. Modeling of Intensive Charge Particle Beams. St.-Petersburg: Publ. Comp. of St.-Petersburg State Univ.",
        "2003."
      ],
      "institutions": [
        "Funding: This work is supported by St.-Petersburg State University grant #9.38.673.2013."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa15_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa15.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa15_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA15",
      "page_number": "69",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA16",
      "title": "Electron Gun with Adiabatic Plasma Lens",
      "authors": [
        "A.A. Drozdovsky",
        "A.V. Bogdanov",
        "S.A. Drozdovsky",
        "R. Gavrilin",
        "A. Golubev",
        "I. Roudskoy",
        "S.M. Savin",
        "V.V. Yanenko",
        "ITEP",
        "Moscow",
        "Russia",
        "For researches on plasma physics has been designed and constructed the electronic gun with the cold cathode on energy about 250 keV. The electron beam have the parameters: time width of pulses 100 ns",
        "current amplitude 100 A. The adiabatic plasma lens is used to reduce the beam size to the demanded value. The results of tests are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa16_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa16.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa16_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA16",
      "page_number": "72",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA17",
      "title": "Axial Injection to a Compact Cyclotron with High Magnetic Field",
      "authors": [
        "V.L. Smirnov",
        "S.B. Vorozhtsov",
        "JINR/DLNP",
        "Dubna",
        "Moscow region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "One of advantages of a compact cyclotron over other type accelerators is a small size mainly defined by the facility’s bending magnetic field. In such cyclotrons an application of an external injection is required in some cases. But for high magnetic field of the cyclotrons (over 4-5 T) there appears a severe problem to make the 1st turns in the machine with external injection of accelerated particles. This paper describes a proposal of a new central region structure of a compact cyclotron that permits one to successfully solve the problem of the axial injection into such a facility using a spiral inflector.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa17_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa17.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa17_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA17",
      "page_number": "75",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA18",
      "title": "Complex Shunt Impedance and Beam-RF Cavity Interaction",
      "authors": [
        "LPI",
        "Moscow",
        "Russia",
        "Two approaches usually are used to describe beam-cavity interaction in accelerator based applications. The first one is electro dynamical and uses Maxwell equations to derive appropriate equations",
        "field modes expressions being necessary to calculate field amplitudes excited by moving charges in the cavity. The other one uses LC circuit to derive appropriate equations for voltage amplitude induced in cavity by accelerated bunches",
        "thin accelerating gap to some extent being not fully correctly defined representation in such approach. In this paper",
        "the expressions are derived that describe beam-RF cavity interactions in terms of so called complex shunt impedance",
        "strict electro dynamical approach being used in calculations. It is shown that complex shunt impedance module coincides completely with usual shunt impedance definition that up to now is used widely to describe rf cavity efficiency. The physical sense of its phase is given in the paper as well. Both complex shunt impedance module and its phase can be calculated or measured experimentally."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa18_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa18.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa18_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA18",
      "page_number": "77",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA19",
      "title": "Low Energy Electron Beam Line at Lebedev Physical Institute Accelerator Complex",
      "authors": [
        "LPI",
        "Moscow",
        "Russia",
        "Microtron with the energy 7 MeV and beam current up to 30 mA is used as injector to electron synchrotron since 1974-th year. Several last years it is used to supply with electron beam the nuclear physics experiments as well. New experiments in the field of solid state physics are planed. Although there are two experimental halls at the accelerator complex environment experiments for the cost considerations where carried near to microtron",
        "and this results in enhanced background. To make it possible to carry out several experiments at the same time in more comfortable conditions with minimum background the beam line from microtron to experimental hall with several end stations is under development. Followed are this beam line design features."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa19_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa19.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa19_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA19",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA20",
      "title": "Output Energy Variation in the SC Linac for the Proton Radiotherapy",
      "authors": [
        "I.A. Ashanin",
        "S.M. Polozov",
        "A.V. Samoshin",
        "MEPhI",
        "Moscow",
        "Russia",
        "Current success of the superconducting linear accelerators based on independently phased SC cavities gives a seriously reason to consider such structure in proton radiotherapy. Superconductivity allow to solve at once some problems concerned with a low rate of energy gain",
        "high length",
        "higher capacity losses and higher cost of the proton linear accelerator subsequently. One of the traditional aims of such facilities is receiving of the beam energy about 240 MeV with possibility of fluently regulation in range from 150 to 240 MeV that responds to irradiate the tumors located at different depth. The possibility of beam energy variation by means of RF field phase in last resonators and number of the resonator turn-off becomes the major advantage of the proton SC linac. The optimal choice of accelerator parameters and the beam dynamics simulation results with using BEAMDULAC-SCL code will presented*. Methods of the output energy variation with beam quality preservation in the proton SC linac will discussed."
      ],
      "institutions": [],
      "abstract": "* A.V. Samoshin. Proc. of",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa20_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa20.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa20_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA20",
      "page_number": "80",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA21",
      "title": "Beam Formation for Different Energies on the Target of INR Isotope Complex with the Transverse Phase Space Parameters Demanded",
      "authors": [
        "V.A. Moiseev",
        "S. Bragin",
        "A. Feschenko",
        "A.N. Mirzojan",
        "O. Volodkevich",
        "RAS/INR",
        "Moscow",
        "Russia",
        "The main problem was to get the same transverse phase space parameters on the isotope target for the different proton beam energies within a large deviation range. Two matching parts placed on the linear accelerator structure were used. The data of the transverse phase space parameters depending on the focusing structure of the isotope complex transport line were calculated at the point before the dipole of isotope line rejection. The beam dynamics restrictions were used for simulations. The crossing of the transverse phase spaces for different beam energies permits to get the reliable solutions for transverse beam dynamics with the identical supply currents",
        "which are used for the transverse focusing on the linear accelerator structure both for simulations and experiments."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa21_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa21.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa21_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA21",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA22",
      "title": "Design of 14 MeV APF Linac",
      "authors": [
        "V.V. Altsybeyev",
        "D.A. Ovsyannikov",
        "St. Petersburg State University",
        "St. Petersburg",
        "Russia",
        "A approach based on combination of gradient optimization methods and genetic algorithm to obtain the parameters of APF linac is suggested. As an example",
        "the parameters of 14 MeV 10 mA deuteron linac are presented."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa22_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa22.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa22_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA22",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA23",
      "title": "LEPTA - the Facility for Fundamental and Applied Research",
      "authors": [
        "E.V. Ahmanova",
        "V.M. Drobin",
        "P. Horodek",
        "A.G. Kobets",
        "I.N. Meshkov",
        "O. Orlov",
        "A.Yu. Rudakov",
        "V.V. Seleznev",
        "A.A. Sidorin",
        "S. Yakovenko",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "NAFU",
        "Arkhangelsk",
        "Russia",
        "Storage ring of LEPTA facility was commissioned in September 2004 and was under development up to now. The positron injector has been constructed in 2005-2010",
        "and beam transfer channel – in 2011. By the end of August 2011 experiments on electron and positron injection into the ring have been started. The last results are presented in this report: studies of e+/e− dynamics in trap",
        "e+ beam in the ring",
        "LEPTA upgrade (vacuum",
        "e+ source with cryocooler)",
        "Channel for PAS."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa23_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa23.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa23_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA23",
      "page_number": "83",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA24",
      "title": "Project of Electron Cooler for NICA Collider",
      "authors": [
        "A.A. Sidorin",
        "E.V. Ahmanova",
        "A.G. Kobets",
        "I.N. Meshkov",
        "O. Orlov",
        "A.Yu. Rudakov",
        "V.I. Shokin",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "IERT",
        "Kharkov",
        "Ukraine",
        "JINR/DLNP",
        "Dubna",
        "Moscow region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Electron cooling system (ECS) of the NICA collider is designed to form the required parameters of the ion beam at energy of the experiment in the range of 1 - 4.5 GeV/amu that requires energy cooling electrons from 0.5 to 2.5 MeV. To achieve the required energy of the electrons all elements of ECS are placed in tanks filled with sulfur hexafluoride (SF6) under pressure of 6 atm. For testing items ECS elements the test bench \"Recuperator\" is used. This paper presents the results of testing the prototype elements of the ECS and the first results of technical design of ECS.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa24_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa24.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa24_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA24",
      "page_number": "85",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA25",
      "title": "Acceleration of the Oppositely Charged Particles in the Single Stream",
      "authors": [
        "Allrussian Electrotechnical Institute",
        "Moskow",
        "Russia",
        "One of the problems arising at extraction of heavy ions from plasma is removal of electrons from a stream of particles. Therefore possibility of simultaneous acceleration in one direction as ions (electric field)",
        "and electrons (pressure gradient) is represented rather interesting. In work when using the hydrodynamic description in the accelerating interval conditions of cold ions and hot electrons are studied. Possibility of excess by ions of speed of an ionic sound is shown",
        "and the ratio of sizes of streams of be any."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa25_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa25.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa25_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA25",
      "page_number": "88",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA26",
      "title": "Electrodes Form Optimization of RF Deflecting System Wobbler for FAIR Project",
      "authors": [
        "A. Sitnikov",
        "A. Golubev",
        "T. Kulevoy",
        "S.A. Visotski",
        "ITEP",
        "Moscow",
        "Russia",
        "The new method for high energy density states in matter investigation",
        "which based on irradiation of combined target by hollow high energy heavy ion beam was proposed in the Institute for theoretical and experimental physics (ITEP). The target consists of a sample of matter at the center and a hollow shell around it. The experiment of high energy density states generation will be carry on at FAIR project. The RF deflecting system (Wobbler) for hollow high energy heavy ion U28+ beam with kinetic energy Wk=1 GeV/n formation is developing at ITEP. The current results of electrodes form optimization for RF deflecting system (Wobbler) which is developing at ITEP for FAIR project are shown in this paper."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa26_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa26.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa26_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA26",
      "page_number": "91",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA27",
      "title": "The First Design of Medium Resolution Mass Spectrometer (MRMS) High Voltage Platform in a SPES Project",
      "authors": [
        "ITEP",
        "Moscow",
        "Russia",
        "M.F. Moisio",
        "C. R. Roncolato",
        "INFN/LNL",
        "Legnaro (PD)",
        "Italy",
        "A new project of 150 kV high voltage platform (HVP) is developed in a Laboratori Nazionali di Lagnaro as part of SPES (Selective Production of Exotic Species) project for the production of the multiply charged RIB (rare ion beams). The HVP will be located after ECR ion source charge breeder. Medium resolution mass spectrometer (MRMS) is installed at the platform to provide high purity beams with mass resolution about 1/1000. The Draft of platform design including all beamline elements is discussed. There is a several way of feeding equipment on HVP proposed",
        "required engineering services parameters (vacuum system",
        "cooling system",
        "power system and etc) were defined. Some safety measures are proposed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa27_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa27.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa27_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA27",
      "page_number": "94",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA28",
      "title": "The Advanced Nanostructure Steel Modification by Gas Ions Beams",
      "authors": [
        "S.L. Andrianov",
        "B.B. Chalykh",
        "P.A. Fedin",
        "B. Kondratiev",
        "A.V. Kozlov",
        "R.P. Kuibeda",
        "T. Kulevoy",
        "A.A. Nikitin",
        "S.V. Rogozhkin",
        "A. Sitnikov",
        "ITEP",
        "Moscow",
        "Russia",
        "New constriction materials are under developing for the energy sector. They will provide: energy prodaction",
        "store and transportation with high efficiency and ecology safety. One of the main modern direction of new materials developing are nanostructures steel which consolidation oxide dispersion strengthened (ODS). ODS and EK-181 steels have high hot",
        "radiation and corrosion resistance. The experimental program for investigation of nanoclusters generation and growth (in ODS steels) under irradiation of N (and also Ti",
        "V) ion beams is ongoing in ITEP. Ion irradiation is performed at the accelerator complex TIPr with gas ion source duoplasmatron. In this article the source installation and it's power systems development of",
        "as well as the results of ion beam charge state distribution measurements and the first results of ODS materials irradiation by gas ions are described and discussed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa28_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa28.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa28_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA28",
      "page_number": "97",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA29",
      "title": "Method of Broadband Stabilization of the VEPP-4M Main Field",
      "authors": [
        "A.V. Pavlenko",
        "A.M. Batrakov",
        "G.V. Karpov",
        "I.B. Nikolaev",
        "V.V. Svishchev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "NSU",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The stability of the main field has great influence on precision experiments on particle physics which are performed on VEPP-4M facility currently. A method of broadband stabilization of the VEPP-4M main field allowing us to achieve field stability better than 0.5 ppm over DC - 50Hz frequency range is presented. The method combines NMR stabilization and feedback loop using induction signal.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa29_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa29.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa29_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA29",
      "page_number": "100",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA30",
      "title": "Analysis of the Magnetic Field Distribution of PMQ Lenses for PRIOR Setup",
      "authors": [
        "V.A. Panyushkin",
        "A.V. Bogdanov",
        "A. Golubev",
        "A.V. Kantsyrev",
        "V. Skachkov",
        "ITEP",
        "Moscow",
        "Russia",
        "MEPhI",
        "Moscow",
        "Russia",
        "P.M. Lang",
        "M.E. Rodionova",
        "L. Shestov",
        "D. Varentsov",
        "K. Weyrich",
        "GSI",
        "Darmstadt",
        "Germany",
        "As part of the FAIR project",
        "HEDgeHOB collaboration involves developments of PRIOR* proton-radiographic facilities",
        "one of the purposes of which is to study the state of matter in extreme conditions. In the currently in GSI (Darmstadt",
        "Germany)",
        "prototype of PRIOR proton microscope setup is developing",
        "this setup designed for the use of proton beam with energy of 4.5 GeV. Magnetic optics of PRIOR proton microscope forming section consists of four quadrupole lenses created on the basis of permanent magnets (PMQ). For best quality (linearity",
        "magnetic axis position",
        "angle of median plane) of the magnetic field of quadrupole lenses and a full-scale setup simulation is necessary to measure the magnetic field inside the lenses. For the measurement of the magnetic field (radial component of the magnetic field) of quadrupole lenses are designed and developed magnetic field scanner. Scanning of the magnetic field is performed on cylindrical surface near the inner surface of PMQ lenses. Based on the results of scanning the radial component of the magnetic field will be carried out calculations of the mathematical model (developed in ITEP)**",
        "which describes the distribution of the magnetic field at any point within the aperture of the lens. In this work presents the results of the calculation of all components of the magnetic field",
        "determining the position of the magnetic axis",
        "harmonic analysis and the analysis of non-linearity of the magnetic field for PRIOR PMQ lenses.",
        "*D. Varenstov et.al.; PRIOR for GSI and for FAIR; 4th International Workshop on HEPM",
        "2013  **V.S. Skachkov et.al.; REPM Quadrupole for Proton Microscopy; 2th International Workshop on HEPM",
        "2010"
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa30_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa30.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa30_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA30",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA31",
      "title": "Magnetic System of Isochronous Cyclotron F250 for Proton Therapy Applications",
      "authors": [
        "Yu.G. Alenitsky",
        "E. Samsonov",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "JINR/DLNP",
        "Dubna",
        "Moscow region",
        "Russia",
        "In the Laboratory of Nuclear Problems of the JINR the possibility of designing of the isochronous cyclotron F250 with the energy of protons 250 MeV on the basis of magnet with the diameter of pole 6 m",
        "which is used for the synchro-cyclotron is examined. Synchro-cyclotron many years works for obtaining the protons with the energy 680 MeV and with the intensity of extracted beam 2.5 mkA. For the solution of medical problems the required energy of protons comprises not more than 250 MeV and depends on the depth of the tumor arrangement inside a patient. For determining the required energy of protons the information about the mean free path of protons in the correspondence for the position of Bragg's peak in each case is used. Necessary energy of protons is obtained by means of degrader system providing a retarding the extracted beam of protons with 680 MeV to 250 MeV and less. In this case the utilized for medical purposes intensity of beam does not exceed 50 nA. The proposed cyclotron F250 will make it possible to strongly decrease the electric power of magnet and to avoid the need of beam degradation from 680 MeV to 250 MeV. For creating the required magnetic field of the cyclotron F250 it is necessary to change the form of steel spiral shims and disks",
        "located inside a vacuum chamber of synchro-cyclotron. The basic parameters of the magnetic system of the cyclotron F250 with the condition of retaining the vacuum chamber and the magnet yoke of synchro-cyclotron are given."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa31_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa31.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa31_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA31",
      "page_number": "103",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA32",
      "title": "Magnetic Field Design and Calculation for the FLNR DC-280 Cyclotron",
      "authors": [
        "I.A. Ivanenko",
        "B. Gikal",
        "G.G. Gulbekyan",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia",
        "T.F. Belyakova",
        "V.P. Kukhtin",
        "E.A. Lamzin",
        "S.E. Sytchevsky",
        "NIIEFA",
        "St. Petersburg",
        "Russia"
      ],
      "institutions": [],
      "abstract": "The isochronous cyclotron DC-280 is intended to accelerate the ion beams with A/Z from 4 to 7 up to the energy 8 – 4 MeV/nucleon. The wide range of the magnetic field levels from 0.64T till 1.32T allows to make a smooth variation of the beam energy over the range ±50% from nominal. For operational optimization of the magnetic field the 11 radial and 4 pairs of harmonic correcting coils are used. The numerical formation of the magnetic field is carried out. The problems and solutions of DC-280 magnetic field design are described.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa32_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa32.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa32_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA32",
      "page_number": "105",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA33",
      "title": "Horizontal Klystron Cathode Heater Power Supply System for the European XFEL",
      "authors": [
        "P.A. Bak",
        "A.A. Korepanov",
        "A.V. Ottmar",
        "N.A. Zolotukhina",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "A. Cherepenko",
        "V. Vogel",
        "DESY",
        "Hamburg",
        "Germany",
        "The European XFEL project will employ L-band multibeam horizontal klystrons (MBK) from companies Toshiba (E3736) and Thales (TH 1802). Using the horizontal type of klystrons will significantly reduce construction costs of XFEL tunnel",
        "but due to the large weights and dimensions of the pulse transformers and klystrons requires far more complicated mechanism to connect the klystrons and the pulse transformers inside the tunnel. It was proposed to make these connections by using flexible HV cable. BINP has developed an intermediate oil tank",
        "connection module (CM)",
        "which on one side is connected to the cathode of klystron and on the other side has a HV connector for the connection to the pulse transformer. The connection module mechanically consists of two assemblies. The first is the oil tank that has inside an insulated filament transformer and measurement system. The second is the high frequency power supply unit (HFPS) what can be up to 20 meters away from the oil tank. The insulating transformer is designed by unique technology of the coupled resonant circuits with a high-voltage gap of 49 mm and coupling factor ~0.6. Its working frequency is about 1.6 kHz. The efficiency is gained about 90%",
        "and maximum electric field intensity does not exceed 35 kV/cm. In this paper we give an overview of the design and the test results of the horizontal klystron cathode heater power supply system based on using HV insulating transformer with coupling factor <1."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa33_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa33.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa33_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA33",
      "page_number": "",
      "presentation_available": false,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA34",
      "title": "The Power Supply System of Electrostatic Deflecting Plates for Accelerating Complex NICA",
      "authors": [
        "A.A. Fateev",
        "E.V. Gorbachev",
        "N.I. Lebedev",
        "JINR",
        "Dubna",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Three pairs of electrostatic deflecting plates will be placed in the booster ring. They will provide injection of heavy ion beam into the Booster. The power supply system for one plate providing all necessary parameters including suppression of the afterpulses is described in the report. The calculated and experimental results are also presented.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa34_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa34.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa34_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA34",
      "page_number": "108",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA35",
      "title": "Virtual Laboratory of Vacuum Technique",
      "authors": [
        "G.P. Averyanov",
        "V.V. Dmitriyeva",
        "V.L. Shatokhin",
        "MEPhI",
        "Moscow",
        "Russia",
        "The report considers the interactive computer modeling of vacuum systems. Operation of real vacuum installations is modeled by simulating computer code. It becomes possible in a short time (with the assessment of real-time) to pass through full cycle of the technologies to reach high vacuum state and to estimate the necessary time. It is possible to assemble virtual installation",
        "to choose the necessary pumps (from the database of low-vacuum and high-vacuum ones)",
        "to select the vacuum connecting pipes with the required parameters. The vacuum chamber volume and its internal surfaces characteristics (roughness",
        "types of preliminary processing)",
        "defining outgassing from these surfaces are set. Possible leakage in junction places of the individual elements of the system could be taken into consideration. After pumping start",
        "sequential switching on of different pumps and achievement of a certain pressure",
        "possibility of chamber preheating up to the necessary temperature is provided. During the analysis of procedure of pumping optimization of the structure of system and the selected elements is made. The computer laboratory is a part of traditional laboratory of vacuum technique of the Department of Electrophysical Facilities of NRNU MEPhI. Modeling of vacuum systems significantly expands the functional capabilities of this laboratory."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa35_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa35.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa35_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA35",
      "page_number": "110",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA36",
      "title": "Measurement of the Dose Rate and the Radiation Spectrum of the Interaction of 2 MeV Proton Beam with a Variety of Structural Materials",
      "authors": [
        "D.A. Kasatov",
        "A.N. Makarov",
        "I.M. Shchudlo",
        "S.Yu. Taskaev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia",
        "The paper presents the results of measurements of the spectrum and the radiation dose during irradiation of different construction materials with 2 MeV proton beam. There are shown the spectra of the induced activity of a number of materials and signals from the neutron detector. Based on the obtained results it is made the optimal choice of the target material",
        "on which it is deposited a thin layer of lithium to generate epithermal neutrons used for boron neutron capture therapy of malignant tumors. Recommendations are given for materials desirable to use inside the high-energy beam transporting channel to reduce the dose of concomitant radiation."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa36_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa36.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa36_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA36",
      "page_number": "113",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA37",
      "title": "Measurement of the Spatial Distribution of Gamma Radiation at Tandem Accelerator with Vacuum Insulation",
      "authors": [
        "I.M. Shchudlo",
        "D.A. Kasatov",
        "A.N. Makarov",
        "S.Yu. Taskaev",
        "BINP SB RAS",
        "Novosibirsk",
        "Russia"
      ],
      "institutions": [],
      "abstract": "In BINP the source of epithermal neutrons for BNCT based on the tandem accelerator with vacuum insulation and a lithium target was created and operates. The paper presents the study of the spatial distribution of the X-ray emission produced by the interaction of accelerated electrons with the materials of construction of the accelerator.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa37_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa37.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa37_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA37",
      "page_number": "116",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "TUPSA38",
      "title": "Estimation of the Efficiency of Biological Shielding for the Circular Hall of U-70 Accelerator at IHEP",
      "authors": [
        "O.V. Sumaneev",
        "G.I. Britvich",
        "M.Y. Kostin",
        "V.A. Pikalov",
        "IHEP",
        "Moscow Region",
        "Russia"
      ],
      "institutions": [],
      "abstract": "Report presents estimation of biological shielding efficiency for annular hall of U-70 accelerator. Distribution of neutron flux in concrete shielding of proton accelerator measurements carried out by method of long-lived isotopes specific activity determination. The experimental data may be compared with Monte-Carlo simulation.",
      "presentation_url": "https://proceedings.jacow.org/rupac2014/talks/tupsa38_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/rupac2014/papers/tupsa38.pdf",
      "poster_url": "https://proceedings.jacow.org/rupac2014/posters/tupsa38_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-RUPAC2014-TUPSA38",
      "page_number": "118",
      "presentation_available": false,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 38,
  "scrape_time": "2025-10-11 02:50:26"
}