{
  "session_info": {
    "id": "FRXGBE",
    "name": "FRXGBE - MC5 Orals",
    "url": "https://proceedings.jacow.org/ipac2018/html/frxgbe.htm"
  },
  "papers": [
    {
      "paper_id": "FRXGBE1",
      "title": "Generation of High-Power, Tunable THz Radiation from Laser Interaction with a Relativistic Electron Beam",
      "authors": [
        "SLAC",
        "Menlo Park",
        "California",
        "USA",
        "This invited talk proposes a method based on the slice energy spread modulation to generate strong subpicoseond density bunching in high-intensity relativistic electron beams. A laser pulse with periodic intensity envelope is used to modulate the slice energy spread of the electron beam",
        "which can then be converted into density modulation after a dispersive section. It is found that the double-horn slice energy distribution of the electron beam induced by the laser modulation is very eﬀective to increase the density modulation. Since the modulation is performed on a relativistic electron beam",
        "the process does not suﬀer from strong space charge force or coupling between phase spaces. We show in both theory and simulations that the tunable radiation from the modulated beam can cover the frequency range of 1 ∼ 20 THz with high power and narrow-band spectra. This method can be used in storage ring or even thermal-cathode injectors with high-repetition rate. Experimental results will be reviewed."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/frxgbe1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/frxgbe1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/frxgbe1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-FRXGBE1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": false,
      "poster_available": false
    },
    {
      "paper_id": "FRXGBE2",
      "title": "Muon Beam Dynamics and Spin Dynamics in the g-2 Storage Ring",
      "authors": [
        "D. L. Rubin",
        "A.T. Chapelain",
        "Cornell University (CLASSE)",
        "Cornell Laboratory for Accelerator-Based Sciences and Education",
        "Ithaca",
        "New York",
        "USA",
        "S. Charity",
        "J. Price",
        "The University of Liverpool",
        "Liverpool",
        "United Kingdom",
        "J.D. Crnkovic",
        "W. Morse",
        "V. Tishchenko",
        "BNL",
        "Upton",
        "Long Island",
        "New York",
        "USA",
        "Regis University",
        "Denver",
        "USA",
        "BUphy",
        "Boston",
        "Massachusetts",
        "USA",
        "UMiss",
        "University",
        "Mississippi",
        "USA",
        "The goal of the new g-2 experiment at fermilab is a measurement of the anomalous magnetic moment of the muon",
        "with uncertainty of less than 140 ppb. The experimental method is to store a beam of polarized muons in a storage ring with pure vertical dipole field and electrostatic focusing",
        "and to measure the precession frequency. Control of the systematics depends on unprecedented knowledge of the details of the phase space of the muon distribution. That knowledge is derived from direct measurements with scintillating fiber detectors that are inserted into the muon beam for diagnostic measurements",
        "traceback straw tube tracking chambers",
        "as well as the calorimeters that measure energy",
        "time and position of the decay positrons. The interpretation of the measurements depends on a detailed model of the storage ring guide field. This invited talk presents results of studies of the distribution from the commissioning run of the experiment."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/frxgbe2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/frxgbe2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/frxgbe2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-FRXGBE2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "FRXGBE3",
      "title": "First Demonstration of Ionization Cooling in MICE",
      "authors": [
        "IIT",
        "Chicago",
        "Illinois",
        "USA"
      ],
      "institutions": [
        "The Muon Ionization Cooling Experiment (MICE) at Rutherford Appleton Laboratory has studied ionization cooling of muons. Several million individual muon tracks have been recorded passing through a series of focusing magnets and a liquid hydrogen or lithium hydride absorber in a variety of magnetic configurations. Identification and measurement of muon tracks upstream and downstream of the absorber are used to study the evolution of the 4D (transverse) emittance. This paper presents and discusses these results."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2018/talks/frxgbe3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2018/papers/frxgbe3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2018/posters/frxgbe3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2018-FRXGBE3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:40:42"
}