{
  "session_info": {
    "id": "WEOBB",
    "name": "WEOBB - Contributed Oral Presentations, Novel Particle Sources & Accelerations Techniq.",
    "url": "https://proceedings.jacow.org/ipac2017/html/weobb.htm"
  },
  "papers": [
    {
      "paper_id": "WEOBB1",
      "title": "Recirculated Electron Beam Photo-Converter for Rare Isotope Production",
      "authors": [
        "A. Laxdal",
        "R.A. Baartman",
        "I.V. Bylinskii",
        "S. Ganesh",
        "A. Gottberg",
        "F.W. Jones",
        "P. Kunz",
        "L.A. Lopera",
        "T. Planche",
        "A. Sen",
        "TRIUMF",
        "Vancouver",
        "Canada",
        "The TRIUMF 50 MeV electron linac has the potential to drive cw beams of up to 0.5 MW to the ARIEL photo-fission facility for rare isotope science. Due to the cooling requirements",
        "the use of a thick Bremsstrahlung target for electron to photon conversion is a difficult technical challenge in this intensity regime. Here we present a different concept in which electrons are injected into a small storage ring to make multiple passes through a thin internal photo-conversion target",
        "eventually depositing their remaining energy in a cooled central core absorber. We discuss the design requirements and propose a set of design parameters for the Fixed Field Alternating Gradient (FFAG) ring. Using particle simulation models",
        "we estimate various beam properties",
        "as well as the MPS for the electron loss."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/weobb1_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/weobb1.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/weobb1_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEOBB1",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOBB2",
      "title": "Beam Commissioning of the High Intensity Proton Source Developed at INFN-LNS for the European Spallation Source",
      "authors": [
        "L. Neri",
        "L. Allegra",
        "A. Amato",
        "G. Calabrese",
        "A.C. Caruso",
        "G. Castro",
        "L. Celona",
        "F. Chines",
        "G. Gallo",
        "S. Gammino",
        "O. Leonardi",
        "A. Longhitano",
        "G. Manno",
        "S. Marletta",
        "D. Mascali",
        "M. Mazzaglia",
        "A. Miraglia",
        "S. Passarello",
        "G. Pastore",
        "A. Seminara",
        "A. Spartà",
        "G. Torrisi",
        "S. Vinciguerra",
        "INFN/LNS",
        "Catania",
        "Italy",
        "At the Istituto Nazionale di Fisica Nucleare Laboratori Nazionali del Sud (INFN-LNS) the beam commissioning of the high intensity Proton Source for the European Spallation Source (PS-ESS) started in November 2016. Beam stability at high current intensity is one of the most important parameter for the first steps of the ongoing commissioning. Promising results were obtained since the first source start with a 6 mm diameter extraction hole. The increase of the extraction hole to 8 mm allowed improving PS-ESS performances and obtaining the values required by the ESS accelerator. In this work",
        "extracted beam current characteristics together with Doppler shift and emittance measurements are presented",
        "as well as the description of the next phases before the installation at ESS in Lund."
      ],
      "institutions": [],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/weobb2_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/weobb2.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/weobb2_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEOBB2",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    },
    {
      "paper_id": "WEOBB3",
      "title": "Advancement of an Accelerator-Driven High-Brightness Source for Fast Neutron Imaging",
      "authors": [
        "B. Rusnak",
        "O. Alford",
        "G.G. Anderson",
        "S.G. Anderson",
        "D.L. Bleuel",
        "J.A. Caggiano",
        "M.L. Crank",
        "S.E. Fisher",
        "P. Fitsos",
        "D.J. Gibson",
        "M. Hall",
        "D.J. Jamero",
        "M.S. Johnson",
        "L. Kruse",
        "K.S. Lange",
        "R.A. Marsh",
        "D. P. Nielsen",
        "J.D. Sain",
        "R. Souza",
        "A. Wiedrick",
        "LLNL",
        "Livermore",
        "California",
        "USA",
        "Lawrence Livermore National Lab (LLNL) is building an intense",
        "high-brightness fast neutron source to create millimeter-scale neutron radiographs and images. An intense source (1011 n/s/sr at 0 degrees) of fast neutrons (10 MeV) allows for penetrating very thick",
        "dense objects while preserving the ability to create good image contrast in low density features within the object and maintaining high detector response efficiency. Fast neutrons will be produced using a pulsed 7 MeV",
        "300 microamp average-current commercial ion accelerator that will deliver deuteron bunches to a 3 atmosphere deuterium gas cell target to produce neutrons by the D(d",
        "n)3He reaction. Due to the high power density of such a tightly focused",
        "modest-energy ion beam",
        "the transport",
        "controls",
        "diagnostics",
        "and in particular the neutron production gas target and beam stop approaches present significant engineering challenges. Progress and status on the building and early commissioning of the lab-scale demonstration machine shall be presented."
      ],
      "institutions": [
        "Funding: This work performed under the auspices of the U. S. Department of Energy by Lawrence Livermore National Laboratory under contract DE-AC52-07NA27344."
      ],
      "abstract": "",
      "presentation_url": "https://proceedings.jacow.org/ipac2017/talks/weobb3_talk.pdf",
      "paper_url": "https://proceedings.jacow.org/ipac2017/papers/weobb3.pdf",
      "poster_url": "https://proceedings.jacow.org/ipac2017/posters/weobb3_poster.pdf",
      "doi": "https://doi.org/10.18429/JACoW-IPAC2017-WEOBB3",
      "page_number": "",
      "presentation_available": true,
      "paper_available": true,
      "poster_available": false
    }
  ],
  "paper_count": 3,
  "scrape_time": "2025-10-10 19:51:50"
}